{
    "original": {
        "text": "The name of Mr. Vholes, preceded by the legend Ground-Floor, is inscribed upon a door-post in Symond's Inn, Chancery Lane--a little, pale, wall-eyed, woebegone inn like a large dust-binn of two compartments and a sifter. It looks as if Symond were a sparing man in his way and constructed his inn of old building materials which took kindly to the dry rot and to dirt and all things decaying and dismal, and perpetuated Symond's memory with congenial shabbiness. Quartered in this dingy hatchment commemorative of Symond are the legal bearings of Mr. Vholes.\nMr. Vholes's office, in disposition retiring and in situation retired, is squeezed up in a corner and blinks at a dead wall. Three feet of knotty-floored dark passage bring the client to Mr. Vholes's jet-black door, in an angle profoundly dark on the brightest midsummer morning and encumbered by a black bulk-head of cellarage staircase against which belated civilians generally strike their brows. Mr. Vholes's chambers are on so small a scale that one clerk can open the door without getting off his stool, while the other who elbows him at the same desk has equal facilities for poking the fire. A smell as of unwholesome sheep blending with the smell of must and dust is referable to the nightly (and often daily) consumption of mutton fat in candles and to the fretting of parchment forms and skins in greasy drawers. The atmosphere is otherwise stale and close. The place was last painted or whitewashed beyond the memory of man, and the two chimneys smoke, and there is a loose outer surface of soot everywhere, and the dull cracked windows in their heavy frames have but one piece of character in them, which is a determination to be always dirty and always shut unless coerced. This accounts for the phenomenon of the weaker of the two usually having a bundle of firewood thrust between its jaws in hot weather.\nMr. Vholes is a very respectable man. He has not a large business, but he is a very respectable man. He is allowed by the greater attorneys who have made good fortunes or are making them to be a most respectable man. He never misses a chance in his practice, which is a mark of respectability. He never takes any pleasure, which is another mark of respectability. He is reserved and serious, which is another mark of respectability. His digestion is impaired, which is highly respectable. And he is making hay of the grass which is flesh, for his three daughters. And his father is dependent on him in the Vale of Taunton.\nThe one great principle of the English law is to make business for itself. There is no other principle distinctly, certainly, and consistently maintained through all its narrow turnings. Viewed by this light it becomes a coherent scheme and not the monstrous maze the laity are apt to think it. Let them but once clearly perceive that its grand principle is to make business for itself at their expense, and surely they will cease to grumble.\nBut not perceiving this quite plainly--only seeing it by halves in a confused way--the laity sometimes suffer in peace and pocket, with a bad grace, and DO grumble very much. Then this respectability of Mr. Vholes is brought into powerful play against them. \"Repeal this statute, my good sir?\" says Mr. Kenge to a smarting client. \"Repeal it, my dear sir? Never, with my consent. Alter this law, sir, and what will be the effect of your rash proceeding on a class of practitioners very worthily represented, allow me to say to you, by the opposite attorney in the case, Mr. Vholes? Sir, that class of practitioners would be swept from the face of the earth. Now you cannot afford--I will say, the social system cannot afford--to lose an order of men like Mr. Vholes. Diligent, persevering, steady, acute in business. My dear sir, I understand your present feelings against the existing state of things, which I grant to be a little hard in your case; but I can never raise my voice for the demolition of a class of men like Mr. Vholes.\" The respectability of Mr. Vholes has even been cited with crushing effect before Parliamentary committees, as in the following blue minutes of a distinguished attorney's evidence. \"Question (number five hundred and seventeen thousand eight hundred and sixty-nine): If I understand you, these forms of practice indisputably occasion delay? Answer: Yes, some delay. Question: And great expense? Answer: Most assuredly they cannot be gone through for nothing. Question: And unspeakable vexation? Answer: I am not prepared to say that. They have never given ME any vexation; quite the contrary. Question: But you think that their abolition would damage a class of practitioners? Answer: I have no doubt of it. Question: Can you instance any type of that class? Answer: Yes. I would unhesitatingly mention Mr. Vholes. He would be ruined. Question: Mr. Vholes is considered, in the profession, a respectable man? Answer:\"--which proved fatal to the inquiry for ten years--\"Mr. Vholes is considered, in the profession, a MOST respectable man.\"\nSo in familiar conversation, private authorities no less disinterested will remark that they don't know what this age is coming to, that we are plunging down precipices, that now here is something else gone, that these changes are death to people like Vholes--a man of undoubted respectability, with a father in the Vale of Taunton, and three daughters at home. Take a few steps more in this direction, say they, and what is to become of Vholes's father? Is he to perish? And of Vholes's daughters? Are they to be shirt-makers, or governesses? As though, Mr. Vholes and his relations being minor cannibal chiefs and it being proposed to abolish cannibalism, indignant champions were to put the case thus: Make man-eating unlawful, and you starve the Vholeses!\nIn a word, Mr. Vholes, with his three daughters and his father in the Vale of Taunton, is continually doing duty, like a piece of timber, to shore up some decayed foundation that has become a pitfall and a nuisance. And with a great many people in a great many instances, the question is never one of a change from wrong to right (which is quite an extraneous consideration), but is always one of injury or advantage to that eminently respectable legion, Vholes.\nThe Chancellor is, within these ten minutes, \"up\" for the long vacation. Mr. Vholes, and his young client, and several blue bags hastily stuffed out of all regularity of form, as the larger sort of serpents are in their first gorged state, have returned to the official den. Mr. Vholes, quiet and unmoved, as a man of so much respectability ought to be, takes off his close black gloves as if he were skinning his hands, lifts off his tight hat as if he were scalping himself, and sits down at his desk. The client throws his hat and gloves upon the ground--tosses them anywhere, without looking after them or caring where they go; flings himself into a chair, half sighing and half groaning; rests his aching head upon his hand and looks the portrait of young despair.\n\"Again nothing done!\" says Richard. \"Nothing, nothing done!\"\n\"Don't say nothing done, sir,\" returns the placid Vholes. \"That is scarcely fair, sir, scarcely fair!\"\n\"Why, what IS done?\" says Richard, turning gloomily upon him.\n\"That may not be the whole question,\" returns Vholes, \"The question may branch off into what is doing, what is doing?\"\n\"And what is doing?\" asks the moody client.\nVholes, sitting with his arms on the desk, quietly bringing the tips of his five right fingers to meet the tips of his five left fingers, and quietly separating them again, and fixedly and slowly looking at his client, replies, \"A good deal is doing, sir. We have put our shoulders to the wheel, Mr. Carstone, and the wheel is going round.\"\n\"Yes, with Ixion on it. How am I to get through the next four or five accursed months?\" exclaims the young man, rising from his chair and walking about the room.\n\"Mr. C.,\" returns Vholes, following him close with his eyes wherever he goes, \"your spirits are hasty, and I am sorry for it on your account. Excuse me if I recommend you not to chafe so much, not to be so impetuous, not to wear yourself out so. You should have more patience. You should sustain yourself better.\"\n\"I ought to imitate you, in fact, Mr. Vholes?\" says Richard, sitting down again with an impatient laugh and beating the devil's tattoo with his boot on the patternless carpet.\n\"Sir,\" returns Vholes, always looking at the client as if he were making a lingering meal of him with his eyes as well as with his professional appetite. \"Sir,\" returns Vholes with his inward manner of speech and his bloodless quietude, \"I should not have had the presumption to propose myself as a model for your imitation or any man's. Let me but leave the good name to my three daughters, and that is enough for me; I am not a self-seeker. But since you mention me so pointedly, I will acknowledge that I should like to impart to you a little of my--come, sir, you are disposed to call it insensibility, and I am sure I have no objection--say insensibility--a little of my insensibility.\"\n\"Mr. Vholes,\" explains the client, somewhat abashed, \"I had no intention to accuse you of insensibility.\"\n\"I think you had, sir, without knowing it,\" returns the equable Vholes. \"Very naturally. It is my duty to attend to your interests with a cool head, and I can quite understand that to your excited feelings I may appear, at such times as the present, insensible. My daughters may know me better; my aged father may know me better. But they have known me much longer than you have, and the confiding eye of affection is not the distrustful eye of business. Not that I complain, sir, of the eye of business being distrustful; quite the contrary. In attending to your interests, I wish to have all possible checks upon me; it is right that I should have them; I court inquiry. But your interests demand that I should be cool and methodical, Mr. Carstone; and I cannot be otherwise--no, sir, not even to please you.\"\nMr. Vholes, after glancing at the official cat who is patiently watching a mouse's hole, fixes his charmed gaze again on his young client and proceeds in his buttoned-up, half-audible voice as if there were an unclean spirit in him that will neither come out nor speak out, \"What are you to do, sir, you inquire, during the vacation. I should hope you gentlemen of the army may find many means of amusing yourselves if you give your minds to it. If you had asked me what I was to do during the vacation, I could have answered you more readily. I am to attend to your interests. I am to be found here, day by day, attending to your interests. That is my duty, Mr. C., and term-time or vacation makes no difference to me. If you wish to consult me as to your interests, you will find me here at all times alike. Other professional men go out of town. I don't. Not that I blame them for going; I merely say I don't go. This desk is your rock, sir!\"\nMr. Vholes gives it a rap, and it sounds as hollow as a coffin. Not to Richard, though. There is encouragement in the sound to him. Perhaps Mr. Vholes knows there is.\n\"I am perfectly aware, Mr. Vholes,\" says Richard, more familiarly and good-humouredly, \"that you are the most reliable fellow in the world and that to have to do with you is to have to do with a man of business who is not to be hoodwinked. But put yourself in my case, dragging on this dislocated life, sinking deeper and deeper into difficulty every day, continually hoping and continually disappointed, conscious of change upon change for the worse in myself, and of no change for the better in anything else, and you will find it a dark-looking case sometimes, as I do.\"\n\"You know,\" says Mr. Vholes, \"that I never give hopes, sir. I told you from the first, Mr. C., that I never give hopes. Particularly in a case like this, where the greater part of the costs comes out of the estate, I should not be considerate of my good name if I gave hopes. It might seem as if costs were my object. Still, when you say there is no change for the better, I must, as a bare matter of fact, deny that.\"\n\"Aye?\" returns Richard, brightening. \"But how do you make it out?\"\n\"Mr. Carstone, you are represented by--\"\n\"You said just now--a rock.\"\n\"Yes, sir,\" says Mr. Vholes, gently shaking his head and rapping the hollow desk, with a sound as if ashes were falling on ashes, and dust on dust, \"a rock. That's something. You are separately represented, and no longer hidden and lost in the interests of others. THAT'S something. The suit does not sleep; we wake it up, we air it, we walk it about. THAT'S something. It's not all Jarndyce, in fact as well as in name. THAT'S something. Nobody has it all his own way now, sir. And THAT'S something, surely.\"\nRichard, his face flushing suddenly, strikes the desk with his clenched hand.\n\"Mr. Vholes! If any man had told me when I first went to John Jarndyce's house that he was anything but the disinterested friend he seemed--that he was what he has gradually turned out to be--I could have found no words strong enough to repel the slander; I could not have defended him too ardently. So little did I know of the world! Whereas now I do declare to you that he becomes to me the embodiment of the suit; that in place of its being an abstraction, it is John Jarndyce; that the more I suffer, the more indignant I am with him; that every new delay and every new disappointment is only a new injury from John Jarndyce's hand.\"\n\"No, no,\" says Vholes. \"Don't say so. We ought to have patience, all of us. Besides, I never disparage, sir. I never disparage.\"\n\"Mr. Vholes,\" returns the angry client. \"You know as well as I that he would have strangled the suit if he could.\"\n\"He was not active in it,\" Mr. Vholes admits with an appearance of reluctance. \"He certainly was not active in it. But however, but however, he might have had amiable intentions. Who can read the heart, Mr. C.!\"\n\"You can,\" returns Richard.\n\"I, Mr. C.?\"\n\"Well enough to know what his intentions were. Are or are not our interests conflicting? Tell--me--that!\" says Richard, accompanying his last three words with three raps on his rock of trust.\n\"Mr. C.,\" returns Vholes, immovable in attitude and never winking his hungry eyes, \"I should be wanting in my duty as your professional adviser, I should be departing from my fidelity to your interests, if I represented those interests as identical with the interests of Mr. Jarndyce. They are no such thing, sir. I never impute motives; I both have and am a father, and I never impute motives. But I must not shrink from a professional duty, even if it sows dissensions in families. I understand you to be now consulting me professionally as to your interests? You are so? I reply, then, they are not identical with those of Mr. Jarndyce.\"\n\"Of course they are not!\" cries Richard. \"You found that out long ago.\"\n\"Mr. C.,\" returns Vholes, \"I wish to say no more of any third party than is necessary. I wish to leave my good name unsullied, together with any little property of which I may become possessed through industry and perseverance, to my daughters Emma, Jane, and Caroline. I also desire to live in amity with my professional brethren. When Mr. Skimpole did me the honour, sir--I will not say the very high honour, for I never stoop to flattery--of bringing us together in this room, I mentioned to you that I could offer no opinion or advice as to your interests while those interests were entrusted to another member of the profession. And I spoke in such terms as I was bound to speak of Kenge and Carboy's office, which stands high. You, sir, thought fit to withdraw your interests from that keeping nevertheless and to offer them to me. You brought them with clean hands, sir, and I accepted them with clean hands. Those interests are now paramount in this office. My digestive functions, as you may have heard me mention, are not in a good state, and rest might improve them; but I shall not rest, sir, while I am your representative. Whenever you want me, you will find me here. Summon me anywhere, and I will come. During the long vacation, sir, I shall devote my leisure to studying your interests more and more closely and to making arrangements for moving heaven and earth (including, of course, the Chancellor) after Michaelmas term; and when I ultimately congratulate you, sir,\" says Mr. Vholes with the severity of a determined man, \"when I ultimately congratulate you, sir, with all my heart, on your accession to fortune--which, but that I never give hopes, I might say something further about--you will owe me nothing beyond whatever little balance may be then outstanding of the costs as between solicitor and client not included in the taxed costs allowed out of the estate. I pretend to no claim upon you, Mr. C., but for the zealous and active discharge--not the languid and routine discharge, sir: that much credit I stipulate for--of my professional duty. My duty prosperously ended, all between us is ended.\"\nVholes finally adds, by way of rider to this declaration of his principles, that as Mr. Carstone is about to rejoin his regiment, perhaps Mr. C. will favour him with an order on his agent for twenty pounds on account.\n\"For there have been many little consultations and attendances of late, sir,\" observes Vholes, turning over the leaves of his diary, \"and these things mount up, and I don't profess to be a man of capital. When we first entered on our present relations I stated to you openly--it is a principle of mine that there never can be too much openness between solicitor and client--that I was not a man of capital and that if capital was your object you had better leave your papers in Kenge's office. No, Mr. C., you will find none of the advantages or disadvantages of capital here, sir. This,\" Vholes gives the desk one hollow blow again, \"is your rock; it pretends to be nothing more.\"\nThe client, with his dejection insensibly relieved and his vague hopes rekindled, takes pen and ink and writes the draft, not without perplexed consideration and calculation of the date it may bear, implying scant effects in the agent's hands. All the while, Vholes, buttoned up in body and mind, looks at him attentively. All the while, Vholes's official cat watches the mouse's hole.\nLastly, the client, shaking hands, beseeches Mr. Vholes, for heaven's sake and earth's sake, to do his utmost to \"pull him through\" the Court of Chancery. Mr. Vholes, who never gives hopes, lays his palm upon the client's shoulder and answers with a smile, \"Always here, sir. Personally, or by letter, you will always find me here, sir, with my shoulder to the wheel.\" Thus they part, and Vholes, left alone, employs himself in carrying sundry little matters out of his diary into his draft bill book for the ultimate behoof of his three daughters. So might an industrious fox or bear make up his account of chickens or stray travellers with an eye to his cubs, not to disparage by that word the three raw-visaged, lank, and buttoned-up maidens who dwell with the parent Vholes in an earthy cottage situated in a damp garden at Kennington.\nRichard, emerging from the heavy shade of Symond's Inn into the sunshine of Chancery Lane--for there happens to be sunshine there to-day--walks thoughtfully on, and turns into Lincoln's Inn, and passes under the shadow of the Lincoln's Inn trees. On many such loungers have the speckled shadows of those trees often fallen; on the like bent head, the bitten nail, the lowering eye, the lingering step, the purposeless and dreamy air, the good consuming and consumed, the life turned sour. This lounger is not shabby yet, but that may come. Chancery, which knows no wisdom but in precedent, is very rich in such precedents; and why should one be different from ten thousand?\nYet the time is so short since his depreciation began that as he saunters away, reluctant to leave the spot for some long months together, though he hates it, Richard himself may feel his own case as if it were a startling one. While his heart is heavy with corroding care, suspense, distrust, and doubt, it may have room for some sorrowful wonder when he recalls how different his first visit there, how different he, how different all the colours of his mind. But injustice breeds injustice; the fighting with shadows and being defeated by them necessitates the setting up of substances to combat; from the impalpable suit which no man alive can understand, the time for that being long gone by, it has become a gloomy relief to turn to the palpable figure of the friend who would have saved him from this ruin and make HIM his enemy. Richard has told Vholes the truth. Is he in a hardened or a softened mood, he still lays his injuries equally at that door; he was thwarted, in that quarter, of a set purpose, and that purpose could only originate in the one subject that is resolving his existence into itself; besides, it is a justification to him in his own eyes to have an embodied antagonist and oppressor.\nIs Richard a monster in all this, or would Chancery be found rich in such precedents too if they could be got for citation from the Recording Angel?\nTwo pairs of eyes not unused to such people look after him, as, biting his nails and brooding, he crosses the square and is swallowed up by the shadow of the southern gateway. Mr. Guppy and Mr. Weevle are the possessors of those eyes, and they have been leaning in conversation against the low stone parapet under the trees. He passes close by them, seeing nothing but the ground.\n\"William,\" says Mr. Weevle, adjusting his whiskers, \"there's combustion going on there! It's not a case of spontaneous, but it's smouldering combustion it is.\"\n\"Ah!\" says Mr. Guppy. \"He wouldn't keep out of Jarndyce, and I suppose he's over head and ears in debt. I never knew much of him. He was as high as the monument when he was on trial at our place. A good riddance to me, whether as clerk or client! Well, Tony, that as I was mentioning is what they're up to.\"\nMr. Guppy, refolding his arms, resettles himself against the parapet, as resuming a conversation of interest.\n\"They are still up to it, sir,\" says Mr. Guppy, \"still taking stock, still examining papers, still going over the heaps and heaps of rubbish. At this rate they'll be at it these seven years.\"\n\"And Small is helping?\"\n\"Small left us at a week's notice. Told Kenge his grandfather's business was too much for the old gentleman and he could better himself by undertaking it. There had been a coolness between myself and Small on account of his being so close. But he said you and I began it, and as he had me there--for we did--I put our acquaintance on the old footing. That's how I come to know what they're up to.\"\n\"You haven't looked in at all?\"\n\"Tony,\" says Mr. Guppy, a little disconcerted, \"to be unreserved with you, I don't greatly relish the house, except in your company, and therefore I have not; and therefore I proposed this little appointment for our fetching away your things. There goes the hour by the clock! Tony\"--Mr. Guppy becomes mysteriously and tenderly eloquent--\"it is necessary that I should impress upon your mind once more that circumstances over which I have no control have made a melancholy alteration in my most cherished plans and in that unrequited image which I formerly mentioned to you as a friend. That image is shattered, and that idol is laid low. My only wish now in connexion with the objects which I had an idea of carrying out in the court with your aid as a friend is to let 'em alone and bury 'em in oblivion. Do you think it possible, do you think it at all likely (I put it to you, Tony, as a friend), from your knowledge of that capricious and deep old character who fell a prey to the--spontaneous element, do you, Tony, think it at all likely that on second thoughts he put those letters away anywhere, after you saw him alive, and that they were not destroyed that night?\"\nMr. Weevle reflects for some time. Shakes his head. Decidedly thinks not.\n\"Tony,\" says Mr. Guppy as they walk towards the court, \"once again understand me, as a friend. Without entering into further explanations, I may repeat that the idol is down. I have no purpose to serve now but burial in oblivion. To that I have pledged myself. I owe it to myself, and I owe it to the shattered image, as also to the circumstances over which I have no control. If you was to express to me by a gesture, by a wink, that you saw lying anywhere in your late lodgings any papers that so much as looked like the papers in question, I would pitch them into the fire, sir, on my own responsibility.\"\nMr. Weevle nods. Mr. Guppy, much elevated in his own opinion by having delivered these observations, with an air in part forensic and in part romantic--this gentleman having a passion for conducting anything in the form of an examination, or delivering anything in the form of a summing up or a speech--accompanies his friend with dignity to the court.\nNever since it has been a court has it had such a Fortunatus' purse of gossip as in the proceedings at the rag and bottle shop. Regularly, every morning at eight, is the elder Mr. Smallweed brought down to the corner and carried in, accompanied by Mrs. Smallweed, Judy, and Bart; and regularly, all day, do they all remain there until nine at night, solaced by gipsy dinners, not abundant in quantity, from the cook's shop, rummaging and searching, digging, delving, and diving among the treasures of the late lamented. What those treasures are they keep so secret that the court is maddened. In its delirium it imagines guineas pouring out of tea-pots, crown-pieces overflowing punch-bowls, old chairs and mattresses stuffed with Bank of England notes. It possesses itself of the sixpenny history (with highly coloured folding frontispiece) of Mr. Daniel Dancer and his sister, and also of Mr. Elwes, of Suffolk, and transfers all the facts from those authentic narratives to Mr. Krook. Twice when the dustman is called in to carry off a cartload of old paper, ashes, and broken bottles, the whole court assembles and pries into the baskets as they come forth. Many times the two gentlemen who write with the ravenous little pens on the tissue-paper are seen prowling in the neighbourhood--shy of each other, their late partnership being dissolved. The Sol skilfully carries a vein of the prevailing interest through the Harmonic nights. Little Swills, in what are professionally known as \"patter\" allusions to the subject, is received with loud applause; and the same vocalist \"gags\" in the regular business like a man inspired. Even Miss M. Melvilleson, in the revived Caledonian melody of \"We're a-Nodding,\" points the sentiment that \"the dogs love broo\" (whatever the nature of that refreshment may be) with such archness and such a turn of the head towards next door that she is immediately understood to mean Mr. Smallweed loves to find money, and is nightly honoured with a double encore. For all this, the court discovers nothing; and as Mrs. Piper and Mrs. Perkins now communicate to the late lodger whose appearance is the signal for a general rally, it is in one continual ferment to discover everything, and more.\nMr. Weevle and Mr. Guppy, with every eye in the court's head upon them, knock at the closed door of the late lamented's house, in a high state of popularity. But being contrary to the court's expectation admitted, they immediately become unpopular and are considered to mean no good.\nThe shutters are more or less closed all over the house, and the ground-floor is sufficiently dark to require candles. Introduced into the back shop by Mr. Smallweed the younger, they, fresh from the sunlight, can at first see nothing save darkness and shadows; but they gradually discern the elder Mr. Smallweed seated in his chair upon the brink of a well or grave of waste-paper, the virtuous Judy groping therein like a female sexton, and Mrs. Smallweed on the level ground in the vicinity snowed up in a heap of paper fragments, print, and manuscript which would appear to be the accumulated compliments that have been sent flying at her in the course of the day. The whole party, Small included, are blackened with dust and dirt and present a fiendish appearance not relieved by the general aspect of the room. There is more litter and lumber in it than of old, and it is dirtier if possible; likewise, it is ghostly with traces of its dead inhabitant and even with his chalked writing on the wall.\nOn the entrance of visitors, Mr. Smallweed and Judy simultaneously fold their arms and stop in their researches.\n\"Aha!\" croaks the old gentleman. \"How de do, gentlemen, how de do! Come to fetch your property, Mr. Weevle? That's well, that's well. Ha! Ha! We should have been forced to sell you up, sir, to pay your warehouse room if you had left it here much longer. You feel quite at home here again, I dare say? Glad to see you, glad to see you!\"\nMr. Weevle, thanking him, casts an eye about. Mr. Guppy's eye follows Mr. Weevle's eye. Mr. Weevle's eye comes back without any new intelligence in it. Mr. Guppy's eye comes back and meets Mr. Smallweed's eye. That engaging old gentleman is still murmuring, like some wound-up instrument running down, \"How de do, sir--how de--how--\" And then having run down, he lapses into grinning silence, as Mr. Guppy starts at seeing Mr. Tulkinghorn standing in the darkness opposite with his hands behind him.\n\"Gentleman so kind as to act as my solicitor,\" says Grandfather Smallweed. \"I am not the sort of client for a gentleman of such note, but he is so good!\"\nMr. Guppy, slightly nudging his friend to take another look, makes a shuffling bow to Mr. Tulkinghorn, who returns it with an easy nod. Mr. Tulkinghorn is looking on as if he had nothing else to do and were rather amused by the novelty.\n\"A good deal of property here, sir, I should say,\" Mr. Guppy observes to Mr. Smallweed.\n\"Principally rags and rubbish, my dear friend! Rags and rubbish! Me and Bart and my granddaughter Judy are endeavouring to make out an inventory of what's worth anything to sell. But we haven't come to much as yet; we--haven't--come--to--hah!\"\nMr. Smallweed has run down again, while Mr. Weevle's eye, attended by Mr. Guppy's eye, has again gone round the room and come back.\n\"Well, sir,\" says Mr. Weevle. \"We won't intrude any longer if you'll allow us to go upstairs.\"\n\"Anywhere, my dear sir, anywhere! You're at home. Make yourself so, pray!\"\nAs they go upstairs, Mr. Guppy lifts his eyebrows inquiringly and looks at Tony. Tony shakes his head. They find the old room very dull and dismal, with the ashes of the fire that was burning on that memorable night yet in the discoloured grate. They have a great disinclination to touch any object, and carefully blow the dust from it first. Nor are they desirous to prolong their visit, packing the few movables with all possible speed and never speaking above a whisper.\n\"Look here,\" says Tony, recoiling. \"Here's that horrible cat coming in!\"\nMr. Guppy retreats behind a chair. \"Small told me of her. She went leaping and bounding and tearing about that night like a dragon, and got out on the house-top, and roamed about up there for a fortnight, and then came tumbling down the chimney very thin. Did you ever see such a brute? Looks as if she knew all about it, don't she? Almost looks as if she was Krook. Shoohoo! Get out, you goblin!\"\nLady Jane, in the doorway, with her tiger snarl from ear to ear and her club of a tail, shows no intention of obeying; but Mr. Tulkinghorn stumbling over her, she spits at his rusty legs, and swearing wrathfully, takes her arched back upstairs. Possibly to roam the house-tops again and return by the chimney.\n\"Mr. Guppy,\" says Mr. Tulkinghorn, \"could I have a word with you?\"\nMr. Guppy is engaged in collecting the Galaxy Gallery of British Beauty from the wall and depositing those works of art in their old ignoble band-box. \"Sir,\" he returns, reddening, \"I wish to act with courtesy towards every member of the profession, and especially, I am sure, towards a member of it so well known as yourself--I will truly add, sir, so distinguished as yourself. Still, Mr. Tulkinghorn, sir, I must stipulate that if you have any word with me, that word is spoken in the presence of my friend.\"\n\"Oh, indeed?\" says Mr. Tulkinghorn.\n\"Yes, sir. My reasons are not of a personal nature at all, but they are amply sufficient for myself.\"\n\"No doubt, no doubt.\" Mr. Tulkinghorn is as imperturbable as the hearthstone to which he has quietly walked. \"The matter is not of that consequence that I need put you to the trouble of making any conditions, Mr. Guppy.\" He pauses here to smile, and his smile is as dull and rusty as his pantaloons. \"You are to be congratulated, Mr. Guppy; you are a fortunate young man, sir.\"\n\"Pretty well so, Mr. Tulkinghorn; I don't complain.\"\n\"Complain? High friends, free admission to great houses, and access to elegant ladies! Why, Mr. Guppy, there are people in London who would give their ears to be you.\"\nMr. Guppy, looking as if he would give his own reddening and still reddening ears to be one of those people at present instead of himself, replies, \"Sir, if I attend to my profession and do what is right by Kenge and Carboy, my friends and acquaintances are of no consequence to them nor to any member of the profession, not excepting Mr. Tulkinghorn of the Fields. I am not under any obligation to explain myself further; and with all respect for you, sir, and without offence--I repeat, without offence--\"\n\"Oh, certainly!\"\n\"--I don't intend to do it.\"\n\"Quite so,\" says Mr. Tulkinghorn with a calm nod. \"Very good; I see by these portraits that you take a strong interest in the fashionable great, sir?\"\nHe addresses this to the astounded Tony, who admits the soft impeachment.\n\"A virtue in which few Englishmen are deficient,\" observes Mr. Tulkinghorn. He has been standing on the hearthstone with his back to the smoked chimney-piece, and now turns round with his glasses to his eyes. \"Who is this? 'Lady Dedlock.' Ha! A very good likeness in its way, but it wants force of character. Good day to you, gentlemen; good day!\"\nWhen he has walked out, Mr. Guppy, in a great perspiration, nerves himself to the hasty completion of the taking down of the Galaxy Gallery, concluding with Lady Dedlock.\n\"Tony,\" he says hurriedly to his astonished companion, \"let us be quick in putting the things together and in getting out of this place. It were in vain longer to conceal from you, Tony, that between myself and one of the members of a swan-like aristocracy whom I now hold in my hand, there has been undivulged communication and association. The time might have been when I might have revealed it to you. It never will be more. It is due alike to the oath I have taken, alike to the shattered idol, and alike to circumstances over which I have no control, that the whole should be buried in oblivion. I charge you as a friend, by the interest you have ever testified in the fashionable intelligence, and by any little advances with which I may have been able to accommodate you, so to bury it without a word of inquiry!\"\nThis charge Mr. Guppy delivers in a state little short of forensic lunacy, while his friend shows a dazed mind in his whole head of hair and even in his cultivated whiskers.",
        "paragraph_chars": [
            [
                0,
                559
            ],
            [
                559,
                1881
            ],
            [
                1881,
                2504
            ],
            [
                2504,
                2947
            ],
            [
                2947,
                5021
            ],
            [
                5021,
                5781
            ],
            [
                5781,
                6244
            ],
            [
                6244,
                7014
            ],
            [
                7014,
                7075
            ],
            [
                7075,
                7178
            ],
            [
                7178,
                7240
            ],
            [
                7240,
                7359
            ],
            [
                7359,
                7403
            ],
            [
                7403,
                7744
            ],
            [
                7744,
                7906
            ],
            [
                7906,
                8220
            ],
            [
                8220,
                8396
            ],
            [
                8396,
                9088
            ],
            [
                9088,
                9194
            ],
            [
                9194,
                10006
            ],
            [
                10006,
                10952
            ],
            [
                10952,
                11119
            ],
            [
                11119,
                11693
            ],
            [
                11693,
                12112
            ],
            [
                12112,
                12179
            ],
            [
                12179,
                12220
            ],
            [
                12220,
                12249
            ],
            [
                12249,
                12759
            ],
            [
                12759,
                12837
            ],
            [
                12837,
                13475
            ],
            [
                13475,
                13604
            ],
            [
                13604,
                13719
            ],
            [
                13719,
                13931
            ],
            [
                13931,
                13959
            ],
            [
                13959,
                13972
            ],
            [
                13972,
                14164
            ],
            [
                14164,
                14805
            ],
            [
                14805,
                14877
            ],
            [
                14877,
                17006
            ],
            [
                17006,
                17224
            ],
            [
                17224,
                17906
            ],
            [
                17906,
                18292
            ],
            [
                18292,
                19132
            ],
            [
                19132,
                19806
            ],
            [
                19806,
                21021
            ],
            [
                21021,
                21170
            ],
            [
                21170,
                21551
            ],
            [
                21551,
                21711
            ],
            [
                21711,
                22019
            ],
            [
                22019,
                22129
            ],
            [
                22129,
                22321
            ],
            [
                22321,
                22345
            ],
            [
                22345,
                22743
            ],
            [
                22743,
                22775
            ],
            [
                22775,
                23951
            ],
            [
                23951,
                24025
            ],
            [
                24025,
                24634
            ],
            [
                24634,
                24987
            ],
            [
                24987,
                27214
            ],
            [
                27214,
                27498
            ],
            [
                27498,
                28503
            ],
            [
                28503,
                28616
            ],
            [
                28616,
                28952
            ],
            [
                28952,
                29452
            ],
            [
                29452,
                29606
            ],
            [
                29606,
                29843
            ],
            [
                29843,
                29931
            ],
            [
                29931,
                30175
            ],
            [
                30175,
                30307
            ],
            [
                30307,
                30402
            ],
            [
                30402,
                30477
            ],
            [
                30477,
                30951
            ],
            [
                30951,
                31024
            ],
            [
                31024,
                31422
            ],
            [
                31422,
                31732
            ],
            [
                31732,
                31799
            ],
            [
                31799,
                32311
            ],
            [
                32311,
                32347
            ],
            [
                32347,
                32449
            ],
            [
                32449,
                32827
            ],
            [
                32827,
                32880
            ],
            [
                32880,
                33048
            ],
            [
                33048,
                33556
            ],
            [
                33556,
                33573
            ],
            [
                33573,
                33602
            ],
            [
                33602,
                33753
            ],
            [
                33753,
                33827
            ],
            [
                33827,
                34175
            ],
            [
                34175,
                34346
            ],
            [
                34346,
                35167
            ],
            [
                35167,
                35340
            ]
        ],
        "segment_chars": [
            [
                0,
                221
            ],
            [
                221,
                463
            ],
            [
                463,
                559
            ],
            [
                559,
                684
            ],
            [
                684,
                959
            ],
            [
                959,
                1159
            ],
            [
                1159,
                1383
            ],
            [
                1383,
                1428
            ],
            [
                1428,
                1747
            ],
            [
                1747,
                1881
            ],
            [
                1881,
                1919
            ],
            [
                1919,
                1982
            ],
            [
                1982,
                2098
            ],
            [
                2098,
                2175
            ],
            [
                2175,
                2245
            ],
            [
                2245,
                2314
            ],
            [
                2314,
                2370
            ],
            [
                2370,
                2445
            ],
            [
                2445,
                2504
            ],
            [
                2504,
                2579
            ],
            [
                2579,
                2691
            ],
            [
                2691,
                2799
            ],
            [
                2799,
                2947
            ],
            [
                2947,
                3122
            ],
            [
                3122,
                3205
            ],
            [
                3205,
                3241
            ],
            [
                3241,
                3278
            ],
            [
                3278,
                3303
            ],
            [
                3303,
                3327
            ],
            [
                3327,
                3529
            ],
            [
                3529,
                3605
            ],
            [
                3605,
                3714
            ],
            [
                3714,
                3764
            ],
            [
                3764,
                3984
            ],
            [
                3984,
                4164
            ],
            [
                4164,
                4323
            ],
            [
                4323,
                4348
            ],
            [
                4348,
                4377
            ],
            [
                4377,
                4441
            ],
            [
                4441,
                4477
            ],
            [
                4477,
                4516
            ],
            [
                4516,
                4575
            ],
            [
                4575,
                4659
            ],
            [
                4659,
                4690
            ],
            [
                4690,
                4741
            ],
            [
                4741,
                4754
            ],
            [
                4754,
                4797
            ],
            [
                4797,
                4817
            ],
            [
                4817,
                4891
            ],
            [
                4891,
                5021
            ],
            [
                5021,
                5383
            ],
            [
                5383,
                5476
            ],
            [
                5476,
                5493
            ],
            [
                5493,
                5520
            ],
            [
                5520,
                5565
            ],
            [
                5565,
                5781
            ],
            [
                5781,
                5997
            ],
            [
                5997,
                6244
            ],
            [
                6244,
                6317
            ],
            [
                6317,
                6519
            ],
            [
                6519,
                6748
            ],
            [
                6748,
                7014
            ],
            [
                7014,
                7036
            ],
            [
                7036,
                7050
            ],
            [
                7050,
                7075
            ],
            [
                7075,
                7133
            ],
            [
                7133,
                7178
            ],
            [
                7178,
                7199
            ],
            [
                7199,
                7240
            ],
            [
                7240,
                7359
            ],
            [
                7359,
                7380
            ],
            [
                7380,
                7403
            ],
            [
                7403,
                7659
            ],
            [
                7659,
                7744
            ],
            [
                7744,
                7768
            ],
            [
                7768,
                7832
            ],
            [
                7832,
                7906
            ],
            [
                7906,
                8048
            ],
            [
                8048,
                8152
            ],
            [
                8152,
                8183
            ],
            [
                8183,
                8220
            ],
            [
                8220,
                8267
            ],
            [
                8267,
                8396
            ],
            [
                8396,
                8550
            ],
            [
                8550,
                8734
            ],
            [
                8734,
                8839
            ],
            [
                8839,
                9088
            ],
            [
                9088,
                9194
            ],
            [
                9194,
                9266
            ],
            [
                9266,
                9283
            ],
            [
                9283,
                9456
            ],
            [
                9456,
                9524
            ],
            [
                9524,
                9649
            ],
            [
                9649,
                9737
            ],
            [
                9737,
                9867
            ],
            [
                9867,
                10006
            ],
            [
                10006,
                10340
            ],
            [
                10340,
                10452
            ],
            [
                10452,
                10550
            ],
            [
                10550,
                10584
            ],
            [
                10584,
                10648
            ],
            [
                10648,
                10726
            ],
            [
                10726,
                10816
            ],
            [
                10816,
                10855
            ],
            [
                10855,
                10864
            ],
            [
                10864,
                10922
            ],
            [
                10922,
                10952
            ],
            [
                10952,
                11016
            ],
            [
                11016,
                11040
            ],
            [
                11040,
                11084
            ],
            [
                11084,
                11119
            ],
            [
                11119,
                11359
            ],
            [
                11359,
                11693
            ],
            [
                11693,
                11753
            ],
            [
                11753,
                11813
            ],
            [
                11813,
                11969
            ],
            [
                11969,
                12011
            ],
            [
                12011,
                12112
            ],
            [
                12112,
                12119
            ],
            [
                12119,
                12149
            ],
            [
                12149,
                12179
            ],
            [
                12179,
                12220
            ],
            [
                12220,
                12249
            ],
            [
                12249,
                12406
            ],
            [
                12406,
                12424
            ],
            [
                12424,
                12514
            ],
            [
                12514,
                12532
            ],
            [
                12532,
                12601
            ],
            [
                12601,
                12619
            ],
            [
                12619,
                12670
            ],
            [
                12670,
                12688
            ],
            [
                12688,
                12728
            ],
            [
                12728,
                12759
            ],
            [
                12759,
                12837
            ],
            [
                12837,
                12850
            ],
            [
                12850,
                13137
            ],
            [
                13137,
                13172
            ],
            [
                13172,
                13475
            ],
            [
                13475,
                13498
            ],
            [
                13498,
                13513
            ],
            [
                13513,
                13551
            ],
            [
                13551,
                13584
            ],
            [
                13584,
                13604
            ],
            [
                13604,
                13644
            ],
            [
                13644,
                13719
            ],
            [
                13719,
                13798
            ],
            [
                13798,
                13834
            ],
            [
                13834,
                13898
            ],
            [
                13898,
                13931
            ],
            [
                13931,
                13959
            ],
            [
                13959,
                13972
            ],
            [
                13972,
                14019
            ],
            [
                14019,
                14061
            ],
            [
                14061,
                14078
            ],
            [
                14078,
                14164
            ],
            [
                14164,
                14449
            ],
            [
                14449,
                14478
            ],
            [
                14478,
                14559
            ],
            [
                14559,
                14648
            ],
            [
                14648,
                14726
            ],
            [
                14726,
                14738
            ],
            [
                14738,
                14805
            ],
            [
                14805,
                14831
            ],
            [
                14831,
                14846
            ],
            [
                14846,
                14877
            ],
            [
                14877,
                14964
            ],
            [
                14964,
                15147
            ],
            [
                15147,
                15209
            ],
            [
                15209,
                15511
            ],
            [
                15511,
                15610
            ],
            [
                15610,
                15715
            ],
            [
                15715,
                15793
            ],
            [
                15793,
                15843
            ],
            [
                15843,
                16014
            ],
            [
                16014,
                16059
            ],
            [
                16059,
                16096
            ],
            [
                16096,
                16767
            ],
            [
                16767,
                16952
            ],
            [
                16952,
                17006
            ],
            [
                17006,
                17224
            ],
            [
                17224,
                17429
            ],
            [
                17429,
                17718
            ],
            [
                17718,
                17806
            ],
            [
                17806,
                17906
            ],
            [
                17906,
                18150
            ],
            [
                18150,
                18229
            ],
            [
                18229,
                18292
            ],
            [
                18292,
                18447
            ],
            [
                18447,
                18568
            ],
            [
                18568,
                18661
            ],
            [
                18661,
                18841
            ],
            [
                18841,
                19132
            ],
            [
                19132,
                19379
            ],
            [
                19379,
                19621
            ],
            [
                19621,
                19672
            ],
            [
                19672,
                19806
            ],
            [
                19806,
                20034
            ],
            [
                20034,
                20268
            ],
            [
                20268,
                20643
            ],
            [
                20643,
                20678
            ],
            [
                20678,
                21021
            ],
            [
                21021,
                21170
            ],
            [
                21170,
                21346
            ],
            [
                21346,
                21495
            ],
            [
                21495,
                21551
            ],
            [
                21551,
                21639
            ],
            [
                21639,
                21711
            ],
            [
                21711,
                21717
            ],
            [
                21717,
                21733
            ],
            [
                21733,
                21815
            ],
            [
                21815,
                21841
            ],
            [
                21841,
                21907
            ],
            [
                21907,
                21958
            ],
            [
                21958,
                22019
            ],
            [
                22019,
                22129
            ],
            [
                22129,
                22271
            ],
            [
                22271,
                22321
            ],
            [
                22321,
                22345
            ],
            [
                22345,
                22380
            ],
            [
                22380,
                22500
            ],
            [
                22500,
                22585
            ],
            [
                22585,
                22696
            ],
            [
                22696,
                22743
            ],
            [
                22743,
                22775
            ],
            [
                22775,
                23018
            ],
            [
                23018,
                23052
            ],
            [
                23052,
                23362
            ],
            [
                23362,
                23414
            ],
            [
                23414,
                23582
            ],
            [
                23582,
                23951
            ],
            [
                23951,
                23986
            ],
            [
                23986,
                24003
            ],
            [
                24003,
                24025
            ],
            [
                24025,
                24120
            ],
            [
                24120,
                24200
            ],
            [
                24200,
                24255
            ],
            [
                24255,
                24286
            ],
            [
                24286,
                24402
            ],
            [
                24402,
                24634
            ],
            [
                24634,
                24651
            ],
            [
                24651,
                24987
            ],
            [
                24987,
                25115
            ],
            [
                25115,
                25507
            ],
            [
                25507,
                25580
            ],
            [
                25580,
                25741
            ],
            [
                25741,
                25975
            ],
            [
                25975,
                26149
            ],
            [
                26149,
                26337
            ],
            [
                26337,
                26426
            ],
            [
                26426,
                26618
            ],
            [
                26618,
                26984
            ],
            [
                26984,
                27214
            ],
            [
                27214,
                27372
            ],
            [
                27372,
                27498
            ],
            [
                27498,
                27617
            ],
            [
                27617,
                28167
            ],
            [
                28167,
                28315
            ],
            [
                28315,
                28503
            ],
            [
                28503,
                28616
            ],
            [
                28616,
                28623
            ],
            [
                28623,
                28649
            ],
            [
                28649,
                28683
            ],
            [
                28683,
                28724
            ],
            [
                28724,
                28750
            ],
            [
                28750,
                28754
            ],
            [
                28754,
                28758
            ],
            [
                28758,
                28870
            ],
            [
                28870,
                28917
            ],
            [
                28917,
                28952
            ],
            [
                28952,
                28998
            ],
            [
                28998,
                29040
            ],
            [
                29040,
                29104
            ],
            [
                29104,
                29162
            ],
            [
                29162,
                29452
            ],
            [
                29452,
                29527
            ],
            [
                29527,
                29606
            ],
            [
                29606,
                29742
            ],
            [
                29742,
                29843
            ],
            [
                29843,
                29931
            ],
            [
                29931,
                29978
            ],
            [
                29978,
                29996
            ],
            [
                29996,
                30110
            ],
            [
                30110,
                30175
            ],
            [
                30175,
                30307
            ],
            [
                30307,
                30337
            ],
            [
                30337,
                30402
            ],
            [
                30402,
                30436
            ],
            [
                30436,
                30452
            ],
            [
                30452,
                30477
            ],
            [
                30477,
                30558
            ],
            [
                30558,
                30580
            ],
            [
                30580,
                30723
            ],
            [
                30723,
                30820
            ],
            [
                30820,
                30951
            ],
            [
                30951,
                30986
            ],
            [
                30986,
                31024
            ],
            [
                31024,
                31059
            ],
            [
                31059,
                31082
            ],
            [
                31082,
                31280
            ],
            [
                31280,
                31311
            ],
            [
                31311,
                31357
            ],
            [
                31357,
                31391
            ],
            [
                31391,
                31400
            ],
            [
                31400,
                31422
            ],
            [
                31422,
                31667
            ],
            [
                31667,
                31732
            ],
            [
                31732,
                31799
            ],
            [
                31799,
                31950
            ],
            [
                31950,
                32179
            ],
            [
                32179,
                32311
            ],
            [
                32311,
                32325
            ],
            [
                32325,
                32347
            ],
            [
                32347,
                32358
            ],
            [
                32358,
                32449
            ],
            [
                32449,
                32471
            ],
            [
                32471,
                32558
            ],
            [
                32558,
                32670
            ],
            [
                32670,
                32749
            ],
            [
                32749,
                32827
            ],
            [
                32827,
                32880
            ],
            [
                32880,
                32891
            ],
            [
                32891,
                32967
            ],
            [
                32967,
                33048
            ],
            [
                33048,
                33414
            ],
            [
                33414,
                33556
            ],
            [
                33556,
                33573
            ],
            [
                33573,
                33602
            ],
            [
                33602,
                33652
            ],
            [
                33652,
                33753
            ],
            [
                33753,
                33827
            ],
            [
                33827,
                33903
            ],
            [
                33903,
                34036
            ],
            [
                34036,
                34050
            ],
            [
                34050,
                34066
            ],
            [
                34066,
                34070
            ],
            [
                34070,
                34136
            ],
            [
                34136,
                34175
            ],
            [
                34175,
                34346
            ],
            [
                34346,
                34483
            ],
            [
                34483,
                34688
            ],
            [
                34688,
                34751
            ],
            [
                34751,
                34774
            ],
            [
                34774,
                34947
            ],
            [
                34947,
                35167
            ],
            [
                35167,
                35340
            ]
        ],
        "overlap_chars": [
            [
                0,
                22
            ],
            [
                61,
                121
            ],
            [
                53,
                54
            ],
            [
                123,
                159
            ],
            [
                219,
                221
            ],
            [
                559,
                578
            ],
            [
                630,
                684
            ],
            [
                684,
                773
            ],
            [
                957,
                958
            ],
            [
                959,
                1084
            ],
            [
                1117,
                1159
            ],
            [
                1173,
                1184
            ],
            [
                1161,
                1166
            ],
            [
                1290,
                1299
            ],
            [
                1232,
                1234
            ],
            [
                1245,
                1259
            ],
            [
                1278,
                1289
            ],
            [
                1170,
                1172
            ],
            [
                1307,
                1325
            ],
            [
                1335,
                1347
            ],
            [
                1358,
                1383
            ],
            [
                1500,
                1544
            ],
            [
                1551,
                1607
            ],
            [
                1702,
                1730
            ],
            [
                1745,
                1746
            ],
            [
                1881,
                1919
            ],
            [
                2175,
                2212
            ],
            [
                2221,
                2245
            ],
            [
                2245,
                2314
            ],
            [
                2314,
                2370
            ],
            [
                2370,
                2376
            ],
            [
                2428,
                2445
            ],
            [
                2445,
                2504
            ],
            [
                2504,
                2579
            ],
            [
                2579,
                2606
            ],
            [
                2634,
                2691
            ],
            [
                2691,
                2767
            ],
            [
                2789,
                2799
            ],
            [
                2825,
                2907
            ],
            [
                2912,
                2947
            ],
            [
                2947,
                2984
            ],
            [
                3076,
                3077
            ],
            [
                3100,
                3110
            ],
            [
                3120,
                3122
            ],
            [
                3122,
                3190
            ],
            [
                3203,
                3205
            ],
            [
                3640,
                3671
            ],
            [
                3630,
                3639
            ],
            [
                3673,
                3714
            ],
            [
                3714,
                3764
            ],
            [
                3764,
                3794
            ],
            [
                3803,
                3811
            ],
            [
                3896,
                3983
            ],
            [
                5058,
                5069
            ],
            [
                5092,
                5195
            ],
            [
                5234,
                5279
            ],
            [
                5281,
                5383
            ],
            [
                5383,
                5476
            ],
            [
                5476,
                5493
            ],
            [
                5493,
                5496
            ],
            [
                5497,
                5520
            ],
            [
                5781,
                5802
            ],
            [
                5868,
                5996
            ],
            [
                6244,
                6261
            ],
            [
                6289,
                6317
            ],
            [
                6317,
                6388
            ],
            [
                6482,
                6519
            ],
            [
                6519,
                6548
            ],
            [
                6570,
                6584
            ],
            [
                6596,
                6688
            ],
            [
                6721,
                6748
            ],
            [
                6748,
                6784
            ],
            [
                6814,
                6831
            ],
            [
                6854,
                7014
            ],
            [
                7014,
                7036
            ],
            [
                7036,
                7049
            ],
            [
                7075,
                7133
            ],
            [
                7133,
                7160
            ],
            [
                7175,
                7178
            ],
            [
                7178,
                7199
            ],
            [
                7199,
                7211
            ],
            [
                7221,
                7229
            ],
            [
                7238,
                7240
            ],
            [
                7240,
                7292
            ],
            [
                7294,
                7311
            ],
            [
                7341,
                7359
            ],
            [
                7359,
                7380
            ],
            [
                7380,
                7403
            ],
            [
                7631,
                7659
            ],
            [
                7659,
                7744
            ],
            [
                7768,
                7832
            ],
            [
                7832,
                7906
            ],
            [
                7906,
                7945
            ],
            [
                7952,
                8007
            ],
            [
                8046,
                8048
            ],
            [
                8048,
                8076
            ],
            [
                8099,
                8152
            ],
            [
                8152,
                8181
            ],
            [
                8220,
                8267
            ],
            [
                8267,
                8323
            ],
            [
                8394,
                8396
            ],
            [
                8396,
                8548
            ],
            [
                8631,
                8632
            ],
            [
                8550,
                8554
            ],
            [
                8634,
                8651
            ],
            [
                8656,
                8719
            ],
            [
                8732,
                8734
            ],
            [
                8839,
                8842
            ],
            [
                8878,
                8947
            ],
            [
                8949,
                8963
            ],
            [
                8980,
                9008
            ],
            [
                9019,
                9036
            ],
            [
                9057,
                9088
            ],
            [
                9088,
                9143
            ],
            [
                9161,
                9194
            ],
            [
                9194,
                9206
            ],
            [
                9210,
                9216
            ],
            [
                9267,
                9281
            ],
            [
                9235,
                9265
            ],
            [
                9283,
                9412
            ],
            [
                9444,
                9456
            ],
            [
                9456,
                9524
            ],
            [
                9524,
                9572
            ],
            [
                9647,
                9649
            ],
            [
                9871,
                9943
            ],
            [
                10003,
                10006
            ],
            [
                10006,
                10016
            ],
            [
                10095,
                10163
            ],
            [
                10177,
                10195
            ],
            [
                10278,
                10338
            ],
            [
                10340,
                10421
            ],
            [
                10450,
                10452
            ],
            [
                10452,
                10535
            ],
            [
                10541,
                10550
            ],
            [
                10584,
                10648
            ],
            [
                10648,
                10670
            ],
            [
                10814,
                10855
            ],
            [
                10855,
                10862
            ],
            [
                11119,
                11173
            ],
            [
                11189,
                11257
            ],
            [
                11357,
                11359
            ],
            [
                11359,
                11523
            ],
            [
                11588,
                11612
            ],
            [
                11629,
                11693
            ],
            [
                11693,
                11753
            ],
            [
                11753,
                11763
            ],
            [
                11788,
                11792
            ],
            [
                11764,
                11785
            ],
            [
                11811,
                11909
            ],
            [
                11795,
                11811
            ],
            [
                11967,
                11969
            ],
            [
                11969,
                12011
            ],
            [
                12011,
                12072
            ],
            [
                12100,
                12112
            ],
            [
                12112,
                12119
            ],
            [
                12119,
                12148
            ],
            [
                12424,
                12454
            ],
            [
                12454,
                12514
            ],
            [
                12514,
                12532
            ],
            [
                12532,
                12574
            ],
            [
                12586,
                12601
            ],
            [
                12601,
                12619
            ],
            [
                12619,
                12640
            ],
            [
                12668,
                12670
            ],
            [
                12670,
                12688
            ],
            [
                12688,
                12728
            ],
            [
                12728,
                12759
            ],
            [
                12759,
                12837
            ],
            [
                12837,
                12850
            ],
            [
                12850,
                12940
            ],
            [
                12945,
                12965
            ],
            [
                13029,
                13091
            ],
            [
                13135,
                13137
            ],
            [
                13137,
                13172
            ],
            [
                13172,
                13183
            ],
            [
                13209,
                13211
            ],
            [
                13220,
                13253
            ],
            [
                13323,
                13375
            ],
            [
                13381,
                13400
            ],
            [
                13411,
                13475
            ],
            [
                13475,
                13498
            ],
            [
                13498,
                13513
            ],
            [
                13513,
                13538
            ],
            [
                13549,
                13551
            ],
            [
                13551,
                13582
            ],
            [
                13604,
                13644
            ],
            [
                13644,
                13719
            ],
            [
                13719,
                13722
            ],
            [
                13723,
                13798
            ],
            [
                13858,
                13898
            ],
            [
                13898,
                13931
            ],
            [
                14026,
                14061
            ],
            [
                14061,
                14065
            ],
            [
                14067,
                14069
            ],
            [
                14071,
                14078
            ],
            [
                14078,
                14090
            ],
            [
                14162,
                14164
            ],
            [
                14164,
                14189
            ],
            [
                14216,
                14286
            ],
            [
                14300,
                14307
            ],
            [
                14365,
                14371
            ],
            [
                14351,
                14365
            ],
            [
                14403,
                14449
            ],
            [
                14449,
                14476
            ],
            [
                14805,
                14831
            ],
            [
                14831,
                14846
            ],
            [
                14846,
                14877
            ],
            [
                14877,
                14964
            ],
            [
                15209,
                15249
            ],
            [
                15286,
                15287
            ],
            [
                15319,
                15342
            ],
            [
                15355,
                15397
            ],
            [
                15409,
                15415
            ],
            [
                15437,
                15442
            ],
            [
                15422,
                15426
            ],
            [
                15449,
                15511
            ],
            [
                15610,
                15663
            ],
            [
                15564,
                15589
            ],
            [
                15690,
                15715
            ],
            [
                15793,
                15843
            ],
            [
                16096,
                16179
            ],
            [
                16194,
                16201
            ],
            [
                16317,
                16362
            ],
            [
                16479,
                16509
            ],
            [
                16267,
                16268
            ],
            [
                16584,
                16767
            ],
            [
                16767,
                16847
            ],
            [
                16927,
                16950
            ],
            [
                17006,
                17025
            ],
            [
                17082,
                17086
            ],
            [
                17136,
                17224
            ],
            [
                17224,
                17270
            ],
            [
                17287,
                17383
            ],
            [
                17906,
                17922
            ],
            [
                17961,
                17987
            ],
            [
                18010,
                18103
            ],
            [
                18148,
                18150
            ],
            [
                18150,
                18171
            ],
            [
                18203,
                18228
            ],
            [
                18292,
                18347
            ],
            [
                18385,
                18447
            ],
            [
                18447,
                18481
            ],
            [
                18527,
                18550
            ],
            [
                18594,
                18660
            ],
            [
                18661,
                18675
            ],
            [
                18839,
                18841
            ],
            [
                19132,
                19204
            ],
            [
                19291,
                19292
            ],
            [
                19276,
                19291
            ],
            [
                19241,
                19243
            ],
            [
                19308,
                19357
            ],
            [
                19372,
                19377
            ],
            [
                19227,
                19232
            ],
            [
                19377,
                19379
            ],
            [
                19379,
                19441
            ],
            [
                19448,
                19462
            ],
            [
                19468,
                19494
            ],
            [
                19512,
                19569
            ],
            [
                19603,
                19621
            ],
            [
                19621,
                19671
            ],
            [
                19865,
                19867
            ],
            [
                19965,
                19972
            ],
            [
                19871,
                19885
            ],
            [
                20040,
                20078
            ],
            [
                20100,
                20110
            ],
            [
                19806,
                19809
            ],
            [
                19868,
                19870
            ],
            [
                19981,
                19989
            ],
            [
                20132,
                20220
            ],
            [
                20239,
                20268
            ],
            [
                20268,
                20325
            ],
            [
                20353,
                20465
            ],
            [
                20504,
                20618
            ],
            [
                20502,
                20503
            ],
            [
                20619,
                20642
            ],
            [
                21170,
                21187
            ],
            [
                21214,
                21309
            ],
            [
                21314,
                21320
            ],
            [
                21344,
                21346
            ],
            [
                21346,
                21370
            ],
            [
                21414,
                21494
            ],
            [
                21551,
                21578
            ],
            [
                21603,
                21639
            ],
            [
                21639,
                21647
            ],
            [
                21658,
                21702
            ],
            [
                21703,
                21711
            ],
            [
                21711,
                21717
            ],
            [
                21717,
                21733
            ],
            [
                21733,
                21786
            ],
            [
                21792,
                21796
            ],
            [
                21787,
                21791
            ],
            [
                21806,
                21815
            ],
            [
                21815,
                21841
            ],
            [
                21958,
                22019
            ],
            [
                22019,
                22028
            ],
            [
                22050,
                22088
            ],
            [
                22092,
                22129
            ],
            [
                22129,
                22183
            ],
            [
                22204,
                22248
            ],
            [
                22259,
                22261
            ],
            [
                22262,
                22271
            ],
            [
                22271,
                22321
            ],
            [
                22321,
                22345
            ],
            [
                22345,
                22378
            ],
            [
                22743,
                22775
            ],
            [
                22775,
                22823
            ],
            [
                22850,
                23018
            ],
            [
                23018,
                23037
            ],
            [
                23050,
                23052
            ],
            [
                23052,
                23056
            ],
            [
                23061,
                23089
            ],
            [
                23103,
                23111
            ],
            [
                23056,
                23057
            ],
            [
                23196,
                23348
            ],
            [
                23360,
                23362
            ],
            [
                23362,
                23385
            ],
            [
                23412,
                23414
            ],
            [
                23414,
                23448
            ],
            [
                23453,
                23496
            ],
            [
                23510,
                23523
            ],
            [
                23536,
                23582
            ],
            [
                23582,
                23607
            ],
            [
                23656,
                23661
            ],
            [
                23699,
                23703
            ],
            [
                23844,
                23951
            ],
            [
                23951,
                23970
            ],
            [
                23984,
                23986
            ],
            [
                23986,
                24002
            ],
            [
                24025,
                24081
            ],
            [
                24120,
                24193
            ],
            [
                24198,
                24200
            ],
            [
                24200,
                24217
            ],
            [
                24227,
                24255
            ],
            [
                24402,
                24415
            ],
            [
                24427,
                24429
            ],
            [
                24447,
                24453
            ],
            [
                24433,
                24434
            ],
            [
                24455,
                24520
            ],
            [
                24532,
                24605
            ],
            [
                24631,
                24634
            ],
            [
                24634,
                24651
            ],
            [
                24651,
                24697
            ],
            [
                24715,
                24734
            ],
            [
                24949,
                24987
            ],
            [
                24987,
                24992
            ],
            [
                25002,
                25005
            ],
            [
                25071,
                25074
            ],
            [
                25013,
                25018
            ],
            [
                25006,
                25010
            ],
            [
                25055,
                25064
            ],
            [
                25113,
                25115
            ],
            [
                25126,
                25149
            ],
            [
                25153,
                25176
            ],
            [
                25150,
                25152
            ],
            [
                25208,
                25215
            ],
            [
                25193,
                25196
            ],
            [
                25204,
                25207
            ],
            [
                25405,
                25409
            ],
            [
                25218,
                25270
            ],
            [
                25310,
                25315
            ],
            [
                25294,
                25298
            ],
            [
                25303,
                25309
            ],
            [
                25316,
                25335
            ],
            [
                25409,
                25443
            ],
            [
                25454,
                25457
            ],
            [
                25445,
                25452
            ],
            [
                25465,
                25507
            ],
            [
                25507,
                25531
            ],
            [
                25532,
                25580
            ],
            [
                25596,
                25640
            ],
            [
                25690,
                25722
            ],
            [
                25646,
                25647
            ],
            [
                25734,
                25741
            ],
            [
                25975,
                26047
            ],
            [
                26056,
                26149
            ],
            [
                27031,
                27065
            ],
            [
                26996,
                27007
            ],
            [
                27152,
                27179
            ],
            [
                27212,
                27214
            ],
            [
                27214,
                27267
            ],
            [
                27275,
                27339
            ],
            [
                27370,
                27372
            ],
            [
                27391,
                27417
            ],
            [
                27426,
                27432
            ],
            [
                27418,
                27426
            ],
            [
                27462,
                27469
            ],
            [
                27433,
                27444
            ],
            [
                27470,
                27498
            ],
            [
                27498,
                27514
            ],
            [
                27528,
                27578
            ],
            [
                27592,
                27596
            ],
            [
                27597,
                27617
            ],
            [
                27617,
                27681
            ],
            [
                27708,
                27855
            ],
            [
                27865,
                27880
            ],
            [
                27894,
                27914
            ],
            [
                27935,
                27955
            ],
            [
                27992,
                28030
            ],
            [
                28165,
                28167
            ],
            [
                28200,
                28203
            ],
            [
                28204,
                28266
            ],
            [
                28305,
                28313
            ],
            [
                28182,
                28183
            ],
            [
                28198,
                28199
            ],
            [
                28302,
                28304
            ],
            [
                28313,
                28315
            ],
            [
                28407,
                28464
            ],
            [
                28470,
                28503
            ],
            [
                28616,
                28623
            ],
            [
                28623,
                28649
            ],
            [
                28649,
                28650
            ],
            [
                28672,
                28683
            ],
            [
                28683,
                28724
            ],
            [
                28737,
                28750
            ],
            [
                28750,
                28754
            ],
            [
                28754,
                28758
            ],
            [
                28758,
                28805
            ],
            [
                28833,
                28870
            ],
            [
                28917,
                28932
            ],
            [
                28949,
                28952
            ],
            [
                28952,
                28977
            ],
            [
                28996,
                28998
            ],
            [
                29104,
                29113
            ],
            [
                29358,
                29452
            ],
            [
                29452,
                29526
            ],
            [
                29606,
                29665
            ],
            [
                29665,
                29736
            ],
            [
                29737,
                29741
            ],
            [
                29843,
                29931
            ],
            [
                29931,
                29932
            ],
            [
                29944,
                29978
            ],
            [
                29978,
                29996
            ],
            [
                30034,
                30037
            ],
            [
                30051,
                30110
            ],
            [
                30110,
                30144
            ],
            [
                30172,
                30175
            ],
            [
                30175,
                30177
            ],
            [
                30217,
                30231
            ],
            [
                30262,
                30306
            ],
            [
                30307,
                30337
            ],
            [
                30337,
                30402
            ],
            [
                30402,
                30434
            ],
            [
                30477,
                30558
            ],
            [
                30558,
                30580
            ],
            [
                30580,
                30623
            ],
            [
                30721,
                30723
            ],
            [
                30723,
                30780
            ],
            [
                30845,
                30873
            ],
            [
                30891,
                30951
            ],
            [
                30951,
                30986
            ],
            [
                30986,
                31024
            ],
            [
                31024,
                31059
            ],
            [
                31082,
                31098
            ],
            [
                31112,
                31268
            ],
            [
                31278,
                31280
            ],
            [
                31280,
                31311
            ],
            [
                31391,
                31393
            ],
            [
                31396,
                31400
            ],
            [
                31400,
                31422
            ],
            [
                31422,
                31431
            ],
            [
                31433,
                31469
            ],
            [
                31508,
                31544
            ],
            [
                31545,
                31560
            ],
            [
                31571,
                31590
            ],
            [
                31486,
                31489
            ],
            [
                31657,
                31666
            ],
            [
                31732,
                31799
            ],
            [
                31799,
                31884
            ],
            [
                31948,
                31950
            ],
            [
                31950,
                32092
            ],
            [
                32149,
                32179
            ],
            [
                32179,
                32214
            ],
            [
                32225,
                32259
            ],
            [
                32270,
                32311
            ],
            [
                32558,
                32584
            ],
            [
                32585,
                32596
            ],
            [
                32656,
                32670
            ],
            [
                32673,
                32693
            ],
            [
                32715,
                32729
            ],
            [
                32703,
                32708
            ],
            [
                32747,
                32749
            ],
            [
                32749,
                32750
            ],
            [
                32790,
                32824
            ],
            [
                32781,
                32782
            ],
            [
                32891,
                32965
            ],
            [
                33048,
                33057
            ],
            [
                33057,
                33058
            ],
            [
                33095,
                33104
            ],
            [
                33109,
                33114
            ],
            [
                33194,
                33283
            ],
            [
                33302,
                33338
            ],
            [
                33412,
                33414
            ],
            [
                33414,
                33469
            ],
            [
                33602,
                33652
            ],
            [
                33652,
                33753
            ],
            [
                33753,
                33804
            ],
            [
                33825,
                33827
            ],
            [
                33888,
                33901
            ],
            [
                34011,
                34036
            ],
            [
                34036,
                34050
            ],
            [
                34050,
                34066
            ],
            [
                34066,
                34070
            ],
            [
                34070,
                34136
            ],
            [
                34136,
                34175
            ],
            [
                34175,
                34234
            ],
            [
                34288,
                34292
            ],
            [
                34253,
                34256
            ],
            [
                34293,
                34314
            ],
            [
                34344,
                34346
            ],
            [
                34346,
                34371
            ],
            [
                34399,
                34417
            ],
            [
                34453,
                34483
            ],
            [
                34509,
                34645
            ],
            [
                34657,
                34670
            ],
            [
                34686,
                34688
            ],
            [
                34780,
                34783
            ],
            [
                34790,
                34815
            ],
            [
                34825,
                34848
            ],
            [
                34858,
                34900
            ],
            [
                34945,
                34947
            ],
            [
                34947,
                34971
            ],
            [
                35128,
                35138
            ],
            [
                35013,
                35015
            ],
            [
                35139,
                35167
            ],
            [
                35167,
                35224
            ],
            [
                35234,
                35258
            ],
            [
                35267,
                35272
            ],
            [
                35281,
                35284
            ],
            [
                35331,
                35340
            ]
        ],
        "row_chars": [
            [
                0,
                221
            ],
            [
                221,
                463
            ],
            [
                463,
                559
            ],
            [
                559,
                684
            ],
            [
                684,
                959
            ],
            [
                959,
                1159
            ],
            [
                1159,
                1383
            ],
            [
                1383,
                1428
            ],
            [
                1428,
                1747
            ],
            [
                1747,
                1881
            ],
            [
                1881,
                1919
            ],
            [
                1919,
                1982
            ],
            [
                1982,
                2098
            ],
            [
                2098,
                2175
            ],
            [
                2175,
                2245
            ],
            [
                2245,
                2314
            ],
            [
                2314,
                2370
            ],
            [
                2370,
                2445
            ],
            [
                2445,
                2504
            ],
            [
                2504,
                2579
            ],
            [
                2579,
                2691
            ],
            [
                2691,
                2799
            ],
            [
                2799,
                2947
            ],
            [
                2947,
                3122
            ],
            [
                3122,
                3205
            ],
            [
                3205,
                3241
            ],
            [
                3241,
                3278
            ],
            [
                3278,
                3303
            ],
            [
                3303,
                3327
            ],
            [
                3327,
                3529
            ],
            [
                3529,
                3605
            ],
            [
                3605,
                3714
            ],
            [
                3714,
                3764
            ],
            [
                3764,
                3984
            ],
            [
                3984,
                4164
            ],
            [
                4164,
                4323
            ],
            [
                4323,
                4348
            ],
            [
                4348,
                4377
            ],
            [
                4377,
                4441
            ],
            [
                4441,
                4477
            ],
            [
                4477,
                4516
            ],
            [
                4516,
                4575
            ],
            [
                4575,
                4659
            ],
            [
                4659,
                4690
            ],
            [
                4690,
                4741
            ],
            [
                4741,
                4754
            ],
            [
                4754,
                4797
            ],
            [
                4797,
                4817
            ],
            [
                4817,
                4891
            ],
            [
                4891,
                5021
            ],
            [
                5021,
                5383
            ],
            [
                5383,
                5476
            ],
            [
                5476,
                5493
            ],
            [
                5493,
                5520
            ],
            [
                5520,
                5565
            ],
            [
                5565,
                5781
            ],
            [
                5781,
                5997
            ],
            [
                5997,
                6244
            ],
            [
                6244,
                6317
            ],
            [
                6317,
                6519
            ],
            [
                6519,
                6748
            ],
            [
                6748,
                7014
            ],
            [
                7014,
                7036
            ],
            [
                7036,
                7050
            ],
            [
                7050,
                7075
            ],
            [
                7075,
                7133
            ],
            [
                7133,
                7178
            ],
            [
                7178,
                7199
            ],
            [
                7199,
                7240
            ],
            [
                7240,
                7359
            ],
            [
                7359,
                7380
            ],
            [
                7380,
                7403
            ],
            [
                7403,
                7659
            ],
            [
                7659,
                7744
            ],
            [
                7744,
                7768
            ],
            [
                7768,
                7832
            ],
            [
                7832,
                7906
            ],
            [
                7906,
                8048
            ],
            [
                8048,
                8152
            ],
            [
                8152,
                8183
            ],
            [
                8183,
                8220
            ],
            [
                8220,
                8267
            ],
            [
                8267,
                8396
            ],
            [
                8396,
                8734
            ],
            [
                8734,
                8839
            ],
            [
                8839,
                9088
            ],
            [
                9088,
                9194
            ],
            [
                9194,
                9283
            ],
            [
                9283,
                9456
            ],
            [
                9456,
                9524
            ],
            [
                9524,
                9649
            ],
            [
                9649,
                9737
            ],
            [
                9737,
                9867
            ],
            [
                9867,
                10006
            ],
            [
                10006,
                10340
            ],
            [
                10340,
                10452
            ],
            [
                10452,
                10550
            ],
            [
                10550,
                10584
            ],
            [
                10584,
                10648
            ],
            [
                10648,
                10855
            ],
            [
                10855,
                10864
            ],
            [
                10864,
                10922
            ],
            [
                10922,
                10952
            ],
            [
                10952,
                11016
            ],
            [
                11016,
                11040
            ],
            [
                11040,
                11084
            ],
            [
                11084,
                11119
            ],
            [
                11119,
                11359
            ],
            [
                11359,
                11693
            ],
            [
                11693,
                11753
            ],
            [
                11753,
                11969
            ],
            [
                11969,
                12011
            ],
            [
                12011,
                12112
            ],
            [
                12112,
                12119
            ],
            [
                12119,
                12149
            ],
            [
                12149,
                12179
            ],
            [
                12179,
                12220
            ],
            [
                12220,
                12249
            ],
            [
                12249,
                12406
            ],
            [
                12406,
                12424
            ],
            [
                12424,
                12514
            ],
            [
                12514,
                12532
            ],
            [
                12532,
                12601
            ],
            [
                12601,
                12619
            ],
            [
                12619,
                12670
            ],
            [
                12670,
                12688
            ],
            [
                12688,
                12728
            ],
            [
                12728,
                12759
            ],
            [
                12759,
                12837
            ],
            [
                12837,
                12850
            ],
            [
                12850,
                13137
            ],
            [
                13137,
                13172
            ],
            [
                13172,
                13475
            ],
            [
                13475,
                13498
            ],
            [
                13498,
                13513
            ],
            [
                13513,
                13551
            ],
            [
                13551,
                13584
            ],
            [
                13584,
                13604
            ],
            [
                13604,
                13644
            ],
            [
                13644,
                13719
            ],
            [
                13719,
                13798
            ],
            [
                13798,
                13834
            ],
            [
                13834,
                13898
            ],
            [
                13898,
                13931
            ],
            [
                13931,
                13959
            ],
            [
                13959,
                13972
            ],
            [
                13972,
                14019
            ],
            [
                14019,
                14061
            ],
            [
                14061,
                14078
            ],
            [
                14078,
                14164
            ],
            [
                14164,
                14449
            ],
            [
                14449,
                14478
            ],
            [
                14478,
                14559
            ],
            [
                14559,
                14648
            ],
            [
                14648,
                14726
            ],
            [
                14726,
                14738
            ],
            [
                14738,
                14805
            ],
            [
                14805,
                14831
            ],
            [
                14831,
                14846
            ],
            [
                14846,
                14877
            ],
            [
                14877,
                14964
            ],
            [
                14964,
                15147
            ],
            [
                15147,
                15209
            ],
            [
                15209,
                15511
            ],
            [
                15511,
                15715
            ],
            [
                15715,
                15793
            ],
            [
                15793,
                15843
            ],
            [
                15843,
                16014
            ],
            [
                16014,
                16059
            ],
            [
                16059,
                16096
            ],
            [
                16096,
                16767
            ],
            [
                16767,
                16952
            ],
            [
                16952,
                17006
            ],
            [
                17006,
                17224
            ],
            [
                17224,
                17429
            ],
            [
                17429,
                17718
            ],
            [
                17718,
                17806
            ],
            [
                17806,
                17906
            ],
            [
                17906,
                18150
            ],
            [
                18150,
                18229
            ],
            [
                18229,
                18292
            ],
            [
                18292,
                18447
            ],
            [
                18447,
                18661
            ],
            [
                18661,
                18841
            ],
            [
                18841,
                19132
            ],
            [
                19132,
                19379
            ],
            [
                19379,
                19621
            ],
            [
                19621,
                19672
            ],
            [
                19672,
                19806
            ],
            [
                19806,
                20268
            ],
            [
                20268,
                20643
            ],
            [
                20643,
                20678
            ],
            [
                20678,
                21021
            ],
            [
                21021,
                21170
            ],
            [
                21170,
                21346
            ],
            [
                21346,
                21495
            ],
            [
                21495,
                21551
            ],
            [
                21551,
                21639
            ],
            [
                21639,
                21711
            ],
            [
                21711,
                21717
            ],
            [
                21717,
                21733
            ],
            [
                21733,
                21815
            ],
            [
                21815,
                21841
            ],
            [
                21841,
                21907
            ],
            [
                21907,
                21958
            ],
            [
                21958,
                22019
            ],
            [
                22019,
                22129
            ],
            [
                22129,
                22271
            ],
            [
                22271,
                22321
            ],
            [
                22321,
                22345
            ],
            [
                22345,
                22380
            ],
            [
                22380,
                22500
            ],
            [
                22500,
                22585
            ],
            [
                22585,
                22696
            ],
            [
                22696,
                22743
            ],
            [
                22743,
                22775
            ],
            [
                22775,
                23018
            ],
            [
                23018,
                23052
            ],
            [
                23052,
                23362
            ],
            [
                23362,
                23414
            ],
            [
                23414,
                23582
            ],
            [
                23582,
                23951
            ],
            [
                23951,
                23986
            ],
            [
                23986,
                24003
            ],
            [
                24003,
                24025
            ],
            [
                24025,
                24200
            ],
            [
                24200,
                24255
            ],
            [
                24255,
                24286
            ],
            [
                24286,
                24402
            ],
            [
                24402,
                24634
            ],
            [
                24634,
                24651
            ],
            [
                24651,
                24987
            ],
            [
                24987,
                25115
            ],
            [
                25115,
                25507
            ],
            [
                25507,
                25580
            ],
            [
                25580,
                25741
            ],
            [
                25741,
                25975
            ],
            [
                25975,
                26149
            ],
            [
                26149,
                26337
            ],
            [
                26337,
                26426
            ],
            [
                26426,
                26618
            ],
            [
                26618,
                26984
            ],
            [
                26984,
                27214
            ],
            [
                27214,
                27372
            ],
            [
                27372,
                27498
            ],
            [
                27498,
                27617
            ],
            [
                27617,
                28167
            ],
            [
                28167,
                28315
            ],
            [
                28315,
                28503
            ],
            [
                28503,
                28616
            ],
            [
                28616,
                28623
            ],
            [
                28623,
                28649
            ],
            [
                28649,
                28683
            ],
            [
                28683,
                28724
            ],
            [
                28724,
                28750
            ],
            [
                28750,
                28754
            ],
            [
                28754,
                28758
            ],
            [
                28758,
                28870
            ],
            [
                28870,
                28917
            ],
            [
                28917,
                28952
            ],
            [
                28952,
                28998
            ],
            [
                28998,
                29452
            ],
            [
                29452,
                29527
            ],
            [
                29527,
                29606
            ],
            [
                29606,
                29742
            ],
            [
                29742,
                29843
            ],
            [
                29843,
                29931
            ],
            [
                29931,
                29978
            ],
            [
                29978,
                29996
            ],
            [
                29996,
                30110
            ],
            [
                30110,
                30175
            ],
            [
                30175,
                30307
            ],
            [
                30307,
                30337
            ],
            [
                30337,
                30402
            ],
            [
                30402,
                30436
            ],
            [
                30436,
                30452
            ],
            [
                30452,
                30477
            ],
            [
                30477,
                30558
            ],
            [
                30558,
                30580
            ],
            [
                30580,
                30723
            ],
            [
                30723,
                30951
            ],
            [
                30951,
                30986
            ],
            [
                30986,
                31024
            ],
            [
                31024,
                31059
            ],
            [
                31059,
                31082
            ],
            [
                31082,
                31280
            ],
            [
                31280,
                31311
            ],
            [
                31311,
                31357
            ],
            [
                31357,
                31391
            ],
            [
                31391,
                31400
            ],
            [
                31400,
                31422
            ],
            [
                31422,
                31667
            ],
            [
                31667,
                31732
            ],
            [
                31732,
                31799
            ],
            [
                31799,
                31950
            ],
            [
                31950,
                32179
            ],
            [
                32179,
                32311
            ],
            [
                32311,
                32325
            ],
            [
                32325,
                32347
            ],
            [
                32347,
                32358
            ],
            [
                32358,
                32449
            ],
            [
                32449,
                32471
            ],
            [
                32471,
                32558
            ],
            [
                32558,
                32670
            ],
            [
                32670,
                32749
            ],
            [
                32749,
                32827
            ],
            [
                32827,
                32880
            ],
            [
                32880,
                32891
            ],
            [
                32891,
                32967
            ],
            [
                32967,
                33048
            ],
            [
                33048,
                33414
            ],
            [
                33414,
                33556
            ],
            [
                33556,
                33573
            ],
            [
                33573,
                33602
            ],
            [
                33602,
                33652
            ],
            [
                33652,
                33753
            ],
            [
                33753,
                33827
            ],
            [
                33827,
                34036
            ],
            [
                34036,
                34050
            ],
            [
                34050,
                34066
            ],
            [
                34066,
                34070
            ],
            [
                34070,
                34136
            ],
            [
                34136,
                34175
            ],
            [
                34175,
                34346
            ],
            [
                34346,
                34483
            ],
            [
                34483,
                34688
            ],
            [
                34688,
                34751
            ],
            [
                34751,
                34774
            ],
            [
                34774,
                34947
            ],
            [
                34947,
                35167
            ],
            [
                35167,
                35340
            ]
        ]
    },
    "abridged": {
        "text": "The name of Mr. Vholes is inscribed upon a door-post in Symond's Inn, Chancery Lane - a little, pale, wall-eyed, woebegone building. Mr. Vholes's office is squeezed up in a corner and blinks at a dead wall. Three feet of knotty-floored dark passage bring the client to Mr. Vholes's jet-black door.\nMr. Vholes's chambers are on so small a scale that one clerk can open the door without getting off his stool, while the other has equal facilities for poking the fire. An unwholesome smell of mutton is due to the nightly consumption of candles and to the keeping of parchment skins in greasy drawers. The two chimneys smoke, and there is a loose surface of soot everywhere, and the dull cracked windows are always dirty and always shut.\nMr. Vholes is a very respectable man. He never takes any pleasure, which is a mark of respectability. He is reserved and serious, which is another mark of respectability. His digestion is impaired, which is highly respectable. And he has three daughters. And his father is dependent on him in the Vale of Taunton.\nThe one great principle of the English law is to make business for itself. There is no other principle so consistently maintained through all its narrow turnings. Viewed by this light it becomes a coherent scheme and not the monstrous maze most people think it. If they perceive that its grand principle is to make business for itself at their expense, surely they will cease to grumble.\nBut not perceiving this quite plainly, most people do grumble. Then this respectability of Mr. Vholes is brought into powerful play. \"The social system cannot afford,\" Mr. Kenge will say, \"to lose an order of men like Mr. Vholes. Diligent, persevering, steady, acute in business. My dear sir, I understand your feelings; but I can never raise my voice for the demolition of a class of men like Mr. Vholes.\"\nSome authorities will remark that they don't know what this age is coming to, that we are plunging down precipices, that these changes are death to people like Vholes - a man of undoubted respectability, with a father in the Vale of Taunton, and three daughters at home. Take a few steps more in this direction, say they, and what is to become of Vholes's father? Is he to perish? And what of Vholes's daughters? In a word, Mr. Vholes is continually doing duty, like a piece of timber, to shore up some decayed foundation that has become a pitfall and a nuisance.\nThe Chancellor is \"up\" for the long vacation. Mr. Vholes, and his young client, and several blue bags hastily stuffed, have returned to the official den. Mr. Vholes, quiet and unmoved in his respectability, takes off his close black gloves as if he were skinning his hands, lifts off his tight hat and sits down at his desk. The client throws his hat and gloves anywhere, without caring where they go; flings himself into a chair, half sighing and half groaning; rests his aching head upon his hand and looks the portrait of young despair.\n\"Again nothing done!\" says Richard.\n\"Don't say nothing done, sir,\" returns the placid Vholes. \"That is scarcely fair, sir!\"\n\"Why, what is done?\" says Richard gloomily.\n\"That may not be the whole question,\" returns Vholes. \"The question may be, what is doing?\"\n\"And what is doing?\" asks the moody client.\n\"A good deal is doing, sir. We have put our shoulders to the wheel, Mr. Carstone, and the wheel is going round.\"\n\"How am I to get through the next four or five accursed months?\" exclaims the young man, rising from his chair and walking about the room.\n\"Mr. C.,\" returns Vholes, following him with his eyes wherever he goes, \"your spirits are hasty. Excuse me if I recommend you not to be so impetuous, not to wear yourself out so. You should have more patience.\"\n\"I ought to imitate you, in fact, Mr. Vholes?\" says Richard, sitting down again with an impatient laugh.\n\"Sir,\" returns Vholes, always looking at the client as if he were making a lingering meal of him with his eyes as well as with his professional appetite, \"Sir, I should not have the presumption to propose myself as a model for your imitation. But I will acknowledge that I should like to impart to you a little of my - come, sir, you call it insensibility, and I have no objection - a little of my insensibility.\"\n\"Mr. Vholes,\" explains the client, somewhat abashed, \"I did not mean to accuse you of insensibility.\"\n\"I think you did, sir, very naturally,\" returns the equable Vholes. \"It is my duty to attend to your interests with a cool head, and I can quite understand that to your excited feelings I may appear insensible. My daughters may know me better; my aged father may know me better. But they have known me much longer than you have. Your interests demand that I should be cool and methodical, Mr. Carstone.\"\nMr. Vholes fixes his charmed gaze again on his young client and proceeds in his half-audible voice, \"What are you to do, sir, you inquire, during the vacation? I should hope you gentlemen of the army may find many means of amusing yourselves. If you had asked me what I was to do during the vacation, I could have answered you readily. I am to be found here, day by day, attending to your interests. That is my duty, Mr. C. Other professional men go out of town. I don't.\"\n\"I am perfectly aware, Mr. Vholes,\" says Richard, more good-humouredly, \"that you are the most reliable fellow in the world. But put yourself in my case, dragging on this dislocated life, sinking deeper and deeper into difficulty every day, continually hoping and continually disappointed, with no change for the better, and you will find it a dark-looking case sometimes, as I do.\"\n\"You know,\" says Mr. Vholes, \"that I never give hopes, sir. I told you that from the first, Mr. C. Particularly in a case like this, where the greater part of the costs comes out of the estate, I never give hopes. It might seem as if costs were my object. Still, when you say there is no change for the better, I must deny that.\"\n\"Aye?\" returns Richard, brightening.\n\"Mr. Carstone, you are separately represented now, and no longer hidden and lost in the interests of others. That's something. The suit does not sleep; we wake it up, we walk it about. That's something. It's not all Jarndyce. That's something. Nobody has it all his own way now, sir. And that's something, surely.\"\nRichard, his face flushing suddenly, strikes the desk with his clenched hand.\n\"Mr. Vholes! If any man had told me when I first went to John Jarndyce's house that he was anything but a disinterested friend - I could have found no words strong enough to repel the slander. So little did I know of the world! Whereas now he has become to me the embodiment of the suit; the more I suffer, the more indignant I am with him; every new delay and disappointment is only a new injury from John Jarndyce's hand.\"\n\"No, no,\" says Vholes. \"Don't say so. We ought to have patience. Besides, I never disparage, sir.\"\n\"Mr. Vholes,\" returns the angry client. \"You know as well as I that he would have strangled the suit if he could.\"\n\"He certainly was not active in it,\" Mr. Vholes admits with an appearance of reluctance. \"However, he might have had amiable intentions. Who can read the heart, Mr. C.!\"\n\"Are not our interests conflicting? Tell me that!\" says Richard.\n\"Mr. C.,\" returns Vholes, never winking his hungry eyes, \"I should be wanting in my duty as your adviser, if I said your interests are identical with the interests of Mr. Jarndyce. They are no such thing, sir.\"\n\"Of course they are not!\" cries Richard. \"You found that out long ago.\"\n\"Mr. C.,\" returns Vholes, \"I wish to say no more of any third party than is necessary. When Mr. Skimpole did me the honour, sir, of bringing us together, I mentioned to you that I could offer no advice while your interests were entrusted to another member of the profession. You, sir, thought fit to withdraw your interests from Kenge and Carboy's office and to offer them to me. Those interests are now paramount in this office. During the long vacation, sir, I shall devote my leisure to studying your interests closely; and when I ultimately congratulate you, sir, on your accession to fortune, you will owe me nothing beyond whatever little balance may be then outstanding of the costs as between solicitor and client not included in the taxed costs allowed out of the estate. I pretend to no claim upon you, Mr. C., but for the zealous and active discharge of my professional duty.\"\nVholes finally adds that perhaps Mr. C. will favour him with an order on his agent for twenty pounds on account.\n\"For there have been many little consultations of late, sir,\" observes Vholes, turning over the leaves of his diary, \"and these things mount up.\"\nThe client, with his vague hopes rekindled, writes the draft, not without perplexed consideration and calculation of the date it may bear. All the while, Vholes looks at him attentively.\nLastly, the client, shaking hands, beseeches Mr. Vholes to do his utmost to \"pull him through\" the Court of Chancery. Mr. Vholes, who never gives hopes, answers with a smile, \"You will always find me here, sir, with my shoulder to the wheel.\"\nThus they part. Richard, emerging from the heavy shade of Symond's Inn into the sunshine, walks thoughtfully on to Lincoln's Inn, and passes under the shadow of the trees there. On many such loungers have the speckled shadows of those trees fallen; on the bent head, the bitten nail, the lingering step, the purposeless and dreamy air, the life turned sour. This lounger is not shabby yet, but that may come.\nAs Richard saunters away, his heart is heavy with corroding care and doubt, yet he may feel some sorrowful wonder when he recalls how different his first visit there, how different all the colours of his mind. But injustice breeds injustice; the fighting with shadows necessitates the setting up of substances to combat; from the impalpable suit which no man alive can understand, it has become a gloomy relief to turn to the palpable figure of the friend who would have saved him from this ruin, and make him his enemy.\nTwo pairs of eyes look after him, as, biting his nails and brooding, he crosses the square and is swallowed up by shadow. Mr. Guppy and Mr. Weevle have been leaning in conversation against the low stone parapet under the trees.\n\"William,\" says Mr. Weevle, \"there's combustion going on there! It's not spontaneous, but it's smouldering combustion, it is.\"\n\"Ah!\" says Mr. Guppy. \"He wouldn't keep out of Jarndyce, and I suppose he's head over heels in debt. I never knew much of him. Well, Tony, that as I was mentioning is what they're up to.\"\nMr. Guppy resettles himself against the parapet, resuming a conversation of interest.\n\"They are still up to it, sir,\" says Mr. Guppy, \"still examining papers, still going over the heaps of Krook's rubbish. At this rate they'll be at it these seven years.\"\n\"And Small is helping?\"\n\"Small left us at a week's notice.\"\n\"You haven't looked in at all?\"\n\"Tony,\" says Mr. Guppy, a little disconcerted, \"I don't greatly relish the house, except in your company, and therefore I have not; and therefore I proposed this little appointment for our fetching away your things. There goes the hour! Tony-\" Mr. Guppy becomes mysteriously eloquent - \"circumstances over which I have no control have made a melancholy alteration in my most cherished plans and in that unrequited image which I formerly mentioned to you. That image is shattered. My only wish now in connexion with those objects which I had an idea of carrying out with your aid is to let 'em alone and bury 'em in oblivion. Do you think it possible, Tony, that he put those letters away anywhere, after you saw him alive, and that they were not destroyed that night?\"\nMr. Weevle reflects. Shakes his head.\n\"Tony,\" says Mr. Guppy as they walk towards the court, \"without entering into further explanations, I may repeat that the idol is laid low. I have no purpose now but burial in oblivion. If you was to tell me with a wink or a nod that you saw lying anywhere in your late lodgings any papers that looked like the papers in question, I would pitch them into the fire, sir.\"\nMr. Weevle nods. Mr. Guppy, much elevated in his own opinion by these observations, accompanies his friend with dignity to the court.\nNever has the court been so full of gossip. Every morning at eight, the elder Mr. Smallweed is carried into the rag and bottle shop, accompanied by Mrs. Smallweed, Judy, and Bart; and there they remain until nine at night, rummaging and searching, digging and delving among the treasures of the late lamented. What those treasures are, they keep so secret that the court is maddened. It imagines guineas pouring out of tea-pots, and mattresses stuffed with bank-notes. Twice when the dustman is called in to carry off a cartload of old paper and broken bottles, the whole court assembles and pries into the baskets as they come forth. As Mrs. Piper and Mrs. Perkins now tell Mr. Weevle, the court is in one continual ferment.\nMr. Weevle and Mr. Guppy, with every eye in the court upon them, knock at the closed door of the late lamented's house. Contrary to the court's expectation, they are admitted and are immediately considered to mean no good.\nThe shutters are closed all over the house, and the ground-floor is dark enough to require candles. Introduced into the back shop by Mr. Smallweed the younger, they can at first see nothing save darkness and shadows; but they gradually discern the elder Mr. Smallweed seated in his chair upon the brink of a well of waste-paper, Judy groping therein, and Mrs. Smallweed nearby snowed up in a heap of paper fragments. They are all blackened with dust and dirt and present a fiendish appearance; while the room is more littered and dirtier, if possible, than of old. It is ghostly with traces of its dead inhabitant and even his chalked writing on the wall.\n\"Aha!\" croaks the old gentleman. \"How de do! Come to fetch your property, Mr. Weevle? That's well. Ha! Ha! We should have been forced to sell you up, sir, if you had left it here much longer. Glad to see you!\"\nMr. Weevle, thanking him, looks around. So does Mr. Guppy; who starts at seeing Mr. Tulkinghorn standing in the darkness opposite with his hands behind him.\n\"Gentleman so kind as to act as my solicitor,\" says Grandfather Smallweed.\nMr. Guppy, slightly nudging his friend to take another look around, makes a shuffling bow to Mr. Tulkinghorn, who returns it with an easy, amused nod.\n\"A good deal of property here, sir, I should say,\" Mr. Guppy observes to Mr. Smallweed.\n\"Rags and rubbish, my dear friend! Rags and rubbish! We are trying to make out an inventory of what's worth anything to sell. But we haven't come to much as yet!\"\nMr. Weevle's eye has again gone round the room and come back. \"Well, sir,\" says Mr. Weevle. \"We won't intrude any longer if you'll allow us to go upstairs.\"\n\"Anywhere, my dear sir, anywhere!\"\nAs they go upstairs, Mr. Guppy lifts his eyebrows inquiringly and looks at Tony. Tony shakes his head. They find the old room very dull and dismal. They have a great disinclination to touch any object, and do not prolong their visit, packing up with all possible speed and never speaking above a whisper.\n\"Look here,\" says Tony, recoiling. \"Here's that horrible cat coming in!\"\nMr. Guppy retreats behind a chair. \"Small told me she went leaping and tearing about that night like a dragon, and got out on the house-top, and roamed about up there for a fortnight, and then came tumbling down the chimney. Did you ever see such a brute? Shoo! Get out, you goblin!\"\nLady Jane in the doorway, with her tiger snarl, shows no intention of obeying; but when Mr. Tulkinghorn stumbles over her, she spits and runs upstairs.\n\"Mr. Guppy,\" says Mr. Tulkinghorn, \"could I have a word with you?\"\nMr. Guppy is engaged in collecting the Galaxy Gallery of British Beauty from the wall. \"Sir,\" he returns, reddening, \"I wish to act with courtesy towards every member of the profession, and especially, I am sure, towards a member so distinguished as yourself. Still, Mr. Tulkinghorn, sir, I must ask that if you have any word with me, it is spoken in the presence of my friend.\"\n\"The matter is not of that much consequence, Mr. Guppy.\" Mr. Tulkinghorn pauses here to smile a dull and rusty smile. \"You are a fortunate young man, sir. You have high friends, free admission to great houses, and access to elegant ladies!\"\nMr. Guppy says, reddening still more, \"Sir, if I attend to my profession and do what is right by Kenge and Carboy, my friends are of no consequence to them nor to anyone else. I am not under any obligation to explain myself further.\"\n\"Quite so,\" says Mr. Tulkinghorn with a calm nod. \"Very good; I see by these portraits that you take a strong interest in the fashionable great, sir?\"\nHe addresses this to the astounded Tony, who admits it.\nMr. Tulkinghorn puts his glasses to his eyes. \"Who is this? 'Lady Dedlock.' Ha! A very good likeness in its way, but it wants force of character. Good day to you, gentlemen; good day!\"\nWhen he has walked out, Mr. Guppy, in a great perspiration, hastily takes down the rest of the Galaxy Gallery.\n\"Tony,\" he says hurriedly, \"let us be quick in getting out of this place. I cannot conceal from you, Tony, that between myself and one of the members of a swan-like aristocracy whom I now hold in my hand, there has been some communication. I can say no more due to the oath I have taken, the shattered idol, and circumstances over which I have no control. I charge you as a friend to bury it in oblivion without a word of inquiry!\"\nThis charge Mr. Guppy delivers in a state little short of lunacy, while his friend appears dazed down to his whiskers.",
        "paragraph_chars": [
            [
                0,
                298
            ],
            [
                298,
                735
            ],
            [
                735,
                1049
            ],
            [
                1049,
                1437
            ],
            [
                1437,
                1844
            ],
            [
                1844,
                2408
            ],
            [
                2408,
                2948
            ],
            [
                2948,
                2984
            ],
            [
                2984,
                3072
            ],
            [
                3072,
                3116
            ],
            [
                3116,
                3208
            ],
            [
                3208,
                3252
            ],
            [
                3252,
                3365
            ],
            [
                3365,
                3504
            ],
            [
                3504,
                3715
            ],
            [
                3715,
                3820
            ],
            [
                3820,
                4234
            ],
            [
                4234,
                4336
            ],
            [
                4336,
                4740
            ],
            [
                4740,
                5213
            ],
            [
                5213,
                5596
            ],
            [
                5596,
                5926
            ],
            [
                5926,
                5963
            ],
            [
                5963,
                6278
            ],
            [
                6278,
                6356
            ],
            [
                6356,
                6781
            ],
            [
                6781,
                6880
            ],
            [
                6880,
                6995
            ],
            [
                6995,
                7165
            ],
            [
                7165,
                7230
            ],
            [
                7230,
                7441
            ],
            [
                7441,
                7513
            ],
            [
                7513,
                8401
            ],
            [
                8401,
                8514
            ],
            [
                8514,
                8660
            ],
            [
                8660,
                8847
            ],
            [
                8847,
                9090
            ],
            [
                9090,
                9499
            ],
            [
                9499,
                10020
            ],
            [
                10020,
                10248
            ],
            [
                10248,
                10375
            ],
            [
                10375,
                10563
            ],
            [
                10563,
                10649
            ],
            [
                10649,
                10819
            ],
            [
                10819,
                10843
            ],
            [
                10843,
                10879
            ],
            [
                10879,
                10911
            ],
            [
                10911,
                11680
            ],
            [
                11680,
                11718
            ],
            [
                11718,
                12089
            ],
            [
                12089,
                12223
            ],
            [
                12223,
                12949
            ],
            [
                12949,
                13172
            ],
            [
                13172,
                13828
            ],
            [
                13828,
                14038
            ],
            [
                14038,
                14195
            ],
            [
                14195,
                14270
            ],
            [
                14270,
                14421
            ],
            [
                14421,
                14509
            ],
            [
                14509,
                14672
            ],
            [
                14672,
                14829
            ],
            [
                14829,
                14864
            ],
            [
                14864,
                15169
            ],
            [
                15169,
                15242
            ],
            [
                15242,
                15526
            ],
            [
                15526,
                15678
            ],
            [
                15678,
                15745
            ],
            [
                15745,
                16124
            ],
            [
                16124,
                16365
            ],
            [
                16365,
                16599
            ],
            [
                16599,
                16750
            ],
            [
                16750,
                16806
            ],
            [
                16806,
                16991
            ],
            [
                16991,
                17102
            ],
            [
                17102,
                17534
            ],
            [
                17534,
                17652
            ]
        ],
        "segment_chars": [
            [
                0,
                133
            ],
            [
                133,
                207
            ],
            [
                207,
                298
            ],
            [
                298,
                466
            ],
            [
                466,
                599
            ],
            [
                599,
                735
            ],
            [
                735,
                773
            ],
            [
                773,
                837
            ],
            [
                837,
                906
            ],
            [
                906,
                962
            ],
            [
                962,
                990
            ],
            [
                990,
                1049
            ],
            [
                1049,
                1124
            ],
            [
                1124,
                1212
            ],
            [
                1212,
                1311
            ],
            [
                1311,
                1437
            ],
            [
                1437,
                1500
            ],
            [
                1500,
                1570
            ],
            [
                1570,
                1667
            ],
            [
                1667,
                1717
            ],
            [
                1717,
                1844
            ],
            [
                1844,
                2115
            ],
            [
                2115,
                2208
            ],
            [
                2208,
                2225
            ],
            [
                2225,
                2257
            ],
            [
                2257,
                2408
            ],
            [
                2408,
                2454
            ],
            [
                2454,
                2562
            ],
            [
                2562,
                2733
            ],
            [
                2733,
                2948
            ],
            [
                2948,
                2970
            ],
            [
                2970,
                2984
            ],
            [
                2984,
                3042
            ],
            [
                3042,
                3072
            ],
            [
                3072,
                3093
            ],
            [
                3093,
                3116
            ],
            [
                3116,
                3170
            ],
            [
                3170,
                3208
            ],
            [
                3208,
                3229
            ],
            [
                3229,
                3252
            ],
            [
                3252,
                3280
            ],
            [
                3280,
                3365
            ],
            [
                3365,
                3430
            ],
            [
                3430,
                3504
            ],
            [
                3504,
                3601
            ],
            [
                3601,
                3683
            ],
            [
                3683,
                3715
            ],
            [
                3715,
                3762
            ],
            [
                3762,
                3820
            ],
            [
                3820,
                4063
            ],
            [
                4063,
                4234
            ],
            [
                4234,
                4336
            ],
            [
                4336,
                4404
            ],
            [
                4404,
                4547
            ],
            [
                4547,
                4615
            ],
            [
                4615,
                4665
            ],
            [
                4665,
                4740
            ],
            [
                4740,
                4900
            ],
            [
                4900,
                4983
            ],
            [
                4983,
                5076
            ],
            [
                5076,
                5140
            ],
            [
                5140,
                5203
            ],
            [
                5203,
                5213
            ],
            [
                5213,
                5338
            ],
            [
                5338,
                5596
            ],
            [
                5596,
                5656
            ],
            [
                5656,
                5810
            ],
            [
                5810,
                5852
            ],
            [
                5852,
                5926
            ],
            [
                5926,
                5933
            ],
            [
                5933,
                5963
            ],
            [
                5963,
                6072
            ],
            [
                6072,
                6090
            ],
            [
                6090,
                6148
            ],
            [
                6148,
                6166
            ],
            [
                6166,
                6189
            ],
            [
                6189,
                6207
            ],
            [
                6207,
                6247
            ],
            [
                6247,
                6278
            ],
            [
                6278,
                6356
            ],
            [
                6356,
                6369
            ],
            [
                6369,
                6549
            ],
            [
                6549,
                6584
            ],
            [
                6584,
                6781
            ],
            [
                6781,
                6804
            ],
            [
                6804,
                6819
            ],
            [
                6819,
                6846
            ],
            [
                6846,
                6880
            ],
            [
                6880,
                6920
            ],
            [
                6920,
                6995
            ],
            [
                6995,
                7084
            ],
            [
                7084,
                7132
            ],
            [
                7132,
                7165
            ],
            [
                7165,
                7201
            ],
            [
                7201,
                7216
            ],
            [
                7216,
                7230
            ],
            [
                7230,
                7411
            ],
            [
                7411,
                7441
            ],
            [
                7441,
                7467
            ],
            [
                7467,
                7482
            ],
            [
                7482,
                7513
            ],
            [
                7513,
                7600
            ],
            [
                7600,
                7788
            ],
            [
                7788,
                7893
            ],
            [
                7893,
                7943
            ],
            [
                7943,
                8294
            ],
            [
                8294,
                8401
            ],
            [
                8401,
                8514
            ],
            [
                8514,
                8660
            ],
            [
                8660,
                8799
            ],
            [
                8799,
                8847
            ],
            [
                8847,
                8965
            ],
            [
                8965,
                9090
            ],
            [
                9090,
                9106
            ],
            [
                9106,
                9268
            ],
            [
                9268,
                9448
            ],
            [
                9448,
                9499
            ],
            [
                9499,
                9709
            ],
            [
                9709,
                10020
            ],
            [
                10020,
                10142
            ],
            [
                10142,
                10248
            ],
            [
                10248,
                10312
            ],
            [
                10312,
                10375
            ],
            [
                10375,
                10381
            ],
            [
                10381,
                10397
            ],
            [
                10397,
                10476
            ],
            [
                10476,
                10502
            ],
            [
                10502,
                10563
            ],
            [
                10563,
                10649
            ],
            [
                10649,
                10769
            ],
            [
                10769,
                10819
            ],
            [
                10819,
                10843
            ],
            [
                10843,
                10879
            ],
            [
                10879,
                10911
            ],
            [
                10911,
                11127
            ],
            [
                11127,
                11148
            ],
            [
                11148,
                11366
            ],
            [
                11366,
                11391
            ],
            [
                11391,
                11536
            ],
            [
                11536,
                11680
            ],
            [
                11680,
                11701
            ],
            [
                11701,
                11718
            ],
            [
                11718,
                11858
            ],
            [
                11858,
                11904
            ],
            [
                11904,
                12089
            ],
            [
                12089,
                12106
            ],
            [
                12106,
                12223
            ],
            [
                12223,
                12267
            ],
            [
                12267,
                12533
            ],
            [
                12533,
                12607
            ],
            [
                12607,
                12692
            ],
            [
                12692,
                12858
            ],
            [
                12858,
                12949
            ],
            [
                12949,
                13069
            ],
            [
                13069,
                13172
            ],
            [
                13172,
                13272
            ],
            [
                13272,
                13589
            ],
            [
                13589,
                13737
            ],
            [
                13737,
                13828
            ],
            [
                13828,
                13835
            ],
            [
                13835,
                13861
            ],
            [
                13861,
                13873
            ],
            [
                13873,
                13914
            ],
            [
                13914,
                13927
            ],
            [
                13927,
                13931
            ],
            [
                13931,
                13935
            ],
            [
                13935,
                14020
            ],
            [
                14020,
                14038
            ],
            [
                14038,
                14078
            ],
            [
                14078,
                14195
            ],
            [
                14195,
                14270
            ],
            [
                14270,
                14421
            ],
            [
                14421,
                14509
            ],
            [
                14509,
                14544
            ],
            [
                14544,
                14562
            ],
            [
                14562,
                14635
            ],
            [
                14635,
                14672
            ],
            [
                14672,
                14734
            ],
            [
                14734,
                14764
            ],
            [
                14764,
                14829
            ],
            [
                14829,
                14864
            ],
            [
                14864,
                14945
            ],
            [
                14945,
                14967
            ],
            [
                14967,
                15012
            ],
            [
                15012,
                15169
            ],
            [
                15169,
                15204
            ],
            [
                15204,
                15242
            ],
            [
                15242,
                15277
            ],
            [
                15277,
                15467
            ],
            [
                15467,
                15498
            ],
            [
                15498,
                15504
            ],
            [
                15504,
                15526
            ],
            [
                15526,
                15678
            ],
            [
                15678,
                15745
            ],
            [
                15745,
                15832
            ],
            [
                15832,
                16005
            ],
            [
                16005,
                16124
            ],
            [
                16124,
                16181
            ],
            [
                16181,
                16242
            ],
            [
                16242,
                16279
            ],
            [
                16279,
                16365
            ],
            [
                16365,
                16541
            ],
            [
                16541,
                16599
            ],
            [
                16599,
                16649
            ],
            [
                16649,
                16750
            ],
            [
                16750,
                16806
            ],
            [
                16806,
                16852
            ],
            [
                16852,
                16866
            ],
            [
                16866,
                16882
            ],
            [
                16882,
                16886
            ],
            [
                16886,
                16952
            ],
            [
                16952,
                16991
            ],
            [
                16991,
                17102
            ],
            [
                17102,
                17176
            ],
            [
                17176,
                17342
            ],
            [
                17342,
                17458
            ],
            [
                17458,
                17534
            ],
            [
                17534,
                17652
            ]
        ],
        "overlap_chars": [
            [
                0,
                22
            ],
            [
                23,
                83
            ],
            [
                84,
                85
            ],
            [
                86,
                122
            ],
            [
                131,
                133
            ],
            [
                133,
                152
            ],
            [
                153,
                207
            ],
            [
                207,
                296
            ],
            [
                296,
                297
            ],
            [
                298,
                423
            ],
            [
                424,
                466
            ],
            [
                469,
                480
            ],
            [
                481,
                486
            ],
            [
                487,
                496
            ],
            [
                497,
                499
            ],
            [
                504,
                518
            ],
            [
                519,
                530
            ],
            [
                531,
                533
            ],
            [
                534,
                552
            ],
            [
                561,
                573
            ],
            [
                574,
                599
            ],
            [
                599,
                643
            ],
            [
                644,
                700
            ],
            [
                705,
                733
            ],
            [
                733,
                734
            ],
            [
                735,
                773
            ],
            [
                773,
                810
            ],
            [
                813,
                837
            ],
            [
                837,
                906
            ],
            [
                906,
                962
            ],
            [
                962,
                968
            ],
            [
                973,
                990
            ],
            [
                990,
                1049
            ],
            [
                1049,
                1124
            ],
            [
                1124,
                1151
            ],
            [
                1155,
                1212
            ],
            [
                1212,
                1288
            ],
            [
                1301,
                1311
            ],
            [
                1319,
                1401
            ],
            [
                1402,
                1437
            ],
            [
                1437,
                1474
            ],
            [
                1474,
                1475
            ],
            [
                1488,
                1498
            ],
            [
                1498,
                1500
            ],
            [
                1500,
                1568
            ],
            [
                1568,
                1570
            ],
            [
                1571,
                1602
            ],
            [
                1615,
                1624
            ],
            [
                1626,
                1667
            ],
            [
                1667,
                1717
            ],
            [
                1717,
                1747
            ],
            [
                1748,
                1756
            ],
            [
                1756,
                1843
            ],
            [
                1849,
                1860
            ],
            [
                1861,
                1964
            ],
            [
                1965,
                2010
            ],
            [
                2013,
                2115
            ],
            [
                2115,
                2208
            ],
            [
                2208,
                2225
            ],
            [
                2225,
                2228
            ],
            [
                2234,
                2257
            ],
            [
                2257,
                2278
            ],
            [
                2279,
                2407
            ],
            [
                2408,
                2425
            ],
            [
                2426,
                2454
            ],
            [
                2454,
                2525
            ],
            [
                2525,
                2562
            ],
            [
                2562,
                2591
            ],
            [
                2599,
                2613
            ],
            [
                2613,
                2705
            ],
            [
                2706,
                2733
            ],
            [
                2733,
                2769
            ],
            [
                2770,
                2787
            ],
            [
                2788,
                2948
            ],
            [
                2948,
                2970
            ],
            [
                2970,
                2983
            ],
            [
                2984,
                3042
            ],
            [
                3042,
                3069
            ],
            [
                3069,
                3072
            ],
            [
                3072,
                3093
            ],
            [
                3093,
                3105
            ],
            [
                3106,
                3114
            ],
            [
                3114,
                3116
            ],
            [
                3116,
                3168
            ],
            [
                3170,
                3187
            ],
            [
                3190,
                3208
            ],
            [
                3208,
                3229
            ],
            [
                3229,
                3252
            ],
            [
                3252,
                3280
            ],
            [
                3280,
                3365
            ],
            [
                3366,
                3430
            ],
            [
                3430,
                3504
            ],
            [
                3504,
                3543
            ],
            [
                3544,
                3599
            ],
            [
                3599,
                3601
            ],
            [
                3601,
                3629
            ],
            [
                3630,
                3683
            ],
            [
                3683,
                3712
            ],
            [
                3715,
                3762
            ],
            [
                3762,
                3818
            ],
            [
                3818,
                3820
            ],
            [
                3820,
                3972
            ],
            [
                3972,
                3973
            ],
            [
                3974,
                3978
            ],
            [
                3980,
                3997
            ],
            [
                3998,
                4061
            ],
            [
                4061,
                4063
            ],
            [
                4063,
                4066
            ],
            [
                4067,
                4136
            ],
            [
                4139,
                4153
            ],
            [
                4154,
                4182
            ],
            [
                4183,
                4200
            ],
            [
                4203,
                4234
            ],
            [
                4234,
                4289
            ],
            [
                4303,
                4336
            ],
            [
                4336,
                4348
            ],
            [
                4352,
                4358
            ],
            [
                4359,
                4373
            ],
            [
                4373,
                4403
            ],
            [
                4405,
                4534
            ],
            [
                4535,
                4547
            ],
            [
                4547,
                4615
            ],
            [
                4615,
                4663
            ],
            [
                4663,
                4665
            ],
            [
                4665,
                4737
            ],
            [
                4737,
                4740
            ],
            [
                4740,
                4750
            ],
            [
                4751,
                4819
            ],
            [
                4820,
                4838
            ],
            [
                4838,
                4898
            ],
            [
                4900,
                4981
            ],
            [
                4981,
                4983
            ],
            [
                4983,
                5066
            ],
            [
                5067,
                5076
            ],
            [
                5076,
                5140
            ],
            [
                5140,
                5162
            ],
            [
                5162,
                5203
            ],
            [
                5203,
                5210
            ],
            [
                5213,
                5267
            ],
            [
                5268,
                5336
            ],
            [
                5336,
                5338
            ],
            [
                5338,
                5502
            ],
            [
                5508,
                5532
            ],
            [
                5532,
                5596
            ],
            [
                5596,
                5656
            ],
            [
                5656,
                5666
            ],
            [
                5667,
                5671
            ],
            [
                5672,
                5693
            ],
            [
                5693,
                5791
            ],
            [
                5792,
                5808
            ],
            [
                5808,
                5810
            ],
            [
                5810,
                5852
            ],
            [
                5852,
                5913
            ],
            [
                5914,
                5926
            ],
            [
                5926,
                5933
            ],
            [
                5933,
                5962
            ],
            [
                5978,
                6008
            ],
            [
                6012,
                6072
            ],
            [
                6072,
                6090
            ],
            [
                6090,
                6132
            ],
            [
                6133,
                6148
            ],
            [
                6148,
                6166
            ],
            [
                6166,
                6187
            ],
            [
                6187,
                6189
            ],
            [
                6189,
                6207
            ],
            [
                6207,
                6247
            ],
            [
                6247,
                6278
            ],
            [
                6278,
                6356
            ],
            [
                6356,
                6369
            ],
            [
                6369,
                6459
            ],
            [
                6462,
                6482
            ],
            [
                6485,
                6547
            ],
            [
                6547,
                6549
            ],
            [
                6549,
                6584
            ],
            [
                6584,
                6595
            ],
            [
                6596,
                6598
            ],
            [
                6610,
                6643
            ],
            [
                6644,
                6696
            ],
            [
                6697,
                6716
            ],
            [
                6717,
                6781
            ],
            [
                6781,
                6804
            ],
            [
                6804,
                6819
            ],
            [
                6819,
                6844
            ],
            [
                6844,
                6846
            ],
            [
                6846,
                6877
            ],
            [
                6880,
                6920
            ],
            [
                6920,
                6995
            ],
            [
                6995,
                6998
            ],
            [
                7009,
                7084
            ],
            [
                7092,
                7132
            ],
            [
                7132,
                7165
            ],
            [
                7166,
                7201
            ],
            [
                7201,
                7205
            ],
            [
                7206,
                7208
            ],
            [
                7209,
                7216
            ],
            [
                7216,
                7228
            ],
            [
                7228,
                7230
            ],
            [
                7230,
                7255
            ],
            [
                7256,
                7326
            ],
            [
                7327,
                7334
            ],
            [
                7334,
                7340
            ],
            [
                7346,
                7360
            ],
            [
                7365,
                7411
            ],
            [
                7411,
                7438
            ],
            [
                7441,
                7467
            ],
            [
                7467,
                7482
            ],
            [
                7482,
                7513
            ],
            [
                7513,
                7600
            ],
            [
                7600,
                7640
            ],
            [
                7640,
                7641
            ],
            [
                7642,
                7665
            ],
            [
                7665,
                7707
            ],
            [
                7708,
                7714
            ],
            [
                7715,
                7720
            ],
            [
                7721,
                7725
            ],
            [
                7726,
                7788
            ],
            [
                7788,
                7841
            ],
            [
                7842,
                7867
            ],
            [
                7868,
                7893
            ],
            [
                7893,
                7943
            ],
            [
                7943,
                8026
            ],
            [
                8027,
                8034
            ],
            [
                8034,
                8079
            ],
            [
                8079,
                8109
            ],
            [
                8109,
                8110
            ],
            [
                8111,
                8294
            ],
            [
                8294,
                8374
            ],
            [
                8375,
                8398
            ],
            [
                8401,
                8420
            ],
            [
                8421,
                8425
            ],
            [
                8426,
                8514
            ],
            [
                8514,
                8560
            ],
            [
                8561,
                8657
            ],
            [
                8660,
                8676
            ],
            [
                8677,
                8703
            ],
            [
                8704,
                8797
            ],
            [
                8797,
                8799
            ],
            [
                8799,
                8820
            ],
            [
                8821,
                8846
            ],
            [
                8847,
                8902
            ],
            [
                8903,
                8965
            ],
            [
                8965,
                8999
            ],
            [
                9000,
                9023
            ],
            [
                9023,
                9089
            ],
            [
                9090,
                9104
            ],
            [
                9104,
                9106
            ],
            [
                9106,
                9178
            ],
            [
                9178,
                9179
            ],
            [
                9186,
                9201
            ],
            [
                9202,
                9204
            ],
            [
                9205,
                9254
            ],
            [
                9255,
                9260
            ],
            [
                9261,
                9266
            ],
            [
                9266,
                9268
            ],
            [
                9268,
                9330
            ],
            [
                9331,
                9345
            ],
            [
                9346,
                9372
            ],
            [
                9372,
                9429
            ],
            [
                9430,
                9448
            ],
            [
                9448,
                9498
            ],
            [
                9499,
                9501
            ],
            [
                9502,
                9509
            ],
            [
                9510,
                9524
            ],
            [
                9525,
                9563
            ],
            [
                9564,
                9574
            ],
            [
                9575,
                9578
            ],
            [
                9579,
                9581
            ],
            [
                9582,
                9590
            ],
            [
                9591,
                9679
            ],
            [
                9680,
                9709
            ],
            [
                9709,
                9766
            ],
            [
                9767,
                9879
            ],
            [
                9880,
                9994
            ],
            [
                9994,
                9995
            ],
            [
                9996,
                10019
            ],
            [
                10020,
                10037
            ],
            [
                10038,
                10133
            ],
            [
                10134,
                10140
            ],
            [
                10140,
                10142
            ],
            [
                10142,
                10166
            ],
            [
                10167,
                10247
            ],
            [
                10248,
                10275
            ],
            [
                10276,
                10312
            ],
            [
                10312,
                10320
            ],
            [
                10321,
                10365
            ],
            [
                10367,
                10375
            ],
            [
                10375,
                10381
            ],
            [
                10381,
                10397
            ],
            [
                10397,
                10450
            ],
            [
                10451,
                10455
            ],
            [
                10456,
                10460
            ],
            [
                10467,
                10476
            ],
            [
                10476,
                10502
            ],
            [
                10502,
                10563
            ],
            [
                10563,
                10572
            ],
            [
                10573,
                10611
            ],
            [
                10612,
                10649
            ],
            [
                10649,
                10703
            ],
            [
                10704,
                10748
            ],
            [
                10749,
                10751
            ],
            [
                10760,
                10769
            ],
            [
                10769,
                10819
            ],
            [
                10819,
                10843
            ],
            [
                10843,
                10876
            ],
            [
                10879,
                10911
            ],
            [
                10911,
                10959
            ],
            [
                10959,
                11127
            ],
            [
                11127,
                11146
            ],
            [
                11146,
                11148
            ],
            [
                11148,
                11152
            ],
            [
                11157,
                11185
            ],
            [
                11186,
                11194
            ],
            [
                11197,
                11198
            ],
            [
                11212,
                11364
            ],
            [
                11364,
                11366
            ],
            [
                11366,
                11389
            ],
            [
                11389,
                11391
            ],
            [
                11391,
                11425
            ],
            [
                11432,
                11475
            ],
            [
                11476,
                11489
            ],
            [
                11490,
                11536
            ],
            [
                11536,
                11561
            ],
            [
                11562,
                11567
            ],
            [
                11568,
                11572
            ],
            [
                11573,
                11680
            ],
            [
                11680,
                11699
            ],
            [
                11699,
                11701
            ],
            [
                11701,
                11717
            ],
            [
                11718,
                11774
            ],
            [
                11774,
                11847
            ],
            [
                11856,
                11858
            ],
            [
                11858,
                11875
            ],
            [
                11876,
                11904
            ],
            [
                11904,
                11917
            ],
            [
                11923,
                11925
            ],
            [
                11931,
                11937
            ],
            [
                11941,
                11942
            ],
            [
                11947,
                12012
            ],
            [
                12013,
                12086
            ],
            [
                12086,
                12089
            ],
            [
                12089,
                12106
            ],
            [
                12106,
                12152
            ],
            [
                12153,
                12172
            ],
            [
                12185,
                12223
            ],
            [
                12223,
                12228
            ],
            [
                12229,
                12232
            ],
            [
                12233,
                12236
            ],
            [
                12237,
                12242
            ],
            [
                12243,
                12247
            ],
            [
                12256,
                12265
            ],
            [
                12265,
                12267
            ],
            [
                12267,
                12290
            ],
            [
                12291,
                12314
            ],
            [
                12315,
                12317
            ],
            [
                12318,
                12325
            ],
            [
                12331,
                12334
            ],
            [
                12339,
                12342
            ],
            [
                12350,
                12354
            ],
            [
                12354,
                12406
            ],
            [
                12407,
                12412
            ],
            [
                12413,
                12417
            ],
            [
                12418,
                12424
            ],
            [
                12425,
                12444
            ],
            [
                12444,
                12478
            ],
            [
                12479,
                12482
            ],
            [
                12483,
                12490
            ],
            [
                12491,
                12533
            ],
            [
                12533,
                12557
            ],
            [
                12559,
                12607
            ],
            [
                12607,
                12651
            ],
            [
                12652,
                12684
            ],
            [
                12684,
                12685
            ],
            [
                12685,
                12692
            ],
            [
                12692,
                12764
            ],
            [
                12765,
                12858
            ],
            [
                12858,
                12892
            ],
            [
                12908,
                12919
            ],
            [
                12920,
                12947
            ],
            [
                12947,
                12949
            ],
            [
                12949,
                13002
            ],
            [
                13003,
                13067
            ],
            [
                13067,
                13069
            ],
            [
                13078,
                13104
            ],
            [
                13104,
                13110
            ],
            [
                13115,
                13123
            ],
            [
                13124,
                13131
            ],
            [
                13132,
                13143
            ],
            [
                13144,
                13172
            ],
            [
                13172,
                13188
            ],
            [
                13189,
                13239
            ],
            [
                13240,
                13244
            ],
            [
                13252,
                13272
            ],
            [
                13272,
                13336
            ],
            [
                13337,
                13484
            ],
            [
                13485,
                13500
            ],
            [
                13501,
                13521
            ],
            [
                13521,
                13541
            ],
            [
                13549,
                13587
            ],
            [
                13587,
                13589
            ],
            [
                13594,
                13597
            ],
            [
                13602,
                13664
            ],
            [
                13672,
                13680
            ],
            [
                13709,
                13710
            ],
            [
                13722,
                13723
            ],
            [
                13729,
                13731
            ],
            [
                13735,
                13737
            ],
            [
                13737,
                13794
            ],
            [
                13795,
                13828
            ],
            [
                13828,
                13835
            ],
            [
                13835,
                13861
            ],
            [
                13861,
                13862
            ],
            [
                13862,
                13873
            ],
            [
                13873,
                13914
            ],
            [
                13914,
                13927
            ],
            [
                13927,
                13931
            ],
            [
                13931,
                13935
            ],
            [
                13935,
                13982
            ],
            [
                13983,
                14020
            ],
            [
                14020,
                14035
            ],
            [
                14035,
                14038
            ],
            [
                14038,
                14063
            ],
            [
                14076,
                14078
            ],
            [
                14086,
                14095
            ],
            [
                14101,
                14195
            ],
            [
                14195,
                14269
            ],
            [
                14270,
                14329
            ],
            [
                14336,
                14407
            ],
            [
                14416,
                14420
            ],
            [
                14421,
                14509
            ],
            [
                14509,
                14510
            ],
            [
                14510,
                14544
            ],
            [
                14544,
                14562
            ],
            [
                14565,
                14568
            ],
            [
                14576,
                14635
            ],
            [
                14635,
                14669
            ],
            [
                14669,
                14672
            ],
            [
                14672,
                14674
            ],
            [
                14674,
                14688
            ],
            [
                14689,
                14733
            ],
            [
                14734,
                14764
            ],
            [
                14764,
                14829
            ],
            [
                14829,
                14861
            ],
            [
                14864,
                14945
            ],
            [
                14945,
                14967
            ],
            [
                14967,
                15010
            ],
            [
                15010,
                15012
            ],
            [
                15012,
                15069
            ],
            [
                15077,
                15105
            ],
            [
                15109,
                15169
            ],
            [
                15169,
                15204
            ],
            [
                15204,
                15242
            ],
            [
                15242,
                15277
            ],
            [
                15292,
                15308
            ],
            [
                15309,
                15465
            ],
            [
                15465,
                15467
            ],
            [
                15467,
                15498
            ],
            [
                15498,
                15500
            ],
            [
                15500,
                15504
            ],
            [
                15504,
                15526
            ],
            [
                15526,
                15535
            ],
            [
                15536,
                15572
            ],
            [
                15572,
                15608
            ],
            [
                15614,
                15629
            ],
            [
                15639,
                15658
            ],
            [
                15659,
                15662
            ],
            [
                15668,
                15677
            ],
            [
                15678,
                15745
            ],
            [
                15745,
                15830
            ],
            [
                15830,
                15832
            ],
            [
                15832,
                15974
            ],
            [
                15975,
                16005
            ],
            [
                16005,
                16040
            ],
            [
                16045,
                16079
            ],
            [
                16083,
                16124
            ],
            [
                16124,
                16150
            ],
            [
                16156,
                16167
            ],
            [
                16167,
                16181
            ],
            [
                16197,
                16217
            ],
            [
                16220,
                16234
            ],
            [
                16235,
                16240
            ],
            [
                16240,
                16242
            ],
            [
                16242,
                16243
            ],
            [
                16243,
                16277
            ],
            [
                16277,
                16278
            ],
            [
                16288,
                16362
            ],
            [
                16365,
                16374
            ],
            [
                16379,
                16380
            ],
            [
                16381,
                16390
            ],
            [
                16391,
                16396
            ],
            [
                16401,
                16490
            ],
            [
                16491,
                16527
            ],
            [
                16539,
                16541
            ],
            [
                16541,
                16596
            ],
            [
                16599,
                16649
            ],
            [
                16649,
                16750
            ],
            [
                16750,
                16801
            ],
            [
                16804,
                16806
            ],
            [
                16808,
                16821
            ],
            [
                16827,
                16852
            ],
            [
                16852,
                16866
            ],
            [
                16866,
                16882
            ],
            [
                16882,
                16886
            ],
            [
                16886,
                16952
            ],
            [
                16952,
                16991
            ],
            [
                16991,
                17050
            ],
            [
                17065,
                17069
            ],
            [
                17070,
                17073
            ],
            [
                17079,
                17100
            ],
            [
                17100,
                17102
            ],
            [
                17102,
                17127
            ],
            [
                17127,
                17145
            ],
            [
                17146,
                17176
            ],
            [
                17185,
                17321
            ],
            [
                17327,
                17340
            ],
            [
                17340,
                17342
            ],
            [
                17360,
                17363
            ],
            [
                17364,
                17389
            ],
            [
                17390,
                17413
            ],
            [
                17414,
                17456
            ],
            [
                17456,
                17458
            ],
            [
                17458,
                17482
            ],
            [
                17483,
                17493
            ],
            [
                17494,
                17496
            ],
            [
                17506,
                17534
            ],
            [
                17534,
                17591
            ],
            [
                17592,
                17616
            ],
            [
                17625,
                17630
            ],
            [
                17639,
                17642
            ],
            [
                17643,
                17652
            ]
        ],
        "row_chars": [
            [
                0,
                133
            ],
            [
                133,
                133
            ],
            [
                133,
                133
            ],
            [
                133,
                207
            ],
            [
                207,
                298
            ],
            [
                298,
                466
            ],
            [
                466,
                599
            ],
            [
                599,
                599
            ],
            [
                599,
                735
            ],
            [
                735,
                735
            ],
            [
                735,
                773
            ],
            [
                773,
                773
            ],
            [
                773,
                773
            ],
            [
                773,
                773
            ],
            [
                773,
                837
            ],
            [
                837,
                906
            ],
            [
                906,
                962
            ],
            [
                962,
                990
            ],
            [
                990,
                1049
            ],
            [
                1049,
                1124
            ],
            [
                1124,
                1212
            ],
            [
                1212,
                1311
            ],
            [
                1311,
                1437
            ],
            [
                1437,
                1500
            ],
            [
                1500,
                1570
            ],
            [
                1570,
                1570
            ],
            [
                1570,
                1570
            ],
            [
                1570,
                1570
            ],
            [
                1570,
                1570
            ],
            [
                1570,
                1570
            ],
            [
                1570,
                1570
            ],
            [
                1570,
                1667
            ],
            [
                1667,
                1717
            ],
            [
                1717,
                1844
            ],
            [
                1844,
                1844
            ],
            [
                1844,
                1844
            ],
            [
                1844,
                1844
            ],
            [
                1844,
                1844
            ],
            [
                1844,
                1844
            ],
            [
                1844,
                1844
            ],
            [
                1844,
                1844
            ],
            [
                1844,
                1844
            ],
            [
                1844,
                1844
            ],
            [
                1844,
                1844
            ],
            [
                1844,
                1844
            ],
            [
                1844,
                1844
            ],
            [
                1844,
                1844
            ],
            [
                1844,
                1844
            ],
            [
                1844,
                1844
            ],
            [
                1844,
                1844
            ],
            [
                1844,
                2115
            ],
            [
                2115,
                2208
            ],
            [
                2208,
                2225
            ],
            [
                2225,
                2257
            ],
            [
                2257,
                2257
            ],
            [
                2257,
                2257
            ],
            [
                2257,
                2408
            ],
            [
                2408,
                2408
            ],
            [
                2408,
                2454
            ],
            [
                2454,
                2562
            ],
            [
                2562,
                2733
            ],
            [
                2733,
                2948
            ],
            [
                2948,
                2970
            ],
            [
                2970,
                2984
            ],
            [
                2984,
                2984
            ],
            [
                2984,
                3042
            ],
            [
                3042,
                3072
            ],
            [
                3072,
                3093
            ],
            [
                3093,
                3116
            ],
            [
                3116,
                3208
            ],
            [
                3208,
                3229
            ],
            [
                3229,
                3252
            ],
            [
                3252,
                3280
            ],
            [
                3280,
                3365
            ],
            [
                3365,
                3365
            ],
            [
                3365,
                3430
            ],
            [
                3430,
                3504
            ],
            [
                3504,
                3601
            ],
            [
                3601,
                3683
            ],
            [
                3683,
                3715
            ],
            [
                3715,
                3715
            ],
            [
                3715,
                3762
            ],
            [
                3762,
                3820
            ],
            [
                3820,
                4063
            ],
            [
                4063,
                4063
            ],
            [
                4063,
                4234
            ],
            [
                4234,
                4336
            ],
            [
                4336,
                4404
            ],
            [
                4404,
                4547
            ],
            [
                4547,
                4615
            ],
            [
                4615,
                4665
            ],
            [
                4665,
                4665
            ],
            [
                4665,
                4665
            ],
            [
                4665,
                4740
            ],
            [
                4740,
                4900
            ],
            [
                4900,
                4983
            ],
            [
                4983,
                5076
            ],
            [
                5076,
                5076
            ],
            [
                5076,
                5140
            ],
            [
                5140,
                5203
            ],
            [
                5203,
                5213
            ],
            [
                5213,
                5213
            ],
            [
                5213,
                5213
            ],
            [
                5213,
                5213
            ],
            [
                5213,
                5213
            ],
            [
                5213,
                5213
            ],
            [
                5213,
                5213
            ],
            [
                5213,
                5338
            ],
            [
                5338,
                5596
            ],
            [
                5596,
                5656
            ],
            [
                5656,
                5810
            ],
            [
                5810,
                5852
            ],
            [
                5852,
                5926
            ],
            [
                5926,
                5933
            ],
            [
                5933,
                5963
            ],
            [
                5963,
                5963
            ],
            [
                5963,
                5963
            ],
            [
                5963,
                5963
            ],
            [
                5963,
                5963
            ],
            [
                5963,
                5963
            ],
            [
                5963,
                6072
            ],
            [
                6072,
                6090
            ],
            [
                6090,
                6148
            ],
            [
                6148,
                6166
            ],
            [
                6166,
                6189
            ],
            [
                6189,
                6207
            ],
            [
                6207,
                6247
            ],
            [
                6247,
                6278
            ],
            [
                6278,
                6356
            ],
            [
                6356,
                6369
            ],
            [
                6369,
                6549
            ],
            [
                6549,
                6584
            ],
            [
                6584,
                6781
            ],
            [
                6781,
                6804
            ],
            [
                6804,
                6819
            ],
            [
                6819,
                6846
            ],
            [
                6846,
                6880
            ],
            [
                6880,
                6880
            ],
            [
                6880,
                6920
            ],
            [
                6920,
                6995
            ],
            [
                6995,
                7084
            ],
            [
                7084,
                7084
            ],
            [
                7084,
                7132
            ],
            [
                7132,
                7165
            ],
            [
                7165,
                7165
            ],
            [
                7165,
                7165
            ],
            [
                7165,
                7165
            ],
            [
                7165,
                7201
            ],
            [
                7201,
                7216
            ],
            [
                7216,
                7230
            ],
            [
                7230,
                7411
            ],
            [
                7411,
                7441
            ],
            [
                7441,
                7441
            ],
            [
                7441,
                7441
            ],
            [
                7441,
                7441
            ],
            [
                7441,
                7441
            ],
            [
                7441,
                7441
            ],
            [
                7441,
                7467
            ],
            [
                7467,
                7482
            ],
            [
                7482,
                7513
            ],
            [
                7513,
                7600
            ],
            [
                7600,
                7600
            ],
            [
                7600,
                7600
            ],
            [
                7600,
                7788
            ],
            [
                7788,
                7893
            ],
            [
                7893,
                7893
            ],
            [
                7893,
                7943
            ],
            [
                7943,
                7943
            ],
            [
                7943,
                7943
            ],
            [
                7943,
                7943
            ],
            [
                7943,
                8294
            ],
            [
                8294,
                8401
            ],
            [
                8401,
                8401
            ],
            [
                8401,
                8514
            ],
            [
                8514,
                8660
            ],
            [
                8660,
                8660
            ],
            [
                8660,
                8660
            ],
            [
                8660,
                8660
            ],
            [
                8660,
                8799
            ],
            [
                8799,
                8847
            ],
            [
                8847,
                8847
            ],
            [
                8847,
                8965
            ],
            [
                8965,
                9090
            ],
            [
                9090,
                9106
            ],
            [
                9106,
                9106
            ],
            [
                9106,
                9268
            ],
            [
                9268,
                9448
            ],
            [
                9448,
                9499
            ],
            [
                9499,
                9499
            ],
            [
                9499,
                9709
            ],
            [
                9709,
                10020
            ],
            [
                10020,
                10020
            ],
            [
                10020,
                10020
            ],
            [
                10020,
                10020
            ],
            [
                10020,
                10142
            ],
            [
                10142,
                10248
            ],
            [
                10248,
                10248
            ],
            [
                10248,
                10312
            ],
            [
                10312,
                10375
            ],
            [
                10375,
                10381
            ],
            [
                10381,
                10397
            ],
            [
                10397,
                10476
            ],
            [
                10476,
                10502
            ],
            [
                10502,
                10502
            ],
            [
                10502,
                10502
            ],
            [
                10502,
                10563
            ],
            [
                10563,
                10649
            ],
            [
                10649,
                10769
            ],
            [
                10769,
                10819
            ],
            [
                10819,
                10843
            ],
            [
                10843,
                10879
            ],
            [
                10879,
                10879
            ],
            [
                10879,
                10879
            ],
            [
                10879,
                10879
            ],
            [
                10879,
                10879
            ],
            [
                10879,
                10911
            ],
            [
                10911,
                11127
            ],
            [
                11127,
                11148
            ],
            [
                11148,
                11366
            ],
            [
                11366,
                11391
            ],
            [
                11391,
                11536
            ],
            [
                11536,
                11680
            ],
            [
                11680,
                11701
            ],
            [
                11701,
                11718
            ],
            [
                11718,
                11718
            ],
            [
                11718,
                11858
            ],
            [
                11858,
                11904
            ],
            [
                11904,
                11904
            ],
            [
                11904,
                11904
            ],
            [
                11904,
                12089
            ],
            [
                12089,
                12106
            ],
            [
                12106,
                12223
            ],
            [
                12223,
                12267
            ],
            [
                12267,
                12533
            ],
            [
                12533,
                12607
            ],
            [
                12607,
                12692
            ],
            [
                12692,
                12692
            ],
            [
                12692,
                12858
            ],
            [
                12858,
                12858
            ],
            [
                12858,
                12858
            ],
            [
                12858,
                12858
            ],
            [
                12858,
                12858
            ],
            [
                12858,
                12949
            ],
            [
                12949,
                13069
            ],
            [
                13069,
                13172
            ],
            [
                13172,
                13272
            ],
            [
                13272,
                13589
            ],
            [
                13589,
                13737
            ],
            [
                13737,
                13828
            ],
            [
                13828,
                13828
            ],
            [
                13828,
                13835
            ],
            [
                13835,
                13861
            ],
            [
                13861,
                13873
            ],
            [
                13873,
                13914
            ],
            [
                13914,
                13927
            ],
            [
                13927,
                13931
            ],
            [
                13931,
                13935
            ],
            [
                13935,
                14020
            ],
            [
                14020,
                14020
            ],
            [
                14020,
                14038
            ],
            [
                14038,
                14078
            ],
            [
                14078,
                14195
            ],
            [
                14195,
                14270
            ],
            [
                14270,
                14270
            ],
            [
                14270,
                14421
            ],
            [
                14421,
                14421
            ],
            [
                14421,
                14509
            ],
            [
                14509,
                14544
            ],
            [
                14544,
                14562
            ],
            [
                14562,
                14635
            ],
            [
                14635,
                14672
            ],
            [
                14672,
                14734
            ],
            [
                14734,
                14764
            ],
            [
                14764,
                14829
            ],
            [
                14829,
                14864
            ],
            [
                14864,
                14864
            ],
            [
                14864,
                14864
            ],
            [
                14864,
                14945
            ],
            [
                14945,
                14967
            ],
            [
                14967,
                15012
            ],
            [
                15012,
                15169
            ],
            [
                15169,
                15204
            ],
            [
                15204,
                15242
            ],
            [
                15242,
                15277
            ],
            [
                15277,
                15277
            ],
            [
                15277,
                15467
            ],
            [
                15467,
                15498
            ],
            [
                15498,
                15498
            ],
            [
                15498,
                15498
            ],
            [
                15498,
                15504
            ],
            [
                15504,
                15526
            ],
            [
                15526,
                15678
            ],
            [
                15678,
                15678
            ],
            [
                15678,
                15745
            ],
            [
                15745,
                15832
            ],
            [
                15832,
                16005
            ],
            [
                16005,
                16124
            ],
            [
                16124,
                16124
            ],
            [
                16124,
                16124
            ],
            [
                16124,
                16124
            ],
            [
                16124,
                16124
            ],
            [
                16124,
                16124
            ],
            [
                16124,
                16124
            ],
            [
                16124,
                16181
            ],
            [
                16181,
                16242
            ],
            [
                16242,
                16279
            ],
            [
                16279,
                16279
            ],
            [
                16279,
                16279
            ],
            [
                16279,
                16365
            ],
            [
                16365,
                16365
            ],
            [
                16365,
                16541
            ],
            [
                16541,
                16599
            ],
            [
                16599,
                16599
            ],
            [
                16599,
                16599
            ],
            [
                16599,
                16649
            ],
            [
                16649,
                16750
            ],
            [
                16750,
                16806
            ],
            [
                16806,
                16852
            ],
            [
                16852,
                16866
            ],
            [
                16866,
                16882
            ],
            [
                16882,
                16886
            ],
            [
                16886,
                16952
            ],
            [
                16952,
                16991
            ],
            [
                16991,
                17102
            ],
            [
                17102,
                17176
            ],
            [
                17176,
                17342
            ],
            [
                17342,
                17342
            ],
            [
                17342,
                17342
            ],
            [
                17342,
                17458
            ],
            [
                17458,
                17534
            ],
            [
                17534,
                17652
            ]
        ]
    }
}