{
    "original": {
        "text": "We were to pass the night, Mr. Kenge told us when we arrived in his room, at Mrs. Jellyby's; and then he turned to me and said he took it for granted I knew who Mrs. Jellyby was.\n\"I really don't, sir,\" I returned. \"Perhaps Mr. Carstone--or Miss Clare--\"\nBut no, they knew nothing whatever about Mrs. Jellyby. \"In-deed! Mrs. Jellyby,\" said Mr. Kenge, standing with his back to the fire and casting his eyes over the dusty hearth-rug as if it were Mrs. Jellyby's biography, \"is a lady of very remarkable strength of character who devotes herself entirely to the public. She has devoted herself to an extensive variety of public subjects at various times and is at present (until something else attracts her) devoted to the subject of Africa, with a view to the general cultivation of the coffee berry--AND the natives--and the happy settlement, on the banks of the African rivers, of our superabundant home population. Mr. Jarndyce, who is desirous to aid any work that is considered likely to be a good work and who is much sought after by philanthropists, has, I believe, a very high opinion of Mrs. Jellyby.\"\nMr. Kenge, adjusting his cravat, then looked at us.\n\"And Mr. Jellyby, sir?\" suggested Richard.\n\"Ah! Mr. Jellyby,\" said Mr. Kenge, \"is--a--I don't know that I can describe him to you better than by saying that he is the husband of Mrs. Jellyby.\"\n\"A nonentity, sir?\" said Richard with a droll look.\n\"I don't say that,\" returned Mr. Kenge gravely. \"I can't say that, indeed, for I know nothing whatever OF Mr. Jellyby. I never, to my knowledge, had the pleasure of seeing Mr. Jellyby. He may be a very superior man, but he is, so to speak, merged--merged--in the more shining qualities of his wife.\" Mr. Kenge proceeded to tell us that as the road to Bleak House would have been very long, dark, and tedious on such an evening, and as we had been travelling already, Mr. Jarndyce had himself proposed this arrangement. A carriage would be at Mrs. Jellyby's to convey us out of town early in the forenoon of to-morrow.\nHe then rang a little bell, and the young gentleman came in. Addressing him by the name of Guppy, Mr. Kenge inquired whether Miss Summerson's boxes and the rest of the baggage had been \"sent round.\" Mr. Guppy said yes, they had been sent round, and a coach was waiting to take us round too as soon as we pleased.\n\"Then it only remains,\" said Mr. Kenge, shaking hands with us, \"for me to express my lively satisfaction in (good day, Miss Clare!) the arrangement this day concluded and my (GOOD-bye to you, Miss Summerson!) lively hope that it will conduce to the happiness, the (glad to have had the honour of making your acquaintance, Mr. Carstone!) welfare, the advantage in all points of view, of all concerned! Guppy, see the party safely there.\"\n\"Where IS 'there,' Mr. Guppy?\" said Richard as we went downstairs.\n\"No distance,\" said Mr. Guppy; \"round in Thavies Inn, you know.\"\n\"I can't say I know where it is, for I come from Winchester and am strange in London.\"\n\"Only round the corner,\" said Mr. Guppy. \"We just twist up Chancery Lane, and cut along Holborn, and there we are in four minutes' time, as near as a toucher. This is about a London particular NOW, ain't it, miss?\" He seemed quite delighted with it on my account.\n\"The fog is very dense indeed!\" said I.\n\"Not that it affects you, though, I'm sure,\" said Mr. Guppy, putting up the steps. \"On the contrary, it seems to do you good, miss, judging from your appearance.\"\nI knew he meant well in paying me this compliment, so I laughed at myself for blushing at it when he had shut the door and got upon the box; and we all three laughed and chatted about our inexperience and the strangeness of London until we turned up under an archway to our destination--a narrow street of high houses like an oblong cistern to hold the fog. There was a confused little crowd of people, principally children, gathered about the house at which we stopped, which had a tarnished brass plate on the door with the inscription JELLYBY.\n\"Don't be frightened!\" said Mr. Guppy, looking in at the coach-window. \"One of the young Jellybys been and got his head through the area railings!\"\n\"Oh, poor child,\" said I; \"let me out, if you please!\"\n\"Pray be careful of yourself, miss. The young Jellybys are always up to something,\" said Mr. Guppy.\nI made my way to the poor child, who was one of the dirtiest little unfortunates I ever saw, and found him very hot and frightened and crying loudly, fixed by the neck between two iron railings, while a milkman and a beadle, with the kindest intentions possible, were endeavouring to drag him back by the legs, under a general impression that his skull was compressible by those means. As I found (after pacifying him) that he was a little boy with a naturally large head, I thought that perhaps where his head could go, his body could follow, and mentioned that the best mode of extrication might be to push him forward. This was so favourably received by the milkman and beadle that he would immediately have been pushed into the area if I had not held his pinafore while Richard and Mr. Guppy ran down through the kitchen to catch him when he should be released. At last he was happily got down without any accident, and then he began to beat Mr. Guppy with a hoop-stick in quite a frantic manner.\nNobody had appeared belonging to the house except a person in pattens, who had been poking at the child from below with a broom; I don't know with what object, and I don't think she did. I therefore supposed that Mrs. Jellyby was not at home, and was quite surprised when the person appeared in the passage without the pattens, and going up to the back room on the first floor before Ada and me, announced us as, \"Them two young ladies, Missis Jellyby!\" We passed several more children on the way up, whom it was difficult to avoid treading on in the dark; and as we came into Mrs. Jellyby's presence, one of the poor little things fell downstairs--down a whole flight (as it sounded to me), with a great noise.\nMrs. Jellyby, whose face reflected none of the uneasiness which we could not help showing in our own faces as the dear child's head recorded its passage with a bump on every stair--Richard afterwards said he counted seven, besides one for the landing--received us with perfect equanimity. She was a pretty, very diminutive, plump woman of from forty to fifty, with handsome eyes, though they had a curious habit of seeming to look a long way off. As if--I am quoting Richard again--they could see nothing nearer than Africa!\n\"I am very glad indeed,\" said Mrs. Jellyby in an agreeable voice, \"to have the pleasure of receiving you. I have a great respect for Mr. Jarndyce, and no one in whom he is interested can be an object of indifference to me.\"\nWe expressed our acknowledgments and sat down behind the door, where there was a lame invalid of a sofa. Mrs. Jellyby had very good hair but was too much occupied with her African duties to brush it. The shawl in which she had been loosely muffled dropped onto her chair when she advanced to us; and as she turned to resume her seat, we could not help noticing that her dress didn't nearly meet up the back and that the open space was railed across with a lattice-work of stay-lace--like a summer-house.\nThe room, which was strewn with papers and nearly filled by a great writing-table covered with similar litter, was, I must say, not only very untidy but very dirty. We were obliged to take notice of that with our sense of sight, even while, with our sense of hearing, we followed the poor child who had tumbled downstairs: I think into the back kitchen, where somebody seemed to stifle him.\nBut what principally struck us was a jaded and unhealthy-looking though by no means plain girl at the writing-table, who sat biting the feather of her pen and staring at us. I suppose nobody ever was in such a state of ink. And from her tumbled hair to her pretty feet, which were disfigured with frayed and broken satin slippers trodden down at heel, she really seemed to have no article of dress upon her, from a pin upwards, that was in its proper condition or its right place.\n\"You find me, my dears,\" said Mrs. Jellyby, snuffing the two great office candles in tin candlesticks, which made the room taste strongly of hot tallow (the fire had gone out, and there was nothing in the grate but ashes, a bundle of wood, and a poker), \"you find me, my dears, as usual, very busy; but that you will excuse. The African project at present employs my whole time. It involves me in correspondence with public bodies and with private individuals anxious for the welfare of their species all over the country. I am happy to say it is advancing. We hope by this time next year to have from a hundred and fifty to two hundred healthy families cultivating coffee and educating the natives of Borrioboola-Gha, on the left bank of the Niger.\"\nAs Ada said nothing, but looked at me, I said it must be very gratifying.\n\"It IS gratifying,\" said Mrs. Jellyby. \"It involves the devotion of all my energies, such as they are; but that is nothing, so that it succeeds; and I am more confident of success every day. Do you know, Miss Summerson, I almost wonder that YOU never turned your thoughts to Africa.\"\nThis application of the subject was really so unexpected to me that I was quite at a loss how to receive it. I hinted that the climate--\n\"The finest climate in the world!\" said Mrs. Jellyby.\n\"Indeed, ma'am?\"\n\"Certainly. With precaution,\" said Mrs. Jellyby. \"You may go into Holborn, without precaution, and be run over. You may go into Holborn, with precaution, and never be run over. Just so with Africa.\"\nI said, \"No doubt.\" I meant as to Holborn.\n\"If you would like,\" said Mrs. Jellyby, putting a number of papers towards us, \"to look over some remarks on that head, and on the general subject, which have been extensively circulated, while I finish a letter I am now dictating to my eldest daughter, who is my amanuensis--\"\nThe girl at the table left off biting her pen and made a return to our recognition, which was half bashful and half sulky.\n\"--I shall then have finished for the present,\" proceeded Mrs. Jellyby with a sweet smile, \"though my work is never done. Where are you, Caddy?\"\n\"'Presents her compliments to Mr. Swallow, and begs--'\" said Caddy.\n\"'And begs,'\" said Mrs. Jellyby, dictating, \"'to inform him, in reference to his letter of inquiry on the African project--' No, Peepy! Not on my account!\"\nPeepy (so self-named) was the unfortunate child who had fallen downstairs, who now interrupted the correspondence by presenting himself, with a strip of plaster on his forehead, to exhibit his wounded knees, in which Ada and I did not know which to pity most--the bruises or the dirt. Mrs. Jellyby merely added, with the serene composure with which she said everything, \"Go along, you naughty Peepy!\" and fixed her fine eyes on Africa again.\nHowever, as she at once proceeded with her dictation, and as I interrupted nothing by doing it, I ventured quietly to stop poor Peepy as he was going out and to take him up to nurse. He looked very much astonished at it and at Ada's kissing him, but soon fell fast asleep in my arms, sobbing at longer and longer intervals, until he was quiet. I was so occupied with Peepy that I lost the letter in detail, though I derived such a general impression from it of the momentous importance of Africa, and the utter insignificance of all other places and things, that I felt quite ashamed to have thought so little about it.\n\"Six o'clock!\" said Mrs. Jellyby. \"And our dinner hour is nominally (for we dine at all hours) five! Caddy, show Miss Clare and Miss Summerson their rooms. You will like to make some change, perhaps? You will excuse me, I know, being so much occupied. Oh, that very bad child! Pray put him down, Miss Summerson!\"\nI begged permission to retain him, truly saying that he was not at all troublesome, and carried him upstairs and laid him on my bed. Ada and I had two upper rooms with a door of communication between. They were excessively bare and disorderly, and the curtain to my window was fastened up with a fork.\n\"You would like some hot water, wouldn't you?\" said Miss Jellyby, looking round for a jug with a handle to it, but looking in vain.\n\"If it is not being troublesome,\" said we.\n\"Oh, it's not the trouble,\" returned Miss Jellyby; \"the question is, if there IS any.\"\nThe evening was so very cold and the rooms had such a marshy smell that I must confess it was a little miserable, and Ada was half crying. We soon laughed, however, and were busily unpacking when Miss Jellyby came back to say that she was sorry there was no hot water, but they couldn't find the kettle, and the boiler was out of order.\nWe begged her not to mention it and made all the haste we could to get down to the fire again. But all the little children had come up to the landing outside to look at the phenomenon of Peepy lying on my bed, and our attention was distracted by the constant apparition of noses and fingers in situations of danger between the hinges of the doors. It was impossible to shut the door of either room, for my lock, with no knob to it, looked as if it wanted to be wound up; and though the handle of Ada's went round and round with the greatest smoothness, it was attended with no effect whatever on the door. Therefore I proposed to the children that they should come in and be very good at my table, and I would tell them the story of Little Red Riding Hood while I dressed; which they did, and were as quiet as mice, including Peepy, who awoke opportunely before the appearance of the wolf.\nWhen we went downstairs we found a mug with \"A Present from Tunbridge Wells\" on it lighted up in the staircase window with a floating wick, and a young woman, with a swelled face bound up in a flannel bandage blowing the fire of the drawing-room (now connected by an open door with Mrs. Jellyby's room) and choking dreadfully. It smoked to that degree, in short, that we all sat coughing and crying with the windows open for half an hour, during which Mrs. Jellyby, with the same sweetness of temper, directed letters about Africa. Her being so employed was, I must say, a great relief to me, for Richard told us that he had washed his hands in a pie-dish and that they had found the kettle on his dressing-table, and he made Ada laugh so that they made me laugh in the most ridiculous manner.\nSoon after seven o'clock we went down to dinner, carefully, by Mrs. Jellyby's advice, for the stair-carpets, besides being very deficient in stair-wires, were so torn as to be absolute traps. We had a fine cod-fish, a piece of roast beef, a dish of cutlets, and a pudding; an excellent dinner, if it had had any cooking to speak of, but it was almost raw. The young woman with the flannel bandage waited, and dropped everything on the table wherever it happened to go, and never moved it again until she put it on the stairs. The person I had seen in pattens, who I suppose to have been the cook, frequently came and skirmished with her at the door, and there appeared to be ill will between them.\nAll through dinner--which was long, in consequence of such accidents as the dish of potatoes being mislaid in the coal skuttle and the handle of the corkscrew coming off and striking the young woman in the chin--Mrs. Jellyby preserved the evenness of her disposition. She told us a great deal that was interesting about Borrioboola-Gha and the natives, and received so many letters that Richard, who sat by her, saw four envelopes in the gravy at once. Some of the letters were proceedings of ladies' committees or resolutions of ladies' meetings, which she read to us; others were applications from people excited in various ways about the cultivation of coffee, and natives; others required answers, and these she sent her eldest daughter from the table three or four times to write. She was full of business and undoubtedly was, as she had told us, devoted to the cause.\nI was a little curious to know who a mild bald gentleman in spectacles was, who dropped into a vacant chair (there was no top or bottom in particular) after the fish was taken away and seemed passively to submit himself to Borrioboola-Gha but not to be actively interested in that settlement. As he never spoke a word, he might have been a native but for his complexion. It was not until we left the table and he remained alone with Richard that the possibility of his being Mr. Jellyby ever entered my head. But he WAS Mr. Jellyby; and a loquacious young man called Mr. Quale, with large shining knobs for temples and his hair all brushed to the back of his head, who came in the evening, and told Ada he was a philanthropist, also informed her that he called the matrimonial alliance of Mrs. Jellyby with Mr. Jellyby the union of mind and matter.\nThis young man, besides having a great deal to say for himself about Africa and a project of his for teaching the coffee colonists to teach the natives to turn piano-forte legs and establish an export trade, delighted in drawing Mrs. Jellyby out by saying, \"I believe now, Mrs. Jellyby, you have received as many as from one hundred and fifty to two hundred letters respecting Africa in a single day, have you not?\" or, \"If my memory does not deceive me, Mrs. Jellyby, you once mentioned that you had sent off five thousand circulars from one post-office at one time?\"--always repeating Mrs. Jellyby's answer to us like an interpreter. During the whole evening, Mr. Jellyby sat in a corner with his head against the wall as if he were subject to low spirits. It seemed that he had several times opened his mouth when alone with Richard after dinner, as if he had something on his mind, but had always shut it again, to Richard's extreme confusion, without saying anything.\nMrs. Jellyby, sitting in quite a nest of waste paper, drank coffee all the evening and dictated at intervals to her eldest daughter. She also held a discussion with Mr. Quale, of which the subject seemed to be--if I understood it--the brotherhood of humanity, and gave utterance to some beautiful sentiments. I was not so attentive an auditor as I might have wished to be, however, for Peepy and the other children came flocking about Ada and me in a corner of the drawing-room to ask for another story; so we sat down among them and told them in whispers \"Puss in Boots\" and I don't know what else until Mrs. Jellyby, accidentally remembering them, sent them to bed. As Peepy cried for me to take him to bed, I carried him upstairs, where the young woman with the flannel bandage charged into the midst of the little family like a dragon and overturned them into cribs.\nAfter that I occupied myself in making our room a little tidy and in coaxing a very cross fire that had been lighted to burn, which at last it did, quite brightly. On my return downstairs, I felt that Mrs. Jellyby looked down upon me rather for being so frivolous, and I was sorry for it, though at the same time I knew that I had no higher pretensions.\nIt was nearly midnight before we found an opportunity of going to bed, and even then we left Mrs. Jellyby among her papers drinking coffee and Miss Jellyby biting the feather of her pen.\n\"What a strange house!\" said Ada when we got upstairs. \"How curious of my cousin Jarndyce to send us here!\"\n\"My love,\" said I, \"it quite confuses me. I want to understand it, and I can't understand it at all.\"\n\"What?\" asked Ada with her pretty smile.\n\"All this, my dear,\" said I. \"It MUST be very good of Mrs. Jellyby to take such pains about a scheme for the benefit of natives--and yet--Peepy and the housekeeping!\"\nAda laughed and put her arm about my neck as I stood looking at the fire, and told me I was a quiet, dear, good creature and had won her heart. \"You are so thoughtful, Esther,\" she said, \"and yet so cheerful! And you do so much, so unpretendingly! You would make a home out of even this house.\"\nMy simple darling! She was quite unconscious that she only praised herself and that it was in the goodness of her own heart that she made so much of me!\n\"May I ask you a question?\" said I when we had sat before the fire a little while.\n\"Five hundred,\" said Ada.\n\"Your cousin, Mr. Jarndyce. I owe so much to him. Would you mind describing him to me?\"\nShaking her golden hair, Ada turned her eyes upon me with such laughing wonder that I was full of wonder too, partly at her beauty, partly at her surprise.\n\"Esther!\" she cried.\n\"My dear!\"\n\"You want a description of my cousin Jarndyce?\"\n\"My dear, I never saw him.\"\n\"And I never saw him!\" returned Ada.\nWell, to be sure!\nNo, she had never seen him. Young as she was when her mama died, she remembered how the tears would come into her eyes when she spoke of him and of the noble generosity of his character, which she had said was to be trusted above all earthly things; and Ada trusted it. Her cousin Jarndyce had written to her a few months ago--\"a plain, honest letter,\" Ada said--proposing the arrangement we were now to enter on and telling her that \"in time it might heal some of the wounds made by the miserable Chancery suit.\" She had replied, gratefully accepting his proposal. Richard had received a similar letter and had made a similar response. He HAD seen Mr. Jarndyce once, but only once, five years ago, at Winchester school. He had told Ada, when they were leaning on the screen before the fire where I found them, that he recollected him as \"a bluff, rosy fellow.\" This was the utmost description Ada could give me.\nIt set me thinking so that when Ada was asleep, I still remained before the fire, wondering and wondering about Bleak House, and wondering and wondering that yesterday morning should seem so long ago. I don't know where my thoughts had wandered when they were recalled by a tap at the door.\nI opened it softly and found Miss Jellyby shivering there with a broken candle in a broken candlestick in one hand and an egg-cup in the other.\n\"Good night!\" she said very sulkily.\n\"Good night!\" said I.\n\"May I come in?\" she shortly and unexpectedly asked me in the same sulky way.\n\"Certainly,\" said I. \"Don't wake Miss Clare.\"\nShe would not sit down, but stood by the fire dipping her inky middle finger in the egg-cup, which contained vinegar, and smearing it over the ink stains on her face, frowning the whole time and looking very gloomy.\n\"I wish Africa was dead!\" she said on a sudden.\nI was going to remonstrate.\n\"I do!\" she said \"Don't talk to me, Miss Summerson. I hate it and detest it. It's a beast!\"\nI told her she was tired, and I was sorry. I put my hand upon her head, and touched her forehead, and said it was hot now but would be cool to-morrow. She still stood pouting and frowning at me, but presently put down her egg-cup and turned softly towards the bed where Ada lay.\n\"She is very pretty!\" she said with the same knitted brow and in the same uncivil manner.\nI assented with a smile.\n\"An orphan. Ain't she?\"\n\"Yes.\"\n\"But knows a quantity, I suppose? Can dance, and play music, and sing? She can talk French, I suppose, and do geography, and globes, and needlework, and everything?\"\n\"No doubt,\" said I.\n\"I can't,\" she returned. \"I can't do anything hardly, except write. I'm always writing for Ma. I wonder you two were not ashamed of yourselves to come in this afternoon and see me able to do nothing else. It was like your ill nature. Yet you think yourselves very fine, I dare say!\"\nI could see that the poor girl was near crying, and I resumed my chair without speaking and looked at her (I hope) as mildly as I felt towards her.\n\"It's disgraceful,\" she said. \"You know it is. The whole house is disgraceful. The children are disgraceful. I'M disgraceful. Pa's miserable, and no wonder! Priscilla drinks--she's always drinking. It's a great shame and a great story of you if you say you didn't smell her to-day. It was as bad as a public-house, waiting at dinner; you know it was!\"\n\"My dear, I don't know it,\" said I.\n\"You do,\" she said very shortly. \"You shan't say you don't. You do!\"\n\"Oh, my dear!\" said I. \"If you won't let me speak--\"\n\"You're speaking now. You know you are. Don't tell stories, Miss Summerson.\"\n\"My dear,\" said I, \"as long as you won't hear me out--\"\n\"I don't want to hear you out.\"\n\"Oh, yes, I think you do,\" said I, \"because that would be so very unreasonable. I did not know what you tell me because the servant did not come near me at dinner; but I don't doubt what you tell me, and I am sorry to hear it.\"\n\"You needn't make a merit of that,\" said she.\n\"No, my dear,\" said I. \"That would be very foolish.\"\nShe was still standing by the bed, and now stooped down (but still with the same discontented face) and kissed Ada. That done, she came softly back and stood by the side of my chair. Her bosom was heaving in a distressful manner that I greatly pitied, but I thought it better not to speak.\n\"I wish I was dead!\" she broke out. \"I wish we were all dead. It would be a great deal better for us.\"\nIn a moment afterwards, she knelt on the ground at my side, hid her face in my dress, passionately begged my pardon, and wept. I comforted her and would have raised her, but she cried no, no; she wanted to stay there!\n\"You used to teach girls,\" she said, \"If you could only have taught me, I could have learnt from you! I am so very miserable, and I like you so much!\"\nI could not persuade her to sit by me or to do anything but move a ragged stool to where she was kneeling, and take that, and still hold my dress in the same manner. By degrees the poor tired girl fell asleep, and then I contrived to raise her head so that it should rest on my lap, and to cover us both with shawls. The fire went out, and all night long she slumbered thus before the ashy grate. At first I was painfully awake and vainly tried to lose myself, with my eyes closed, among the scenes of the day. At length, by slow degrees, they became indistinct and mingled. I began to lose the identity of the sleeper resting on me. Now it was Ada, now one of my old Reading friends from whom I could not believe I had so recently parted. Now it was the little mad woman worn out with curtsying and smiling, now some one in authority at Bleak House. Lastly, it was no one, and I was no one.\nThe purblind day was feebly struggling with the fog when I opened my eyes to encounter those of a dirty-faced little spectre fixed upon me. Peepy had scaled his crib, and crept down in his bed-gown and cap, and was so cold that his teeth were chattering as if he had cut them all.",
        "paragraph_chars": [
            [
                0,
                179
            ],
            [
                179,
                254
            ],
            [
                254,
                1110
            ],
            [
                1110,
                1162
            ],
            [
                1162,
                1205
            ],
            [
                1205,
                1355
            ],
            [
                1355,
                1407
            ],
            [
                1407,
                2025
            ],
            [
                2025,
                2338
            ],
            [
                2338,
                2775
            ],
            [
                2775,
                2842
            ],
            [
                2842,
                2907
            ],
            [
                2907,
                2994
            ],
            [
                2994,
                3258
            ],
            [
                3258,
                3298
            ],
            [
                3298,
                3461
            ],
            [
                3461,
                4008
            ],
            [
                4008,
                4156
            ],
            [
                4156,
                4211
            ],
            [
                4211,
                4311
            ],
            [
                4311,
                5312
            ],
            [
                5312,
                6024
            ],
            [
                6024,
                6549
            ],
            [
                6549,
                6773
            ],
            [
                6773,
                7277
            ],
            [
                7277,
                7668
            ],
            [
                7668,
                8149
            ],
            [
                8149,
                8900
            ],
            [
                8900,
                8974
            ],
            [
                8974,
                9258
            ],
            [
                9258,
                9395
            ],
            [
                9395,
                9449
            ],
            [
                9449,
                9466
            ],
            [
                9466,
                9665
            ],
            [
                9665,
                9708
            ],
            [
                9708,
                9986
            ],
            [
                9986,
                10109
            ],
            [
                10109,
                10254
            ],
            [
                10254,
                10322
            ],
            [
                10322,
                10478
            ],
            [
                10478,
                10920
            ],
            [
                10920,
                11540
            ],
            [
                11540,
                11853
            ],
            [
                11853,
                12155
            ],
            [
                12155,
                12287
            ],
            [
                12287,
                12330
            ],
            [
                12330,
                12417
            ],
            [
                12417,
                12754
            ],
            [
                12754,
                13644
            ],
            [
                13644,
                14438
            ],
            [
                14438,
                15136
            ],
            [
                15136,
                16010
            ],
            [
                16010,
                16859
            ],
            [
                16859,
                17832
            ],
            [
                17832,
                18703
            ],
            [
                18703,
                19057
            ],
            [
                19057,
                19244
            ],
            [
                19244,
                19352
            ],
            [
                19352,
                19454
            ],
            [
                19454,
                19495
            ],
            [
                19495,
                19662
            ],
            [
                19662,
                19957
            ],
            [
                19957,
                20110
            ],
            [
                20110,
                20193
            ],
            [
                20193,
                20219
            ],
            [
                20219,
                20307
            ],
            [
                20307,
                20463
            ],
            [
                20463,
                20484
            ],
            [
                20484,
                20495
            ],
            [
                20495,
                20543
            ],
            [
                20543,
                20571
            ],
            [
                20571,
                20608
            ],
            [
                20608,
                20626
            ],
            [
                20626,
                21539
            ],
            [
                21539,
                21830
            ],
            [
                21830,
                21974
            ],
            [
                21974,
                22011
            ],
            [
                22011,
                22033
            ],
            [
                22033,
                22111
            ],
            [
                22111,
                22157
            ],
            [
                22157,
                22373
            ],
            [
                22373,
                22421
            ],
            [
                22421,
                22449
            ],
            [
                22449,
                22541
            ],
            [
                22541,
                22820
            ],
            [
                22820,
                22910
            ],
            [
                22910,
                22935
            ],
            [
                22935,
                22959
            ],
            [
                22959,
                22966
            ],
            [
                22966,
                23132
            ],
            [
                23132,
                23152
            ],
            [
                23152,
                23435
            ],
            [
                23435,
                23583
            ],
            [
                23583,
                23935
            ],
            [
                23935,
                23971
            ],
            [
                23971,
                24040
            ],
            [
                24040,
                24093
            ],
            [
                24093,
                24170
            ],
            [
                24170,
                24226
            ],
            [
                24226,
                24258
            ],
            [
                24258,
                24486
            ],
            [
                24486,
                24532
            ],
            [
                24532,
                24585
            ],
            [
                24585,
                24875
            ],
            [
                24875,
                24978
            ],
            [
                24978,
                25196
            ],
            [
                25196,
                25347
            ],
            [
                25347,
                26239
            ],
            [
                26239,
                26519
            ]
        ],
        "segment_chars": [
            [
                0,
                179
            ],
            [
                179,
                214
            ],
            [
                214,
                254
            ],
            [
                254,
                309
            ],
            [
                309,
                319
            ],
            [
                319,
                568
            ],
            [
                568,
                917
            ],
            [
                917,
                1110
            ],
            [
                1110,
                1162
            ],
            [
                1162,
                1186
            ],
            [
                1186,
                1205
            ],
            [
                1205,
                1210
            ],
            [
                1210,
                1355
            ],
            [
                1355,
                1375
            ],
            [
                1375,
                1407
            ],
            [
                1407,
                1455
            ],
            [
                1455,
                1526
            ],
            [
                1526,
                1592
            ],
            [
                1592,
                1707
            ],
            [
                1707,
                1926
            ],
            [
                1926,
                2025
            ],
            [
                2025,
                2086
            ],
            [
                2086,
                2224
            ],
            [
                2224,
                2338
            ],
            [
                2338,
                2470
            ],
            [
                2470,
                2547
            ],
            [
                2547,
                2675
            ],
            [
                2675,
                2739
            ],
            [
                2739,
                2775
            ],
            [
                2775,
                2806
            ],
            [
                2806,
                2842
            ],
            [
                2842,
                2907
            ],
            [
                2907,
                2994
            ],
            [
                2994,
                3035
            ],
            [
                3035,
                3153
            ],
            [
                3153,
                3209
            ],
            [
                3209,
                3258
            ],
            [
                3258,
                3290
            ],
            [
                3290,
                3298
            ],
            [
                3298,
                3381
            ],
            [
                3381,
                3461
            ],
            [
                3461,
                3819
            ],
            [
                3819,
                4008
            ],
            [
                4008,
                4031
            ],
            [
                4031,
                4079
            ],
            [
                4079,
                4156
            ],
            [
                4156,
                4211
            ],
            [
                4211,
                4247
            ],
            [
                4247,
                4311
            ],
            [
                4311,
                4697
            ],
            [
                4697,
                4933
            ],
            [
                4933,
                5177
            ],
            [
                5177,
                5312
            ],
            [
                5312,
                5499
            ],
            [
                5499,
                5766
            ],
            [
                5766,
                6024
            ],
            [
                6024,
                6313
            ],
            [
                6313,
                6471
            ],
            [
                6471,
                6549
            ],
            [
                6549,
                6655
            ],
            [
                6655,
                6773
            ],
            [
                6773,
                6878
            ],
            [
                6878,
                6973
            ],
            [
                6973,
                7277
            ],
            [
                7277,
                7442
            ],
            [
                7442,
                7668
            ],
            [
                7668,
                7842
            ],
            [
                7842,
                7892
            ],
            [
                7892,
                8149
            ],
            [
                8149,
                8474
            ],
            [
                8474,
                8528
            ],
            [
                8528,
                8672
            ],
            [
                8672,
                8707
            ],
            [
                8707,
                8900
            ],
            [
                8900,
                8974
            ],
            [
                8974,
                9013
            ],
            [
                9013,
                9165
            ],
            [
                9165,
                9258
            ],
            [
                9258,
                9367
            ],
            [
                9367,
                9395
            ],
            [
                9395,
                9430
            ],
            [
                9430,
                9449
            ],
            [
                9449,
                9466
            ],
            [
                9466,
                9478
            ],
            [
                9478,
                9515
            ],
            [
                9515,
                9578
            ],
            [
                9578,
                9643
            ],
            [
                9643,
                9665
            ],
            [
                9665,
                9685
            ],
            [
                9685,
                9708
            ],
            [
                9708,
                9986
            ],
            [
                9986,
                10109
            ],
            [
                10109,
                10231
            ],
            [
                10231,
                10254
            ],
            [
                10254,
                10322
            ],
            [
                10322,
                10458
            ],
            [
                10458,
                10478
            ],
            [
                10478,
                10763
            ],
            [
                10763,
                10879
            ],
            [
                10879,
                10920
            ],
            [
                10920,
                11103
            ],
            [
                11103,
                11264
            ],
            [
                11264,
                11540
            ],
            [
                11540,
                11555
            ],
            [
                11555,
                11574
            ],
            [
                11574,
                11641
            ],
            [
                11641,
                11696
            ],
            [
                11696,
                11740
            ],
            [
                11740,
                11792
            ],
            [
                11792,
                11817
            ],
            [
                11817,
                11853
            ],
            [
                11853,
                11986
            ],
            [
                11986,
                12054
            ],
            [
                12054,
                12155
            ],
            [
                12155,
                12202
            ],
            [
                12202,
                12287
            ],
            [
                12287,
                12330
            ],
            [
                12330,
                12417
            ],
            [
                12417,
                12556
            ],
            [
                12556,
                12754
            ],
            [
                12754,
                12849
            ],
            [
                12849,
                13102
            ],
            [
                13102,
                13360
            ],
            [
                13360,
                13644
            ],
            [
                13644,
                13971
            ],
            [
                13971,
                14176
            ],
            [
                14176,
                14438
            ],
            [
                14438,
                14630
            ],
            [
                14630,
                14794
            ],
            [
                14794,
                14964
            ],
            [
                14964,
                15136
            ],
            [
                15136,
                15404
            ],
            [
                15404,
                15589
            ],
            [
                15589,
                15922
            ],
            [
                15922,
                16010
            ],
            [
                16010,
                16303
            ],
            [
                16303,
                16381
            ],
            [
                16381,
                16519
            ],
            [
                16519,
                16859
            ],
            [
                16859,
                17275
            ],
            [
                17275,
                17427
            ],
            [
                17427,
                17495
            ],
            [
                17495,
                17618
            ],
            [
                17618,
                17832
            ],
            [
                17832,
                17965
            ],
            [
                17965,
                18141
            ],
            [
                18141,
                18500
            ],
            [
                18500,
                18703
            ],
            [
                18703,
                18867
            ],
            [
                18867,
                19057
            ],
            [
                19057,
                19244
            ],
            [
                19244,
                19268
            ],
            [
                19268,
                19299
            ],
            [
                19299,
                19352
            ],
            [
                19352,
                19394
            ],
            [
                19394,
                19454
            ],
            [
                19454,
                19462
            ],
            [
                19462,
                19495
            ],
            [
                19495,
                19524
            ],
            [
                19524,
                19662
            ],
            [
                19662,
                19806
            ],
            [
                19806,
                19871
            ],
            [
                19871,
                19910
            ],
            [
                19910,
                19957
            ],
            [
                19957,
                19976
            ],
            [
                19976,
                20110
            ],
            [
                20110,
                20138
            ],
            [
                20138,
                20193
            ],
            [
                20193,
                20219
            ],
            [
                20219,
                20247
            ],
            [
                20247,
                20269
            ],
            [
                20269,
                20307
            ],
            [
                20307,
                20463
            ],
            [
                20463,
                20473
            ],
            [
                20473,
                20484
            ],
            [
                20484,
                20495
            ],
            [
                20495,
                20543
            ],
            [
                20543,
                20571
            ],
            [
                20571,
                20594
            ],
            [
                20594,
                20608
            ],
            [
                20608,
                20626
            ],
            [
                20626,
                20654
            ],
            [
                20654,
                20896
            ],
            [
                20896,
                21140
            ],
            [
                21140,
                21192
            ],
            [
                21192,
                21263
            ],
            [
                21263,
                21347
            ],
            [
                21347,
                21488
            ],
            [
                21488,
                21539
            ],
            [
                21539,
                21740
            ],
            [
                21740,
                21830
            ],
            [
                21830,
                21974
            ],
            [
                21974,
                21988
            ],
            [
                21988,
                22011
            ],
            [
                22011,
                22025
            ],
            [
                22025,
                22033
            ],
            [
                22033,
                22050
            ],
            [
                22050,
                22111
            ],
            [
                22111,
                22132
            ],
            [
                22132,
                22157
            ],
            [
                22157,
                22373
            ],
            [
                22373,
                22399
            ],
            [
                22399,
                22421
            ],
            [
                22421,
                22449
            ],
            [
                22449,
                22457
            ],
            [
                22457,
                22501
            ],
            [
                22501,
                22526
            ],
            [
                22526,
                22541
            ],
            [
                22541,
                22584
            ],
            [
                22584,
                22692
            ],
            [
                22692,
                22820
            ],
            [
                22820,
                22842
            ],
            [
                22842,
                22910
            ],
            [
                22910,
                22935
            ],
            [
                22935,
                22947
            ],
            [
                22947,
                22959
            ],
            [
                22959,
                22966
            ],
            [
                22966,
                23000
            ],
            [
                23000,
                23037
            ],
            [
                23037,
                23132
            ],
            [
                23132,
                23152
            ],
            [
                23152,
                23177
            ],
            [
                23177,
                23220
            ],
            [
                23220,
                23247
            ],
            [
                23247,
                23357
            ],
            [
                23357,
                23386
            ],
            [
                23386,
                23435
            ],
            [
                23435,
                23583
            ],
            [
                23583,
                23613
            ],
            [
                23613,
                23630
            ],
            [
                23630,
                23662
            ],
            [
                23662,
                23692
            ],
            [
                23692,
                23709
            ],
            [
                23709,
                23740
            ],
            [
                23740,
                23781
            ],
            [
                23781,
                23865
            ],
            [
                23865,
                23935
            ],
            [
                23935,
                23971
            ],
            [
                23971,
                24004
            ],
            [
                24004,
                24031
            ],
            [
                24031,
                24040
            ],
            [
                24040,
                24055
            ],
            [
                24055,
                24063
            ],
            [
                24063,
                24093
            ],
            [
                24093,
                24115
            ],
            [
                24115,
                24133
            ],
            [
                24133,
                24170
            ],
            [
                24170,
                24226
            ],
            [
                24226,
                24258
            ],
            [
                24258,
                24338
            ],
            [
                24338,
                24486
            ],
            [
                24486,
                24532
            ],
            [
                24532,
                24555
            ],
            [
                24555,
                24585
            ],
            [
                24585,
                24701
            ],
            [
                24701,
                24768
            ],
            [
                24768,
                24875
            ],
            [
                24875,
                24896
            ],
            [
                24896,
                24911
            ],
            [
                24911,
                24937
            ],
            [
                24937,
                24978
            ],
            [
                24978,
                25105
            ],
            [
                25105,
                25196
            ],
            [
                25196,
                25298
            ],
            [
                25298,
                25347
            ],
            [
                25347,
                25513
            ],
            [
                25513,
                25664
            ],
            [
                25664,
                25744
            ],
            [
                25744,
                25858
            ],
            [
                25858,
                25922
            ],
            [
                25922,
                25981
            ],
            [
                25981,
                26087
            ],
            [
                26087,
                26198
            ],
            [
                26198,
                26239
            ],
            [
                26239,
                26379
            ],
            [
                26379,
                26519
            ]
        ],
        "overlap_chars": [
            [
                0,
                44
            ],
            [
                61,
                91
            ],
            [
                97,
                129
            ],
            [
                150,
                179
            ],
            [
                179,
                181
            ],
            [
                189,
                213
            ],
            [
                309,
                310
            ],
            [
                314,
                319
            ],
            [
                319,
                349
            ],
            [
                472,
                485
            ],
            [
                491,
                568
            ],
            [
                568,
                571
            ],
            [
                656,
                669
            ],
            [
                706,
                738
            ],
            [
                915,
                917
            ],
            [
                917,
                957
            ],
            [
                997,
                1006
            ],
            [
                1054,
                1110
            ],
            [
                1162,
                1186
            ],
            [
                1186,
                1205
            ],
            [
                1205,
                1210
            ],
            [
                1210,
                1243
            ],
            [
                1245,
                1246
            ],
            [
                1322,
                1352
            ],
            [
                1526,
                1533
            ],
            [
                1552,
                1592
            ],
            [
                1592,
                1653
            ],
            [
                1663,
                1707
            ],
            [
                1707,
                1716
            ],
            [
                1735,
                1795
            ],
            [
                1803,
                1806
            ],
            [
                1797,
                1801
            ],
            [
                1815,
                1833
            ],
            [
                1872,
                1890
            ],
            [
                1899,
                1926
            ],
            [
                1926,
                1994
            ],
            [
                1998,
                2001
            ],
            [
                2023,
                2025
            ],
            [
                2025,
                2060
            ],
            [
                2061,
                2086
            ],
            [
                2086,
                2149
            ],
            [
                2189,
                2209
            ],
            [
                2211,
                2221
            ],
            [
                2224,
                2243
            ],
            [
                2270,
                2293
            ],
            [
                2302,
                2304
            ],
            [
                2336,
                2338
            ],
            [
                2338,
                2422
            ],
            [
                2430,
                2445
            ],
            [
                2470,
                2511
            ],
            [
                2554,
                2571
            ],
            [
                2580,
                2596
            ],
            [
                2721,
                2739
            ],
            [
                2739,
                2775
            ],
            [
                2775,
                2806
            ],
            [
                2806,
                2842
            ],
            [
                2842,
                2874
            ],
            [
                2995,
                3016
            ],
            [
                3033,
                3035
            ],
            [
                3036,
                3038
            ],
            [
                3095,
                3100
            ],
            [
                3108,
                3129
            ],
            [
                3151,
                3153
            ],
            [
                3153,
                3160
            ],
            [
                3167,
                3209
            ],
            [
                3209,
                3258
            ],
            [
                3258,
                3290
            ],
            [
                3290,
                3298
            ],
            [
                3298,
                3357
            ],
            [
                3379,
                3381
            ],
            [
                3381,
                3382
            ],
            [
                3399,
                3461
            ],
            [
                3461,
                3547
            ],
            [
                3554,
                3558
            ],
            [
                3584,
                3587
            ],
            [
                3571,
                3574
            ],
            [
                3580,
                3583
            ],
            [
                3559,
                3565
            ],
            [
                3728,
                3730
            ],
            [
                3593,
                3691
            ],
            [
                3692,
                3710
            ],
            [
                3548,
                3550
            ],
            [
                3731,
                3746
            ],
            [
                3748,
                3793
            ],
            [
                3802,
                3819
            ],
            [
                3819,
                3910
            ],
            [
                3920,
                3977
            ],
            [
                3999,
                4008
            ],
            [
                4079,
                4105
            ],
            [
                4106,
                4139
            ],
            [
                4145,
                4155
            ],
            [
                4031,
                4045
            ],
            [
                4077,
                4078
            ],
            [
                4156,
                4211
            ],
            [
                4211,
                4227
            ],
            [
                4239,
                4247
            ],
            [
                4247,
                4311
            ],
            [
                4311,
                4422
            ],
            [
                4431,
                4534
            ],
            [
                4574,
                4578
            ],
            [
                4592,
                4620
            ],
            [
                4695,
                4697
            ],
            [
                4700,
                4701
            ],
            [
                4859,
                4873
            ],
            [
                4903,
                4911
            ],
            [
                4878,
                4882
            ],
            [
                4912,
                4931
            ],
            [
                4855,
                4858
            ],
            [
                4965,
                4967
            ],
            [
                4933,
                4937
            ],
            [
                5185,
                5199
            ],
            [
                4891,
                4897
            ],
            [
                5229,
                5239
            ],
            [
                5243,
                5312
            ],
            [
                5312,
                5331
            ],
            [
                5416,
                5420
            ],
            [
                5345,
                5373
            ],
            [
                5381,
                5415
            ],
            [
                5427,
                5439
            ],
            [
                5497,
                5499
            ],
            [
                5588,
                5594
            ],
            [
                5595,
                5630
            ],
            [
                5638,
                5649
            ],
            [
                5689,
                5766
            ],
            [
                5766,
                5959
            ],
            [
                6004,
                6024
            ],
            [
                6024,
                6066
            ],
            [
                6117,
                6120
            ],
            [
                6071,
                6081
            ],
            [
                6134,
                6155
            ],
            [
                6184,
                6188
            ],
            [
                6192,
                6203
            ],
            [
                6245,
                6246
            ],
            [
                6276,
                6313
            ],
            [
                6313,
                6329
            ],
            [
                6346,
                6470
            ],
            [
                6549,
                6564
            ],
            [
                6571,
                6591
            ],
            [
                6613,
                6655
            ],
            [
                6655,
                6694
            ],
            [
                6770,
                6773
            ],
            [
                6773,
                6775
            ],
            [
                6806,
                6818
            ],
            [
                6852,
                6853
            ],
            [
                6872,
                6878
            ],
            [
                6878,
                6894
            ],
            [
                7000,
                7004
            ],
            [
                6918,
                6968
            ],
            [
                7034,
                7037
            ],
            [
                6905,
                6909
            ],
            [
                7067,
                7072
            ],
            [
                7044,
                7052
            ],
            [
                7080,
                7086
            ],
            [
                7105,
                7155
            ],
            [
                7163,
                7170
            ],
            [
                7171,
                7179
            ],
            [
                6910,
                6913
            ],
            [
                7204,
                7244
            ],
            [
                7249,
                7254
            ],
            [
                7275,
                7277
            ],
            [
                7277,
                7358
            ],
            [
                7386,
                7442
            ],
            [
                7703,
                7732
            ],
            [
                7758,
                7762
            ],
            [
                7789,
                7792
            ],
            [
                7763,
                7784
            ],
            [
                7793,
                7799
            ],
            [
                7815,
                7842
            ],
            [
                7859,
                7892
            ],
            [
                7892,
                7982
            ],
            [
                7989,
                7997
            ],
            [
                8018,
                8065
            ],
            [
                8096,
                8128
            ],
            [
                8147,
                8149
            ],
            [
                8149,
                8192
            ],
            [
                8403,
                8404
            ],
            [
                8427,
                8447
            ],
            [
                8474,
                8528
            ],
            [
                8528,
                8583
            ],
            [
                8589,
                8608
            ],
            [
                8650,
                8672
            ],
            [
                8672,
                8707
            ],
            [
                8707,
                8745
            ],
            [
                8774,
                8785
            ],
            [
                8794,
                8900
            ],
            [
                8939,
                8974
            ],
            [
                8974,
                9013
            ],
            [
                9013,
                9057
            ],
            [
                9163,
                9165
            ],
            [
                9165,
                9258
            ],
            [
                9258,
                9262
            ],
            [
                9290,
                9293
            ],
            [
                9301,
                9314
            ],
            [
                9321,
                9331
            ],
            [
                9338,
                9347
            ],
            [
                9365,
                9367
            ],
            [
                9367,
                9392
            ],
            [
                9395,
                9430
            ],
            [
                9430,
                9448
            ],
            [
                9708,
                9726
            ],
            [
                9788,
                9816
            ],
            [
                9835,
                9838
            ],
            [
                9847,
                9854
            ],
            [
                9894,
                9971
            ],
            [
                9986,
                10007
            ],
            [
                10017,
                10035
            ],
            [
                10041,
                10042
            ],
            [
                10068,
                10069
            ],
            [
                10080,
                10109
            ],
            [
                10112,
                10186
            ],
            [
                10193,
                10231
            ],
            [
                10231,
                10254
            ],
            [
                10256,
                10305
            ],
            [
                10310,
                10322
            ],
            [
                10445,
                10446
            ],
            [
                10324,
                10332
            ],
            [
                10336,
                10354
            ],
            [
                10368,
                10443
            ],
            [
                10447,
                10456
            ],
            [
                10478,
                10483
            ],
            [
                10500,
                10552
            ],
            [
                10699,
                10702
            ],
            [
                10553,
                10560
            ],
            [
                10686,
                10688
            ],
            [
                10613,
                10684
            ],
            [
                10761,
                10763
            ],
            [
                10763,
                10782
            ],
            [
                10831,
                10835
            ],
            [
                10799,
                10805
            ],
            [
                10846,
                10879
            ],
            [
                10879,
                10882
            ],
            [
                10944,
                10972
            ],
            [
                10918,
                10920
            ],
            [
                11106,
                11133
            ],
            [
                11164,
                11264
            ],
            [
                11264,
                11335
            ],
            [
                11349,
                11369
            ],
            [
                11378,
                11476
            ],
            [
                11538,
                11540
            ],
            [
                11540,
                11555
            ],
            [
                11555,
                11574
            ],
            [
                11574,
                11589
            ],
            [
                11590,
                11597
            ],
            [
                11635,
                11641
            ],
            [
                11641,
                11696
            ],
            [
                11740,
                11776
            ],
            [
                11790,
                11792
            ],
            [
                11792,
                11800
            ],
            [
                11806,
                11817
            ],
            [
                11817,
                11853
            ],
            [
                11853,
                11886
            ],
            [
                11935,
                11986
            ],
            [
                11986,
                12022
            ],
            [
                12023,
                12027
            ],
            [
                12045,
                12054
            ],
            [
                12054,
                12155
            ],
            [
                12155,
                12202
            ],
            [
                12202,
                12244
            ],
            [
                12264,
                12269
            ],
            [
                12278,
                12287
            ],
            [
                12287,
                12330
            ],
            [
                12330,
                12417
            ],
            [
                12417,
                12556
            ],
            [
                12556,
                12754
            ],
            [
                12754,
                12785
            ],
            [
                12847,
                12849
            ],
            [
                12849,
                12903
            ],
            [
                12912,
                12922
            ],
            [
                12941,
                12962
            ],
            [
                13100,
                13102
            ],
            [
                13102,
                13159
            ],
            [
                13171,
                13178
            ],
            [
                13223,
                13276
            ],
            [
                13305,
                13309
            ],
            [
                13328,
                13360
            ],
            [
                13360,
                13438
            ],
            [
                13450,
                13525
            ],
            [
                13525,
                13568
            ],
            [
                13642,
                13644
            ],
            [
                13644,
                13678
            ],
            [
                13790,
                13801
            ],
            [
                13803,
                13889
            ],
            [
                13947,
                13971
            ],
            [
                13971,
                13980
            ],
            [
                14007,
                14082
            ],
            [
                14096,
                14108
            ],
            [
                14145,
                14176
            ],
            [
                14241,
                14248
            ],
            [
                14249,
                14361
            ],
            [
                14393,
                14400
            ],
            [
                14370,
                14373
            ],
            [
                14401,
                14438
            ],
            [
                14438,
                14486
            ],
            [
                14487,
                14496
            ],
            [
                14528,
                14531
            ],
            [
                14600,
                14604
            ],
            [
                14532,
                14545
            ],
            [
                14628,
                14630
            ],
            [
                14630,
                14794
            ],
            [
                14794,
                14834
            ],
            [
                14847,
                14878
            ],
            [
                14962,
                14964
            ],
            [
                14964,
                14974
            ],
            [
                14986,
                14988
            ],
            [
                14996,
                15136
            ],
            [
                15136,
                15154
            ],
            [
                15156,
                15171
            ],
            [
                15187,
                15211
            ],
            [
                15220,
                15242
            ],
            [
                15263,
                15305
            ],
            [
                15348,
                15360
            ],
            [
                15402,
                15404
            ],
            [
                15404,
                15589
            ],
            [
                15589,
                15647
            ],
            [
                15682,
                15750
            ],
            [
                15767,
                15798
            ],
            [
                15811,
                15837
            ],
            [
                15848,
                15921
            ],
            [
                16010,
                16015
            ],
            [
                16025,
                16117
            ],
            [
                16161,
                16190
            ],
            [
                16327,
                16328
            ],
            [
                16309,
                16314
            ],
            [
                16321,
                16327
            ],
            [
                16379,
                16381
            ],
            [
                16381,
                16496
            ],
            [
                16502,
                16519
            ],
            [
                16519,
                16612
            ],
            [
                16665,
                16668
            ],
            [
                16625,
                16649
            ],
            [
                16657,
                16661
            ],
            [
                16673,
                16674
            ],
            [
                16679,
                16686
            ],
            [
                16698,
                16736
            ],
            [
                16857,
                16859
            ],
            [
                16859,
                16909
            ],
            [
                16922,
                16934
            ],
            [
                17065,
                17174
            ],
            [
                17205,
                17224
            ],
            [
                17236,
                17275
            ],
            [
                17275,
                17280
            ],
            [
                17314,
                17392
            ],
            [
                17414,
                17427
            ],
            [
                17495,
                17593
            ],
            [
                17605,
                17617
            ],
            [
                17832,
                17856
            ],
            [
                17863,
                17898
            ],
            [
                17915,
                17927
            ],
            [
                17941,
                17965
            ],
            [
                17965,
                18007
            ],
            [
                18043,
                18061
            ],
            [
                18063,
                18095
            ],
            [
                18114,
                18141
            ],
            [
                18141,
                18150
            ],
            [
                18281,
                18282
            ],
            [
                18154,
                18163
            ],
            [
                18203,
                18277
            ],
            [
                18310,
                18350
            ],
            [
                18362,
                18403
            ],
            [
                18431,
                18500
            ],
            [
                18500,
                18703
            ],
            [
                18703,
                18715
            ],
            [
                18742,
                18750
            ],
            [
                18765,
                18768
            ],
            [
                18772,
                18776
            ],
            [
                18817,
                18819
            ],
            [
                18782,
                18797
            ],
            [
                18865,
                18867
            ],
            [
                18867,
                18966
            ],
            [
                19055,
                19057
            ],
            [
                19057,
                19089
            ],
            [
                19120,
                19219
            ],
            [
                19235,
                19244
            ],
            [
                19244,
                19268
            ],
            [
                19268,
                19299
            ],
            [
                19299,
                19352
            ],
            [
                19352,
                19394
            ],
            [
                19423,
                19451
            ],
            [
                19525,
                19586
            ],
            [
                19600,
                19603
            ],
            [
                19615,
                19622
            ],
            [
                19624,
                19631
            ],
            [
                19633,
                19662
            ],
            [
                19662,
                19689
            ],
            [
                19734,
                19782
            ],
            [
                19804,
                19805
            ],
            [
                19806,
                19871
            ],
            [
                19871,
                19889
            ],
            [
                19908,
                19910
            ],
            [
                19910,
                19957
            ],
            [
                19957,
                19976
            ],
            [
                20041,
                20047
            ],
            [
                20103,
                20105
            ],
            [
                20051,
                20089
            ],
            [
                20016,
                20023
            ],
            [
                20106,
                20108
            ],
            [
                20095,
                20097
            ],
            [
                20110,
                20138
            ],
            [
                20138,
                20152
            ],
            [
                20161,
                20176
            ],
            [
                20191,
                20192
            ],
            [
                20219,
                20247
            ],
            [
                20247,
                20269
            ],
            [
                20269,
                20298
            ],
            [
                20304,
                20307
            ],
            [
                20307,
                20463
            ],
            [
                20463,
                20473
            ],
            [
                20473,
                20483
            ],
            [
                20543,
                20544
            ],
            [
                20553,
                20568
            ],
            [
                20608,
                20626
            ],
            [
                20626,
                20654
            ],
            [
                20654,
                20739
            ],
            [
                20740,
                20762
            ],
            [
                20798,
                20801
            ],
            [
                20778,
                20794
            ],
            [
                20894,
                20896
            ],
            [
                20896,
                20951
            ],
            [
                20953,
                20987
            ],
            [
                20999,
                21140
            ],
            [
                21140,
                21191
            ],
            [
                21192,
                21229
            ],
            [
                21261,
                21263
            ],
            [
                21263,
                21293
            ],
            [
                21309,
                21345
            ],
            [
                21307,
                21308
            ],
            [
                21350,
                21362
            ],
            [
                21437,
                21444
            ],
            [
                21464,
                21488
            ],
            [
                21488,
                21500
            ],
            [
                21508,
                21539
            ],
            [
                21539,
                21557
            ],
            [
                21566,
                21588
            ],
            [
                21595,
                21630
            ],
            [
                21645,
                21662
            ],
            [
                21738,
                21740
            ],
            [
                21759,
                21770
            ],
            [
                21794,
                21830
            ],
            [
                21830,
                21932
            ],
            [
                21972,
                21974
            ],
            [
                21974,
                21988
            ],
            [
                21988,
                22011
            ],
            [
                22011,
                22025
            ],
            [
                22025,
                22033
            ],
            [
                22033,
                22050
            ],
            [
                22050,
                22053
            ],
            [
                22079,
                22084
            ],
            [
                22066,
                22078
            ],
            [
                22109,
                22111
            ],
            [
                22111,
                22132
            ],
            [
                22132,
                22157
            ],
            [
                22157,
                22202
            ],
            [
                22296,
                22323
            ],
            [
                22348,
                22373
            ],
            [
                22373,
                22399
            ],
            [
                22399,
                22407
            ],
            [
                22419,
                22420
            ],
            [
                22449,
                22454
            ],
            [
                22501,
                22526
            ],
            [
                22526,
                22541
            ],
            [
                22541,
                22584
            ],
            [
                22584,
                22602
            ],
            [
                22625,
                22680
            ],
            [
                22690,
                22692
            ],
            [
                22692,
                22695
            ],
            [
                22702,
                22728
            ],
            [
                22734,
                22739
            ],
            [
                22775,
                22820
            ],
            [
                22820,
                22842
            ],
            [
                22842,
                22877
            ],
            [
                22908,
                22909
            ],
            [
                22935,
                22947
            ],
            [
                22947,
                22959
            ],
            [
                22959,
                22966
            ],
            [
                22966,
                23000
            ],
            [
                23000,
                23037
            ],
            [
                23037,
                23132
            ],
            [
                23132,
                23152
            ],
            [
                23152,
                23177
            ],
            [
                23177,
                23220
            ],
            [
                23220,
                23247
            ],
            [
                23247,
                23305
            ],
            [
                23321,
                23357
            ],
            [
                23357,
                23386
            ],
            [
                23386,
                23435
            ],
            [
                23435,
                23488
            ],
            [
                23527,
                23540
            ],
            [
                23550,
                23564
            ],
            [
                23581,
                23583
            ],
            [
                23583,
                23613
            ],
            [
                23613,
                23630
            ],
            [
                23630,
                23662
            ],
            [
                23662,
                23692
            ],
            [
                23692,
                23709
            ],
            [
                23709,
                23740
            ],
            [
                23740,
                23756
            ],
            [
                23758,
                23781
            ],
            [
                23821,
                23856
            ],
            [
                23863,
                23865
            ],
            [
                23865,
                23896
            ],
            [
                23906,
                23935
            ],
            [
                23935,
                23971
            ],
            [
                23971,
                23989
            ],
            [
                23995,
                24004
            ],
            [
                24031,
                24040
            ],
            [
                24040,
                24055
            ],
            [
                24055,
                24063
            ],
            [
                24063,
                24064
            ],
            [
                24077,
                24089
            ],
            [
                24226,
                24251
            ],
            [
                24255,
                24258
            ],
            [
                24258,
                24259
            ],
            [
                24268,
                24291
            ],
            [
                24336,
                24338
            ],
            [
                24338,
                24439
            ],
            [
                24445,
                24448
            ],
            [
                24456,
                24486
            ],
            [
                24585,
                24642
            ],
            [
                24652,
                24701
            ],
            [
                24712,
                24715
            ],
            [
                24737,
                24768
            ],
            [
                24768,
                24875
            ],
            [
                24875,
                24896
            ],
            [
                24896,
                24911
            ],
            [
                24911,
                24937
            ],
            [
                24937,
                24978
            ],
            [
                24978,
                24989
            ],
            [
                25000,
                25105
            ],
            [
                25105,
                25196
            ],
            [
                25196,
                25234
            ],
            [
                25268,
                25269
            ],
            [
                25237,
                25246
            ],
            [
                25252,
                25266
            ],
            [
                25296,
                25298
            ],
            [
                25298,
                25347
            ],
            [
                25347,
                25374
            ],
            [
                25391,
                25411
            ],
            [
                25412,
                25426
            ],
            [
                25452,
                25453
            ],
            [
                25473,
                25478
            ],
            [
                25484,
                25492
            ],
            [
                25511,
                25513
            ],
            [
                25524,
                25664
            ],
            [
                25664,
                25744
            ],
            [
                25744,
                25774
            ],
            [
                25858,
                25868
            ],
            [
                25813,
                25815
            ],
            [
                25891,
                25922
            ],
            [
                25922,
                25981
            ],
            [
                25981,
                26000
            ],
            [
                26091,
                26118
            ],
            [
                26154,
                26198
            ],
            [
                26198,
                26239
            ],
            [
                26239,
                26242
            ],
            [
                26252,
                26315
            ],
            [
                26335,
                26379
            ],
            [
                26379,
                26445
            ],
            [
                26467,
                26476
            ],
            [
                26482,
                26492
            ],
            [
                26457,
                26461
            ],
            [
                26518,
                26519
            ]
        ],
        "row_chars": [
            [
                0,
                179
            ],
            [
                179,
                214
            ],
            [
                214,
                254
            ],
            [
                254,
                309
            ],
            [
                309,
                319
            ],
            [
                319,
                568
            ],
            [
                568,
                917
            ],
            [
                917,
                1110
            ],
            [
                1110,
                1162
            ],
            [
                1162,
                1186
            ],
            [
                1186,
                1205
            ],
            [
                1205,
                1210
            ],
            [
                1210,
                1355
            ],
            [
                1355,
                1375
            ],
            [
                1375,
                1407
            ],
            [
                1407,
                1455
            ],
            [
                1455,
                1526
            ],
            [
                1526,
                1592
            ],
            [
                1592,
                1707
            ],
            [
                1707,
                1926
            ],
            [
                1926,
                2025
            ],
            [
                2025,
                2086
            ],
            [
                2086,
                2224
            ],
            [
                2224,
                2338
            ],
            [
                2338,
                2739
            ],
            [
                2739,
                2775
            ],
            [
                2775,
                2806
            ],
            [
                2806,
                2842
            ],
            [
                2842,
                3035
            ],
            [
                3035,
                3153
            ],
            [
                3153,
                3209
            ],
            [
                3209,
                3258
            ],
            [
                3258,
                3290
            ],
            [
                3290,
                3298
            ],
            [
                3298,
                3381
            ],
            [
                3381,
                3461
            ],
            [
                3461,
                3819
            ],
            [
                3819,
                4008
            ],
            [
                4008,
                4031
            ],
            [
                4031,
                4156
            ],
            [
                4156,
                4211
            ],
            [
                4211,
                4247
            ],
            [
                4247,
                4311
            ],
            [
                4311,
                4697
            ],
            [
                4697,
                5312
            ],
            [
                5312,
                5499
            ],
            [
                5499,
                5766
            ],
            [
                5766,
                6024
            ],
            [
                6024,
                6313
            ],
            [
                6313,
                6471
            ],
            [
                6471,
                6549
            ],
            [
                6549,
                6655
            ],
            [
                6655,
                6773
            ],
            [
                6773,
                6878
            ],
            [
                6878,
                7277
            ],
            [
                7277,
                7442
            ],
            [
                7442,
                7668
            ],
            [
                7668,
                7842
            ],
            [
                7842,
                7892
            ],
            [
                7892,
                8149
            ],
            [
                8149,
                8528
            ],
            [
                8528,
                8672
            ],
            [
                8672,
                8707
            ],
            [
                8707,
                8900
            ],
            [
                8900,
                8974
            ],
            [
                8974,
                9013
            ],
            [
                9013,
                9165
            ],
            [
                9165,
                9258
            ],
            [
                9258,
                9367
            ],
            [
                9367,
                9395
            ],
            [
                9395,
                9430
            ],
            [
                9430,
                9449
            ],
            [
                9449,
                9466
            ],
            [
                9466,
                9478
            ],
            [
                9478,
                9515
            ],
            [
                9515,
                9578
            ],
            [
                9578,
                9643
            ],
            [
                9643,
                9665
            ],
            [
                9665,
                9685
            ],
            [
                9685,
                9708
            ],
            [
                9708,
                9986
            ],
            [
                9986,
                10109
            ],
            [
                10109,
                10231
            ],
            [
                10231,
                10254
            ],
            [
                10254,
                10322
            ],
            [
                10322,
                10458
            ],
            [
                10458,
                10478
            ],
            [
                10478,
                10763
            ],
            [
                10763,
                10879
            ],
            [
                10879,
                11103
            ],
            [
                11103,
                11264
            ],
            [
                11264,
                11540
            ],
            [
                11540,
                11555
            ],
            [
                11555,
                11574
            ],
            [
                11574,
                11641
            ],
            [
                11641,
                11696
            ],
            [
                11696,
                11740
            ],
            [
                11740,
                11792
            ],
            [
                11792,
                11817
            ],
            [
                11817,
                11853
            ],
            [
                11853,
                11986
            ],
            [
                11986,
                12054
            ],
            [
                12054,
                12155
            ],
            [
                12155,
                12202
            ],
            [
                12202,
                12287
            ],
            [
                12287,
                12330
            ],
            [
                12330,
                12417
            ],
            [
                12417,
                12556
            ],
            [
                12556,
                12754
            ],
            [
                12754,
                12849
            ],
            [
                12849,
                13102
            ],
            [
                13102,
                13360
            ],
            [
                13360,
                13644
            ],
            [
                13644,
                13971
            ],
            [
                13971,
                14176
            ],
            [
                14176,
                14438
            ],
            [
                14438,
                14630
            ],
            [
                14630,
                14794
            ],
            [
                14794,
                14964
            ],
            [
                14964,
                15136
            ],
            [
                15136,
                15404
            ],
            [
                15404,
                15589
            ],
            [
                15589,
                15922
            ],
            [
                15922,
                16010
            ],
            [
                16010,
                16381
            ],
            [
                16381,
                16519
            ],
            [
                16519,
                16859
            ],
            [
                16859,
                17275
            ],
            [
                17275,
                17427
            ],
            [
                17427,
                17495
            ],
            [
                17495,
                17618
            ],
            [
                17618,
                17832
            ],
            [
                17832,
                17965
            ],
            [
                17965,
                18141
            ],
            [
                18141,
                18500
            ],
            [
                18500,
                18703
            ],
            [
                18703,
                18867
            ],
            [
                18867,
                19057
            ],
            [
                19057,
                19244
            ],
            [
                19244,
                19268
            ],
            [
                19268,
                19299
            ],
            [
                19299,
                19352
            ],
            [
                19352,
                19394
            ],
            [
                19394,
                19454
            ],
            [
                19454,
                19462
            ],
            [
                19462,
                19495
            ],
            [
                19495,
                19524
            ],
            [
                19524,
                19662
            ],
            [
                19662,
                19806
            ],
            [
                19806,
                19871
            ],
            [
                19871,
                19910
            ],
            [
                19910,
                19957
            ],
            [
                19957,
                19976
            ],
            [
                19976,
                20110
            ],
            [
                20110,
                20138
            ],
            [
                20138,
                20193
            ],
            [
                20193,
                20219
            ],
            [
                20219,
                20247
            ],
            [
                20247,
                20269
            ],
            [
                20269,
                20307
            ],
            [
                20307,
                20463
            ],
            [
                20463,
                20473
            ],
            [
                20473,
                20484
            ],
            [
                20484,
                20495
            ],
            [
                20495,
                20543
            ],
            [
                20543,
                20571
            ],
            [
                20571,
                20594
            ],
            [
                20594,
                20608
            ],
            [
                20608,
                20626
            ],
            [
                20626,
                20654
            ],
            [
                20654,
                20896
            ],
            [
                20896,
                21140
            ],
            [
                21140,
                21192
            ],
            [
                21192,
                21263
            ],
            [
                21263,
                21488
            ],
            [
                21488,
                21539
            ],
            [
                21539,
                21740
            ],
            [
                21740,
                21830
            ],
            [
                21830,
                21974
            ],
            [
                21974,
                21988
            ],
            [
                21988,
                22011
            ],
            [
                22011,
                22025
            ],
            [
                22025,
                22033
            ],
            [
                22033,
                22050
            ],
            [
                22050,
                22111
            ],
            [
                22111,
                22132
            ],
            [
                22132,
                22157
            ],
            [
                22157,
                22373
            ],
            [
                22373,
                22399
            ],
            [
                22399,
                22421
            ],
            [
                22421,
                22449
            ],
            [
                22449,
                22457
            ],
            [
                22457,
                22501
            ],
            [
                22501,
                22526
            ],
            [
                22526,
                22541
            ],
            [
                22541,
                22584
            ],
            [
                22584,
                22692
            ],
            [
                22692,
                22820
            ],
            [
                22820,
                22842
            ],
            [
                22842,
                22910
            ],
            [
                22910,
                22935
            ],
            [
                22935,
                22947
            ],
            [
                22947,
                22959
            ],
            [
                22959,
                22966
            ],
            [
                22966,
                23000
            ],
            [
                23000,
                23037
            ],
            [
                23037,
                23132
            ],
            [
                23132,
                23152
            ],
            [
                23152,
                23177
            ],
            [
                23177,
                23220
            ],
            [
                23220,
                23247
            ],
            [
                23247,
                23357
            ],
            [
                23357,
                23386
            ],
            [
                23386,
                23435
            ],
            [
                23435,
                23583
            ],
            [
                23583,
                23613
            ],
            [
                23613,
                23630
            ],
            [
                23630,
                23662
            ],
            [
                23662,
                23692
            ],
            [
                23692,
                23709
            ],
            [
                23709,
                23740
            ],
            [
                23740,
                23781
            ],
            [
                23781,
                23865
            ],
            [
                23865,
                23935
            ],
            [
                23935,
                23971
            ],
            [
                23971,
                24004
            ],
            [
                24004,
                24031
            ],
            [
                24031,
                24040
            ],
            [
                24040,
                24055
            ],
            [
                24055,
                24063
            ],
            [
                24063,
                24093
            ],
            [
                24093,
                24115
            ],
            [
                24115,
                24133
            ],
            [
                24133,
                24170
            ],
            [
                24170,
                24226
            ],
            [
                24226,
                24258
            ],
            [
                24258,
                24338
            ],
            [
                24338,
                24486
            ],
            [
                24486,
                24532
            ],
            [
                24532,
                24555
            ],
            [
                24555,
                24585
            ],
            [
                24585,
                24701
            ],
            [
                24701,
                24768
            ],
            [
                24768,
                24875
            ],
            [
                24875,
                24896
            ],
            [
                24896,
                24911
            ],
            [
                24911,
                24937
            ],
            [
                24937,
                24978
            ],
            [
                24978,
                25105
            ],
            [
                25105,
                25196
            ],
            [
                25196,
                25298
            ],
            [
                25298,
                25347
            ],
            [
                25347,
                25513
            ],
            [
                25513,
                25664
            ],
            [
                25664,
                25744
            ],
            [
                25744,
                25922
            ],
            [
                25922,
                25981
            ],
            [
                25981,
                26198
            ],
            [
                26198,
                26239
            ],
            [
                26239,
                26379
            ],
            [
                26379,
                26519
            ]
        ]
    },
    "abridged": {
        "text": "We were to pass the night, Mr. Kenge told us back in his room, at Mrs. Jellyby's. Then he turned to me and said he assumed I knew who Mrs. Jellyby was.\n\"I don't, sir,\" I returned.\n\"Indeed! Mrs. Jellyby,\" said Mr. Kenge, \"is a lady of remarkable strength of character who devotes herself entirely to the public. She is at present devoted to the subject of Africa. Mr. Jarndyce, who is desirous to aid any good work, has, I believe, a very high opinion of Mrs. Jellyby.\"\n\"And Mr. Jellyby, sir?\" suggested Richard.\n\"Ah! Mr. Jellyby,\" said Mr. Kenge, \"is - a - is the husband of Mrs. Jellyby. I never had the pleasure of seeing Mr. Jellyby. He may be a very superior man, but he is, so to speak, merged in the more shining qualities of his wife.\" Mr. Kenge told us that as the road to Bleak House would have been very long and dark on such an evening, Mr. Jarndyce had proposed this arrangement. A carriage would be at Mrs. Jellyby's to convey us out of town early the next morning.\nHe then rang a little bell, and the inky young gentleman came in. Addressing him by the name of Guppy, Mr. Kenge inquired whether the baggage had been sent round. Mr. Guppy said yes, and a coach was waiting for us.\n\"Then it only remains,\" said Mr. Kenge, shaking hands with us, \"for me to express my satisfaction in the arrangement this day concluded and my hope that it will lead to the happiness of all concerned! Guppy, see the party safely there.\"\n\"Where is 'there,' Mr. Guppy?\" said Richard as we went downstairs.\n\"No distance,\" said Mr. Guppy; \"only round the corner. We'll be there in four minutes' time. This is a London particular now, ain't it, miss?\" He seemed quite delighted with it on my account.\n\"The fog is very dense indeed!\" said I.\n\"Not that it affects you, though, I'm sure,\" said Mr. Guppy. \"It seems to do you good, miss, judging from your appearance.\"\nI knew he meant well in paying me this compliment, so I laughed at myself for blushing when I had got into the coach and he had got up on to the box; and we all three laughed and chatted about our inexperience and the strangeness of London, until we turned up at our destination - a narrow street of high houses like an oblong tank to hold the fog. There was a confused little crowd of people, principally children, gathered about the house where we stopped, which had a tarnished brass plate on the door inscribed JELLYBY.\n\"One of the young Jellybys has been and got his head through the railings!\" said Mr. Guppy.\n\"Oh, poor child,\" said I; \"let me out, if you please!\"\n\"Pray be careful, miss. The young Jellybys are always up to something,\" said Mr. Guppy.\nI made my way to the poor child, who was one of the dirtiest little unfortunates I ever saw, and found him very frightened and crying loudly, fixed by the neck between two iron railings, while a milkman and a beadle were trying to drag him back by the legs. I mentioned that it might be best to push him forward; and by this means he was happily extricated, and then began to beat Mr. Guppy with a hoop-stick in quite a frantic manner.\nNobody had appeared from the house except a person in clogs, who had been poking at the child with a broom. This person now appeared in the passage without the clogs, and going upstairs before Ada and me, announced us as, \"Them two young ladies, Missis Jellyby!\" We passed several more children on the way up, whom it was difficult to avoid treading on in the dark; and as we came into Mrs. Jellyby's presence, one of the poor little things fell downstairs with a great noise.\nMrs. Jellyby, whose face reflected none of our uneasiness at hearing the dear child's head bump down every stair, received us with perfect equanimity. She was a pretty, plump woman of from forty to fifty, with handsome eyes, though they had a curious habit of seeming to look a long way off.\n\"I am very glad,\" said Mrs. Jellyby, \"to have the pleasure of receiving you. I have a great respect for Mr. Jarndyce.\"\nWe thanked her and sat down on a limp sofa. Mrs. Jellyby had been too much occupied with her African duties to brush her hair; and when she turned, we could not help noticing that her dress didn't meet up at the back, but was railed across with a lattice-work of corset-lace.\nThe room, which was strewn with papers and nearly filled by a great writing-table, was, I must say, not only very untidy but very dirty. A jaded and unhealthy-looking girl sat at the writing-table, biting her pen and staring at us. Nobody ever was in such a state of ink. And from her tumbled hair to her pretty feet, which were disfigured with frayed and broken slippers, she really seemed to have no article of dress that was in its proper condition.\n\"You find me, my dears,\" said Mrs. Jellyby, \"as usual, very busy; the African project at present employs my whole time. It involves me in correspondence with public bodies and private individuals all over the country. I am happy to say it is advancing. We hope by this time next year to have two hundred families cultivating coffee and educating the natives of Borrioboola-Gha, on the left bank of the Niger.\"\nI said it must be very gratifying.\n\"It is gratifying,\" said Mrs. Jellyby. \"It involves the devotion of all my energies. Do you know, Miss Summerson, I almost wonder that you never turned your thoughts to Africa.\"\nThis was so unexpected that I was at a loss. I hinted that the climate-\n\"The finest climate in the world!\" said Mrs. Jellyby. \"If you would like to look over some remarks on the subject, while I finish a letter I am now dictating to my eldest daughter, who is my scribe-\"\nThe girl at the table stopped biting her pen and gave a nod, half bashful and half sulky.\n\"-I shall then have finished for the present,\" proceeded Mrs. Jellyby with a smile, \"though my work is never done. Where are you, Caddy?\"\n\" 'Presents her compliments to Mr. Swallow, and begs-' \" said Caddy.\n\" 'And begs,' \" said Mrs. Jellyby, \" 'to inform him, in reference to his letter of inquiry on the African project-' No, Peepy!\"\nPeepy was the unfortunate child who had fallen downstairs, and who now came in, with a strip of plaster on his forehead, to exhibit his wounded knees. Mrs. Jellyby merely said serenely, \"Go along, you naughty Peepy!\" and proceeded with her dictation.\nI ventured to pick up poor Peepy, who looked very much astonished, but soon fell fast asleep in my arms, sobbing at longer and longer intervals, until he was quiet. I was so occupied with Peepy that I lost the letter in detail, though I had a general impression of the momentous importance of Africa, and the utter insignificance of all other places and things.\n\"Six o'clock!\" said Mrs. Jellyby. \"And our dinner-hour is five! Caddy, show Miss Clare and Miss Summerson their rooms. You will excuse me, I know, being so busy. Oh, that bad child! Pray put him down, Miss Summerson!\"\nI begged permission to retain him, and carried him upstairs and laid him on my bed. Ada and I had two upper rooms with a connecting door between. They were excessively bare and disorderly, and the curtain to my window was fastened up with a fork.\n\"You would like some hot water, wouldn't you?\" said Miss Jellyby, looking round for a jug, but in vain.\n\"If it is not being troublesome,\" said we.\n\"Oh, it's not the trouble,\" returned Miss Jellyby; \"the question is, if there is any.\"\nThe evening was so very cold and the rooms had such a marshy smell that I must confess it was a little miserable, and Ada was half crying. We soon laughed, however, and were busily unpacking when Miss Jellyby came back to say that she was sorry there was no hot water, but they couldn't find the kettle, and the boiler was out of order.\nWe begged her not to mention it. But all the little children had come up to the landing to look at Peepy lying on my bed. It was impossible to shut the door of either room, for my door had no knob; and though the handle of Ada's went round and round, it had no effect whatever on the door. Therefore I proposed to the children that they should come in and be very good, and I would tell them the story of Little Red Riding Hood while I dressed for dinner; which they did, and were as quiet as mice.\nWhen we went downstairs we found a young woman with a swelled face bound up in a flannel bandage blowing the fire of the drawing-room and choking dreadfully. It smoked so much that we all sat coughing and crying with the windows open for half an hour, while Mrs. Jellyby directed letters about Africa. Richard quietly told us that he had washed his hands in a pie-dish and that they had found the kettle on his dressing-table, and made me and Ada laugh in the most ridiculous manner.\nSoon after seven o'clock we went down to dinner, stepping carefully on the torn stair-carpets. We had a fine cod-fish, a piece of roast beef, a dish of cutlets, and a pudding; an excellent dinner, if it had had any cooking to speak of, but it was almost raw. The young woman with the flannel bandage dropped everything on the table. The person in clogs, who I suppose to have been the cook, frequently came and skirmished with her at the door, and there appeared to be ill will between them.\nAll through dinner - which was long, because of such accidents as the potatoes being mislaid and the handle of the corkscrew coming off - Mrs. Jellyby stayed serene. She told us a great deal that was interesting about Borrioboola-Gha and the natives, and received so many letters that Richard, who sat by her, saw four envelopes in the gravy at once. Some of the letters were proceedings of ladies' committees, which she read to us; others were applications from people excited about the cultivation of coffee; others required answers, which she sent her eldest daughter from the table three or four times to write.\nI was curious to know who a mild bald gentleman in spectacles was, who dropped into a vacant chair after the fish was taken away, never speaking a word. It was not until we left the table and he remained alone with Richard that the possibility of his being Mr. Jellyby entered my head. But he was Mr. Jellyby; and a loquacious young man called Mr. Quale, with large shining knobs on his forehead and his hair all brushed back, came in, and told Ada he was a philanthropist.\nThis young man, besides having a great deal to say about Africa, delighted in drawing Mrs. Jellyby out by saying, \"I believe now, Mrs. Jellyby, you have received as many as two hundred letters about Africa in a single day, have you not?\" or, \"Mrs. Jellyby, you once mentioned that you had sent off five thousand circulars at one time?\" During the whole evening, Mr. Jellyby sat in a corner with his head against the wall as if he were in low spirits.\nMrs. Jellyby, sitting in a nest of waste paper, drank coffee and dictated to her eldest daughter. She also held a discussion with Mr. Quale, about - if I understood it - the brotherhood of humanity, and expressed some beautiful sentiments. I was not a very attentive listener, however, for Peepy and the other children came flocking about Ada and me to ask for another story; so we sat down and told them in whispers \"Puss in Boots\" until Mrs. Jellyby, accidentally remembering them, sent them to bed. As Peepy cried for me to take him to bed, I carried him upstairs, where the young woman with the flannel bandage charged into the midst of the little family like a dragon and overturned them into cribs.\nAfter that I tidied our room and coaxed our very cross fire into burning. On my return downstairs, I felt that Mrs. Jellyby looked down upon me rather for being so frivolous.\nIt was nearly midnight before we could go to bed, and even then we left Mrs. Jellyby among her papers drinking coffee and Miss Jellyby biting her pen.\n\"What a strange house!\" said Ada when we got upstairs. \"How curious of my cousin Jarndyce to send us here!\"\n\"My love,\" said I, \"it quite confuses me. I can't understand it at all. It must be very good of Mrs. Jellyby to take such pains about the natives - and yet - Peepy and the housekeeping!\"\nAda laughed and put her arm around me, and told me I was a quiet, dear, good creature.\n\"You are so thoughtful, Esther,\" she said, \"and yet so cheerful! And you do so much! You would make a home out of even this house.\"\nMy simple darling! It was because of the goodness of her own heart that she praised me so.\n\"May I ask you a question?\" said I when we were sitting before the fire. \"Your cousin, Mr. Jarndyce. I owe so much to him. Would you mind describing him?\"\nShaking her golden hair, Ada turned her eyes upon me with such laughing wonder that I was full of wonder too, partly at her beauty, partly at her surprise.\n\"Esther!\" she cried. \"I never saw him!\"\nWell, to be sure!\nNo, she had never seen him. Young as she was when her mama died, she remembered how the tears would come into her mother's eyes when she spoke of his noble generosity. Her cousin Jarndyce had written to her a few months ago - \"a plain, honest letter,\" Ada said - proposing the arrangement we were now to enter on and telling her that \"in time it might heal some of the wounds made by the miserable Chancery suit.\" She had replied, gratefully accepting his proposal.\nRichard had received a similar letter. He had seen Mr. Jarndyce once, five years ago, at Winchester school, and had told Ada that he was \"a bluff, rosy fellow.\" This was the best description Ada could give me.\nIt set me thinking; when Ada was asleep, I remained before the fire, wondering about Bleak House. My thoughts were recalled by a tap at the door.\nI opened it softly and found Miss Jellyby shivering there with a broken candle in a broken candlestick.\n\"Good night!\" she said very sulkily.\n\"Good night!\" said I.\n\"May I come in?\" she asked unexpectedly.\n\"Certainly,\" said I. \"Don't wake Miss Clare.\"\nShe would not sit down, but stood by the fire rubbing at the ink stains on her face, and looking very gloomy.\n\"I wish Africa was dead!\" she said suddenly. \"I do! I hate it and detest it. It's a beast!\"\nI told her she was tired, and I was sorry. I put my hand upon her forehead, and said it was hot now but would be cool tomorrow. She stood pouting and frowning, but then turned softly towards the bed where Ada lay.\n\"She is very pretty!\" she said with the same knitted brow. \"An orphan. Ain't she?\"\n\"Yes.\"\n\"But knows a quantity, I suppose? Can dance, and play music, and sing? She can talk French, I suppose, and do geography, and globes, and needlework, and everything?\"\n\"No doubt,\" said I.\n\"I can't,\" she returned. \"I can't do anything hardly, except write. I'm always writing for Ma. I wonder you two were not ashamed of yourselves to come in and see me able to do nothing else. It was like your ill nature. Yet you think yourselves very fine, I dare say!\"\nI could see that the poor girl was near crying, and I looked at her as mildly as I could.\n\"It's disgraceful,\" she said. \"You know it is. The whole house is disgraceful. The children are disgraceful. I'm disgraceful. Pa's miserable, and no wonder! Priscilla drinks - she's always drinking. Shame on you if you say you didn't smell her today. It was as bad as a public-house at dinner; you know it was!\"\n\"My dear, I don't know it,\" said I.\n\"You do,\" she said shortly. \"You do!\"\n\"Oh, my dear!\" said I. \"Let me speak-\"\n\"I don't want to hear you.\"\n\"I think you do,\" said I. \"I did not know what you tell me because the servant did not come near me at dinner; but I don't doubt you, and I am sorry to hear it.\"\nShe was still standing by the bed, and now stooped down (with the same discontented face) and kissed Ada. Then she stood by the side of my chair. Her bosom was heaving in a distressful manner that I greatly pitied, but I thought it better not to speak.\n\"I wish I was dead!\" she broke out. \"I wish we were all dead. It would be a great deal better for us.\"\nIn a moment, she knelt on the ground at my side, hid her face in my dress, passionately begged my pardon, and wept. I comforted her and would have raised her, but she cried no, no; she wanted to stay there!\n\"You used to teach girls,\" she said, \"I wish you could have taught me! I am so very miserable, and I like you so much!\"\nI could not persuade her to do anything but move onto a ragged stool, still holding my dress. Gradually the poor tired girl fell asleep, and then I contrived to raise her head so that it should rest on my lap, and to cover us both with shawls. The fire went out, and all night long she slumbered thus before the ashy grate. At first I was painfully awake; but at length, my thoughts became indistinct and mingled. I began to lose the identity of the sleeper resting on me. Now it was Ada, now it was the little mad woman, now some one in authority at Bleak House. Lastly, it was no one, and I was no one.\nThe day was feebly struggling with the fog when I opened my eyes to see a dirty-faced little spectre fixed upon me. Peepy had scaled his crib, and crept down in his bed-gown and cap, his teeth chattering with the cold.",
        "paragraph_chars": [
            [
                0,
                152
            ],
            [
                152,
                180
            ],
            [
                180,
                469
            ],
            [
                469,
                512
            ],
            [
                512,
                979
            ],
            [
                979,
                1194
            ],
            [
                1194,
                1431
            ],
            [
                1431,
                1498
            ],
            [
                1498,
                1690
            ],
            [
                1690,
                1730
            ],
            [
                1730,
                1854
            ],
            [
                1854,
                2378
            ],
            [
                2378,
                2470
            ],
            [
                2470,
                2525
            ],
            [
                2525,
                2613
            ],
            [
                2613,
                3049
            ],
            [
                3049,
                3526
            ],
            [
                3526,
                3818
            ],
            [
                3818,
                3937
            ],
            [
                3937,
                4213
            ],
            [
                4213,
                4666
            ],
            [
                4666,
                5076
            ],
            [
                5076,
                5111
            ],
            [
                5111,
                5289
            ],
            [
                5289,
                5361
            ],
            [
                5361,
                5561
            ],
            [
                5561,
                5651
            ],
            [
                5651,
                5789
            ],
            [
                5789,
                5858
            ],
            [
                5858,
                5986
            ],
            [
                5986,
                6237
            ],
            [
                6237,
                6599
            ],
            [
                6599,
                6817
            ],
            [
                6817,
                7064
            ],
            [
                7064,
                7168
            ],
            [
                7168,
                7211
            ],
            [
                7211,
                7298
            ],
            [
                7298,
                7635
            ],
            [
                7635,
                8134
            ],
            [
                8134,
                8618
            ],
            [
                8618,
                9110
            ],
            [
                9110,
                9726
            ],
            [
                9726,
                10200
            ],
            [
                10200,
                10651
            ],
            [
                10651,
                11356
            ],
            [
                11356,
                11531
            ],
            [
                11531,
                11682
            ],
            [
                11682,
                11790
            ],
            [
                11790,
                11977
            ],
            [
                11977,
                12064
            ],
            [
                12064,
                12196
            ],
            [
                12196,
                12287
            ],
            [
                12287,
                12442
            ],
            [
                12442,
                12598
            ],
            [
                12598,
                12638
            ],
            [
                12638,
                12656
            ],
            [
                12656,
                13122
            ],
            [
                13122,
                13332
            ],
            [
                13332,
                13478
            ],
            [
                13478,
                13582
            ],
            [
                13582,
                13619
            ],
            [
                13619,
                13641
            ],
            [
                13641,
                13682
            ],
            [
                13682,
                13728
            ],
            [
                13728,
                13838
            ],
            [
                13838,
                13930
            ],
            [
                13930,
                14144
            ],
            [
                14144,
                14227
            ],
            [
                14227,
                14234
            ],
            [
                14234,
                14400
            ],
            [
                14400,
                14420
            ],
            [
                14420,
                14688
            ],
            [
                14688,
                14778
            ],
            [
                14778,
                15090
            ],
            [
                15090,
                15126
            ],
            [
                15126,
                15164
            ],
            [
                15164,
                15203
            ],
            [
                15203,
                15231
            ],
            [
                15231,
                15393
            ],
            [
                15393,
                15646
            ],
            [
                15646,
                15749
            ],
            [
                15749,
                15956
            ],
            [
                15956,
                16076
            ],
            [
                16076,
                16681
            ],
            [
                16681,
                16899
            ]
        ],
        "segment_chars": [
            [
                0,
                82
            ],
            [
                82,
                152
            ],
            [
                152,
                180
            ],
            [
                180,
                189
            ],
            [
                189,
                311
            ],
            [
                311,
                363
            ],
            [
                363,
                469
            ],
            [
                469,
                493
            ],
            [
                493,
                512
            ],
            [
                512,
                517
            ],
            [
                517,
                589
            ],
            [
                589,
                637
            ],
            [
                637,
                743
            ],
            [
                743,
                892
            ],
            [
                892,
                979
            ],
            [
                979,
                1045
            ],
            [
                1045,
                1142
            ],
            [
                1142,
                1194
            ],
            [
                1194,
                1395
            ],
            [
                1395,
                1431
            ],
            [
                1431,
                1462
            ],
            [
                1462,
                1498
            ],
            [
                1498,
                1553
            ],
            [
                1553,
                1591
            ],
            [
                1591,
                1641
            ],
            [
                1641,
                1690
            ],
            [
                1690,
                1722
            ],
            [
                1722,
                1730
            ],
            [
                1730,
                1791
            ],
            [
                1791,
                1854
            ],
            [
                1854,
                2203
            ],
            [
                2203,
                2378
            ],
            [
                2378,
                2454
            ],
            [
                2454,
                2470
            ],
            [
                2470,
                2525
            ],
            [
                2525,
                2549
            ],
            [
                2549,
                2613
            ],
            [
                2613,
                2871
            ],
            [
                2871,
                3049
            ],
            [
                3049,
                3157
            ],
            [
                3157,
                3312
            ],
            [
                3312,
                3526
            ],
            [
                3526,
                3677
            ],
            [
                3677,
                3818
            ],
            [
                3818,
                3895
            ],
            [
                3895,
                3937
            ],
            [
                3937,
                3981
            ],
            [
                3981,
                4213
            ],
            [
                4213,
                4350
            ],
            [
                4350,
                4445
            ],
            [
                4445,
                4485
            ],
            [
                4485,
                4666
            ],
            [
                4666,
                4786
            ],
            [
                4786,
                4884
            ],
            [
                4884,
                4919
            ],
            [
                4919,
                5076
            ],
            [
                5076,
                5111
            ],
            [
                5111,
                5150
            ],
            [
                5150,
                5196
            ],
            [
                5196,
                5289
            ],
            [
                5289,
                5334
            ],
            [
                5334,
                5361
            ],
            [
                5361,
                5396
            ],
            [
                5396,
                5415
            ],
            [
                5415,
                5561
            ],
            [
                5561,
                5651
            ],
            [
                5651,
                5766
            ],
            [
                5766,
                5789
            ],
            [
                5789,
                5858
            ],
            [
                5858,
                5986
            ],
            [
                5986,
                6137
            ],
            [
                6137,
                6203
            ],
            [
                6203,
                6237
            ],
            [
                6237,
                6402
            ],
            [
                6402,
                6599
            ],
            [
                6599,
                6614
            ],
            [
                6614,
                6633
            ],
            [
                6633,
                6663
            ],
            [
                6663,
                6718
            ],
            [
                6718,
                6761
            ],
            [
                6761,
                6781
            ],
            [
                6781,
                6817
            ],
            [
                6817,
                6901
            ],
            [
                6901,
                6963
            ],
            [
                6963,
                7064
            ],
            [
                7064,
                7111
            ],
            [
                7111,
                7168
            ],
            [
                7168,
                7211
            ],
            [
                7211,
                7298
            ],
            [
                7298,
                7437
            ],
            [
                7437,
                7635
            ],
            [
                7635,
                7668
            ],
            [
                7668,
                7757
            ],
            [
                7757,
                7925
            ],
            [
                7925,
                8134
            ],
            [
                8134,
                8292
            ],
            [
                8292,
                8436
            ],
            [
                8436,
                8618
            ],
            [
                8618,
                8713
            ],
            [
                8713,
                8877
            ],
            [
                8877,
                8951
            ],
            [
                8951,
                9110
            ],
            [
                9110,
                9276
            ],
            [
                9276,
                9461
            ],
            [
                9461,
                9726
            ],
            [
                9726,
                9879
            ],
            [
                9879,
                10012
            ],
            [
                10012,
                10200
            ],
            [
                10200,
                10438
            ],
            [
                10438,
                10536
            ],
            [
                10536,
                10651
            ],
            [
                10651,
                10749
            ],
            [
                10749,
                10891
            ],
            [
                10891,
                11153
            ],
            [
                11153,
                11356
            ],
            [
                11356,
                11430
            ],
            [
                11430,
                11531
            ],
            [
                11531,
                11682
            ],
            [
                11682,
                11706
            ],
            [
                11706,
                11737
            ],
            [
                11737,
                11790
            ],
            [
                11790,
                11832
            ],
            [
                11832,
                11862
            ],
            [
                11862,
                11977
            ],
            [
                11977,
                12064
            ],
            [
                12064,
                12129
            ],
            [
                12129,
                12149
            ],
            [
                12149,
                12196
            ],
            [
                12196,
                12215
            ],
            [
                12215,
                12287
            ],
            [
                12287,
                12315
            ],
            [
                12315,
                12360
            ],
            [
                12360,
                12388
            ],
            [
                12388,
                12410
            ],
            [
                12410,
                12442
            ],
            [
                12442,
                12598
            ],
            [
                12598,
                12608
            ],
            [
                12608,
                12619
            ],
            [
                12619,
                12638
            ],
            [
                12638,
                12656
            ],
            [
                12656,
                12684
            ],
            [
                12684,
                12824
            ],
            [
                12824,
                13070
            ],
            [
                13070,
                13122
            ],
            [
                13122,
                13161
            ],
            [
                13161,
                13283
            ],
            [
                13283,
                13332
            ],
            [
                13332,
                13430
            ],
            [
                13430,
                13478
            ],
            [
                13478,
                13582
            ],
            [
                13582,
                13596
            ],
            [
                13596,
                13619
            ],
            [
                13619,
                13633
            ],
            [
                13633,
                13641
            ],
            [
                13641,
                13658
            ],
            [
                13658,
                13682
            ],
            [
                13682,
                13703
            ],
            [
                13703,
                13728
            ],
            [
                13728,
                13838
            ],
            [
                13838,
                13864
            ],
            [
                13864,
                13883
            ],
            [
                13883,
                13890
            ],
            [
                13890,
                13915
            ],
            [
                13915,
                13930
            ],
            [
                13930,
                13973
            ],
            [
                13973,
                14058
            ],
            [
                14058,
                14144
            ],
            [
                14144,
                14166
            ],
            [
                14166,
                14203
            ],
            [
                14203,
                14215
            ],
            [
                14215,
                14227
            ],
            [
                14227,
                14234
            ],
            [
                14234,
                14268
            ],
            [
                14268,
                14305
            ],
            [
                14305,
                14400
            ],
            [
                14400,
                14420
            ],
            [
                14420,
                14445
            ],
            [
                14445,
                14488
            ],
            [
                14488,
                14515
            ],
            [
                14515,
                14610
            ],
            [
                14610,
                14639
            ],
            [
                14639,
                14688
            ],
            [
                14688,
                14778
            ],
            [
                14778,
                14808
            ],
            [
                14808,
                14825
            ],
            [
                14825,
                14857
            ],
            [
                14857,
                14887
            ],
            [
                14887,
                14904
            ],
            [
                14904,
                14935
            ],
            [
                14935,
                14977
            ],
            [
                14977,
                15029
            ],
            [
                15029,
                15090
            ],
            [
                15090,
                15126
            ],
            [
                15126,
                15154
            ],
            [
                15154,
                15164
            ],
            [
                15164,
                15179
            ],
            [
                15179,
                15187
            ],
            [
                15187,
                15203
            ],
            [
                15203,
                15231
            ],
            [
                15231,
                15257
            ],
            [
                15257,
                15393
            ],
            [
                15393,
                15499
            ],
            [
                15499,
                15539
            ],
            [
                15539,
                15646
            ],
            [
                15646,
                15667
            ],
            [
                15667,
                15682
            ],
            [
                15682,
                15708
            ],
            [
                15708,
                15749
            ],
            [
                15749,
                15865
            ],
            [
                15865,
                15956
            ],
            [
                15956,
                16027
            ],
            [
                16027,
                16076
            ],
            [
                16076,
                16170
            ],
            [
                16170,
                16320
            ],
            [
                16320,
                16400
            ],
            [
                16400,
                16490
            ],
            [
                16490,
                16549
            ],
            [
                16549,
                16640
            ],
            [
                16640,
                16681
            ],
            [
                16681,
                16797
            ],
            [
                16797,
                16899
            ]
        ],
        "overlap_chars": [
            [
                0,
                44
            ],
            [
                50,
                80
            ],
            [
                82,
                114
            ],
            [
                123,
                152
            ],
            [
                152,
                154
            ],
            [
                155,
                179
            ],
            [
                180,
                181
            ],
            [
                184,
                189
            ],
            [
                189,
                219
            ],
            [
                220,
                233
            ],
            [
                234,
                311
            ],
            [
                311,
                314
            ],
            [
                315,
                328
            ],
            [
                329,
                361
            ],
            [
                361,
                363
            ],
            [
                363,
                403
            ],
            [
                404,
                413
            ],
            [
                413,
                469
            ],
            [
                469,
                493
            ],
            [
                493,
                512
            ],
            [
                512,
                517
            ],
            [
                517,
                550
            ],
            [
                553,
                554
            ],
            [
                557,
                587
            ],
            [
                589,
                596
            ],
            [
                597,
                637
            ],
            [
                637,
                698
            ],
            [
                699,
                743
            ],
            [
                743,
                752
            ],
            [
                758,
                818
            ],
            [
                819,
                822
            ],
            [
                823,
                827
            ],
            [
                828,
                846
            ],
            [
                846,
                864
            ],
            [
                865,
                892
            ],
            [
                892,
                960
            ],
            [
                961,
                964
            ],
            [
                977,
                979
            ],
            [
                979,
                1014
            ],
            [
                1020,
                1045
            ],
            [
                1045,
                1108
            ],
            [
                1109,
                1129
            ],
            [
                1130,
                1140
            ],
            [
                1142,
                1161
            ],
            [
                1162,
                1185
            ],
            [
                1190,
                1192
            ],
            [
                1192,
                1194
            ],
            [
                1194,
                1278
            ],
            [
                1279,
                1294
            ],
            [
                1295,
                1336
            ],
            [
                1337,
                1354
            ],
            [
                1360,
                1376
            ],
            [
                1377,
                1395
            ],
            [
                1395,
                1431
            ],
            [
                1431,
                1462
            ],
            [
                1462,
                1498
            ],
            [
                1498,
                1530
            ],
            [
                1530,
                1551
            ],
            [
                1551,
                1553
            ],
            [
                1553,
                1555
            ],
            [
                1562,
                1567
            ],
            [
                1568,
                1589
            ],
            [
                1589,
                1591
            ],
            [
                1591,
                1598
            ],
            [
                1599,
                1641
            ],
            [
                1641,
                1690
            ],
            [
                1690,
                1722
            ],
            [
                1722,
                1730
            ],
            [
                1730,
                1789
            ],
            [
                1789,
                1791
            ],
            [
                1791,
                1792
            ],
            [
                1792,
                1854
            ],
            [
                1854,
                1940
            ],
            [
                1941,
                1945
            ],
            [
                1952,
                1955
            ],
            [
                1961,
                1964
            ],
            [
                1971,
                1974
            ],
            [
                1975,
                1981
            ],
            [
                1992,
                1994
            ],
            [
                1995,
                2093
            ],
            [
                2095,
                2113
            ],
            [
                2114,
                2116
            ],
            [
                2117,
                2132
            ],
            [
                2135,
                2180
            ],
            [
                2186,
                2203
            ],
            [
                2203,
                2294
            ],
            [
                2301,
                2358
            ],
            [
                2369,
                2378
            ],
            [
                2378,
                2404
            ],
            [
                2409,
                2442
            ],
            [
                2443,
                2453
            ],
            [
                2454,
                2468
            ],
            [
                2468,
                2469
            ],
            [
                2470,
                2525
            ],
            [
                2525,
                2541
            ],
            [
                2541,
                2549
            ],
            [
                2549,
                2613
            ],
            [
                2613,
                2724
            ],
            [
                2725,
                2828
            ],
            [
                2829,
                2833
            ],
            [
                2841,
                2869
            ],
            [
                2869,
                2871
            ],
            [
                2871,
                2872
            ],
            [
                2873,
                2887
            ],
            [
                2891,
                2899
            ],
            [
                2900,
                2904
            ],
            [
                2905,
                2924
            ],
            [
                2926,
                2929
            ],
            [
                2930,
                2932
            ],
            [
                2933,
                2937
            ],
            [
                2944,
                2958
            ],
            [
                2959,
                2965
            ],
            [
                2969,
                2979
            ],
            [
                2980,
                3049
            ],
            [
                3049,
                3068
            ],
            [
                3069,
                3073
            ],
            [
                3074,
                3102
            ],
            [
                3108,
                3142
            ],
            [
                3143,
                3155
            ],
            [
                3155,
                3157
            ],
            [
                3162,
                3168
            ],
            [
                3173,
                3208
            ],
            [
                3214,
                3225
            ],
            [
                3235,
                3312
            ],
            [
                3312,
                3505
            ],
            [
                3506,
                3526
            ],
            [
                3526,
                3568
            ],
            [
                3569,
                3572
            ],
            [
                3573,
                3583
            ],
            [
                3595,
                3616
            ],
            [
                3617,
                3621
            ],
            [
                3627,
                3638
            ],
            [
                3638,
                3639
            ],
            [
                3640,
                3677
            ],
            [
                3677,
                3693
            ],
            [
                3693,
                3817
            ],
            [
                3818,
                3833
            ],
            [
                3833,
                3853
            ],
            [
                3853,
                3895
            ],
            [
                3895,
                3934
            ],
            [
                3934,
                3937
            ],
            [
                3937,
                3939
            ],
            [
                3952,
                3964
            ],
            [
                3968,
                3969
            ],
            [
                3975,
                3981
            ],
            [
                3981,
                3997
            ],
            [
                3998,
                4002
            ],
            [
                4003,
                4053
            ],
            [
                4054,
                4057
            ],
            [
                4058,
                4062
            ],
            [
                4062,
                4067
            ],
            [
                4068,
                4076
            ],
            [
                4077,
                4083
            ],
            [
                4083,
                4133
            ],
            [
                4134,
                4141
            ],
            [
                4145,
                4153
            ],
            [
                4155,
                4158
            ],
            [
                4159,
                4199
            ],
            [
                4206,
                4211
            ],
            [
                4211,
                4213
            ],
            [
                4213,
                4294
            ],
            [
                4294,
                4350
            ],
            [
                4350,
                4379
            ],
            [
                4380,
                4384
            ],
            [
                4385,
                4388
            ],
            [
                4389,
                4410
            ],
            [
                4411,
                4417
            ],
            [
                4418,
                4445
            ],
            [
                4452,
                4485
            ],
            [
                4485,
                4575
            ],
            [
                4576,
                4584
            ],
            [
                4584,
                4631
            ],
            [
                4632,
                4664
            ],
            [
                4664,
                4666
            ],
            [
                4666,
                4709
            ],
            [
                4710,
                4711
            ],
            [
                4711,
                4731
            ],
            [
                4732,
                4786
            ],
            [
                4786,
                4841
            ],
            [
                4842,
                4861
            ],
            [
                4862,
                4884
            ],
            [
                4884,
                4919
            ],
            [
                4919,
                4957
            ],
            [
                4958,
                4969
            ],
            [
                4970,
                5076
            ],
            [
                5076,
                5111
            ],
            [
                5111,
                5150
            ],
            [
                5150,
                5194
            ],
            [
                5194,
                5196
            ],
            [
                5196,
                5289
            ],
            [
                5289,
                5293
            ],
            [
                5294,
                5297
            ],
            [
                5298,
                5311
            ],
            [
                5312,
                5322
            ],
            [
                5323,
                5332
            ],
            [
                5332,
                5334
            ],
            [
                5334,
                5359
            ],
            [
                5361,
                5396
            ],
            [
                5396,
                5414
            ],
            [
                5415,
                5433
            ],
            [
                5434,
                5462
            ],
            [
                5463,
                5466
            ],
            [
                5467,
                5474
            ],
            [
                5474,
                5551
            ],
            [
                5561,
                5582
            ],
            [
                5591,
                5609
            ],
            [
                5615,
                5616
            ],
            [
                5620,
                5621
            ],
            [
                5622,
                5651
            ],
            [
                5653,
                5727
            ],
            [
                5728,
                5766
            ],
            [
                5766,
                5789
            ],
            [
                5792,
                5841
            ],
            [
                5846,
                5858
            ],
            [
                5860,
                5861
            ],
            [
                5861,
                5869
            ],
            [
                5874,
                5892
            ],
            [
                5896,
                5971
            ],
            [
                5974,
                5983
            ],
            [
                5986,
                5991
            ],
            [
                5992,
                6044
            ],
            [
                6045,
                6048
            ],
            [
                6049,
                6056
            ],
            [
                6062,
                6064
            ],
            [
                6064,
                6135
            ],
            [
                6135,
                6137
            ],
            [
                6137,
                6156
            ],
            [
                6157,
                6161
            ],
            [
                6162,
                6168
            ],
            [
                6170,
                6203
            ],
            [
                6203,
                6206
            ],
            [
                6207,
                6235
            ],
            [
                6235,
                6237
            ],
            [
                6275,
                6302
            ],
            [
                6302,
                6402
            ],
            [
                6402,
                6473
            ],
            [
                6478,
                6498
            ],
            [
                6499,
                6597
            ],
            [
                6597,
                6599
            ],
            [
                6599,
                6614
            ],
            [
                6614,
                6633
            ],
            [
                6633,
                6648
            ],
            [
                6649,
                6656
            ],
            [
                6657,
                6663
            ],
            [
                6663,
                6718
            ],
            [
                6718,
                6754
            ],
            [
                6759,
                6761
            ],
            [
                6761,
                6769
            ],
            [
                6770,
                6781
            ],
            [
                6781,
                6817
            ],
            [
                6817,
                6850
            ],
            [
                6850,
                6901
            ],
            [
                6901,
                6937
            ],
            [
                6949,
                6953
            ],
            [
                6954,
                6963
            ],
            [
                6963,
                7064
            ],
            [
                7064,
                7111
            ],
            [
                7111,
                7153
            ],
            [
                7153,
                7158
            ],
            [
                7159,
                7168
            ],
            [
                7168,
                7211
            ],
            [
                7211,
                7298
            ],
            [
                7298,
                7437
            ],
            [
                7437,
                7635
            ],
            [
                7635,
                7666
            ],
            [
                7666,
                7668
            ],
            [
                7668,
                7722
            ],
            [
                7723,
                7733
            ],
            [
                7734,
                7755
            ],
            [
                7755,
                7757
            ],
            [
                7757,
                7814
            ],
            [
                7824,
                7831
            ],
            [
                7831,
                7884
            ],
            [
                7884,
                7888
            ],
            [
                7893,
                7925
            ],
            [
                7925,
                8003
            ],
            [
                8003,
                8078
            ],
            [
                8089,
                8132
            ],
            [
                8132,
                8134
            ],
            [
                8134,
                8168
            ],
            [
                8169,
                8180
            ],
            [
                8181,
                8267
            ],
            [
                8268,
                8292
            ],
            [
                8292,
                8301
            ],
            [
                8310,
                8385
            ],
            [
                8392,
                8404
            ],
            [
                8405,
                8436
            ],
            [
                8436,
                8443
            ],
            [
                8452,
                8564
            ],
            [
                8565,
                8572
            ],
            [
                8577,
                8580
            ],
            [
                8581,
                8618
            ],
            [
                8618,
                8666
            ],
            [
                8676,
                8685
            ],
            [
                8689,
                8692
            ],
            [
                8693,
                8697
            ],
            [
                8698,
                8711
            ],
            [
                8711,
                8713
            ],
            [
                8713,
                8877
            ],
            [
                8877,
                8917
            ],
            [
                8918,
                8949
            ],
            [
                8949,
                8951
            ],
            [
                8951,
                8961
            ],
            [
                8962,
                8964
            ],
            [
                8970,
                9110
            ],
            [
                9110,
                9128
            ],
            [
                9131,
                9146
            ],
            [
                9155,
                9179
            ],
            [
                9180,
                9202
            ],
            [
                9203,
                9245
            ],
            [
                9248,
                9260
            ],
            [
                9274,
                9276
            ],
            [
                9276,
                9461
            ],
            [
                9461,
                9519
            ],
            [
                9519,
                9587
            ],
            [
                9588,
                9619
            ],
            [
                9619,
                9645
            ],
            [
                9652,
                9725
            ],
            [
                9726,
                9731
            ],
            [
                9732,
                9824
            ],
            [
                9825,
                9854
            ],
            [
                9854,
                9855
            ],
            [
                9856,
                9861
            ],
            [
                9871,
                9877
            ],
            [
                9877,
                9879
            ],
            [
                9879,
                9994
            ],
            [
                9995,
                10012
            ],
            [
                10012,
                10105
            ],
            [
                10109,
                10112
            ],
            [
                10122,
                10146
            ],
            [
                10147,
                10151
            ],
            [
                10151,
                10152
            ],
            [
                10153,
                10160
            ],
            [
                10160,
                10198
            ],
            [
                10198,
                10200
            ],
            [
                10200,
                10250
            ],
            [
                10251,
                10263
            ],
            [
                10263,
                10372
            ],
            [
                10373,
                10392
            ],
            [
                10399,
                10438
            ],
            [
                10438,
                10443
            ],
            [
                10443,
                10521
            ],
            [
                10522,
                10535
            ],
            [
                10536,
                10634
            ],
            [
                10638,
                10650
            ],
            [
                10651,
                10675
            ],
            [
                10676,
                10711
            ],
            [
                10712,
                10724
            ],
            [
                10725,
                10749
            ],
            [
                10749,
                10791
            ],
            [
                10800,
                10818
            ],
            [
                10821,
                10853
            ],
            [
                10864,
                10891
            ],
            [
                10891,
                10900
            ],
            [
                10901,
                10902
            ],
            [
                10908,
                10917
            ],
            [
                10926,
                11000
            ],
            [
                11001,
                11041
            ],
            [
                11042,
                11083
            ],
            [
                11084,
                11153
            ],
            [
                11153,
                11356
            ],
            [
                11356,
                11368
            ],
            [
                11376,
                11384
            ],
            [
                11385,
                11388
            ],
            [
                11389,
                11393
            ],
            [
                11393,
                11395
            ],
            [
                11400,
                11415
            ],
            [
                11428,
                11430
            ],
            [
                11430,
                11529
            ],
            [
                11529,
                11531
            ],
            [
                11531,
                11563
            ],
            [
                11573,
                11672
            ],
            [
                11673,
                11682
            ],
            [
                11682,
                11706
            ],
            [
                11706,
                11737
            ],
            [
                11737,
                11790
            ],
            [
                11790,
                11832
            ],
            [
                11832,
                11860
            ],
            [
                11862,
                11923
            ],
            [
                11924,
                11927
            ],
            [
                11928,
                11935
            ],
            [
                11938,
                11945
            ],
            [
                11948,
                11977
            ],
            [
                11977,
                12004
            ],
            [
                12014,
                12062
            ],
            [
                12062,
                12063
            ],
            [
                12064,
                12129
            ],
            [
                12129,
                12147
            ],
            [
                12147,
                12149
            ],
            [
                12149,
                12196
            ],
            [
                12196,
                12215
            ],
            [
                12215,
                12221
            ],
            [
                12230,
                12232
            ],
            [
                12233,
                12271
            ],
            [
                12272,
                12279
            ],
            [
                12280,
                12282
            ],
            [
                12283,
                12285
            ],
            [
                12287,
                12315
            ],
            [
                12315,
                12329
            ],
            [
                12343,
                12358
            ],
            [
                12358,
                12359
            ],
            [
                12360,
                12388
            ],
            [
                12388,
                12410
            ],
            [
                12410,
                12439
            ],
            [
                12439,
                12442
            ],
            [
                12442,
                12598
            ],
            [
                12598,
                12608
            ],
            [
                12608,
                12618
            ],
            [
                12619,
                12620
            ],
            [
                12620,
                12635
            ],
            [
                12638,
                12656
            ],
            [
                12656,
                12684
            ],
            [
                12684,
                12769
            ],
            [
                12779,
                12801
            ],
            [
                12802,
                12805
            ],
            [
                12806,
                12822
            ],
            [
                12822,
                12824
            ],
            [
                12824,
                12879
            ],
            [
                12882,
                12916
            ],
            [
                12929,
                13070
            ],
            [
                13070,
                13121
            ],
            [
                13122,
                13159
            ],
            [
                13159,
                13161
            ],
            [
                13161,
                13191
            ],
            [
                13192,
                13228
            ],
            [
                13228,
                13229
            ],
            [
                13234,
                13246
            ],
            [
                13247,
                13254
            ],
            [
                13259,
                13283
            ],
            [
                13283,
                13295
            ],
            [
                13301,
                13332
            ],
            [
                13332,
                13350
            ],
            [
                13352,
                13374
            ],
            [
                13375,
                13410
            ],
            [
                13411,
                13428
            ],
            [
                13428,
                13430
            ],
            [
                13430,
                13441
            ],
            [
                13442,
                13478
            ],
            [
                13478,
                13580
            ],
            [
                13580,
                13582
            ],
            [
                13582,
                13596
            ],
            [
                13596,
                13619
            ],
            [
                13619,
                13633
            ],
            [
                13633,
                13641
            ],
            [
                13641,
                13658
            ],
            [
                13658,
                13661
            ],
            [
                13662,
                13667
            ],
            [
                13668,
                13680
            ],
            [
                13680,
                13682
            ],
            [
                13682,
                13703
            ],
            [
                13703,
                13728
            ],
            [
                13728,
                13773
            ],
            [
                13785,
                13812
            ],
            [
                13813,
                13838
            ],
            [
                13838,
                13864
            ],
            [
                13864,
                13872
            ],
            [
                13881,
                13882
            ],
            [
                13883,
                13888
            ],
            [
                13890,
                13915
            ],
            [
                13915,
                13930
            ],
            [
                13930,
                13973
            ],
            [
                13973,
                13991
            ],
            [
                13992,
                14047
            ],
            [
                14056,
                14058
            ],
            [
                14058,
                14061
            ],
            [
                14062,
                14088
            ],
            [
                14088,
                14093
            ],
            [
                14099,
                14144
            ],
            [
                14144,
                14166
            ],
            [
                14166,
                14201
            ],
            [
                14201,
                14202
            ],
            [
                14203,
                14215
            ],
            [
                14215,
                14227
            ],
            [
                14227,
                14234
            ],
            [
                14234,
                14268
            ],
            [
                14268,
                14305
            ],
            [
                14305,
                14400
            ],
            [
                14400,
                14420
            ],
            [
                14420,
                14445
            ],
            [
                14445,
                14488
            ],
            [
                14488,
                14515
            ],
            [
                14515,
                14573
            ],
            [
                14574,
                14610
            ],
            [
                14610,
                14639
            ],
            [
                14639,
                14688
            ],
            [
                14688,
                14741
            ],
            [
                14742,
                14755
            ],
            [
                14756,
                14770
            ],
            [
                14776,
                14778
            ],
            [
                14778,
                14808
            ],
            [
                14808,
                14825
            ],
            [
                14825,
                14857
            ],
            [
                14857,
                14887
            ],
            [
                14887,
                14904
            ],
            [
                14904,
                14935
            ],
            [
                14935,
                14951
            ],
            [
                14954,
                14977
            ],
            [
                14986,
                15021
            ],
            [
                15027,
                15029
            ],
            [
                15029,
                15060
            ],
            [
                15061,
                15090
            ],
            [
                15090,
                15126
            ],
            [
                15126,
                15144
            ],
            [
                15145,
                15154
            ],
            [
                15155,
                15164
            ],
            [
                15164,
                15179
            ],
            [
                15179,
                15187
            ],
            [
                15187,
                15188
            ],
            [
                15188,
                15200
            ],
            [
                15203,
                15228
            ],
            [
                15228,
                15231
            ],
            [
                15231,
                15232
            ],
            [
                15232,
                15255
            ],
            [
                15255,
                15257
            ],
            [
                15258,
                15359
            ],
            [
                15360,
                15363
            ],
            [
                15363,
                15393
            ],
            [
                15393,
                15450
            ],
            [
                15450,
                15499
            ],
            [
                15504,
                15507
            ],
            [
                15508,
                15539
            ],
            [
                15539,
                15646
            ],
            [
                15646,
                15667
            ],
            [
                15667,
                15682
            ],
            [
                15682,
                15708
            ],
            [
                15708,
                15749
            ],
            [
                15749,
                15760
            ],
            [
                15760,
                15865
            ],
            [
                15865,
                15956
            ],
            [
                15956,
                15994
            ],
            [
                15994,
                15995
            ],
            [
                16001,
                16010
            ],
            [
                16011,
                16025
            ],
            [
                16025,
                16027
            ],
            [
                16027,
                16076
            ],
            [
                16076,
                16103
            ],
            [
                16104,
                16124
            ],
            [
                16130,
                16144
            ],
            [
                16144,
                16145
            ],
            [
                16146,
                16151
            ],
            [
                16160,
                16168
            ],
            [
                16168,
                16170
            ],
            [
                16180,
                16320
            ],
            [
                16320,
                16400
            ],
            [
                16400,
                16430
            ],
            [
                16436,
                16446
            ],
            [
                16447,
                16449
            ],
            [
                16459,
                16490
            ],
            [
                16490,
                16549
            ],
            [
                16549,
                16568
            ],
            [
                16569,
                16596
            ],
            [
                16596,
                16640
            ],
            [
                16640,
                16681
            ],
            [
                16681,
                16684
            ],
            [
                16685,
                16748
            ],
            [
                16753,
                16797
            ],
            [
                16797,
                16863
            ],
            [
                16864,
                16873
            ],
            [
                16874,
                16884
            ],
            [
                16894,
                16898
            ],
            [
                16898,
                16899
            ]
        ],
        "row_chars": [
            [
                0,
                152
            ],
            [
                152,
                180
            ],
            [
                180,
                180
            ],
            [
                180,
                180
            ],
            [
                180,
                189
            ],
            [
                189,
                311
            ],
            [
                311,
                363
            ],
            [
                363,
                469
            ],
            [
                469,
                469
            ],
            [
                469,
                493
            ],
            [
                493,
                512
            ],
            [
                512,
                517
            ],
            [
                517,
                589
            ],
            [
                589,
                589
            ],
            [
                589,
                589
            ],
            [
                589,
                589
            ],
            [
                589,
                589
            ],
            [
                589,
                637
            ],
            [
                637,
                743
            ],
            [
                743,
                892
            ],
            [
                892,
                979
            ],
            [
                979,
                1045
            ],
            [
                1045,
                1142
            ],
            [
                1142,
                1194
            ],
            [
                1194,
                1395
            ],
            [
                1395,
                1431
            ],
            [
                1431,
                1462
            ],
            [
                1462,
                1498
            ],
            [
                1498,
                1553
            ],
            [
                1553,
                1591
            ],
            [
                1591,
                1641
            ],
            [
                1641,
                1690
            ],
            [
                1690,
                1722
            ],
            [
                1722,
                1730
            ],
            [
                1730,
                1791
            ],
            [
                1791,
                1854
            ],
            [
                1854,
                2203
            ],
            [
                2203,
                2378
            ],
            [
                2378,
                2378
            ],
            [
                2378,
                2470
            ],
            [
                2470,
                2525
            ],
            [
                2525,
                2549
            ],
            [
                2549,
                2613
            ],
            [
                2613,
                2871
            ],
            [
                2871,
                3049
            ],
            [
                3049,
                3157
            ],
            [
                3157,
                3312
            ],
            [
                3312,
                3526
            ],
            [
                3526,
                3677
            ],
            [
                3677,
                3818
            ],
            [
                3818,
                3818
            ],
            [
                3818,
                3895
            ],
            [
                3895,
                3937
            ],
            [
                3937,
                3981
            ],
            [
                3981,
                4213
            ],
            [
                4213,
                4350
            ],
            [
                4350,
                4350
            ],
            [
                4350,
                4445
            ],
            [
                4445,
                4485
            ],
            [
                4485,
                4666
            ],
            [
                4666,
                4786
            ],
            [
                4786,
                4884
            ],
            [
                4884,
                4919
            ],
            [
                4919,
                5076
            ],
            [
                5076,
                5111
            ],
            [
                5111,
                5150
            ],
            [
                5150,
                5196
            ],
            [
                5196,
                5289
            ],
            [
                5289,
                5334
            ],
            [
                5334,
                5361
            ],
            [
                5361,
                5396
            ],
            [
                5396,
                5415
            ],
            [
                5415,
                5415
            ],
            [
                5415,
                5415
            ],
            [
                5415,
                5415
            ],
            [
                5415,
                5415
            ],
            [
                5415,
                5415
            ],
            [
                5415,
                5415
            ],
            [
                5415,
                5415
            ],
            [
                5415,
                5415
            ],
            [
                5415,
                5561
            ],
            [
                5561,
                5651
            ],
            [
                5651,
                5766
            ],
            [
                5766,
                5789
            ],
            [
                5789,
                5858
            ],
            [
                5858,
                5986
            ],
            [
                5986,
                5986
            ],
            [
                5986,
                6137
            ],
            [
                6137,
                6203
            ],
            [
                6203,
                6237
            ],
            [
                6237,
                6402
            ],
            [
                6402,
                6599
            ],
            [
                6599,
                6614
            ],
            [
                6614,
                6633
            ],
            [
                6633,
                6663
            ],
            [
                6663,
                6718
            ],
            [
                6718,
                6718
            ],
            [
                6718,
                6761
            ],
            [
                6761,
                6781
            ],
            [
                6781,
                6817
            ],
            [
                6817,
                6901
            ],
            [
                6901,
                6963
            ],
            [
                6963,
                7064
            ],
            [
                7064,
                7111
            ],
            [
                7111,
                7168
            ],
            [
                7168,
                7211
            ],
            [
                7211,
                7298
            ],
            [
                7298,
                7437
            ],
            [
                7437,
                7635
            ],
            [
                7635,
                7668
            ],
            [
                7668,
                7757
            ],
            [
                7757,
                7925
            ],
            [
                7925,
                8134
            ],
            [
                8134,
                8292
            ],
            [
                8292,
                8436
            ],
            [
                8436,
                8618
            ],
            [
                8618,
                8713
            ],
            [
                8713,
                8877
            ],
            [
                8877,
                8951
            ],
            [
                8951,
                9110
            ],
            [
                9110,
                9276
            ],
            [
                9276,
                9461
            ],
            [
                9461,
                9726
            ],
            [
                9726,
                9726
            ],
            [
                9726,
                9879
            ],
            [
                9879,
                10012
            ],
            [
                10012,
                10200
            ],
            [
                10200,
                10438
            ],
            [
                10438,
                10536
            ],
            [
                10536,
                10536
            ],
            [
                10536,
                10651
            ],
            [
                10651,
                10651
            ],
            [
                10651,
                10749
            ],
            [
                10749,
                10891
            ],
            [
                10891,
                11153
            ],
            [
                11153,
                11356
            ],
            [
                11356,
                11430
            ],
            [
                11430,
                11531
            ],
            [
                11531,
                11682
            ],
            [
                11682,
                11706
            ],
            [
                11706,
                11737
            ],
            [
                11737,
                11790
            ],
            [
                11790,
                11832
            ],
            [
                11832,
                11862
            ],
            [
                11862,
                11862
            ],
            [
                11862,
                11862
            ],
            [
                11862,
                11862
            ],
            [
                11862,
                11977
            ],
            [
                11977,
                12064
            ],
            [
                12064,
                12129
            ],
            [
                12129,
                12149
            ],
            [
                12149,
                12196
            ],
            [
                12196,
                12215
            ],
            [
                12215,
                12287
            ],
            [
                12287,
                12315
            ],
            [
                12315,
                12360
            ],
            [
                12360,
                12360
            ],
            [
                12360,
                12388
            ],
            [
                12388,
                12410
            ],
            [
                12410,
                12442
            ],
            [
                12442,
                12598
            ],
            [
                12598,
                12608
            ],
            [
                12608,
                12619
            ],
            [
                12619,
                12619
            ],
            [
                12619,
                12619
            ],
            [
                12619,
                12638
            ],
            [
                12638,
                12638
            ],
            [
                12638,
                12638
            ],
            [
                12638,
                12656
            ],
            [
                12656,
                12684
            ],
            [
                12684,
                12824
            ],
            [
                12824,
                13070
            ],
            [
                13070,
                13122
            ],
            [
                13122,
                13161
            ],
            [
                13161,
                13283
            ],
            [
                13283,
                13332
            ],
            [
                13332,
                13430
            ],
            [
                13430,
                13478
            ],
            [
                13478,
                13582
            ],
            [
                13582,
                13596
            ],
            [
                13596,
                13619
            ],
            [
                13619,
                13633
            ],
            [
                13633,
                13641
            ],
            [
                13641,
                13658
            ],
            [
                13658,
                13682
            ],
            [
                13682,
                13703
            ],
            [
                13703,
                13728
            ],
            [
                13728,
                13838
            ],
            [
                13838,
                13864
            ],
            [
                13864,
                13883
            ],
            [
                13883,
                13883
            ],
            [
                13883,
                13890
            ],
            [
                13890,
                13890
            ],
            [
                13890,
                13915
            ],
            [
                13915,
                13930
            ],
            [
                13930,
                13973
            ],
            [
                13973,
                14058
            ],
            [
                14058,
                14144
            ],
            [
                14144,
                14166
            ],
            [
                14166,
                14203
            ],
            [
                14203,
                14203
            ],
            [
                14203,
                14215
            ],
            [
                14215,
                14227
            ],
            [
                14227,
                14234
            ],
            [
                14234,
                14268
            ],
            [
                14268,
                14305
            ],
            [
                14305,
                14400
            ],
            [
                14400,
                14420
            ],
            [
                14420,
                14445
            ],
            [
                14445,
                14488
            ],
            [
                14488,
                14515
            ],
            [
                14515,
                14610
            ],
            [
                14610,
                14639
            ],
            [
                14639,
                14688
            ],
            [
                14688,
                14778
            ],
            [
                14778,
                14808
            ],
            [
                14808,
                14825
            ],
            [
                14825,
                14857
            ],
            [
                14857,
                14887
            ],
            [
                14887,
                14904
            ],
            [
                14904,
                14935
            ],
            [
                14935,
                14977
            ],
            [
                14977,
                15029
            ],
            [
                15029,
                15090
            ],
            [
                15090,
                15126
            ],
            [
                15126,
                15154
            ],
            [
                15154,
                15154
            ],
            [
                15154,
                15164
            ],
            [
                15164,
                15179
            ],
            [
                15179,
                15187
            ],
            [
                15187,
                15203
            ],
            [
                15203,
                15203
            ],
            [
                15203,
                15203
            ],
            [
                15203,
                15203
            ],
            [
                15203,
                15203
            ],
            [
                15203,
                15231
            ],
            [
                15231,
                15257
            ],
            [
                15257,
                15393
            ],
            [
                15393,
                15393
            ],
            [
                15393,
                15393
            ],
            [
                15393,
                15393
            ],
            [
                15393,
                15499
            ],
            [
                15499,
                15539
            ],
            [
                15539,
                15646
            ],
            [
                15646,
                15667
            ],
            [
                15667,
                15682
            ],
            [
                15682,
                15708
            ],
            [
                15708,
                15749
            ],
            [
                15749,
                15865
            ],
            [
                15865,
                15956
            ],
            [
                15956,
                16027
            ],
            [
                16027,
                16076
            ],
            [
                16076,
                16170
            ],
            [
                16170,
                16320
            ],
            [
                16320,
                16400
            ],
            [
                16400,
                16490
            ],
            [
                16490,
                16549
            ],
            [
                16549,
                16640
            ],
            [
                16640,
                16681
            ],
            [
                16681,
                16797
            ],
            [
                16797,
                16899
            ]
        ]
    }
}