{
    "original": {
        "text": "England has been in a dreadful state for some weeks. Lord Coodle would go out, Sir Thomas Doodle wouldn't come in, and there being nobody in Great Britain (to speak of) except Coodle and Doodle, there has been no government. It is a mercy that the hostile meeting between those two great men, which at one time seemed inevitable, did not come off, because if both pistols had taken effect, and Coodle and Doodle had killed each other, it is to be presumed that England must have waited to be governed until young Coodle and young Doodle, now in frocks and long stockings, were grown up. This stupendous national calamity, however, was averted by Lord Coodle's making the timely discovery that if in the heat of debate he had said that he scorned and despised the whole ignoble career of Sir Thomas Doodle, he had merely meant to say that party differences should never induce him to withhold from it the tribute of his warmest admiration; while it as opportunely turned out, on the other hand, that Sir Thomas Doodle had in his own bosom expressly booked Lord Coodle to go down to posterity as the mirror of virtue and honour. Still England has been some weeks in the dismal strait of having no pilot (as was well observed by Sir Leicester Dedlock) to weather the storm; and the marvellous part of the matter is that England has not appeared to care very much about it, but has gone on eating and drinking and marrying and giving in marriage as the old world did in the days before the flood. But Coodle knew the danger, and Doodle knew the danger, and all their followers and hangers-on had the clearest possible perception of the danger. At last Sir Thomas Doodle has not only condescended to come in, but has done it handsomely, bringing in with him all his nephews, all his male cousins, and all his brothers-in-law. So there is hope for the old ship yet.\nDoodle has found that he must throw himself upon the country, chiefly in the form of sovereigns and beer. In this metamorphosed state he is available in a good many places simultaneously and can throw himself upon a considerable portion of the country at one time. Britannia being much occupied in pocketing Doodle in the form of sovereigns, and swallowing Doodle in the form of beer, and in swearing herself black in the face that she does neither--plainly to the advancement of her glory and morality--the London season comes to a sudden end, through all the Doodleites and Coodleites dispersing to assist Britannia in those religious exercises.\nHence Mrs. Rouncewell, housekeeper at Chesney Wold, foresees, though no instructions have yet come down, that the family may shortly be expected, together with a pretty large accession of cousins and others who can in any way assist the great Constitutional work. And hence the stately old dame, taking Time by the forelock, leads him up and down the staircases, and along the galleries and passages, and through the rooms, to witness before he grows any older that everything is ready, that floors are rubbed bright, carpets spread, curtains shaken out, beds puffed and patted, still-room and kitchen cleared for action--all things prepared as beseems the Dedlock dignity.\nThis present summer evening, as the sun goes down, the preparations are complete. Dreary and solemn the old house looks, with so many appliances of habitation and with no inhabitants except the pictured forms upon the walls. So did these come and go, a Dedlock in possession might have ruminated passing along; so did they see this gallery hushed and quiet, as I see it now; so think, as I think, of the gap that they would make in this domain when they were gone; so find it, as I find it, difficult to believe that it could be without them; so pass from my world, as I pass from theirs, now closing the reverberating door; so leave no blank to miss them, and so die.\nThrough some of the fiery windows beautiful from without, and set, at this sunset hour, not in dull-grey stone but in a glorious house of gold, the light excluded at other windows pours in rich, lavish, overflowing like the summer plenty in the land. Then do the frozen Dedlocks thaw. Strange movements come upon their features as the shadows of leaves play there. A dense justice in a corner is beguiled into a wink. A staring baronet, with a truncheon, gets a dimple in his chin. Down into the bosom of a stony shepherdess there steals a fleck of light and warmth that would have done it good a hundred years ago. One ancestress of Volumnia, in high-heeled shoes, very like her--casting the shadow of that virgin event before her full two centuries--shoots out into a halo and becomes a saint. A maid of honour of the court of Charles the Second, with large round eyes (and other charms to correspond), seems to bathe in glowing water, and it ripples as it glows.\nBut the fire of the sun is dying. Even now the floor is dusky, and shadow slowly mounts the walls, bringing the Dedlocks down like age and death. And now, upon my Lady's picture over the great chimney-piece, a weird shade falls from some old tree, that turns it pale, and flutters it, and looks as if a great arm held a veil or hood, watching an opportunity to draw it over her. Higher and darker rises shadow on the wall--now a red gloom on the ceiling--now the fire is out.\nAll that prospect, which from the terrace looked so near, has moved solemnly away and changed--not the first nor the last of beautiful things that look so near and will so change--into a distant phantom. Light mists arise, and the dew falls, and all the sweet scents in the garden are heavy in the air. Now the woods settle into great masses as if they were each one profound tree. And now the moon rises to separate them, and to glimmer here and there in horizontal lines behind their stems, and to make the avenue a pavement of light among high cathedral arches fantastically broken.\nNow the moon is high; and the great house, needing habitation more than ever, is like a body without life. Now it is even awful, stealing through it, to think of the live people who have slept in the solitary bedrooms, to say nothing of the dead. Now is the time for shadow, when every corner is a cavern and every downward step a pit, when the stained glass is reflected in pale and faded hues upon the floors, when anything and everything can be made of the heavy staircase beams excepting their own proper shapes, when the armour has dull lights upon it not easily to be distinguished from stealthy movement, and when barred helmets are frightfully suggestive of heads inside. But of all the shadows in Chesney Wold, the shadow in the long drawing-room upon my Lady's picture is the first to come, the last to be disturbed. At this hour and by this light it changes into threatening hands raised up and menacing the handsome face with every breath that stirs.\n\"She is not well, ma'am,\" says a groom in Mrs. Rouncewell's audience-chamber.\n\"My Lady not well! What's the matter?\"\n\"Why, my Lady has been but poorly, ma'am, since she was last here--I don't mean with the family, ma'am, but when she was here as a bird of passage like. My Lady has not been out much, for her, and has kept her room a good deal.\"\n\"Chesney Wold, Thomas,\" rejoins the housekeeper with proud complacency, \"will set my Lady up! There is no finer air and no healthier soil in the world!\"\nThomas may have his own personal opinions on this subject, probably hints them in his manner of smoothing his sleek head from the nape of his neck to his temples, but he forbears to express them further and retires to the servants' hall to regale on cold meat-pie and ale.\nThis groom is the pilot-fish before the nobler shark. Next evening, down come Sir Leicester and my Lady with their largest retinue, and down come the cousins and others from all the points of the compass. Thenceforth for some weeks backward and forward rush mysterious men with no names, who fly about all those particular parts of the country on which Doodle is at present throwing himself in an auriferous and malty shower, but who are merely persons of a restless disposition and never do anything anywhere.\nOn these national occasions Sir Leicester finds the cousins useful. A better man than the Honourable Bob Stables to meet the Hunt at dinner, there could not possibly be. Better got up gentlemen than the other cousins to ride over to polling-booths and hustings here and there, and show themselves on the side of England, it would be hard to find. Volumnia is a little dim, but she is of the true descent; and there are many who appreciate her sprightly conversation, her French conundrums so old as to have become in the cycles of time almost new again, the honour of taking the fair Dedlock in to dinner, or even the privilege of her hand in the dance. On these national occasions dancing may be a patriotic service, and Volumnia is constantly seen hopping about for the good of an ungrateful and unpensioning country.\nMy Lady takes no great pains to entertain the numerous guests, and being still unwell, rarely appears until late in the day. But at all the dismal dinners, leaden lunches, basilisk balls, and other melancholy pageants, her mere appearance is a relief. As to Sir Leicester, he conceives it utterly impossible that anything can be wanting, in any direction, by any one who has the good fortune to be received under that roof; and in a state of sublime satisfaction, he moves among the company, a magnificent refrigerator.\nDaily the cousins trot through dust and canter over roadside turf, away to hustings and polling-booths (with leather gloves and hunting-whips for the counties and kid gloves and riding-canes for the boroughs), and daily bring back reports on which Sir Leicester holds forth after dinner. Daily the restless men who have no occupation in life present the appearance of being rather busy. Daily Volumnia has a little cousinly talk with Sir Leicester on the state of the nation, from which Sir Leicester is disposed to conclude that Volumnia is a more reflecting woman than he had thought her.\n\"How are we getting on?\" says Miss Volumnia, clasping her hands. \"ARE we safe?\"\nThe mighty business is nearly over by this time, and Doodle will throw himself off the country in a few days more. Sir Leicester has just appeared in the long drawing-room after dinner, a bright particular star surrounded by clouds of cousins.\n\"Volumnia,\" replies Sir Leicester, who has a list in his hand, \"we are doing tolerably.\"\n\"Only tolerably!\"\nAlthough it is summer weather, Sir Leicester always has his own particular fire in the evening. He takes his usual screened seat near it and repeats with much firmness and a little displeasure, as who should say, I am not a common man, and when I say tolerably, it must not be understood as a common expression, \"Volumnia, we are doing tolerably.\"\n\"At least there is no opposition to YOU,\" Volumnia asserts with confidence.\n\"No, Volumnia. This distracted country has lost its senses in many respects, I grieve to say, but--\"\n\"It is not so mad as that. I am glad to hear it!\"\nVolumnia's finishing the sentence restores her to favour. Sir Leicester, with a gracious inclination of his head, seems to say to himself, \"A sensible woman this, on the whole, though occasionally precipitate.\"\nIn fact, as to this question of opposition, the fair Dedlock's observation was superfluous, Sir Leicester on these occasions always delivering in his own candidateship, as a kind of handsome wholesale order to be promptly executed. Two other little seats that belong to him he treats as retail orders of less importance, merely sending down the men and signifying to the tradespeople, \"You will have the goodness to make these materials into two members of Parliament and to send them home when done.\"\n\"I regret to say, Volumnia, that in many places the people have shown a bad spirit, and that this opposition to the government has been of a most determined and most implacable description.\"\n\"W-r-retches!\" says Volumnia.\n\"Even,\" proceeds Sir Leicester, glancing at the circumjacent cousins on sofas and ottomans, \"even in many--in fact, in most--of those places in which the government has carried it against a faction--\"\n(Note, by the way, that the Coodleites are always a faction with the Doodleites, and that the Doodleites occupy exactly the same position towards the Coodleites.)\n\"--Even in them I am shocked, for the credit of Englishmen, to be constrained to inform you that the party has not triumphed without being put to an enormous expense. Hundreds,\" says Sir Leicester, eyeing the cousins with increasing dignity and swelling indignation, \"hundreds of thousands of pounds!\"\nIf Volumnia have a fault, it is the fault of being a trifle too innocent, seeing that the innocence which would go extremely well with a sash and tucker is a little out of keeping with the rouge and pearl necklace. Howbeit, impelled by innocence, she asks, \"What for?\"\n\"Volumnia,\" remonstrates Sir Leicester with his utmost severity. \"Volumnia!\"\n\"No, no, I don't mean what for,\" cries Volumnia with her favourite little scream. \"How stupid I am! I mean what a pity!\"\n\"I am glad,\" returns Sir Leicester, \"that you do mean what a pity.\"\nVolumnia hastens to express her opinion that the shocking people ought to be tried as traitors and made to support the party.\n\"I am glad, Volumnia,\" repeats Sir Leicester, unmindful of these mollifying sentiments, \"that you do mean what a pity. It is disgraceful to the electors. But as you, though inadvertently and without intending so unreasonable a question, asked me 'what for?' let me reply to you. For necessary expenses. And I trust to your good sense, Volumnia, not to pursue the subject, here or elsewhere.\"\nSir Leicester feels it incumbent on him to observe a crushing aspect towards Volumnia because it is whispered abroad that these necessary expenses will, in some two hundred election petitions, be unpleasantly connected with the word bribery, and because some graceless jokers have consequently suggested the omission from the Church service of the ordinary supplication in behalf of the High Court of Parliament and have recommended instead that the prayers of the congregation be requested for six hundred and fifty-eight gentlemen in a very unhealthy state.\n\"I suppose,\" observes Volumnia, having taken a little time to recover her spirits after her late castigation, \"I suppose Mr. Tulkinghorn has been worked to death.\"\n\"I don't know,\" says Sir Leicester, opening his eyes, \"why Mr. Tulkinghorn should be worked to death. I don't know what Mr. Tulkinghorn's engagements may be. He is not a candidate.\"\nVolumnia had thought he might have been employed. Sir Leicester could desire to know by whom, and what for. Volumnia, abashed again, suggests, by somebody--to advise and make arrangements. Sir Leicester is not aware that any client of Mr. Tulkinghorn has been in need of his assistance.\nLady Dedlock, seated at an open window with her arm upon its cushioned ledge and looking out at the evening shadows falling on the park, has seemed to attend since the lawyer's name was mentioned.\nA languid cousin with a moustache in a state of extreme debility now observes from his couch that man told him ya'as'dy that Tulkinghorn had gone down t' that iron place t' give legal 'pinion 'bout something, and that contest being over t' day, 'twould be highly jawlly thing if Tulkinghorn should 'pear with news that Coodle man was floored.\nMercury in attendance with coffee informs Sir Leicester, hereupon, that Mr. Tulkinghorn has arrived and is taking dinner. My Lady turns her head inward for the moment, then looks out again as before.\nVolumnia is charmed to hear that her delight is come. He is so original, such a stolid creature, such an immense being for knowing all sorts of things and never telling them! Volumnia is persuaded that he must be a Freemason. Is sure he is at the head of a lodge, and wears short aprons, and is made a perfect idol of with candlesticks and trowels. These lively remarks the fair Dedlock delivers in her youthful manner, while making a purse.\n\"He has not been here once,\" she adds, \"since I came. I really had some thoughts of breaking my heart for the inconstant creature. I had almost made up my mind that he was dead.\"\nIt may be the gathering gloom of evening, or it may be the darker gloom within herself, but a shade is on my Lady's face, as if she thought, \"I would he were!\"\n\"Mr. Tulkinghorn,\" says Sir Leicester, \"is always welcome here and always discreet wheresoever he is. A very valuable person, and deservedly respected.\"\nThe debilitated cousin supposes he is \"'normously rich fler.\"\n\"He has a stake in the country,\" says Sir Leicester, \"I have no doubt. He is, of course, handsomely paid, and he associates almost on a footing of equality with the highest society.\"\nEverybody starts. For a gun is fired close by.\n\"Good gracious, what's that?\" cries Volumnia with her little withered scream.\n\"A rat,\" says my Lady. \"And they have shot him.\"\nEnter Mr. Tulkinghorn, followed by Mercuries with lamps and candles.\n\"No, no,\" says Sir Leicester, \"I think not. My Lady, do you object to the twilight?\"\nOn the contrary, my Lady prefers it.\n\"Volumnia?\"\nOh! Nothing is so delicious to Volumnia as to sit and talk in the dark.\n\"Then take them away,\" says Sir Leicester. \"Tulkinghorn, I beg your pardon. How do you do?\"\nMr. Tulkinghorn with his usual leisurely ease advances, renders his passing homage to my Lady, shakes Sir Leicester's hand, and subsides into the chair proper to him when he has anything to communicate, on the opposite side of the Baronet's little newspaper-table. Sir Leicester is apprehensive that my Lady, not being very well, will take cold at that open window. My Lady is obliged to him, but would rather sit there for the air. Sir Leicester rises, adjusts her scarf about her, and returns to his seat. Mr. Tulkinghorn in the meanwhile takes a pinch of snuff.\n\"Now,\" says Sir Leicester. \"How has that contest gone?\"\n\"Oh, hollow from the beginning. Not a chance. They have brought in both their people. You are beaten out of all reason. Three to one.\"\nIt is a part of Mr. Tulkinghorn's policy and mastery to have no political opinions; indeed, NO opinions. Therefore he says \"you\" are beaten, and not \"we.\"\nSir Leicester is majestically wroth. Volumnia never heard of such a thing. 'The debilitated cousin holds that it's sort of thing that's sure tapn slongs votes--giv'n--Mob.\n\"It's the place, you know,\" Mr. Tulkinghorn goes on to say in the fast-increasing darkness when there is silence again, \"where they wanted to put up Mrs. Rouncewell's son.\"\n\"A proposal which, as you correctly informed me at the time, he had the becoming taste and perception,\" observes Sir Leicester, \"to decline. I cannot say that I by any means approve of the sentiments expressed by Mr. Rouncewell when he was here for some half-hour in this room, but there was a sense of propriety in his decision which I am glad to acknowledge.\"\n\"Ha!\" says Mr. Tulkinghorn. \"It did not prevent him from being very active in this election, though.\"\nSir Leicester is distinctly heard to gasp before speaking. \"Did I understand you? Did you say that Mr. Rouncewell had been very active in this election?\"\n\"Uncommonly active.\"\n\"Against--\"\n\"Oh, dear yes, against you. He is a very good speaker. Plain and emphatic. He made a damaging effect, and has great influence. In the business part of the proceedings he carried all before him.\"\nIt is evident to the whole company, though nobody can see him, that Sir Leicester is staring majestically.\n\"And he was much assisted,\" says Mr. Tulkinghorn as a wind-up, \"by his son.\"\n\"By his son, sir?\" repeats Sir Leicester with awful politeness.\n\"By his son.\"\n\"The son who wished to marry the young woman in my Lady's service?\"\n\"That son. He has but one.\"\n\"Then upon my honour,\" says Sir Leicester after a terrific pause during which he has been heard to snort and felt to stare, \"then upon my honour, upon my life, upon my reputation and principles, the floodgates of society are burst open, and the waters have--a--obliterated the landmarks of the framework of the cohesion by which things are held together!\"\nGeneral burst of cousinly indignation. Volumnia thinks it is really high time, you know, for somebody in power to step in and do something strong. Debilitated cousin thinks--country's going--Dayvle--steeple-chase pace.\n\"I beg,\" says Sir Leicester in a breathless condition, \"that we may not comment further on this circumstance. Comment is superfluous. My Lady, let me suggest in reference to that young woman--\"\n\"I have no intention,\" observes my Lady from her window in a low but decided tone, \"of parting with her.\"\n\"That was not my meaning,\" returns Sir Leicester. \"I am glad to hear you say so. I would suggest that as you think her worthy of your patronage, you should exert your influence to keep her from these dangerous hands. You might show her what violence would be done in such association to her duties and principles, and you might preserve her for a better fate. You might point out to her that she probably would, in good time, find a husband at Chesney Wold by whom she would not be--\" Sir Leicester adds, after a moment's consideration, \"dragged from the altars of her forefathers.\"\nThese remarks he offers with his unvarying politeness and deference when he addresses himself to his wife. She merely moves her head in reply. The moon is rising, and where she sits there is a little stream of cold pale light, in which her head is seen.\n\"It is worthy of remark,\" says Mr. Tulkinghorn, \"however, that these people are, in their way, very proud.\"\n\"Proud?\" Sir Leicester doubts his hearing.\n\"I should not be surprised if they all voluntarily abandoned the girl--yes, lover and all--instead of her abandoning them, supposing she remained at Chesney Wold under such circumstances.\"\n\"Well!\" says Sir Leicester tremulously. \"Well! You should know, Mr. Tulkinghorn. You have been among them.\"\n\"Really, Sir Leicester,\" returns the lawyer, \"I state the fact. Why, I could tell you a story--with Lady Dedlock's permission.\"\nHer head concedes it, and Volumnia is enchanted. A story! Oh, he is going to tell something at last! A ghost in it, Volumnia hopes?\n\"No. Real flesh and blood.\" Mr. Tulkinghorn stops for an instant and repeats with some little emphasis grafted upon his usual monotony, \"Real flesh and blood, Miss Dedlock. Sir Leicester, these particulars have only lately become known to me. They are very brief. They exemplify what I have said. I suppress names for the present. Lady Dedlock will not think me ill-bred, I hope?\"\nBy the light of the fire, which is low, he can be seen looking towards the moonlight. By the light of the moon Lady Dedlock can be seen, perfectly still.\n\"A townsman of this Mrs. Rouncewell, a man in exactly parallel circumstances as I am told, had the good fortune to have a daughter who attracted the notice of a great lady. I speak of really a great lady, not merely great to him, but married to a gentleman of your condition, Sir Leicester.\"\nSir Leicester condescendingly says, \"Yes, Mr. Tulkinghorn,\" implying that then she must have appeared of very considerable moral dimensions indeed in the eyes of an iron-master.\n\"The lady was wealthy and beautiful, and had a liking for the girl, and treated her with great kindness, and kept her always near her. Now this lady preserved a secret under all her greatness, which she had preserved for many years. In fact, she had in early life been engaged to marry a young rake--he was a captain in the army--nothing connected with whom came to any good. She never did marry him, but she gave birth to a child of which he was the father.\"\nBy the light of the fire he can be seen looking towards the moonlight. By the moonlight, Lady Dedlock can be seen in profile, perfectly still.\n\"The captain in the army being dead, she believed herself safe; but a train of circumstances with which I need not trouble you led to discovery. As I received the story, they began in an imprudence on her own part one day when she was taken by surprise, which shows how difficult it is for the firmest of us (she was very firm) to be always guarded. There was great domestic trouble and amazement, you may suppose; I leave you to imagine, Sir Leicester, the husband's grief. But that is not the present point. When Mr. Rouncewell's townsman heard of the disclosure, he no more allowed the girl to be patronized and honoured than he would have suffered her to be trodden underfoot before his eyes. Such was his pride, that he indignantly took her away, as if from reproach and disgrace. He had no sense of the honour done him and his daughter by the lady's condescension; not the least. He resented the girl's position, as if the lady had been the commonest of commoners. That is the story. I hope Lady Dedlock will excuse its painful nature.\"\nThere are various opinions on the merits, more or less conflicting with Volumnia's. That fair young creature cannot believe there ever was any such lady and rejects the whole history on the threshold. The majority incline to the debilitated cousin's sentiment, which is in few words--\"no business--Rouncewell's fernal townsman.\" Sir Leicester generally refers back in his mind to Wat Tyler and arranges a sequence of events on a plan of his own.\nThere is not much conversation in all, for late hours have been kept at Chesney Wold since the necessary expenses elsewhere began, and this is the first night in many on which the family have been alone. It is past ten when Sir Leicester begs Mr. Tulkinghorn to ring for candles. Then the stream of moonlight has swelled into a lake, and then Lady Dedlock for the first time moves, and rises, and comes forward to a table for a glass of water. Winking cousins, bat-like in the candle glare, crowd round to give it; Volumnia (always ready for something better if procurable) takes another, a very mild sip of which contents her; Lady Dedlock, graceful, self-possessed, looked after by admiring eyes, passes away slowly down the long perspective by the side of that nymph, not at all improving her as a question of contrast.",
        "paragraph_chars": [
            [
                0,
                1860
            ],
            [
                1860,
                2508
            ],
            [
                2508,
                3182
            ],
            [
                3182,
                3851
            ],
            [
                3851,
                4817
            ],
            [
                4817,
                5293
            ],
            [
                5293,
                5879
            ],
            [
                5879,
                6842
            ],
            [
                6842,
                6920
            ],
            [
                6920,
                6959
            ],
            [
                6959,
                7188
            ],
            [
                7188,
                7341
            ],
            [
                7341,
                7614
            ],
            [
                7614,
                8125
            ],
            [
                8125,
                8945
            ],
            [
                8945,
                9465
            ],
            [
                9465,
                10056
            ],
            [
                10056,
                10136
            ],
            [
                10136,
                10380
            ],
            [
                10380,
                10469
            ],
            [
                10469,
                10487
            ],
            [
                10487,
                10835
            ],
            [
                10835,
                10911
            ],
            [
                10911,
                11012
            ],
            [
                11012,
                11062
            ],
            [
                11062,
                11273
            ],
            [
                11273,
                11775
            ],
            [
                11775,
                11966
            ],
            [
                11966,
                11996
            ],
            [
                11996,
                12197
            ],
            [
                12197,
                12360
            ],
            [
                12360,
                12662
            ],
            [
                12662,
                12931
            ],
            [
                12931,
                13008
            ],
            [
                13008,
                13129
            ],
            [
                13129,
                13197
            ],
            [
                13197,
                13323
            ],
            [
                13323,
                13715
            ],
            [
                13715,
                14275
            ],
            [
                14275,
                14439
            ],
            [
                14439,
                14621
            ],
            [
                14621,
                14908
            ],
            [
                14908,
                15105
            ],
            [
                15105,
                15448
            ],
            [
                15448,
                15648
            ],
            [
                15648,
                16090
            ],
            [
                16090,
                16269
            ],
            [
                16269,
                16429
            ],
            [
                16429,
                16582
            ],
            [
                16582,
                16644
            ],
            [
                16644,
                16827
            ],
            [
                16827,
                16874
            ],
            [
                16874,
                16952
            ],
            [
                16952,
                17001
            ],
            [
                17001,
                17070
            ],
            [
                17070,
                17155
            ],
            [
                17155,
                17192
            ],
            [
                17192,
                17204
            ],
            [
                17204,
                17276
            ],
            [
                17276,
                17368
            ],
            [
                17368,
                17933
            ],
            [
                17933,
                17989
            ],
            [
                17989,
                18124
            ],
            [
                18124,
                18279
            ],
            [
                18279,
                18451
            ],
            [
                18451,
                18624
            ],
            [
                18624,
                18986
            ],
            [
                18986,
                19088
            ],
            [
                19088,
                19242
            ],
            [
                19242,
                19263
            ],
            [
                19263,
                19275
            ],
            [
                19275,
                19470
            ],
            [
                19470,
                19577
            ],
            [
                19577,
                19654
            ],
            [
                19654,
                19718
            ],
            [
                19718,
                19732
            ],
            [
                19732,
                19800
            ],
            [
                19800,
                19828
            ],
            [
                19828,
                20184
            ],
            [
                20184,
                20403
            ],
            [
                20403,
                20597
            ],
            [
                20597,
                20703
            ],
            [
                20703,
                21286
            ],
            [
                21286,
                21540
            ],
            [
                21540,
                21648
            ],
            [
                21648,
                21691
            ],
            [
                21691,
                21880
            ],
            [
                21880,
                21988
            ],
            [
                21988,
                22116
            ],
            [
                22116,
                22248
            ],
            [
                22248,
                22629
            ],
            [
                22629,
                22783
            ],
            [
                22783,
                23075
            ],
            [
                23075,
                23253
            ],
            [
                23253,
                23713
            ],
            [
                23713,
                23856
            ],
            [
                23856,
                24899
            ],
            [
                24899,
                25345
            ],
            [
                25345,
                26167
            ]
        ],
        "segment_chars": [
            [
                0,
                53
            ],
            [
                53,
                225
            ],
            [
                225,
                587
            ],
            [
                587,
                1127
            ],
            [
                1127,
                1493
            ],
            [
                1493,
                1640
            ],
            [
                1640,
                1821
            ],
            [
                1821,
                1860
            ],
            [
                1860,
                1966
            ],
            [
                1966,
                2125
            ],
            [
                2125,
                2508
            ],
            [
                2508,
                2772
            ],
            [
                2772,
                3182
            ],
            [
                3182,
                3264
            ],
            [
                3264,
                3407
            ],
            [
                3407,
                3851
            ],
            [
                3851,
                4102
            ],
            [
                4102,
                4136
            ],
            [
                4136,
                4216
            ],
            [
                4216,
                4269
            ],
            [
                4269,
                4333
            ],
            [
                4333,
                4467
            ],
            [
                4467,
                4647
            ],
            [
                4647,
                4817
            ],
            [
                4817,
                4851
            ],
            [
                4851,
                4963
            ],
            [
                4963,
                5196
            ],
            [
                5196,
                5293
            ],
            [
                5293,
                5497
            ],
            [
                5497,
                5596
            ],
            [
                5596,
                5675
            ],
            [
                5675,
                5879
            ],
            [
                5879,
                5986
            ],
            [
                5986,
                6126
            ],
            [
                6126,
                6559
            ],
            [
                6559,
                6706
            ],
            [
                6706,
                6842
            ],
            [
                6842,
                6920
            ],
            [
                6920,
                6939
            ],
            [
                6939,
                6959
            ],
            [
                6959,
                7112
            ],
            [
                7112,
                7188
            ],
            [
                7188,
                7282
            ],
            [
                7282,
                7341
            ],
            [
                7341,
                7614
            ],
            [
                7614,
                7668
            ],
            [
                7668,
                7819
            ],
            [
                7819,
                8125
            ],
            [
                8125,
                8193
            ],
            [
                8193,
                8295
            ],
            [
                8295,
                8472
            ],
            [
                8472,
                8779
            ],
            [
                8779,
                8945
            ],
            [
                8945,
                9070
            ],
            [
                9070,
                9197
            ],
            [
                9197,
                9465
            ],
            [
                9465,
                9753
            ],
            [
                9753,
                9852
            ],
            [
                9852,
                10056
            ],
            [
                10056,
                10081
            ],
            [
                10081,
                10121
            ],
            [
                10121,
                10136
            ],
            [
                10136,
                10251
            ],
            [
                10251,
                10380
            ],
            [
                10380,
                10469
            ],
            [
                10469,
                10487
            ],
            [
                10487,
                10583
            ],
            [
                10583,
                10835
            ],
            [
                10835,
                10911
            ],
            [
                10911,
                10926
            ],
            [
                10926,
                11012
            ],
            [
                11012,
                11039
            ],
            [
                11039,
                11062
            ],
            [
                11062,
                11120
            ],
            [
                11120,
                11273
            ],
            [
                11273,
                11505
            ],
            [
                11505,
                11775
            ],
            [
                11775,
                11966
            ],
            [
                11966,
                11981
            ],
            [
                11981,
                11996
            ],
            [
                11996,
                12197
            ],
            [
                12197,
                12360
            ],
            [
                12360,
                12527
            ],
            [
                12527,
                12662
            ],
            [
                12662,
                12877
            ],
            [
                12877,
                12931
            ],
            [
                12931,
                12996
            ],
            [
                12996,
                13008
            ],
            [
                13008,
                13090
            ],
            [
                13090,
                13108
            ],
            [
                13108,
                13129
            ],
            [
                13129,
                13197
            ],
            [
                13197,
                13323
            ],
            [
                13323,
                13442
            ],
            [
                13442,
                13477
            ],
            [
                13477,
                13581
            ],
            [
                13581,
                13602
            ],
            [
                13602,
                13626
            ],
            [
                13626,
                13715
            ],
            [
                13715,
                14275
            ],
            [
                14275,
                14439
            ],
            [
                14439,
                14541
            ],
            [
                14541,
                14597
            ],
            [
                14597,
                14621
            ],
            [
                14621,
                14671
            ],
            [
                14671,
                14729
            ],
            [
                14729,
                14810
            ],
            [
                14810,
                14908
            ],
            [
                14908,
                15105
            ],
            [
                15105,
                15448
            ],
            [
                15448,
                15570
            ],
            [
                15570,
                15648
            ],
            [
                15648,
                15702
            ],
            [
                15702,
                15823
            ],
            [
                15823,
                15874
            ],
            [
                15874,
                15997
            ],
            [
                15997,
                16090
            ],
            [
                16090,
                16144
            ],
            [
                16144,
                16221
            ],
            [
                16221,
                16269
            ],
            [
                16269,
                16429
            ],
            [
                16429,
                16531
            ],
            [
                16531,
                16582
            ],
            [
                16582,
                16644
            ],
            [
                16644,
                16715
            ],
            [
                16715,
                16827
            ],
            [
                16827,
                16845
            ],
            [
                16845,
                16874
            ],
            [
                16874,
                16904
            ],
            [
                16904,
                16952
            ],
            [
                16952,
                16975
            ],
            [
                16975,
                17001
            ],
            [
                17001,
                17070
            ],
            [
                17070,
                17114
            ],
            [
                17114,
                17155
            ],
            [
                17155,
                17192
            ],
            [
                17192,
                17204
            ],
            [
                17204,
                17208
            ],
            [
                17208,
                17276
            ],
            [
                17276,
                17319
            ],
            [
                17319,
                17352
            ],
            [
                17352,
                17368
            ],
            [
                17368,
                17633
            ],
            [
                17633,
                17734
            ],
            [
                17734,
                17801
            ],
            [
                17801,
                17876
            ],
            [
                17876,
                17933
            ],
            [
                17933,
                17960
            ],
            [
                17960,
                17989
            ],
            [
                17989,
                18021
            ],
            [
                18021,
                18035
            ],
            [
                18035,
                18075
            ],
            [
                18075,
                18109
            ],
            [
                18109,
                18124
            ],
            [
                18124,
                18229
            ],
            [
                18229,
                18279
            ],
            [
                18279,
                18316
            ],
            [
                18316,
                18354
            ],
            [
                18354,
                18451
            ],
            [
                18451,
                18624
            ],
            [
                18624,
                18765
            ],
            [
                18765,
                18986
            ],
            [
                18986,
                18992
            ],
            [
                18992,
                19014
            ],
            [
                19014,
                19088
            ],
            [
                19088,
                19147
            ],
            [
                19147,
                19170
            ],
            [
                19170,
                19242
            ],
            [
                19242,
                19263
            ],
            [
                19263,
                19275
            ],
            [
                19275,
                19303
            ],
            [
                19303,
                19330
            ],
            [
                19330,
                19350
            ],
            [
                19350,
                19402
            ],
            [
                19402,
                19470
            ],
            [
                19470,
                19577
            ],
            [
                19577,
                19654
            ],
            [
                19654,
                19673
            ],
            [
                19673,
                19718
            ],
            [
                19718,
                19732
            ],
            [
                19732,
                19800
            ],
            [
                19800,
                19811
            ],
            [
                19811,
                19828
            ],
            [
                19828,
                20184
            ],
            [
                20184,
                20223
            ],
            [
                20223,
                20331
            ],
            [
                20331,
                20403
            ],
            [
                20403,
                20513
            ],
            [
                20513,
                20537
            ],
            [
                20537,
                20597
            ],
            [
                20597,
                20703
            ],
            [
                20703,
                20753
            ],
            [
                20753,
                20784
            ],
            [
                20784,
                20920
            ],
            [
                20920,
                21063
            ],
            [
                21063,
                21286
            ],
            [
                21286,
                21393
            ],
            [
                21393,
                21429
            ],
            [
                21429,
                21540
            ],
            [
                21540,
                21648
            ],
            [
                21648,
                21657
            ],
            [
                21657,
                21691
            ],
            [
                21691,
                21880
            ],
            [
                21880,
                21888
            ],
            [
                21888,
                21920
            ],
            [
                21920,
                21927
            ],
            [
                21927,
                21961
            ],
            [
                21961,
                21988
            ],
            [
                21988,
                22052
            ],
            [
                22052,
                22116
            ],
            [
                22116,
                22165
            ],
            [
                22165,
                22174
            ],
            [
                22174,
                22217
            ],
            [
                22217,
                22248
            ],
            [
                22248,
                22253
            ],
            [
                22253,
                22276
            ],
            [
                22276,
                22421
            ],
            [
                22421,
                22491
            ],
            [
                22491,
                22512
            ],
            [
                22512,
                22545
            ],
            [
                22545,
                22579
            ],
            [
                22579,
                22629
            ],
            [
                22629,
                22715
            ],
            [
                22715,
                22783
            ],
            [
                22783,
                22956
            ],
            [
                22956,
                23075
            ],
            [
                23075,
                23253
            ],
            [
                23253,
                23388
            ],
            [
                23388,
                23486
            ],
            [
                23486,
                23629
            ],
            [
                23629,
                23713
            ],
            [
                23713,
                23784
            ],
            [
                23784,
                23856
            ],
            [
                23856,
                24001
            ],
            [
                24001,
                24206
            ],
            [
                24206,
                24331
            ],
            [
                24331,
                24366
            ],
            [
                24366,
                24553
            ],
            [
                24553,
                24642
            ],
            [
                24642,
                24742
            ],
            [
                24742,
                24827
            ],
            [
                24827,
                24846
            ],
            [
                24846,
                24899
            ],
            [
                24899,
                24983
            ],
            [
                24983,
                25100
            ],
            [
                25100,
                25228
            ],
            [
                25228,
                25345
            ],
            [
                25345,
                25549
            ],
            [
                25549,
                25625
            ],
            [
                25625,
                25789
            ],
            [
                25789,
                26167
            ]
        ],
        "overlap_chars": [
            [
                0,
                53
            ],
            [
                53,
                64
            ],
            [
                74,
                96
            ],
            [
                103,
                225
            ],
            [
                1179,
                1181
            ],
            [
                1309,
                1311
            ],
            [
                1312,
                1405
            ],
            [
                1164,
                1167
            ],
            [
                1202,
                1204
            ],
            [
                1491,
                1492
            ],
            [
                1640,
                1740
            ],
            [
                1744,
                1769
            ],
            [
                1774,
                1795
            ],
            [
                1800,
                1821
            ],
            [
                1821,
                1859
            ],
            [
                1860,
                1921
            ],
            [
                1922,
                1966
            ],
            [
                2364,
                2467
            ],
            [
                2478,
                2486
            ],
            [
                2497,
                2508
            ],
            [
                2508,
                2568
            ],
            [
                2613,
                2682
            ],
            [
                2693,
                2772
            ],
            [
                2772,
                2802
            ],
            [
                2843,
                2942
            ],
            [
                2969,
                2994
            ],
            [
                3000,
                3006
            ],
            [
                3011,
                3074
            ],
            [
                2802,
                2803
            ],
            [
                3098,
                3128
            ],
            [
                3180,
                3182
            ],
            [
                3182,
                3186
            ],
            [
                3195,
                3209
            ],
            [
                3231,
                3264
            ],
            [
                3264,
                3302
            ],
            [
                3345,
                3407
            ],
            [
                3851,
                3884
            ],
            [
                3885,
                3899
            ],
            [
                3907,
                4004
            ],
            [
                4031,
                4039
            ],
            [
                4040,
                4065
            ],
            [
                4100,
                4102
            ],
            [
                4102,
                4136
            ],
            [
                4136,
                4215
            ],
            [
                4817,
                4851
            ],
            [
                4884,
                4963
            ],
            [
                4963,
                5064
            ],
            [
                5112,
                5196
            ],
            [
                5196,
                5219
            ],
            [
                5220,
                5238
            ],
            [
                5240,
                5270
            ],
            [
                5272,
                5293
            ],
            [
                5497,
                5538
            ],
            [
                5543,
                5552
            ],
            [
                5567,
                5573
            ],
            [
                5553,
                5559
            ],
            [
                5574,
                5596
            ],
            [
                5596,
                5675
            ],
            [
                5675,
                5879
            ],
            [
                5879,
                5920
            ],
            [
                5957,
                5986
            ],
            [
                6126,
                6295
            ],
            [
                6401,
                6559
            ],
            [
                6559,
                6679
            ],
            [
                6753,
                6811
            ],
            [
                6840,
                6842
            ],
            [
                6842,
                6901
            ],
            [
                6918,
                6920
            ],
            [
                6920,
                6939
            ],
            [
                6939,
                6959
            ],
            [
                6959,
                6981
            ],
            [
                6986,
                7024
            ],
            [
                7150,
                7188
            ],
            [
                7188,
                7282
            ],
            [
                7282,
                7303
            ],
            [
                7326,
                7341
            ],
            [
                7341,
                7399
            ],
            [
                7504,
                7535
            ],
            [
                7544,
                7577
            ],
            [
                7612,
                7613
            ],
            [
                7614,
                7668
            ],
            [
                7668,
                7728
            ],
            [
                7737,
                7819
            ],
            [
                7819,
                7925
            ],
            [
                7937,
                8004
            ],
            [
                8123,
                8125
            ],
            [
                8125,
                8193
            ],
            [
                8193,
                8295
            ],
            [
                8295,
                8305
            ],
            [
                8306,
                8341
            ],
            [
                8400,
                8401
            ],
            [
                8342,
                8385
            ],
            [
                8444,
                8472
            ],
            [
                8472,
                8677
            ],
            [
                8777,
                8779
            ],
            [
                8779,
                8918
            ],
            [
                8936,
                8945
            ],
            [
                8945,
                9070
            ],
            [
                9070,
                9197
            ],
            [
                9197,
                9220
            ],
            [
                9373,
                9407
            ],
            [
                9367,
                9368
            ],
            [
                9409,
                9465
            ],
            [
                9465,
                9487
            ],
            [
                9532,
                9567
            ],
            [
                9530,
                9531
            ],
            [
                9675,
                9753
            ],
            [
                9753,
                9806
            ],
            [
                9839,
                9852
            ],
            [
                9852,
                9965
            ],
            [
                9990,
                10056
            ],
            [
                10056,
                10081
            ],
            [
                10081,
                10121
            ],
            [
                10121,
                10136
            ],
            [
                10136,
                10183
            ],
            [
                10249,
                10251
            ],
            [
                10251,
                10330
            ],
            [
                10342,
                10380
            ],
            [
                10380,
                10469
            ],
            [
                10469,
                10484
            ],
            [
                10836,
                10911
            ],
            [
                10911,
                10926
            ],
            [
                10926,
                11008
            ],
            [
                11012,
                11039
            ],
            [
                11039,
                11062
            ],
            [
                11062,
                11095
            ],
            [
                11118,
                11120
            ],
            [
                11176,
                11223
            ],
            [
                11270,
                11273
            ],
            [
                11273,
                11316
            ],
            [
                11365,
                11378
            ],
            [
                11398,
                11404
            ],
            [
                11419,
                11440
            ],
            [
                11442,
                11505
            ],
            [
                11505,
                11613
            ],
            [
                11618,
                11775
            ],
            [
                11775,
                11910
            ],
            [
                11916,
                11931
            ],
            [
                11963,
                11966
            ],
            [
                11966,
                11981
            ],
            [
                11981,
                11996
            ],
            [
                11996,
                11997
            ],
            [
                12094,
                12101
            ],
            [
                12130,
                12136
            ],
            [
                12376,
                12388
            ],
            [
                12420,
                12422
            ],
            [
                12438,
                12525
            ],
            [
                12001,
                12003
            ],
            [
                12013,
                12027
            ],
            [
                12257,
                12261
            ],
            [
                12525,
                12527
            ],
            [
                12627,
                12662
            ],
            [
                12662,
                12673
            ],
            [
                12679,
                12734
            ],
            [
                12875,
                12877
            ],
            [
                12886,
                12931
            ],
            [
                12931,
                12969
            ],
            [
                12970,
                12995
            ],
            [
                13008,
                13090
            ],
            [
                13090,
                13108
            ],
            [
                13108,
                13128
            ],
            [
                13206,
                13323
            ],
            [
                13323,
                13345
            ],
            [
                13354,
                13367
            ],
            [
                13409,
                13428
            ],
            [
                13429,
                13440
            ],
            [
                13477,
                13487
            ],
            [
                13560,
                13581
            ],
            [
                13581,
                13593
            ],
            [
                13600,
                13602
            ],
            [
                13602,
                13626
            ],
            [
                13626,
                13715
            ],
            [
                13715,
                13737
            ],
            [
                13755,
                13757
            ],
            [
                13792,
                13800
            ],
            [
                13801,
                13875
            ],
            [
                13906,
                13955
            ],
            [
                14273,
                14275
            ],
            [
                14275,
                14356
            ],
            [
                14383,
                14439
            ],
            [
                14439,
                14452
            ],
            [
                14494,
                14497
            ],
            [
                14514,
                14523
            ],
            [
                14452,
                14473
            ],
            [
                14539,
                14541
            ],
            [
                14597,
                14621
            ],
            [
                14908,
                14946
            ],
            [
                14985,
                15023
            ],
            [
                15043,
                15044
            ],
            [
                15056,
                15105
            ],
            [
                15105,
                15218
            ],
            [
                15225,
                15317
            ],
            [
                15350,
                15402
            ],
            [
                15414,
                15448
            ],
            [
                15470,
                15503
            ],
            [
                15515,
                15570
            ],
            [
                15570,
                15592
            ],
            [
                15614,
                15648
            ],
            [
                15648,
                15702
            ],
            [
                15702,
                15744
            ],
            [
                15771,
                15823
            ],
            [
                15823,
                15834
            ],
            [
                15850,
                15874
            ],
            [
                15997,
                16066
            ],
            [
                16088,
                16090
            ],
            [
                16090,
                16144
            ],
            [
                16144,
                16221
            ],
            [
                16221,
                16269
            ],
            [
                16269,
                16309
            ],
            [
                16355,
                16412
            ],
            [
                16419,
                16429
            ],
            [
                16429,
                16511
            ],
            [
                16529,
                16531
            ],
            [
                16531,
                16553
            ],
            [
                16579,
                16582
            ],
            [
                16582,
                16636
            ],
            [
                16641,
                16644
            ],
            [
                16715,
                16748
            ],
            [
                16748,
                16749
            ],
            [
                16750,
                16827
            ],
            [
                16827,
                16845
            ],
            [
                16845,
                16874
            ],
            [
                16874,
                16904
            ],
            [
                16904,
                16952
            ],
            [
                16952,
                16975
            ],
            [
                16975,
                17001
            ],
            [
                17001,
                17022
            ],
            [
                17068,
                17070
            ],
            [
                17319,
                17331
            ],
            [
                17350,
                17352
            ],
            [
                17352,
                17368
            ],
            [
                17368,
                17423
            ],
            [
                17451,
                17519
            ],
            [
                17578,
                17586
            ],
            [
                17595,
                17608
            ],
            [
                17616,
                17633
            ],
            [
                17633,
                17646
            ],
            [
                17663,
                17734
            ],
            [
                17734,
                17801
            ],
            [
                17801,
                17875
            ],
            [
                17933,
                17960
            ],
            [
                17960,
                17989
            ],
            [
                17989,
                18021
            ],
            [
                18021,
                18035
            ],
            [
                18035,
                18075
            ],
            [
                18075,
                18109
            ],
            [
                18109,
                18124
            ],
            [
                18124,
                18157
            ],
            [
                18169,
                18227
            ],
            [
                18227,
                18229
            ],
            [
                18229,
                18279
            ],
            [
                18279,
                18308
            ],
            [
                18314,
                18316
            ],
            [
                18316,
                18353
            ],
            [
                18451,
                18502
            ],
            [
                18569,
                18624
            ],
            [
                18624,
                18649
            ],
            [
                18660,
                18710
            ],
            [
                18753,
                18763
            ],
            [
                18725,
                18753
            ],
            [
                18765,
                18784
            ],
            [
                18798,
                18868
            ],
            [
                18900,
                18917
            ],
            [
                18927,
                18986
            ],
            [
                18986,
                18992
            ],
            [
                18992,
                19014
            ],
            [
                19014,
                19088
            ],
            [
                19088,
                19129
            ],
            [
                19145,
                19147
            ],
            [
                19147,
                19170
            ],
            [
                19170,
                19242
            ],
            [
                19242,
                19263
            ],
            [
                19263,
                19271
            ],
            [
                19275,
                19303
            ],
            [
                19303,
                19330
            ],
            [
                19330,
                19350
            ],
            [
                19350,
                19400
            ],
            [
                19542,
                19577
            ],
            [
                19577,
                19625
            ],
            [
                19638,
                19654
            ],
            [
                19732,
                19800
            ],
            [
                19800,
                19811
            ],
            [
                19811,
                19828
            ],
            [
                19828,
                19892
            ],
            [
                19950,
                19953
            ],
            [
                19974,
                19986
            ],
            [
                20021,
                20084
            ],
            [
                20096,
                20184
            ],
            [
                20184,
                20223
            ],
            [
                20223,
                20331
            ],
            [
                20331,
                20356
            ],
            [
                20390,
                20391
            ],
            [
                20358,
                20373
            ],
            [
                20375,
                20378
            ],
            [
                20401,
                20403
            ],
            [
                20403,
                20430
            ],
            [
                20436,
                20446
            ],
            [
                20456,
                20513
            ],
            [
                20537,
                20593
            ],
            [
                20597,
                20652
            ],
            [
                20678,
                20703
            ],
            [
                20703,
                20753
            ],
            [
                20753,
                20784
            ],
            [
                20784,
                20920
            ],
            [
                21063,
                21159
            ],
            [
                21283,
                21286
            ],
            [
                21286,
                21353
            ],
            [
                21380,
                21393
            ],
            [
                21393,
                21429
            ],
            [
                21429,
                21540
            ],
            [
                21540,
                21589
            ],
            [
                21598,
                21648
            ],
            [
                21648,
                21657
            ],
            [
                21657,
                21691
            ],
            [
                21691,
                21725
            ],
            [
                21742,
                21760
            ],
            [
                21782,
                21852
            ],
            [
                21877,
                21880
            ],
            [
                21880,
                21888
            ],
            [
                21888,
                21920
            ],
            [
                21927,
                21961
            ],
            [
                21961,
                21988
            ],
            [
                21988,
                21989
            ],
            [
                22052,
                22055
            ],
            [
                21995,
                22035
            ],
            [
                22059,
                22081
            ],
            [
                22083,
                22116
            ],
            [
                22136,
                22165
            ],
            [
                22165,
                22174
            ],
            [
                22217,
                22248
            ],
            [
                22248,
                22253
            ],
            [
                22385,
                22419
            ],
            [
                22419,
                22421
            ],
            [
                22421,
                22441
            ],
            [
                22454,
                22491
            ],
            [
                22512,
                22545
            ],
            [
                22545,
                22579
            ],
            [
                22579,
                22629
            ],
            [
                22629,
                22648
            ],
            [
                22664,
                22667
            ],
            [
                22649,
                22653
            ],
            [
                22667,
                22715
            ],
            [
                22715,
                22783
            ],
            [
                22783,
                22859
            ],
            [
                22872,
                22956
            ],
            [
                22956,
                22987
            ],
            [
                23017,
                23047
            ],
            [
                23057,
                23075
            ],
            [
                23075,
                23176
            ],
            [
                23180,
                23197
            ],
            [
                23215,
                23253
            ],
            [
                23253,
                23388
            ],
            [
                23388,
                23459
            ],
            [
                23470,
                23486
            ],
            [
                23486,
                23551
            ],
            [
                23560,
                23581
            ],
            [
                23611,
                23618
            ],
            [
                23623,
                23629
            ],
            [
                23629,
                23713
            ],
            [
                23713,
                23784
            ],
            [
                23784,
                23856
            ],
            [
                23856,
                23868
            ],
            [
                23881,
                24001
            ],
            [
                24001,
                24005
            ],
            [
                24136,
                24138
            ],
            [
                24024,
                24108
            ],
            [
                24204,
                24206
            ],
            [
                24206,
                24331
            ],
            [
                24331,
                24350
            ],
            [
                24359,
                24366
            ],
            [
                24366,
                24427
            ],
            [
                24433,
                24479
            ],
            [
                24551,
                24553
            ],
            [
                24553,
                24640
            ],
            [
                24725,
                24726
            ],
            [
                24775,
                24827
            ],
            [
                24827,
                24846
            ],
            [
                24846,
                24899
            ],
            [
                25008,
                25081
            ],
            [
                25098,
                25100
            ],
            [
                25228,
                25241
            ],
            [
                25313,
                25315
            ],
            [
                25279,
                25292
            ],
            [
                25343,
                25345
            ],
            [
                25345,
                25387
            ],
            [
                25485,
                25487
            ],
            [
                25388,
                25392
            ],
            [
                25547,
                25549
            ],
            [
                25573,
                25625
            ],
            [
                25630,
                25737
            ],
            [
                25748,
                25789
            ],
            [
                25804,
                25859
            ],
            [
                25973,
                26019
            ],
            [
                26120,
                26122
            ],
            [
                26026,
                26050
            ],
            [
                26056,
                26062
            ],
            [
                25950,
                25952
            ],
            [
                26068,
                26076
            ],
            [
                26166,
                26167
            ]
        ],
        "row_chars": [
            [
                0,
                53
            ],
            [
                53,
                225
            ],
            [
                225,
                587
            ],
            [
                587,
                1127
            ],
            [
                1127,
                1493
            ],
            [
                1493,
                1640
            ],
            [
                1640,
                1821
            ],
            [
                1821,
                1860
            ],
            [
                1860,
                1966
            ],
            [
                1966,
                2125
            ],
            [
                2125,
                2508
            ],
            [
                2508,
                2772
            ],
            [
                2772,
                3182
            ],
            [
                3182,
                3264
            ],
            [
                3264,
                3407
            ],
            [
                3407,
                3851
            ],
            [
                3851,
                4102
            ],
            [
                4102,
                4136
            ],
            [
                4136,
                4216
            ],
            [
                4216,
                4269
            ],
            [
                4269,
                4333
            ],
            [
                4333,
                4467
            ],
            [
                4467,
                4647
            ],
            [
                4647,
                4817
            ],
            [
                4817,
                4851
            ],
            [
                4851,
                4963
            ],
            [
                4963,
                5196
            ],
            [
                5196,
                5293
            ],
            [
                5293,
                5497
            ],
            [
                5497,
                5596
            ],
            [
                5596,
                5675
            ],
            [
                5675,
                5879
            ],
            [
                5879,
                5986
            ],
            [
                5986,
                6126
            ],
            [
                6126,
                6559
            ],
            [
                6559,
                6842
            ],
            [
                6842,
                6920
            ],
            [
                6920,
                6939
            ],
            [
                6939,
                6959
            ],
            [
                6959,
                7188
            ],
            [
                7188,
                7282
            ],
            [
                7282,
                7341
            ],
            [
                7341,
                7614
            ],
            [
                7614,
                7668
            ],
            [
                7668,
                7819
            ],
            [
                7819,
                8125
            ],
            [
                8125,
                8193
            ],
            [
                8193,
                8295
            ],
            [
                8295,
                8472
            ],
            [
                8472,
                8779
            ],
            [
                8779,
                8945
            ],
            [
                8945,
                9070
            ],
            [
                9070,
                9197
            ],
            [
                9197,
                9465
            ],
            [
                9465,
                9753
            ],
            [
                9753,
                9852
            ],
            [
                9852,
                10056
            ],
            [
                10056,
                10081
            ],
            [
                10081,
                10121
            ],
            [
                10121,
                10136
            ],
            [
                10136,
                10251
            ],
            [
                10251,
                10380
            ],
            [
                10380,
                10469
            ],
            [
                10469,
                10487
            ],
            [
                10487,
                10583
            ],
            [
                10583,
                10835
            ],
            [
                10835,
                10911
            ],
            [
                10911,
                10926
            ],
            [
                10926,
                11012
            ],
            [
                11012,
                11039
            ],
            [
                11039,
                11062
            ],
            [
                11062,
                11120
            ],
            [
                11120,
                11273
            ],
            [
                11273,
                11505
            ],
            [
                11505,
                11775
            ],
            [
                11775,
                11966
            ],
            [
                11966,
                11981
            ],
            [
                11981,
                11996
            ],
            [
                11996,
                12527
            ],
            [
                12527,
                12662
            ],
            [
                12662,
                12877
            ],
            [
                12877,
                12931
            ],
            [
                12931,
                12996
            ],
            [
                12996,
                13008
            ],
            [
                13008,
                13090
            ],
            [
                13090,
                13108
            ],
            [
                13108,
                13129
            ],
            [
                13129,
                13197
            ],
            [
                13197,
                13323
            ],
            [
                13323,
                13442
            ],
            [
                13442,
                13477
            ],
            [
                13477,
                13581
            ],
            [
                13581,
                13602
            ],
            [
                13602,
                13626
            ],
            [
                13626,
                13715
            ],
            [
                13715,
                14275
            ],
            [
                14275,
                14439
            ],
            [
                14439,
                14541
            ],
            [
                14541,
                14597
            ],
            [
                14597,
                14621
            ],
            [
                14621,
                14671
            ],
            [
                14671,
                14729
            ],
            [
                14729,
                14810
            ],
            [
                14810,
                14908
            ],
            [
                14908,
                15105
            ],
            [
                15105,
                15448
            ],
            [
                15448,
                15570
            ],
            [
                15570,
                15648
            ],
            [
                15648,
                15702
            ],
            [
                15702,
                15823
            ],
            [
                15823,
                15874
            ],
            [
                15874,
                15997
            ],
            [
                15997,
                16090
            ],
            [
                16090,
                16144
            ],
            [
                16144,
                16221
            ],
            [
                16221,
                16269
            ],
            [
                16269,
                16429
            ],
            [
                16429,
                16531
            ],
            [
                16531,
                16582
            ],
            [
                16582,
                16644
            ],
            [
                16644,
                16715
            ],
            [
                16715,
                16827
            ],
            [
                16827,
                16845
            ],
            [
                16845,
                16874
            ],
            [
                16874,
                16904
            ],
            [
                16904,
                16952
            ],
            [
                16952,
                16975
            ],
            [
                16975,
                17001
            ],
            [
                17001,
                17070
            ],
            [
                17070,
                17114
            ],
            [
                17114,
                17155
            ],
            [
                17155,
                17192
            ],
            [
                17192,
                17204
            ],
            [
                17204,
                17208
            ],
            [
                17208,
                17276
            ],
            [
                17276,
                17319
            ],
            [
                17319,
                17352
            ],
            [
                17352,
                17368
            ],
            [
                17368,
                17633
            ],
            [
                17633,
                17734
            ],
            [
                17734,
                17801
            ],
            [
                17801,
                17876
            ],
            [
                17876,
                17933
            ],
            [
                17933,
                17960
            ],
            [
                17960,
                17989
            ],
            [
                17989,
                18021
            ],
            [
                18021,
                18035
            ],
            [
                18035,
                18075
            ],
            [
                18075,
                18109
            ],
            [
                18109,
                18124
            ],
            [
                18124,
                18229
            ],
            [
                18229,
                18279
            ],
            [
                18279,
                18316
            ],
            [
                18316,
                18354
            ],
            [
                18354,
                18451
            ],
            [
                18451,
                18624
            ],
            [
                18624,
                18986
            ],
            [
                18986,
                18992
            ],
            [
                18992,
                19014
            ],
            [
                19014,
                19088
            ],
            [
                19088,
                19147
            ],
            [
                19147,
                19170
            ],
            [
                19170,
                19242
            ],
            [
                19242,
                19263
            ],
            [
                19263,
                19275
            ],
            [
                19275,
                19303
            ],
            [
                19303,
                19330
            ],
            [
                19330,
                19350
            ],
            [
                19350,
                19402
            ],
            [
                19402,
                19470
            ],
            [
                19470,
                19577
            ],
            [
                19577,
                19654
            ],
            [
                19654,
                19673
            ],
            [
                19673,
                19718
            ],
            [
                19718,
                19732
            ],
            [
                19732,
                19800
            ],
            [
                19800,
                19811
            ],
            [
                19811,
                19828
            ],
            [
                19828,
                20184
            ],
            [
                20184,
                20223
            ],
            [
                20223,
                20331
            ],
            [
                20331,
                20403
            ],
            [
                20403,
                20513
            ],
            [
                20513,
                20537
            ],
            [
                20537,
                20597
            ],
            [
                20597,
                20703
            ],
            [
                20703,
                20753
            ],
            [
                20753,
                20784
            ],
            [
                20784,
                20920
            ],
            [
                20920,
                21063
            ],
            [
                21063,
                21286
            ],
            [
                21286,
                21393
            ],
            [
                21393,
                21429
            ],
            [
                21429,
                21540
            ],
            [
                21540,
                21648
            ],
            [
                21648,
                21657
            ],
            [
                21657,
                21691
            ],
            [
                21691,
                21880
            ],
            [
                21880,
                21888
            ],
            [
                21888,
                21920
            ],
            [
                21920,
                21927
            ],
            [
                21927,
                21961
            ],
            [
                21961,
                21988
            ],
            [
                21988,
                22116
            ],
            [
                22116,
                22165
            ],
            [
                22165,
                22174
            ],
            [
                22174,
                22217
            ],
            [
                22217,
                22248
            ],
            [
                22248,
                22253
            ],
            [
                22253,
                22276
            ],
            [
                22276,
                22421
            ],
            [
                22421,
                22491
            ],
            [
                22491,
                22512
            ],
            [
                22512,
                22545
            ],
            [
                22545,
                22579
            ],
            [
                22579,
                22629
            ],
            [
                22629,
                22715
            ],
            [
                22715,
                22783
            ],
            [
                22783,
                22956
            ],
            [
                22956,
                23075
            ],
            [
                23075,
                23253
            ],
            [
                23253,
                23388
            ],
            [
                23388,
                23486
            ],
            [
                23486,
                23629
            ],
            [
                23629,
                23713
            ],
            [
                23713,
                23784
            ],
            [
                23784,
                23856
            ],
            [
                23856,
                24001
            ],
            [
                24001,
                24206
            ],
            [
                24206,
                24331
            ],
            [
                24331,
                24366
            ],
            [
                24366,
                24553
            ],
            [
                24553,
                24827
            ],
            [
                24827,
                24846
            ],
            [
                24846,
                24899
            ],
            [
                24899,
                24983
            ],
            [
                24983,
                25100
            ],
            [
                25100,
                25228
            ],
            [
                25228,
                25345
            ],
            [
                25345,
                25549
            ],
            [
                25549,
                25625
            ],
            [
                25625,
                25789
            ],
            [
                25789,
                26167
            ]
        ]
    },
    "abridged": {
        "text": "England has been in a dreadful state for some weeks. The Prime Minister Lord Coodle has gone out, Sir Thomas Doodle won't come in, and there being nobody in Great Britain (to speak of) except Coodle and Doodle, there has been no government. It is amazing that England has not appeared to care very much about it, but has gone on eating and drinking just the same as ever.\nAt last Sir Thomas Doodle has not only condescended to come in, but has done it handsomely, bringing with him all his nephews, his male cousins, and his brothers-in-law. So there is hope for the old ship yet. Doodle has found that he must throw himself upon the country, and campaign, chiefly in the form of sovereigns and beer. The London season comes to a sudden end, through all the Doodleites and Coodleites dispersing to assist in those exercises.\nHence Mrs. Rouncewell, housekeeper at Chesney Wold, foresees that the family may shortly be expected, together with a pretty large party of cousins and others who can in any way assist the great Constitutional work. And hence the stately old dame proceeds up and down the staircases, and along the galleries and passages, and through the rooms, to witness that everything is ready, floors rubbed bright, carpets spread, curtains shaken out, beds puffed, and kitchen cleared for action.\nThis summer evening, the preparations are complete. Dreary and solemn the old house looks, with no inhabitants except the pictured forms upon the walls. Through some of the fiery windows, which are beautiful from outside, and set, at this sunset hour, not in dull-grey stone but in a glorious house of gold, the light pours in, rich, lavish, overflowing. Then do the frozen Dedlocks thaw. Strange movements come upon their features as the shadows of leaves play there.\nBut the fire of the sun is dying. Shadow slowly mounts the walls, bringing the Dedlocks down like age and death. And now, upon my Lady's picture over the great chimney-piece, a weird shade falls from some old tree, as if a great arm held a veil or hood, watching an opportunity to draw it over her. Higher and darker rises the shadow on the wall - now a red gloom on the ceiling - now the fire is out.\nLight mists arise, and the dew falls, and the sweet garden scents are heavy in the air. Now the woods settle into great masses as if they were each one profound tree. And now the moon rises to separate them, and to glimmer here and there in horizontal lines behind their stems, and to make the avenue a pavement of light among high cathedral arches fantastically broken.\nNow the moon is high; and the great house is like a body without life. Now is the time for shadow, when every corner is a cavern and every downward step a pit, when the stained glass is reflected in pale and faded hues upon the floors, when the armour has dull lights upon it not easily to be distinguished from stealthy movement, and when barred helmets are frightfully suggestive of heads inside. But of all the shadows in Chesney Wold, the shadow in the long drawing-room upon my Lady's picture is the first to come, its threatening hands raised up and menacing the handsome face.\n\"She is not well, ma'am,\" says a groom in Mrs. Rouncewell's room.\n\"My Lady not well! What's the matter?\"\n\"Why, my Lady has been poorly, ma'am, since she was last here, and has kept her room a good deal.\"\n\"Chesney Wold, Thomas,\" rejoins the housekeeper with proud complacency, \"will set my Lady up! There is no finer air in the world!\"\nThomas may have his own personal opinions on this subject, but he forbears to express them and retires to the servants' hall. This groom is the pilot-fish before the nobler shark. Next evening, down come Sir Leicester and my Lady with their retinue, and down come the cousins and others from all the points of the compass. Thenceforth for some weeks backward and forward rush mysterious men with no names, who fly about all those parts of the country on which Doodle is at present throwing himself.\nOn these national occasions Sir Leicester finds the cousins useful. A better man than the Honourable Bob Stables to meet the Hunt at dinner, there could not possibly be. Better got-up gentlemen than the other cousins, to ride over to polling-booths and hustings, it would be hard to find. Volumnia is a little dim, but she is of the true descent; and there are many who appreciate her sprightly conversation, her French conundrums so old as to have become in the cycles of time almost new again. On these national occasions dancing may be a patriotic service, and Volumnia is constantly seen hopping about for the good of an ungrateful country.\nMy Lady takes no great pains to entertain the numerous guests, and being still unwell, rarely appears until late in the day. But at all the dismal dinners, leaden lunches, basilisk balls, and other melancholy pageants, her mere appearance is a relief. As to Sir Leicester, he is in a state of sublime satisfaction; he moves among the company, a magnificent refrigerator.\nDaily the cousins trot away to hustings and polling-booths, and daily bring back reports on which Sir Leicester holds forth after dinner. Daily the restless men who have no occupation in life appear to be rather busy. Daily Volumnia has a little cousinly talk with Sir Leicester on the state of the nation, from which Sir Leicester concludes that Volumnia is a more reflecting woman than he had thought her.\n\"How are we getting on?\" says Miss Volumnia, clasping her hands. \"Are we safe?\"\nThe mighty business is nearly over by this time. Sir Leicester has just appeared in the long drawing-room after dinner, a bright star surrounded by clouds of cousins.\n\"Volumnia,\" replies Sir Leicester, who has a list in his hand, \"we are doing tolerably.\"\n\"Only tolerably! At least there is no opposition to you,\" Volumnia asserts with confidence.\n\"No, Volumnia. This distracted country has lost its senses in many respects, I grieve to say, but-\"\n\"It is not so mad as that. I am glad to hear it!\"\nOn Volumnia's finishing the sentence, Sir Leicester graciously inclines his head. He seems to say to himself, \"A sensible woman this.\"\nIn fact, as to this question of opposition, Sir Leicester always delivers his own candidateship as a kind of handsome wholesale order to be promptly executed. Two other little seats that belong to him he treats as retail orders of less importance, merely sending down two men and signifying to the tradespeople, \"You will have the goodness to make these materials into two Members of Parliament and to send them home when done.\"\n\"I regret to say, Volumnia, that in many places the people have shown a bad spirit, and that this opposition to the government has been most determined.\"\n\"W-r-retches!\" says Volumnia.\n\"In many places I am shocked to have to inform you that the party has not triumphed without being put to an enormous expense,\" says Sir Leicester, with swelling indignation. \"Hundreds of thousands of pounds!\"\nIf Volumnia has a fault, it is the fault of being a trifle too innocent for her age. Impelled by innocence, she asks, \"What for?\"\n\"Volumnia,\" remonstrates Sir Leicester, with his utmost severity.\n\"No, no, I don't mean what for,\" cries Volumnia with her favourite little scream. \"How stupid I am! I mean what a pity!\" And she hastens to express her opinion that the shocking people ought to be tried as traitors and made to support the party.\n\"I am glad, Volumnia,\" says Sir Leicester, \"that you do mean 'what a pity'. But as you asked me 'what for?' let me reply. For necessary expenses. And I trust to your good sense, Volumnia, not to pursue the subject, here or elsewhere.\"\nSir Leicester feels it necessary to crush Volumnia's enquiry because it is whispered abroad that these necessary expenses will, in some cases, be unpleasantly connected with the word bribery.\n\"I suppose,\" observes Volumnia, having taken a little time to recover her spirits, \"I suppose Mr. Tulkinghorn has been worked to death.\"\n\"I don't know why he should be,\" says Sir Leicester. \"He is not a candidate.\"\nLady Dedlock, seated at an open window and looking out at the evening shadows, seems to attend since the lawyer's name was mentioned.\nA languid cousin with a moustache in a state of extreme debility now observes from his couch that man told him ya'sdy that Tulkinghorn had gone down t' that iron place t' give legal 'pinion 'bout something, and 'twould be highly jawlly thing if Tulkinghorn should bring news that Coodle man was floored.\nA footman with coffee informs Sir Leicester that Mr. Tulkinghorn has arrived and is taking dinner. My Lady turns her head, then looks out again as before.\nVolumnia is charmed to hear that her delight is come. He is so original, such a stolid creature, knowing all sorts of things and never telling them! Volumnia is sure he must be a Freemason. These lively remarks the fair Dedlock delivers in her youthful manner.\n\"He has not been here once,\" she adds, \"since I came. I really had some thoughts of breaking my heart for the inconstant creature. I had almost made up my mind that he was dead.\"\nIt may be the gathering gloom of evening, but a shade is on my Lady's face, as if she thought, \"I wish he were!\"\n\"Mr. Tulkinghorn,\" says Sir Leicester, \"is always welcome here and always discreet. A very valuable person.\"\nThe debilitated cousin supposes he is \"'normously rich.\"\n\"He is, of course, handsomely paid,\" says Sir Leicester, \"and he associates almost on a footing of equality with the highest society.\"\nEverybody starts. For a gun is fired close by.\n\"Good gracious, what's that?\" cries Volumnia with her little withered scream.\n\"A rat,\" says my Lady. \"And they have shot him.\"\nEnter Mr. Tulkinghorn.\n\"Tulkinghorn,\" says Sir Leicester. \"How do you do?\"\nMr. Tulkinghorn with his usual leisurely ease advances, bows to my Lady, shakes Sir Leicester's hand, and subsides into the chair opposite the Baronet's newspaper-table. Sir Leicester fears that my Lady, not being very well, will take cold at that open window. My Lady is obliged to him, but would rather sit there for the air. Sir Leicester rises, adjusts her scarf about her, and returns to his seat.\n\"Now,\" says Sir Leicester. \"How has that contest gone?\"\n\"Oh, hollow from the beginning. Not a chance. They have brought in both their people. You are beaten out of all reason. Three to one.\"\nIt is a part of Mr. Tulkinghorn's mastery to have no political opinions; indeed, no opinions at all. Therefore he says \"you\" are beaten, and not \"we.\"\nSir Leicester is majestically angry. Volumnia never heard of such a thing.\n\"It's the place, you know,\" Mr. Tulkinghorn goes on, \"where they wanted to put up Mrs. Rouncewell's son.\"\n\"A proposal which, as you informed me at the time, he had the becoming taste to decline,\" observes Sir Leicester, \"I cannot say that I approve of the sentiments expressed by Mr. Rouncewell when he was here, but there was a propriety in his decision which I am glad to acknowledge.\"\n\"Ha!\" says Mr. Tulkinghorn. \"It did not prevent him from being very active in this election, though.\"\nSir Leicester is distinctly heard to gasp. \"Did I understand you? Did you say that Mr. Rouncewell had been very active in this election?\"\n\"Uncommonly active.\"\n\"Against-\"\n\"Oh, dear yes, against you. He is a very good speaker. Plain and emphatic. He made a damaging effect, and has great influence.\"\nSir Leicester is staring majestically.\n\"And he was much assisted,\" says Mr. Tulkinghorn, \"by his son.\"\n\"The son who wished to marry the young woman in my Lady's service?\"\n\"That son. He has but one.\"\n\"Then upon my honour,\" says Sir Leicester after a terrific pause, \"upon my life, the floodgates of society are burst open, and the waters have - ah - obliterated the landmarks of the framework of the cohesion by which things are held together!\"\nGeneral burst of cousinly indignation. Volumnia thinks it is really high time, you know, for somebody in power to step in and do something strong. Debilitated cousin thinks - country's going - Dayvil.\n\"I beg,\" says Sir Leicester, breathless, \"that we may not comment further on this circumstance. My Lady, let me suggest in reference to that young woman-\"\n\"I have no intention,\" observes my Lady from her window, \"of parting with her.\"\n\"That was not my meaning,\" returns Sir Leicester. \"I am glad to hear you say so. I would suggest that as you think her worthy of your patronage, you should exert your influence to keep her from these dangerous hands. You might point out to her that she probably would, in good time, find a husband at Chesney Wold.\"\nThese remarks he offers with his unvarying politeness and deference to his wife. She merely moves her head in reply. The moon is rising, and where she sits there is a little stream of cold pale light, in which her head is seen.\n\"It is worthy of remark,\" says Mr. Tulkinghorn, \"that these people are, in their way, very proud.\"\n\"Proud?\" Sir Leicester doubts his hearing.\n\"I should not be surprised if they abandoned the girl instead of her abandoning them, supposing she remained at Chesney Wold.\"\n\"Well!\" says Sir Leicester tremulously. \"You should know, Mr. Tulkinghorn. You have been among them.\"\n\"Why, Sir Leicester,\" returns the lawyer, \"I could tell you a story - with Lady Dedlock's permission.\"\nShe nods, and Volumnia is enchanted. A story! Oh, a ghost in it, Volumnia hopes?\n\"No. Real flesh and blood, Miss Dedlock,\" says the lawyer. \"Sir Leicester, these details have only lately become known to me. They exemplify what I have said. I suppress names for the present. Lady Dedlock will not think me ill-bred, I hope?\"\nBy the light of the low fire, he can be seen looking towards the moonlight. By the light of the moon Lady Dedlock can be seen, perfectly still.\n\"A townsman of this Mrs. Rouncewell, a man in exactly parallel circumstances, had the good fortune to have a daughter who attracted the notice of a great lady. I speak of really a great lady, married to a gentleman of your position, Sir Leicester.\"\nSir Leicester condescendingly says, \"Yes, Mr. Tulkinghorn,\" implying that then she must have appeared very considerable indeed in the eyes of an iron-master.\n\"The lady was wealthy and beautiful, and had a liking for the girl, and treated her with great kindness, and kept her always near her. Now this lady preserved a secret under all her greatness, which she had kept for many years. In fact, she had in early life been engaged to marry a young rake - a captain in the army who came to no good. She never did marry him, but she gave birth to a child of which he was the father.\"\nBy the light of the fire he can be seen looking towards the moonlight. By the moonlight, Lady Dedlock can be seen in profile, perfectly still.\n\"The captain being dead, she believed herself safe; but a train of circumstances with which I need not trouble you led to discovery. As I heard it, they began in an imprudence on her own part one day when she was taken by surprise. There was great domestic trouble and amazement, you may suppose; I leave you to imagine, Sir Leicester, the husband's grief. But that is not the point. When Mr. Rouncewell's townsman heard of the disclosure, he no longer allowed the girl to be patronized and honoured by the lady. Such was his pride, that he indignantly took her away, as if from reproach and disgrace; as if the lady had been the commonest of commoners. That is the story. I hope Lady Dedlock will excuse its painful nature.\"\nVolumnia cannot believe there ever was any such lady and rejects the whole history. Sir Leicester thinks of Wat Tyler and the Peasants' Revolt.\nThere is not much conversation in all, for it is late. Sir Leicester begs Mr. Tulkinghorn to ring for candles. The stream of moonlight has swelled into a lake, and then Lady Dedlock for the first time moves, and rises, coming forward to a table for a glass of water. Cousins, bat-like in the candle glare, crowd round to give it; Lady Dedlock, graceful, self-possessed, looked at by admiring eyes, passes slowly out of the long room.",
        "paragraph_chars": [
            [
                0,
                372
            ],
            [
                372,
                825
            ],
            [
                825,
                1311
            ],
            [
                1311,
                1780
            ],
            [
                1780,
                2182
            ],
            [
                2182,
                2553
            ],
            [
                2553,
                3137
            ],
            [
                3137,
                3203
            ],
            [
                3203,
                3242
            ],
            [
                3242,
                3341
            ],
            [
                3341,
                3472
            ],
            [
                3472,
                3971
            ],
            [
                3971,
                4616
            ],
            [
                4616,
                4987
            ],
            [
                4987,
                5395
            ],
            [
                5395,
                5475
            ],
            [
                5475,
                5642
            ],
            [
                5642,
                5731
            ],
            [
                5731,
                5823
            ],
            [
                5823,
                5923
            ],
            [
                5923,
                5973
            ],
            [
                5973,
                6108
            ],
            [
                6108,
                6537
            ],
            [
                6537,
                6691
            ],
            [
                6691,
                6721
            ],
            [
                6721,
                6930
            ],
            [
                6930,
                7060
            ],
            [
                7060,
                7126
            ],
            [
                7126,
                7372
            ],
            [
                7372,
                7607
            ],
            [
                7607,
                7799
            ],
            [
                7799,
                7936
            ],
            [
                7936,
                8014
            ],
            [
                8014,
                8148
            ],
            [
                8148,
                8452
            ],
            [
                8452,
                8607
            ],
            [
                8607,
                8868
            ],
            [
                8868,
                9047
            ],
            [
                9047,
                9160
            ],
            [
                9160,
                9269
            ],
            [
                9269,
                9326
            ],
            [
                9326,
                9461
            ],
            [
                9461,
                9508
            ],
            [
                9508,
                9586
            ],
            [
                9586,
                9635
            ],
            [
                9635,
                9658
            ],
            [
                9658,
                9710
            ],
            [
                9710,
                10113
            ],
            [
                10113,
                10169
            ],
            [
                10169,
                10304
            ],
            [
                10304,
                10455
            ],
            [
                10455,
                10530
            ],
            [
                10530,
                10636
            ],
            [
                10636,
                10918
            ],
            [
                10918,
                11020
            ],
            [
                11020,
                11158
            ],
            [
                11158,
                11179
            ],
            [
                11179,
                11190
            ],
            [
                11190,
                11318
            ],
            [
                11318,
                11357
            ],
            [
                11357,
                11421
            ],
            [
                11421,
                11489
            ],
            [
                11489,
                11517
            ],
            [
                11517,
                11762
            ],
            [
                11762,
                11963
            ],
            [
                11963,
                12118
            ],
            [
                12118,
                12198
            ],
            [
                12198,
                12514
            ],
            [
                12514,
                12742
            ],
            [
                12742,
                12841
            ],
            [
                12841,
                12884
            ],
            [
                12884,
                13011
            ],
            [
                13011,
                13113
            ],
            [
                13113,
                13216
            ],
            [
                13216,
                13297
            ],
            [
                13297,
                13540
            ],
            [
                13540,
                13684
            ],
            [
                13684,
                13933
            ],
            [
                13933,
                14091
            ],
            [
                14091,
                14514
            ],
            [
                14514,
                14657
            ],
            [
                14657,
                15383
            ],
            [
                15383,
                15527
            ],
            [
                15527,
                15960
            ]
        ],
        "segment_chars": [
            [
                0,
                53
            ],
            [
                53,
                241
            ],
            [
                241,
                372
            ],
            [
                372,
                542
            ],
            [
                542,
                581
            ],
            [
                581,
                701
            ],
            [
                701,
                825
            ],
            [
                825,
                1041
            ],
            [
                1041,
                1311
            ],
            [
                1311,
                1363
            ],
            [
                1363,
                1464
            ],
            [
                1464,
                1666
            ],
            [
                1666,
                1700
            ],
            [
                1700,
                1780
            ],
            [
                1780,
                1814
            ],
            [
                1814,
                1893
            ],
            [
                1893,
                2079
            ],
            [
                2079,
                2182
            ],
            [
                2182,
                2270
            ],
            [
                2270,
                2349
            ],
            [
                2349,
                2553
            ],
            [
                2553,
                2624
            ],
            [
                2624,
                2952
            ],
            [
                2952,
                3137
            ],
            [
                3137,
                3203
            ],
            [
                3203,
                3222
            ],
            [
                3222,
                3242
            ],
            [
                3242,
                3341
            ],
            [
                3341,
                3435
            ],
            [
                3435,
                3472
            ],
            [
                3472,
                3598
            ],
            [
                3598,
                3652
            ],
            [
                3652,
                3795
            ],
            [
                3795,
                3971
            ],
            [
                3971,
                4039
            ],
            [
                4039,
                4141
            ],
            [
                4141,
                4260
            ],
            [
                4260,
                4467
            ],
            [
                4467,
                4616
            ],
            [
                4616,
                4741
            ],
            [
                4741,
                4868
            ],
            [
                4868,
                4987
            ],
            [
                4987,
                5125
            ],
            [
                5125,
                5205
            ],
            [
                5205,
                5395
            ],
            [
                5395,
                5420
            ],
            [
                5420,
                5460
            ],
            [
                5460,
                5475
            ],
            [
                5475,
                5524
            ],
            [
                5524,
                5642
            ],
            [
                5642,
                5731
            ],
            [
                5731,
                5748
            ],
            [
                5748,
                5823
            ],
            [
                5823,
                5838
            ],
            [
                5838,
                5923
            ],
            [
                5923,
                5950
            ],
            [
                5950,
                5973
            ],
            [
                5973,
                6055
            ],
            [
                6055,
                6108
            ],
            [
                6108,
                6267
            ],
            [
                6267,
                6537
            ],
            [
                6537,
                6691
            ],
            [
                6691,
                6706
            ],
            [
                6706,
                6721
            ],
            [
                6721,
                6895
            ],
            [
                6895,
                6930
            ],
            [
                6930,
                7015
            ],
            [
                7015,
                7060
            ],
            [
                7060,
                7126
            ],
            [
                7126,
                7208
            ],
            [
                7208,
                7226
            ],
            [
                7226,
                7247
            ],
            [
                7247,
                7372
            ],
            [
                7372,
                7448
            ],
            [
                7448,
                7480
            ],
            [
                7480,
                7494
            ],
            [
                7494,
                7518
            ],
            [
                7518,
                7607
            ],
            [
                7607,
                7799
            ],
            [
                7799,
                7936
            ],
            [
                7936,
                7989
            ],
            [
                7989,
                8014
            ],
            [
                8014,
                8148
            ],
            [
                8148,
                8452
            ],
            [
                8452,
                8551
            ],
            [
                8551,
                8607
            ],
            [
                8607,
                8661
            ],
            [
                8661,
                8756
            ],
            [
                8756,
                8797
            ],
            [
                8797,
                8868
            ],
            [
                8868,
                8922
            ],
            [
                8922,
                8999
            ],
            [
                8999,
                9047
            ],
            [
                9047,
                9160
            ],
            [
                9160,
                9244
            ],
            [
                9244,
                9269
            ],
            [
                9269,
                9326
            ],
            [
                9326,
                9461
            ],
            [
                9461,
                9479
            ],
            [
                9479,
                9508
            ],
            [
                9508,
                9538
            ],
            [
                9538,
                9586
            ],
            [
                9586,
                9609
            ],
            [
                9609,
                9635
            ],
            [
                9635,
                9658
            ],
            [
                9658,
                9693
            ],
            [
                9693,
                9710
            ],
            [
                9710,
                9880
            ],
            [
                9880,
                9971
            ],
            [
                9971,
                10038
            ],
            [
                10038,
                10113
            ],
            [
                10113,
                10140
            ],
            [
                10140,
                10169
            ],
            [
                10169,
                10201
            ],
            [
                10201,
                10215
            ],
            [
                10215,
                10255
            ],
            [
                10255,
                10289
            ],
            [
                10289,
                10304
            ],
            [
                10304,
                10405
            ],
            [
                10405,
                10455
            ],
            [
                10455,
                10492
            ],
            [
                10492,
                10530
            ],
            [
                10530,
                10636
            ],
            [
                10636,
                10918
            ],
            [
                10918,
                10924
            ],
            [
                10924,
                10946
            ],
            [
                10946,
                11020
            ],
            [
                11020,
                11063
            ],
            [
                11063,
                11086
            ],
            [
                11086,
                11158
            ],
            [
                11158,
                11179
            ],
            [
                11179,
                11190
            ],
            [
                11190,
                11218
            ],
            [
                11218,
                11245
            ],
            [
                11245,
                11265
            ],
            [
                11265,
                11318
            ],
            [
                11318,
                11357
            ],
            [
                11357,
                11421
            ],
            [
                11421,
                11489
            ],
            [
                11489,
                11500
            ],
            [
                11500,
                11517
            ],
            [
                11517,
                11762
            ],
            [
                11762,
                11801
            ],
            [
                11801,
                11909
            ],
            [
                11909,
                11963
            ],
            [
                11963,
                12059
            ],
            [
                12059,
                12118
            ],
            [
                12118,
                12198
            ],
            [
                12198,
                12248
            ],
            [
                12248,
                12279
            ],
            [
                12279,
                12415
            ],
            [
                12415,
                12514
            ],
            [
                12514,
                12595
            ],
            [
                12595,
                12631
            ],
            [
                12631,
                12742
            ],
            [
                12742,
                12841
            ],
            [
                12841,
                12850
            ],
            [
                12850,
                12884
            ],
            [
                12884,
                13011
            ],
            [
                13011,
                13019
            ],
            [
                13019,
                13051
            ],
            [
                13051,
                13086
            ],
            [
                13086,
                13113
            ],
            [
                13113,
                13216
            ],
            [
                13216,
                13253
            ],
            [
                13253,
                13262
            ],
            [
                13262,
                13297
            ],
            [
                13297,
                13302
            ],
            [
                13302,
                13356
            ],
            [
                13356,
                13423
            ],
            [
                13423,
                13456
            ],
            [
                13456,
                13490
            ],
            [
                13490,
                13540
            ],
            [
                13540,
                13616
            ],
            [
                13616,
                13684
            ],
            [
                13684,
                13844
            ],
            [
                13844,
                13933
            ],
            [
                13933,
                14091
            ],
            [
                14091,
                14226
            ],
            [
                14226,
                14319
            ],
            [
                14319,
                14430
            ],
            [
                14430,
                14514
            ],
            [
                14514,
                14585
            ],
            [
                14585,
                14657
            ],
            [
                14657,
                14790
            ],
            [
                14790,
                14889
            ],
            [
                14889,
                15014
            ],
            [
                15014,
                15041
            ],
            [
                15041,
                15170
            ],
            [
                15170,
                15311
            ],
            [
                15311,
                15330
            ],
            [
                15330,
                15383
            ],
            [
                15383,
                15467
            ],
            [
                15467,
                15527
            ],
            [
                15527,
                15582
            ],
            [
                15582,
                15638
            ],
            [
                15638,
                15794
            ],
            [
                15794,
                15960
            ]
        ],
        "overlap_chars": [
            [
                0,
                53
            ],
            [
                72,
                83
            ],
            [
                93,
                115
            ],
            [
                119,
                241
            ],
            [
                241,
                243
            ],
            [
                244,
                246
            ],
            [
                255,
                348
            ],
            [
                354,
                357
            ],
            [
                363,
                365
            ],
            [
                370,
                371
            ],
            [
                372,
                472
            ],
            [
                473,
                498
            ],
            [
                499,
                520
            ],
            [
                521,
                542
            ],
            [
                542,
                580
            ],
            [
                581,
                642
            ],
            [
                657,
                701
            ],
            [
                701,
                804
            ],
            [
                805,
                813
            ],
            [
                814,
                825
            ],
            [
                825,
                885
            ],
            [
                886,
                955
            ],
            [
                962,
                1041
            ],
            [
                1041,
                1071
            ],
            [
                1081,
                1180
            ],
            [
                1181,
                1206
            ],
            [
                1207,
                1213
            ],
            [
                1214,
                1277
            ],
            [
                1277,
                1278
            ],
            [
                1279,
                1309
            ],
            [
                1309,
                1311
            ],
            [
                1311,
                1315
            ],
            [
                1316,
                1330
            ],
            [
                1330,
                1363
            ],
            [
                1363,
                1401
            ],
            [
                1402,
                1464
            ],
            [
                1464,
                1497
            ],
            [
                1509,
                1523
            ],
            [
                1531,
                1628
            ],
            [
                1629,
                1637
            ],
            [
                1639,
                1664
            ],
            [
                1664,
                1666
            ],
            [
                1666,
                1700
            ],
            [
                1700,
                1779
            ],
            [
                1780,
                1814
            ],
            [
                1814,
                1893
            ],
            [
                1893,
                1994
            ],
            [
                1995,
                2079
            ],
            [
                2079,
                2102
            ],
            [
                2107,
                2125
            ],
            [
                2128,
                2158
            ],
            [
                2161,
                2182
            ],
            [
                2182,
                2223
            ],
            [
                2224,
                2233
            ],
            [
                2234,
                2240
            ],
            [
                2241,
                2247
            ],
            [
                2248,
                2270
            ],
            [
                2270,
                2349
            ],
            [
                2349,
                2553
            ],
            [
                2553,
                2594
            ],
            [
                2595,
                2624
            ],
            [
                2624,
                2793
            ],
            [
                2794,
                2952
            ],
            [
                2952,
                3072
            ],
            [
                3077,
                3135
            ],
            [
                3135,
                3137
            ],
            [
                3137,
                3196
            ],
            [
                3201,
                3203
            ],
            [
                3203,
                3222
            ],
            [
                3222,
                3242
            ],
            [
                3242,
                3264
            ],
            [
                3265,
                3303
            ],
            [
                3303,
                3341
            ],
            [
                3341,
                3435
            ],
            [
                3435,
                3456
            ],
            [
                3457,
                3472
            ],
            [
                3472,
                3530
            ],
            [
                3531,
                3562
            ],
            [
                3563,
                3596
            ],
            [
                3596,
                3597
            ],
            [
                3598,
                3652
            ],
            [
                3652,
                3712
            ],
            [
                3713,
                3795
            ],
            [
                3795,
                3901
            ],
            [
                3902,
                3969
            ],
            [
                3969,
                3971
            ],
            [
                3971,
                4039
            ],
            [
                4039,
                4141
            ],
            [
                4141,
                4151
            ],
            [
                4152,
                4187
            ],
            [
                4187,
                4188
            ],
            [
                4189,
                4232
            ],
            [
                4232,
                4260
            ],
            [
                4260,
                4465
            ],
            [
                4465,
                4467
            ],
            [
                4467,
                4606
            ],
            [
                4607,
                4616
            ],
            [
                4616,
                4741
            ],
            [
                4741,
                4868
            ],
            [
                4868,
                4891
            ],
            [
                4895,
                4929
            ],
            [
                4929,
                4930
            ],
            [
                4931,
                4987
            ],
            [
                4987,
                5009
            ],
            [
                5010,
                5045
            ],
            [
                5045,
                5046
            ],
            [
                5047,
                5125
            ],
            [
                5125,
                5178
            ],
            [
                5192,
                5205
            ],
            [
                5205,
                5318
            ],
            [
                5329,
                5395
            ],
            [
                5395,
                5420
            ],
            [
                5420,
                5460
            ],
            [
                5460,
                5475
            ],
            [
                5475,
                5522
            ],
            [
                5522,
                5524
            ],
            [
                5524,
                5603
            ],
            [
                5604,
                5642
            ],
            [
                5642,
                5731
            ],
            [
                5731,
                5746
            ],
            [
                5748,
                5823
            ],
            [
                5823,
                5838
            ],
            [
                5838,
                5920
            ],
            [
                5923,
                5950
            ],
            [
                5950,
                5973
            ],
            [
                5976,
                6009
            ],
            [
                6053,
                6055
            ],
            [
                6058,
                6105
            ],
            [
                6105,
                6108
            ],
            [
                6108,
                6151
            ],
            [
                6152,
                6165
            ],
            [
                6166,
                6172
            ],
            [
                6182,
                6203
            ],
            [
                6204,
                6267
            ],
            [
                6267,
                6375
            ],
            [
                6380,
                6537
            ],
            [
                6537,
                6672
            ],
            [
                6673,
                6688
            ],
            [
                6688,
                6691
            ],
            [
                6691,
                6706
            ],
            [
                6706,
                6721
            ],
            [
                6721,
                6722
            ],
            [
                6722,
                6729
            ],
            [
                6730,
                6736
            ],
            [
                6737,
                6749
            ],
            [
                6750,
                6752
            ],
            [
                6758,
                6845
            ],
            [
                6845,
                6847
            ],
            [
                6853,
                6867
            ],
            [
                6868,
                6872
            ],
            [
                6893,
                6895
            ],
            [
                6895,
                6930
            ],
            [
                6930,
                6941
            ],
            [
                6946,
                7001
            ],
            [
                7013,
                7015
            ],
            [
                7015,
                7060
            ],
            [
                7060,
                7098
            ],
            [
                7100,
                7125
            ],
            [
                7126,
                7208
            ],
            [
                7208,
                7226
            ],
            [
                7226,
                7246
            ],
            [
                7255,
                7372
            ],
            [
                7372,
                7394
            ],
            [
                7400,
                7413
            ],
            [
                7413,
                7432
            ],
            [
                7434,
                7445
            ],
            [
                7448,
                7458
            ],
            [
                7459,
                7480
            ],
            [
                7480,
                7492
            ],
            [
                7492,
                7494
            ],
            [
                7494,
                7518
            ],
            [
                7518,
                7607
            ],
            [
                7607,
                7629
            ],
            [
                7640,
                7642
            ],
            [
                7649,
                7657
            ],
            [
                7668,
                7742
            ],
            [
                7748,
                7797
            ],
            [
                7797,
                7799
            ],
            [
                7799,
                7880
            ],
            [
                7880,
                7936
            ],
            [
                7936,
                7949
            ],
            [
                7950,
                7953
            ],
            [
                7957,
                7966
            ],
            [
                7966,
                7987
            ],
            [
                7987,
                7989
            ],
            [
                7990,
                8014
            ],
            [
                8014,
                8052
            ],
            [
                8053,
                8091
            ],
            [
                8091,
                8092
            ],
            [
                8099,
                8148
            ],
            [
                8148,
                8261
            ],
            [
                8266,
                8358
            ],
            [
                8359,
                8411
            ],
            [
                8418,
                8452
            ],
            [
                8462,
                8495
            ],
            [
                8496,
                8551
            ],
            [
                8551,
                8573
            ],
            [
                8573,
                8607
            ],
            [
                8607,
                8661
            ],
            [
                8661,
                8703
            ],
            [
                8704,
                8756
            ],
            [
                8756,
                8767
            ],
            [
                8773,
                8797
            ],
            [
                8797,
                8866
            ],
            [
                8866,
                8868
            ],
            [
                8868,
                8922
            ],
            [
                8922,
                8999
            ],
            [
                8999,
                9047
            ],
            [
                9047,
                9087
            ],
            [
                9087,
                9144
            ],
            [
                9150,
                9160
            ],
            [
                9160,
                9242
            ],
            [
                9242,
                9244
            ],
            [
                9244,
                9266
            ],
            [
                9266,
                9269
            ],
            [
                9269,
                9323
            ],
            [
                9323,
                9326
            ],
            [
                9327,
                9360
            ],
            [
                9381,
                9382
            ],
            [
                9384,
                9461
            ],
            [
                9461,
                9479
            ],
            [
                9479,
                9508
            ],
            [
                9508,
                9538
            ],
            [
                9538,
                9586
            ],
            [
                9586,
                9609
            ],
            [
                9609,
                9635
            ],
            [
                9635,
                9656
            ],
            [
                9656,
                9658
            ],
            [
                9658,
                9670
            ],
            [
                9691,
                9693
            ],
            [
                9694,
                9710
            ],
            [
                9710,
                9765
            ],
            [
                9771,
                9839
            ],
            [
                9840,
                9848
            ],
            [
                9849,
                9862
            ],
            [
                9863,
                9880
            ],
            [
                9880,
                9893
            ],
            [
                9900,
                9971
            ],
            [
                9971,
                10038
            ],
            [
                10038,
                10112
            ],
            [
                10113,
                10140
            ],
            [
                10140,
                10169
            ],
            [
                10169,
                10201
            ],
            [
                10201,
                10215
            ],
            [
                10215,
                10255
            ],
            [
                10255,
                10289
            ],
            [
                10289,
                10304
            ],
            [
                10304,
                10337
            ],
            [
                10338,
                10396
            ],
            [
                10403,
                10405
            ],
            [
                10405,
                10455
            ],
            [
                10455,
                10484
            ],
            [
                10490,
                10492
            ],
            [
                10492,
                10529
            ],
            [
                10530,
                10581
            ],
            [
                10581,
                10636
            ],
            [
                10636,
                10661
            ],
            [
                10662,
                10712
            ],
            [
                10713,
                10723
            ],
            [
                10723,
                10751
            ],
            [
                10751,
                10770
            ],
            [
                10771,
                10841
            ],
            [
                10841,
                10858
            ],
            [
                10859,
                10918
            ],
            [
                10918,
                10924
            ],
            [
                10924,
                10946
            ],
            [
                10946,
                11020
            ],
            [
                11020,
                11061
            ],
            [
                11061,
                11063
            ],
            [
                11063,
                11086
            ],
            [
                11086,
                11158
            ],
            [
                11158,
                11179
            ],
            [
                11179,
                11187
            ],
            [
                11190,
                11218
            ],
            [
                11218,
                11245
            ],
            [
                11245,
                11265
            ],
            [
                11265,
                11315
            ],
            [
                11322,
                11357
            ],
            [
                11357,
                11405
            ],
            [
                11405,
                11421
            ],
            [
                11421,
                11489
            ],
            [
                11489,
                11500
            ],
            [
                11500,
                11517
            ],
            [
                11517,
                11581
            ],
            [
                11581,
                11584
            ],
            [
                11584,
                11596
            ],
            [
                11596,
                11659
            ],
            [
                11674,
                11762
            ],
            [
                11762,
                11801
            ],
            [
                11801,
                11909
            ],
            [
                11909,
                11934
            ],
            [
                11935,
                11936
            ],
            [
                11937,
                11952
            ],
            [
                11955,
                11958
            ],
            [
                11961,
                11963
            ],
            [
                11963,
                11990
            ],
            [
                11992,
                12002
            ],
            [
                12002,
                12059
            ],
            [
                12059,
                12115
            ],
            [
                12118,
                12173
            ],
            [
                12173,
                12198
            ],
            [
                12198,
                12248
            ],
            [
                12248,
                12279
            ],
            [
                12279,
                12415
            ],
            [
                12415,
                12511
            ],
            [
                12511,
                12514
            ],
            [
                12514,
                12581
            ],
            [
                12582,
                12595
            ],
            [
                12595,
                12631
            ],
            [
                12631,
                12742
            ],
            [
                12742,
                12791
            ],
            [
                12791,
                12841
            ],
            [
                12841,
                12850
            ],
            [
                12850,
                12884
            ],
            [
                12884,
                12918
            ],
            [
                12919,
                12937
            ],
            [
                12938,
                13008
            ],
            [
                13008,
                13011
            ],
            [
                13011,
                13019
            ],
            [
                13019,
                13051
            ],
            [
                13052,
                13086
            ],
            [
                13086,
                13113
            ],
            [
                13113,
                13114
            ],
            [
                13114,
                13117
            ],
            [
                13117,
                13157
            ],
            [
                13158,
                13180
            ],
            [
                13183,
                13216
            ],
            [
                13224,
                13253
            ],
            [
                13253,
                13262
            ],
            [
                13266,
                13297
            ],
            [
                13297,
                13302
            ],
            [
                13302,
                13336
            ],
            [
                13354,
                13356
            ],
            [
                13357,
                13377
            ],
            [
                13386,
                13423
            ],
            [
                13423,
                13456
            ],
            [
                13456,
                13490
            ],
            [
                13490,
                13540
            ],
            [
                13540,
                13559
            ],
            [
                13560,
                13563
            ],
            [
                13564,
                13568
            ],
            [
                13568,
                13616
            ],
            [
                13616,
                13684
            ],
            [
                13684,
                13760
            ],
            [
                13760,
                13844
            ],
            [
                13844,
                13875
            ],
            [
                13876,
                13906
            ],
            [
                13915,
                13933
            ],
            [
                13933,
                14034
            ],
            [
                14035,
                14052
            ],
            [
                14053,
                14091
            ],
            [
                14091,
                14226
            ],
            [
                14226,
                14297
            ],
            [
                14303,
                14319
            ],
            [
                14319,
                14384
            ],
            [
                14387,
                14408
            ],
            [
                14413,
                14420
            ],
            [
                14424,
                14430
            ],
            [
                14430,
                14514
            ],
            [
                14514,
                14585
            ],
            [
                14585,
                14657
            ],
            [
                14657,
                14669
            ],
            [
                14670,
                14790
            ],
            [
                14790,
                14794
            ],
            [
                14801,
                14803
            ],
            [
                14803,
                14887
            ],
            [
                14887,
                14889
            ],
            [
                14889,
                15014
            ],
            [
                15014,
                15033
            ],
            [
                15034,
                15041
            ],
            [
                15041,
                15102
            ],
            [
                15110,
                15156
            ],
            [
                15168,
                15170
            ],
            [
                15170,
                15257
            ],
            [
                15257,
                15258
            ],
            [
                15259,
                15311
            ],
            [
                15311,
                15330
            ],
            [
                15330,
                15383
            ],
            [
                15392,
                15465
            ],
            [
                15465,
                15467
            ],
            [
                15467,
                15480
            ],
            [
                15488,
                15490
            ],
            [
                15491,
                15504
            ],
            [
                15525,
                15527
            ],
            [
                15527,
                15569
            ],
            [
                15573,
                15575
            ],
            [
                15576,
                15580
            ],
            [
                15580,
                15582
            ],
            [
                15586,
                15638
            ],
            [
                15638,
                15745
            ],
            [
                15753,
                15794
            ],
            [
                15801,
                15856
            ],
            [
                15857,
                15903
            ],
            [
                15904,
                15906
            ],
            [
                15907,
                15931
            ],
            [
                15932,
                15938
            ],
            [
                15943,
                15945
            ],
            [
                15946,
                15954
            ],
            [
                15959,
                15960
            ]
        ],
        "row_chars": [
            [
                0,
                53
            ],
            [
                53,
                241
            ],
            [
                241,
                241
            ],
            [
                241,
                241
            ],
            [
                241,
                372
            ],
            [
                372,
                372
            ],
            [
                372,
                542
            ],
            [
                542,
                581
            ],
            [
                581,
                701
            ],
            [
                701,
                701
            ],
            [
                701,
                825
            ],
            [
                825,
                1041
            ],
            [
                1041,
                1311
            ],
            [
                1311,
                1363
            ],
            [
                1363,
                1464
            ],
            [
                1464,
                1464
            ],
            [
                1464,
                1666
            ],
            [
                1666,
                1700
            ],
            [
                1700,
                1780
            ],
            [
                1780,
                1780
            ],
            [
                1780,
                1780
            ],
            [
                1780,
                1780
            ],
            [
                1780,
                1780
            ],
            [
                1780,
                1780
            ],
            [
                1780,
                1814
            ],
            [
                1814,
                1893
            ],
            [
                1893,
                2079
            ],
            [
                2079,
                2182
            ],
            [
                2182,
                2182
            ],
            [
                2182,
                2270
            ],
            [
                2270,
                2349
            ],
            [
                2349,
                2553
            ],
            [
                2553,
                2624
            ],
            [
                2624,
                2624
            ],
            [
                2624,
                2952
            ],
            [
                2952,
                3137
            ],
            [
                3137,
                3203
            ],
            [
                3203,
                3222
            ],
            [
                3222,
                3242
            ],
            [
                3242,
                3341
            ],
            [
                3341,
                3435
            ],
            [
                3435,
                3472
            ],
            [
                3472,
                3598
            ],
            [
                3598,
                3652
            ],
            [
                3652,
                3795
            ],
            [
                3795,
                3971
            ],
            [
                3971,
                4039
            ],
            [
                4039,
                4141
            ],
            [
                4141,
                4260
            ],
            [
                4260,
                4467
            ],
            [
                4467,
                4616
            ],
            [
                4616,
                4741
            ],
            [
                4741,
                4868
            ],
            [
                4868,
                4987
            ],
            [
                4987,
                5125
            ],
            [
                5125,
                5205
            ],
            [
                5205,
                5395
            ],
            [
                5395,
                5420
            ],
            [
                5420,
                5460
            ],
            [
                5460,
                5475
            ],
            [
                5475,
                5524
            ],
            [
                5524,
                5642
            ],
            [
                5642,
                5731
            ],
            [
                5731,
                5748
            ],
            [
                5748,
                5748
            ],
            [
                5748,
                5748
            ],
            [
                5748,
                5823
            ],
            [
                5823,
                5838
            ],
            [
                5838,
                5923
            ],
            [
                5923,
                5950
            ],
            [
                5950,
                5973
            ],
            [
                5973,
                6055
            ],
            [
                6055,
                6108
            ],
            [
                6108,
                6267
            ],
            [
                6267,
                6537
            ],
            [
                6537,
                6691
            ],
            [
                6691,
                6706
            ],
            [
                6706,
                6721
            ],
            [
                6721,
                6895
            ],
            [
                6895,
                6930
            ],
            [
                6930,
                7015
            ],
            [
                7015,
                7060
            ],
            [
                7060,
                7126
            ],
            [
                7126,
                7126
            ],
            [
                7126,
                7208
            ],
            [
                7208,
                7226
            ],
            [
                7226,
                7247
            ],
            [
                7247,
                7247
            ],
            [
                7247,
                7372
            ],
            [
                7372,
                7448
            ],
            [
                7448,
                7448
            ],
            [
                7448,
                7480
            ],
            [
                7480,
                7494
            ],
            [
                7494,
                7518
            ],
            [
                7518,
                7607
            ],
            [
                7607,
                7799
            ],
            [
                7799,
                7936
            ],
            [
                7936,
                7989
            ],
            [
                7989,
                7989
            ],
            [
                7989,
                8014
            ],
            [
                8014,
                8014
            ],
            [
                8014,
                8014
            ],
            [
                8014,
                8014
            ],
            [
                8014,
                8014
            ],
            [
                8014,
                8148
            ],
            [
                8148,
                8452
            ],
            [
                8452,
                8551
            ],
            [
                8551,
                8607
            ],
            [
                8607,
                8661
            ],
            [
                8661,
                8756
            ],
            [
                8756,
                8797
            ],
            [
                8797,
                8797
            ],
            [
                8797,
                8868
            ],
            [
                8868,
                8922
            ],
            [
                8922,
                8999
            ],
            [
                8999,
                9047
            ],
            [
                9047,
                9160
            ],
            [
                9160,
                9244
            ],
            [
                9244,
                9269
            ],
            [
                9269,
                9326
            ],
            [
                9326,
                9326
            ],
            [
                9326,
                9461
            ],
            [
                9461,
                9479
            ],
            [
                9479,
                9508
            ],
            [
                9508,
                9538
            ],
            [
                9538,
                9586
            ],
            [
                9586,
                9609
            ],
            [
                9609,
                9635
            ],
            [
                9635,
                9658
            ],
            [
                9658,
                9658
            ],
            [
                9658,
                9658
            ],
            [
                9658,
                9658
            ],
            [
                9658,
                9658
            ],
            [
                9658,
                9658
            ],
            [
                9658,
                9658
            ],
            [
                9658,
                9658
            ],
            [
                9658,
                9693
            ],
            [
                9693,
                9710
            ],
            [
                9710,
                9880
            ],
            [
                9880,
                9971
            ],
            [
                9971,
                10038
            ],
            [
                10038,
                10113
            ],
            [
                10113,
                10113
            ],
            [
                10113,
                10140
            ],
            [
                10140,
                10169
            ],
            [
                10169,
                10201
            ],
            [
                10201,
                10215
            ],
            [
                10215,
                10255
            ],
            [
                10255,
                10289
            ],
            [
                10289,
                10304
            ],
            [
                10304,
                10405
            ],
            [
                10405,
                10455
            ],
            [
                10455,
                10492
            ],
            [
                10492,
                10530
            ],
            [
                10530,
                10530
            ],
            [
                10530,
                10636
            ],
            [
                10636,
                10918
            ],
            [
                10918,
                10924
            ],
            [
                10924,
                10946
            ],
            [
                10946,
                11020
            ],
            [
                11020,
                11063
            ],
            [
                11063,
                11086
            ],
            [
                11086,
                11158
            ],
            [
                11158,
                11179
            ],
            [
                11179,
                11190
            ],
            [
                11190,
                11218
            ],
            [
                11218,
                11245
            ],
            [
                11245,
                11265
            ],
            [
                11265,
                11318
            ],
            [
                11318,
                11318
            ],
            [
                11318,
                11357
            ],
            [
                11357,
                11421
            ],
            [
                11421,
                11421
            ],
            [
                11421,
                11421
            ],
            [
                11421,
                11421
            ],
            [
                11421,
                11489
            ],
            [
                11489,
                11500
            ],
            [
                11500,
                11517
            ],
            [
                11517,
                11762
            ],
            [
                11762,
                11801
            ],
            [
                11801,
                11909
            ],
            [
                11909,
                11963
            ],
            [
                11963,
                12059
            ],
            [
                12059,
                12059
            ],
            [
                12059,
                12118
            ],
            [
                12118,
                12198
            ],
            [
                12198,
                12248
            ],
            [
                12248,
                12279
            ],
            [
                12279,
                12415
            ],
            [
                12415,
                12415
            ],
            [
                12415,
                12514
            ],
            [
                12514,
                12595
            ],
            [
                12595,
                12631
            ],
            [
                12631,
                12742
            ],
            [
                12742,
                12841
            ],
            [
                12841,
                12850
            ],
            [
                12850,
                12884
            ],
            [
                12884,
                13011
            ],
            [
                13011,
                13019
            ],
            [
                13019,
                13051
            ],
            [
                13051,
                13051
            ],
            [
                13051,
                13086
            ],
            [
                13086,
                13113
            ],
            [
                13113,
                13216
            ],
            [
                13216,
                13253
            ],
            [
                13253,
                13262
            ],
            [
                13262,
                13262
            ],
            [
                13262,
                13297
            ],
            [
                13297,
                13302
            ],
            [
                13302,
                13302
            ],
            [
                13302,
                13356
            ],
            [
                13356,
                13423
            ],
            [
                13423,
                13423
            ],
            [
                13423,
                13456
            ],
            [
                13456,
                13490
            ],
            [
                13490,
                13540
            ],
            [
                13540,
                13616
            ],
            [
                13616,
                13684
            ],
            [
                13684,
                13844
            ],
            [
                13844,
                13933
            ],
            [
                13933,
                14091
            ],
            [
                14091,
                14226
            ],
            [
                14226,
                14319
            ],
            [
                14319,
                14430
            ],
            [
                14430,
                14514
            ],
            [
                14514,
                14585
            ],
            [
                14585,
                14657
            ],
            [
                14657,
                14790
            ],
            [
                14790,
                14889
            ],
            [
                14889,
                15014
            ],
            [
                15014,
                15041
            ],
            [
                15041,
                15170
            ],
            [
                15170,
                15311
            ],
            [
                15311,
                15330
            ],
            [
                15330,
                15383
            ],
            [
                15383,
                15383
            ],
            [
                15383,
                15467
            ],
            [
                15467,
                15467
            ],
            [
                15467,
                15527
            ],
            [
                15527,
                15582
            ],
            [
                15582,
                15638
            ],
            [
                15638,
                15794
            ],
            [
                15794,
                15960
            ]
        ]
    }
}