{
    "original": {
        "text": "Mr. Tulkinghorn arrives in his turret-room a little breathed by the journey up, though leisurely performed. There is an expression on his face as if he had discharged his mind of some grave matter and were, in his close way, satisfied. To say of a man so severely and strictly self-repressed that he is triumphant would be to do him as great an injustice as to suppose him troubled with love or sentiment or any romantic weakness. He is sedately satisfied. Perhaps there is a rather increased sense of power upon him as he loosely grasps one of his veinous wrists with his other hand and holding it behind his back walks noiselessly up and down.\nThere is a capacious writing-table in the room on which is a pretty large accumulation of papers. The green lamp is lighted, his reading-glasses lie upon the desk, the easy-chair is wheeled up to it, and it would seem as though he had intended to bestow an hour or so upon these claims on his attention before going to bed. But he happens not to be in a business mind. After a glance at the documents awaiting his notice--with his head bent low over the table, the old man's sight for print or writing being defective at night--he opens the French window and steps out upon the leads. There he again walks slowly up and down in the same attitude, subsiding, if a man so cool may have any need to subside, from the story he has related downstairs.\nThe time was once when men as knowing as Mr. Tulkinghorn would walk on turret-tops in the starlight and look up into the sky to read their fortunes there. Hosts of stars are visible to-night, though their brilliancy is eclipsed by the splendour of the moon. If he be seeking his own star as he methodically turns and turns upon the leads, it should be but a pale one to be so rustily represented below. If he be tracing out his destiny, that may be written in other characters nearer to his hand.\nAs he paces the leads with his eyes most probably as high above his thoughts as they are high above the earth, he is suddenly stopped in passing the window by two eyes that meet his own. The ceiling of his room is rather low; and the upper part of the door, which is opposite the window, is of glass. There is an inner baize door, too, but the night being warm he did not close it when he came upstairs. These eyes that meet his own are looking in through the glass from the corridor outside. He knows them well. The blood has not flushed into his face so suddenly and redly for many a long year as when he recognizes Lady Dedlock.\nHe steps into the room, and she comes in too, closing both the doors behind her. There is a wild disturbance--is it fear or anger?--in her eyes. In her carriage and all else she looks as she looked downstairs two hours ago.\nIs it fear or is it anger now? He cannot be sure. Both might be as pale, both as intent.\n\"Lady Dedlock?\"\nShe does not speak at first, nor even when she has slowly dropped into the easy-chair by the table. They look at each other, like two pictures.\n\"Why have you told my story to so many persons?\"\n\"Lady Dedlock, it was necessary for me to inform you that I knew it.\"\n\"How long have you known it?\"\n\"I have suspected it a long while--fully known it a little while.\"\n\"Months?\"\n\"Days.\"\nHe stands before her with one hand on a chair-back and the other in his old-fashioned waistcoat and shirt-frill, exactly as he has stood before her at any time since her marriage. The same formal politeness, the same composed deference that might as well be defiance; the whole man the same dark, cold object, at the same distance, which nothing has ever diminished.\n\"Is this true concerning the poor girl?\"\nHe slightly inclines and advances his head as not quite understanding the question.\n\"You know what you related. Is it true? Do her friends know my story also? Is it the town-talk yet? Is it chalked upon the walls and cried in the streets?\"\nSo! Anger, and fear, and shame. All three contending. What power this woman has to keep these raging passions down! Mr. Tulkinghorn's thoughts take such form as he looks at her, with his ragged grey eyebrows a hair's breadth more contracted than usual under her gaze.\n\"No, Lady Dedlock. That was a hypothetical case, arising out of Sir Leicester's unconsciously carrying the matter with so high a hand. But it would be a real case if they knew--what we know.\"\n\"Then they do not know it yet?\"\n\"No.\"\n\"Can I save the poor girl from injury before they know it?\"\n\"Really, Lady Dedlock,\" Mr. Tulkinghorn replies, \"I cannot give a satisfactory opinion on that point.\"\nAnd he thinks, with the interest of attentive curiosity, as he watches the struggle in her breast, \"The power and force of this woman are astonishing!\"\n\"Sir,\" she says, for the moment obliged to set her lips with all the energy she has, that she may speak distinctly, \"I will make it plainer. I do not dispute your hypothetical case. I anticipated it, and felt its truth as strongly as you can do, when I saw Mr. Rouncewell here. I knew very well that if he could have had the power of seeing me as I was, he would consider the poor girl tarnished by having for a moment been, although most innocently, the subject of my great and distinguished patronage. But I have an interest in her, or I should rather say--no longer belonging to this place--I had, and if you can find so much consideration for the woman under your foot as to remember that, she will be very sensible of your mercy.\"\nMr. Tulkinghorn, profoundly attentive, throws this off with a shrug of self-depreciation and contracts his eyebrows a little more.\n\"You have prepared me for my exposure, and I thank you for that too. Is there anything that you require of me? Is there any claim that I can release or any charge or trouble that I can spare my husband in obtaining HIS release by certifying to the exactness of your discovery? I will write anything, here and now, that you will dictate. I am ready to do it.\"\nAnd she would do it, thinks the lawyer, watchful of the firm hand with which she takes the pen!\n\"I will not trouble you, Lady Dedlock. Pray spare yourself.\"\n\"I have long expected this, as you know. I neither wish to spare myself nor to be spared. You can do nothing worse to me than you have done. Do what remains now.\"\n\"Lady Dedlock, there is nothing to be done. I will take leave to say a few words when you have finished.\"\nTheir need for watching one another should be over now, but they do it all this time, and the stars watch them both through the opened window. Away in the moonlight lie the woodland fields at rest, and the wide house is as quiet as the narrow one. The narrow one! Where are the digger and the spade, this peaceful night, destined to add the last great secret to the many secrets of the Tulkinghorn existence? Is the man born yet, is the spade wrought yet? Curious questions to consider, more curious perhaps not to consider, under the watching stars upon a summer night.\n\"Of repentance or remorse or any feeling of mine,\" Lady Dedlock presently proceeds, \"I say not a word. If I were not dumb, you would be deaf. Let that go by. It is not for your ears.\"\nHe makes a feint of offering a protest, but she sweeps it away with her disdainful hand.\n\"Of other and very different things I come to speak to you. My jewels are all in their proper places of keeping. They will be found there. So, my dresses. So, all the valuables I have. Some ready money I had with me, please to say, but no large amount. I did not wear my own dress, in order that I might avoid observation. I went to be henceforward lost. Make this known. I leave no other charge with you.\"\n\"Excuse me, Lady Dedlock,\" says Mr. Tulkinghorn, quite unmoved. \"I am not sure that I understand you. You want--\"\n\"To be lost to all here. I leave Chesney Wold to-night. I go this hour.\"\nMr. Tulkinghorn shakes his head. She rises, but he, without moving hand from chair-back or from old-fashioned waistcoat and shirt-frill, shakes his head.\n\"What? Not go as I have said?\"\n\"No, Lady Dedlock,\" he very calmly replies.\n\"Do you know the relief that my disappearance will be? Have you forgotten the stain and blot upon this place, and where it is, and who it is?\"\n\"No, Lady Dedlock, not by any means.\"\nWithout deigning to rejoin, she moves to the inner door and has it in her hand when he says to her, without himself stirring hand or foot or raising his voice, \"Lady Dedlock, have the goodness to stop and hear me, or before you reach the staircase I shall ring the alarm-bell and rouse the house. And then I must speak out before every guest and servant, every man and woman, in it.\"\nHe has conquered her. She falters, trembles, and puts her hand confusedly to her head. Slight tokens these in any one else, but when so practised an eye as Mr. Tulkinghorn's sees indecision for a moment in such a subject, he thoroughly knows its value.\nHe promptly says again, \"Have the goodness to hear me, Lady Dedlock,\" and motions to the chair from which she has risen. She hesitates, but he motions again, and she sits down.\n\"The relations between us are of an unfortunate description, Lady Dedlock; but as they are not of my making, I will not apologize for them. The position I hold in reference to Sir Leicester is so well known to you that I can hardly imagine but that I must long have appeared in your eyes the natural person to make this discovery.\"\n\"Sir,\" she returns without looking up from the ground on which her eyes are now fixed, \"I had better have gone. It would have been far better not to have detained me. I have no more to say.\"\n\"Excuse me, Lady Dedlock, if I add a little more to hear.\"\n\"I wish to hear it at the window, then. I can't breathe where I am.\"\nHis jealous glance as she walks that way betrays an instant's misgiving that she may have it in her thoughts to leap over, and dashing against ledge and cornice, strike her life out upon the terrace below. But a moment's observation of her figure as she stands in the window without any support, looking out at the stars--not up--gloomily out at those stars which are low in the heavens, reassures him. By facing round as she has moved, he stands a little behind her.\n\"Lady Dedlock, I have not yet been able to come to a decision satisfactory to myself on the course before me. I am not clear what to do or how to act next. I must request you, in the meantime, to keep your secret as you have kept it so long and not to wonder that I keep it too.\"\nHe pauses, but she makes no reply.\n\"Pardon me, Lady Dedlock. This is an important subject. You are honouring me with your attention?\"\n\"I am.\"\n\"Thank you. I might have known it from what I have seen of your strength of character. I ought not to have asked the question, but I have the habit of making sure of my ground, step by step, as I go on. The sole consideration in this unhappy case is Sir Leicester.\"\n\"Then why,\" she asks in a low voice and without removing her gloomy look from those distant stars, \"do you detain me in his house?\"\n\"Because he IS the consideration. Lady Dedlock, I have no occasion to tell you that Sir Leicester is a very proud man, that his reliance upon you is implicit, that the fall of that moon out of the sky would not amaze him more than your fall from your high position as his wife.\"\nShe breathes quickly and heavily, but she stands as unflinchingly as ever he has seen her in the midst of her grandest company.\n\"I declare to you, Lady Dedlock, that with anything short of this case that I have, I would as soon have hoped to root up by means of my own strength and my own hands the oldest tree on this estate as to shake your hold upon Sir Leicester and Sir Leicester's trust and confidence in you. And even now, with this case, I hesitate. Not that he could doubt (that, even with him, is impossible), but that nothing can prepare him for the blow.\"\n\"Not my flight?\" she returned. \"Think of it again.\"\n\"Your flight, Lady Dedlock, would spread the whole truth, and a hundred times the whole truth, far and wide. It would be impossible to save the family credit for a day. It is not to be thought of.\"\nThere is a quiet decision in his reply which admits of no remonstrance.\n\"When I speak of Sir Leicester being the sole consideration, he and the family credit are one. Sir Leicester and the baronetcy, Sir Leicester and Chesney Wold, Sir Leicester and his ancestors and his patrimony\"--Mr. Tulkinghorn very dry here--\"are, I need not say to you, Lady Dedlock, inseparable.\"\n\"Go on!\"\n\"Therefore,\" says Mr. Tulkinghorn, pursuing his case in his jog-trot style, \"I have much to consider. This is to be hushed up if it can be. How can it be, if Sir Leicester is driven out of his wits or laid upon a death-bed? If I inflicted this shock upon him to-morrow morning, how could the immediate change in him be accounted for? What could have caused it? What could have divided you? Lady Dedlock, the wall-chalking and the street-crying would come on directly, and you are to remember that it would not affect you merely (whom I cannot at all consider in this business) but your husband, Lady Dedlock, your husband.\"\nHe gets plainer as he gets on, but not an atom more emphatic or animated.\n\"There is another point of view,\" he continues, \"in which the case presents itself. Sir Leicester is devoted to you almost to infatuation. He might not be able to overcome that infatuation, even knowing what we know. I am putting an extreme case, but it might be so. If so, it were better that he knew nothing. Better for common sense, better for him, better for me. I must take all this into account, and it combines to render a decision very difficult.\"\nShe stands looking out at the same stars without a word. They are beginning to pale, and she looks as if their coldness froze her.\n\"My experience teaches me,\" says Mr. Tulkinghorn, who has by this time got his hands in his pockets and is going on in his business consideration of the matter like a machine. \"My experience teaches me, Lady Dedlock, that most of the people I know would do far better to leave marriage alone. It is at the bottom of three fourths of their troubles. So I thought when Sir Leicester married, and so I always have thought since. No more about that. I must now be guided by circumstances. In the meanwhile I must beg you to keep your own counsel, and I will keep mine.\"\n\"I am to drag my present life on, holding its pains at your pleasure, day by day?\" she asks, still looking at the distant sky.\n\"Yes, I am afraid so, Lady Dedlock.\"\n\"It is necessary, you think, that I should be so tied to the stake?\"\n\"I am sure that what I recommend is necessary.\"\n\"I am to remain on this gaudy platform on which my miserable deception has been so long acted, and it is to fall beneath me when you give the signal?\" she said slowly.\n\"Not without notice, Lady Dedlock. I shall take no step without forewarning you.\"\nShe asks all her questions as if she were repeating them from memory or calling them over in her sleep.\n\"We are to meet as usual?\"\n\"Precisely as usual, if you please.\"\n\"And I am to hide my guilt, as I have done so many years?\"\n\"As you have done so many years. I should not have made that reference myself, Lady Dedlock, but I may now remind you that your secret can be no heavier to you than it was, and is no worse and no better than it was. I know it certainly, but I believe we have never wholly trusted each other.\"\nShe stands absorbed in the same frozen way for some little time before asking, \"Is there anything more to be said to-night?\"\n\"Why,\" Mr. Tulkinghorn returns methodically as he softly rubs his hands, \"I should like to be assured of your acquiescence in my arrangements, Lady Dedlock.\"\n\"You may be assured of it.\"\n\"Good. And I would wish in conclusion to remind you, as a business precaution, in case it should be necessary to recall the fact in any communication with Sir Leicester, that throughout our interview I have expressly stated my sole consideration to be Sir Leicester's feelings and honour and the family reputation. I should have been happy to have made Lady Dedlock a prominent consideration, too, if the case had admitted of it; but unfortunately it does not.\"\n\"I can attest your fidelity, sir.\"\nBoth before and after saying it she remains absorbed, but at length moves, and turns, unshaken in her natural and acquired presence, towards the door. Mr. Tulkinghorn opens both the doors exactly as he would have done yesterday, or as he would have done ten years ago, and makes his old-fashioned bow as she passes out. It is not an ordinary look that he receives from the handsome face as it goes into the darkness, and it is not an ordinary movement, though a very slight one, that acknowledges his courtesy. But as he reflects when he is left alone, the woman has been putting no common constraint upon herself.\nHe would know it all the better if he saw the woman pacing her own rooms with her hair wildly thrown from her flung-back face, her hands clasped behind her head, her figure twisted as if by pain. He would think so all the more if he saw the woman thus hurrying up and down for hours, without fatigue, without intermission, followed by the faithful step upon the Ghost's Walk. But he shuts out the now chilled air, draws the window-curtain, goes to bed, and falls asleep. And truly when the stars go out and the wan day peeps into the turret-chamber, finding him at his oldest, he looks as if the digger and the spade were both commissioned and would soon be digging.\nThe same wan day peeps in at Sir Leicester pardoning the repentant country in a majestically condescending dream; and at the cousins entering on various public employments, principally receipt of salary; and at the chaste Volumnia, bestowing a dower of fifty thousand pounds upon a hideous old general with a mouth of false teeth like a pianoforte too full of keys, long the admiration of Bath and the terror of every other community. Also into rooms high in the roof, and into offices in court-yards, and over stables, where humbler ambition dreams of bliss, in keepers' lodges, and in holy matrimony with Will or Sally. Up comes the bright sun, drawing everything up with it--the Wills and Sallys, the latent vapour in the earth, the drooping leaves and flowers, the birds and beasts and creeping things, the gardeners to sweep the dewy turf and unfold emerald velvet where the roller passes, the smoke of the great kitchen fire wreathing itself straight and high into the lightsome air. Lastly, up comes the flag over Mr. Tulkinghorn's unconscious head cheerfully proclaiming that Sir Leicester and Lady Dedlock are in their happy home and that there is hospitality at the place in Lincolnshire.",
        "paragraph_chars": [
            [
                0,
                646
            ],
            [
                646,
                1393
            ],
            [
                1393,
                1890
            ],
            [
                1890,
                2522
            ],
            [
                2522,
                2746
            ],
            [
                2746,
                2835
            ],
            [
                2835,
                2851
            ],
            [
                2851,
                2995
            ],
            [
                2995,
                3044
            ],
            [
                3044,
                3114
            ],
            [
                3114,
                3144
            ],
            [
                3144,
                3211
            ],
            [
                3211,
                3221
            ],
            [
                3221,
                3229
            ],
            [
                3229,
                3596
            ],
            [
                3596,
                3637
            ],
            [
                3637,
                3721
            ],
            [
                3721,
                3877
            ],
            [
                3877,
                4145
            ],
            [
                4145,
                4337
            ],
            [
                4337,
                4369
            ],
            [
                4369,
                4375
            ],
            [
                4375,
                4435
            ],
            [
                4435,
                4538
            ],
            [
                4538,
                4690
            ],
            [
                4690,
                5426
            ],
            [
                5426,
                5557
            ],
            [
                5557,
                5916
            ],
            [
                5916,
                6012
            ],
            [
                6012,
                6073
            ],
            [
                6073,
                6236
            ],
            [
                6236,
                6342
            ],
            [
                6342,
                6913
            ],
            [
                6913,
                7097
            ],
            [
                7097,
                7186
            ],
            [
                7186,
                7593
            ],
            [
                7593,
                7707
            ],
            [
                7707,
                7780
            ],
            [
                7780,
                7934
            ],
            [
                7934,
                7965
            ],
            [
                7965,
                8009
            ],
            [
                8009,
                8152
            ],
            [
                8152,
                8190
            ],
            [
                8190,
                8574
            ],
            [
                8574,
                8827
            ],
            [
                8827,
                9004
            ],
            [
                9004,
                9336
            ],
            [
                9336,
                9527
            ],
            [
                9527,
                9586
            ],
            [
                9586,
                9655
            ],
            [
                9655,
                10123
            ],
            [
                10123,
                10403
            ],
            [
                10403,
                10438
            ],
            [
                10438,
                10537
            ],
            [
                10537,
                10545
            ],
            [
                10545,
                10811
            ],
            [
                10811,
                10943
            ],
            [
                10943,
                11222
            ],
            [
                11222,
                11350
            ],
            [
                11350,
                11790
            ],
            [
                11790,
                11842
            ],
            [
                11842,
                12040
            ],
            [
                12040,
                12112
            ],
            [
                12112,
                12412
            ],
            [
                12412,
                12421
            ],
            [
                12421,
                13045
            ],
            [
                13045,
                13119
            ],
            [
                13119,
                13575
            ],
            [
                13575,
                13706
            ],
            [
                13706,
                14272
            ],
            [
                14272,
                14399
            ],
            [
                14399,
                14436
            ],
            [
                14436,
                14505
            ],
            [
                14505,
                14553
            ],
            [
                14553,
                14721
            ],
            [
                14721,
                14803
            ],
            [
                14803,
                14907
            ],
            [
                14907,
                14934
            ],
            [
                14934,
                14971
            ],
            [
                14971,
                15030
            ],
            [
                15030,
                15323
            ],
            [
                15323,
                15448
            ],
            [
                15448,
                15606
            ],
            [
                15606,
                15634
            ],
            [
                15634,
                16096
            ],
            [
                16096,
                16131
            ],
            [
                16131,
                16746
            ],
            [
                16746,
                17413
            ],
            [
                17413,
                18611
            ]
        ],
        "segment_chars": [
            [
                0,
                108
            ],
            [
                108,
                236
            ],
            [
                236,
                431
            ],
            [
                431,
                457
            ],
            [
                457,
                646
            ],
            [
                646,
                744
            ],
            [
                744,
                970
            ],
            [
                970,
                1015
            ],
            [
                1015,
                1231
            ],
            [
                1231,
                1393
            ],
            [
                1393,
                1548
            ],
            [
                1548,
                1651
            ],
            [
                1651,
                1796
            ],
            [
                1796,
                1890
            ],
            [
                1890,
                2077
            ],
            [
                2077,
                2191
            ],
            [
                2191,
                2294
            ],
            [
                2294,
                2383
            ],
            [
                2383,
                2403
            ],
            [
                2403,
                2522
            ],
            [
                2522,
                2603
            ],
            [
                2603,
                2667
            ],
            [
                2667,
                2746
            ],
            [
                2746,
                2777
            ],
            [
                2777,
                2796
            ],
            [
                2796,
                2835
            ],
            [
                2835,
                2851
            ],
            [
                2851,
                2951
            ],
            [
                2951,
                2995
            ],
            [
                2995,
                3044
            ],
            [
                3044,
                3114
            ],
            [
                3114,
                3144
            ],
            [
                3144,
                3211
            ],
            [
                3211,
                3221
            ],
            [
                3221,
                3229
            ],
            [
                3229,
                3409
            ],
            [
                3409,
                3596
            ],
            [
                3596,
                3637
            ],
            [
                3637,
                3721
            ],
            [
                3721,
                3749
            ],
            [
                3749,
                3761
            ],
            [
                3761,
                3796
            ],
            [
                3796,
                3821
            ],
            [
                3821,
                3877
            ],
            [
                3877,
                3881
            ],
            [
                3881,
                3909
            ],
            [
                3909,
                3931
            ],
            [
                3931,
                3993
            ],
            [
                3993,
                4145
            ],
            [
                4145,
                4164
            ],
            [
                4164,
                4280
            ],
            [
                4280,
                4337
            ],
            [
                4337,
                4369
            ],
            [
                4369,
                4375
            ],
            [
                4375,
                4435
            ],
            [
                4435,
                4538
            ],
            [
                4538,
                4690
            ],
            [
                4690,
                4831
            ],
            [
                4831,
                4872
            ],
            [
                4872,
                4968
            ],
            [
                4968,
                5194
            ],
            [
                5194,
                5426
            ],
            [
                5426,
                5557
            ],
            [
                5557,
                5626
            ],
            [
                5626,
                5668
            ],
            [
                5668,
                5834
            ],
            [
                5834,
                5894
            ],
            [
                5894,
                5916
            ],
            [
                5916,
                6012
            ],
            [
                6012,
                6051
            ],
            [
                6051,
                6073
            ],
            [
                6073,
                6114
            ],
            [
                6114,
                6163
            ],
            [
                6163,
                6214
            ],
            [
                6214,
                6236
            ],
            [
                6236,
                6280
            ],
            [
                6280,
                6342
            ],
            [
                6342,
                6485
            ],
            [
                6485,
                6590
            ],
            [
                6590,
                6606
            ],
            [
                6606,
                6751
            ],
            [
                6751,
                6798
            ],
            [
                6798,
                6913
            ],
            [
                6913,
                7016
            ],
            [
                7016,
                7055
            ],
            [
                7055,
                7071
            ],
            [
                7071,
                7097
            ],
            [
                7097,
                7186
            ],
            [
                7186,
                7246
            ],
            [
                7246,
                7299
            ],
            [
                7299,
                7325
            ],
            [
                7325,
                7341
            ],
            [
                7341,
                7371
            ],
            [
                7371,
                7439
            ],
            [
                7439,
                7509
            ],
            [
                7509,
                7541
            ],
            [
                7541,
                7558
            ],
            [
                7558,
                7593
            ],
            [
                7593,
                7657
            ],
            [
                7657,
                7695
            ],
            [
                7695,
                7707
            ],
            [
                7707,
                7732
            ],
            [
                7732,
                7763
            ],
            [
                7763,
                7780
            ],
            [
                7780,
                7813
            ],
            [
                7813,
                7934
            ],
            [
                7934,
                7941
            ],
            [
                7941,
                7965
            ],
            [
                7965,
                8009
            ],
            [
                8009,
                8064
            ],
            [
                8064,
                8152
            ],
            [
                8152,
                8190
            ],
            [
                8190,
                8487
            ],
            [
                8487,
                8574
            ],
            [
                8574,
                8596
            ],
            [
                8596,
                8661
            ],
            [
                8661,
                8827
            ],
            [
                8827,
                8948
            ],
            [
                8948,
                9004
            ],
            [
                9004,
                9144
            ],
            [
                9144,
                9336
            ],
            [
                9336,
                9448
            ],
            [
                9448,
                9503
            ],
            [
                9503,
                9527
            ],
            [
                9527,
                9586
            ],
            [
                9586,
                9626
            ],
            [
                9626,
                9655
            ],
            [
                9655,
                9861
            ],
            [
                9861,
                10058
            ],
            [
                10058,
                10123
            ],
            [
                10123,
                10233
            ],
            [
                10233,
                10279
            ],
            [
                10279,
                10403
            ],
            [
                10403,
                10438
            ],
            [
                10438,
                10464
            ],
            [
                10464,
                10494
            ],
            [
                10494,
                10537
            ],
            [
                10537,
                10545
            ],
            [
                10545,
                10557
            ],
            [
                10557,
                10632
            ],
            [
                10632,
                10748
            ],
            [
                10748,
                10811
            ],
            [
                10811,
                10943
            ],
            [
                10943,
                10977
            ],
            [
                10977,
                11222
            ],
            [
                11222,
                11350
            ],
            [
                11350,
                11638
            ],
            [
                11638,
                11680
            ],
            [
                11680,
                11790
            ],
            [
                11790,
                11807
            ],
            [
                11807,
                11821
            ],
            [
                11821,
                11842
            ],
            [
                11842,
                11951
            ],
            [
                11951,
                12011
            ],
            [
                12011,
                12040
            ],
            [
                12040,
                12112
            ],
            [
                12112,
                12207
            ],
            [
                12207,
                12412
            ],
            [
                12412,
                12421
            ],
            [
                12421,
                12523
            ],
            [
                12523,
                12561
            ],
            [
                12561,
                12645
            ],
            [
                12645,
                12755
            ],
            [
                12755,
                12782
            ],
            [
                12782,
                12811
            ],
            [
                12811,
                13045
            ],
            [
                13045,
                13119
            ],
            [
                13119,
                13203
            ],
            [
                13203,
                13258
            ],
            [
                13258,
                13336
            ],
            [
                13336,
                13386
            ],
            [
                13386,
                13430
            ],
            [
                13430,
                13486
            ],
            [
                13486,
                13575
            ],
            [
                13575,
                13632
            ],
            [
                13632,
                13706
            ],
            [
                13706,
                13882
            ],
            [
                13882,
                13999
            ],
            [
                13999,
                14055
            ],
            [
                14055,
                14132
            ],
            [
                14132,
                14152
            ],
            [
                14152,
                14191
            ],
            [
                14191,
                14272
            ],
            [
                14272,
                14355
            ],
            [
                14355,
                14399
            ],
            [
                14399,
                14436
            ],
            [
                14436,
                14505
            ],
            [
                14505,
                14553
            ],
            [
                14553,
                14704
            ],
            [
                14704,
                14721
            ],
            [
                14721,
                14756
            ],
            [
                14756,
                14803
            ],
            [
                14803,
                14907
            ],
            [
                14907,
                14934
            ],
            [
                14934,
                14971
            ],
            [
                14971,
                15030
            ],
            [
                15030,
                15063
            ],
            [
                15063,
                15246
            ],
            [
                15246,
                15323
            ],
            [
                15323,
                15448
            ],
            [
                15448,
                15606
            ],
            [
                15606,
                15634
            ],
            [
                15634,
                15641
            ],
            [
                15641,
                15949
            ],
            [
                15949,
                16096
            ],
            [
                16096,
                16131
            ],
            [
                16131,
                16282
            ],
            [
                16282,
                16451
            ],
            [
                16451,
                16642
            ],
            [
                16642,
                16746
            ],
            [
                16746,
                16942
            ],
            [
                16942,
                17122
            ],
            [
                17122,
                17217
            ],
            [
                17217,
                17413
            ],
            [
                17413,
                17848
            ],
            [
                17848,
                18035
            ],
            [
                18035,
                18403
            ],
            [
                18403,
                18611
            ]
        ],
        "overlap_chars": [
            [
                0,
                51
            ],
            [
                78,
                79
            ],
            [
                106,
                108
            ],
            [
                236,
                254
            ],
            [
                268,
                332
            ],
            [
                342,
                354
            ],
            [
                429,
                431
            ],
            [
                431,
                457
            ],
            [
                457,
                473
            ],
            [
                483,
                522
            ],
            [
                533,
                537
            ],
            [
                545,
                548
            ],
            [
                599,
                614
            ],
            [
                584,
                587
            ],
            [
                615,
                646
            ],
            [
                646,
                656
            ],
            [
                714,
                719
            ],
            [
                667,
                692
            ],
            [
                705,
                706
            ],
            [
                733,
                744
            ],
            [
                744,
                747
            ],
            [
                754,
                809
            ],
            [
                846,
                892
            ],
            [
                900,
                913
            ],
            [
                839,
                841
            ],
            [
                919,
                924
            ],
            [
                949,
                970
            ],
            [
                1015,
                1032
            ],
            [
                1105,
                1106
            ],
            [
                1174,
                1223
            ],
            [
                1229,
                1231
            ],
            [
                1231,
                1302
            ],
            [
                1351,
                1393
            ],
            [
                1548,
                1574
            ],
            [
                1583,
                1651
            ],
            [
                1890,
                1905
            ],
            [
                1999,
                2034
            ],
            [
                1917,
                1920
            ],
            [
                2039,
                2075
            ],
            [
                1954,
                1957
            ],
            [
                2075,
                2077
            ],
            [
                2383,
                2403
            ],
            [
                2403,
                2485
            ],
            [
                2486,
                2522
            ],
            [
                2522,
                2530
            ],
            [
                2531,
                2575
            ],
            [
                2581,
                2584
            ],
            [
                2591,
                2603
            ],
            [
                2603,
                2630
            ],
            [
                2632,
                2652
            ],
            [
                2654,
                2667
            ],
            [
                2667,
                2669
            ],
            [
                2687,
                2746
            ],
            [
                2835,
                2851
            ],
            [
                2851,
                2879
            ],
            [
                2884,
                2936
            ],
            [
                2949,
                2951
            ],
            [
                2951,
                2974
            ],
            [
                2993,
                2995
            ],
            [
                2995,
                3044
            ],
            [
                3044,
                3114
            ],
            [
                3114,
                3144
            ],
            [
                3144,
                3177
            ],
            [
                3179,
                3211
            ],
            [
                3211,
                3221
            ],
            [
                3221,
                3229
            ],
            [
                3229,
                3254
            ],
            [
                3297,
                3300
            ],
            [
                3418,
                3435
            ],
            [
                3594,
                3596
            ],
            [
                3596,
                3637
            ],
            [
                3637,
                3648
            ],
            [
                3671,
                3679
            ],
            [
                3683,
                3721
            ],
            [
                3721,
                3749
            ],
            [
                3749,
                3761
            ],
            [
                3761,
                3796
            ],
            [
                3796,
                3821
            ],
            [
                3821,
                3826
            ],
            [
                3854,
                3877
            ],
            [
                3877,
                3881
            ],
            [
                3881,
                3909
            ],
            [
                3931,
                3993
            ],
            [
                3993,
                4063
            ],
            [
                4085,
                4128
            ],
            [
                4143,
                4145
            ],
            [
                4145,
                4164
            ],
            [
                4164,
                4192
            ],
            [
                4278,
                4280
            ],
            [
                4280,
                4320
            ],
            [
                4322,
                4337
            ],
            [
                4337,
                4369
            ],
            [
                4369,
                4375
            ],
            [
                4375,
                4435
            ],
            [
                4435,
                4538
            ],
            [
                4538,
                4557
            ],
            [
                4574,
                4690
            ],
            [
                4690,
                4705
            ],
            [
                4804,
                4831
            ],
            [
                4831,
                4872
            ],
            [
                4872,
                4888
            ],
            [
                4934,
                4968
            ],
            [
                4968,
                5095
            ],
            [
                5109,
                5113
            ],
            [
                5141,
                5158
            ],
            [
                5183,
                5194
            ],
            [
                5194,
                5247
            ],
            [
                5249,
                5282
            ],
            [
                5284,
                5336
            ],
            [
                5363,
                5383
            ],
            [
                5388,
                5426
            ],
            [
                5426,
                5464
            ],
            [
                5488,
                5493
            ],
            [
                5515,
                5557
            ],
            [
                5557,
                5626
            ],
            [
                5626,
                5668
            ],
            [
                5668,
                5680
            ],
            [
                5723,
                5834
            ],
            [
                5834,
                5894
            ],
            [
                5894,
                5916
            ],
            [
                5916,
                5954
            ],
            [
                6010,
                6012
            ],
            [
                6012,
                6051
            ],
            [
                6051,
                6073
            ],
            [
                6073,
                6114
            ],
            [
                6114,
                6163
            ],
            [
                6163,
                6214
            ],
            [
                6214,
                6236
            ],
            [
                6236,
                6280
            ],
            [
                6280,
                6342
            ],
            [
                6402,
                6406
            ],
            [
                6413,
                6485
            ],
            [
                6485,
                6584
            ],
            [
                6588,
                6590
            ],
            [
                6590,
                6593
            ],
            [
                6604,
                6606
            ],
            [
                6606,
                6750
            ],
            [
                6913,
                6976
            ],
            [
                6987,
                7016
            ],
            [
                7071,
                7094
            ],
            [
                7187,
                7246
            ],
            [
                7246,
                7299
            ],
            [
                7299,
                7325
            ],
            [
                7325,
                7339
            ],
            [
                7353,
                7362
            ],
            [
                7369,
                7371
            ],
            [
                7371,
                7439
            ],
            [
                7439,
                7509
            ],
            [
                7509,
                7521
            ],
            [
                7535,
                7539
            ],
            [
                7539,
                7541
            ],
            [
                7541,
                7558
            ],
            [
                7558,
                7593
            ],
            [
                7593,
                7641
            ],
            [
                7648,
                7657
            ],
            [
                7657,
                7695
            ],
            [
                7695,
                7703
            ],
            [
                7707,
                7732
            ],
            [
                7732,
                7752
            ],
            [
                7761,
                7763
            ],
            [
                7763,
                7780
            ],
            [
                7780,
                7812
            ],
            [
                7965,
                8009
            ],
            [
                8009,
                8064
            ],
            [
                8064,
                8092
            ],
            [
                8102,
                8117
            ],
            [
                8149,
                8152
            ],
            [
                8152,
                8190
            ],
            [
                8190,
                8209
            ],
            [
                8216,
                8234
            ],
            [
                8241,
                8245
            ],
            [
                8269,
                8297
            ],
            [
                8331,
                8406
            ],
            [
                8438,
                8487
            ],
            [
                8487,
                8574
            ],
            [
                8574,
                8596
            ],
            [
                8596,
                8661
            ],
            [
                8732,
                8745
            ],
            [
                8901,
                8921
            ],
            [
                8946,
                8948
            ],
            [
                8948,
                9004
            ],
            [
                9004,
                9005
            ],
            [
                9070,
                9077
            ],
            [
                9063,
                9064
            ],
            [
                9099,
                9104
            ],
            [
                9148,
                9156
            ],
            [
                9111,
                9112
            ],
            [
                9253,
                9336
            ],
            [
                9336,
                9373
            ],
            [
                9421,
                9448
            ],
            [
                9503,
                9527
            ],
            [
                9527,
                9552
            ],
            [
                9562,
                9586
            ],
            [
                9586,
                9626
            ],
            [
                9626,
                9655
            ],
            [
                9674,
                9695
            ],
            [
                9704,
                9739
            ],
            [
                9764,
                9776
            ],
            [
                9778,
                9781
            ],
            [
                9817,
                9861
            ],
            [
                9861,
                9929
            ],
            [
                9951,
                9975
            ],
            [
                10043,
                10058
            ],
            [
                10092,
                10123
            ],
            [
                10123,
                10184
            ],
            [
                10211,
                10233
            ],
            [
                10233,
                10279
            ],
            [
                10279,
                10402
            ],
            [
                10403,
                10412
            ],
            [
                10436,
                10437
            ],
            [
                10494,
                10537
            ],
            [
                10537,
                10545
            ],
            [
                10545,
                10557
            ],
            [
                10748,
                10811
            ],
            [
                10811,
                10846
            ],
            [
                10908,
                10943
            ],
            [
                10943,
                10977
            ],
            [
                10977,
                10992
            ],
            [
                11013,
                11222
            ],
            [
                11222,
                11242
            ],
            [
                11254,
                11259
            ],
            [
                11264,
                11295
            ],
            [
                11348,
                11350
            ],
            [
                11350,
                11420
            ],
            [
                11432,
                11454
            ],
            [
                11469,
                11471
            ],
            [
                11517,
                11550
            ],
            [
                11428,
                11432
            ],
            [
                11593,
                11638
            ],
            [
                11638,
                11678
            ],
            [
                11751,
                11790
            ],
            [
                11790,
                11807
            ],
            [
                11807,
                11820
            ],
            [
                11842,
                11898
            ],
            [
                11937,
                11951
            ],
            [
                11951,
                12011
            ],
            [
                12011,
                12040
            ],
            [
                12412,
                12421
            ],
            [
                12421,
                12455
            ],
            [
                12497,
                12523
            ],
            [
                12523,
                12561
            ],
            [
                12561,
                12618
            ],
            [
                12643,
                12645
            ],
            [
                12645,
                12679
            ],
            [
                12690,
                12712
            ],
            [
                12723,
                12755
            ],
            [
                12755,
                12782
            ],
            [
                12782,
                12811
            ],
            [
                12811,
                12828
            ],
            [
                12851,
                12858
            ],
            [
                12865,
                12870
            ],
            [
                12879,
                12892
            ],
            [
                12918,
                13014
            ],
            [
                13042,
                13045
            ],
            [
                13045,
                13066
            ],
            [
                13072,
                13096
            ],
            [
                13109,
                13119
            ],
            [
                13119,
                13165
            ],
            [
                13201,
                13203
            ],
            [
                13203,
                13258
            ],
            [
                13258,
                13336
            ],
            [
                13386,
                13430
            ],
            [
                13430,
                13486
            ],
            [
                13486,
                13527
            ],
            [
                13547,
                13575
            ],
            [
                13575,
                13630
            ],
            [
                13658,
                13659
            ],
            [
                13674,
                13706
            ],
            [
                13706,
                13755
            ],
            [
                13813,
                13880
            ],
            [
                13907,
                13908
            ],
            [
                13882,
                13883
            ],
            [
                13923,
                13932
            ],
            [
                13940,
                13946
            ],
            [
                13954,
                13999
            ],
            [
                13999,
                14055
            ],
            [
                14055,
                14132
            ],
            [
                14132,
                14152
            ],
            [
                14152,
                14191
            ],
            [
                14191,
                14214
            ],
            [
                14219,
                14272
            ],
            [
                14272,
                14305
            ],
            [
                14324,
                14355
            ],
            [
                14355,
                14399
            ],
            [
                14399,
                14436
            ],
            [
                14553,
                14704
            ],
            [
                14704,
                14721
            ],
            [
                14721,
                14733
            ],
            [
                14740,
                14754
            ],
            [
                14907,
                14934
            ],
            [
                14934,
                14971
            ],
            [
                14971,
                15030
            ],
            [
                15030,
                15063
            ],
            [
                15153,
                15244
            ],
            [
                15323,
                15436
            ],
            [
                15445,
                15448
            ],
            [
                15448,
                15606
            ],
            [
                15606,
                15610
            ],
            [
                15629,
                15634
            ],
            [
                15634,
                15641
            ],
            [
                15641,
                15712
            ],
            [
                15804,
                15808
            ],
            [
                15834,
                15949
            ],
            [
                15949,
                16001
            ],
            [
                16012,
                16096
            ],
            [
                16096,
                16131
            ],
            [
                16163,
                16166
            ],
            [
                16210,
                16215
            ],
            [
                16264,
                16282
            ],
            [
                16282,
                16297
            ],
            [
                16404,
                16451
            ],
            [
                16451,
                16642
            ],
            [
                16642,
                16746
            ],
            [
                16746,
                16846
            ],
            [
                16862,
                16866
            ],
            [
                16871,
                16942
            ],
            [
                16942,
                17037
            ],
            [
                17067,
                17122
            ],
            [
                17122,
                17142
            ],
            [
                17155,
                17169
            ],
            [
                17184,
                17216
            ],
            [
                17308,
                17310
            ],
            [
                17232,
                17248
            ],
            [
                17615,
                17616
            ],
            [
                17253,
                17256
            ],
            [
                17422,
                17545
            ],
            [
                17294,
                17295
            ],
            [
                17617,
                17644
            ],
            [
                17606,
                17608
            ],
            [
                17693,
                17714
            ],
            [
                17802,
                17806
            ],
            [
                17846,
                17848
            ],
            [
                17848,
                17971
            ],
            [
                18033,
                18035
            ],
            [
                18035,
                18089
            ],
            [
                18145,
                18198
            ],
            [
                18218,
                18256
            ],
            [
                18306,
                18360
            ],
            [
                18374,
                18387
            ],
            [
                18398,
                18403
            ],
            [
                18403,
                18551
            ],
            [
                18595,
                18611
            ]
        ],
        "row_chars": [
            [
                0,
                108
            ],
            [
                108,
                236
            ],
            [
                236,
                431
            ],
            [
                431,
                457
            ],
            [
                457,
                646
            ],
            [
                646,
                744
            ],
            [
                744,
                970
            ],
            [
                970,
                1015
            ],
            [
                1015,
                1231
            ],
            [
                1231,
                1393
            ],
            [
                1393,
                1548
            ],
            [
                1548,
                1651
            ],
            [
                1651,
                1796
            ],
            [
                1796,
                1890
            ],
            [
                1890,
                2077
            ],
            [
                2077,
                2191
            ],
            [
                2191,
                2294
            ],
            [
                2294,
                2383
            ],
            [
                2383,
                2403
            ],
            [
                2403,
                2522
            ],
            [
                2522,
                2603
            ],
            [
                2603,
                2667
            ],
            [
                2667,
                2746
            ],
            [
                2746,
                2777
            ],
            [
                2777,
                2796
            ],
            [
                2796,
                2835
            ],
            [
                2835,
                2851
            ],
            [
                2851,
                2951
            ],
            [
                2951,
                2995
            ],
            [
                2995,
                3044
            ],
            [
                3044,
                3114
            ],
            [
                3114,
                3144
            ],
            [
                3144,
                3211
            ],
            [
                3211,
                3221
            ],
            [
                3221,
                3229
            ],
            [
                3229,
                3596
            ],
            [
                3596,
                3637
            ],
            [
                3637,
                3721
            ],
            [
                3721,
                3749
            ],
            [
                3749,
                3761
            ],
            [
                3761,
                3796
            ],
            [
                3796,
                3821
            ],
            [
                3821,
                3877
            ],
            [
                3877,
                3881
            ],
            [
                3881,
                3909
            ],
            [
                3909,
                3931
            ],
            [
                3931,
                3993
            ],
            [
                3993,
                4145
            ],
            [
                4145,
                4164
            ],
            [
                4164,
                4280
            ],
            [
                4280,
                4337
            ],
            [
                4337,
                4369
            ],
            [
                4369,
                4375
            ],
            [
                4375,
                4435
            ],
            [
                4435,
                4538
            ],
            [
                4538,
                4690
            ],
            [
                4690,
                4831
            ],
            [
                4831,
                4872
            ],
            [
                4872,
                4968
            ],
            [
                4968,
                5194
            ],
            [
                5194,
                5426
            ],
            [
                5426,
                5557
            ],
            [
                5557,
                5626
            ],
            [
                5626,
                5668
            ],
            [
                5668,
                5834
            ],
            [
                5834,
                5894
            ],
            [
                5894,
                5916
            ],
            [
                5916,
                6012
            ],
            [
                6012,
                6051
            ],
            [
                6051,
                6073
            ],
            [
                6073,
                6114
            ],
            [
                6114,
                6163
            ],
            [
                6163,
                6214
            ],
            [
                6214,
                6236
            ],
            [
                6236,
                6280
            ],
            [
                6280,
                6342
            ],
            [
                6342,
                6485
            ],
            [
                6485,
                6590
            ],
            [
                6590,
                6606
            ],
            [
                6606,
                6751
            ],
            [
                6751,
                6798
            ],
            [
                6798,
                6913
            ],
            [
                6913,
                7016
            ],
            [
                7016,
                7055
            ],
            [
                7055,
                7071
            ],
            [
                7071,
                7097
            ],
            [
                7097,
                7186
            ],
            [
                7186,
                7246
            ],
            [
                7246,
                7299
            ],
            [
                7299,
                7325
            ],
            [
                7325,
                7371
            ],
            [
                7371,
                7439
            ],
            [
                7439,
                7509
            ],
            [
                7509,
                7541
            ],
            [
                7541,
                7558
            ],
            [
                7558,
                7593
            ],
            [
                7593,
                7657
            ],
            [
                7657,
                7695
            ],
            [
                7695,
                7707
            ],
            [
                7707,
                7732
            ],
            [
                7732,
                7763
            ],
            [
                7763,
                7780
            ],
            [
                7780,
                7813
            ],
            [
                7813,
                7934
            ],
            [
                7934,
                7941
            ],
            [
                7941,
                7965
            ],
            [
                7965,
                8009
            ],
            [
                8009,
                8064
            ],
            [
                8064,
                8152
            ],
            [
                8152,
                8190
            ],
            [
                8190,
                8487
            ],
            [
                8487,
                8574
            ],
            [
                8574,
                8596
            ],
            [
                8596,
                8661
            ],
            [
                8661,
                8948
            ],
            [
                8948,
                9004
            ],
            [
                9004,
                9336
            ],
            [
                9336,
                9448
            ],
            [
                9448,
                9503
            ],
            [
                9503,
                9527
            ],
            [
                9527,
                9586
            ],
            [
                9586,
                9626
            ],
            [
                9626,
                9655
            ],
            [
                9655,
                9861
            ],
            [
                9861,
                10058
            ],
            [
                10058,
                10123
            ],
            [
                10123,
                10233
            ],
            [
                10233,
                10279
            ],
            [
                10279,
                10403
            ],
            [
                10403,
                10438
            ],
            [
                10438,
                10464
            ],
            [
                10464,
                10494
            ],
            [
                10494,
                10537
            ],
            [
                10537,
                10545
            ],
            [
                10545,
                10557
            ],
            [
                10557,
                10632
            ],
            [
                10632,
                10748
            ],
            [
                10748,
                10811
            ],
            [
                10811,
                10943
            ],
            [
                10943,
                10977
            ],
            [
                10977,
                11222
            ],
            [
                11222,
                11350
            ],
            [
                11350,
                11638
            ],
            [
                11638,
                11790
            ],
            [
                11790,
                11807
            ],
            [
                11807,
                11821
            ],
            [
                11821,
                11842
            ],
            [
                11842,
                11951
            ],
            [
                11951,
                12011
            ],
            [
                12011,
                12040
            ],
            [
                12040,
                12112
            ],
            [
                12112,
                12207
            ],
            [
                12207,
                12412
            ],
            [
                12412,
                12421
            ],
            [
                12421,
                12523
            ],
            [
                12523,
                12561
            ],
            [
                12561,
                12645
            ],
            [
                12645,
                12755
            ],
            [
                12755,
                12782
            ],
            [
                12782,
                12811
            ],
            [
                12811,
                13045
            ],
            [
                13045,
                13119
            ],
            [
                13119,
                13203
            ],
            [
                13203,
                13258
            ],
            [
                13258,
                13336
            ],
            [
                13336,
                13386
            ],
            [
                13386,
                13430
            ],
            [
                13430,
                13486
            ],
            [
                13486,
                13575
            ],
            [
                13575,
                13706
            ],
            [
                13706,
                13999
            ],
            [
                13999,
                14055
            ],
            [
                14055,
                14132
            ],
            [
                14132,
                14152
            ],
            [
                14152,
                14191
            ],
            [
                14191,
                14272
            ],
            [
                14272,
                14355
            ],
            [
                14355,
                14399
            ],
            [
                14399,
                14436
            ],
            [
                14436,
                14505
            ],
            [
                14505,
                14553
            ],
            [
                14553,
                14704
            ],
            [
                14704,
                14721
            ],
            [
                14721,
                14756
            ],
            [
                14756,
                14803
            ],
            [
                14803,
                14907
            ],
            [
                14907,
                14934
            ],
            [
                14934,
                14971
            ],
            [
                14971,
                15030
            ],
            [
                15030,
                15063
            ],
            [
                15063,
                15246
            ],
            [
                15246,
                15323
            ],
            [
                15323,
                15448
            ],
            [
                15448,
                15606
            ],
            [
                15606,
                15634
            ],
            [
                15634,
                15641
            ],
            [
                15641,
                15949
            ],
            [
                15949,
                16096
            ],
            [
                16096,
                16131
            ],
            [
                16131,
                16282
            ],
            [
                16282,
                16451
            ],
            [
                16451,
                16642
            ],
            [
                16642,
                16746
            ],
            [
                16746,
                16942
            ],
            [
                16942,
                17122
            ],
            [
                17122,
                17217
            ],
            [
                17217,
                17848
            ],
            [
                17848,
                18035
            ],
            [
                18035,
                18403
            ],
            [
                18403,
                18611
            ]
        ]
    },
    "abridged": {
        "text": "Mr. Tulkinghorn arrives in his turret-room a little breathless, and with a satisfied expression. To say of a man so strictly self-repressed that he is triumphant would be to do him an injustice. He is sedately satisfied. Perhaps there is an increased sense of power upon him as he clasps his hands behind his back and walks noiselessly up and down.\nThere is a large writing-table in the room holding a pile of papers. The lamp is lighted, his reading-glasses lie upon the desk, and it would seem as though he had intended to give an hour or so to these documents before going to bed. But after a glance at them, he opens the French window and steps out upon the turret-top. There he again walks slowly up and down in the same attitude, subsiding from the story he has related downstairs.\nHosts of stars are visible tonight, though their brilliancy is eclipsed by the splendour of the moon. As he paces the roof-leads, he is suddenly stopped in passing his window by two eyes that meet his own across his room. He knows them well. The blood has not flushed into his face so suddenly and redly for many a long year, as when he recognizes Lady Dedlock.\nHe steps back into the room, and she comes in too, closing the door behind her. There is a wild disturbance - is it fear or anger? - in her eyes. In all else she looks as she looked downstairs two hours ago.\n\"Lady Dedlock?\"\nShe does not speak at first, not even when she has slowly dropped into the easy-chair. They look at each other.\n\"Why have you told my story to so many persons?\"\n\"Lady Dedlock, it was necessary for me to inform you that I knew it.\"\n\"How long have you known it?\"\n\"I have suspected it a long while - fully known it a little while.\"\n\"Months?\"\n\"Days.\"\nHe stands before her with his usual formal politeness.\n\"Is this true concerning the poor girl?\"\nHe slightly tilts his head, not quite understanding the question.\n\"You know what you related. Is it true? Do her friends know my story also? Is it the town-talk yet? Is it cried in the streets?\"\nSo! Anger, and fear, and shame. What power this woman has to keep these raging passions down! Mr. Tulkinghorn's thoughts take such form as he looks at her, with his brows a hair's breadth more contracted than usual.\n\"No, Lady Dedlock. That was a hypothetical case. But it would be a real case if they knew - what we know.\"\n\"Then they do not know it yet?\"\n\"No.\"\n\"Can I save the poor girl from injury before they know it?\"\n\"Really, Lady Dedlock,\" Mr. Tulkinghorn replies, \"I cannot give a satisfactory opinion on that point.\"\nAnd he thinks, with attentive curiosity, as he watches the struggle in her breast, \"The power and force of this woman are astonishing!\"\n\"Sir,\" she says, \"I will make it plainer. I do not dispute your hypothetical case. I anticipated it, when I saw Mr. Rouncewell here. I knew very well that if he could have had the power of seeing me as I was, he would consider the poor girl tarnished by having been the subject of my patronage. But I have an interest in her, or I should rather say - no longer belonging to this place - I had, and if you can find so much consideration for me as to remember that, I will be very sensible of your mercy.\"\nMr. Tulkinghorn, profoundly attentive, shrugs and contracts his eyebrows a little more.\n\"You have prepared me for my exposure, and I thank you for that too. Is there anything that you require of me? Is there any trouble that I can spare my husband in obtaining his release by certifying to the exactness of your discovery? I will write anything, here and now, that you will dictate. I am ready to do it.\"\nAnd she would do it, thinks the lawyer!\n\"I will not trouble you, Lady Dedlock. Pray spare yourself.\"\n\"I have long expected this, as you know. I neither wish to spare myself nor to be spared. You can do nothing worse to me than you have done. Do what remains now.\"\n\"Lady Dedlock, there is nothing to be done. I will take leave to say a few words when you have finished.\"\nThey watch each other all this time, and the stars watch them both through the opened window. Away in the moonlight lie the woodland fields at rest, and the wide house is as quiet as the narrow grave. The grave! Where are the digger and the spade, this peaceful night, destined to add the last great secret to the many secrets of the Tulkinghorn existence?\n\"Of repentance or remorse or any feeling of mine,\" Lady Dedlock proceeds, \"I say not a word. It is not for your ears. Of other and very different things I come to speak to you. My jewels are all in their proper places of keeping. They will be found there. So, my dresses and my valuables. Some ready money I had with me, please to say, but no large amount. I did not wear my own dress, in order that I might avoid observation. I went to be lost from now on. Make this known. I leave no other charge with you.\"\n\"Excuse me, Lady Dedlock,\" says Mr. Tulkinghorn, unmoved. \"I am not sure that I understand you. You want-\"\n\"To be lost to all here. I leave Chesney Wold tonight. I go this hour.\"\nMr. Tulkinghorn shakes his head.\n\"No, Lady Dedlock,\" he very calmly replies.\n\"Do you know the relief that my disappearance will be? Have you forgotten the stain upon this place?\"\n\"No, Lady Dedlock, not by any means.\"\nWithout deigning to reply, she moves to the door when he says to her, without raising his voice, \"Lady Dedlock, have the goodness to stop and hear me, or I shall ring the alarm-bell and rouse the house. And then I must speak out before every guest and servant, every man and woman, in it.\"\nHe has conquered her. She falters, trembles, and puts her hand confusedly to her head. Mr. Tulkinghorn motions to the chair. She hesitates, but he motions again, and she sits down.\n\"Lady Dedlock, because of my position, I must long have appeared in your eyes the natural person to make this discovery.\"\n\"Sir,\" she returns without looking up, \"I had better have gone. I have no more to say.\"\n\"Excuse me, Lady Dedlock, but there is a little more to hear.\"\n\"I wish to hear it at the window, then. I can't breathe where I am.\"\nAs she walks that way he has an instant's misgiving that she may intend to leap over and strike her life out upon the terrace below. But a moment's observation of her figure as she stands in the window looking out at the stars reassures him. He stands a little behind her.\n\"Lady Dedlock, I have not yet been able to come to a decision about the course before me. I am not clear what to do or how to act next. I must request you, in the meantime, to keep your secret as you have kept it so long and not to wonder that I keep it too.\" He pauses. \"You are honouring me with your attention?\"\n\"I am.\"\n\"Thank you. The sole consideration in this unhappy case is Sir Leicester.\"\n\"Then why,\" she asks in a low voice, \"do you detain me in his house?\"\n\"Because he is the consideration. Lady Dedlock, I need not tell you that Sir Leicester is a very proud man, that his reliance upon you is implicit, that the fall of that moon out of the sky would not amaze him more than your fall from your high position as his wife.\"\nShe breathes quickly, but stands as unflinchingly as ever.\n\"I declare to you, Lady Dedlock, that with anything short of this case, I would as soon have rooted up the oldest tree on this estate as have shaken Sir Leicester's trust and confidence in you. And even now, with this case, I hesitate; because nothing can prepare him for the blow.\"\n\"Not my flight?\" she returned.\n\"Your flight, Lady Dedlock, would spread the whole truth far and wide. It would be impossible to save the family credit for a day. It is not to be thought of.\"\n\"Go on!\"\n\"Therefore,\" says Mr. Tulkinghorn, \"I have much to consider. This is to be hushed up if it can be. How can it be, if Sir Leicester is driven out of his wits? If I inflicted this shock upon him tomorrow morning, how could the change in him be accounted for? What could have caused it? What could have divided you? Lady Dedlock, the street-talk would start directly, and it would not affect you merely (whom I cannot at all consider in this business) but your husband.\"\nHe gets plainer as he goes on, but not an atom more animated.\n\"There is another point of view,\" he continues. \"Sir Leicester is devoted to you almost to infatuation. He might not be able to overcome that infatuation, even knowing what we know. If so, it were better that he knew nothing. Better for common sense, better for him, better for me. I must take all this into account, and it makes a decision very difficult.\"\nShe stands looking out at the same stars without a word, as if their coldness froze her.\n\"My experience teaches me,\" says Mr. Tulkinghorn, going on in his business consideration of the matter like a machine, \"that most people would do far better to leave marriage alone. It is at the bottom of three fourths of their troubles. So I thought when Sir Leicester married, and so I always have thought since. No more about that. I must now be guided by circumstances. In the meanwhile I must ask you to keep your own counsel, and I will keep mine.\"\n\"I am to drag my present life on, at your pleasure, day by day?\" she asks, still looking at the distant sky.\n\"Yes, I am afraid so, Lady Dedlock.\"\n\"I am to remain on this gaudy platform on which my miserable deception has been so long acted, and it is to fall beneath me when you give the signal?\" she said slowly.\n\"Not without warning, Lady Dedlock.\"\n\"We are to meet as usual?\"\n\"Precisely as usual, if you please.\"\n\"And I am to hide my guilt, as I have done so many years?\"\n\"As you have done so many years. Your secret can be no heavier to you than it was, and is no worse and no better than it was.\"\nShe stands absorbed in the same frozen way for some little time before asking, \"Is there anything more to be said tonight?\"\n\"Why,\" Mr. Tulkinghorn returns methodically as he softly rubs his hands, \"I should like to be assured of your acquiescence in my arrangements, Lady Dedlock.\"\n\"You have it.\"\n\"Good. And I would wish in conclusion to remind you, as a business precaution, that I have expressly stated my sole consideration to be Sir Leicester's feelings and honour and the family reputation. I should have been happy to have made Lady Dedlock a consideration, too, if the case had admitted of it; but unfortunately it does not.\"\n\"I can attest your fidelity, sir.\"\nShe turns towards the door. Mr. Tulkinghorn makes his old-fashioned bow as she passes out. It is not an ordinary look that he receives from the handsome face as it goes into the darkness, and it is not an ordinary movement, though a very slight one, that acknowledges his courtesy. But as he reflects when he is left alone, the woman has been putting no common constraint upon herself.\nHe would know it all the better if he saw the woman pacing her own rooms with her hair wildly thrown back, her hands clasped behind her head, her figure twisted as if by pain. He would think so all the more if he saw the woman thus hurrying up and down for hours, without pause, followed by the faithful step upon the Ghost's Walk. But he shuts out the chilly air, draws the curtain, goes to bed, and falls asleep.\nAt last the stars go out; the wan day peeps in at Sir Leicester pardoning the repentant country in a majestically condescending dream; and at the cousins, and at the chaste Volumnia, dreaming of a hideous old general in Bath. Also into rooms high in the roof, and into offices in court-yards, and over stables, where humbler ambition dreams of bliss. Up comes the bright sun, drawing everything up with it - the drooping leaves and flowers, the birds and beasts, the gardeners to sweep the dewy turf, the smoke of the great kitchen fire wreathing itself high into the air. Lastly, up comes the flag over Mr. Tulkinghorn's unconscious head cheerfully proclaiming that Sir Leicester and Lady Dedlock are in their happy home in Lincolnshire.",
        "paragraph_chars": [
            [
                0,
                349
            ],
            [
                349,
                788
            ],
            [
                788,
                1150
            ],
            [
                1150,
                1358
            ],
            [
                1358,
                1374
            ],
            [
                1374,
                1486
            ],
            [
                1486,
                1535
            ],
            [
                1535,
                1605
            ],
            [
                1605,
                1635
            ],
            [
                1635,
                1703
            ],
            [
                1703,
                1713
            ],
            [
                1713,
                1721
            ],
            [
                1721,
                1776
            ],
            [
                1776,
                1817
            ],
            [
                1817,
                1883
            ],
            [
                1883,
                2012
            ],
            [
                2012,
                2228
            ],
            [
                2228,
                2335
            ],
            [
                2335,
                2367
            ],
            [
                2367,
                2373
            ],
            [
                2373,
                2433
            ],
            [
                2433,
                2536
            ],
            [
                2536,
                2672
            ],
            [
                2672,
                3176
            ],
            [
                3176,
                3264
            ],
            [
                3264,
                3581
            ],
            [
                3581,
                3621
            ],
            [
                3621,
                3682
            ],
            [
                3682,
                3845
            ],
            [
                3845,
                3951
            ],
            [
                3951,
                4308
            ],
            [
                4308,
                4818
            ],
            [
                4818,
                4925
            ],
            [
                4925,
                4997
            ],
            [
                4997,
                5030
            ],
            [
                5030,
                5074
            ],
            [
                5074,
                5176
            ],
            [
                5176,
                5214
            ],
            [
                5214,
                5504
            ],
            [
                5504,
                5685
            ],
            [
                5685,
                5807
            ],
            [
                5807,
                5895
            ],
            [
                5895,
                5958
            ],
            [
                5958,
                6027
            ],
            [
                6027,
                6300
            ],
            [
                6300,
                6615
            ],
            [
                6615,
                6623
            ],
            [
                6623,
                6698
            ],
            [
                6698,
                6768
            ],
            [
                6768,
                7036
            ],
            [
                7036,
                7095
            ],
            [
                7095,
                7378
            ],
            [
                7378,
                7409
            ],
            [
                7409,
                7569
            ],
            [
                7569,
                7578
            ],
            [
                7578,
                8046
            ],
            [
                8046,
                8108
            ],
            [
                8108,
                8466
            ],
            [
                8466,
                8555
            ],
            [
                8555,
                9010
            ],
            [
                9010,
                9119
            ],
            [
                9119,
                9156
            ],
            [
                9156,
                9324
            ],
            [
                9324,
                9361
            ],
            [
                9361,
                9388
            ],
            [
                9388,
                9425
            ],
            [
                9425,
                9484
            ],
            [
                9484,
                9611
            ],
            [
                9611,
                9735
            ],
            [
                9735,
                9893
            ],
            [
                9893,
                9908
            ],
            [
                9908,
                10244
            ],
            [
                10244,
                10279
            ],
            [
                10279,
                10665
            ],
            [
                10665,
                11080
            ],
            [
                11080,
                11818
            ]
        ],
        "segment_chars": [
            [
                0,
                97
            ],
            [
                97,
                195
            ],
            [
                195,
                221
            ],
            [
                221,
                349
            ],
            [
                349,
                418
            ],
            [
                418,
                584
            ],
            [
                584,
                674
            ],
            [
                674,
                788
            ],
            [
                788,
                890
            ],
            [
                890,
                1010
            ],
            [
                1010,
                1030
            ],
            [
                1030,
                1150
            ],
            [
                1150,
                1230
            ],
            [
                1230,
                1281
            ],
            [
                1281,
                1296
            ],
            [
                1296,
                1358
            ],
            [
                1358,
                1374
            ],
            [
                1374,
                1461
            ],
            [
                1461,
                1486
            ],
            [
                1486,
                1535
            ],
            [
                1535,
                1605
            ],
            [
                1605,
                1635
            ],
            [
                1635,
                1703
            ],
            [
                1703,
                1713
            ],
            [
                1713,
                1721
            ],
            [
                1721,
                1776
            ],
            [
                1776,
                1817
            ],
            [
                1817,
                1883
            ],
            [
                1883,
                1911
            ],
            [
                1911,
                1923
            ],
            [
                1923,
                1958
            ],
            [
                1958,
                1983
            ],
            [
                1983,
                2012
            ],
            [
                2012,
                2016
            ],
            [
                2016,
                2044
            ],
            [
                2044,
                2106
            ],
            [
                2106,
                2228
            ],
            [
                2228,
                2247
            ],
            [
                2247,
                2277
            ],
            [
                2277,
                2335
            ],
            [
                2335,
                2367
            ],
            [
                2367,
                2373
            ],
            [
                2373,
                2433
            ],
            [
                2433,
                2536
            ],
            [
                2536,
                2672
            ],
            [
                2672,
                2714
            ],
            [
                2714,
                2755
            ],
            [
                2755,
                2805
            ],
            [
                2805,
                2967
            ],
            [
                2967,
                3176
            ],
            [
                3176,
                3264
            ],
            [
                3264,
                3333
            ],
            [
                3333,
                3375
            ],
            [
                3375,
                3499
            ],
            [
                3499,
                3559
            ],
            [
                3559,
                3581
            ],
            [
                3581,
                3621
            ],
            [
                3621,
                3660
            ],
            [
                3660,
                3682
            ],
            [
                3682,
                3723
            ],
            [
                3723,
                3772
            ],
            [
                3772,
                3823
            ],
            [
                3823,
                3845
            ],
            [
                3845,
                3889
            ],
            [
                3889,
                3951
            ],
            [
                3951,
                4045
            ],
            [
                4045,
                4152
            ],
            [
                4152,
                4163
            ],
            [
                4163,
                4308
            ],
            [
                4308,
                4401
            ],
            [
                4401,
                4426
            ],
            [
                4426,
                4485
            ],
            [
                4485,
                4538
            ],
            [
                4538,
                4564
            ],
            [
                4564,
                4597
            ],
            [
                4597,
                4665
            ],
            [
                4665,
                4735
            ],
            [
                4735,
                4766
            ],
            [
                4766,
                4783
            ],
            [
                4783,
                4818
            ],
            [
                4818,
                4876
            ],
            [
                4876,
                4914
            ],
            [
                4914,
                4925
            ],
            [
                4925,
                4950
            ],
            [
                4950,
                4980
            ],
            [
                4980,
                4997
            ],
            [
                4997,
                5030
            ],
            [
                5030,
                5074
            ],
            [
                5074,
                5129
            ],
            [
                5129,
                5176
            ],
            [
                5176,
                5214
            ],
            [
                5214,
                5417
            ],
            [
                5417,
                5504
            ],
            [
                5504,
                5526
            ],
            [
                5526,
                5591
            ],
            [
                5591,
                5629
            ],
            [
                5629,
                5685
            ],
            [
                5685,
                5807
            ],
            [
                5807,
                5871
            ],
            [
                5871,
                5895
            ],
            [
                5895,
                5958
            ],
            [
                5958,
                5998
            ],
            [
                5998,
                6027
            ],
            [
                6027,
                6160
            ],
            [
                6160,
                6269
            ],
            [
                6269,
                6300
            ],
            [
                6300,
                6390
            ],
            [
                6390,
                6436
            ],
            [
                6436,
                6560
            ],
            [
                6560,
                6571
            ],
            [
                6571,
                6615
            ],
            [
                6615,
                6623
            ],
            [
                6623,
                6635
            ],
            [
                6635,
                6698
            ],
            [
                6698,
                6768
            ],
            [
                6768,
                6802
            ],
            [
                6802,
                7036
            ],
            [
                7036,
                7095
            ],
            [
                7095,
                7289
            ],
            [
                7289,
                7378
            ],
            [
                7378,
                7395
            ],
            [
                7395,
                7409
            ],
            [
                7409,
                7480
            ],
            [
                7480,
                7540
            ],
            [
                7540,
                7569
            ],
            [
                7569,
                7578
            ],
            [
                7578,
                7639
            ],
            [
                7639,
                7677
            ],
            [
                7677,
                7736
            ],
            [
                7736,
                7835
            ],
            [
                7835,
                7862
            ],
            [
                7862,
                7891
            ],
            [
                7891,
                8046
            ],
            [
                8046,
                8108
            ],
            [
                8108,
                8156
            ],
            [
                8156,
                8212
            ],
            [
                8212,
                8290
            ],
            [
                8290,
                8334
            ],
            [
                8334,
                8390
            ],
            [
                8390,
                8466
            ],
            [
                8466,
                8555
            ],
            [
                8555,
                8737
            ],
            [
                8737,
                8793
            ],
            [
                8793,
                8870
            ],
            [
                8870,
                8890
            ],
            [
                8890,
                8929
            ],
            [
                8929,
                9010
            ],
            [
                9010,
                9075
            ],
            [
                9075,
                9119
            ],
            [
                9119,
                9156
            ],
            [
                9156,
                9307
            ],
            [
                9307,
                9324
            ],
            [
                9324,
                9361
            ],
            [
                9361,
                9388
            ],
            [
                9388,
                9425
            ],
            [
                9425,
                9484
            ],
            [
                9484,
                9517
            ],
            [
                9517,
                9611
            ],
            [
                9611,
                9735
            ],
            [
                9735,
                9893
            ],
            [
                9893,
                9908
            ],
            [
                9908,
                9915
            ],
            [
                9915,
                10107
            ],
            [
                10107,
                10244
            ],
            [
                10244,
                10279
            ],
            [
                10279,
                10307
            ],
            [
                10307,
                10370
            ],
            [
                10370,
                10561
            ],
            [
                10561,
                10665
            ],
            [
                10665,
                10841
            ],
            [
                10841,
                10997
            ],
            [
                10997,
                11080
            ],
            [
                11080,
                11306
            ],
            [
                11306,
                11431
            ],
            [
                11431,
                11653
            ],
            [
                11653,
                11818
            ]
        ],
        "overlap_chars": [
            [
                0,
                51
            ],
            [
                62,
                63
            ],
            [
                95,
                97
            ],
            [
                97,
                115
            ],
            [
                116,
                180
            ],
            [
                181,
                193
            ],
            [
                193,
                195
            ],
            [
                195,
                221
            ],
            [
                221,
                237
            ],
            [
                241,
                280
            ],
            [
                283,
                287
            ],
            [
                288,
                291
            ],
            [
                298,
                313
            ],
            [
                314,
                317
            ],
            [
                318,
                349
            ],
            [
                349,
                359
            ],
            [
                360,
                365
            ],
            [
                366,
                391
            ],
            [
                400,
                401
            ],
            [
                407,
                418
            ],
            [
                418,
                421
            ],
            [
                422,
                477
            ],
            [
                478,
                524
            ],
            [
                530,
                543
            ],
            [
                544,
                546
            ],
            [
                547,
                552
            ],
            [
                563,
                584
            ],
            [
                588,
                605
            ],
            [
                610,
                611
            ],
            [
                612,
                661
            ],
            [
                672,
                674
            ],
            [
                674,
                745
            ],
            [
                746,
                788
            ],
            [
                788,
                814
            ],
            [
                822,
                890
            ],
            [
                890,
                905
            ],
            [
                916,
                951
            ],
            [
                952,
                955
            ],
            [
                956,
                992
            ],
            [
                1000,
                1003
            ],
            [
                1008,
                1010
            ],
            [
                1010,
                1030
            ],
            [
                1030,
                1112
            ],
            [
                1114,
                1150
            ],
            [
                1150,
                1158
            ],
            [
                1164,
                1208
            ],
            [
                1209,
                1212
            ],
            [
                1218,
                1230
            ],
            [
                1230,
                1257
            ],
            [
                1260,
                1280
            ],
            [
                1283,
                1296
            ],
            [
                1296,
                1298
            ],
            [
                1299,
                1358
            ],
            [
                1358,
                1374
            ],
            [
                1374,
                1402
            ],
            [
                1407,
                1459
            ],
            [
                1459,
                1461
            ],
            [
                1461,
                1484
            ],
            [
                1484,
                1486
            ],
            [
                1486,
                1535
            ],
            [
                1535,
                1605
            ],
            [
                1605,
                1635
            ],
            [
                1635,
                1668
            ],
            [
                1671,
                1703
            ],
            [
                1703,
                1713
            ],
            [
                1713,
                1721
            ],
            [
                1721,
                1746
            ],
            [
                1747,
                1750
            ],
            [
                1757,
                1774
            ],
            [
                1774,
                1776
            ],
            [
                1776,
                1817
            ],
            [
                1817,
                1828
            ],
            [
                1835,
                1843
            ],
            [
                1845,
                1883
            ],
            [
                1883,
                1911
            ],
            [
                1911,
                1923
            ],
            [
                1923,
                1958
            ],
            [
                1958,
                1983
            ],
            [
                1983,
                1988
            ],
            [
                1989,
                2012
            ],
            [
                2012,
                2016
            ],
            [
                2016,
                2044
            ],
            [
                2044,
                2106
            ],
            [
                2106,
                2176
            ],
            [
                2183,
                2226
            ],
            [
                2226,
                2228
            ],
            [
                2228,
                2247
            ],
            [
                2247,
                2275
            ],
            [
                2275,
                2277
            ],
            [
                2277,
                2317
            ],
            [
                2320,
                2335
            ],
            [
                2335,
                2367
            ],
            [
                2367,
                2373
            ],
            [
                2373,
                2433
            ],
            [
                2433,
                2536
            ],
            [
                2536,
                2555
            ],
            [
                2556,
                2672
            ],
            [
                2672,
                2687
            ],
            [
                2687,
                2714
            ],
            [
                2714,
                2755
            ],
            [
                2755,
                2771
            ],
            [
                2771,
                2805
            ],
            [
                2805,
                2932
            ],
            [
                2933,
                2937
            ],
            [
                2938,
                2955
            ],
            [
                2956,
                2967
            ],
            [
                2967,
                3020
            ],
            [
                3023,
                3056
            ],
            [
                3059,
                3111
            ],
            [
                3115,
                3135
            ],
            [
                3138,
                3176
            ],
            [
                3176,
                3214
            ],
            [
                3215,
                3220
            ],
            [
                3222,
                3264
            ],
            [
                3264,
                3333
            ],
            [
                3333,
                3375
            ],
            [
                3375,
                3387
            ],
            [
                3388,
                3499
            ],
            [
                3499,
                3559
            ],
            [
                3559,
                3581
            ],
            [
                3581,
                3619
            ],
            [
                3619,
                3621
            ],
            [
                3621,
                3660
            ],
            [
                3660,
                3682
            ],
            [
                3682,
                3723
            ],
            [
                3723,
                3772
            ],
            [
                3772,
                3823
            ],
            [
                3823,
                3845
            ],
            [
                3845,
                3889
            ],
            [
                3889,
                3951
            ],
            [
                3951,
                3955
            ],
            [
                3973,
                4045
            ],
            [
                4045,
                4144
            ],
            [
                4150,
                4152
            ],
            [
                4152,
                4155
            ],
            [
                4161,
                4163
            ],
            [
                4163,
                4307
            ],
            [
                4308,
                4371
            ],
            [
                4372,
                4401
            ],
            [
                4401,
                4424
            ],
            [
                4426,
                4485
            ],
            [
                4485,
                4538
            ],
            [
                4538,
                4564
            ],
            [
                4564,
                4578
            ],
            [
                4586,
                4595
            ],
            [
                4595,
                4597
            ],
            [
                4597,
                4665
            ],
            [
                4665,
                4735
            ],
            [
                4735,
                4747
            ],
            [
                4748,
                4752
            ],
            [
                4764,
                4766
            ],
            [
                4766,
                4783
            ],
            [
                4783,
                4818
            ],
            [
                4818,
                4866
            ],
            [
                4867,
                4876
            ],
            [
                4876,
                4914
            ],
            [
                4914,
                4922
            ],
            [
                4925,
                4950
            ],
            [
                4950,
                4970
            ],
            [
                4978,
                4980
            ],
            [
                4980,
                4997
            ],
            [
                4997,
                5029
            ],
            [
                5030,
                5074
            ],
            [
                5074,
                5129
            ],
            [
                5129,
                5157
            ],
            [
                5158,
                5173
            ],
            [
                5173,
                5176
            ],
            [
                5176,
                5214
            ],
            [
                5214,
                5233
            ],
            [
                5239,
                5257
            ],
            [
                5258,
                5262
            ],
            [
                5263,
                5291
            ],
            [
                5292,
                5367
            ],
            [
                5368,
                5417
            ],
            [
                5417,
                5504
            ],
            [
                5504,
                5526
            ],
            [
                5526,
                5591
            ],
            [
                5593,
                5606
            ],
            [
                5607,
                5627
            ],
            [
                5627,
                5629
            ],
            [
                5629,
                5685
            ],
            [
                5685,
                5686
            ],
            [
                5691,
                5698
            ],
            [
                5698,
                5699
            ],
            [
                5708,
                5713
            ],
            [
                5714,
                5722
            ],
            [
                5722,
                5723
            ],
            [
                5724,
                5807
            ],
            [
                5807,
                5844
            ],
            [
                5844,
                5871
            ],
            [
                5871,
                5895
            ],
            [
                5895,
                5920
            ],
            [
                5934,
                5958
            ],
            [
                5958,
                5998
            ],
            [
                5998,
                6027
            ],
            [
                6027,
                6048
            ],
            [
                6056,
                6091
            ],
            [
                6099,
                6111
            ],
            [
                6112,
                6115
            ],
            [
                6116,
                6160
            ],
            [
                6160,
                6228
            ],
            [
                6229,
                6253
            ],
            [
                6254,
                6269
            ],
            [
                6269,
                6300
            ],
            [
                6300,
                6361
            ],
            [
                6368,
                6390
            ],
            [
                6390,
                6436
            ],
            [
                6436,
                6559
            ],
            [
                6560,
                6569
            ],
            [
                6569,
                6570
            ],
            [
                6572,
                6615
            ],
            [
                6615,
                6623
            ],
            [
                6623,
                6635
            ],
            [
                6635,
                6698
            ],
            [
                6698,
                6733
            ],
            [
                6733,
                6768
            ],
            [
                6768,
                6802
            ],
            [
                6802,
                6817
            ],
            [
                6827,
                7036
            ],
            [
                7036,
                7056
            ],
            [
                7056,
                7061
            ],
            [
                7062,
                7093
            ],
            [
                7093,
                7095
            ],
            [
                7095,
                7165
            ],
            [
                7165,
                7187
            ],
            [
                7195,
                7197
            ],
            [
                7198,
                7231
            ],
            [
                7232,
                7236
            ],
            [
                7244,
                7289
            ],
            [
                7289,
                7329
            ],
            [
                7339,
                7378
            ],
            [
                7378,
                7395
            ],
            [
                7395,
                7408
            ],
            [
                7409,
                7465
            ],
            [
                7466,
                7480
            ],
            [
                7480,
                7540
            ],
            [
                7540,
                7569
            ],
            [
                7569,
                7578
            ],
            [
                7578,
                7612
            ],
            [
                7613,
                7639
            ],
            [
                7639,
                7677
            ],
            [
                7677,
                7734
            ],
            [
                7734,
                7736
            ],
            [
                7736,
                7770
            ],
            [
                7780,
                7802
            ],
            [
                7803,
                7835
            ],
            [
                7835,
                7862
            ],
            [
                7862,
                7891
            ],
            [
                7891,
                7908
            ],
            [
                7909,
                7916
            ],
            [
                7921,
                7926
            ],
            [
                7933,
                7946
            ],
            [
                7947,
                8043
            ],
            [
                8043,
                8046
            ],
            [
                8046,
                8067
            ],
            [
                8073,
                8097
            ],
            [
                8098,
                8108
            ],
            [
                8108,
                8154
            ],
            [
                8154,
                8156
            ],
            [
                8157,
                8212
            ],
            [
                8212,
                8290
            ],
            [
                8290,
                8334
            ],
            [
                8334,
                8390
            ],
            [
                8390,
                8431
            ],
            [
                8438,
                8466
            ],
            [
                8466,
                8521
            ],
            [
                8521,
                8522
            ],
            [
                8523,
                8555
            ],
            [
                8555,
                8604
            ],
            [
                8605,
                8672
            ],
            [
                8672,
                8673
            ],
            [
                8674,
                8675
            ],
            [
                8675,
                8684
            ],
            [
                8685,
                8691
            ],
            [
                8692,
                8737
            ],
            [
                8737,
                8793
            ],
            [
                8793,
                8870
            ],
            [
                8870,
                8890
            ],
            [
                8890,
                8929
            ],
            [
                8929,
                8952
            ],
            [
                8957,
                9010
            ],
            [
                9010,
                9043
            ],
            [
                9044,
                9075
            ],
            [
                9075,
                9119
            ],
            [
                9119,
                9156
            ],
            [
                9156,
                9307
            ],
            [
                9307,
                9324
            ],
            [
                9324,
                9336
            ],
            [
                9344,
                9358
            ],
            [
                9361,
                9388
            ],
            [
                9388,
                9425
            ],
            [
                9425,
                9484
            ],
            [
                9484,
                9517
            ],
            [
                9517,
                9608
            ],
            [
                9611,
                9724
            ],
            [
                9732,
                9735
            ],
            [
                9735,
                9893
            ],
            [
                9893,
                9897
            ],
            [
                9903,
                9908
            ],
            [
                9908,
                9915
            ],
            [
                9915,
                9986
            ],
            [
                9987,
                9991
            ],
            [
                9992,
                10107
            ],
            [
                10107,
                10159
            ],
            [
                10160,
                10244
            ],
            [
                10244,
                10279
            ],
            [
                10279,
                10282
            ],
            [
                10283,
                10288
            ],
            [
                10289,
                10307
            ],
            [
                10307,
                10322
            ],
            [
                10323,
                10370
            ],
            [
                10370,
                10561
            ],
            [
                10561,
                10665
            ],
            [
                10665,
                10765
            ],
            [
                10766,
                10770
            ],
            [
                10770,
                10841
            ],
            [
                10841,
                10936
            ],
            [
                10942,
                10997
            ],
            [
                10997,
                11017
            ],
            [
                11025,
                11039
            ],
            [
                11047,
                11079
            ],
            [
                11080,
                11082
            ],
            [
                11088,
                11104
            ],
            [
                11104,
                11105
            ],
            [
                11106,
                11109
            ],
            [
                11110,
                11233
            ],
            [
                11233,
                11234
            ],
            [
                11235,
                11262
            ],
            [
                11272,
                11274
            ],
            [
                11275,
                11296
            ],
            [
                11300,
                11304
            ],
            [
                11304,
                11306
            ],
            [
                11306,
                11429
            ],
            [
                11429,
                11431
            ],
            [
                11431,
                11485
            ],
            [
                11488,
                11541
            ],
            [
                11541,
                11579
            ],
            [
                11579,
                11633
            ],
            [
                11634,
                11647
            ],
            [
                11648,
                11653
            ],
            [
                11653,
                11801
            ],
            [
                11802,
                11818
            ]
        ],
        "row_chars": [
            [
                0,
                97
            ],
            [
                97,
                97
            ],
            [
                97,
                195
            ],
            [
                195,
                221
            ],
            [
                221,
                349
            ],
            [
                349,
                418
            ],
            [
                418,
                584
            ],
            [
                584,
                584
            ],
            [
                584,
                674
            ],
            [
                674,
                788
            ],
            [
                788,
                788
            ],
            [
                788,
                890
            ],
            [
                890,
                890
            ],
            [
                890,
                890
            ],
            [
                890,
                1010
            ],
            [
                1010,
                1010
            ],
            [
                1010,
                1010
            ],
            [
                1010,
                1010
            ],
            [
                1010,
                1030
            ],
            [
                1030,
                1150
            ],
            [
                1150,
                1230
            ],
            [
                1230,
                1296
            ],
            [
                1296,
                1358
            ],
            [
                1358,
                1358
            ],
            [
                1358,
                1358
            ],
            [
                1358,
                1358
            ],
            [
                1358,
                1374
            ],
            [
                1374,
                1461
            ],
            [
                1461,
                1486
            ],
            [
                1486,
                1535
            ],
            [
                1535,
                1605
            ],
            [
                1605,
                1635
            ],
            [
                1635,
                1703
            ],
            [
                1703,
                1713
            ],
            [
                1713,
                1721
            ],
            [
                1721,
                1776
            ],
            [
                1776,
                1817
            ],
            [
                1817,
                1883
            ],
            [
                1883,
                1911
            ],
            [
                1911,
                1923
            ],
            [
                1923,
                1958
            ],
            [
                1958,
                1983
            ],
            [
                1983,
                2012
            ],
            [
                2012,
                2016
            ],
            [
                2016,
                2044
            ],
            [
                2044,
                2044
            ],
            [
                2044,
                2106
            ],
            [
                2106,
                2228
            ],
            [
                2228,
                2247
            ],
            [
                2247,
                2277
            ],
            [
                2277,
                2335
            ],
            [
                2335,
                2367
            ],
            [
                2367,
                2373
            ],
            [
                2373,
                2433
            ],
            [
                2433,
                2536
            ],
            [
                2536,
                2672
            ],
            [
                2672,
                2714
            ],
            [
                2714,
                2755
            ],
            [
                2755,
                2805
            ],
            [
                2805,
                2967
            ],
            [
                2967,
                3176
            ],
            [
                3176,
                3264
            ],
            [
                3264,
                3333
            ],
            [
                3333,
                3375
            ],
            [
                3375,
                3499
            ],
            [
                3499,
                3559
            ],
            [
                3559,
                3581
            ],
            [
                3581,
                3621
            ],
            [
                3621,
                3660
            ],
            [
                3660,
                3682
            ],
            [
                3682,
                3723
            ],
            [
                3723,
                3772
            ],
            [
                3772,
                3823
            ],
            [
                3823,
                3845
            ],
            [
                3845,
                3889
            ],
            [
                3889,
                3951
            ],
            [
                3951,
                4045
            ],
            [
                4045,
                4152
            ],
            [
                4152,
                4163
            ],
            [
                4163,
                4308
            ],
            [
                4308,
                4308
            ],
            [
                4308,
                4308
            ],
            [
                4308,
                4401
            ],
            [
                4401,
                4401
            ],
            [
                4401,
                4401
            ],
            [
                4401,
                4426
            ],
            [
                4426,
                4426
            ],
            [
                4426,
                4485
            ],
            [
                4485,
                4538
            ],
            [
                4538,
                4564
            ],
            [
                4564,
                4597
            ],
            [
                4597,
                4665
            ],
            [
                4665,
                4735
            ],
            [
                4735,
                4766
            ],
            [
                4766,
                4783
            ],
            [
                4783,
                4818
            ],
            [
                4818,
                4876
            ],
            [
                4876,
                4914
            ],
            [
                4914,
                4925
            ],
            [
                4925,
                4950
            ],
            [
                4950,
                4980
            ],
            [
                4980,
                4997
            ],
            [
                4997,
                5030
            ],
            [
                5030,
                5030
            ],
            [
                5030,
                5030
            ],
            [
                5030,
                5030
            ],
            [
                5030,
                5074
            ],
            [
                5074,
                5129
            ],
            [
                5129,
                5176
            ],
            [
                5176,
                5214
            ],
            [
                5214,
                5417
            ],
            [
                5417,
                5504
            ],
            [
                5504,
                5526
            ],
            [
                5526,
                5591
            ],
            [
                5591,
                5629
            ],
            [
                5629,
                5685
            ],
            [
                5685,
                5807
            ],
            [
                5807,
                5871
            ],
            [
                5871,
                5871
            ],
            [
                5871,
                5895
            ],
            [
                5895,
                5958
            ],
            [
                5958,
                5998
            ],
            [
                5998,
                6027
            ],
            [
                6027,
                6160
            ],
            [
                6160,
                6269
            ],
            [
                6269,
                6300
            ],
            [
                6300,
                6390
            ],
            [
                6390,
                6436
            ],
            [
                6436,
                6560
            ],
            [
                6560,
                6571
            ],
            [
                6571,
                6571
            ],
            [
                6571,
                6571
            ],
            [
                6571,
                6615
            ],
            [
                6615,
                6623
            ],
            [
                6623,
                6635
            ],
            [
                6635,
                6635
            ],
            [
                6635,
                6635
            ],
            [
                6635,
                6698
            ],
            [
                6698,
                6768
            ],
            [
                6768,
                6802
            ],
            [
                6802,
                7036
            ],
            [
                7036,
                7095
            ],
            [
                7095,
                7289
            ],
            [
                7289,
                7378
            ],
            [
                7378,
                7395
            ],
            [
                7395,
                7409
            ],
            [
                7409,
                7409
            ],
            [
                7409,
                7480
            ],
            [
                7480,
                7540
            ],
            [
                7540,
                7569
            ],
            [
                7569,
                7569
            ],
            [
                7569,
                7569
            ],
            [
                7569,
                7569
            ],
            [
                7569,
                7578
            ],
            [
                7578,
                7639
            ],
            [
                7639,
                7677
            ],
            [
                7677,
                7736
            ],
            [
                7736,
                7835
            ],
            [
                7835,
                7862
            ],
            [
                7862,
                7891
            ],
            [
                7891,
                8046
            ],
            [
                8046,
                8108
            ],
            [
                8108,
                8156
            ],
            [
                8156,
                8212
            ],
            [
                8212,
                8290
            ],
            [
                8290,
                8290
            ],
            [
                8290,
                8334
            ],
            [
                8334,
                8390
            ],
            [
                8390,
                8466
            ],
            [
                8466,
                8555
            ],
            [
                8555,
                8737
            ],
            [
                8737,
                8793
            ],
            [
                8793,
                8870
            ],
            [
                8870,
                8890
            ],
            [
                8890,
                8929
            ],
            [
                8929,
                9010
            ],
            [
                9010,
                9075
            ],
            [
                9075,
                9119
            ],
            [
                9119,
                9156
            ],
            [
                9156,
                9156
            ],
            [
                9156,
                9156
            ],
            [
                9156,
                9307
            ],
            [
                9307,
                9324
            ],
            [
                9324,
                9361
            ],
            [
                9361,
                9361
            ],
            [
                9361,
                9361
            ],
            [
                9361,
                9388
            ],
            [
                9388,
                9425
            ],
            [
                9425,
                9484
            ],
            [
                9484,
                9517
            ],
            [
                9517,
                9611
            ],
            [
                9611,
                9611
            ],
            [
                9611,
                9735
            ],
            [
                9735,
                9893
            ],
            [
                9893,
                9908
            ],
            [
                9908,
                9915
            ],
            [
                9915,
                10107
            ],
            [
                10107,
                10244
            ],
            [
                10244,
                10279
            ],
            [
                10279,
                10307
            ],
            [
                10307,
                10370
            ],
            [
                10370,
                10561
            ],
            [
                10561,
                10665
            ],
            [
                10665,
                10841
            ],
            [
                10841,
                10997
            ],
            [
                10997,
                11080
            ],
            [
                11080,
                11306
            ],
            [
                11306,
                11431
            ],
            [
                11431,
                11653
            ],
            [
                11653,
                11818
            ]
        ]
    }
}