{
    "original": {
        "text": "From the verdant undulations and the spreading oaks of the Dedlock property, Mr. Tulkinghorn transfers himself to the stale heat and dust of London. His manner of coming and going between the two places is one of his impenetrabilities. He walks into Chesney Wold as if it were next door to his chambers and returns to his chambers as if he had never been out of Lincoln's Inn Fields. He neither changes his dress before the journey nor talks of it afterwards. He melted out of his turret-room this morning, just as now, in the late twilight, he melts into his own square.\nLike a dingy London bird among the birds at roost in these pleasant fields, where the sheep are all made into parchment, the goats into wigs, and the pasture into chaff, the lawyer, smoke-dried and faded, dwelling among mankind but not consorting with them, aged without experience of genial youth, and so long used to make his cramped nest in holes and corners of human nature that he has forgotten its broader and better range, comes sauntering home. In the oven made by the hot pavements and hot buildings, he has baked himself dryer than usual; and he has in his thirsty mind his mellowed port-wine half a century old.\nThe lamplighter is skipping up and down his ladder on Mr. Tulkinghorn's side of the Fields when that high-priest of noble mysteries arrives at his own dull court-yard. He ascends the door-steps and is gliding into the dusky hall when he encounters, on the top step, a bowing and propitiatory little man.\n\"Is that Snagsby?\"\n\"Yes, sir. I hope you are well, sir. I was just giving you up, sir, and going home.\"\n\"Aye? What is it? What do you want with me?\"\n\"Well, sir,\" says Mr. Snagsby, holding his hat at the side of his head in his deference towards his best customer, \"I was wishful to say a word to you, sir.\"\n\"Can you say it here?\"\n\"Perfectly, sir.\"\n\"Say it then.\" The lawyer turns, leans his arms on the iron railing at the top of the steps, and looks at the lamplighter lighting the court-yard.\n\"It is relating,\" says Mr. Snagsby in a mysterious low voice, \"it is relating--not to put too fine a point upon it--to the foreigner, sir!\"\nMr. Tulkinghorn eyes him with some surprise. \"What foreigner?\"\n\"The foreign female, sir. French, if I don't mistake? I am not acquainted with that language myself, but I should judge from her manners and appearance that she was French; anyways, certainly foreign. Her that was upstairs, sir, when Mr. Bucket and me had the honour of waiting upon you with the sweeping-boy that night.\"\n\"Oh! Yes, yes. Mademoiselle Hortense.\"\n\"Indeed, sir?\" Mr. Snagsby coughs his cough of submission behind his hat. \"I am not acquainted myself with the names of foreigners in general, but I have no doubt it WOULD be that.\" Mr. Snagsby appears to have set out in this reply with some desperate design of repeating the name, but on reflection coughs again to excuse himself.\n\"And what can you have to say, Snagsby,\" demands Mr. Tulkinghorn, \"about her?\"\n\"Well, sir,\" returns the stationer, shading his communication with his hat, \"it falls a little hard upon me. My domestic happiness is very great--at least, it's as great as can be expected, I'm sure--but my little woman is rather given to jealousy. Not to put too fine a point upon it, she is very much given to jealousy. And you see, a foreign female of that genteel appearance coming into the shop, and hovering--I should be the last to make use of a strong expression if I could avoid it, but hovering, sir--in the court--you know it is--now ain't it? I only put it to yourself, sir.\"\nMr. Snagsby, having said this in a very plaintive manner, throws in a cough of general application to fill up all the blanks.\n\"Why, what do you mean?\" asks Mr. Tulkinghorn.\n\"Just so, sir,\" returns Mr. Snagsby; \"I was sure you would feel it yourself and would excuse the reasonableness of MY feelings when coupled with the known excitableness of my little woman. You see, the foreign female--which you mentioned her name just now, with quite a native sound I am sure--caught up the word Snagsby that night, being uncommon quick, and made inquiry, and got the direction and come at dinner-time. Now Guster, our young woman, is timid and has fits, and she, taking fright at the foreigner's looks--which are fierce--and at a grinding manner that she has of speaking--which is calculated to alarm a weak mind--gave way to it, instead of bearing up against it, and tumbled down the kitchen stairs out of one into another, such fits as I do sometimes think are never gone into, or come out of, in any house but ours. Consequently there was by good fortune ample occupation for my little woman, and only me to answer the shop. When she DID say that Mr. Tulkinghorn, being always denied to her by his employer (which I had no doubt at the time was a foreign mode of viewing a clerk), she would do herself the pleasure of continually calling at my place until she was let in here. Since then she has been, as I began by saying, hovering, hovering, sir\"--Mr. Snagsby repeats the word with pathetic emphasis--\"in the court. The effects of which movement it is impossible to calculate. I shouldn't wonder if it might have already given rise to the painfullest mistakes even in the neighbours' minds, not mentioning (if such a thing was possible) my little woman. Whereas, goodness knows,\" says Mr. Snagsby, shaking his head, \"I never had an idea of a foreign female, except as being formerly connected with a bunch of brooms and a baby, or at the present time with a tambourine and earrings. I never had, I do assure you, sir!\"\nMr. Tulkinghorn had listened gravely to this complaint and inquires when the stationer has finished, \"And that's all, is it, Snagsby?\"\n\"Why yes, sir, that's all,\" says Mr. Snagsby, ending with a cough that plainly adds, \"and it's enough too--for me.\"\n\"I don't know what Mademoiselle Hortense may want or mean, unless she is mad,\" says the lawyer.\n\"Even if she was, you know, sir,\" Mr. Snagsby pleads, \"it wouldn't be a consolation to have some weapon or another in the form of a foreign dagger planted in the family.\"\n\"No,\" says the other. \"Well, well! This shall be stopped. I am sorry you have been inconvenienced. If she comes again, send her here.\"\nMr. Snagsby, with much bowing and short apologetic coughing, takes his leave, lightened in heart. Mr. Tulkinghorn goes upstairs, saying to himself, \"These women were created to give trouble the whole earth over. The mistress not being enough to deal with, here's the maid now! But I will be short with THIS jade at least!\"\nSo saying, he unlocks his door, gropes his way into his murky rooms, lights his candles, and looks about him. It is too dark to see much of the Allegory overhead there, but that importunate Roman, who is for ever toppling out of the clouds and pointing, is at his old work pretty distinctly. Not honouring him with much attention, Mr. Tulkinghorn takes a small key from his pocket, unlocks a drawer in which there is another key, which unlocks a chest in which there is another, and so comes to the cellar-key, with which he prepares to descend to the regions of old wine. He is going towards the door with a candle in his hand when a knock comes.\n\"Who's this? Aye, aye, mistress, it's you, is it? You appear at a good time. I have just been hearing of you. Now! What do you want?\"\nHe stands the candle on the chimney-piece in the clerk's hall and taps his dry cheek with the key as he addresses these words of welcome to Mademoiselle Hortense. That feline personage, with her lips tightly shut and her eyes looking out at him sideways, softly closes the door before replying.\n\"I have had great deal of trouble to find you, sir.\"\n\"HAVE you!\"\n\"I have been here very often, sir. It has always been said to me, he is not at home, he is engage, he is this and that, he is not for you.\"\n\"Quite right, and quite true.\"\n\"Not true. Lies!\"\nAt times there is a suddenness in the manner of Mademoiselle Hortense so like a bodily spring upon the subject of it that such subject involuntarily starts and fails back. It is Mr. Tulkinghorn's case at present, though Mademoiselle Hortense, with her eyes almost shut up (but still looking out sideways), is only smiling contemptuously and shaking her head.\n\"Now, mistress,\" says the lawyer, tapping the key hastily upon the chimney-piece. \"If you have anything to say, say it, say it.\"\n\"Sir, you have not use me well. You have been mean and shabby.\"\n\"Mean and shabby, eh?\" returns the lawyer, rubbing his nose with the key.\n\"Yes. What is it that I tell you? You know you have. You have attrapped me--catched me--to give you information; you have asked me to show you the dress of mine my Lady must have wore that night, you have prayed me to come in it here to meet that boy. Say! Is it not?\" Mademoiselle Hortense makes another spring.\n\"You are a vixen, a vixen!\" Mr. Tulkinghorn seems to meditate as he looks distrustfully at her, then he replies, \"Well, wench, well. I paid you.\"\n\"You paid me!\" she repeats with fierce disdain. \"Two sovereign! I have not change them, I re-fuse them, I des-pise them, I throw them from me!\" Which she literally does, taking them out of her bosom as she speaks and flinging them with such violence on the floor that they jerk up again into the light before they roll away into corners and slowly settle down there after spinning vehemently.\n\"Now!\" says Mademoiselle Hortense, darkening her large eyes again. \"You have paid me? Eh, my God, oh yes!\"\nMr. Tulkinghorn rubs his head with the key while she entertains herself with a sarcastic laugh.\n\"You must be rich, my fair friend,\" he composedly observes, \"to throw money about in that way!\"\n\"I AM rich,\" she returns. \"I am very rich in hate. I hate my Lady, of all my heart. You know that.\"\n\"Know it? How should I know it?\"\n\"Because you have known it perfectly before you prayed me to give you that information. Because you have known perfectly that I was en-r-r-r-raged!\" It appears impossible for mademoiselle to roll the letter \"r\" sufficiently in this word, notwithstanding that she assists her energetic delivery by clenching both her hands and setting all her teeth.\n\"Oh! I knew that, did I?\" says Mr. Tulkinghorn, examining the wards of the key.\n\"Yes, without doubt. I am not blind. You have made sure of me because you knew that. You had reason! I det-est her.\" Mademoiselle Hortense folds her arms and throws this last remark at him over one of her shoulders.\n\"Having said this, have you anything else to say, mademoiselle?\"\n\"I am not yet placed. Place me well. Find me a good condition! If you cannot, or do not choose to do that, employ me to pursue her, to chase her, to disgrace and to dishonour her. I will help you well, and with a good will. It is what YOU do. Do I not know that?\"\n\"You appear to know a good deal,\" Mr. Tulkinghorn retorts.\n\"Do I not? Is it that I am so weak as to believe, like a child, that I come here in that dress to rec-eive that boy only to decide a little bet, a wager? Eh, my God, oh yes!\" In this reply, down to the word \"wager\" inclusive, mademoiselle has been ironically polite and tender, then as suddenly dashed into the bitterest and most defiant scorn, with her black eyes in one and the same moment very nearly shut and staringly wide open.\n\"Now, let us see,\" says Mr. Tulkinghorn, tapping his chin with the key and looking imperturbably at her, \"how this matter stands.\"\n\"Ah! Let us see,\" mademoiselle assents, with many angry and tight nods of her head.\n\"You come here to make a remarkably modest demand, which you have just stated, and it not being conceded, you will come again.\"\n\"And again,\" says mademoiselle with more tight and angry nods. \"And yet again. And yet again. And many times again. In effect, for ever!\"\n\"And not only here, but you will go to Mr. Snagsby's too, perhaps? That visit not succeeding either, you will go again perhaps?\"\n\"And again,\" repeats mademoiselle, cataleptic with determination. \"And yet again. And yet again. And many times again. In effect, for ever!\"\n\"Very well. Now, Mademoiselle Hortense, let me recommend you to take the candle and pick up that money of yours. I think you will find it behind the clerk's partition in the corner yonder.\"\nShe merely throws a laugh over her shoulder and stands her ground with folded arms.\n\"You will not, eh?\"\n\"No, I will not!\"\n\"So much the poorer you; so much the richer I! Look, mistress, this is the key of my wine-cellar. It is a large key, but the keys of prisons are larger. In this city there are houses of correction (where the treadmills are, for women), the gates of which are very strong and heavy, and no doubt the keys too. I am afraid a lady of your spirit and activity would find it an inconvenience to have one of those keys turned upon her for any length of time. What do you think?\"\n\"I think,\" mademoiselle replies without any action and in a clear, obliging voice, \"that you are a miserable wretch.\"\n\"Probably,\" returns Mr. Tulkinghorn, quietly blowing his nose. \"But I don't ask what you think of myself; I ask what you think of the prison.\"\n\"Nothing. What does it matter to me?\"\n\"Why, it matters this much, mistress,\" says the lawyer, deliberately putting away his handkerchief and adjusting his frill; \"the law is so despotic here that it interferes to prevent any of our good English citizens from being troubled, even by a lady's visits against his desire. And on his complaining that he is so troubled, it takes hold of the troublesome lady and shuts her up in prison under hard discipline. Turns the key upon her, mistress.\" Illustrating with the cellar-key.\n\"Truly?\" returns mademoiselle in the same pleasant voice. \"That is droll! But--my faith!--still what does it matter to me?\"\n\"My fair friend,\" says Mr. Tulkinghorn, \"make another visit here, or at Mr. Snagsby's, and you shall learn.\"\n\"In that case you will send me to the prison, perhaps?\"\n\"Perhaps.\"\nIt would be contradictory for one in mademoiselle's state of agreeable jocularity to foam at the mouth, otherwise a tigerish expansion thereabouts might look as if a very little more would make her do it.\n\"In a word, mistress,\" says Mr. Tulkinghorn, \"I am sorry to be unpolite, but if you ever present yourself uninvited here--or there--again, I will give you over to the police. Their gallantry is great, but they carry troublesome people through the streets in an ignominious manner, strapped down on a board, my good wench.\"\n\"I will prove you,\" whispers mademoiselle, stretching out her hand, \"I will try if you dare to do it!\"\n\"And if,\" pursues the lawyer without minding her, \"I place you in that good condition of being locked up in jail, it will be some time before you find yourself at liberty again.\"\n\"I will prove you,\" repeats mademoiselle in her former whisper.\n\"And now,\" proceeds the lawyer, still without minding her, \"you had better go. Think twice before you come here again.\"\n\"Think you,\" she answers, \"twice two hundred times!\"\n\"You were dismissed by your lady, you know,\" Mr. Tulkinghorn observes, following her out upon the staircase, \"as the most implacable and unmanageable of women. Now turn over a new leaf and take warning by what I say to you. For what I say, I mean; and what I threaten, I will do, mistress.\"\nShe goes down without answering or looking behind her. When she is gone, he goes down too, and returning with his cobweb-covered bottle, devotes himself to a leisurely enjoyment of its contents, now and then, as he throws his head back in his chair, catching sight of the pertinacious Roman pointing from the ceiling.",
        "paragraph_chars": [
            [
                0,
                572
            ],
            [
                572,
                1195
            ],
            [
                1195,
                1499
            ],
            [
                1499,
                1518
            ],
            [
                1518,
                1603
            ],
            [
                1603,
                1648
            ],
            [
                1648,
                1806
            ],
            [
                1806,
                1829
            ],
            [
                1829,
                1847
            ],
            [
                1847,
                1994
            ],
            [
                1994,
                2134
            ],
            [
                2134,
                2197
            ],
            [
                2197,
                2519
            ],
            [
                2519,
                2558
            ],
            [
                2558,
                2890
            ],
            [
                2890,
                2969
            ],
            [
                2969,
                3557
            ],
            [
                3557,
                3683
            ],
            [
                3683,
                3730
            ],
            [
                3730,
                5572
            ],
            [
                5572,
                5707
            ],
            [
                5707,
                5823
            ],
            [
                5823,
                5919
            ],
            [
                5919,
                6090
            ],
            [
                6090,
                6225
            ],
            [
                6225,
                6548
            ],
            [
                6548,
                7196
            ],
            [
                7196,
                7330
            ],
            [
                7330,
                7625
            ],
            [
                7625,
                7678
            ],
            [
                7678,
                7690
            ],
            [
                7690,
                7830
            ],
            [
                7830,
                7861
            ],
            [
                7861,
                7879
            ],
            [
                7879,
                8238
            ],
            [
                8238,
                8367
            ],
            [
                8367,
                8431
            ],
            [
                8431,
                8505
            ],
            [
                8505,
                8818
            ],
            [
                8818,
                8964
            ],
            [
                8964,
                9357
            ],
            [
                9357,
                9464
            ],
            [
                9464,
                9560
            ],
            [
                9560,
                9656
            ],
            [
                9656,
                9756
            ],
            [
                9756,
                9789
            ],
            [
                9789,
                10138
            ],
            [
                10138,
                10218
            ],
            [
                10218,
                10434
            ],
            [
                10434,
                10499
            ],
            [
                10499,
                10763
            ],
            [
                10763,
                10822
            ],
            [
                10822,
                11256
            ],
            [
                11256,
                11387
            ],
            [
                11387,
                11471
            ],
            [
                11471,
                11599
            ],
            [
                11599,
                11737
            ],
            [
                11737,
                11866
            ],
            [
                11866,
                12007
            ],
            [
                12007,
                12197
            ],
            [
                12197,
                12281
            ],
            [
                12281,
                12301
            ],
            [
                12301,
                12319
            ],
            [
                12319,
                12792
            ],
            [
                12792,
                12910
            ],
            [
                12910,
                13053
            ],
            [
                13053,
                13091
            ],
            [
                13091,
                13576
            ],
            [
                13576,
                13700
            ],
            [
                13700,
                13809
            ],
            [
                13809,
                13865
            ],
            [
                13865,
                13876
            ],
            [
                13876,
                14081
            ],
            [
                14081,
                14404
            ],
            [
                14404,
                14507
            ],
            [
                14507,
                14686
            ],
            [
                14686,
                14750
            ],
            [
                14750,
                14870
            ],
            [
                14870,
                14923
            ],
            [
                14923,
                15214
            ],
            [
                15214,
                15531
            ]
        ],
        "segment_chars": [
            [
                0,
                149
            ],
            [
                149,
                236
            ],
            [
                236,
                384
            ],
            [
                384,
                460
            ],
            [
                460,
                572
            ],
            [
                572,
                1025
            ],
            [
                1025,
                1195
            ],
            [
                1195,
                1363
            ],
            [
                1363,
                1499
            ],
            [
                1499,
                1518
            ],
            [
                1518,
                1529
            ],
            [
                1529,
                1555
            ],
            [
                1555,
                1603
            ],
            [
                1603,
                1609
            ],
            [
                1609,
                1621
            ],
            [
                1621,
                1648
            ],
            [
                1648,
                1806
            ],
            [
                1806,
                1829
            ],
            [
                1829,
                1847
            ],
            [
                1847,
                1862
            ],
            [
                1862,
                1994
            ],
            [
                1994,
                2134
            ],
            [
                2134,
                2179
            ],
            [
                2179,
                2197
            ],
            [
                2197,
                2223
            ],
            [
                2223,
                2251
            ],
            [
                2251,
                2398
            ],
            [
                2398,
                2519
            ],
            [
                2519,
                2524
            ],
            [
                2524,
                2534
            ],
            [
                2534,
                2558
            ],
            [
                2558,
                2573
            ],
            [
                2573,
                2632
            ],
            [
                2632,
                2740
            ],
            [
                2740,
                2890
            ],
            [
                2890,
                2969
            ],
            [
                2969,
                3078
            ],
            [
                3078,
                3218
            ],
            [
                3218,
                3291
            ],
            [
                3291,
                3524
            ],
            [
                3524,
                3557
            ],
            [
                3557,
                3683
            ],
            [
                3683,
                3708
            ],
            [
                3708,
                3730
            ],
            [
                3730,
                3919
            ],
            [
                3919,
                4150
            ],
            [
                4150,
                4567
            ],
            [
                4567,
                4676
            ],
            [
                4676,
                4928
            ],
            [
                4928,
                5069
            ],
            [
                5069,
                5130
            ],
            [
                5130,
                5307
            ],
            [
                5307,
                5536
            ],
            [
                5536,
                5572
            ],
            [
                5572,
                5707
            ],
            [
                5707,
                5823
            ],
            [
                5823,
                5919
            ],
            [
                5919,
                6090
            ],
            [
                6090,
                6112
            ],
            [
                6112,
                6125
            ],
            [
                6125,
                6148
            ],
            [
                6148,
                6189
            ],
            [
                6189,
                6225
            ],
            [
                6225,
                6323
            ],
            [
                6323,
                6437
            ],
            [
                6437,
                6502
            ],
            [
                6502,
                6548
            ],
            [
                6548,
                6658
            ],
            [
                6658,
                6840
            ],
            [
                6840,
                7121
            ],
            [
                7121,
                7196
            ],
            [
                7196,
                7209
            ],
            [
                7209,
                7246
            ],
            [
                7246,
                7273
            ],
            [
                7273,
                7306
            ],
            [
                7306,
                7311
            ],
            [
                7311,
                7330
            ],
            [
                7330,
                7493
            ],
            [
                7493,
                7625
            ],
            [
                7625,
                7678
            ],
            [
                7678,
                7690
            ],
            [
                7690,
                7725
            ],
            [
                7725,
                7830
            ],
            [
                7830,
                7861
            ],
            [
                7861,
                7872
            ],
            [
                7872,
                7879
            ],
            [
                7879,
                8051
            ],
            [
                8051,
                8238
            ],
            [
                8238,
                8320
            ],
            [
                8320,
                8367
            ],
            [
                8367,
                8399
            ],
            [
                8399,
                8431
            ],
            [
                8431,
                8454
            ],
            [
                8454,
                8505
            ],
            [
                8505,
                8511
            ],
            [
                8511,
                8539
            ],
            [
                8539,
                8558
            ],
            [
                8558,
                8757
            ],
            [
                8757,
                8762
            ],
            [
                8762,
                8774
            ],
            [
                8774,
                8818
            ],
            [
                8818,
                8846
            ],
            [
                8846,
                8951
            ],
            [
                8951,
                8964
            ],
            [
                8964,
                8979
            ],
            [
                8979,
                9012
            ],
            [
                9012,
                9028
            ],
            [
                9028,
                9108
            ],
            [
                9108,
                9357
            ],
            [
                9357,
                9364
            ],
            [
                9364,
                9424
            ],
            [
                9424,
                9443
            ],
            [
                9443,
                9464
            ],
            [
                9464,
                9560
            ],
            [
                9560,
                9656
            ],
            [
                9656,
                9682
            ],
            [
                9682,
                9707
            ],
            [
                9707,
                9740
            ],
            [
                9740,
                9756
            ],
            [
                9756,
                9766
            ],
            [
                9766,
                9789
            ],
            [
                9789,
                9877
            ],
            [
                9877,
                9938
            ],
            [
                9938,
                10138
            ],
            [
                10138,
                10143
            ],
            [
                10143,
                10164
            ],
            [
                10164,
                10218
            ],
            [
                10218,
                10239
            ],
            [
                10239,
                10255
            ],
            [
                10255,
                10303
            ],
            [
                10303,
                10319
            ],
            [
                10319,
                10335
            ],
            [
                10335,
                10434
            ],
            [
                10434,
                10499
            ],
            [
                10499,
                10521
            ],
            [
                10521,
                10536
            ],
            [
                10536,
                10562
            ],
            [
                10562,
                10679
            ],
            [
                10679,
                10723
            ],
            [
                10723,
                10742
            ],
            [
                10742,
                10763
            ],
            [
                10763,
                10822
            ],
            [
                10822,
                10833
            ],
            [
                10833,
                10976
            ],
            [
                10976,
                10997
            ],
            [
                10997,
                11256
            ],
            [
                11256,
                11387
            ],
            [
                11387,
                11392
            ],
            [
                11392,
                11471
            ],
            [
                11471,
                11599
            ],
            [
                11599,
                11662
            ],
            [
                11662,
                11678
            ],
            [
                11678,
                11693
            ],
            [
                11693,
                11715
            ],
            [
                11715,
                11737
            ],
            [
                11737,
                11804
            ],
            [
                11804,
                11866
            ],
            [
                11866,
                11932
            ],
            [
                11932,
                11948
            ],
            [
                11948,
                11963
            ],
            [
                11963,
                11985
            ],
            [
                11985,
                12007
            ],
            [
                12007,
                12019
            ],
            [
                12019,
                12120
            ],
            [
                12120,
                12197
            ],
            [
                12197,
                12281
            ],
            [
                12281,
                12301
            ],
            [
                12301,
                12319
            ],
            [
                12319,
                12366
            ],
            [
                12366,
                12417
            ],
            [
                12417,
                12472
            ],
            [
                12472,
                12628
            ],
            [
                12628,
                12772
            ],
            [
                12772,
                12792
            ],
            [
                12792,
                12910
            ],
            [
                12910,
                12973
            ],
            [
                12973,
                13053
            ],
            [
                13053,
                13063
            ],
            [
                13063,
                13091
            ],
            [
                13091,
                13372
            ],
            [
                13372,
                13507
            ],
            [
                13507,
                13542
            ],
            [
                13542,
                13576
            ],
            [
                13576,
                13585
            ],
            [
                13585,
                13634
            ],
            [
                13634,
                13650
            ],
            [
                13650,
                13700
            ],
            [
                13700,
                13809
            ],
            [
                13809,
                13865
            ],
            [
                13865,
                13876
            ],
            [
                13876,
                14081
            ],
            [
                14081,
                14256
            ],
            [
                14256,
                14404
            ],
            [
                14404,
                14507
            ],
            [
                14507,
                14686
            ],
            [
                14686,
                14750
            ],
            [
                14750,
                14829
            ],
            [
                14829,
                14870
            ],
            [
                14870,
                14923
            ],
            [
                14923,
                15083
            ],
            [
                15083,
                15147
            ],
            [
                15147,
                15214
            ],
            [
                15214,
                15269
            ],
            [
                15269,
                15531
            ]
        ],
        "overlap_chars": [
            [
                0,
                4
            ],
            [
                33,
                149
            ],
            [
                149,
                205
            ],
            [
                234,
                236
            ],
            [
                236,
                384
            ],
            [
                384,
                460
            ],
            [
                460,
                572
            ],
            [
                572,
                596
            ],
            [
                740,
                870
            ],
            [
                1002,
                1025
            ],
            [
                1025,
                1084
            ],
            [
                1103,
                1195
            ],
            [
                1195,
                1290
            ],
            [
                1338,
                1341
            ],
            [
                1300,
                1301
            ],
            [
                1361,
                1363
            ],
            [
                1396,
                1423
            ],
            [
                1429,
                1442
            ],
            [
                1461,
                1499
            ],
            [
                1499,
                1518
            ],
            [
                1518,
                1529
            ],
            [
                1529,
                1555
            ],
            [
                1764,
                1806
            ],
            [
                1847,
                1861
            ],
            [
                1994,
                2057
            ],
            [
                2110,
                2134
            ],
            [
                2134,
                2179
            ],
            [
                2179,
                2197
            ],
            [
                2197,
                2223
            ],
            [
                2223,
                2251
            ],
            [
                2398,
                2466
            ],
            [
                2480,
                2519
            ],
            [
                2519,
                2524
            ],
            [
                2529,
                2534
            ],
            [
                2534,
                2555
            ],
            [
                2891,
                2899
            ],
            [
                2957,
                2966
            ],
            [
                2919,
                2928
            ],
            [
                2966,
                2969
            ],
            [
                2969,
                3003
            ],
            [
                3043,
                3078
            ],
            [
                3078,
                3113
            ],
            [
                3123,
                3124
            ],
            [
                3169,
                3218
            ],
            [
                3291,
                3382
            ],
            [
                3473,
                3478
            ],
            [
                3480,
                3492
            ],
            [
                3494,
                3508
            ],
            [
                3510,
                3524
            ],
            [
                3524,
                3540
            ],
            [
                3549,
                3557
            ],
            [
                3557,
                3568
            ],
            [
                3582,
                3613
            ],
            [
                3681,
                3683
            ],
            [
                3683,
                3708
            ],
            [
                3708,
                3730
            ],
            [
                3919,
                3926
            ],
            [
                3985,
                3986
            ],
            [
                3926,
                3946
            ],
            [
                4031,
                4062
            ],
            [
                4085,
                4114
            ],
            [
                4125,
                4150
            ],
            [
                4150,
                4249
            ],
            [
                4251,
                4267
            ],
            [
                4416,
                4447
            ],
            [
                4565,
                4567
            ],
            [
                4567,
                4589
            ],
            [
                4606,
                4676
            ],
            [
                4676,
                4680
            ],
            [
                4783,
                4786
            ],
            [
                4693,
                4697
            ],
            [
                4681,
                4684
            ],
            [
                4792,
                4795
            ],
            [
                4721,
                4727
            ],
            [
                4735,
                4737
            ],
            [
                4698,
                4714
            ],
            [
                4832,
                4841
            ],
            [
                4869,
                4880
            ],
            [
                4901,
                4928
            ],
            [
                4928,
                4957
            ],
            [
                4983,
                4999
            ],
            [
                5003,
                5052
            ],
            [
                5054,
                5069
            ],
            [
                5130,
                5212
            ],
            [
                5218,
                5247
            ],
            [
                5290,
                5305
            ],
            [
                5572,
                5587
            ],
            [
                5659,
                5662
            ],
            [
                5592,
                5608
            ],
            [
                5673,
                5707
            ],
            [
                5707,
                5720
            ],
            [
                5732,
                5751
            ],
            [
                5823,
                5918
            ],
            [
                6112,
                6125
            ],
            [
                6125,
                6148
            ],
            [
                6189,
                6225
            ],
            [
                6225,
                6254
            ],
            [
                6284,
                6323
            ],
            [
                6323,
                6437
            ],
            [
                6437,
                6502
            ],
            [
                6502,
                6548
            ],
            [
                6548,
                6558
            ],
            [
                6562,
                6615
            ],
            [
                6637,
                6640
            ],
            [
                6617,
                6635
            ],
            [
                6656,
                6658
            ],
            [
                6895,
                6900
            ],
            [
                6918,
                6921
            ],
            [
                7047,
                7121
            ],
            [
                7121,
                7196
            ],
            [
                7196,
                7209
            ],
            [
                7209,
                7246
            ],
            [
                7273,
                7297
            ],
            [
                7301,
                7306
            ],
            [
                7306,
                7311
            ],
            [
                7311,
                7330
            ],
            [
                7431,
                7455
            ],
            [
                7467,
                7493
            ],
            [
                7493,
                7514
            ],
            [
                7585,
                7625
            ],
            [
                7625,
                7675
            ],
            [
                7725,
                7830
            ],
            [
                7830,
                7861
            ],
            [
                7861,
                7872
            ],
            [
                7872,
                7879
            ],
            [
                8059,
                8072
            ],
            [
                8014,
                8038
            ],
            [
                8045,
                8049
            ],
            [
                8090,
                8147
            ],
            [
                8185,
                8238
            ],
            [
                8238,
                8271
            ],
            [
                8320,
                8356
            ],
            [
                8364,
                8367
            ],
            [
                8367,
                8399
            ],
            [
                8399,
                8428
            ],
            [
                8558,
                8579
            ],
            [
                8581,
                8591
            ],
            [
                8593,
                8757
            ],
            [
                8757,
                8762
            ],
            [
                8762,
                8773
            ],
            [
                8818,
                8834
            ],
            [
                8843,
                8846
            ],
            [
                8846,
                8861
            ],
            [
                8886,
                8912
            ],
            [
                8949,
                8951
            ],
            [
                8951,
                8964
            ],
            [
                8964,
                8979
            ],
            [
                8979,
                9012
            ],
            [
                9012,
                9028
            ],
            [
                9028,
                9029
            ],
            [
                9046,
                9053
            ],
            [
                9079,
                9108
            ],
            [
                9108,
                9117
            ],
            [
                9128,
                9133
            ],
            [
                9181,
                9236
            ],
            [
                9345,
                9355
            ],
            [
                9266,
                9272
            ],
            [
                9283,
                9300
            ],
            [
                9355,
                9357
            ],
            [
                9464,
                9493
            ],
            [
                9558,
                9559
            ],
            [
                9560,
                9656
            ],
            [
                9656,
                9682
            ],
            [
                9682,
                9707
            ],
            [
                9707,
                9740
            ],
            [
                9740,
                9756
            ],
            [
                9756,
                9766
            ],
            [
                9766,
                9789
            ],
            [
                9789,
                9877
            ],
            [
                9877,
                9937
            ],
            [
                10434,
                10435
            ],
            [
                10453,
                10499
            ],
            [
                10499,
                10519
            ],
            [
                10519,
                10521
            ],
            [
                10536,
                10550
            ],
            [
                10560,
                10562
            ],
            [
                10562,
                10576
            ],
            [
                10606,
                10625
            ],
            [
                10640,
                10679
            ],
            [
                10679,
                10700
            ],
            [
                10705,
                10723
            ],
            [
                10723,
                10742
            ],
            [
                10742,
                10763
            ],
            [
                10763,
                10822
            ],
            [
                10844,
                10848
            ],
            [
                10849,
                10916
            ],
            [
                10938,
                10974
            ],
            [
                11048,
                11060
            ],
            [
                11000,
                11004
            ],
            [
                11167,
                11171
            ],
            [
                11133,
                11165
            ],
            [
                11254,
                11256
            ],
            [
                11256,
                11322
            ],
            [
                11323,
                11326
            ],
            [
                11359,
                11384
            ],
            [
                11472,
                11521
            ],
            [
                11550,
                11553
            ],
            [
                11554,
                11556
            ],
            [
                11557,
                11560
            ],
            [
                11567,
                11599
            ],
            [
                11599,
                11662
            ],
            [
                11662,
                11678
            ],
            [
                11678,
                11691
            ],
            [
                11737,
                11802
            ],
            [
                11866,
                11899
            ],
            [
                11930,
                11932
            ],
            [
                11932,
                11948
            ],
            [
                11948,
                11963
            ],
            [
                11985,
                12007
            ],
            [
                12007,
                12019
            ],
            [
                12019,
                12070
            ],
            [
                12091,
                12118
            ],
            [
                12197,
                12207
            ],
            [
                12241,
                12281
            ],
            [
                12281,
                12301
            ],
            [
                12301,
                12319
            ],
            [
                12319,
                12342
            ],
            [
                12364,
                12366
            ],
            [
                12366,
                12417
            ],
            [
                12417,
                12470
            ],
            [
                12599,
                12604
            ],
            [
                12559,
                12564
            ],
            [
                12574,
                12599
            ],
            [
                12626,
                12628
            ],
            [
                12628,
                12639
            ],
            [
                12675,
                12743
            ],
            [
                12748,
                12772
            ],
            [
                12772,
                12792
            ],
            [
                12792,
                12823
            ],
            [
                12847,
                12857
            ],
            [
                12868,
                12910
            ],
            [
                12910,
                12946
            ],
            [
                12973,
                12977
            ],
            [
                13016,
                13039
            ],
            [
                13044,
                13053
            ],
            [
                13053,
                13063
            ],
            [
                13063,
                13091
            ],
            [
                13091,
                13096
            ],
            [
                13119,
                13127
            ],
            [
                13117,
                13118
            ],
            [
                13216,
                13223
            ],
            [
                13252,
                13351
            ],
            [
                13370,
                13372
            ],
            [
                13372,
                13483
            ],
            [
                13505,
                13507
            ],
            [
                13507,
                13542
            ],
            [
                13542,
                13576
            ],
            [
                13576,
                13585
            ],
            [
                13585,
                13634
            ],
            [
                13634,
                13650
            ],
            [
                13650,
                13653
            ],
            [
                13666,
                13671
            ],
            [
                13672,
                13700
            ],
            [
                13700,
                13765
            ],
            [
                13787,
                13806
            ],
            [
                13774,
                13775
            ],
            [
                14158,
                14201
            ],
            [
                14213,
                14226
            ],
            [
                14232,
                14256
            ],
            [
                14286,
                14335
            ],
            [
                14362,
                14404
            ],
            [
                14404,
                14411
            ],
            [
                14418,
                14445
            ],
            [
                14472,
                14479
            ],
            [
                14484,
                14507
            ],
            [
                14750,
                14781
            ],
            [
                14788,
                14829
            ],
            [
                14829,
                14867
            ],
            [
                14924,
                14965
            ],
            [
                14992,
                14993
            ],
            [
                15033,
                15044
            ],
            [
                15060,
                15083
            ],
            [
                15087,
                15124
            ],
            [
                15145,
                15147
            ],
            [
                15147,
                15201
            ],
            [
                15211,
                15214
            ],
            [
                15214,
                15222
            ],
            [
                15223,
                15227
            ],
            [
                15228,
                15245
            ],
            [
                15267,
                15268
            ],
            [
                15269,
                15350
            ],
            [
                15445,
                15463
            ],
            [
                15413,
                15416
            ],
            [
                15351,
                15407
            ],
            [
                15530,
                15531
            ]
        ],
        "row_chars": [
            [
                0,
                149
            ],
            [
                149,
                236
            ],
            [
                236,
                384
            ],
            [
                384,
                460
            ],
            [
                460,
                572
            ],
            [
                572,
                1025
            ],
            [
                1025,
                1195
            ],
            [
                1195,
                1363
            ],
            [
                1363,
                1499
            ],
            [
                1499,
                1518
            ],
            [
                1518,
                1529
            ],
            [
                1529,
                1555
            ],
            [
                1555,
                1603
            ],
            [
                1603,
                1609
            ],
            [
                1609,
                1621
            ],
            [
                1621,
                1648
            ],
            [
                1648,
                1806
            ],
            [
                1806,
                1829
            ],
            [
                1829,
                1847
            ],
            [
                1847,
                1862
            ],
            [
                1862,
                1994
            ],
            [
                1994,
                2134
            ],
            [
                2134,
                2179
            ],
            [
                2179,
                2197
            ],
            [
                2197,
                2223
            ],
            [
                2223,
                2251
            ],
            [
                2251,
                2398
            ],
            [
                2398,
                2519
            ],
            [
                2519,
                2524
            ],
            [
                2524,
                2534
            ],
            [
                2534,
                2558
            ],
            [
                2558,
                2573
            ],
            [
                2573,
                2632
            ],
            [
                2632,
                2740
            ],
            [
                2740,
                2890
            ],
            [
                2890,
                2969
            ],
            [
                2969,
                3078
            ],
            [
                3078,
                3218
            ],
            [
                3218,
                3291
            ],
            [
                3291,
                3524
            ],
            [
                3524,
                3557
            ],
            [
                3557,
                3683
            ],
            [
                3683,
                3708
            ],
            [
                3708,
                3730
            ],
            [
                3730,
                3919
            ],
            [
                3919,
                4150
            ],
            [
                4150,
                4567
            ],
            [
                4567,
                4676
            ],
            [
                4676,
                4928
            ],
            [
                4928,
                5069
            ],
            [
                5069,
                5130
            ],
            [
                5130,
                5307
            ],
            [
                5307,
                5536
            ],
            [
                5536,
                5572
            ],
            [
                5572,
                5707
            ],
            [
                5707,
                5823
            ],
            [
                5823,
                5919
            ],
            [
                5919,
                6090
            ],
            [
                6090,
                6112
            ],
            [
                6112,
                6125
            ],
            [
                6125,
                6148
            ],
            [
                6148,
                6189
            ],
            [
                6189,
                6225
            ],
            [
                6225,
                6323
            ],
            [
                6323,
                6437
            ],
            [
                6437,
                6502
            ],
            [
                6502,
                6548
            ],
            [
                6548,
                6658
            ],
            [
                6658,
                6840
            ],
            [
                6840,
                7121
            ],
            [
                7121,
                7196
            ],
            [
                7196,
                7209
            ],
            [
                7209,
                7246
            ],
            [
                7246,
                7273
            ],
            [
                7273,
                7306
            ],
            [
                7306,
                7311
            ],
            [
                7311,
                7330
            ],
            [
                7330,
                7493
            ],
            [
                7493,
                7625
            ],
            [
                7625,
                7678
            ],
            [
                7678,
                7690
            ],
            [
                7690,
                7725
            ],
            [
                7725,
                7830
            ],
            [
                7830,
                7861
            ],
            [
                7861,
                7872
            ],
            [
                7872,
                7879
            ],
            [
                7879,
                8238
            ],
            [
                8238,
                8367
            ],
            [
                8367,
                8399
            ],
            [
                8399,
                8431
            ],
            [
                8431,
                8454
            ],
            [
                8454,
                8505
            ],
            [
                8505,
                8511
            ],
            [
                8511,
                8539
            ],
            [
                8539,
                8558
            ],
            [
                8558,
                8757
            ],
            [
                8757,
                8762
            ],
            [
                8762,
                8774
            ],
            [
                8774,
                8818
            ],
            [
                8818,
                8846
            ],
            [
                8846,
                8951
            ],
            [
                8951,
                8964
            ],
            [
                8964,
                8979
            ],
            [
                8979,
                9012
            ],
            [
                9012,
                9028
            ],
            [
                9028,
                9108
            ],
            [
                9108,
                9357
            ],
            [
                9357,
                9364
            ],
            [
                9364,
                9424
            ],
            [
                9424,
                9443
            ],
            [
                9443,
                9464
            ],
            [
                9464,
                9560
            ],
            [
                9560,
                9656
            ],
            [
                9656,
                9682
            ],
            [
                9682,
                9707
            ],
            [
                9707,
                9740
            ],
            [
                9740,
                9756
            ],
            [
                9756,
                9766
            ],
            [
                9766,
                9789
            ],
            [
                9789,
                9877
            ],
            [
                9877,
                9938
            ],
            [
                9938,
                10138
            ],
            [
                10138,
                10143
            ],
            [
                10143,
                10164
            ],
            [
                10164,
                10218
            ],
            [
                10218,
                10239
            ],
            [
                10239,
                10255
            ],
            [
                10255,
                10303
            ],
            [
                10303,
                10319
            ],
            [
                10319,
                10335
            ],
            [
                10335,
                10434
            ],
            [
                10434,
                10499
            ],
            [
                10499,
                10521
            ],
            [
                10521,
                10536
            ],
            [
                10536,
                10562
            ],
            [
                10562,
                10679
            ],
            [
                10679,
                10723
            ],
            [
                10723,
                10742
            ],
            [
                10742,
                10763
            ],
            [
                10763,
                10822
            ],
            [
                10822,
                10833
            ],
            [
                10833,
                10976
            ],
            [
                10976,
                10997
            ],
            [
                10997,
                11256
            ],
            [
                11256,
                11387
            ],
            [
                11387,
                11392
            ],
            [
                11392,
                11471
            ],
            [
                11471,
                11599
            ],
            [
                11599,
                11662
            ],
            [
                11662,
                11678
            ],
            [
                11678,
                11693
            ],
            [
                11693,
                11715
            ],
            [
                11715,
                11737
            ],
            [
                11737,
                11804
            ],
            [
                11804,
                11866
            ],
            [
                11866,
                11932
            ],
            [
                11932,
                11948
            ],
            [
                11948,
                11963
            ],
            [
                11963,
                11985
            ],
            [
                11985,
                12007
            ],
            [
                12007,
                12019
            ],
            [
                12019,
                12120
            ],
            [
                12120,
                12197
            ],
            [
                12197,
                12281
            ],
            [
                12281,
                12301
            ],
            [
                12301,
                12319
            ],
            [
                12319,
                12366
            ],
            [
                12366,
                12417
            ],
            [
                12417,
                12628
            ],
            [
                12628,
                12772
            ],
            [
                12772,
                12792
            ],
            [
                12792,
                12910
            ],
            [
                12910,
                13053
            ],
            [
                13053,
                13063
            ],
            [
                13063,
                13091
            ],
            [
                13091,
                13372
            ],
            [
                13372,
                13507
            ],
            [
                13507,
                13542
            ],
            [
                13542,
                13576
            ],
            [
                13576,
                13585
            ],
            [
                13585,
                13634
            ],
            [
                13634,
                13650
            ],
            [
                13650,
                13700
            ],
            [
                13700,
                13809
            ],
            [
                13809,
                13865
            ],
            [
                13865,
                13876
            ],
            [
                13876,
                14081
            ],
            [
                14081,
                14256
            ],
            [
                14256,
                14404
            ],
            [
                14404,
                14507
            ],
            [
                14507,
                14686
            ],
            [
                14686,
                14750
            ],
            [
                14750,
                14829
            ],
            [
                14829,
                14870
            ],
            [
                14870,
                14923
            ],
            [
                14923,
                15083
            ],
            [
                15083,
                15147
            ],
            [
                15147,
                15214
            ],
            [
                15214,
                15269
            ],
            [
                15269,
                15531
            ]
        ]
    },
    "abridged": {
        "text": "From the spreading oaks of the Dedlock property, Mr. Tulkinghorn transfers himself to the stale heat and dust of London. His manner of coming and going between the two places is a mystery. He walks into Chesney Wold as if it were next door to his chambers and returns to his chambers as if he had never been out of Lincoln's Inn Fields. He neither changes his dress before the journey nor talks of it afterwards. He melted out of his turret-room this morning, just as now, in the late twilight, he melts into his own square.\nLike a dingy London bird, the lawyer, smoke-dried and faded, dwelling among mankind but not consorting with them, aged without experience of genial youth, comes sauntering home. In the oven made by the hot pavements and hot buildings, he is dryer than usual; and he has in his thirsty mind his mellowed port-wine half a century old.\nThe lamplighter is skipping up and down his ladder on Mr. Tulkinghorn's side of the Fields when the lawyer ascends his door-steps. Gliding into the dusky hall he encounters a bowing and propitiatory little man.\n\"Is that Snagsby?\"\n\"Yes, sir. I hope you are well, sir. I was wishful to say a word to you, sir.\"\n\"Say it then.\"\n\"It is relating,\" says Mr. Snagsby in a mysterious low voice, \"to the foreigner, sir!\"\nMr. Tulkinghorn eyes him with some surprise. \"What foreigner?\"\n\"The foreign female, sir. French, if I don't mistake? Her that was upstairs, sir, when Mr. Bucket and me had the honour of meeting you with the sweeping-boy that night.\"\n\"Oh! Yes. Mademoiselle Hortense. And what about her, Snagsby?\"\n\"Well, sir,\" returns the stationer, \"it falls a little hard upon me. My domestic happiness is very great, but my little woman is rather given to jealousy. And you see, a foreign female of that genteel appearance coming into the shop, and hovering, sir - in the court - you know it is - now ain't it? I only put it to you, sir.\"\nMr. Snagsby says this in a very plaintive manner.\n\"Why, what do you mean?\" asks Mr. Tulkinghorn.\n\"You see, sir, the foreign female caught up the word Snagsby that night, and made inquiry, and got the address and come at dinner-time. Now Guster, our young woman, is timid and has fits, and she, taking fright at the foreigner's looks - which are fierce - tumbled down the kitchen stairs. Consequently there was luckily ample occupation for my little woman, and only me to answer the shop. When the foreigner said that because she was always refused admission to see Mr. Tulkinghorn, she would call continually until she was let in here. Since then she has been, as I said, hovering, sir\" - Mr. Snagsby repeats the word with pathetic emphasis - \"in the court. I shouldn't wonder if it might have already given rise to the painfullest mistakes in the neighbours' minds, not to mention my little woman, sir!\"\nMr. Tulkinghorn has listened gravely. \"And that's all, is it, Snagsby?\"\n\"Why yes, sir,\" says Mr. Snagsby.\n\"I don't know what Mademoiselle Hortense may want or mean, unless she is mad,\" says the lawyer. \"Well, well! This shall be stopped. If she comes again, send her here.\"\nMr. Snagsby, with much bowing, takes his leave, lightened in heart. Mr. Tulkinghorn goes upstairs, saying to himself, \"These women were created to give trouble the whole earth over. The mistress not being enough to deal with, here's the maid now! But I will be short with this jade at least!\"\nSo saying, Mr. Tulkinghorn unlocks his door, gropes his way into his murky rooms and lights his candles. Then he takes up his cellar-key, with which he prepares to descend to the regions of old wine. He is going towards the door with a candle in his hand when a knock comes.\n\"Who's this? Aye, aye, mistress, it's you, is it? I have just been hearing about you. Now! What do you want?\"\nHe addresses these words to Mademoiselle Hortense. That feline personage softly closes the door before replying.\n\"I have had great deal of trouble to find you, sir. It has always been said to me, he is not at home, he is engage, he is this and that, he is not for you.\"\n\"Quite right, and quite true.\"\n\"Not true. Lies!\"\nMr. Tulkinghorn involuntarily starts and falls back, though Mademoiselle Hortense, with her eyes almost shut, is only smiling contemptuously and shaking her head.\n\"Now, mistress,\" says the lawyer, \"If you have anything to say, say it.\"\n\"Sir, you have not use me well. You have been mean and shabby. You have attrapped me - catched me - to give you information; you have asked me to show you the dress of mine my Lady must have wore that night, you have prayed me to come in it here to meet that boy. Say! Is it not?\"\n\"You are a vixen!\" Mr. Tulkinghorn looks distrustfully at her. \"I paid you.\"\n\"You paid me!\" she repeats with fierce disdain. \"Two sovereign! I refuse them, I despise them, I throw them from me!\" Which she does, flinging them with such violence on the floor that they spin vehemently before rolling away into corners.\nMr. Tulkinghorn rubs his head. \"You must be rich, my fair friend,\" he composedly observes, \"to throw money about in that way!\"\n\"I am rich,\" she returns. \"I am very rich in hate. I hate my Lady, of all my heart. You know that.\"\n\"Know it? How should I know it?\"\n\"Because you have known it perfectly before you prayed me to give you that information. Because you have known perfectly that I was en-r-r-r-raged!\"\n\"Have you anything else to say, mademoiselle?\"\n\"I am not yet placed in a situation. Find me a good one! If you cannot, then employ me to pursue her, to disgrace and to dishonour her. I will help you well, with a good will. It is what you do. Do I not know that?\"\n\"You appear to know a good deal,\" Mr. Tulkinghorn retorts.\n\"I am not so weak as to believe, like a child, that I come here in that dress only to decide a little bet, a wager!\" Mademoiselle says this with bitterest and most defiant scorn.\n\"Now, let us see,\" says Mr. Tulkinghorn, tapping his chin with the cellar-key, \"how this matter stands. You come here to make a remarkably modest demand, and if it is not conceded, you will come again.\"\n\"And again,\" says mademoiselle with more tight and angry nods. \"And yet again. And yet again!\"\n\"And not only here, but you will go to Mr. Snagsby's too, perhaps?\"\n\"And again,\" repeats mademoiselle. \"And yet again. And yet again. In effect, for ever!\"\n\"Very well. Now, Mademoiselle Hortense, let me recommend you to pick up that money of yours.\"\nShe merely laughs and stands her ground with folded arms.\n\"You will not, eh?\"\n\"No, I will not!\"\n\"So much the poorer you! Look, mistress, this is the key of my wine-cellar. It is a large key, but the keys of prisons are larger, and their gates are very strong and heavy. I am afraid you would find it an inconvenience to have one of those keys turned upon you for any length of time. What do you think?\"\n\"I think,\" mademoiselle replies in a clear voice, \"that you are a miserable wretch.\"\n\"Probably,\" returns Mr. Tulkinghorn, \"But I ask what you think of prison.\"\n\"Nothing. What does it matter to me?\"\n\"Why, mistress, the law in England interferes to prevent any of our good English citizens from being troubled, even by a lady's visits. And on his complaining that he is so troubled, it takes hold of the troublesome lady and shuts her up in prison. Turns the key upon her, mistress.\" Illustrating with the cellar-key.\n\"Truly?\" returns mademoiselle in the same pleasant voice. \"That is droll! But still, what does it matter to me?\"\n\"My fair friend,\" says Mr. Tulkinghorn, \"make another visit here, and you shall learn. If you ever present yourself uninvited here again, I will hand you over to the police. They carry troublesome people through the streets strapped down on a board, my good wench.\"\n\"I will test you,\" whispers mademoiselle. \"I will see if you dare to do it!\"\n\"And now,\" proceeds the lawyer, without minding her, \"you had better go. Think twice before you come here again. You were dismissed by your lady, you know, as the most unmanageable of women. Turn over a new leaf and take warning. For what I say, I mean; and what I threaten, I will do.\"\nShe goes out and down the stairs without answering.\nWhen she is gone, he goes down too, and returning with his cobweb-covered bottle, sits back in his chair, and devotes himself to a leisurely enjoyment of its contents.",
        "paragraph_chars": [
            [
                0,
                525
            ],
            [
                525,
                858
            ],
            [
                858,
                1069
            ],
            [
                1069,
                1088
            ],
            [
                1088,
                1167
            ],
            [
                1167,
                1182
            ],
            [
                1182,
                1269
            ],
            [
                1269,
                1332
            ],
            [
                1332,
                1502
            ],
            [
                1502,
                1565
            ],
            [
                1565,
                1893
            ],
            [
                1893,
                1943
            ],
            [
                1943,
                1990
            ],
            [
                1990,
                2798
            ],
            [
                2798,
                2870
            ],
            [
                2870,
                2904
            ],
            [
                2904,
                3072
            ],
            [
                3072,
                3365
            ],
            [
                3365,
                3640
            ],
            [
                3640,
                3750
            ],
            [
                3750,
                3863
            ],
            [
                3863,
                4020
            ],
            [
                4020,
                4051
            ],
            [
                4051,
                4069
            ],
            [
                4069,
                4232
            ],
            [
                4232,
                4305
            ],
            [
                4305,
                4586
            ],
            [
                4586,
                4663
            ],
            [
                4663,
                4903
            ],
            [
                4903,
                5030
            ],
            [
                5030,
                5130
            ],
            [
                5130,
                5163
            ],
            [
                5163,
                5312
            ],
            [
                5312,
                5359
            ],
            [
                5359,
                5575
            ],
            [
                5575,
                5634
            ],
            [
                5634,
                5813
            ],
            [
                5813,
                6016
            ],
            [
                6016,
                6111
            ],
            [
                6111,
                6179
            ],
            [
                6179,
                6267
            ],
            [
                6267,
                6361
            ],
            [
                6361,
                6419
            ],
            [
                6419,
                6439
            ],
            [
                6439,
                6457
            ],
            [
                6457,
                6764
            ],
            [
                6764,
                6849
            ],
            [
                6849,
                6924
            ],
            [
                6924,
                6962
            ],
            [
                6962,
                7280
            ],
            [
                7280,
                7393
            ],
            [
                7393,
                7659
            ],
            [
                7659,
                7736
            ],
            [
                7736,
                8023
            ],
            [
                8023,
                8075
            ],
            [
                8075,
                8242
            ]
        ],
        "segment_chars": [
            [
                0,
                121
            ],
            [
                121,
                189
            ],
            [
                189,
                337
            ],
            [
                337,
                413
            ],
            [
                413,
                525
            ],
            [
                525,
                703
            ],
            [
                703,
                858
            ],
            [
                858,
                989
            ],
            [
                989,
                1069
            ],
            [
                1069,
                1088
            ],
            [
                1088,
                1099
            ],
            [
                1099,
                1125
            ],
            [
                1125,
                1167
            ],
            [
                1167,
                1182
            ],
            [
                1182,
                1269
            ],
            [
                1269,
                1314
            ],
            [
                1314,
                1332
            ],
            [
                1332,
                1358
            ],
            [
                1358,
                1386
            ],
            [
                1386,
                1502
            ],
            [
                1502,
                1507
            ],
            [
                1507,
                1512
            ],
            [
                1512,
                1535
            ],
            [
                1535,
                1565
            ],
            [
                1565,
                1634
            ],
            [
                1634,
                1720
            ],
            [
                1720,
                1865
            ],
            [
                1865,
                1893
            ],
            [
                1893,
                1943
            ],
            [
                1943,
                1968
            ],
            [
                1968,
                1990
            ],
            [
                1990,
                2126
            ],
            [
                2126,
                2280
            ],
            [
                2280,
                2381
            ],
            [
                2381,
                2529
            ],
            [
                2529,
                2651
            ],
            [
                2651,
                2798
            ],
            [
                2798,
                2836
            ],
            [
                2836,
                2870
            ],
            [
                2870,
                2904
            ],
            [
                2904,
                3000
            ],
            [
                3000,
                3013
            ],
            [
                3013,
                3036
            ],
            [
                3036,
                3072
            ],
            [
                3072,
                3140
            ],
            [
                3140,
                3254
            ],
            [
                3254,
                3319
            ],
            [
                3319,
                3365
            ],
            [
                3365,
                3470
            ],
            [
                3470,
                3565
            ],
            [
                3565,
                3640
            ],
            [
                3640,
                3653
            ],
            [
                3653,
                3690
            ],
            [
                3690,
                3726
            ],
            [
                3726,
                3731
            ],
            [
                3731,
                3750
            ],
            [
                3750,
                3801
            ],
            [
                3801,
                3863
            ],
            [
                3863,
                3915
            ],
            [
                3915,
                4020
            ],
            [
                4020,
                4051
            ],
            [
                4051,
                4062
            ],
            [
                4062,
                4069
            ],
            [
                4069,
                4232
            ],
            [
                4232,
                4305
            ],
            [
                4305,
                4337
            ],
            [
                4337,
                4368
            ],
            [
                4368,
                4569
            ],
            [
                4569,
                4574
            ],
            [
                4574,
                4586
            ],
            [
                4586,
                4605
            ],
            [
                4605,
                4649
            ],
            [
                4649,
                4663
            ],
            [
                4663,
                4678
            ],
            [
                4678,
                4711
            ],
            [
                4711,
                4727
            ],
            [
                4727,
                4781
            ],
            [
                4781,
                4903
            ],
            [
                4903,
                4934
            ],
            [
                4934,
                5030
            ],
            [
                5030,
                5056
            ],
            [
                5056,
                5081
            ],
            [
                5081,
                5114
            ],
            [
                5114,
                5130
            ],
            [
                5130,
                5140
            ],
            [
                5140,
                5163
            ],
            [
                5163,
                5251
            ],
            [
                5251,
                5312
            ],
            [
                5312,
                5359
            ],
            [
                5359,
                5396
            ],
            [
                5396,
                5416
            ],
            [
                5416,
                5495
            ],
            [
                5495,
                5535
            ],
            [
                5535,
                5554
            ],
            [
                5554,
                5575
            ],
            [
                5575,
                5634
            ],
            [
                5634,
                5751
            ],
            [
                5751,
                5813
            ],
            [
                5813,
                5917
            ],
            [
                5917,
                6016
            ],
            [
                6016,
                6079
            ],
            [
                6079,
                6095
            ],
            [
                6095,
                6111
            ],
            [
                6111,
                6179
            ],
            [
                6179,
                6214
            ],
            [
                6214,
                6230
            ],
            [
                6230,
                6245
            ],
            [
                6245,
                6267
            ],
            [
                6267,
                6279
            ],
            [
                6279,
                6361
            ],
            [
                6361,
                6419
            ],
            [
                6419,
                6439
            ],
            [
                6439,
                6457
            ],
            [
                6457,
                6482
            ],
            [
                6482,
                6533
            ],
            [
                6533,
                6631
            ],
            [
                6631,
                6744
            ],
            [
                6744,
                6764
            ],
            [
                6764,
                6849
            ],
            [
                6849,
                6924
            ],
            [
                6924,
                6934
            ],
            [
                6934,
                6962
            ],
            [
                6962,
                7098
            ],
            [
                7098,
                7211
            ],
            [
                7211,
                7246
            ],
            [
                7246,
                7280
            ],
            [
                7280,
                7289
            ],
            [
                7289,
                7338
            ],
            [
                7338,
                7354
            ],
            [
                7354,
                7393
            ],
            [
                7393,
                7480
            ],
            [
                7480,
                7567
            ],
            [
                7567,
                7659
            ],
            [
                7659,
                7701
            ],
            [
                7701,
                7736
            ],
            [
                7736,
                7809
            ],
            [
                7809,
                7849
            ],
            [
                7849,
                7927
            ],
            [
                7927,
                7966
            ],
            [
                7966,
                8023
            ],
            [
                8023,
                8075
            ],
            [
                8075,
                8242
            ]
        ],
        "overlap_chars": [
            [
                0,
                4
            ],
            [
                5,
                121
            ],
            [
                121,
                177
            ],
            [
                187,
                189
            ],
            [
                189,
                337
            ],
            [
                337,
                413
            ],
            [
                413,
                525
            ],
            [
                525,
                549
            ],
            [
                549,
                679
            ],
            [
                680,
                703
            ],
            [
                703,
                762
            ],
            [
                766,
                858
            ],
            [
                858,
                953
            ],
            [
                973,
                976
            ],
            [
                981,
                982
            ],
            [
                987,
                989
            ],
            [
                989,
                1016
            ],
            [
                1017,
                1030
            ],
            [
                1031,
                1069
            ],
            [
                1069,
                1088
            ],
            [
                1088,
                1099
            ],
            [
                1099,
                1125
            ],
            [
                1125,
                1167
            ],
            [
                1167,
                1181
            ],
            [
                1182,
                1245
            ],
            [
                1245,
                1269
            ],
            [
                1269,
                1314
            ],
            [
                1314,
                1332
            ],
            [
                1332,
                1358
            ],
            [
                1358,
                1386
            ],
            [
                1386,
                1454
            ],
            [
                1463,
                1502
            ],
            [
                1502,
                1507
            ],
            [
                1507,
                1512
            ],
            [
                1512,
                1533
            ],
            [
                1535,
                1543
            ],
            [
                1544,
                1553
            ],
            [
                1553,
                1562
            ],
            [
                1562,
                1565
            ],
            [
                1565,
                1599
            ],
            [
                1599,
                1634
            ],
            [
                1634,
                1669
            ],
            [
                1669,
                1670
            ],
            [
                1671,
                1720
            ],
            [
                1720,
                1811
            ],
            [
                1811,
                1816
            ],
            [
                1819,
                1831
            ],
            [
                1834,
                1848
            ],
            [
                1851,
                1865
            ],
            [
                1865,
                1881
            ],
            [
                1885,
                1893
            ],
            [
                1893,
                1904
            ],
            [
                1910,
                1941
            ],
            [
                1941,
                1943
            ],
            [
                1943,
                1968
            ],
            [
                1968,
                1990
            ],
            [
                1991,
                1998
            ],
            [
                1998,
                1999
            ],
            [
                2003,
                2023
            ],
            [
                2031,
                2062
            ],
            [
                2063,
                2092
            ],
            [
                2101,
                2126
            ],
            [
                2126,
                2225
            ],
            [
                2228,
                2244
            ],
            [
                2247,
                2278
            ],
            [
                2278,
                2280
            ],
            [
                2280,
                2302
            ],
            [
                2311,
                2381
            ],
            [
                2381,
                2385
            ],
            [
                2386,
                2389
            ],
            [
                2405,
                2409
            ],
            [
                2418,
                2421
            ],
            [
                2422,
                2425
            ],
            [
                2426,
                2432
            ],
            [
                2451,
                2453
            ],
            [
                2458,
                2474
            ],
            [
                2475,
                2484
            ],
            [
                2490,
                2501
            ],
            [
                2502,
                2529
            ],
            [
                2529,
                2558
            ],
            [
                2563,
                2579
            ],
            [
                2584,
                2633
            ],
            [
                2636,
                2651
            ],
            [
                2651,
                2733
            ],
            [
                2734,
                2763
            ],
            [
                2775,
                2790
            ],
            [
                2798,
                2813
            ],
            [
                2814,
                2817
            ],
            [
                2818,
                2834
            ],
            [
                2836,
                2870
            ],
            [
                2870,
                2883
            ],
            [
                2883,
                2902
            ],
            [
                2904,
                2999
            ],
            [
                3000,
                3013
            ],
            [
                3013,
                3036
            ],
            [
                3036,
                3072
            ],
            [
                3072,
                3101
            ],
            [
                3101,
                3140
            ],
            [
                3140,
                3254
            ],
            [
                3254,
                3319
            ],
            [
                3319,
                3365
            ],
            [
                3365,
                3375
            ],
            [
                3392,
                3445
            ],
            [
                3446,
                3449
            ],
            [
                3450,
                3468
            ],
            [
                3468,
                3470
            ],
            [
                3478,
                3483
            ],
            [
                3487,
                3490
            ],
            [
                3491,
                3565
            ],
            [
                3565,
                3640
            ],
            [
                3640,
                3653
            ],
            [
                3653,
                3690
            ],
            [
                3690,
                3714
            ],
            [
                3721,
                3726
            ],
            [
                3726,
                3731
            ],
            [
                3731,
                3750
            ],
            [
                3750,
                3774
            ],
            [
                3775,
                3801
            ],
            [
                3801,
                3822
            ],
            [
                3823,
                3863
            ],
            [
                3863,
                3913
            ],
            [
                3915,
                4020
            ],
            [
                4020,
                4051
            ],
            [
                4051,
                4062
            ],
            [
                4062,
                4069
            ],
            [
                4071,
                4084
            ],
            [
                4085,
                4109
            ],
            [
                4116,
                4120
            ],
            [
                4120,
                4177
            ],
            [
                4179,
                4232
            ],
            [
                4232,
                4265
            ],
            [
                4266,
                4302
            ],
            [
                4302,
                4305
            ],
            [
                4305,
                4337
            ],
            [
                4337,
                4366
            ],
            [
                4368,
                4389
            ],
            [
                4392,
                4402
            ],
            [
                4405,
                4569
            ],
            [
                4569,
                4574
            ],
            [
                4574,
                4585
            ],
            [
                4586,
                4602
            ],
            [
                4602,
                4605
            ],
            [
                4605,
                4620
            ],
            [
                4621,
                4647
            ],
            [
                4647,
                4649
            ],
            [
                4650,
                4663
            ],
            [
                4663,
                4678
            ],
            [
                4678,
                4711
            ],
            [
                4711,
                4727
            ],
            [
                4727,
                4728
            ],
            [
                4736,
                4743
            ],
            [
                4752,
                4781
            ],
            [
                4781,
                4790
            ],
            [
                4791,
                4796
            ],
            [
                4797,
                4852
            ],
            [
                4858,
                4868
            ],
            [
                4869,
                4875
            ],
            [
                4884,
                4901
            ],
            [
                4901,
                4903
            ],
            [
                4903,
                4932
            ],
            [
                4932,
                4933
            ],
            [
                4934,
                5030
            ],
            [
                5030,
                5056
            ],
            [
                5056,
                5081
            ],
            [
                5081,
                5114
            ],
            [
                5114,
                5130
            ],
            [
                5130,
                5140
            ],
            [
                5140,
                5163
            ],
            [
                5163,
                5251
            ],
            [
                5251,
                5311
            ],
            [
                5312,
                5313
            ],
            [
                5313,
                5359
            ],
            [
                5359,
                5379
            ],
            [
                5394,
                5396
            ],
            [
                5396,
                5410
            ],
            [
                5414,
                5416
            ],
            [
                5416,
                5430
            ],
            [
                5436,
                5455
            ],
            [
                5456,
                5495
            ],
            [
                5495,
                5516
            ],
            [
                5517,
                5535
            ],
            [
                5535,
                5554
            ],
            [
                5554,
                5575
            ],
            [
                5575,
                5634
            ],
            [
                5635,
                5639
            ],
            [
                5644,
                5711
            ],
            [
                5712,
                5748
            ],
            [
                5751,
                5763
            ],
            [
                5769,
                5773
            ],
            [
                5774,
                5778
            ],
            [
                5779,
                5811
            ],
            [
                5811,
                5813
            ],
            [
                5813,
                5879
            ],
            [
                5887,
                5890
            ],
            [
                5890,
                5915
            ],
            [
                5917,
                5966
            ],
            [
                5967,
                5970
            ],
            [
                5974,
                5976
            ],
            [
                5980,
                5983
            ],
            [
                5984,
                6016
            ],
            [
                6016,
                6079
            ],
            [
                6079,
                6095
            ],
            [
                6095,
                6108
            ],
            [
                6111,
                6176
            ],
            [
                6179,
                6212
            ],
            [
                6212,
                6214
            ],
            [
                6214,
                6230
            ],
            [
                6230,
                6245
            ],
            [
                6245,
                6267
            ],
            [
                6267,
                6279
            ],
            [
                6279,
                6330
            ],
            [
                6331,
                6358
            ],
            [
                6361,
                6371
            ],
            [
                6379,
                6419
            ],
            [
                6419,
                6439
            ],
            [
                6439,
                6457
            ],
            [
                6457,
                6480
            ],
            [
                6480,
                6482
            ],
            [
                6482,
                6533
            ],
            [
                6533,
                6586
            ],
            [
                6586,
                6591
            ],
            [
                6598,
                6603
            ],
            [
                6604,
                6629
            ],
            [
                6629,
                6631
            ],
            [
                6631,
                6642
            ],
            [
                6647,
                6715
            ],
            [
                6720,
                6744
            ],
            [
                6744,
                6764
            ],
            [
                6764,
                6795
            ],
            [
                6796,
                6806
            ],
            [
                6807,
                6849
            ],
            [
                6849,
                6885
            ],
            [
                6886,
                6890
            ],
            [
                6891,
                6914
            ],
            [
                6915,
                6924
            ],
            [
                6924,
                6934
            ],
            [
                6934,
                6962
            ],
            [
                6962,
                6967
            ],
            [
                6968,
                6976
            ],
            [
                6976,
                6977
            ],
            [
                6978,
                6985
            ],
            [
                6997,
                7096
            ],
            [
                7096,
                7098
            ],
            [
                7098,
                7209
            ],
            [
                7209,
                7211
            ],
            [
                7211,
                7246
            ],
            [
                7246,
                7280
            ],
            [
                7280,
                7289
            ],
            [
                7289,
                7338
            ],
            [
                7338,
                7354
            ],
            [
                7354,
                7357
            ],
            [
                7358,
                7363
            ],
            [
                7365,
                7393
            ],
            [
                7393,
                7458
            ],
            [
                7459,
                7478
            ],
            [
                7478,
                7479
            ],
            [
                7480,
                7523
            ],
            [
                7524,
                7537
            ],
            [
                7543,
                7567
            ],
            [
                7567,
                7616
            ],
            [
                7617,
                7659
            ],
            [
                7659,
                7666
            ],
            [
                7672,
                7699
            ],
            [
                7701,
                7708
            ],
            [
                7713,
                7736
            ],
            [
                7736,
                7767
            ],
            [
                7768,
                7809
            ],
            [
                7809,
                7847
            ],
            [
                7849,
                7890
            ],
            [
                7890,
                7891
            ],
            [
                7892,
                7903
            ],
            [
                7904,
                7927
            ],
            [
                7927,
                7964
            ],
            [
                7964,
                7966
            ],
            [
                7966,
                8020
            ],
            [
                8020,
                8023
            ],
            [
                8023,
                8031
            ],
            [
                8040,
                8044
            ],
            [
                8056,
                8073
            ],
            [
                8073,
                8074
            ],
            [
                8075,
                8156
            ],
            [
                8162,
                8180
            ],
            [
                8181,
                8184
            ],
            [
                8185,
                8241
            ],
            [
                8241,
                8242
            ]
        ],
        "row_chars": [
            [
                0,
                121
            ],
            [
                121,
                189
            ],
            [
                189,
                337
            ],
            [
                337,
                413
            ],
            [
                413,
                525
            ],
            [
                525,
                703
            ],
            [
                703,
                858
            ],
            [
                858,
                989
            ],
            [
                989,
                1069
            ],
            [
                1069,
                1088
            ],
            [
                1088,
                1099
            ],
            [
                1099,
                1125
            ],
            [
                1125,
                1125
            ],
            [
                1125,
                1125
            ],
            [
                1125,
                1125
            ],
            [
                1125,
                1125
            ],
            [
                1125,
                1167
            ],
            [
                1167,
                1167
            ],
            [
                1167,
                1167
            ],
            [
                1167,
                1182
            ],
            [
                1182,
                1182
            ],
            [
                1182,
                1269
            ],
            [
                1269,
                1314
            ],
            [
                1314,
                1332
            ],
            [
                1332,
                1358
            ],
            [
                1358,
                1386
            ],
            [
                1386,
                1386
            ],
            [
                1386,
                1502
            ],
            [
                1502,
                1507
            ],
            [
                1507,
                1512
            ],
            [
                1512,
                1535
            ],
            [
                1535,
                1535
            ],
            [
                1535,
                1535
            ],
            [
                1535,
                1535
            ],
            [
                1535,
                1535
            ],
            [
                1535,
                1565
            ],
            [
                1565,
                1634
            ],
            [
                1634,
                1720
            ],
            [
                1720,
                1720
            ],
            [
                1720,
                1865
            ],
            [
                1865,
                1893
            ],
            [
                1893,
                1943
            ],
            [
                1943,
                1968
            ],
            [
                1968,
                1990
            ],
            [
                1990,
                1990
            ],
            [
                1990,
                2126
            ],
            [
                2126,
                2280
            ],
            [
                2280,
                2381
            ],
            [
                2381,
                2529
            ],
            [
                2529,
                2651
            ],
            [
                2651,
                2651
            ],
            [
                2651,
                2798
            ],
            [
                2798,
                2798
            ],
            [
                2798,
                2798
            ],
            [
                2798,
                2870
            ],
            [
                2870,
                2904
            ],
            [
                2904,
                3000
            ],
            [
                3000,
                3000
            ],
            [
                3000,
                3000
            ],
            [
                3000,
                3013
            ],
            [
                3013,
                3036
            ],
            [
                3036,
                3036
            ],
            [
                3036,
                3072
            ],
            [
                3072,
                3140
            ],
            [
                3140,
                3254
            ],
            [
                3254,
                3319
            ],
            [
                3319,
                3365
            ],
            [
                3365,
                3470
            ],
            [
                3470,
                3470
            ],
            [
                3470,
                3565
            ],
            [
                3565,
                3640
            ],
            [
                3640,
                3653
            ],
            [
                3653,
                3690
            ],
            [
                3690,
                3690
            ],
            [
                3690,
                3726
            ],
            [
                3726,
                3731
            ],
            [
                3731,
                3750
            ],
            [
                3750,
                3801
            ],
            [
                3801,
                3863
            ],
            [
                3863,
                3915
            ],
            [
                3915,
                3915
            ],
            [
                3915,
                3915
            ],
            [
                3915,
                4020
            ],
            [
                4020,
                4051
            ],
            [
                4051,
                4062
            ],
            [
                4062,
                4069
            ],
            [
                4069,
                4232
            ],
            [
                4232,
                4305
            ],
            [
                4305,
                4337
            ],
            [
                4337,
                4368
            ],
            [
                4368,
                4368
            ],
            [
                4368,
                4368
            ],
            [
                4368,
                4368
            ],
            [
                4368,
                4368
            ],
            [
                4368,
                4368
            ],
            [
                4368,
                4569
            ],
            [
                4569,
                4574
            ],
            [
                4574,
                4586
            ],
            [
                4586,
                4586
            ],
            [
                4586,
                4605
            ],
            [
                4605,
                4649
            ],
            [
                4649,
                4663
            ],
            [
                4663,
                4678
            ],
            [
                4678,
                4711
            ],
            [
                4711,
                4727
            ],
            [
                4727,
                4781
            ],
            [
                4781,
                4903
            ],
            [
                4903,
                4903
            ],
            [
                4903,
                4903
            ],
            [
                4903,
                4903
            ],
            [
                4903,
                4903
            ],
            [
                4903,
                4934
            ],
            [
                4934,
                5030
            ],
            [
                5030,
                5056
            ],
            [
                5056,
                5081
            ],
            [
                5081,
                5114
            ],
            [
                5114,
                5130
            ],
            [
                5130,
                5140
            ],
            [
                5140,
                5163
            ],
            [
                5163,
                5251
            ],
            [
                5251,
                5312
            ],
            [
                5312,
                5312
            ],
            [
                5312,
                5312
            ],
            [
                5312,
                5312
            ],
            [
                5312,
                5312
            ],
            [
                5312,
                5312
            ],
            [
                5312,
                5312
            ],
            [
                5312,
                5312
            ],
            [
                5312,
                5312
            ],
            [
                5312,
                5312
            ],
            [
                5312,
                5312
            ],
            [
                5312,
                5359
            ],
            [
                5359,
                5396
            ],
            [
                5396,
                5396
            ],
            [
                5396,
                5416
            ],
            [
                5416,
                5495
            ],
            [
                5495,
                5535
            ],
            [
                5535,
                5554
            ],
            [
                5554,
                5575
            ],
            [
                5575,
                5634
            ],
            [
                5634,
                5634
            ],
            [
                5634,
                5751
            ],
            [
                5751,
                5751
            ],
            [
                5751,
                5813
            ],
            [
                5813,
                5917
            ],
            [
                5917,
                5917
            ],
            [
                5917,
                5917
            ],
            [
                5917,
                6016
            ],
            [
                6016,
                6079
            ],
            [
                6079,
                6095
            ],
            [
                6095,
                6111
            ],
            [
                6111,
                6111
            ],
            [
                6111,
                6111
            ],
            [
                6111,
                6179
            ],
            [
                6179,
                6179
            ],
            [
                6179,
                6214
            ],
            [
                6214,
                6230
            ],
            [
                6230,
                6245
            ],
            [
                6245,
                6245
            ],
            [
                6245,
                6267
            ],
            [
                6267,
                6279
            ],
            [
                6279,
                6361
            ],
            [
                6361,
                6361
            ],
            [
                6361,
                6419
            ],
            [
                6419,
                6439
            ],
            [
                6439,
                6457
            ],
            [
                6457,
                6482
            ],
            [
                6482,
                6533
            ],
            [
                6533,
                6631
            ],
            [
                6631,
                6744
            ],
            [
                6744,
                6764
            ],
            [
                6764,
                6849
            ],
            [
                6849,
                6924
            ],
            [
                6924,
                6934
            ],
            [
                6934,
                6962
            ],
            [
                6962,
                7098
            ],
            [
                7098,
                7211
            ],
            [
                7211,
                7246
            ],
            [
                7246,
                7280
            ],
            [
                7280,
                7289
            ],
            [
                7289,
                7338
            ],
            [
                7338,
                7354
            ],
            [
                7354,
                7393
            ],
            [
                7393,
                7480
            ],
            [
                7480,
                7480
            ],
            [
                7480,
                7480
            ],
            [
                7480,
                7480
            ],
            [
                7480,
                7567
            ],
            [
                7567,
                7659
            ],
            [
                7659,
                7736
            ],
            [
                7736,
                7736
            ],
            [
                7736,
                7736
            ],
            [
                7736,
                7809
            ],
            [
                7809,
                7849
            ],
            [
                7849,
                7849
            ],
            [
                7849,
                7927
            ],
            [
                7927,
                7966
            ],
            [
                7966,
                8023
            ],
            [
                8023,
                8075
            ],
            [
                8075,
                8242
            ]
        ]
    }
}