{
    "original": {
        "text": "It matters little now how much I thought of my living mother who had told me evermore to consider her dead. I could not venture to approach her or to communicate with her in writing, for my sense of the peril in which her life was passed was only to be equalled by my fears of increasing it. Knowing that my mere existence as a living creature was an unforeseen danger in her way, I could not always conquer that terror of myself which had seized me when I first knew the secret. At no time did I dare to utter her name. I felt as if I did not even dare to hear it. If the conversation anywhere, when I was present, took that direction, as it sometimes naturally did, I tried not to hear: I mentally counted, repeated something that I knew, or went out of the room. I am conscious now that I often did these things when there can have been no danger of her being spoken of, but I did them in the dread I had of hearing anything that might lead to her betrayal, and to her betrayal through me.\nIt matters little now how often I recalled the tones of my mother's voice, wondered whether I should ever hear it again as I so longed to do, and thought how strange and desolate it was that it should be so new to me. It matters little that I watched for every public mention of my mother's name; that I passed and repassed the door of her house in town, loving it, but afraid to look at it; that I once sat in the theatre when my mother was there and saw me, and when we were so wide asunder before the great company of all degrees that any link or confidence between us seemed a dream. It is all, all over. My lot has been so blest that I can relate little of myself which is not a story of goodness and generosity in others. I may well pass that little and go on.\nWhen we were settled at home again, Ada and I had many conversations with my guardian of which Richard was the theme. My dear girl was deeply grieved that he should do their kind cousin so much wrong, but she was so faithful to Richard that she could not bear to blame him even for that. My guardian was assured of it, and never coupled his name with a word of reproof. \"Rick is mistaken, my dear,\" he would say to her. \"Well, well! We have all been mistaken over and over again. We must trust to you and time to set him right.\"\nWe knew afterwards what we suspected then, that he did not trust to time until he had often tried to open Richard's eyes. That he had written to him, gone to him, talked with him, tried every gentle and persuasive art his kindness could devise. Our poor devoted Richard was deaf and blind to all. If he were wrong, he would make amends when the Chancery suit was over. If he were groping in the dark, he could not do better than do his utmost to clear away those clouds in which so much was confused and obscured. Suspicion and misunderstanding were the fault of the suit? Then let him work the suit out and come through it to his right mind. This was his unvarying reply. Jarndyce and Jarndyce had obtained such possession of his whole nature that it was impossible to place any consideration before him which he did not, with a distorted kind of reason, make a new argument in favour of his doing what he did. \"So that it is even more mischievous,\" said my guardian once to me, \"to remonstrate with the poor dear fellow than to leave him alone.\"\nI took one of these opportunities of mentioning my doubts of Mr. Skimpole as a good adviser for Richard.\n\"Adviser!\" returned my guardian, laughing, \"My dear, who would advise with Skimpole?\"\n\"Encourager would perhaps have been a better word,\" said I.\n\"Encourager!\" returned my guardian again. \"Who could be encouraged by Skimpole?\"\n\"Not Richard?\" I asked.\n\"No,\" he replied. \"Such an unworldly, uncalculating, gossamer creature is a relief to him and an amusement. But as to advising or encouraging or occupying a serious station towards anybody or anything, it is simply not to be thought of in such a child as Skimpole.\"\n\"Pray, cousin John,\" said Ada, who had just joined us and now looked over my shoulder, \"what made him such a child?\"\n\"What made him such a child?\" inquired my guardian, rubbing his head, a little at a loss.\n\"Yes, cousin John.\"\n\"Why,\" he slowly replied, roughening his head more and more, \"he is all sentiment, and--and susceptibility, and--and sensibility, and--and imagination. And these qualities are not regulated in him, somehow. I suppose the people who admired him for them in his youth attached too much importance to them and too little to any training that would have balanced and adjusted them, and so he became what he is. Hey?\" said my guardian, stopping short and looking at us hopefully. \"What do you think, you two?\"\nAda, glancing at me, said she thought it was a pity he should be an expense to Richard.\n\"So it is, so it is,\" returned my guardian hurriedly. \"That must not be. We must arrange that. I must prevent it. That will never do.\"\nAnd I said I thought it was to be regretted that he had ever introduced Richard to Mr. Vholes for a present of five pounds.\n\"Did he?\" said my guardian with a passing shade of vexation on his face. \"But there you have the man. There you have the man! There is nothing mercenary in that with him. He has no idea of the value of money. He introduces Rick, and then he is good friends with Mr. Vholes and borrows five pounds of him. He means nothing by it and thinks nothing of it. He told you himself, I'll be bound, my dear?\"\n\"Oh, yes!\" said I.\n\"Exactly!\" cried my guardian, quite triumphant. \"There you have the man! If he had meant any harm by it or was conscious of any harm in it, he wouldn't tell it. He tells it as he does it in mere simplicity. But you shall see him in his own home, and then you'll understand him better. We must pay a visit to Harold Skimpole and caution him on these points. Lord bless you, my dears, an infant, an infant!\"\nIn pursuance of this plan, we went into London on an early day and presented ourselves at Mr. Skimpole's door.\nHe lived in a place called the Polygon, in Somers Town, where there were at that time a number of poor Spanish refugees walking about in cloaks, smoking little paper cigars. Whether he was a better tenant than one might have supposed, in consequence of his friend Somebody always paying his rent at last, or whether his inaptitude for business rendered it particularly difficult to turn him out, I don't know; but he had occupied the same house some years. It was in a state of dilapidation quite equal to our expectation. Two or three of the area railings were gone, the water-butt was broken, the knocker was loose, the bell-handle had been pulled off a long time to judge from the rusty state of the wire, and dirty footprints on the steps were the only signs of its being inhabited.\nA slatternly full-blown girl who seemed to be bursting out at the rents in her gown and the cracks in her shoes like an over-ripe berry answered our knock by opening the door a very little way and stopping up the gap with her figure. As she knew Mr. Jarndyce (indeed Ada and I both thought that she evidently associated him with the receipt of her wages), she immediately relented and allowed us to pass in. The lock of the door being in a disabled condition, she then applied herself to securing it with the chain, which was not in good action either, and said would we go upstairs?\nWe went upstairs to the first floor, still seeing no other furniture than the dirty footprints. Mr. Jarndyce without further ceremony entered a room there, and we followed. It was dingy enough and not at all clean, but furnished with an odd kind of shabby luxury, with a large footstool, a sofa, and plenty of cushions, an easy-chair, and plenty of pillows, a piano, books, drawing materials, music, newspapers, and a few sketches and pictures. A broken pane of glass in one of the dirty windows was papered and wafered over, but there was a little plate of hothouse nectarines on the table, and there was another of grapes, and another of sponge-cakes, and there was a bottle of light wine. Mr. Skimpole himself reclined upon the sofa in a dressing-gown, drinking some fragrant coffee from an old china cup--it was then about mid-day--and looking at a collection of wallflowers in the balcony.\nHe was not in the least disconcerted by our appearance, but rose and received us in his usual airy manner.\n\"Here I am, you see!\" he said when we were seated, not without some little difficulty, the greater part of the chairs being broken. \"Here I am! This is my frugal breakfast. Some men want legs of beef and mutton for breakfast; I don't. Give me my peach, my cup of coffee, and my claret; I am content. I don't want them for themselves, but they remind me of the sun. There's nothing solar about legs of beef and mutton. Mere animal satisfaction!\"\n\"This is our friend's consulting-room (or would be, if he ever prescribed), his sanctum, his studio,\" said my guardian to us.\n\"Yes,\" said Mr. Skimpole, turning his bright face about, \"this is the bird's cage. This is where the bird lives and sings. They pluck his feathers now and then and clip his wings, but he sings, he sings!\"\nHe handed us the grapes, repeating in his radiant way, \"He sings! Not an ambitious note, but still he sings.\"\n\"These are very fine,\" said my guardian. \"A present?\"\n\"No,\" he answered. \"No! Some amiable gardener sells them. His man wanted to know, when he brought them last evening, whether he should wait for the money. 'Really, my friend,' I said, 'I think not--if your time is of any value to you.' I suppose it was, for he went away.\"\nMy guardian looked at us with a smile, as though he asked us, \"Is it possible to be worldly with this baby?\"\n\"This is a day,\" said Mr. Skimpole, gaily taking a little claret in a tumbler, \"that will ever be remembered here. We shall call it Saint Clare and Saint Summerson day. You must see my daughters. I have a blue-eyed daughter who is my Beauty daughter, I have a Sentiment daughter, and I have a Comedy daughter. You must see them all. They'll be enchanted.\"\nHe was going to summon them when my guardian interposed and asked him to pause a moment, as he wished to say a word to him first. \"My dear Jarndyce,\" he cheerfully replied, going back to his sofa, \"as many moments as you please. Time is no object here. We never know what o'clock it is, and we never care. Not the way to get on in life, you'll tell me? Certainly. But we DON'T get on in life. We don't pretend to do it.\"\nMy guardian looked at us again, plainly saying, \"You hear him?\"\n\"Now, Harold,\" he began, \"the word I have to say relates to Rick.\"\n\"The dearest friend I have!\" returned Mr. Skimpole cordially. \"I suppose he ought not to be my dearest friend, as he is not on terms with you. But he is, I can't help it; he is full of youthful poetry, and I love him. If you don't like it, I can't help it. I love him.\"\nThe engaging frankness with which he made this declaration really had a disinterested appearance and captivated my guardian, if not, for the moment, Ada too.\n\"You are welcome to love him as much as you like,\" returned Mr. Jarndyce, \"but we must save his pocket, Harold.\"\n\"Oh!\" said Mr. Skimpole. \"His pocket? Now you are coming to what I don't understand.\" Taking a little more claret and dipping one of the cakes in it, he shook his head and smiled at Ada and me with an ingenuous foreboding that he never could be made to understand.\n\"If you go with him here or there,\" said my guardian plainly, \"you must not let him pay for both.\"\n\"My dear Jarndyce,\" returned Mr. Skimpole, his genial face irradiated by the comicality of this idea, \"what am I to do? If he takes me anywhere, I must go. And how can I pay? I never have any money. If I had any money, I don't know anything about it. Suppose I say to a man, how much? Suppose the man says to me seven and sixpence? I know nothing about seven and sixpence. It is impossible for me to pursue the subject with any consideration for the man. I don't go about asking busy people what seven and sixpence is in Moorish--which I don't understand. Why should I go about asking them what seven and sixpence is in Money--which I don't understand?\"\n\"Well,\" said my guardian, by no means displeased with this artless reply, \"if you come to any kind of journeying with Rick, you must borrow the money of me (never breathing the least allusion to that circumstance), and leave the calculation to him.\"\n\"My dear Jarndyce,\" returned Mr. Skimpole, \"I will do anything to give you pleasure, but it seems an idle form--a superstition. Besides, I give you my word, Miss Clare and my dear Miss Summerson, I thought Mr. Carstone was immensely rich. I thought he had only to make over something, or to sign a bond, or a draft, or a cheque, or a bill, or to put something on a file somewhere, to bring down a shower of money.\"\n\"Indeed it is not so, sir,\" said Ada. \"He is poor.\"\n\"No, really?\" returned Mr. Skimpole with his bright smile. \"You surprise me.\n\"And not being the richer for trusting in a rotten reed,\" said my guardian, laying his hand emphatically on the sleeve of Mr. Skimpole's dressing-gown, \"be you very careful not to encourage him in that reliance, Harold.\"\n\"My dear good friend,\" returned Mr. Skimpole, \"and my dear Miss Simmerson, and my dear Miss Clare, how can I do that? It's business, and I don't know business. It is he who encourages me. He emerges from great feats of business, presents the brightest prospects before me as their result, and calls upon me to admire them. I do admire them--as bright prospects. But I know no more about them, and I tell him so.\"\nThe helpless kind of candour with which he presented this before us, the light-hearted manner in which he was amused by his innocence, the fantastic way in which he took himself under his own protection and argued about that curious person, combined with the delightful ease of everything he said exactly to make out my guardian's case. The more I saw of him, the more unlikely it seemed to me, when he was present, that he could design, conceal, or influence anything; and yet the less likely that appeared when he was not present, and the less agreeable it was to think of his having anything to do with any one for whom I cared.\nHearing that his examination (as he called it) was now over, Mr. Skimpole left the room with a radiant face to fetch his daughters (his sons had run away at various times), leaving my guardian quite delighted by the manner in which he had vindicated his childish character. He soon came back, bringing with him the three young ladies and Mrs. Skimpole, who had once been a beauty but was now a delicate high-nosed invalid suffering under a complication of disorders.\n\"This,\" said Mr. Skimpole, \"is my Beauty daughter, Arethusa--plays and sings odds and ends like her father. This is my Sentiment daughter, Laura--plays a little but don't sing. This is my Comedy daughter, Kitty--sings a little but don't play. We all draw a little and compose a little, and none of us have any idea of time or money.\"\nMrs. Skimpole sighed, I thought, as if she would have been glad to strike out this item in the family attainments. I also thought that she rather impressed her sigh upon my guardian and that she took every opportunity of throwing in another.\n\"It is pleasant,\" said Mr. Skimpole, turning his sprightly eyes from one to the other of us, \"and it is whimsically interesting to trace peculiarities in families. In this family we are all children, and I am the youngest.\"\nThe daughters, who appeared to be very fond of him, were amused by this droll fact, particularly the Comedy daughter.\n\"My dears, it is true,\" said Mr. Skimpole, \"is it not? So it is, and so it must be, because like the dogs in the hymn, 'it is our nature to.' Now, here is Miss Summerson with a fine administrative capacity and a knowledge of details perfectly surprising. It will sound very strange in Miss Summerson's ears, I dare say, that we know nothing about chops in this house. But we don't, not the least. We can't cook anything whatever. A needle and thread we don't know how to use. We admire the people who possess the practical wisdom we want, but we don't quarrel with them. Then why should they quarrel with us? Live and let live, we say to them. Live upon your practical wisdom, and let us live upon you!\"\nHe laughed, but as usual seemed quite candid and really to mean what he said.\n\"We have sympathy, my roses,\" said Mr. Skimpole, \"sympathy for everything. Have we not?\"\n\"Oh, yes, papa!\" cried the three daughters.\n\"In fact, that is our family department,\" said Mr. Skimpole, \"in this hurly-burly of life. We are capable of looking on and of being interested, and we DO look on, and we ARE interested. What more can we do? Here is my Beauty daughter, married these three years. Now I dare say her marrying another child, and having two more, was all wrong in point of political economy, but it was very agreeable. We had our little festivities on those occasions and exchanged social ideas. She brought her young husband home one day, and they and their young fledglings have their nest upstairs. I dare say at some time or other Sentiment and Comedy will bring THEIR husbands home and have THEIR nests upstairs too. So we get on, we don't know how, but somehow.\"\nShe looked very young indeed to be the mother of two children, and I could not help pitying both her and them. It was evident that the three daughters had grown up as they could and had had just as little haphazard instruction as qualified them to be their father's playthings in his idlest hours. His pictorial tastes were consulted, I observed, in their respective styles of wearing their hair, the Beauty daughter being in the classic manner, the Sentiment daughter luxuriant and flowing, and the Comedy daughter in the arch style, with a good deal of sprightly forehead, and vivacious little curls dotted about the corners of her eyes. They were dressed to correspond, though in a most untidy and negligent way.\nAda and I conversed with these young ladies and found them wonderfully like their father. In the meanwhile Mr. Jarndyce (who had been rubbing his head to a great extent, and hinted at a change in the wind) talked with Mrs. Skimpole in a corner, where we could not help hearing the chink of money. Mr. Skimpole had previously volunteered to go home with us and had withdrawn to dress himself for the purpose.\n\"My roses,\" he said when he came back, \"take care of mama. She is poorly to-day. By going home with Mr. Jarndyce for a day or two, I shall hear the larks sing and preserve my amiability. It has been tried, you know, and would be tried again if I remained at home.\"\n\"That bad man!\" said the Comedy daughter.\n\"At the very time when he knew papa was lying ill by his wallflowers, looking at the blue sky,\" Laura complained.\n\"And when the smell of hay was in the air!\" said Arethusa.\n\"It showed a want of poetry in the man,\" Mr. Skimpole assented, but with perfect good humour. \"It was coarse. There was an absence of the finer touches of humanity in it! My daughters have taken great offence,\" he explained to us, \"at an honest man--\"\n\"Not honest, papa. Impossible!\" they all three protested.\n\"At a rough kind of fellow--a sort of human hedgehog rolled up,\" said Mr. Skimpole, \"who is a baker in this neighbourhood and from whom we borrowed a couple of arm-chairs. We wanted a couple of arm-chairs, and we hadn't got them, and therefore of course we looked to a man who HAD got them, to lend them. Well! This morose person lent them, and we wore them out. When they were worn out, he wanted them back. He had them back. He was contented, you will say. Not at all. He objected to their being worn. I reasoned with him, and pointed out his mistake. I said, 'Can you, at your time of life, be so headstrong, my friend, as to persist that an arm-chair is a thing to put upon a shelf and look at? That it is an object to contemplate, to survey from a distance, to consider from a point of sight? Don't you KNOW that these arm-chairs were borrowed to be sat upon?' He was unreasonable and unpersuadable and used intemperate language. Being as patient as I am at this minute, I addressed another appeal to him. I said, 'Now, my good man, however our business capacities may vary, we are all children of one great mother, Nature. On this blooming summer morning here you see me' (I was on the sofa) 'with flowers before me, fruit upon the table, the cloudless sky above me, the air full of fragrance, contemplating Nature. I entreat you, by our common brotherhood, not to interpose between me and a subject so sublime, the absurd figure of an angry baker!' But he did,\" said Mr. Skimpole, raising his laughing eyes in playful astonishment; \"he did interpose that ridiculous figure, and he does, and he will again. And therefore I am very glad to get out of his way and to go home with my friend Jarndyce.\"\nIt seemed to escape his consideration that Mrs. Skimpole and the daughters remained behind to encounter the baker, but this was so old a story to all of them that it had become a matter of course. He took leave of his family with a tenderness as airy and graceful as any other aspect in which he showed himself and rode away with us in perfect harmony of mind. We had an opportunity of seeing through some open doors, as we went downstairs, that his own apartment was a palace to the rest of the house.\nI could have no anticipation, and I had none, that something very startling to me at the moment, and ever memorable to me in what ensued from it, was to happen before this day was out. Our guest was in such spirits on the way home that I could do nothing but listen to him and wonder at him; nor was I alone in this, for Ada yielded to the same fascination. As to my guardian, the wind, which had threatened to become fixed in the east when we left Somers Town, veered completely round before we were a couple of miles from it.\nWhether of questionable childishness or not in any other matters, Mr. Skimpole had a child's enjoyment of change and bright weather. In no way wearied by his sallies on the road, he was in the drawing-room before any of us; and I heard him at the piano while I was yet looking after my housekeeping, singing refrains of barcaroles and drinking songs, Italian and German, by the score.\nWe were all assembled shortly before dinner, and he was still at the piano idly picking out in his luxurious way little strains of music, and talking between whiles of finishing some sketches of the ruined old Verulam wall to-morrow, which he had begun a year or two ago and had got tired of, when a card was brought in and my guardian read aloud in a surprised voice, \"Sir Leicester Dedlock!\"\nThe visitor was in the room while it was yet turning round with me and before I had the power to stir. If I had had it, I should have hurried away. I had not even the presence of mind, in my giddiness, to retire to Ada in the window, or to see the window, or to know where it was. I heard my name and found that my guardian was presenting me before I could move to a chair.\n\"Pray be seated, Sir Leicester.\"\n\"Mr. Jarndyce,\" said Sir Leicester in reply as he bowed and seated himself, \"I do myself the honour of calling here--\"\n\"You do ME the honour, Sir Leicester.\"\n\"Thank you--of calling here on my road from Lincolnshire to express my regret that any cause of complaint, however strong, that I may have against a gentleman who--who is known to you and has been your host, and to whom therefore I will make no farther reference, should have prevented you, still more ladies under your escort and charge, from seeing whatever little there may be to gratify a polite and refined taste at my house, Chesney Wold.\"\n\"You are exceedingly obliging, Sir Leicester, and on behalf of those ladies (who are present) and for myself, I thank you very much.\"\n\"It is possible, Mr. Jarndyce, that the gentleman to whom, for the reasons I have mentioned, I refrain from making further allusion--it is possible, Mr. Jarndyce, that that gentleman may have done me the honour so far to misapprehend my character as to induce you to believe that you would not have been received by my local establishment in Lincolnshire with that urbanity, that courtesy, which its members are instructed to show to all ladies and gentlemen who present themselves at that house. I merely beg to observe, sir, that the fact is the reverse.\"\nMy guardian delicately dismissed this remark without making any verbal answer.\n\"It has given me pain, Mr. Jarndyce,\" Sir Leicester weightily proceeded. \"I assure you, sir, it has given--me--pain--to learn from the housekeeper at Chesney Wold that a gentleman who was in your company in that part of the county, and who would appear to possess a cultivated taste for the fine arts, was likewise deterred by some such cause from examining the family pictures with that leisure, that attention, that care, which he might have desired to bestow upon them and which some of them might possibly have repaid.\" Here he produced a card and read, with much gravity and a little trouble, through his eye-glass, \"Mr. Hirrold--Herald--Harold--Skampling--Skumpling--I beg your pardon--Skimpole.\"\n\"This is Mr. Harold Skimpole,\" said my guardian, evidently surprised.\n\"Oh!\" exclaimed Sir Leicester, \"I am happy to meet Mr. Skimpole and to have the opportunity of tendering my personal regrets. I hope, sir, that when you again find yourself in my part of the county, you will be under no similar sense of restraint.\"\n\"You are very obliging, Sir Leicester Dedlock. So encouraged, I shall certainly give myself the pleasure and advantage of another visit to your beautiful house. The owners of such places as Chesney Wold,\" said Mr. Skimpole with his usual happy and easy air, \"are public benefactors. They are good enough to maintain a number of delightful objects for the admiration and pleasure of us poor men; and not to reap all the admiration and pleasure that they yield is to be ungrateful to our benefactors.\"\nSir Leicester seemed to approve of this sentiment highly. \"An artist, sir?\"\n\"No,\" returned Mr. Skimpole. \"A perfectly idle man. A mere amateur.\"\nSir Leicester seemed to approve of this even more. He hoped he might have the good fortune to be at Chesney Wold when Mr. Skimpole next came down into Lincolnshire. Mr. Skimpole professed himself much flattered and honoured.\n\"Mr. Skimpole mentioned,\" pursued Sir Leicester, addressing himself again to my guardian, \"mentioned to the housekeeper, who, as he may have observed, is an old and attached retainer of the family--\"\n(\"That is, when I walked through the house the other day, on the occasion of my going down to visit Miss Summerson and Miss Clare,\" Mr. Skimpole airily explained to us.)\n\"--That the friend with whom he had formerly been staying there was Mr. Jarndyce.\" Sir Leicester bowed to the bearer of that name. \"And hence I became aware of the circumstance for which I have professed my regret. That this should have occurred to any gentleman, Mr. Jarndyce, but especially a gentleman formerly known to Lady Dedlock, and indeed claiming some distant connexion with her, and for whom (as I learn from my Lady herself) she entertains a high respect, does, I assure you, give--me--pain.\"\n\"Pray say no more about it, Sir Leicester,\" returned my guardian. \"I am very sensible, as I am sure we all are, of your consideration. Indeed the mistake was mine, and I ought to apologize for it.\"\nI had not once looked up. I had not seen the visitor and had not even appeared to myself to hear the conversation. It surprises me to find that I can recall it, for it seemed to make no impression on me as it passed. I heard them speaking, but my mind was so confused and my instinctive avoidance of this gentleman made his presence so distressing to me that I thought I understood nothing, through the rushing in my head and the beating of my heart.\n\"I mentioned the subject to Lady Dedlock,\" said Sir Leicester, rising, \"and my Lady informed me that she had had the pleasure of exchanging a few words with Mr. Jarndyce and his wards on the occasion of an accidental meeting during their sojourn in the vicinity. Permit me, Mr. Jarndyce, to repeat to yourself, and to these ladies, the assurance I have already tendered to Mr. Skimpole. Circumstances undoubtedly prevent my saying that it would afford me any gratification to hear that Mr. Boythorn had favoured my house with his presence, but those circumstances are confined to that gentleman himself and do not extend beyond him.\"\n\"You know my old opinion of him,\" said Mr. Skimpole, lightly appealing to us. \"An amiable bull who is determined to make every colour scarlet!\"\nSir Leicester Dedlock coughed as if he could not possibly hear another word in reference to such an individual and took his leave with great ceremony and politeness. I got to my own room with all possible speed and remained there until I had recovered my self-command. It had been very much disturbed, but I was thankful to find when I went downstairs again that they only rallied me for having been shy and mute before the great Lincolnshire baronet.\nBy that time I had made up my mind that the period was come when I must tell my guardian what I knew. The possibility of my being brought into contact with my mother, of my being taken to her house, even of Mr. Skimpole's, however distantly associated with me, receiving kindnesses and obligations from her husband, was so painful that I felt I could no longer guide myself without his assistance.\nWhen we had retired for the night, and Ada and I had had our usual talk in our pretty room, I went out at my door again and sought my guardian among his books. I knew he always read at that hour, and as I drew near I saw the light shining out into the passage from his reading-lamp.\n\"May I come in, guardian?\"\n\"Surely, little woman. What's the matter?\"\n\"Nothing is the matter. I thought I would like to take this quiet time of saying a word to you about myself.\"\nHe put a chair for me, shut his book, and put it by, and turned his kind attentive face towards me. I could not help observing that it wore that curious expression I had observed in it once before--on that night when he had said that he was in no trouble which I could readily understand.\n\"What concerns you, my dear Esther,\" said he, \"concerns us all. You cannot be more ready to speak than I am to hear.\"\n\"I know that, guardian. But I have such need of your advice and support. Oh! You don't know how much need I have to-night.\"\nHe looked unprepared for my being so earnest, and even a little alarmed.\n\"Or how anxious I have been to speak to you,\" said I, \"ever since the visitor was here to-day.\"\n\"The visitor, my dear! Sir Leicester Dedlock?\"\n\"Yes.\"\nHe folded his arms and sat looking at me with an air of the profoundest astonishment, awaiting what I should say next. I did not know how to prepare him.\n\"Why, Esther,\" said he, breaking into a smile, \"our visitor and you are the two last persons on earth I should have thought of connecting together!\"\n\"Oh, yes, guardian, I know it. And I too, but a little while ago.\"\nThe smile passed from his face, and he became graver than before. He crossed to the door to see that it was shut (but I had seen to that) and resumed his seat before me.\n\"Guardian,\" said I, \"do you remember, when we were overtaken by the thunder-storm, Lady Dedlock's speaking to you of her sister?\"\n\"Of course. Of course I do.\"\n\"And reminding you that she and her sister had differed, had gone their several ways?\"\n\"Of course.\"\n\"Why did they separate, guardian?\"\nHis face quite altered as he looked at me. \"My child, what questions are these! I never knew. No one but themselves ever did know, I believe. Who could tell what the secrets of those two handsome and proud women were! You have seen Lady Dedlock. If you had ever seen her sister, you would know her to have been as resolute and haughty as she.\"\n\"Oh, guardian, I have seen her many and many a time!\"\n\"Seen her?\"\nHe paused a little, biting his lip. \"Then, Esther, when you spoke to me long ago of Boythorn, and when I told you that he was all but married once, and that the lady did not die, but died to him, and that that time had had its influence on his later life--did you know it all, and know who the lady was?\"\n\"No, guardian,\" I returned, fearful of the light that dimly broke upon me. \"Nor do I know yet.\"\n\"Lady Dedlock's sister.\"\n\"And why,\" I could scarcely ask him, \"why, guardian, pray tell me why were THEY parted?\"\n\"It was her act, and she kept its motives in her inflexible heart. He afterwards did conjecture (but it was mere conjecture) that some injury which her haughty spirit had received in her cause of quarrel with her sister had wounded her beyond all reason, but she wrote him that from the date of that letter she died to him--as in literal truth she did--and that the resolution was exacted from her by her knowledge of his proud temper and his strained sense of honour, which were both her nature too. In consideration for those master points in him, and even in consideration for them in herself, she made the sacrifice, she said, and would live in it and die in it. She did both, I fear; certainly he never saw her, never heard of her from that hour. Nor did any one.\"\n\"Oh, guardian, what have I done!\" I cried, giving way to my grief; \"what sorrow have I innocently caused!\"\n\"You caused, Esther?\"\n\"Yes, guardian. Innocently, but most surely. That secluded sister is my first remembrance.\"\n\"No, no!\" he cried, starting.\n\"Yes, guardian, yes! And HER sister is my mother!\"\nI would have told him all my mother's letter, but he would not hear it then. He spoke so tenderly and wisely to me, and he put so plainly before me all I had myself imperfectly thought and hoped in my better state of mind, that, penetrated as I had been with fervent gratitude towards him through so many years, I believed I had never loved him so dearly, never thanked him in my heart so fully, as I did that night. And when he had taken me to my room and kissed me at the door, and when at last I lay down to sleep, my thought was how could I ever be busy enough, how could I ever be good enough, how in my little way could I ever hope to be forgetful enough of myself, devoted enough to him, and useful enough to others, to show him how I blessed and honoured him.",
        "paragraph_chars": [
            [
                0,
                993
            ],
            [
                993,
                1760
            ],
            [
                1760,
                2289
            ],
            [
                2289,
                3337
            ],
            [
                3337,
                3442
            ],
            [
                3442,
                3528
            ],
            [
                3528,
                3588
            ],
            [
                3588,
                3669
            ],
            [
                3669,
                3693
            ],
            [
                3693,
                3959
            ],
            [
                3959,
                4076
            ],
            [
                4076,
                4166
            ],
            [
                4166,
                4186
            ],
            [
                4186,
                4691
            ],
            [
                4691,
                4779
            ],
            [
                4779,
                4914
            ],
            [
                4914,
                5038
            ],
            [
                5038,
                5438
            ],
            [
                5438,
                5457
            ],
            [
                5457,
                5863
            ],
            [
                5863,
                5974
            ],
            [
                5974,
                6761
            ],
            [
                6761,
                7345
            ],
            [
                7345,
                8240
            ],
            [
                8240,
                8347
            ],
            [
                8347,
                8792
            ],
            [
                8792,
                8918
            ],
            [
                8918,
                9123
            ],
            [
                9123,
                9233
            ],
            [
                9233,
                9287
            ],
            [
                9287,
                9560
            ],
            [
                9560,
                9669
            ],
            [
                9669,
                10025
            ],
            [
                10025,
                10446
            ],
            [
                10446,
                10510
            ],
            [
                10510,
                10577
            ],
            [
                10577,
                10847
            ],
            [
                10847,
                11005
            ],
            [
                11005,
                11118
            ],
            [
                11118,
                11383
            ],
            [
                11383,
                11482
            ],
            [
                11482,
                12136
            ],
            [
                12136,
                12386
            ],
            [
                12386,
                12801
            ],
            [
                12801,
                12853
            ],
            [
                12853,
                12930
            ],
            [
                12930,
                13151
            ],
            [
                13151,
                13564
            ],
            [
                13564,
                14196
            ],
            [
                14196,
                14663
            ],
            [
                14663,
                14997
            ],
            [
                14997,
                15239
            ],
            [
                15239,
                15463
            ],
            [
                15463,
                15581
            ],
            [
                15581,
                16285
            ],
            [
                16285,
                16363
            ],
            [
                16363,
                16452
            ],
            [
                16452,
                16496
            ],
            [
                16496,
                17245
            ],
            [
                17245,
                17961
            ],
            [
                17961,
                18369
            ],
            [
                18369,
                18634
            ],
            [
                18634,
                18676
            ],
            [
                18676,
                18790
            ],
            [
                18790,
                18849
            ],
            [
                18849,
                19101
            ],
            [
                19101,
                19159
            ],
            [
                19159,
                20864
            ],
            [
                20864,
                21367
            ],
            [
                21367,
                21895
            ],
            [
                21895,
                22280
            ],
            [
                22280,
                22674
            ],
            [
                22674,
                23048
            ],
            [
                23048,
                23081
            ],
            [
                23081,
                23200
            ],
            [
                23200,
                23239
            ],
            [
                23239,
                23685
            ],
            [
                23685,
                23819
            ],
            [
                23819,
                24377
            ],
            [
                24377,
                24456
            ],
            [
                24456,
                25159
            ],
            [
                25159,
                25229
            ],
            [
                25229,
                25478
            ],
            [
                25478,
                25978
            ],
            [
                25978,
                26054
            ],
            [
                26054,
                26123
            ],
            [
                26123,
                26348
            ],
            [
                26348,
                26548
            ],
            [
                26548,
                26718
            ],
            [
                26718,
                27223
            ],
            [
                27223,
                27421
            ],
            [
                27421,
                27872
            ],
            [
                27872,
                28506
            ],
            [
                28506,
                28650
            ],
            [
                28650,
                29102
            ],
            [
                29102,
                29500
            ],
            [
                29500,
                29783
            ],
            [
                29783,
                29810
            ],
            [
                29810,
                29853
            ],
            [
                29853,
                29963
            ],
            [
                29963,
                30252
            ],
            [
                30252,
                30370
            ],
            [
                30370,
                30494
            ],
            [
                30494,
                30567
            ],
            [
                30567,
                30663
            ],
            [
                30663,
                30710
            ],
            [
                30710,
                30717
            ],
            [
                30717,
                30871
            ],
            [
                30871,
                31020
            ],
            [
                31020,
                31087
            ],
            [
                31087,
                31257
            ],
            [
                31257,
                31387
            ],
            [
                31387,
                31416
            ],
            [
                31416,
                31503
            ],
            [
                31503,
                31516
            ],
            [
                31516,
                31551
            ],
            [
                31551,
                31895
            ],
            [
                31895,
                31949
            ],
            [
                31949,
                31961
            ],
            [
                31961,
                32266
            ],
            [
                32266,
                32362
            ],
            [
                32362,
                32387
            ],
            [
                32387,
                32476
            ],
            [
                32476,
                33246
            ],
            [
                33246,
                33353
            ],
            [
                33353,
                33375
            ],
            [
                33375,
                33467
            ],
            [
                33467,
                33497
            ],
            [
                33497,
                33548
            ],
            [
                33548,
                34315
            ]
        ],
        "segment_chars": [
            [
                0,
                108
            ],
            [
                108,
                292
            ],
            [
                292,
                480
            ],
            [
                480,
                521
            ],
            [
                521,
                566
            ],
            [
                566,
                766
            ],
            [
                766,
                993
            ],
            [
                993,
                1211
            ],
            [
                1211,
                1581
            ],
            [
                1581,
                1602
            ],
            [
                1602,
                1721
            ],
            [
                1721,
                1760
            ],
            [
                1760,
                1878
            ],
            [
                1878,
                2048
            ],
            [
                2048,
                2130
            ],
            [
                2130,
                2180
            ],
            [
                2180,
                2193
            ],
            [
                2193,
                2240
            ],
            [
                2240,
                2289
            ],
            [
                2289,
                2411
            ],
            [
                2411,
                2534
            ],
            [
                2534,
                2586
            ],
            [
                2586,
                2658
            ],
            [
                2658,
                2803
            ],
            [
                2803,
                2862
            ],
            [
                2862,
                2932
            ],
            [
                2932,
                2962
            ],
            [
                2962,
                3201
            ],
            [
                3201,
                3337
            ],
            [
                3337,
                3442
            ],
            [
                3442,
                3453
            ],
            [
                3453,
                3528
            ],
            [
                3528,
                3588
            ],
            [
                3588,
                3602
            ],
            [
                3602,
                3630
            ],
            [
                3630,
                3669
            ],
            [
                3669,
                3684
            ],
            [
                3684,
                3693
            ],
            [
                3693,
                3711
            ],
            [
                3711,
                3801
            ],
            [
                3801,
                3959
            ],
            [
                3959,
                4076
            ],
            [
                4076,
                4106
            ],
            [
                4106,
                4166
            ],
            [
                4166,
                4186
            ],
            [
                4186,
                4338
            ],
            [
                4338,
                4393
            ],
            [
                4393,
                4593
            ],
            [
                4593,
                4599
            ],
            [
                4599,
                4661
            ],
            [
                4661,
                4691
            ],
            [
                4691,
                4779
            ],
            [
                4779,
                4833
            ],
            [
                4833,
                4852
            ],
            [
                4852,
                4874
            ],
            [
                4874,
                4893
            ],
            [
                4893,
                4914
            ],
            [
                4914,
                5038
            ],
            [
                5038,
                5048
            ],
            [
                5048,
                5111
            ],
            [
                5111,
                5140
            ],
            [
                5140,
                5164
            ],
            [
                5164,
                5209
            ],
            [
                5209,
                5247
            ],
            [
                5247,
                5343
            ],
            [
                5343,
                5392
            ],
            [
                5392,
                5438
            ],
            [
                5438,
                5449
            ],
            [
                5449,
                5457
            ],
            [
                5457,
                5468
            ],
            [
                5468,
                5505
            ],
            [
                5505,
                5530
            ],
            [
                5530,
                5618
            ],
            [
                5618,
                5664
            ],
            [
                5664,
                5742
            ],
            [
                5742,
                5814
            ],
            [
                5814,
                5863
            ],
            [
                5863,
                5974
            ],
            [
                5974,
                6148
            ],
            [
                6148,
                6431
            ],
            [
                6431,
                6497
            ],
            [
                6497,
                6761
            ],
            [
                6761,
                6995
            ],
            [
                6995,
                7169
            ],
            [
                7169,
                7345
            ],
            [
                7345,
                7441
            ],
            [
                7441,
                7518
            ],
            [
                7518,
                7790
            ],
            [
                7790,
                8037
            ],
            [
                8037,
                8240
            ],
            [
                8240,
                8347
            ],
            [
                8347,
                8369
            ],
            [
                8369,
                8479
            ],
            [
                8479,
                8491
            ],
            [
                8491,
                8520
            ],
            [
                8520,
                8582
            ],
            [
                8582,
                8647
            ],
            [
                8647,
                8712
            ],
            [
                8712,
                8765
            ],
            [
                8765,
                8792
            ],
            [
                8792,
                8918
            ],
            [
                8918,
                9001
            ],
            [
                9001,
                9041
            ],
            [
                9041,
                9123
            ],
            [
                9123,
                9189
            ],
            [
                9189,
                9233
            ],
            [
                9233,
                9274
            ],
            [
                9274,
                9287
            ],
            [
                9287,
                9306
            ],
            [
                9306,
                9311
            ],
            [
                9311,
                9345
            ],
            [
                9345,
                9442
            ],
            [
                9442,
                9523
            ],
            [
                9523,
                9560
            ],
            [
                9560,
                9669
            ],
            [
                9669,
                9784
            ],
            [
                9784,
                9838
            ],
            [
                9838,
                9865
            ],
            [
                9865,
                9979
            ],
            [
                9979,
                10002
            ],
            [
                10002,
                10025
            ],
            [
                10025,
                10155
            ],
            [
                10155,
                10254
            ],
            [
                10254,
                10278
            ],
            [
                10278,
                10331
            ],
            [
                10331,
                10378
            ],
            [
                10378,
                10389
            ],
            [
                10389,
                10418
            ],
            [
                10418,
                10446
            ],
            [
                10446,
                10510
            ],
            [
                10510,
                10577
            ],
            [
                10577,
                10606
            ],
            [
                10606,
                10639
            ],
            [
                10639,
                10720
            ],
            [
                10720,
                10795
            ],
            [
                10795,
                10834
            ],
            [
                10834,
                10847
            ],
            [
                10847,
                11005
            ],
            [
                11005,
                11118
            ],
            [
                11118,
                11124
            ],
            [
                11124,
                11143
            ],
            [
                11143,
                11156
            ],
            [
                11156,
                11204
            ],
            [
                11204,
                11383
            ],
            [
                11383,
                11482
            ],
            [
                11482,
                11602
            ],
            [
                11602,
                11638
            ],
            [
                11638,
                11657
            ],
            [
                11657,
                11681
            ],
            [
                11681,
                11733
            ],
            [
                11733,
                11767
            ],
            [
                11767,
                11814
            ],
            [
                11814,
                11855
            ],
            [
                11855,
                11937
            ],
            [
                11937,
                12038
            ],
            [
                12038,
                12136
            ],
            [
                12136,
                12386
            ],
            [
                12386,
                12514
            ],
            [
                12514,
                12625
            ],
            [
                12625,
                12801
            ],
            [
                12801,
                12839
            ],
            [
                12839,
                12853
            ],
            [
                12853,
                12867
            ],
            [
                12867,
                12912
            ],
            [
                12912,
                12930
            ],
            [
                12930,
                13151
            ],
            [
                13151,
                13269
            ],
            [
                13269,
                13311
            ],
            [
                13311,
                13339
            ],
            [
                13339,
                13474
            ],
            [
                13474,
                13513
            ],
            [
                13513,
                13564
            ],
            [
                13564,
                13901
            ],
            [
                13901,
                14196
            ],
            [
                14196,
                14470
            ],
            [
                14470,
                14663
            ],
            [
                14663,
                14771
            ],
            [
                14771,
                14840
            ],
            [
                14840,
                14906
            ],
            [
                14906,
                14997
            ],
            [
                14997,
                15112
            ],
            [
                15112,
                15239
            ],
            [
                15239,
                15403
            ],
            [
                15403,
                15463
            ],
            [
                15463,
                15581
            ],
            [
                15581,
                15636
            ],
            [
                15636,
                15723
            ],
            [
                15723,
                15836
            ],
            [
                15836,
                15949
            ],
            [
                15949,
                15978
            ],
            [
                15978,
                16011
            ],
            [
                16011,
                16057
            ],
            [
                16057,
                16152
            ],
            [
                16152,
                16190
            ],
            [
                16190,
                16225
            ],
            [
                16225,
                16285
            ],
            [
                16285,
                16363
            ],
            [
                16363,
                16438
            ],
            [
                16438,
                16452
            ],
            [
                16452,
                16469
            ],
            [
                16469,
                16496
            ],
            [
                16496,
                16587
            ],
            [
                16587,
                16683
            ],
            [
                16683,
                16704
            ],
            [
                16704,
                16759
            ],
            [
                16759,
                16895
            ],
            [
                16895,
                16972
            ],
            [
                16972,
                17078
            ],
            [
                17078,
                17198
            ],
            [
                17198,
                17245
            ],
            [
                17245,
                17356
            ],
            [
                17356,
                17543
            ],
            [
                17543,
                17885
            ],
            [
                17885,
                17961
            ],
            [
                17961,
                18051
            ],
            [
                18051,
                18258
            ],
            [
                18258,
                18369
            ],
            [
                18369,
                18428
            ],
            [
                18428,
                18450
            ],
            [
                18450,
                18556
            ],
            [
                18556,
                18634
            ],
            [
                18634,
                18650
            ],
            [
                18650,
                18676
            ],
            [
                18676,
                18790
            ],
            [
                18790,
                18834
            ],
            [
                18834,
                18849
            ],
            [
                18849,
                18943
            ],
            [
                18943,
                18959
            ],
            [
                18959,
                19020
            ],
            [
                19020,
                19101
            ],
            [
                19101,
                19120
            ],
            [
                19120,
                19133
            ],
            [
                19133,
                19159
            ],
            [
                19159,
                19331
            ],
            [
                19331,
                19464
            ],
            [
                19464,
                19470
            ],
            [
                19470,
                19522
            ],
            [
                19522,
                19568
            ],
            [
                19568,
                19586
            ],
            [
                19586,
                19618
            ],
            [
                19618,
                19630
            ],
            [
                19630,
                19663
            ],
            [
                19663,
                19713
            ],
            [
                19713,
                19858
            ],
            [
                19858,
                19957
            ],
            [
                19957,
                20025
            ],
            [
                20025,
                20094
            ],
            [
                20094,
                20170
            ],
            [
                20170,
                20288
            ],
            [
                20288,
                20481
            ],
            [
                20481,
                20615
            ],
            [
                20615,
                20772
            ],
            [
                20772,
                20864
            ],
            [
                20864,
                21061
            ],
            [
                21061,
                21225
            ],
            [
                21225,
                21367
            ],
            [
                21367,
                21552
            ],
            [
                21552,
                21725
            ],
            [
                21725,
                21895
            ],
            [
                21895,
                22028
            ],
            [
                22028,
                22280
            ],
            [
                22280,
                22674
            ],
            [
                22674,
                22777
            ],
            [
                22777,
                22822
            ],
            [
                22822,
                22955
            ],
            [
                22955,
                23048
            ],
            [
                23048,
                23081
            ],
            [
                23081,
                23200
            ],
            [
                23200,
                23239
            ],
            [
                23239,
                23685
            ],
            [
                23685,
                23819
            ],
            [
                23819,
                24316
            ],
            [
                24316,
                24377
            ],
            [
                24377,
                24456
            ],
            [
                24456,
                24529
            ],
            [
                24529,
                24980
            ],
            [
                24980,
                25159
            ],
            [
                25159,
                25229
            ],
            [
                25229,
                25235
            ],
            [
                25235,
                25355
            ],
            [
                25355,
                25478
            ],
            [
                25478,
                25525
            ],
            [
                25525,
                25639
            ],
            [
                25639,
                25761
            ],
            [
                25761,
                25978
            ],
            [
                25978,
                26036
            ],
            [
                26036,
                26054
            ],
            [
                26054,
                26083
            ],
            [
                26083,
                26106
            ],
            [
                26106,
                26123
            ],
            [
                26123,
                26174
            ],
            [
                26174,
                26288
            ],
            [
                26288,
                26348
            ],
            [
                26348,
                26548
            ],
            [
                26548,
                26718
            ],
            [
                26718,
                26801
            ],
            [
                26801,
                26849
            ],
            [
                26849,
                26933
            ],
            [
                26933,
                27223
            ],
            [
                27223,
                27289
            ],
            [
                27289,
                27358
            ],
            [
                27358,
                27421
            ],
            [
                27421,
                27447
            ],
            [
                27447,
                27536
            ],
            [
                27536,
                27638
            ],
            [
                27638,
                27872
            ],
            [
                27872,
                28135
            ],
            [
                28135,
                28259
            ],
            [
                28259,
                28506
            ],
            [
                28506,
                28584
            ],
            [
                28584,
                28650
            ],
            [
                28650,
                28816
            ],
            [
                28816,
                28919
            ],
            [
                28919,
                29102
            ],
            [
                29102,
                29204
            ],
            [
                29204,
                29500
            ],
            [
                29500,
                29660
            ],
            [
                29660,
                29783
            ],
            [
                29783,
                29810
            ],
            [
                29810,
                29833
            ],
            [
                29833,
                29853
            ],
            [
                29853,
                29877
            ],
            [
                29877,
                29963
            ],
            [
                29963,
                30063
            ],
            [
                30063,
                30252
            ],
            [
                30252,
                30316
            ],
            [
                30316,
                30370
            ],
            [
                30370,
                30394
            ],
            [
                30394,
                30443
            ],
            [
                30443,
                30447
            ],
            [
                30447,
                30494
            ],
            [
                30494,
                30567
            ],
            [
                30567,
                30663
            ],
            [
                30663,
                30686
            ],
            [
                30686,
                30710
            ],
            [
                30710,
                30717
            ],
            [
                30717,
                30836
            ],
            [
                30836,
                30871
            ],
            [
                30871,
                31020
            ],
            [
                31020,
                31051
            ],
            [
                31051,
                31087
            ],
            [
                31087,
                31153
            ],
            [
                31153,
                31257
            ],
            [
                31257,
                31387
            ],
            [
                31387,
                31399
            ],
            [
                31399,
                31416
            ],
            [
                31416,
                31503
            ],
            [
                31503,
                31516
            ],
            [
                31516,
                31551
            ],
            [
                31551,
                31594
            ],
            [
                31594,
                31631
            ],
            [
                31631,
                31645
            ],
            [
                31645,
                31693
            ],
            [
                31693,
                31769
            ],
            [
                31769,
                31797
            ],
            [
                31797,
                31895
            ],
            [
                31895,
                31949
            ],
            [
                31949,
                31961
            ],
            [
                31961,
                31997
            ],
            [
                31997,
                32266
            ],
            [
                32266,
                32341
            ],
            [
                32341,
                32362
            ],
            [
                32362,
                32387
            ],
            [
                32387,
                32476
            ],
            [
                32476,
                32543
            ],
            [
                32543,
                32977
            ],
            [
                32977,
                33143
            ],
            [
                33143,
                33228
            ],
            [
                33228,
                33246
            ],
            [
                33246,
                33280
            ],
            [
                33280,
                33353
            ],
            [
                33353,
                33375
            ],
            [
                33375,
                33391
            ],
            [
                33391,
                33420
            ],
            [
                33420,
                33467
            ],
            [
                33467,
                33477
            ],
            [
                33477,
                33497
            ],
            [
                33497,
                33518
            ],
            [
                33518,
                33548
            ],
            [
                33548,
                33625
            ],
            [
                33625,
                33965
            ],
            [
                33965,
                34315
            ]
        ],
        "overlap_chars": [
            [
                31,
                40
            ],
            [
                26,
                30
            ],
            [
                41,
                76
            ],
            [
                86,
                108
            ],
            [
                108,
                146
            ],
            [
                147,
                149
            ],
            [
                167,
                170
            ],
            [
                181,
                198
            ],
            [
                218,
                221
            ],
            [
                203,
                208
            ],
            [
                238,
                246
            ],
            [
                253,
                292
            ],
            [
                292,
                322
            ],
            [
                344,
                368
            ],
            [
                372,
                375
            ],
            [
                379,
                480
            ],
            [
                480,
                521
            ],
            [
                521,
                566
            ],
            [
                566,
                594
            ],
            [
                616,
                635
            ],
            [
                666,
                708
            ],
            [
                741,
                765
            ],
            [
                1019,
                1067
            ],
            [
                1135,
                1138
            ],
            [
                1068,
                1133
            ],
            [
                1209,
                1211
            ],
            [
                1295,
                1384
            ],
            [
                1392,
                1396
            ],
            [
                1234,
                1235
            ],
            [
                1397,
                1444
            ],
            [
                1445,
                1452
            ],
            [
                1457,
                1485
            ],
            [
                1526,
                1539
            ],
            [
                1554,
                1581
            ],
            [
                1581,
                1600
            ],
            [
                1600,
                1601
            ],
            [
                1760,
                1845
            ],
            [
                1855,
                1862
            ],
            [
                1876,
                1878
            ],
            [
                1878,
                2032
            ],
            [
                2046,
                2048
            ],
            [
                2048,
                2063
            ],
            [
                2072,
                2077
            ],
            [
                2128,
                2129
            ],
            [
                2130,
                2180
            ],
            [
                2180,
                2193
            ],
            [
                2193,
                2240
            ],
            [
                2240,
                2289
            ],
            [
                2289,
                2336
            ],
            [
                2368,
                2411
            ],
            [
                2411,
                2534
            ],
            [
                2534,
                2542
            ],
            [
                2551,
                2586
            ],
            [
                2586,
                2658
            ],
            [
                2867,
                2892
            ],
            [
                2930,
                2932
            ],
            [
                2932,
                2962
            ],
            [
                2962,
                2996
            ],
            [
                3002,
                3032
            ],
            [
                3199,
                3200
            ],
            [
                3337,
                3338
            ],
            [
                3385,
                3442
            ],
            [
                3442,
                3453
            ],
            [
                3453,
                3504
            ],
            [
                3517,
                3528
            ],
            [
                3528,
                3588
            ],
            [
                3588,
                3602
            ],
            [
                3602,
                3622
            ],
            [
                3628,
                3630
            ],
            [
                3711,
                3775
            ],
            [
                3787,
                3799
            ],
            [
                3776,
                3778
            ],
            [
                3799,
                3801
            ],
            [
                3801,
                3834
            ],
            [
                3874,
                3881
            ],
            [
                3893,
                3959
            ],
            [
                3959,
                3989
            ],
            [
                4046,
                4076
            ],
            [
                4186,
                4211
            ],
            [
                4223,
                4231
            ],
            [
                4245,
                4272
            ],
            [
                4278,
                4297
            ],
            [
                4325,
                4338
            ],
            [
                4338,
                4393
            ],
            [
                4393,
                4402
            ],
            [
                4439,
                4451
            ],
            [
                4493,
                4503
            ],
            [
                4511,
                4591
            ],
            [
                4691,
                4779
            ],
            [
                4779,
                4780
            ],
            [
                4790,
                4833
            ],
            [
                4833,
                4852
            ],
            [
                4874,
                4893
            ],
            [
                4893,
                4914
            ],
            [
                4914,
                5038
            ],
            [
                5038,
                5048
            ],
            [
                5048,
                5111
            ],
            [
                5111,
                5138
            ],
            [
                5209,
                5247
            ],
            [
                5392,
                5438
            ],
            [
                5438,
                5449
            ],
            [
                5449,
                5457
            ],
            [
                5457,
                5468
            ],
            [
                5468,
                5505
            ],
            [
                5505,
                5530
            ],
            [
                5530,
                5535
            ],
            [
                5564,
                5618
            ],
            [
                5618,
                5643
            ],
            [
                5644,
                5664
            ],
            [
                5664,
                5742
            ],
            [
                5742,
                5814
            ],
            [
                5814,
                5863
            ],
            [
                5888,
                5909
            ],
            [
                5926,
                5974
            ],
            [
                5974,
                6133
            ],
            [
                6140,
                6148
            ],
            [
                6148,
                6269
            ],
            [
                6368,
                6431
            ],
            [
                6431,
                6442
            ],
            [
                6452,
                6457
            ],
            [
                6443,
                6448
            ],
            [
                6495,
                6497
            ],
            [
                6497,
                6540
            ],
            [
                6567,
                6627
            ],
            [
                6681,
                6761
            ],
            [
                6761,
                6773
            ],
            [
                6785,
                6826
            ],
            [
                6833,
                6844
            ],
            [
                6873,
                6953
            ],
            [
                6993,
                6995
            ],
            [
                6995,
                7168
            ],
            [
                7345,
                7441
            ],
            [
                7441,
                7453
            ],
            [
                7479,
                7493
            ],
            [
                7499,
                7518
            ],
            [
                7518,
                7530
            ],
            [
                7538,
                7679
            ],
            [
                7703,
                7775
            ],
            [
                7788,
                7790
            ],
            [
                7790,
                7852
            ],
            [
                7865,
                7940
            ],
            [
                7951,
                8036
            ],
            [
                8037,
                8109
            ],
            [
                8124,
                8152
            ],
            [
                8154,
                8179
            ],
            [
                8181,
                8239
            ],
            [
                8240,
                8242
            ],
            [
                8300,
                8347
            ],
            [
                8347,
                8369
            ],
            [
                8369,
                8414
            ],
            [
                8422,
                8433
            ],
            [
                8451,
                8479
            ],
            [
                8479,
                8491
            ],
            [
                8491,
                8520
            ],
            [
                8520,
                8582
            ],
            [
                8582,
                8645
            ],
            [
                8792,
                8813
            ],
            [
                8872,
                8918
            ],
            [
                8918,
                9001
            ],
            [
                9001,
                9041
            ],
            [
                9041,
                9123
            ],
            [
                9123,
                9187
            ],
            [
                9233,
                9274
            ],
            [
                9274,
                9287
            ],
            [
                9287,
                9306
            ],
            [
                9311,
                9345
            ],
            [
                9345,
                9442
            ],
            [
                9442,
                9483
            ],
            [
                9485,
                9523
            ],
            [
                9523,
                9560
            ],
            [
                9560,
                9669
            ],
            [
                9669,
                9733
            ],
            [
                9746,
                9784
            ],
            [
                9784,
                9838
            ],
            [
                9838,
                9865
            ],
            [
                9865,
                9979
            ],
            [
                9979,
                10002
            ],
            [
                10002,
                10025
            ],
            [
                10025,
                10069
            ],
            [
                10085,
                10154
            ],
            [
                10155,
                10254
            ],
            [
                10254,
                10276
            ],
            [
                10510,
                10524
            ],
            [
                10528,
                10577
            ],
            [
                10577,
                10606
            ],
            [
                10606,
                10639
            ],
            [
                10639,
                10720
            ],
            [
                10720,
                10723
            ],
            [
                10731,
                10793
            ],
            [
                10847,
                10883
            ],
            [
                10889,
                10893
            ],
            [
                10948,
                11005
            ],
            [
                11005,
                11118
            ],
            [
                11118,
                11124
            ],
            [
                11124,
                11143
            ],
            [
                11143,
                11156
            ],
            [
                11156,
                11204
            ],
            [
                11244,
                11263
            ],
            [
                11225,
                11231
            ],
            [
                11266,
                11299
            ],
            [
                11340,
                11383
            ],
            [
                11383,
                11474
            ],
            [
                11475,
                11482
            ],
            [
                11482,
                11523
            ],
            [
                11529,
                11532
            ],
            [
                11582,
                11602
            ],
            [
                11602,
                11638
            ],
            [
                11638,
                11657
            ],
            [
                11657,
                11681
            ],
            [
                11681,
                11733
            ],
            [
                11767,
                11814
            ],
            [
                11814,
                11855
            ],
            [
                12018,
                12036
            ],
            [
                12136,
                12217
            ],
            [
                12226,
                12229
            ],
            [
                12238,
                12285
            ],
            [
                12289,
                12293
            ],
            [
                12348,
                12386
            ],
            [
                12386,
                12474
            ],
            [
                12534,
                12541
            ],
            [
                12580,
                12625
            ],
            [
                12625,
                12646
            ],
            [
                12674,
                12717
            ],
            [
                12660,
                12669
            ],
            [
                12765,
                12801
            ],
            [
                12801,
                12839
            ],
            [
                12839,
                12853
            ],
            [
                12853,
                12867
            ],
            [
                12867,
                12912
            ],
            [
                12912,
                12928
            ],
            [
                12930,
                13085
            ],
            [
                13090,
                13151
            ],
            [
                13151,
                13198
            ],
            [
                13250,
                13269
            ],
            [
                13269,
                13311
            ],
            [
                13311,
                13339
            ],
            [
                13339,
                13378
            ],
            [
                13438,
                13474
            ],
            [
                13474,
                13490
            ],
            [
                13511,
                13513
            ],
            [
                13513,
                13523
            ],
            [
                13532,
                13564
            ],
            [
                13564,
                13576
            ],
            [
                13637,
                13650
            ],
            [
                13585,
                13606
            ],
            [
                13856,
                13860
            ],
            [
                13617,
                13621
            ],
            [
                13869,
                13871
            ],
            [
                13881,
                13901
            ],
            [
                13959,
                13979
            ],
            [
                13942,
                13951
            ],
            [
                13933,
                13941
            ],
            [
                13980,
                14041
            ],
            [
                14072,
                14095
            ],
            [
                13922,
                13932
            ],
            [
                14051,
                14057
            ],
            [
                14095,
                14169
            ],
            [
                14178,
                14196
            ],
            [
                14259,
                14269
            ],
            [
                14270,
                14366
            ],
            [
                14470,
                14472
            ],
            [
                14478,
                14487
            ],
            [
                14489,
                14506
            ],
            [
                14511,
                14598
            ],
            [
                14610,
                14663
            ],
            [
                14663,
                14722
            ],
            [
                14724,
                14771
            ],
            [
                14771,
                14807
            ],
            [
                14809,
                14840
            ],
            [
                14840,
                14873
            ],
            [
                14881,
                14906
            ],
            [
                14906,
                14997
            ],
            [
                14997,
                15111
            ],
            [
                15239,
                15240
            ],
            [
                15403,
                15417
            ],
            [
                15254,
                15275
            ],
            [
                15332,
                15333
            ],
            [
                15418,
                15463
            ],
            [
                15463,
                15581
            ],
            [
                15581,
                15636
            ],
            [
                15723,
                15757
            ],
            [
                15793,
                15836
            ],
            [
                15836,
                15862
            ],
            [
                15866,
                15880
            ],
            [
                15887,
                15949
            ],
            [
                15949,
                15978
            ],
            [
                15978,
                16011
            ],
            [
                16011,
                16057
            ],
            [
                16057,
                16152
            ],
            [
                16152,
                16190
            ],
            [
                16190,
                16225
            ],
            [
                16225,
                16285
            ],
            [
                16285,
                16363
            ],
            [
                16363,
                16438
            ],
            [
                16438,
                16452
            ],
            [
                16452,
                16469
            ],
            [
                16469,
                16496
            ],
            [
                16496,
                16497
            ],
            [
                16587,
                16639
            ],
            [
                16535,
                16585
            ],
            [
                16639,
                16683
            ],
            [
                16683,
                16704
            ],
            [
                16704,
                16759
            ],
            [
                16759,
                16848
            ],
            [
                16859,
                16895
            ],
            [
                16984,
                17001
            ],
            [
                17025,
                17076
            ],
            [
                17245,
                17356
            ],
            [
                17356,
                17408
            ],
            [
                17435,
                17521
            ],
            [
                17541,
                17542
            ],
            [
                17961,
                18051
            ],
            [
                18051,
                18258
            ],
            [
                18258,
                18274
            ],
            [
                18286,
                18369
            ],
            [
                18369,
                18428
            ],
            [
                18428,
                18441
            ],
            [
                18448,
                18450
            ],
            [
                18450,
                18556
            ],
            [
                18556,
                18634
            ],
            [
                18634,
                18650
            ],
            [
                18650,
                18676
            ],
            [
                18676,
                18744
            ],
            [
                18769,
                18790
            ],
            [
                18790,
                18834
            ],
            [
                18834,
                18849
            ],
            [
                18849,
                18912
            ],
            [
                18917,
                18943
            ],
            [
                19099,
                19100
            ],
            [
                19020,
                19097
            ],
            [
                19101,
                19118
            ],
            [
                19133,
                19137
            ],
            [
                19148,
                19159
            ],
            [
                19159,
                19185
            ],
            [
                19221,
                19331
            ],
            [
                19331,
                19422
            ],
            [
                19426,
                19464
            ],
            [
                19464,
                19470
            ],
            [
                19470,
                19522
            ],
            [
                19522,
                19568
            ],
            [
                19568,
                19584
            ],
            [
                19602,
                19603
            ],
            [
                19630,
                19663
            ],
            [
                19663,
                19713
            ],
            [
                19713,
                19722
            ],
            [
                19957,
                20025
            ],
            [
                20025,
                20044
            ],
            [
                20063,
                20094
            ],
            [
                20114,
                20115
            ],
            [
                20162,
                20170
            ],
            [
                20170,
                20179
            ],
            [
                20184,
                20195
            ],
            [
                20237,
                20288
            ],
            [
                20481,
                20502
            ],
            [
                20510,
                20529
            ],
            [
                20548,
                20550
            ],
            [
                20577,
                20615
            ],
            [
                20615,
                20645
            ],
            [
                20673,
                20696
            ],
            [
                20770,
                20772
            ],
            [
                20772,
                20864
            ],
            [
                20864,
                21061
            ],
            [
                21061,
                21093
            ],
            [
                21110,
                21114
            ],
            [
                21096,
                21106
            ],
            [
                21175,
                21196
            ],
            [
                21223,
                21224
            ],
            [
                21367,
                21395
            ],
            [
                21413,
                21442
            ],
            [
                21397,
                21400
            ],
            [
                21473,
                21482
            ],
            [
                21513,
                21552
            ],
            [
                21552,
                21625
            ],
            [
                21644,
                21658
            ],
            [
                21640,
                21643
            ],
            [
                21688,
                21725
            ],
            [
                22028,
                22048
            ],
            [
                22064,
                22067
            ],
            [
                22072,
                22073
            ],
            [
                22077,
                22159
            ],
            [
                22164,
                22244
            ],
            [
                22278,
                22280
            ],
            [
                22280,
                22371
            ],
            [
                22393,
                22417
            ],
            [
                22573,
                22579
            ],
            [
                22505,
                22506
            ],
            [
                22580,
                22674
            ],
            [
                22674,
                22701
            ],
            [
                22745,
                22777
            ],
            [
                22822,
                22888
            ],
            [
                22896,
                22906
            ],
            [
                22889,
                22892
            ],
            [
                22928,
                22946
            ],
            [
                22918,
                22928
            ],
            [
                22950,
                22955
            ],
            [
                22955,
                23035
            ],
            [
                23046,
                23048
            ],
            [
                23048,
                23081
            ],
            [
                23081,
                23115
            ],
            [
                23125,
                23196
            ],
            [
                23200,
                23239
            ],
            [
                23239,
                23249
            ],
            [
                23251,
                23272
            ],
            [
                23278,
                23344
            ],
            [
                23367,
                23401
            ],
            [
                23427,
                23445
            ],
            [
                23501,
                23529
            ],
            [
                23423,
                23426
            ],
            [
                23541,
                23558
            ],
            [
                23570,
                23582
            ],
            [
                23660,
                23685
            ],
            [
                23685,
                23760
            ],
            [
                23793,
                23806
            ],
            [
                23816,
                23819
            ],
            [
                23819,
                23876
            ],
            [
                23894,
                23900
            ],
            [
                24002,
                24010
            ],
            [
                24079,
                24131
            ],
            [
                24301,
                24303
            ],
            [
                24053,
                24055
            ],
            [
                24309,
                24314
            ],
            [
                24174,
                24178
            ],
            [
                24199,
                24207
            ],
            [
                24314,
                24316
            ],
            [
                24316,
                24317
            ],
            [
                24325,
                24374
            ],
            [
                24549,
                24561
            ],
            [
                24563,
                24565
            ],
            [
                24567,
                24571
            ],
            [
                24542,
                24543
            ],
            [
                24547,
                24548
            ],
            [
                24573,
                24643
            ],
            [
                24539,
                24542
            ],
            [
                24686,
                24779
            ],
            [
                24799,
                24851
            ],
            [
                24880,
                24927
            ],
            [
                24977,
                24980
            ],
            [
                24980,
                25031
            ],
            [
                25052,
                25081
            ],
            [
                25099,
                25105
            ],
            [
                25118,
                25127
            ],
            [
                25129,
                25146
            ],
            [
                25148,
                25159
            ],
            [
                25159,
                25207
            ],
            [
                25218,
                25229
            ],
            [
                25229,
                25235
            ],
            [
                25235,
                25258
            ],
            [
                25260,
                25292
            ],
            [
                25353,
                25355
            ],
            [
                25355,
                25478
            ],
            [
                25478,
                25515
            ],
            [
                25523,
                25525
            ],
            [
                25540,
                25582
            ],
            [
                25597,
                25639
            ],
            [
                25639,
                25715
            ],
            [
                25726,
                25761
            ],
            [
                25761,
                25896
            ],
            [
                25912,
                25978
            ],
            [
                25978,
                26036
            ],
            [
                26036,
                26054
            ],
            [
                26054,
                26083
            ],
            [
                26083,
                26106
            ],
            [
                26106,
                26123
            ],
            [
                26123,
                26174
            ],
            [
                26174,
                26263
            ],
            [
                26269,
                26288
            ],
            [
                26288,
                26323
            ],
            [
                26338,
                26348
            ],
            [
                26348,
                26371
            ],
            [
                26449,
                26467
            ],
            [
                26371,
                26396
            ],
            [
                26438,
                26439
            ],
            [
                26477,
                26479
            ],
            [
                26550,
                26647
            ],
            [
                26677,
                26715
            ],
            [
                26849,
                26850
            ],
            [
                26860,
                26894
            ],
            [
                26931,
                26933
            ],
            [
                26933,
                26954
            ],
            [
                26964,
                26966
            ],
            [
                26982,
                26995
            ],
            [
                27011,
                27022
            ],
            [
                27098,
                27102
            ],
            [
                27075,
                27097
            ],
            [
                27038,
                27058
            ],
            [
                27112,
                27120
            ],
            [
                27155,
                27210
            ],
            [
                27212,
                27214
            ],
            [
                27216,
                27223
            ],
            [
                27223,
                27288
            ],
            [
                27421,
                27447
            ],
            [
                27536,
                27577
            ],
            [
                27580,
                27585
            ],
            [
                27665,
                27692
            ],
            [
                27726,
                27735
            ],
            [
                27745,
                27768
            ],
            [
                27775,
                27810
            ],
            [
                27812,
                27872
            ],
            [
                27872,
                27947
            ],
            [
                27956,
                28058
            ],
            [
                28075,
                28096
            ],
            [
                28133,
                28135
            ],
            [
                28135,
                28232
            ],
            [
                28245,
                28257
            ],
            [
                28650,
                28671
            ],
            [
                28765,
                28799
            ],
            [
                28814,
                28816
            ],
            [
                28816,
                28919
            ],
            [
                28956,
                29001
            ],
            [
                29008,
                29053
            ],
            [
                29063,
                29102
            ],
            [
                29115,
                29141
            ],
            [
                29167,
                29204
            ],
            [
                29204,
                29300
            ],
            [
                29418,
                29500
            ],
            [
                29500,
                29571
            ],
            [
                29590,
                29598
            ],
            [
                29620,
                29660
            ],
            [
                29660,
                29783
            ],
            [
                29783,
                29810
            ],
            [
                29810,
                29833
            ],
            [
                29833,
                29853
            ],
            [
                29853,
                29877
            ],
            [
                29877,
                29963
            ],
            [
                29963,
                29965
            ],
            [
                29986,
                29999
            ],
            [
                30014,
                30063
            ],
            [
                30063,
                30132
            ],
            [
                30142,
                30159
            ],
            [
                30161,
                30252
            ],
            [
                30252,
                30316
            ],
            [
                30316,
                30370
            ],
            [
                30370,
                30394
            ],
            [
                30394,
                30441
            ],
            [
                30485,
                30486
            ],
            [
                30622,
                30653
            ],
            [
                30491,
                30494
            ],
            [
                30686,
                30710
            ],
            [
                30710,
                30717
            ],
            [
                30717,
                30719
            ],
            [
                30740,
                30801
            ],
            [
                30834,
                30836
            ],
            [
                30871,
                31020
            ],
            [
                31020,
                31038
            ],
            [
                31049,
                31051
            ],
            [
                31051,
                31087
            ],
            [
                31087,
                31132
            ],
            [
                31151,
                31153
            ],
            [
                31153,
                31199
            ],
            [
                31225,
                31257
            ],
            [
                31257,
                31387
            ],
            [
                31387,
                31397
            ],
            [
                31416,
                31462
            ],
            [
                31477,
                31487
            ],
            [
                31496,
                31503
            ],
            [
                31503,
                31504
            ],
            [
                31513,
                31516
            ],
            [
                31516,
                31551
            ],
            [
                31551,
                31559
            ],
            [
                31566,
                31594
            ],
            [
                31594,
                31631
            ],
            [
                31631,
                31645
            ],
            [
                31645,
                31693
            ],
            [
                31693,
                31769
            ],
            [
                31769,
                31797
            ],
            [
                31797,
                31895
            ],
            [
                31895,
                31930
            ],
            [
                31940,
                31949
            ],
            [
                31949,
                31960
            ],
            [
                31961,
                31997
            ],
            [
                31997,
                32107
            ],
            [
                32217,
                32266
            ],
            [
                32266,
                32292
            ],
            [
                32339,
                32340
            ],
            [
                32362,
                32363
            ],
            [
                32368,
                32387
            ],
            [
                32387,
                32388
            ],
            [
                32438,
                32452
            ],
            [
                32422,
                32423
            ],
            [
                32453,
                32476
            ],
            [
                32476,
                32517
            ],
            [
                32541,
                32543
            ],
            [
                32543,
                32560
            ],
            [
                32606,
                32610
            ],
            [
                32672,
                32711
            ],
            [
                32628,
                32642
            ],
            [
                32712,
                32744
            ],
            [
                32745,
                32758
            ],
            [
                32601,
                32605
            ],
            [
                32763,
                32767
            ],
            [
                32783,
                32798
            ],
            [
                32943,
                32944
            ],
            [
                32829,
                32837
            ],
            [
                32820,
                32823
            ],
            [
                32877,
                32918
            ],
            [
                32928,
                32943
            ],
            [
                32975,
                32977
            ],
            [
                32977,
                33003
            ],
            [
                33011,
                33029
            ],
            [
                33061,
                33105
            ],
            [
                33141,
                33143
            ],
            [
                33175,
                33177
            ],
            [
                33193,
                33228
            ],
            [
                33228,
                33235
            ],
            [
                33243,
                33246
            ],
            [
                33246,
                33280
            ],
            [
                33280,
                33350
            ],
            [
                33391,
                33420
            ],
            [
                33420,
                33467
            ],
            [
                33467,
                33468
            ],
            [
                33472,
                33477
            ],
            [
                33477,
                33497
            ],
            [
                33497,
                33518
            ],
            [
                33518,
                33548
            ],
            [
                33548,
                33625
            ],
            [
                33625,
                33663
            ],
            [
                33771,
                33776
            ],
            [
                33788,
                33964
            ],
            [
                33965,
                34113
            ],
            [
                34134,
                34146
            ],
            [
                34192,
                34315
            ]
        ],
        "row_chars": [
            [
                0,
                108
            ],
            [
                108,
                292
            ],
            [
                292,
                480
            ],
            [
                480,
                521
            ],
            [
                521,
                566
            ],
            [
                566,
                766
            ],
            [
                766,
                993
            ],
            [
                993,
                1211
            ],
            [
                1211,
                1581
            ],
            [
                1581,
                1602
            ],
            [
                1602,
                1721
            ],
            [
                1721,
                1760
            ],
            [
                1760,
                1878
            ],
            [
                1878,
                2048
            ],
            [
                2048,
                2130
            ],
            [
                2130,
                2180
            ],
            [
                2180,
                2193
            ],
            [
                2193,
                2240
            ],
            [
                2240,
                2289
            ],
            [
                2289,
                2411
            ],
            [
                2411,
                2534
            ],
            [
                2534,
                2586
            ],
            [
                2586,
                2658
            ],
            [
                2658,
                2803
            ],
            [
                2803,
                2862
            ],
            [
                2862,
                2932
            ],
            [
                2932,
                2962
            ],
            [
                2962,
                3201
            ],
            [
                3201,
                3337
            ],
            [
                3337,
                3442
            ],
            [
                3442,
                3453
            ],
            [
                3453,
                3528
            ],
            [
                3528,
                3588
            ],
            [
                3588,
                3602
            ],
            [
                3602,
                3630
            ],
            [
                3630,
                3669
            ],
            [
                3669,
                3684
            ],
            [
                3684,
                3693
            ],
            [
                3693,
                3711
            ],
            [
                3711,
                3801
            ],
            [
                3801,
                3959
            ],
            [
                3959,
                4076
            ],
            [
                4076,
                4106
            ],
            [
                4106,
                4166
            ],
            [
                4166,
                4186
            ],
            [
                4186,
                4338
            ],
            [
                4338,
                4393
            ],
            [
                4393,
                4593
            ],
            [
                4593,
                4599
            ],
            [
                4599,
                4661
            ],
            [
                4661,
                4691
            ],
            [
                4691,
                4779
            ],
            [
                4779,
                4833
            ],
            [
                4833,
                4852
            ],
            [
                4852,
                4874
            ],
            [
                4874,
                4893
            ],
            [
                4893,
                4914
            ],
            [
                4914,
                5038
            ],
            [
                5038,
                5048
            ],
            [
                5048,
                5111
            ],
            [
                5111,
                5140
            ],
            [
                5140,
                5164
            ],
            [
                5164,
                5209
            ],
            [
                5209,
                5247
            ],
            [
                5247,
                5343
            ],
            [
                5343,
                5392
            ],
            [
                5392,
                5438
            ],
            [
                5438,
                5449
            ],
            [
                5449,
                5457
            ],
            [
                5457,
                5468
            ],
            [
                5468,
                5505
            ],
            [
                5505,
                5530
            ],
            [
                5530,
                5618
            ],
            [
                5618,
                5664
            ],
            [
                5664,
                5742
            ],
            [
                5742,
                5814
            ],
            [
                5814,
                5863
            ],
            [
                5863,
                5974
            ],
            [
                5974,
                6148
            ],
            [
                6148,
                6431
            ],
            [
                6431,
                6497
            ],
            [
                6497,
                6761
            ],
            [
                6761,
                6995
            ],
            [
                6995,
                7169
            ],
            [
                7169,
                7345
            ],
            [
                7345,
                7441
            ],
            [
                7441,
                7518
            ],
            [
                7518,
                7790
            ],
            [
                7790,
                8037
            ],
            [
                8037,
                8240
            ],
            [
                8240,
                8347
            ],
            [
                8347,
                8369
            ],
            [
                8369,
                8479
            ],
            [
                8479,
                8491
            ],
            [
                8491,
                8520
            ],
            [
                8520,
                8582
            ],
            [
                8582,
                8647
            ],
            [
                8647,
                8712
            ],
            [
                8712,
                8765
            ],
            [
                8765,
                8792
            ],
            [
                8792,
                8918
            ],
            [
                8918,
                9001
            ],
            [
                9001,
                9041
            ],
            [
                9041,
                9123
            ],
            [
                9123,
                9189
            ],
            [
                9189,
                9233
            ],
            [
                9233,
                9274
            ],
            [
                9274,
                9287
            ],
            [
                9287,
                9306
            ],
            [
                9306,
                9311
            ],
            [
                9311,
                9345
            ],
            [
                9345,
                9442
            ],
            [
                9442,
                9523
            ],
            [
                9523,
                9560
            ],
            [
                9560,
                9669
            ],
            [
                9669,
                9784
            ],
            [
                9784,
                9838
            ],
            [
                9838,
                9865
            ],
            [
                9865,
                9979
            ],
            [
                9979,
                10002
            ],
            [
                10002,
                10025
            ],
            [
                10025,
                10155
            ],
            [
                10155,
                10254
            ],
            [
                10254,
                10278
            ],
            [
                10278,
                10331
            ],
            [
                10331,
                10378
            ],
            [
                10378,
                10389
            ],
            [
                10389,
                10418
            ],
            [
                10418,
                10446
            ],
            [
                10446,
                10510
            ],
            [
                10510,
                10577
            ],
            [
                10577,
                10606
            ],
            [
                10606,
                10639
            ],
            [
                10639,
                10720
            ],
            [
                10720,
                10795
            ],
            [
                10795,
                10834
            ],
            [
                10834,
                10847
            ],
            [
                10847,
                11005
            ],
            [
                11005,
                11118
            ],
            [
                11118,
                11124
            ],
            [
                11124,
                11143
            ],
            [
                11143,
                11156
            ],
            [
                11156,
                11204
            ],
            [
                11204,
                11383
            ],
            [
                11383,
                11482
            ],
            [
                11482,
                11602
            ],
            [
                11602,
                11638
            ],
            [
                11638,
                11657
            ],
            [
                11657,
                11681
            ],
            [
                11681,
                11733
            ],
            [
                11733,
                11767
            ],
            [
                11767,
                11814
            ],
            [
                11814,
                11855
            ],
            [
                11855,
                11937
            ],
            [
                11937,
                12038
            ],
            [
                12038,
                12136
            ],
            [
                12136,
                12386
            ],
            [
                12386,
                12625
            ],
            [
                12625,
                12801
            ],
            [
                12801,
                12839
            ],
            [
                12839,
                12853
            ],
            [
                12853,
                12867
            ],
            [
                12867,
                12912
            ],
            [
                12912,
                12930
            ],
            [
                12930,
                13151
            ],
            [
                13151,
                13269
            ],
            [
                13269,
                13311
            ],
            [
                13311,
                13339
            ],
            [
                13339,
                13474
            ],
            [
                13474,
                13513
            ],
            [
                13513,
                13564
            ],
            [
                13564,
                13901
            ],
            [
                13901,
                14196
            ],
            [
                14196,
                14470
            ],
            [
                14470,
                14663
            ],
            [
                14663,
                14771
            ],
            [
                14771,
                14840
            ],
            [
                14840,
                14906
            ],
            [
                14906,
                14997
            ],
            [
                14997,
                15112
            ],
            [
                15112,
                15239
            ],
            [
                15239,
                15463
            ],
            [
                15463,
                15581
            ],
            [
                15581,
                15636
            ],
            [
                15636,
                15723
            ],
            [
                15723,
                15836
            ],
            [
                15836,
                15949
            ],
            [
                15949,
                15978
            ],
            [
                15978,
                16011
            ],
            [
                16011,
                16057
            ],
            [
                16057,
                16152
            ],
            [
                16152,
                16190
            ],
            [
                16190,
                16225
            ],
            [
                16225,
                16285
            ],
            [
                16285,
                16363
            ],
            [
                16363,
                16438
            ],
            [
                16438,
                16452
            ],
            [
                16452,
                16469
            ],
            [
                16469,
                16496
            ],
            [
                16496,
                16683
            ],
            [
                16683,
                16704
            ],
            [
                16704,
                16759
            ],
            [
                16759,
                16895
            ],
            [
                16895,
                16972
            ],
            [
                16972,
                17078
            ],
            [
                17078,
                17198
            ],
            [
                17198,
                17245
            ],
            [
                17245,
                17356
            ],
            [
                17356,
                17543
            ],
            [
                17543,
                17885
            ],
            [
                17885,
                17961
            ],
            [
                17961,
                18051
            ],
            [
                18051,
                18258
            ],
            [
                18258,
                18369
            ],
            [
                18369,
                18428
            ],
            [
                18428,
                18450
            ],
            [
                18450,
                18556
            ],
            [
                18556,
                18634
            ],
            [
                18634,
                18650
            ],
            [
                18650,
                18676
            ],
            [
                18676,
                18790
            ],
            [
                18790,
                18834
            ],
            [
                18834,
                18849
            ],
            [
                18849,
                18943
            ],
            [
                18943,
                18959
            ],
            [
                18959,
                19020
            ],
            [
                19020,
                19101
            ],
            [
                19101,
                19120
            ],
            [
                19120,
                19133
            ],
            [
                19133,
                19159
            ],
            [
                19159,
                19331
            ],
            [
                19331,
                19464
            ],
            [
                19464,
                19470
            ],
            [
                19470,
                19522
            ],
            [
                19522,
                19568
            ],
            [
                19568,
                19663
            ],
            [
                19663,
                19713
            ],
            [
                19713,
                20025
            ],
            [
                20025,
                20094
            ],
            [
                20094,
                20170
            ],
            [
                20170,
                20288
            ],
            [
                20288,
                20481
            ],
            [
                20481,
                20615
            ],
            [
                20615,
                20772
            ],
            [
                20772,
                20864
            ],
            [
                20864,
                21061
            ],
            [
                21061,
                21225
            ],
            [
                21225,
                21367
            ],
            [
                21367,
                21552
            ],
            [
                21552,
                21725
            ],
            [
                21725,
                21895
            ],
            [
                21895,
                22028
            ],
            [
                22028,
                22280
            ],
            [
                22280,
                22674
            ],
            [
                22674,
                22777
            ],
            [
                22777,
                22822
            ],
            [
                22822,
                22955
            ],
            [
                22955,
                23048
            ],
            [
                23048,
                23081
            ],
            [
                23081,
                23200
            ],
            [
                23200,
                23239
            ],
            [
                23239,
                23685
            ],
            [
                23685,
                23819
            ],
            [
                23819,
                24316
            ],
            [
                24316,
                24377
            ],
            [
                24377,
                24456
            ],
            [
                24456,
                24529
            ],
            [
                24529,
                24980
            ],
            [
                24980,
                25159
            ],
            [
                25159,
                25229
            ],
            [
                25229,
                25235
            ],
            [
                25235,
                25355
            ],
            [
                25355,
                25478
            ],
            [
                25478,
                25525
            ],
            [
                25525,
                25639
            ],
            [
                25639,
                25761
            ],
            [
                25761,
                25978
            ],
            [
                25978,
                26036
            ],
            [
                26036,
                26054
            ],
            [
                26054,
                26083
            ],
            [
                26083,
                26106
            ],
            [
                26106,
                26123
            ],
            [
                26123,
                26174
            ],
            [
                26174,
                26288
            ],
            [
                26288,
                26348
            ],
            [
                26348,
                26548
            ],
            [
                26548,
                26718
            ],
            [
                26718,
                26801
            ],
            [
                26801,
                26849
            ],
            [
                26849,
                26933
            ],
            [
                26933,
                27223
            ],
            [
                27223,
                27289
            ],
            [
                27289,
                27358
            ],
            [
                27358,
                27421
            ],
            [
                27421,
                27447
            ],
            [
                27447,
                27536
            ],
            [
                27536,
                27872
            ],
            [
                27872,
                28135
            ],
            [
                28135,
                28259
            ],
            [
                28259,
                28506
            ],
            [
                28506,
                28584
            ],
            [
                28584,
                28650
            ],
            [
                28650,
                28816
            ],
            [
                28816,
                28919
            ],
            [
                28919,
                29102
            ],
            [
                29102,
                29204
            ],
            [
                29204,
                29500
            ],
            [
                29500,
                29660
            ],
            [
                29660,
                29783
            ],
            [
                29783,
                29810
            ],
            [
                29810,
                29833
            ],
            [
                29833,
                29853
            ],
            [
                29853,
                29877
            ],
            [
                29877,
                29963
            ],
            [
                29963,
                30063
            ],
            [
                30063,
                30252
            ],
            [
                30252,
                30316
            ],
            [
                30316,
                30370
            ],
            [
                30370,
                30394
            ],
            [
                30394,
                30663
            ],
            [
                30663,
                30686
            ],
            [
                30686,
                30710
            ],
            [
                30710,
                30717
            ],
            [
                30717,
                30836
            ],
            [
                30836,
                30871
            ],
            [
                30871,
                31020
            ],
            [
                31020,
                31051
            ],
            [
                31051,
                31087
            ],
            [
                31087,
                31153
            ],
            [
                31153,
                31257
            ],
            [
                31257,
                31387
            ],
            [
                31387,
                31399
            ],
            [
                31399,
                31416
            ],
            [
                31416,
                31503
            ],
            [
                31503,
                31516
            ],
            [
                31516,
                31551
            ],
            [
                31551,
                31594
            ],
            [
                31594,
                31631
            ],
            [
                31631,
                31645
            ],
            [
                31645,
                31693
            ],
            [
                31693,
                31769
            ],
            [
                31769,
                31797
            ],
            [
                31797,
                31895
            ],
            [
                31895,
                31949
            ],
            [
                31949,
                31961
            ],
            [
                31961,
                31997
            ],
            [
                31997,
                32266
            ],
            [
                32266,
                32341
            ],
            [
                32341,
                32362
            ],
            [
                32362,
                32387
            ],
            [
                32387,
                32476
            ],
            [
                32476,
                32543
            ],
            [
                32543,
                32977
            ],
            [
                32977,
                33143
            ],
            [
                33143,
                33228
            ],
            [
                33228,
                33246
            ],
            [
                33246,
                33280
            ],
            [
                33280,
                33353
            ],
            [
                33353,
                33375
            ],
            [
                33375,
                33391
            ],
            [
                33391,
                33420
            ],
            [
                33420,
                33467
            ],
            [
                33467,
                33477
            ],
            [
                33477,
                33497
            ],
            [
                33497,
                33518
            ],
            [
                33518,
                33548
            ],
            [
                33548,
                33625
            ],
            [
                33625,
                33965
            ],
            [
                33965,
                34315
            ]
        ]
    },
    "abridged": {
        "text": "I thought much of my living mother who had told me to consider her dead. I could not venture to approach her or write to her, for my sense of her peril was only equalled by my fears of increasing it. Knowing that my mere existence was an unforeseen danger to her, I could not always conquer that terror of myself which had seized me when I first knew the secret. At no time did I dare to utter her name. I felt as if I did not even dare to hear it. If the conversation anywhere took that direction, I tried not to hear: I mentally counted, or went out of the room.\nOften I recalled the tones of my mother's voice, and wondered whether I should ever hear it again as I so longed to do. I passed and repassed the door of her house in town, loving it, but afraid to look at it; once I sat in the theatre when my mother was there and she saw me, when we were so wide asunder that any link between us seemed a dream. It is all, all over now.\nWhen we were settled at home again, Ada and I had many conversations with my guardian about Richard. My dear girl was deeply grieved that he should do their kind cousin so much wrong, but she was so faithful to Richard that she could not bear to blame him. My guardian was aware of it.\n\"Rick is mistaken, my dear,\" he would say to her. \"Well, well! We have all been mistaken over and over again. We must trust to you and time to set him right.\"\nWe knew afterwards what we suspected then, that he had often tried to open Richard's eyes. That he had written to him, gone to him, talked with him, tried every gentle and persuasive art his kindness could devise. Our poor Richard was deaf and blind to all. If he were wrong, he would make amends when the Chancery suit was over. Let him work the suit out. This was his unvarying reply. Jarndyce and Jarndyce had obtained possession of his whole nature.\nI mentioned to my guardian my doubts of Mr. Skimpole as a good adviser for Richard.\n\"Adviser!\" returned my guardian, laughing, \"My dear, who would ask advice from Skimpole?\"\n\"Encourager would perhaps have been a better word,\" said I.\n\"Encourager!\" returned my guardian. \"Such an unworldly, uncalculating, gossamer creature is a relief, an amusement to Richard. But as to advising or encouraging anybody, it is simply not to be thought of in such a child as Skimpole.\"\n\"Pray, cousin John,\" said Ada, \"what made him such a child?\"\n\"Why,\" he slowly replied, rubbing his head, \"he is all sentiment, and - susceptibility, and - imagination. And these qualities are not regulated in him, somehow. I suppose in his youth he was given too little training that would have balanced and adjusted them, and so he became what he is.\"\nAda, glancing at me, said she thought it was a pity he should be an expense to Richard.\n\"So it is,\" returned my guardian hurriedly. \"That must not be. I must prevent it. That will never do.\"\nAnd I said I thought it was to be regretted that he had ever introduced Richard to Mr. Vholes for a present of five pounds.\n\"Did he?\" said my guardian with a passing shade of vexation on his face. \"But there you have the man! He has no idea of the value of money. He told you himself, I'll be bound, my dear?\"\n\"Oh, yes!\" said I.\n\"Exactly!\" cried my guardian, quite triumphant. \"There you have the man! If he was conscious of any harm in it, he wouldn't tell it. He tells it as he does it, in mere simplicity. But you shall see him in his own home, and then you'll understand him better. We must pay a visit to Harold Skimpole and caution him on these points. Lord bless you, my dears, an infant, an infant!\"\nSo, soon afterwards, we went into London and presented ourselves at Mr. Skimpole's door.\nHe lived in a place called the Polygon, in Somers Town, where there were at that time a number of poor Spanish refugees walking about in cloaks, smoking little cigars. Whether he was a better tenant than one might have supposed, in consequence of his friend Somebody always paying his rent, I don't know; but he had occupied the same house some years. It was in a dilapidated state. Two or three of the area railings were gone, the knocker was loose, the bell-handle had been pulled off, and dirty footprints on the steps were the only signs of its being inhabited.\nA slatternly girl who seemed to be bursting out at the rips in her gown like an over-ripe berry answered our knock by opening the door a very little way. As she knew Mr. Jarndyce (indeed Ada and I both thought that she evidently associated him with the receipt of her wages), she immediately relented and allowed us to pass in.\nWe went upstairs to the first floor, still seeing no other furniture than the dirty footprints. Mr. Jarndyce entered a room, and we followed. It was dingy and not at all clean, but furnished with an odd kind of shabby luxury, with a large footstool, a sofa, and plenty of cushions, an easy-chair, a piano, books, drawing materials, music, newspapers, and a few sketches. A broken pane of glass in one of the dirty windows was papered over, but there was a little plate of hothouse nectarines on the table, and another of grapes, and another of sponge-cakes, and there was a bottle of light wine.\nMr. Skimpole himself reclined upon the sofa in a dressing-gown, drinking coffee from an old china cup - it was then about mid-day - and looking at a collection of wallflowers in the balcony. He rose and received us in his usual airy manner.\n\"Here I am, you see!\" he said when we were seated, not without some difficulty, most of the chairs being broken. \"Here I am! This is my frugal breakfast. Some men want legs of beef and mutton for breakfast; I don't. Give me my peach, my cup of coffee, and my claret; I am content.\"\n\"This is our friend's sanctum, his studio,\" said my guardian to us.\n\"Yes,\" said Mr. Skimpole, turning his bright face about, \"this is the bird's cage. This is where the bird lives and sings. They pluck his feathers now and then and clip his wings, but he sings, he sings!\"\nHe handed us the grapes, repeating in his radiant way, \"He sings!\"\n\"These are very fine,\" said my guardian. \"A present?\"\n\"No,\" he answered. \"Some amiable gardener sells them. His man wanted to know, when he brought them last evening, whether he should wait for the money. 'Really, my friend,' I said, 'I think not - if your time is of any value to you.' I suppose it was, for he went away.\"\nMy guardian looked at us with a smile, as though he asked us, \"Is it possible to be worldly with this baby?\"\n\"This is a day,\" said Mr. Skimpole, gaily taking a little claret, \"that will ever be remembered here. We shall call it Saint Clare and Saint Summerson day. You must see my daughters. I have a blue-eyed daughter who is my Beauty daughter, I have a Sentiment daughter, and I have a Comedy daughter. You must see them all. They'll be enchanted.\"\nHe was going to summon them when my guardian asked him to pause a moment, as he wished to say a word to him first.\n\"My dear Jarndyce,\" he cheerfully replied, going back to his sofa, \"as many moments as you please. Time is no object here.\"\n\"Now, Harold,\" my guardian began, \"the word I have to say relates to Rick.\"\n\"The dearest friend I have!\" returned Mr. Skimpole cordially. \"I suppose he ought not to be my dearest friend, as he is not on terms with you. But I can't help it; he is full of youthful poetry, and I love him.\"\nThe engaging frankness with which he declared this captivated my guardian, if not, for the moment, Ada too.\n\"You are welcome to love him as much as you like,\" returned Mr. Jarndyce, \"but we must save his pocket, Harold.\"\n\"Oh!\" said Mr. Skimpole. \"His pocket? Now you are coming to what I don't understand.\" Dipping one of the cakes in his claret, he shook his head and smiled at us as if predicting that he never could be made to understand.\n\"If you go with him here or there,\" said my guardian plainly, \"you must not let him pay for you both.\"\n\"My dear Jarndyce,\" returned Mr. Skimpole genially, \"what am I to do? If he takes me anywhere, I must go. And how can I pay? I never have any money. If I had any money, I don't know anything about it. Suppose the man says to me seven and sixpence? I know nothing about seven and sixpence. I don't understand it.\"\n\"Well,\" said my guardian, by no means displeased with this artless reply, \"if you do any journeying with Rick, you must borrow the money from me (without telling him), and leave the calculation to him.\"\n\"My dear Jarndyce,\" returned Mr. Skimpole, \"I will do anything to give you pleasure, but upon my word, I thought Mr. Carstone was immensely rich. I thought he had only to sign a bond, or a draft, or a cheque, or something, to bring down a shower of money.\"\n\"Indeed it is not so, sir,\" said Ada. \"He is poor.\"\n\"No, really?\" returned Mr. Skimpole with his bright smile. \"You surprise me.\"\n\"And not being the richer for trusting in a rotten reed,\" said my guardian, laying his hand emphatically on the sleeve of Mr. Skimpole's dressing-gown, \"be very careful not to encourage him in that reliance, Harold.\"\n\"My dear good friend,\" returned Mr. Skimpole, \"how can I do that? It's business, and I don't know business. It is he who encourages me. He emerges from great feats of business, and calls upon me to admire them. I do admire them. But I know nothing about them, and I tell him so.\"\nThe helpless light-hearted candour with which he said this seemed to prove my guardian's case. When he was present, it seemed unlikely that he could design, conceal, or influence anything; and yet when he was not present, the more likely it seemed, and the less agreeable it was to think of his having anything to do with anyone for whom I cared.\nMr. Skimpole then left the room with a radiant face to fetch his daughters (his sons had run away at various times). He came back bringing with him three young ladies and Mrs. Skimpole, who had once been a beauty but was now a delicate invalid suffering under a complication of disorders.\n\"This,\" said Mr. Skimpole, \"is my Beauty daughter, Arethusa - plays and sings odds and ends like her father. This is my Sentiment daughter, Laura - plays a little but don't sing. This is my Comedy daughter, Kitty - sings a little but don't play. We all draw a little and compose a little, and none of us have any idea of time or money.\"\nMrs. Skimpole sighed, I thought, as if she would have been glad to strike out this item in the family attainments.\n\"In this family,\" said Mr. Skimpole, \"we are all children, and I am the youngest.\"\nThe daughters, who appeared to be very fond of him, were amused by this droll fact, particularly the Comedy daughter.\n\"My dears, it is true,\" said Mr. Skimpole, \"is it not? Now, here is Miss Summerson with a knowledge of details perfectly surprising. It will sound very strange to Miss Summerson, I dare say, that we know nothing about chops in this house. But we don't, not the least. We can't cook anything whatever. A needle and thread we don't know how to use. We admire the people who possess the practical wisdom we want, but we don't quarrel with them. Then why should they quarrel with us? Live and let live, we say to them. Live upon your practical wisdom, and let us live upon you!\"\nHe laughed, but as usual seemed quite candid and really to mean what he said.\n\"We have sympathy, my roses,\" said Mr. Skimpole, \"sympathy for everything. Have we not?\"\n\"Oh, yes, papa!\" cried the three daughters.\n\"We are capable of looking on and of being interested,\" said Mr. Skimpole, \"in this hurly-burly of life, and we do look on, and we are interested. What more can we do? Here is my Beauty daughter, married these three years. Now I dare say her marrying another child, and having two more, was all wrong in point of economy, but it was very agreeable. Her young husband and their young fledglings have their nest upstairs.\"\nShe looked very young indeed to be the mother of two children, and I could not help pitying both her and them. It was evident that the three daughters had grown up with just as little haphazard instruction as qualified them to be their father's playthings.\nAda and I conversed with these young ladies and found them wonderfully like their father. In the meanwhile Mr. Jarndyce (who had been rubbing his head to a great extent, and hinted at a change in the wind) talked with Mrs. Skimpole in a corner, where we could not help hearing the chink of money. Mr. Skimpole had volunteered to go home with us and had withdrawn to dress himself for the purpose.\n\"My roses,\" he said when he came back, \"take care of mama. She is poorly today. By going home with Mr. Jarndyce for a day or two, I shall hear the larks sing and preserve my amiability. It has been tried, you know, and would be tried again if I remained at home.\"\n\"That bad man!\" said the Comedy daughter.\n\"At the very time when he knew papa was lying ill by his wallflowers,\" Laura complained.\n\"And when the smell of hay was in the air!\" said Arethusa.\n\"It showed a want of poetry in the man,\" Mr. Skimpole assented, with perfect good humour. \"My daughters have taken great offence,\" he explained to us, \"at an honest man-\"\n\"Not honest, papa!\" they protested.\n\"At a rough kind of fellow,\" said Mr. Skimpole, \"who is a baker in this neighbourhood and from whom we borrowed a couple of arm-chairs. We wanted a couple of arm-chairs, and we hadn't got them, and therefore of course we looked for a man who had got them, to lend them. Well! This morose person lent them, and we wore them out. When they were worn out, he wanted them back. He had them back, and he objected to their being worn. I reasoned with him, and pointed out his mistake. I said, 'Don't you know that these arm-chairs were borrowed to be sat upon?' He was unreasonable and used intemperate language. I patiently appealed to him. I said, 'My good man, we are all children of one great mother, Nature. I entreat you, by our brotherhood, not to stand before me in the absurd figure of an angry baker!' But he did,\" said Mr. Skimpole in playful astonishment. \"And therefore I am very glad to get out of his way and to go home with my friend Jarndyce.\"\nIt seemed to escape his consideration that Mrs. Skimpole and the daughters remained behind to encounter the baker, but this was so old a story to all of them that it had become a matter of course. He took leave of his family with an airy tenderness and rode away with us.\nI could have no anticipation that something very startling and memorable was to happen before this day was out. Our guest was in such spirits on the way home that I could do nothing but wonder at him; and Ada yielded to the same fascination. In no way wearied by the journey, Mr. Skimpole was in the drawing-room before any of us; and I heard him at the piano while I was looking after my housekeeping, singing refrains of barcaroles and drinking songs.\nWe were all assembled shortly before dinner, and he was still at the piano idly picking out little strains of music, when a calling-card was brought in and my guardian read aloud in a surprised voice, \"Sir Leicester Dedlock!\"\nThe visitor was in the room before I had the power to stir. I had not even the presence of mind, in my giddiness, to retire to the window with Ada, or to know where the window was. I heard my name and found that my guardian was presenting me before I could move.\n\"Pray be seated, Sir Leicester.\"\n\"Mr. Jarndyce,\" said Sir Leicester as he bowed and seated himself, \"I do myself the honour of calling here-\"\n\"You do me the honour, Sir Leicester.\"\n\"Thank you - of calling here on my way from Lincolnshire to express my regret that any cause of complaint I may have against a gentleman who has been your host, should have prevented you, and the ladies under your charge, from visiting my house, Chesney Wold.\"\n\"You are exceedingly obliging, Sir Leicester, and on behalf of those ladies, I thank you.\"\n\"It is possible, Mr. Jarndyce, that the gentleman to whom I have referred may have led you to believe that you would not have been received at my house with courtesy. I beg to observe, sir, that the fact is the reverse. It has given me pain, Mr. Jarndyce, to learn from the housekeeper at Chesney Wold that a gentleman who was with you, and who would appear to possess a cultivated taste for the fine arts, was likewise deterred from examining the family pictures with that leisure which he might have desired to bestow upon them.\" Here he produced a card and read, with much gravity, through his eye-glass, \"Mr. Herald - Harold - Skumpling - I beg your pardon - Skimpole.\"\n\"This is Mr. Harold Skimpole,\" said my guardian, surprised.\n\"Oh!\" exclaimed Sir Leicester. \"I am happy to meet Mr. Skimpole. I hope, sir, that when you again find yourself in my part of the county, you will be under no similar sense of restraint.\"\n\"You are very obliging, Sir Leicester. I shall certainly give myself the pleasure of another visit to your beautiful house. The owners of such places as Chesney Wold,\" said Mr. Skimpole with his usual easy air, \"are public benefactors. They are good enough to maintain a number of delightful objects for the admiration and pleasure of us poor men; and not to reap all the pleasure that they yield is to be ungrateful to our benefactors.\"\nSir Leicester seemed to approve of this sentiment highly. \"An artist, sir?\"\n\"No,\" returned Mr. Skimpole. \"A perfectly idle man. A mere amateur.\"\nSir Leicester seemed to approve of this even more. He hoped he might have the good fortune to be at Chesney Wold when Mr. Skimpole next came into Lincolnshire. Mr. Skimpole professed himself much honoured.\n\"Mr. Skimpole mentioned to the housekeeper,\" pursued Sir Leicester, \"that he had been staying with Mr. Jarndyce.\"\n\"That is, when I walked through the house the other day, on the occasion of my going down to visit you,\" Mr. Skimpole airily explained to us.\n\"Hence I became aware of the circumstance. That this should have happened to Mr. Jarndyce, a gentleman with some distant connexion to Lady Dedlock, and for whom she entertains a high respect, does, I assure you, give me pain.\"\n\"Pray say no more about it, Sir Leicester,\" returned my guardian.\nI had not once looked up. It surprises me to find that I can recall the conversation, for my mind was so confused and the gentleman's presence so distressing that I thought I understood nothing through the rushing in my head and the beating of my heart.\n\"I mentioned the subject to Lady Dedlock,\" said Sir Leicester, rising, \"and she informed me that she had had the pleasure of exchanging a few words with Mr. Jarndyce and his wards on an accidental meeting. Permit me, Mr. Jarndyce, to repeat to yourself, and to these ladies, the assurance I have already given Mr. Skimpole.\"\nSir Leicester Dedlock took his leave with great ceremony. I got to my own room with all possible speed and remained there until I had recovered my self-command. I was thankful to find when I went downstairs that they only rallied me for having been shy before the great Lincolnshire baronet.\nBut I had made up my mind that I must tell my guardian what I knew. The possibility of my being brought into contact with my mother, of my being taken to her house, was so painful that I felt I could no longer guide myself without his assistance.\nWhen we had retired for the night, and Ada and I had had our usual talk, I went and sought my guardian among his books. I knew he always read at that hour, and as I drew near I saw the light shining out into the passage from his reading-lamp.\n\"May I come in, guardian?\"\n\"Surely, little woman. What's the matter?\"\n\"Nothing is the matter. I thought I would like to take this quiet time of saying a word to you about myself.\"\nHe shut his book, and turned his kind attentive face towards me. I could not help observing that it wore that curious expression I had seen in it once before - on that night when he had said that he was in no trouble which I could readily understand.\n\"What concerns you, my dear Esther,\" said he, \"concerns us all. You cannot be more ready to speak than I am to hear.\"\n\"I know that, guardian. But I have such need of your advice and support tonight - ever since the visitor was here today.\"\n\"Sir Leicester Dedlock?\"\n\"Yes.\"\nHe sat looking at me with an air of the profoundest astonishment. \"Why, Esther,\" said he, breaking into a smile, \"our visitor and you are the two last persons on earth I should have thought of connecting together!\"\n\"Oh, yes, guardian. And I too, but a little while ago.\"\nThe smile passed from his face, and he became grave. He crossed to the door to see that it was shut and resumed his seat before me.\n\"Guardian,\" said I, \"do you remember, when we were overtaken by the thunder-storm, Lady Dedlock's speaking to you of her sister?\"\n\"Of course.\"\n\"And reminding you that she and her sister had gone their different ways?\"\n\"Yes.\"\n\"Why did they separate, guardian?\"\nHis face altered as he looked at me. \"My child, what questions are these! I never knew. No one but themselves ever did know, I believe. Who could tell what the secrets of those two handsome and proud women were! You have seen Lady Dedlock. If you had ever seen her sister, you would know her to have been as resolute and haughty as she.\"\n\"Oh, guardian, I have seen her many a time!\"\n\"Seen her?\" He paused a little, biting his lip. \"Then, Esther, when you spoke to me long ago of Boythorn, and when I told you that he was all but married once - did you know it all, and know who the lady was?\"\n\"No, guardian,\" I returned.\n\"It was Lady Dedlock's sister.\"\n\"Guardian, pray tell me, why were they parted?\"\n\"It was her act, and she kept its motives secret. He afterwards did wonder if some quarrel with her sister had wounded her haughty spirit beyond all reason, but she wrote to tell him that from that date she died to him, and that she resolved on this through her knowledge of his proud temper and his sense of honour. In consideration for those points in him, and also in herself, she made the sacrifice, she said. He never heard of her from that hour. Nor did anyone.\"\n\"Oh, guardian, what have I done!\" I cried, giving way to my grief; \"what sorrow have I innocently caused! Innocently, but most surely. That secluded sister is my first remembrance.\"\n\"No!\" he cried, starting.\n\"Yes, guardian, yes! And her sister is my mother!\"\nI would have told him all my mother's letter, but he would not hear it then. He spoke so tenderly and wisely to me, that, full as I had been with fervent gratitude towards him through so many years, I believed I had never loved him so dearly, never thanked him in my heart so fully, as I did that night.\nAnd when he had taken me to my room and kissed me at the door, and when at last I lay down to sleep, my thought was how could I ever be busy enough, good enough, forgetful enough of myself, devoted enough to him, and useful enough to others, to show him how I blessed and honoured him.",
        "paragraph_chars": [
            [
                0,
                565
            ],
            [
                565,
                937
            ],
            [
                937,
                1223
            ],
            [
                1223,
                1382
            ],
            [
                1382,
                1836
            ],
            [
                1836,
                1920
            ],
            [
                1920,
                2010
            ],
            [
                2010,
                2070
            ],
            [
                2070,
                2304
            ],
            [
                2304,
                2365
            ],
            [
                2365,
                2657
            ],
            [
                2657,
                2745
            ],
            [
                2745,
                2848
            ],
            [
                2848,
                2972
            ],
            [
                2972,
                3158
            ],
            [
                3158,
                3177
            ],
            [
                3177,
                3556
            ],
            [
                3556,
                3645
            ],
            [
                3645,
                4211
            ],
            [
                4211,
                4539
            ],
            [
                4539,
                5135
            ],
            [
                5135,
                5376
            ],
            [
                5376,
                5658
            ],
            [
                5658,
                5726
            ],
            [
                5726,
                5931
            ],
            [
                5931,
                5998
            ],
            [
                5998,
                6052
            ],
            [
                6052,
                6322
            ],
            [
                6322,
                6431
            ],
            [
                6431,
                6774
            ],
            [
                6774,
                6889
            ],
            [
                6889,
                7013
            ],
            [
                7013,
                7089
            ],
            [
                7089,
                7301
            ],
            [
                7301,
                7409
            ],
            [
                7409,
                7522
            ],
            [
                7522,
                7743
            ],
            [
                7743,
                7846
            ],
            [
                7846,
                8159
            ],
            [
                8159,
                8362
            ],
            [
                8362,
                8619
            ],
            [
                8619,
                8671
            ],
            [
                8671,
                8749
            ],
            [
                8749,
                8966
            ],
            [
                8966,
                9246
            ],
            [
                9246,
                9593
            ],
            [
                9593,
                9882
            ],
            [
                9882,
                10219
            ],
            [
                10219,
                10334
            ],
            [
                10334,
                10417
            ],
            [
                10417,
                10535
            ],
            [
                10535,
                11110
            ],
            [
                11110,
                11188
            ],
            [
                11188,
                11277
            ],
            [
                11277,
                11321
            ],
            [
                11321,
                11742
            ],
            [
                11742,
                11999
            ],
            [
                11999,
                12396
            ],
            [
                12396,
                12660
            ],
            [
                12660,
                12702
            ],
            [
                12702,
                12791
            ],
            [
                12791,
                12850
            ],
            [
                12850,
                13021
            ],
            [
                13021,
                13057
            ],
            [
                13057,
                14012
            ],
            [
                14012,
                14284
            ],
            [
                14284,
                14738
            ],
            [
                14738,
                14964
            ],
            [
                14964,
                15227
            ],
            [
                15227,
                15260
            ],
            [
                15260,
                15369
            ],
            [
                15369,
                15408
            ],
            [
                15408,
                15669
            ],
            [
                15669,
                15760
            ],
            [
                15760,
                16434
            ],
            [
                16434,
                16494
            ],
            [
                16494,
                16682
            ],
            [
                16682,
                17120
            ],
            [
                17120,
                17196
            ],
            [
                17196,
                17265
            ],
            [
                17265,
                17471
            ],
            [
                17471,
                17585
            ],
            [
                17585,
                17727
            ],
            [
                17727,
                17954
            ],
            [
                17954,
                18020
            ],
            [
                18020,
                18274
            ],
            [
                18274,
                18599
            ],
            [
                18599,
                18891
            ],
            [
                18891,
                19138
            ],
            [
                19138,
                19381
            ],
            [
                19381,
                19408
            ],
            [
                19408,
                19451
            ],
            [
                19451,
                19561
            ],
            [
                19561,
                19812
            ],
            [
                19812,
                19930
            ],
            [
                19930,
                20052
            ],
            [
                20052,
                20077
            ],
            [
                20077,
                20084
            ],
            [
                20084,
                20299
            ],
            [
                20299,
                20355
            ],
            [
                20355,
                20487
            ],
            [
                20487,
                20617
            ],
            [
                20617,
                20630
            ],
            [
                20630,
                20705
            ],
            [
                20705,
                20712
            ],
            [
                20712,
                20747
            ],
            [
                20747,
                21085
            ],
            [
                21085,
                21130
            ],
            [
                21130,
                21340
            ],
            [
                21340,
                21368
            ],
            [
                21368,
                21400
            ],
            [
                21400,
                21448
            ],
            [
                21448,
                21917
            ],
            [
                21917,
                22099
            ],
            [
                22099,
                22125
            ],
            [
                22125,
                22176
            ],
            [
                22176,
                22480
            ],
            [
                22480,
                22765
            ]
        ],
        "segment_chars": [
            [
                0,
                73
            ],
            [
                73,
                200
            ],
            [
                200,
                363
            ],
            [
                363,
                404
            ],
            [
                404,
                449
            ],
            [
                449,
                565
            ],
            [
                565,
                685
            ],
            [
                685,
                912
            ],
            [
                912,
                937
            ],
            [
                937,
                1038
            ],
            [
                1038,
                1194
            ],
            [
                1194,
                1223
            ],
            [
                1223,
                1273
            ],
            [
                1273,
                1286
            ],
            [
                1286,
                1333
            ],
            [
                1333,
                1382
            ],
            [
                1382,
                1473
            ],
            [
                1473,
                1596
            ],
            [
                1596,
                1640
            ],
            [
                1640,
                1712
            ],
            [
                1712,
                1739
            ],
            [
                1739,
                1769
            ],
            [
                1769,
                1836
            ],
            [
                1836,
                1920
            ],
            [
                1920,
                1931
            ],
            [
                1931,
                2010
            ],
            [
                2010,
                2070
            ],
            [
                2070,
                2084
            ],
            [
                2084,
                2106
            ],
            [
                2106,
                2197
            ],
            [
                2197,
                2304
            ],
            [
                2304,
                2365
            ],
            [
                2365,
                2472
            ],
            [
                2472,
                2527
            ],
            [
                2527,
                2657
            ],
            [
                2657,
                2745
            ],
            [
                2745,
                2789
            ],
            [
                2789,
                2808
            ],
            [
                2808,
                2827
            ],
            [
                2827,
                2848
            ],
            [
                2848,
                2972
            ],
            [
                2972,
                2982
            ],
            [
                2982,
                3045
            ],
            [
                3045,
                3074
            ],
            [
                3074,
                3112
            ],
            [
                3112,
                3158
            ],
            [
                3158,
                3169
            ],
            [
                3169,
                3177
            ],
            [
                3177,
                3188
            ],
            [
                3188,
                3225
            ],
            [
                3225,
                3250
            ],
            [
                3250,
                3310
            ],
            [
                3310,
                3357
            ],
            [
                3357,
                3435
            ],
            [
                3435,
                3507
            ],
            [
                3507,
                3556
            ],
            [
                3556,
                3645
            ],
            [
                3645,
                3813
            ],
            [
                3813,
                3997
            ],
            [
                3997,
                4028
            ],
            [
                4028,
                4211
            ],
            [
                4211,
                4365
            ],
            [
                4365,
                4539
            ],
            [
                4539,
                4635
            ],
            [
                4635,
                4681
            ],
            [
                4681,
                4910
            ],
            [
                4910,
                5135
            ],
            [
                5135,
                5326
            ],
            [
                5326,
                5376
            ],
            [
                5376,
                5398
            ],
            [
                5398,
                5489
            ],
            [
                5489,
                5501
            ],
            [
                5501,
                5530
            ],
            [
                5530,
                5592
            ],
            [
                5592,
                5658
            ],
            [
                5658,
                5726
            ],
            [
                5726,
                5809
            ],
            [
                5809,
                5849
            ],
            [
                5849,
                5931
            ],
            [
                5931,
                5998
            ],
            [
                5998,
                6039
            ],
            [
                6039,
                6052
            ],
            [
                6052,
                6071
            ],
            [
                6071,
                6106
            ],
            [
                6106,
                6203
            ],
            [
                6203,
                6285
            ],
            [
                6285,
                6322
            ],
            [
                6322,
                6431
            ],
            [
                6431,
                6533
            ],
            [
                6533,
                6587
            ],
            [
                6587,
                6614
            ],
            [
                6614,
                6728
            ],
            [
                6728,
                6751
            ],
            [
                6751,
                6774
            ],
            [
                6774,
                6889
            ],
            [
                6889,
                6988
            ],
            [
                6988,
                7013
            ],
            [
                7013,
                7089
            ],
            [
                7089,
                7118
            ],
            [
                7118,
                7151
            ],
            [
                7151,
                7232
            ],
            [
                7232,
                7301
            ],
            [
                7301,
                7409
            ],
            [
                7409,
                7522
            ],
            [
                7522,
                7528
            ],
            [
                7528,
                7547
            ],
            [
                7547,
                7560
            ],
            [
                7560,
                7608
            ],
            [
                7608,
                7743
            ],
            [
                7743,
                7846
            ],
            [
                7846,
                7916
            ],
            [
                7916,
                7952
            ],
            [
                7952,
                7971
            ],
            [
                7971,
                7995
            ],
            [
                7995,
                8047
            ],
            [
                8047,
                8094
            ],
            [
                8094,
                8135
            ],
            [
                8135,
                8159
            ],
            [
                8159,
                8362
            ],
            [
                8362,
                8508
            ],
            [
                8508,
                8619
            ],
            [
                8619,
                8657
            ],
            [
                8657,
                8671
            ],
            [
                8671,
                8685
            ],
            [
                8685,
                8730
            ],
            [
                8730,
                8749
            ],
            [
                8749,
                8966
            ],
            [
                8966,
                9032
            ],
            [
                9032,
                9074
            ],
            [
                9074,
                9102
            ],
            [
                9102,
                9177
            ],
            [
                9177,
                9195
            ],
            [
                9195,
                9246
            ],
            [
                9246,
                9341
            ],
            [
                9341,
                9593
            ],
            [
                9593,
                9710
            ],
            [
                9710,
                9882
            ],
            [
                9882,
                9991
            ],
            [
                9991,
                10061
            ],
            [
                10061,
                10128
            ],
            [
                10128,
                10219
            ],
            [
                10219,
                10334
            ],
            [
                10334,
                10417
            ],
            [
                10417,
                10535
            ],
            [
                10535,
                10590
            ],
            [
                10590,
                10668
            ],
            [
                10668,
                10774
            ],
            [
                10774,
                10803
            ],
            [
                10803,
                10836
            ],
            [
                10836,
                10882
            ],
            [
                10882,
                10977
            ],
            [
                10977,
                11015
            ],
            [
                11015,
                11050
            ],
            [
                11050,
                11110
            ],
            [
                11110,
                11188
            ],
            [
                11188,
                11263
            ],
            [
                11263,
                11277
            ],
            [
                11277,
                11294
            ],
            [
                11294,
                11321
            ],
            [
                11321,
                11468
            ],
            [
                11468,
                11489
            ],
            [
                11489,
                11544
            ],
            [
                11544,
                11670
            ],
            [
                11670,
                11742
            ],
            [
                11742,
                11853
            ],
            [
                11853,
                11999
            ],
            [
                11999,
                12089
            ],
            [
                12089,
                12296
            ],
            [
                12296,
                12396
            ],
            [
                12396,
                12455
            ],
            [
                12455,
                12476
            ],
            [
                12476,
                12582
            ],
            [
                12582,
                12660
            ],
            [
                12660,
                12676
            ],
            [
                12676,
                12702
            ],
            [
                12702,
                12791
            ],
            [
                12791,
                12835
            ],
            [
                12835,
                12850
            ],
            [
                12850,
                12940
            ],
            [
                12940,
                13021
            ],
            [
                13021,
                13041
            ],
            [
                13041,
                13057
            ],
            [
                13057,
                13193
            ],
            [
                13193,
                13327
            ],
            [
                13327,
                13333
            ],
            [
                13333,
                13385
            ],
            [
                13385,
                13431
            ],
            [
                13431,
                13486
            ],
            [
                13486,
                13536
            ],
            [
                13536,
                13613
            ],
            [
                13613,
                13664
            ],
            [
                13664,
                13693
            ],
            [
                13693,
                13764
            ],
            [
                13764,
                13863
            ],
            [
                13863,
                13919
            ],
            [
                13919,
                14012
            ],
            [
                14012,
                14209
            ],
            [
                14209,
                14284
            ],
            [
                14284,
                14396
            ],
            [
                14396,
                14526
            ],
            [
                14526,
                14738
            ],
            [
                14738,
                14964
            ],
            [
                14964,
                15024
            ],
            [
                15024,
                15145
            ],
            [
                15145,
                15227
            ],
            [
                15227,
                15260
            ],
            [
                15260,
                15369
            ],
            [
                15369,
                15408
            ],
            [
                15408,
                15669
            ],
            [
                15669,
                15760
            ],
            [
                15760,
                15927
            ],
            [
                15927,
                15980
            ],
            [
                15980,
                16292
            ],
            [
                16292,
                16434
            ],
            [
                16434,
                16494
            ],
            [
                16494,
                16500
            ],
            [
                16500,
                16525
            ],
            [
                16525,
                16559
            ],
            [
                16559,
                16682
            ],
            [
                16682,
                16721
            ],
            [
                16721,
                16806
            ],
            [
                16806,
                16918
            ],
            [
                16918,
                17120
            ],
            [
                17120,
                17178
            ],
            [
                17178,
                17196
            ],
            [
                17196,
                17225
            ],
            [
                17225,
                17248
            ],
            [
                17248,
                17265
            ],
            [
                17265,
                17316
            ],
            [
                17316,
                17425
            ],
            [
                17425,
                17471
            ],
            [
                17471,
                17585
            ],
            [
                17585,
                17727
            ],
            [
                17727,
                17770
            ],
            [
                17770,
                17954
            ],
            [
                17954,
                18020
            ],
            [
                18020,
                18046
            ],
            [
                18046,
                18274
            ],
            [
                18274,
                18480
            ],
            [
                18480,
                18599
            ],
            [
                18599,
                18657
            ],
            [
                18657,
                18760
            ],
            [
                18760,
                18891
            ],
            [
                18891,
                18959
            ],
            [
                18959,
                19138
            ],
            [
                19138,
                19258
            ],
            [
                19258,
                19381
            ],
            [
                19381,
                19408
            ],
            [
                19408,
                19431
            ],
            [
                19431,
                19451
            ],
            [
                19451,
                19475
            ],
            [
                19475,
                19561
            ],
            [
                19561,
                19626
            ],
            [
                19626,
                19812
            ],
            [
                19812,
                19876
            ],
            [
                19876,
                19930
            ],
            [
                19930,
                19954
            ],
            [
                19954,
                20052
            ],
            [
                20052,
                20077
            ],
            [
                20077,
                20084
            ],
            [
                20084,
                20150
            ],
            [
                20150,
                20299
            ],
            [
                20299,
                20319
            ],
            [
                20319,
                20355
            ],
            [
                20355,
                20408
            ],
            [
                20408,
                20487
            ],
            [
                20487,
                20617
            ],
            [
                20617,
                20630
            ],
            [
                20630,
                20705
            ],
            [
                20705,
                20712
            ],
            [
                20712,
                20747
            ],
            [
                20747,
                20784
            ],
            [
                20784,
                20821
            ],
            [
                20821,
                20835
            ],
            [
                20835,
                20883
            ],
            [
                20883,
                20959
            ],
            [
                20959,
                20987
            ],
            [
                20987,
                21085
            ],
            [
                21085,
                21130
            ],
            [
                21130,
                21142
            ],
            [
                21142,
                21178
            ],
            [
                21178,
                21340
            ],
            [
                21340,
                21368
            ],
            [
                21368,
                21400
            ],
            [
                21400,
                21448
            ],
            [
                21448,
                21498
            ],
            [
                21498,
                21765
            ],
            [
                21765,
                21862
            ],
            [
                21862,
                21900
            ],
            [
                21900,
                21917
            ],
            [
                21917,
                21951
            ],
            [
                21951,
                22023
            ],
            [
                22023,
                22052
            ],
            [
                22052,
                22099
            ],
            [
                22099,
                22105
            ],
            [
                22105,
                22125
            ],
            [
                22125,
                22146
            ],
            [
                22146,
                22176
            ],
            [
                22176,
                22253
            ],
            [
                22253,
                22480
            ],
            [
                22480,
                22765
            ]
        ],
        "overlap_chars": [
            [
                0,
                9
            ],
            [
                10,
                14
            ],
            [
                15,
                50
            ],
            [
                51,
                73
            ],
            [
                73,
                111
            ],
            [
                118,
                120
            ],
            [
                121,
                124
            ],
            [
                124,
                141
            ],
            [
                142,
                145
            ],
            [
                146,
                151
            ],
            [
                152,
                160
            ],
            [
                161,
                200
            ],
            [
                200,
                230
            ],
            [
                231,
                255
            ],
            [
                259,
                262
            ],
            [
                262,
                363
            ],
            [
                363,
                404
            ],
            [
                404,
                449
            ],
            [
                449,
                477
            ],
            [
                478,
                497
            ],
            [
                497,
                539
            ],
            [
                540,
                564
            ],
            [
                565,
                613
            ],
            [
                614,
                617
            ],
            [
                618,
                683
            ],
            [
                683,
                685
            ],
            [
                685,
                774
            ],
            [
                775,
                779
            ],
            [
                780,
                781
            ],
            [
                782,
                829
            ],
            [
                834,
                841
            ],
            [
                842,
                870
            ],
            [
                871,
                884
            ],
            [
                885,
                912
            ],
            [
                912,
                931
            ],
            [
                935,
                936
            ],
            [
                937,
                1022
            ],
            [
                1029,
                1036
            ],
            [
                1036,
                1038
            ],
            [
                1038,
                1192
            ],
            [
                1192,
                1194
            ],
            [
                1194,
                1209
            ],
            [
                1216,
                1221
            ],
            [
                1221,
                1222
            ],
            [
                1223,
                1273
            ],
            [
                1273,
                1286
            ],
            [
                1286,
                1333
            ],
            [
                1333,
                1382
            ],
            [
                1382,
                1429
            ],
            [
                1430,
                1473
            ],
            [
                1473,
                1596
            ],
            [
                1596,
                1604
            ],
            [
                1605,
                1640
            ],
            [
                1640,
                1712
            ],
            [
                1712,
                1737
            ],
            [
                1737,
                1739
            ],
            [
                1739,
                1769
            ],
            [
                1769,
                1803
            ],
            [
                1804,
                1834
            ],
            [
                1834,
                1835
            ],
            [
                1836,
                1837
            ],
            [
                1863,
                1920
            ],
            [
                1920,
                1931
            ],
            [
                1931,
                1982
            ],
            [
                1999,
                2010
            ],
            [
                2010,
                2070
            ],
            [
                2070,
                2084
            ],
            [
                2084,
                2104
            ],
            [
                2104,
                2106
            ],
            [
                2106,
                2170
            ],
            [
                2172,
                2184
            ],
            [
                2185,
                2187
            ],
            [
                2195,
                2197
            ],
            [
                2197,
                2230
            ],
            [
                2231,
                2238
            ],
            [
                2238,
                2304
            ],
            [
                2304,
                2334
            ],
            [
                2335,
                2365
            ],
            [
                2365,
                2390
            ],
            [
                2399,
                2407
            ],
            [
                2407,
                2434
            ],
            [
                2437,
                2456
            ],
            [
                2459,
                2472
            ],
            [
                2472,
                2527
            ],
            [
                2527,
                2536
            ],
            [
                2537,
                2549
            ],
            [
                2563,
                2573
            ],
            [
                2574,
                2654
            ],
            [
                2657,
                2745
            ],
            [
                2745,
                2746
            ],
            [
                2746,
                2789
            ],
            [
                2789,
                2808
            ],
            [
                2808,
                2827
            ],
            [
                2827,
                2848
            ],
            [
                2848,
                2972
            ],
            [
                2972,
                2982
            ],
            [
                2982,
                3045
            ],
            [
                3045,
                3072
            ],
            [
                3074,
                3112
            ],
            [
                3112,
                3158
            ],
            [
                3158,
                3169
            ],
            [
                3169,
                3177
            ],
            [
                3177,
                3188
            ],
            [
                3188,
                3225
            ],
            [
                3225,
                3250
            ],
            [
                3250,
                3255
            ],
            [
                3256,
                3310
            ],
            [
                3310,
                3335
            ],
            [
                3337,
                3357
            ],
            [
                3357,
                3435
            ],
            [
                3435,
                3507
            ],
            [
                3507,
                3556
            ],
            [
                3575,
                3596
            ],
            [
                3597,
                3645
            ],
            [
                3645,
                3804
            ],
            [
                3805,
                3813
            ],
            [
                3813,
                3934
            ],
            [
                3934,
                3997
            ],
            [
                3997,
                4008
            ],
            [
                4009,
                4014
            ],
            [
                4021,
                4026
            ],
            [
                4026,
                4028
            ],
            [
                4028,
                4071
            ],
            [
                4071,
                4131
            ],
            [
                4131,
                4211
            ],
            [
                4211,
                4223
            ],
            [
                4224,
                4265
            ],
            [
                4271,
                4282
            ],
            [
                4283,
                4363
            ],
            [
                4363,
                4365
            ],
            [
                4365,
                4538
            ],
            [
                4539,
                4635
            ],
            [
                4635,
                4647
            ],
            [
                4648,
                4662
            ],
            [
                4662,
                4681
            ],
            [
                4681,
                4693
            ],
            [
                4694,
                4835
            ],
            [
                4836,
                4908
            ],
            [
                4908,
                4910
            ],
            [
                4910,
                4972
            ],
            [
                4973,
                5048
            ],
            [
                5049,
                5134
            ],
            [
                5135,
                5207
            ],
            [
                5208,
                5236
            ],
            [
                5239,
                5264
            ],
            [
                5267,
                5325
            ],
            [
                5326,
                5328
            ],
            [
                5329,
                5376
            ],
            [
                5376,
                5398
            ],
            [
                5398,
                5443
            ],
            [
                5444,
                5455
            ],
            [
                5461,
                5489
            ],
            [
                5489,
                5501
            ],
            [
                5501,
                5530
            ],
            [
                5530,
                5592
            ],
            [
                5592,
                5655
            ],
            [
                5658,
                5679
            ],
            [
                5680,
                5726
            ],
            [
                5726,
                5809
            ],
            [
                5809,
                5849
            ],
            [
                5849,
                5931
            ],
            [
                5931,
                5995
            ],
            [
                5998,
                6039
            ],
            [
                6039,
                6052
            ],
            [
                6052,
                6071
            ],
            [
                6072,
                6106
            ],
            [
                6106,
                6203
            ],
            [
                6203,
                6244
            ],
            [
                6247,
                6285
            ],
            [
                6285,
                6322
            ],
            [
                6322,
                6431
            ],
            [
                6431,
                6495
            ],
            [
                6495,
                6533
            ],
            [
                6533,
                6587
            ],
            [
                6587,
                6614
            ],
            [
                6614,
                6728
            ],
            [
                6728,
                6751
            ],
            [
                6751,
                6774
            ],
            [
                6774,
                6818
            ],
            [
                6819,
                6888
            ],
            [
                6889,
                6988
            ],
            [
                6988,
                7010
            ],
            [
                7013,
                7027
            ],
            [
                7040,
                7089
            ],
            [
                7089,
                7118
            ],
            [
                7118,
                7151
            ],
            [
                7151,
                7232
            ],
            [
                7232,
                7235
            ],
            [
                7236,
                7298
            ],
            [
                7301,
                7337
            ],
            [
                7347,
                7351
            ],
            [
                7352,
                7409
            ],
            [
                7409,
                7522
            ],
            [
                7522,
                7528
            ],
            [
                7528,
                7547
            ],
            [
                7547,
                7560
            ],
            [
                7560,
                7608
            ],
            [
                7616,
                7635
            ],
            [
                7640,
                7646
            ],
            [
                7646,
                7679
            ],
            [
                7700,
                7743
            ],
            [
                7743,
                7834
            ],
            [
                7839,
                7846
            ],
            [
                7846,
                7887
            ],
            [
                7888,
                7891
            ],
            [
                7896,
                7916
            ],
            [
                7916,
                7952
            ],
            [
                7952,
                7971
            ],
            [
                7971,
                7995
            ],
            [
                7995,
                8047
            ],
            [
                8047,
                8094
            ],
            [
                8094,
                8135
            ],
            [
                8135,
                8153
            ],
            [
                8159,
                8240
            ],
            [
                8244,
                8247
            ],
            [
                8248,
                8295
            ],
            [
                8301,
                8305
            ],
            [
                8324,
                8362
            ],
            [
                8362,
                8450
            ],
            [
                8456,
                8463
            ],
            [
                8463,
                8508
            ],
            [
                8508,
                8529
            ],
            [
                8530,
                8573
            ],
            [
                8574,
                8583
            ],
            [
                8583,
                8619
            ],
            [
                8619,
                8657
            ],
            [
                8657,
                8671
            ],
            [
                8671,
                8685
            ],
            [
                8685,
                8730
            ],
            [
                8730,
                8746
            ],
            [
                8749,
                8904
            ],
            [
                8905,
                8966
            ],
            [
                8966,
                9013
            ],
            [
                9013,
                9032
            ],
            [
                9032,
                9074
            ],
            [
                9074,
                9102
            ],
            [
                9102,
                9141
            ],
            [
                9141,
                9177
            ],
            [
                9177,
                9193
            ],
            [
                9193,
                9195
            ],
            [
                9195,
                9205
            ],
            [
                9214,
                9246
            ],
            [
                9246,
                9258
            ],
            [
                9259,
                9272
            ],
            [
                9273,
                9294
            ],
            [
                9295,
                9299
            ],
            [
                9300,
                9304
            ],
            [
                9312,
                9314
            ],
            [
                9321,
                9341
            ],
            [
                9341,
                9361
            ],
            [
                9362,
                9371
            ],
            [
                9372,
                9380
            ],
            [
                9381,
                9442
            ],
            [
                9443,
                9466
            ],
            [
                9466,
                9476
            ],
            [
                9477,
                9483
            ],
            [
                9493,
                9567
            ],
            [
                9575,
                9593
            ],
            [
                9595,
                9605
            ],
            [
                9611,
                9707
            ],
            [
                9710,
                9712
            ],
            [
                9713,
                9722
            ],
            [
                9723,
                9740
            ],
            [
                9741,
                9828
            ],
            [
                9829,
                9882
            ],
            [
                9882,
                9941
            ],
            [
                9944,
                9991
            ],
            [
                9991,
                10027
            ],
            [
                10030,
                10061
            ],
            [
                10061,
                10094
            ],
            [
                10103,
                10128
            ],
            [
                10128,
                10219
            ],
            [
                10219,
                10333
            ],
            [
                10334,
                10335
            ],
            [
                10335,
                10349
            ],
            [
                10349,
                10370
            ],
            [
                10371,
                10372
            ],
            [
                10372,
                10417
            ],
            [
                10417,
                10535
            ],
            [
                10535,
                10590
            ],
            [
                10590,
                10624
            ],
            [
                10625,
                10668
            ],
            [
                10668,
                10694
            ],
            [
                10698,
                10712
            ],
            [
                10712,
                10774
            ],
            [
                10774,
                10803
            ],
            [
                10803,
                10836
            ],
            [
                10836,
                10882
            ],
            [
                10882,
                10977
            ],
            [
                10977,
                11015
            ],
            [
                11015,
                11050
            ],
            [
                11050,
                11110
            ],
            [
                11110,
                11188
            ],
            [
                11188,
                11263
            ],
            [
                11263,
                11277
            ],
            [
                11277,
                11294
            ],
            [
                11294,
                11321
            ],
            [
                11321,
                11322
            ],
            [
                11322,
                11374
            ],
            [
                11374,
                11424
            ],
            [
                11424,
                11468
            ],
            [
                11468,
                11489
            ],
            [
                11489,
                11544
            ],
            [
                11544,
                11633
            ],
            [
                11634,
                11670
            ],
            [
                11670,
                11687
            ],
            [
                11688,
                11739
            ],
            [
                11742,
                11853
            ],
            [
                11853,
                11905
            ],
            [
                11911,
                11997
            ],
            [
                11997,
                11998
            ],
            [
                11999,
                12089
            ],
            [
                12089,
                12296
            ],
            [
                12296,
                12312
            ],
            [
                12313,
                12396
            ],
            [
                12396,
                12455
            ],
            [
                12455,
                12468
            ],
            [
                12474,
                12476
            ],
            [
                12476,
                12582
            ],
            [
                12582,
                12660
            ],
            [
                12660,
                12676
            ],
            [
                12676,
                12702
            ],
            [
                12702,
                12770
            ],
            [
                12770,
                12791
            ],
            [
                12791,
                12835
            ],
            [
                12835,
                12850
            ],
            [
                12850,
                12913
            ],
            [
                12914,
                12940
            ],
            [
                12940,
                12941
            ],
            [
                12941,
                13018
            ],
            [
                13021,
                13038
            ],
            [
                13041,
                13045
            ],
            [
                13046,
                13057
            ],
            [
                13057,
                13083
            ],
            [
                13083,
                13193
            ],
            [
                13193,
                13284
            ],
            [
                13289,
                13327
            ],
            [
                13327,
                13333
            ],
            [
                13333,
                13385
            ],
            [
                13385,
                13431
            ],
            [
                13431,
                13447
            ],
            [
                13447,
                13448
            ],
            [
                13453,
                13486
            ],
            [
                13486,
                13536
            ],
            [
                13536,
                13545
            ],
            [
                13545,
                13613
            ],
            [
                13613,
                13632
            ],
            [
                13633,
                13664
            ],
            [
                13664,
                13665
            ],
            [
                13685,
                13693
            ],
            [
                13693,
                13702
            ],
            [
                13702,
                13713
            ],
            [
                13713,
                13764
            ],
            [
                13764,
                13785
            ],
            [
                13786,
                13805
            ],
            [
                13819,
                13821
            ],
            [
                13825,
                13863
            ],
            [
                13863,
                13893
            ],
            [
                13894,
                13917
            ],
            [
                13917,
                13919
            ],
            [
                13920,
                14012
            ],
            [
                14012,
                14209
            ],
            [
                14209,
                14241
            ],
            [
                14245,
                14249
            ],
            [
                14250,
                14260
            ],
            [
                14261,
                14282
            ],
            [
                14282,
                14283
            ],
            [
                14284,
                14312
            ],
            [
                14313,
                14342
            ],
            [
                14343,
                14346
            ],
            [
                14347,
                14356
            ],
            [
                14357,
                14396
            ],
            [
                14396,
                14469
            ],
            [
                14470,
                14484
            ],
            [
                14485,
                14488
            ],
            [
                14489,
                14526
            ],
            [
                14526,
                14546
            ],
            [
                14547,
                14550
            ],
            [
                14558,
                14559
            ],
            [
                14573,
                14655
            ],
            [
                14656,
                14736
            ],
            [
                14736,
                14738
            ],
            [
                14738,
                14829
            ],
            [
                14830,
                14854
            ],
            [
                14855,
                14861
            ],
            [
                14869,
                14870
            ],
            [
                14870,
                14964
            ],
            [
                14964,
                14991
            ],
            [
                14992,
                15024
            ],
            [
                15024,
                15090
            ],
            [
                15091,
                15101
            ],
            [
                15107,
                15110
            ],
            [
                15110,
                15128
            ],
            [
                15129,
                15139
            ],
            [
                15140,
                15145
            ],
            [
                15145,
                15225
            ],
            [
                15225,
                15227
            ],
            [
                15227,
                15260
            ],
            [
                15260,
                15294
            ],
            [
                15295,
                15366
            ],
            [
                15369,
                15408
            ],
            [
                15408,
                15418
            ],
            [
                15421,
                15442
            ],
            [
                15447,
                15513
            ],
            [
                15514,
                15548
            ],
            [
                15549,
                15567
            ],
            [
                15567,
                15595
            ],
            [
                15596,
                15599
            ],
            [
                15604,
                15621
            ],
            [
                15622,
                15634
            ],
            [
                15644,
                15669
            ],
            [
                15669,
                15744
            ],
            [
                15744,
                15757
            ],
            [
                15757,
                15760
            ],
            [
                15760,
                15817
            ],
            [
                15818,
                15824
            ],
            [
                15834,
                15842
            ],
            [
                15847,
                15899
            ],
            [
                15900,
                15902
            ],
            [
                15903,
                15905
            ],
            [
                15906,
                15911
            ],
            [
                15912,
                15916
            ],
            [
                15917,
                15925
            ],
            [
                15925,
                15927
            ],
            [
                15927,
                15928
            ],
            [
                15929,
                15978
            ],
            [
                15980,
                15992
            ],
            [
                15993,
                15995
            ],
            [
                15996,
                16000
            ],
            [
                16000,
                16001
            ],
            [
                16014,
                16015
            ],
            [
                16016,
                16086
            ],
            [
                16092,
                16095
            ],
            [
                16095,
                16188
            ],
            [
                16189,
                16241
            ],
            [
                16242,
                16289
            ],
            [
                16289,
                16292
            ],
            [
                16292,
                16343
            ],
            [
                16343,
                16372
            ],
            [
                16382,
                16388
            ],
            [
                16391,
                16400
            ],
            [
                16403,
                16420
            ],
            [
                16423,
                16434
            ],
            [
                16434,
                16482
            ],
            [
                16483,
                16494
            ],
            [
                16494,
                16500
            ],
            [
                16500,
                16523
            ],
            [
                16525,
                16557
            ],
            [
                16557,
                16559
            ],
            [
                16559,
                16682
            ],
            [
                16682,
                16719
            ],
            [
                16719,
                16721
            ],
            [
                16721,
                16763
            ],
            [
                16764,
                16806
            ],
            [
                16806,
                16882
            ],
            [
                16883,
                16918
            ],
            [
                16918,
                17053
            ],
            [
                17054,
                17120
            ],
            [
                17120,
                17178
            ],
            [
                17178,
                17196
            ],
            [
                17196,
                17225
            ],
            [
                17225,
                17248
            ],
            [
                17248,
                17265
            ],
            [
                17265,
                17316
            ],
            [
                17316,
                17405
            ],
            [
                17406,
                17425
            ],
            [
                17425,
                17460
            ],
            [
                17461,
                17471
            ],
            [
                17471,
                17494
            ],
            [
                17495,
                17513
            ],
            [
                17513,
                17538
            ],
            [
                17539,
                17540
            ],
            [
                17545,
                17547
            ],
            [
                17586,
                17683
            ],
            [
                17687,
                17725
            ],
            [
                17727,
                17728
            ],
            [
                17734,
                17768
            ],
            [
                17768,
                17770
            ],
            [
                17770,
                17791
            ],
            [
                17801,
                17803
            ],
            [
                17804,
                17817
            ],
            [
                17818,
                17829
            ],
            [
                17830,
                17834
            ],
            [
                17835,
                17857
            ],
            [
                17858,
                17878
            ],
            [
                17879,
                17887
            ],
            [
                17888,
                17943
            ],
            [
                17944,
                17946
            ],
            [
                17947,
                17954
            ],
            [
                17954,
                18019
            ],
            [
                18020,
                18046
            ],
            [
                18046,
                18087
            ],
            [
                18104,
                18109
            ],
            [
                18110,
                18137
            ],
            [
                18142,
                18151
            ],
            [
                18154,
                18177
            ],
            [
                18178,
                18213
            ],
            [
                18214,
                18274
            ],
            [
                18274,
                18349
            ],
            [
                18354,
                18456
            ],
            [
                18457,
                18478
            ],
            [
                18478,
                18480
            ],
            [
                18480,
                18577
            ],
            [
                18584,
                18596
            ],
            [
                18599,
                18620
            ],
            [
                18621,
                18655
            ],
            [
                18655,
                18657
            ],
            [
                18657,
                18760
            ],
            [
                18760,
                18805
            ],
            [
                18806,
                18851
            ],
            [
                18852,
                18891
            ],
            [
                18895,
                18921
            ],
            [
                18922,
                18959
            ],
            [
                18959,
                19055
            ],
            [
                19056,
                19138
            ],
            [
                19138,
                19209
            ],
            [
                19209,
                19217
            ],
            [
                19218,
                19258
            ],
            [
                19258,
                19381
            ],
            [
                19381,
                19408
            ],
            [
                19408,
                19431
            ],
            [
                19431,
                19451
            ],
            [
                19451,
                19475
            ],
            [
                19475,
                19561
            ],
            [
                19561,
                19563
            ],
            [
                19564,
                19577
            ],
            [
                19577,
                19626
            ],
            [
                19626,
                19695
            ],
            [
                19701,
                19718
            ],
            [
                19721,
                19812
            ],
            [
                19812,
                19876
            ],
            [
                19876,
                19930
            ],
            [
                19930,
                19954
            ],
            [
                19954,
                20001
            ],
            [
                20010,
                20011
            ],
            [
                20012,
                20043
            ],
            [
                20049,
                20052
            ],
            [
                20053,
                20077
            ],
            [
                20077,
                20084
            ],
            [
                20084,
                20086
            ],
            [
                20087,
                20148
            ],
            [
                20148,
                20150
            ],
            [
                20150,
                20299
            ],
            [
                20299,
                20317
            ],
            [
                20317,
                20319
            ],
            [
                20319,
                20355
            ],
            [
                20355,
                20400
            ],
            [
                20406,
                20408
            ],
            [
                20408,
                20454
            ],
            [
                20455,
                20487
            ],
            [
                20487,
                20617
            ],
            [
                20617,
                20627
            ],
            [
                20630,
                20676
            ],
            [
                20677,
                20687
            ],
            [
                20698,
                20705
            ],
            [
                20705,
                20706
            ],
            [
                20709,
                20712
            ],
            [
                20712,
                20747
            ],
            [
                20747,
                20755
            ],
            [
                20756,
                20784
            ],
            [
                20784,
                20821
            ],
            [
                20821,
                20835
            ],
            [
                20835,
                20883
            ],
            [
                20883,
                20959
            ],
            [
                20959,
                20987
            ],
            [
                20987,
                21085
            ],
            [
                21085,
                21120
            ],
            [
                21121,
                21130
            ],
            [
                21130,
                21141
            ],
            [
                21142,
                21178
            ],
            [
                21178,
                21288
            ],
            [
                21291,
                21340
            ],
            [
                21340,
                21366
            ],
            [
                21366,
                21367
            ],
            [
                21368,
                21369
            ],
            [
                21381,
                21400
            ],
            [
                21400,
                21401
            ],
            [
                21409,
                21423
            ],
            [
                21423,
                21424
            ],
            [
                21425,
                21448
            ],
            [
                21448,
                21489
            ],
            [
                21496,
                21498
            ],
            [
                21498,
                21515
            ],
            [
                21526,
                21530
            ],
            [
                21531,
                21570
            ],
            [
                21571,
                21585
            ],
            [
                21586,
                21618
            ],
            [
                21627,
                21640
            ],
            [
                21641,
                21645
            ],
            [
                21646,
                21650
            ],
            [
                21651,
                21666
            ],
            [
                21666,
                21667
            ],
            [
                21668,
                21676
            ],
            [
                21677,
                21680
            ],
            [
                21706,
                21747
            ],
            [
                21748,
                21763
            ],
            [
                21763,
                21765
            ],
            [
                21765,
                21791
            ],
            [
                21792,
                21810
            ],
            [
                21816,
                21860
            ],
            [
                21860,
                21862
            ],
            [
                21862,
                21864
            ],
            [
                21865,
                21900
            ],
            [
                21900,
                21907
            ],
            [
                21914,
                21917
            ],
            [
                21917,
                21951
            ],
            [
                21951,
                22021
            ],
            [
                22023,
                22052
            ],
            [
                22052,
                22099
            ],
            [
                22099,
                22100
            ],
            [
                22100,
                22105
            ],
            [
                22105,
                22125
            ],
            [
                22125,
                22146
            ],
            [
                22146,
                22176
            ],
            [
                22176,
                22253
            ],
            [
                22253,
                22291
            ],
            [
                22292,
                22297
            ],
            [
                22303,
                22479
            ],
            [
                22480,
                22628
            ],
            [
                22629,
                22641
            ],
            [
                22642,
                22765
            ]
        ],
        "row_chars": [
            [
                0,
                73
            ],
            [
                73,
                200
            ],
            [
                200,
                363
            ],
            [
                363,
                404
            ],
            [
                404,
                449
            ],
            [
                449,
                565
            ],
            [
                565,
                565
            ],
            [
                565,
                685
            ],
            [
                685,
                912
            ],
            [
                912,
                937
            ],
            [
                937,
                937
            ],
            [
                937,
                937
            ],
            [
                937,
                1038
            ],
            [
                1038,
                1194
            ],
            [
                1194,
                1223
            ],
            [
                1223,
                1273
            ],
            [
                1273,
                1286
            ],
            [
                1286,
                1333
            ],
            [
                1333,
                1382
            ],
            [
                1382,
                1473
            ],
            [
                1473,
                1596
            ],
            [
                1596,
                1640
            ],
            [
                1640,
                1712
            ],
            [
                1712,
                1712
            ],
            [
                1712,
                1712
            ],
            [
                1712,
                1739
            ],
            [
                1739,
                1769
            ],
            [
                1769,
                1836
            ],
            [
                1836,
                1836
            ],
            [
                1836,
                1920
            ],
            [
                1920,
                1931
            ],
            [
                1931,
                2010
            ],
            [
                2010,
                2070
            ],
            [
                2070,
                2084
            ],
            [
                2084,
                2106
            ],
            [
                2106,
                2106
            ],
            [
                2106,
                2106
            ],
            [
                2106,
                2106
            ],
            [
                2106,
                2106
            ],
            [
                2106,
                2197
            ],
            [
                2197,
                2304
            ],
            [
                2304,
                2365
            ],
            [
                2365,
                2365
            ],
            [
                2365,
                2365
            ],
            [
                2365,
                2365
            ],
            [
                2365,
                2472
            ],
            [
                2472,
                2527
            ],
            [
                2527,
                2657
            ],
            [
                2657,
                2657
            ],
            [
                2657,
                2657
            ],
            [
                2657,
                2657
            ],
            [
                2657,
                2745
            ],
            [
                2745,
                2789
            ],
            [
                2789,
                2808
            ],
            [
                2808,
                2808
            ],
            [
                2808,
                2827
            ],
            [
                2827,
                2848
            ],
            [
                2848,
                2972
            ],
            [
                2972,
                2982
            ],
            [
                2982,
                3045
            ],
            [
                3045,
                3074
            ],
            [
                3074,
                3074
            ],
            [
                3074,
                3074
            ],
            [
                3074,
                3112
            ],
            [
                3112,
                3112
            ],
            [
                3112,
                3112
            ],
            [
                3112,
                3158
            ],
            [
                3158,
                3169
            ],
            [
                3169,
                3177
            ],
            [
                3177,
                3188
            ],
            [
                3188,
                3225
            ],
            [
                3225,
                3250
            ],
            [
                3250,
                3310
            ],
            [
                3310,
                3357
            ],
            [
                3357,
                3435
            ],
            [
                3435,
                3507
            ],
            [
                3507,
                3556
            ],
            [
                3556,
                3645
            ],
            [
                3645,
                3813
            ],
            [
                3813,
                3997
            ],
            [
                3997,
                4028
            ],
            [
                4028,
                4211
            ],
            [
                4211,
                4365
            ],
            [
                4365,
                4539
            ],
            [
                4539,
                4539
            ],
            [
                4539,
                4635
            ],
            [
                4635,
                4681
            ],
            [
                4681,
                4910
            ],
            [
                4910,
                5135
            ],
            [
                5135,
                5326
            ],
            [
                5326,
                5376
            ],
            [
                5376,
                5398
            ],
            [
                5398,
                5489
            ],
            [
                5489,
                5501
            ],
            [
                5501,
                5530
            ],
            [
                5530,
                5592
            ],
            [
                5592,
                5658
            ],
            [
                5658,
                5658
            ],
            [
                5658,
                5658
            ],
            [
                5658,
                5658
            ],
            [
                5658,
                5726
            ],
            [
                5726,
                5809
            ],
            [
                5809,
                5849
            ],
            [
                5849,
                5931
            ],
            [
                5931,
                5998
            ],
            [
                5998,
                5998
            ],
            [
                5998,
                6039
            ],
            [
                6039,
                6052
            ],
            [
                6052,
                6071
            ],
            [
                6071,
                6071
            ],
            [
                6071,
                6106
            ],
            [
                6106,
                6203
            ],
            [
                6203,
                6285
            ],
            [
                6285,
                6322
            ],
            [
                6322,
                6431
            ],
            [
                6431,
                6533
            ],
            [
                6533,
                6587
            ],
            [
                6587,
                6614
            ],
            [
                6614,
                6728
            ],
            [
                6728,
                6751
            ],
            [
                6751,
                6774
            ],
            [
                6774,
                6889
            ],
            [
                6889,
                6988
            ],
            [
                6988,
                7013
            ],
            [
                7013,
                7013
            ],
            [
                7013,
                7013
            ],
            [
                7013,
                7013
            ],
            [
                7013,
                7013
            ],
            [
                7013,
                7013
            ],
            [
                7013,
                7013
            ],
            [
                7013,
                7089
            ],
            [
                7089,
                7118
            ],
            [
                7118,
                7151
            ],
            [
                7151,
                7232
            ],
            [
                7232,
                7301
            ],
            [
                7301,
                7301
            ],
            [
                7301,
                7301
            ],
            [
                7301,
                7409
            ],
            [
                7409,
                7522
            ],
            [
                7522,
                7528
            ],
            [
                7528,
                7547
            ],
            [
                7547,
                7560
            ],
            [
                7560,
                7608
            ],
            [
                7608,
                7743
            ],
            [
                7743,
                7846
            ],
            [
                7846,
                7916
            ],
            [
                7916,
                7952
            ],
            [
                7952,
                7971
            ],
            [
                7971,
                7995
            ],
            [
                7995,
                8047
            ],
            [
                8047,
                8047
            ],
            [
                8047,
                8094
            ],
            [
                8094,
                8135
            ],
            [
                8135,
                8135
            ],
            [
                8135,
                8159
            ],
            [
                8159,
                8159
            ],
            [
                8159,
                8362
            ],
            [
                8362,
                8508
            ],
            [
                8508,
                8619
            ],
            [
                8619,
                8657
            ],
            [
                8657,
                8671
            ],
            [
                8671,
                8685
            ],
            [
                8685,
                8730
            ],
            [
                8730,
                8749
            ],
            [
                8749,
                8966
            ],
            [
                8966,
                9032
            ],
            [
                9032,
                9074
            ],
            [
                9074,
                9102
            ],
            [
                9102,
                9177
            ],
            [
                9177,
                9195
            ],
            [
                9195,
                9246
            ],
            [
                9246,
                9341
            ],
            [
                9341,
                9593
            ],
            [
                9593,
                9710
            ],
            [
                9710,
                9882
            ],
            [
                9882,
                9991
            ],
            [
                9991,
                10061
            ],
            [
                10061,
                10128
            ],
            [
                10128,
                10219
            ],
            [
                10219,
                10334
            ],
            [
                10334,
                10334
            ],
            [
                10334,
                10417
            ],
            [
                10417,
                10535
            ],
            [
                10535,
                10590
            ],
            [
                10590,
                10590
            ],
            [
                10590,
                10668
            ],
            [
                10668,
                10774
            ],
            [
                10774,
                10803
            ],
            [
                10803,
                10836
            ],
            [
                10836,
                10882
            ],
            [
                10882,
                10977
            ],
            [
                10977,
                11015
            ],
            [
                11015,
                11050
            ],
            [
                11050,
                11110
            ],
            [
                11110,
                11188
            ],
            [
                11188,
                11263
            ],
            [
                11263,
                11277
            ],
            [
                11277,
                11294
            ],
            [
                11294,
                11321
            ],
            [
                11321,
                11468
            ],
            [
                11468,
                11489
            ],
            [
                11489,
                11544
            ],
            [
                11544,
                11670
            ],
            [
                11670,
                11670
            ],
            [
                11670,
                11742
            ],
            [
                11742,
                11742
            ],
            [
                11742,
                11742
            ],
            [
                11742,
                11853
            ],
            [
                11853,
                11999
            ],
            [
                11999,
                11999
            ],
            [
                11999,
                11999
            ],
            [
                11999,
                12089
            ],
            [
                12089,
                12296
            ],
            [
                12296,
                12396
            ],
            [
                12396,
                12455
            ],
            [
                12455,
                12476
            ],
            [
                12476,
                12582
            ],
            [
                12582,
                12660
            ],
            [
                12660,
                12676
            ],
            [
                12676,
                12702
            ],
            [
                12702,
                12791
            ],
            [
                12791,
                12835
            ],
            [
                12835,
                12850
            ],
            [
                12850,
                12940
            ],
            [
                12940,
                12940
            ],
            [
                12940,
                12940
            ],
            [
                12940,
                13021
            ],
            [
                13021,
                13041
            ],
            [
                13041,
                13041
            ],
            [
                13041,
                13057
            ],
            [
                13057,
                13193
            ],
            [
                13193,
                13327
            ],
            [
                13327,
                13333
            ],
            [
                13333,
                13385
            ],
            [
                13385,
                13431
            ],
            [
                13431,
                13486
            ],
            [
                13486,
                13536
            ],
            [
                13536,
                13613
            ],
            [
                13613,
                13664
            ],
            [
                13664,
                13693
            ],
            [
                13693,
                13764
            ],
            [
                13764,
                13764
            ],
            [
                13764,
                13863
            ],
            [
                13863,
                13919
            ],
            [
                13919,
                14012
            ],
            [
                14012,
                14209
            ],
            [
                14209,
                14284
            ],
            [
                14284,
                14284
            ],
            [
                14284,
                14396
            ],
            [
                14396,
                14526
            ],
            [
                14526,
                14526
            ],
            [
                14526,
                14526
            ],
            [
                14526,
                14738
            ],
            [
                14738,
                14964
            ],
            [
                14964,
                15024
            ],
            [
                15024,
                15024
            ],
            [
                15024,
                15145
            ],
            [
                15145,
                15227
            ],
            [
                15227,
                15260
            ],
            [
                15260,
                15369
            ],
            [
                15369,
                15408
            ],
            [
                15408,
                15669
            ],
            [
                15669,
                15760
            ],
            [
                15760,
                15927
            ],
            [
                15927,
                15980
            ],
            [
                15980,
                15980
            ],
            [
                15980,
                15980
            ],
            [
                15980,
                16292
            ],
            [
                16292,
                16434
            ],
            [
                16434,
                16494
            ],
            [
                16494,
                16500
            ],
            [
                16500,
                16559
            ],
            [
                16559,
                16682
            ],
            [
                16682,
                16721
            ],
            [
                16721,
                16806
            ],
            [
                16806,
                16918
            ],
            [
                16918,
                17120
            ],
            [
                17120,
                17178
            ],
            [
                17178,
                17196
            ],
            [
                17196,
                17225
            ],
            [
                17225,
                17248
            ],
            [
                17248,
                17265
            ],
            [
                17265,
                17316
            ],
            [
                17316,
                17425
            ],
            [
                17425,
                17471
            ],
            [
                17471,
                17585
            ],
            [
                17585,
                17727
            ],
            [
                17727,
                17727
            ],
            [
                17727,
                17727
            ],
            [
                17727,
                17770
            ],
            [
                17770,
                17954
            ],
            [
                17954,
                18020
            ],
            [
                18020,
                18020
            ],
            [
                18020,
                18020
            ],
            [
                18020,
                18046
            ],
            [
                18046,
                18046
            ],
            [
                18046,
                18274
            ],
            [
                18274,
                18480
            ],
            [
                18480,
                18599
            ],
            [
                18599,
                18599
            ],
            [
                18599,
                18599
            ],
            [
                18599,
                18599
            ],
            [
                18599,
                18657
            ],
            [
                18657,
                18760
            ],
            [
                18760,
                18891
            ],
            [
                18891,
                18959
            ],
            [
                18959,
                19138
            ],
            [
                19138,
                19258
            ],
            [
                19258,
                19381
            ],
            [
                19381,
                19408
            ],
            [
                19408,
                19431
            ],
            [
                19431,
                19451
            ],
            [
                19451,
                19475
            ],
            [
                19475,
                19561
            ],
            [
                19561,
                19626
            ],
            [
                19626,
                19812
            ],
            [
                19812,
                19876
            ],
            [
                19876,
                19930
            ],
            [
                19930,
                19954
            ],
            [
                19954,
                20052
            ],
            [
                20052,
                20052
            ],
            [
                20052,
                20077
            ],
            [
                20077,
                20084
            ],
            [
                20084,
                20150
            ],
            [
                20150,
                20150
            ],
            [
                20150,
                20299
            ],
            [
                20299,
                20319
            ],
            [
                20319,
                20355
            ],
            [
                20355,
                20408
            ],
            [
                20408,
                20487
            ],
            [
                20487,
                20617
            ],
            [
                20617,
                20630
            ],
            [
                20630,
                20630
            ],
            [
                20630,
                20705
            ],
            [
                20705,
                20712
            ],
            [
                20712,
                20747
            ],
            [
                20747,
                20784
            ],
            [
                20784,
                20821
            ],
            [
                20821,
                20835
            ],
            [
                20835,
                20883
            ],
            [
                20883,
                20959
            ],
            [
                20959,
                20987
            ],
            [
                20987,
                21085
            ],
            [
                21085,
                21130
            ],
            [
                21130,
                21142
            ],
            [
                21142,
                21178
            ],
            [
                21178,
                21340
            ],
            [
                21340,
                21368
            ],
            [
                21368,
                21368
            ],
            [
                21368,
                21400
            ],
            [
                21400,
                21448
            ],
            [
                21448,
                21498
            ],
            [
                21498,
                21765
            ],
            [
                21765,
                21862
            ],
            [
                21862,
                21900
            ],
            [
                21900,
                21917
            ],
            [
                21917,
                21951
            ],
            [
                21951,
                22023
            ],
            [
                22023,
                22023
            ],
            [
                22023,
                22023
            ],
            [
                22023,
                22052
            ],
            [
                22052,
                22099
            ],
            [
                22099,
                22105
            ],
            [
                22105,
                22125
            ],
            [
                22125,
                22146
            ],
            [
                22146,
                22176
            ],
            [
                22176,
                22253
            ],
            [
                22253,
                22480
            ],
            [
                22480,
                22765
            ]
        ]
    }
}