{
    "original": {
        "text": "The place in Lincolnshire has shut its many eyes again, and the house in town is awake. In Lincolnshire the Dedlocks of the past doze in their picture-frames, and the low wind murmurs through the long drawing-room as if they were breathing pretty regularly. In town the Dedlocks of the present rattle in their fire-eyed carriages through the darkness of the night, and the Dedlock Mercuries, with ashes (or hair-powder) on their heads, symptomatic of their great humility, loll away the drowsy mornings in the little windows of the hall. The fashionable world--tremendous orb, nearly five miles round--is in full swing, and the solar system works respectfully at its appointed distances.\nWhere the throng is thickest, where the lights are brightest, where all the senses are ministered to with the greatest delicacy and refinement, Lady Dedlock is. From the shining heights she has scaled and taken, she is never absent. Though the belief she of old reposed in herself as one able to reserve whatsoever she would under her mantle of pride is beaten down, though she has no assurance that what she is to those around her she will remain another day, it is not in her nature when envious eyes are looking on to yield or to droop. They say of her that she has lately grown more handsome and more haughty. The debilitated cousin says of her that she's beauty nough--tsetup shopofwomen--but rather larming kind--remindingmanfact--inconvenient woman--who WILL getoutofbedandbawthstahlishment--Shakespeare.\nMr. Tulkinghorn says nothing, looks nothing. Now, as heretofore, he is to be found in doorways of rooms, with his limp white cravat loosely twisted into its old-fashioned tie, receiving patronage from the peerage and making no sign. Of all men he is still the last who might be supposed to have any influence upon my Lady. Of all women she is still the last who might be supposed to have any dread of him.\nOne thing has been much on her mind since their late interview in his turret-room at Chesney Wold. She is now decided, and prepared to throw it off.\nIt is morning in the great world, afternoon according to the little sun. The Mercuries, exhausted by looking out of window, are reposing in the hall and hang their heavy heads, the gorgeous creatures, like overblown sunflowers. Like them, too, they seem to run to a deal of seed in their tags and trimmings. Sir Leicester, in the library, has fallen asleep for the good of the country over the report of a Parliamentary committee. My Lady sits in the room in which she gave audience to the young man of the name of Guppy. Rosa is with her and has been writing for her and reading to her. Rosa is now at work upon embroidery or some such pretty thing, and as she bends her head over it, my Lady watches her in silence. Not for the first time to-day.\n\"Rosa.\"\nThe pretty village face looks brightly up. Then, seeing how serious my Lady is, looks puzzled and surprised.\n\"See to the door. Is it shut?\"\nYes. She goes to it and returns, and looks yet more surprised.\n\"I am about to place confidence in you, child, for I know I may trust your attachment, if not your judgment. In what I am going to do, I will not disguise myself to you at least. But I confide in you. Say nothing to any one of what passes between us.\"\nThe timid little beauty promises in all earnestness to be trustworthy.\n\"Do you know,\" Lady Dedlock asks her, signing to her to bring her chair nearer, \"do you know, Rosa, that I am different to you from what I am to any one?\"\n\"Yes, my Lady. Much kinder. But then I often think I know you as you really are.\"\n\"You often think you know me as I really am? Poor child, poor child!\"\nShe says it with a kind of scorn--though not of Rosa--and sits brooding, looking dreamily at her.\n\"Do you think, Rosa, you are any relief or comfort to me? Do you suppose your being young and natural, and fond of me and grateful to me, makes it any pleasure to me to have you near me?\"\n\"I don't know, my Lady; I can scarcely hope so. But with all my heart, I wish it was so.\"\n\"It is so, little one.\"\nThe pretty face is checked in its flush of pleasure by the dark expression on the handsome face before it. It looks timidly for an explanation.\n\"And if I were to say to-day, 'Go! Leave me!' I should say what would give me great pain and disquiet, child, and what would leave me very solitary.\"\n\"My Lady! Have I offended you?\"\n\"In nothing. Come here.\"\nRosa bends down on the footstool at my Lady's feet. My Lady, with that motherly touch of the famous ironmaster night, lays her hand upon her dark hair and gently keeps it there.\n\"I told you, Rosa, that I wished you to be happy and that I would make you so if I could make anybody happy on this earth. I cannot. There are reasons now known to me, reasons in which you have no part, rendering it far better for you that you should not remain here. You must not remain here. I have determined that you shall not. I have written to the father of your lover, and he will be here to-day. All this I have done for your sake.\"\nThe weeping girl covers her hand with kisses and says what shall she do, what shall she do, when they are separated! Her mistress kisses her on the cheek and makes no other answer.\n\"Now, be happy, child, under better circumstances. Be beloved and happy!\"\n\"Ah, my Lady, I have sometimes thought--forgive my being so free--that YOU are not happy.\"\n\"I!\"\n\"Will you be more so when you have sent me away? Pray, pray, think again. Let me stay a little while!\"\n\"I have said, my child, that what I do, I do for your sake, not my own. It is done. What I am towards you, Rosa, is what I am now--not what I shall be a little while hence. Remember this, and keep my confidence. Do so much for my sake, and thus all ends between us!\"\nShe detaches herself from her simple-hearted companion and leaves the room. Late in the afternoon, when she next appears upon the staircase, she is in her haughtiest and coldest state. As indifferent as if all passion, feeling, and interest had been worn out in the earlier ages of the world and had perished from its surface with its other departed monsters.\nMercury has announced Mr. Rouncewell, which is the cause of her appearance. Mr. Rouncewell is not in the library, but she repairs to the library. Sir Leicester is there, and she wishes to speak to him first.\n\"Sir Leicester, I am desirous--but you are engaged.\"\nOh, dear no! Not at all. Only Mr. Tulkinghorn.\nAlways at hand. Haunting every place. No relief or security from him for a moment.\n\"I beg your pardon, Lady Dedlock. Will you allow me to retire?\"\nWith a look that plainly says, \"You know you have the power to remain if you will,\" she tells him it is not necessary and moves towards a chair. Mr. Tulkinghorn brings it a little forward for her with his clumsy bow and retires into a window opposite. Interposed between her and the fading light of day in the now quiet street, his shadow falls upon her, and he darkens all before her. Even so does he darken her life.\nIt is a dull street under the best conditions, where the two long rows of houses stare at each other with that severity that half-a-dozen of its greatest mansions seem to have been slowly stared into stone rather than originally built in that material. It is a street of such dismal grandeur, so determined not to condescend to liveliness, that the doors and windows hold a gloomy state of their own in black paint and dust, and the echoing mews behind have a dry and massive appearance, as if they were reserved to stable the stone chargers of noble statues. Complicated garnish of iron-work entwines itself over the flights of steps in this awful street, and from these petrified bowers, extinguishers for obsolete flambeaux gasp at the upstart gas. Here and there a weak little iron hoop, through which bold boys aspire to throw their friends' caps (its only present use), retains its place among the rusty foliage, sacred to the memory of departed oil. Nay, even oil itself, yet lingering at long intervals in a little absurd glass pot, with a knob in the bottom like an oyster, blinks and sulks at newer lights every night, like its high and dry master in the House of Lords.\nTherefore there is not much that Lady Dedlock, seated in her chair, could wish to see through the window in which Mr. Tulkinghorn stands. And yet--and yet--she sends a look in that direction as if it were her heart's desire to have that figure moved out of the way.\nSir Leicester begs his Lady's pardon. She was about to say?\n\"Only that Mr. Rouncewell is here (he has called by my appointment) and that we had better make an end of the question of that girl. I am tired to death of the matter.\"\n\"What can I do--to--assist?\" demands Sir Leicester in some considerable doubt.\n\"Let us see him here and have done with it. Will you tell them to send him up?\"\n\"Mr. Tulkinghorn, be so good as to ring. Thank you. Request,\" says Sir Leicester to Mercury, not immediately remembering the business term, \"request the iron gentleman to walk this way.\"\nMercury departs in search of the iron gentleman, finds, and produces him. Sir Leicester receives that ferruginous person graciously.\n\"I hope you are well, Mr. Rouncewell. Be seated. (My solicitor, Mr. Tulkinghorn.) My Lady was desirous, Mr. Rouncewell,\" Sir Leicester skilfully transfers him with a solemn wave of his hand, \"was desirous to speak with you. Hem!\"\n\"I shall be very happy,\" returns the iron gentleman, \"to give my best attention to anything Lady Dedlock does me the honour to say.\"\nAs he turns towards her, he finds that the impression she makes upon him is less agreeable than on the former occasion. A distant supercilious air makes a cold atmosphere about her, and there is nothing in her bearing, as there was before, to encourage openness.\n\"Pray, sir,\" says Lady Dedlock listlessly, \"may I be allowed to inquire whether anything has passed between you and your son respecting your son's fancy?\"\nIt is almost too troublesome to her languid eyes to bestow a look upon him as she asks this question.\n\"If my memory serves me, Lady Dedlock, I said, when I had the pleasure of seeing you before, that I should seriously advise my son to conquer that--fancy.\" The ironmaster repeats her expression with a little emphasis.\n\"And did you?\"\n\"Oh! Of course I did.\"\nSir Leicester gives a nod, approving and confirmatory. Very proper. The iron gentleman, having said that he would do it, was bound to do it. No difference in this respect between the base metals and the precious. Highly proper.\n\"And pray has he done so?\"\n\"Really, Lady Dedlock, I cannot make you a definite reply. I fear not. Probably not yet. In our condition of life, we sometimes couple an intention with our--our fancies which renders them not altogether easy to throw off. I think it is rather our way to be in earnest.\"\nSir Leicester has a misgiving that there may be a hidden Wat Tylerish meaning in this expression, and fumes a little. Mr. Rouncewell is perfectly good-humoured and polite, but within such limits, evidently adapts his tone to his reception.\n\"Because,\" proceeds my Lady, \"I have been thinking of the subject, which is tiresome to me.\"\n\"I am very sorry, I am sure.\"\n\"And also of what Sir Leicester said upon it, in which I quite concur\"--Sir Leicester flattered--\"and if you cannot give us the assurance that this fancy is at an end, I have come to the conclusion that the girl had better leave me.\"\n\"I can give no such assurance, Lady Dedlock. Nothing of the kind.\"\n\"Then she had better go.\"\n\"Excuse me, my Lady,\" Sir Leicester considerately interposes, \"but perhaps this may be doing an injury to the young woman which she has not merited. Here is a young woman,\" says Sir Leicester, magnificently laying out the matter with his right hand like a service of plate, \"whose good fortune it is to have attracted the notice and favour of an eminent lady and to live, under the protection of that eminent lady, surrounded by the various advantages which such a position confers, and which are unquestionably very great--I believe unquestionably very great, sir--for a young woman in that station of life. The question then arises, should that young woman be deprived of these many advantages and that good fortune simply because she has\"--Sir Leicester, with an apologetic but dignified inclination of his head towards the ironmaster, winds up his sentence--\"has attracted the notice of Mr Rouncewell's son? Now, has she deserved this punishment? Is this just towards her? Is this our previous understanding?\"\n\"I beg your pardon,\" interposes Mr. Rouncewell's son's father. \"Sir Leicester, will you allow me? I think I may shorten the subject. Pray dismiss that from your consideration. If you remember anything so unimportant--which is not to be expected--you would recollect that my first thought in the affair was directly opposed to her remaining here.\"\nDismiss the Dedlock patronage from consideration? Oh! Sir Leicester is bound to believe a pair of ears that have been handed down to him through such a family, or he really might have mistrusted their report of the iron gentleman's observations.\n\"It is not necessary,\" observes my Lady in her coldest manner before he can do anything but breathe amazedly, \"to enter into these matters on either side. The girl is a very good girl; I have nothing whatever to say against her, but she is so far insensible to her many advantages and her good fortune that she is in love--or supposes she is, poor little fool--and unable to appreciate them.\"\nSir Leicester begs to observe that wholly alters the case. He might have been sure that my Lady had the best grounds and reasons in support of her view. He entirely agrees with my Lady. The young woman had better go.\n\"As Sir Leicester observed, Mr. Rouncewell, on the last occasion when we were fatigued by this business,\" Lady Dedlock languidly proceeds, \"we cannot make conditions with you. Without conditions, and under present circumstances, the girl is quite misplaced here and had better go. I have told her so. Would you wish to have her sent back to the village, or would you like to take her with you, or what would you prefer?\"\n\"Lady Dedlock, if I may speak plainly--\"\n\"By all means.\"\n\"--I should prefer the course which will the soonest relieve you of the incumbrance and remove her from her present position.\"\n\"And to speak as plainly,\" she returns with the same studied carelessness, \"so should I. Do I understand that you will take her with you?\"\nThe iron gentleman makes an iron bow.\n\"Sir Leicester, will you ring?\" Mr. Tulkinghorn steps forward from his window and pulls the bell. \"I had forgotten you. Thank you.\" He makes his usual bow and goes quietly back again. Mercury, swift-responsive, appears, receives instructions whom to produce, skims away, produces the aforesaid, and departs.\nRosa has been crying and is yet in distress. On her coming in, the ironmaster leaves his chair, takes her arm in his, and remains with her near the door ready to depart.\n\"You are taken charge of, you see,\" says my Lady in her weary manner, \"and are going away well protected. I have mentioned that you are a very good girl, and you have nothing to cry for.\"\n\"She seems after all,\" observes Mr. Tulkinghorn, loitering a little forward with his hands behind him, \"as if she were crying at going away.\"\n\"Why, she is not well-bred, you see,\" returns Mr. Rouncewell with some quickness in his manner, as if he were glad to have the lawyer to retort upon, \"and she is an inexperienced little thing and knows no better. If she had remained here, sir, she would have improved, no doubt.\"\n\"No doubt,\" is Mr. Tulkinghorn's composed reply.\nRosa sobs out that she is very sorry to leave my Lady, and that she was happy at Chesney Wold, and has been happy with my Lady, and that she thanks my Lady over and over again. \"Out, you silly little puss!\" says the ironmaster, checking her in a low voice, though not angrily. \"Have a spirit, if you're fond of Watt!\" My Lady merely waves her off with indifference, saying, \"There, there, child! You are a good girl. Go away!\" Sir Leicester has magnificently disengaged himself from the subject and retired into the sanctuary of his blue coat. Mr. Tulkinghorn, an indistinct form against the dark street now dotted with lamps, looms in my Lady's view, bigger and blacker than before.\n\"Sir Leicester and Lady Dedlock,\" says Mr. Rouncewell after a pause of a few moments, \"I beg to take my leave, with an apology for having again troubled you, though not of my own act, on this tiresome subject. I can very well understand, I assure you, how tiresome so small a matter must have become to Lady Dedlock. If I am doubtful of my dealing with it, it is only because I did not at first quietly exert my influence to take my young friend here away without troubling you at all. But it appeared to me--I dare say magnifying the importance of the thing--that it was respectful to explain to you how the matter stood and candid to consult your wishes and convenience. I hope you will excuse my want of acquaintance with the polite world.\"\nSir Leicester considers himself evoked out of the sanctuary by these remarks. \"Mr. Rouncewell,\" he returns, \"do not mention it. Justifications are unnecessary, I hope, on either side.\"\n\"I am glad to hear it, Sir Leicester; and if I may, by way of a last word, revert to what I said before of my mother's long connexion with the family and the worth it bespeaks on both sides, I would point out this little instance here on my arm who shows herself so affectionate and faithful in parting and in whom my mother, I dare say, has done something to awaken such feelings--though of course Lady Dedlock, by her heartfelt interest and her genial condescension, has done much more.\"\nIf he mean this ironically, it may be truer than he thinks. He points it, however, by no deviation from his straightforward manner of speech, though in saying it he turns towards that part of the dim room where my Lady sits. Sir Leicester stands to return his parting salutation, Mr. Tulkinghorn again rings, Mercury takes another flight, and Mr. Rouncewell and Rosa leave the house.\nThen lights are brought in, discovering Mr. Tulkinghorn still standing in his window with his hands behind him and my Lady still sitting with his figure before her, closing up her view of the night as well as of the day. She is very pale. Mr. Tulkinghorn, observing it as she rises to retire, thinks, \"Well she may be! The power of this woman is astonishing. She has been acting a part the whole time.\" But he can act a part too--his one unchanging character--and as he holds the door open for this woman, fifty pairs of eyes, each fifty times sharper than Sir Leicester's pair, should find no flaw in him.\nLady Dedlock dines alone in her own room to-day. Sir Leicester is whipped in to the rescue of the Doodle Party and the discomfiture of the Coodle Faction. Lady Dedlock asks on sitting down to dinner, still deadly pale (and quite an illustration of the debilitated cousin's text), whether he is gone out? Yes. Whether Mr. Tulkinghorn is gone yet? No. Presently she asks again, is he gone YET? No. What is he doing? Mercury thinks he is writing letters in the library. Would my Lady wish to see him? Anything but that.\nBut he wishes to see my Lady. Within a few more minutes he is reported as sending his respects, and could my Lady please to receive him for a word or two after her dinner? My Lady will receive him now. He comes now, apologizing for intruding, even by her permission, while she is at table. When they are alone, my Lady waves her hand to dispense with such mockeries.\n\"What do you want, sir?\"\n\"Why, Lady Dedlock,\" says the lawyer, taking a chair at a little distance from her and slowly rubbing his rusty legs up and down, up and down, up and down, \"I am rather surprised by the course you have taken.\"\n\"Indeed?\"\n\"Yes, decidedly. I was not prepared for it. I consider it a departure from our agreement and your promise. It puts us in a new position, Lady Dedlock. I feel myself under the necessity of saying that I don't approve of it.\"\nHe stops in his rubbing and looks at her, with his hands on his knees. Imperturbable and unchangeable as he is, there is still an indefinable freedom in his manner which is new and which does not escape this woman's observation.\n\"I do not quite understand you.\"\n\"Oh, yes you do, I think. I think you do. Come, come, Lady Dedlock, we must not fence and parry now. You know you like this girl.\"\n\"Well, sir?\"\n\"And you know--and I know--that you have not sent her away for the reasons you have assigned, but for the purpose of separating her as much as possible from--excuse my mentioning it as a matter of business--any reproach and exposure that impend over yourself.\"\n\"Well, sir?\"\n\"Well, Lady Dedlock,\" returns the lawyer, crossing his legs and nursing the uppermost knee. \"I object to that. I consider that a dangerous proceeding. I know it to be unnecessary and calculated to awaken speculation, doubt, rumour, I don't know what, in the house. Besides, it is a violation of our agreement. You were to be exactly what you were before. Whereas, it must be evident to yourself, as it is to me, that you have been this evening very different from what you were before. Why, bless my soul, Lady Dedlock, transparently so!\"\n\"If, sir,\" she begins, \"in my knowledge of my secret--\" But he interrupts her.\n\"Now, Lady Dedlock, this is a matter of business, and in a matter of business the ground cannot be kept too clear. It is no longer your secret. Excuse me. That is just the mistake. It is my secret, in trust for Sir Leicester and the family. If it were your secret, Lady Dedlock, we should not be here holding this conversation.\"\n\"That is very true. If in my knowledge of THE secret I do what I can to spare an innocent girl (especially, remembering your own reference to her when you told my story to the assembled guests at Chesney Wold) from the taint of my impending shame, I act upon a resolution I have taken. Nothing in the world, and no one in the world, could shake it or could move me.\" This she says with great deliberation and distinctness and with no more outward passion than himself. As for him, he methodically discusses his matter of business as if she were any insensible instrument used in business.\n\"Really? Then you see, Lady Dedlock,\" he returns, \"you are not to be trusted. You have put the case in a perfectly plain way, and according to the literal fact; and that being the case, you are not to be trusted.\"\n\"Perhaps you may remember that I expressed some anxiety on this same point when we spoke at night at Chesney Wold?\"\n\"Yes,\" says Mr. Tulkinghorn, coolly getting up and standing on the hearth. \"Yes. I recollect, Lady Dedlock, that you certainly referred to the girl, but that was before we came to our arrangement, and both the letter and the spirit of our arrangement altogether precluded any action on your part founded upon my discovery. There can be no doubt about that. As to sparing the girl, of what importance or value is she? Spare! Lady Dedlock, here is a family name compromised. One might have supposed that the course was straight on--over everything, neither to the right nor to the left, regardless of all considerations in the way, sparing nothing, treading everything under foot.\"\nShe has been looking at the table. She lifts up her eyes and looks at him. There is a stern expression on her face and a part of her lower lip is compressed under her teeth. \"This woman understands me,\" Mr. Tulkinghorn thinks as she lets her glance fall again. \"SHE cannot be spared. Why should she spare others?\"\nFor a little while they are silent. Lady Dedlock has eaten no dinner, but has twice or thrice poured out water with a steady hand and drunk it. She rises from table, takes a lounging-chair, and reclines in it, shading her face. There is nothing in her manner to express weakness or excite compassion. It is thoughtful, gloomy, concentrated. \"This woman,\" thinks Mr. Tulkinghorn, standing on the hearth, again a dark object closing up her view, \"is a study.\"\nHe studies her at his leisure, not speaking for a time. She too studies something at her leisure. She is not the first to speak, appearing indeed so unlikely to be so, though he stood there until midnight, that even he is driven upon breaking silence.\n\"Lady Dedlock, the most disagreeable part of this business interview remains, but it is business. Our agreement is broken. A lady of your sense and strength of character will be prepared for my now declaring it void and taking my own course.\"\n\"I am quite prepared.\"\nMr. Tulkinghorn inclines his head. \"That is all I have to trouble you with, Lady Dedlock.\"\nShe stops him as he is moving out of the room by asking, \"This is the notice I was to receive? I wish not to misapprehend you.\"\n\"Not exactly the notice you were to receive, Lady Dedlock, because the contemplated notice supposed the agreement to have been observed. But virtually the same, virtually the same. The difference is merely in a lawyer's mind.\"\n\"You intend to give me no other notice?\"\n\"You are right. No.\"\n\"Do you contemplate undeceiving Sir Leicester to-night?\"\n\"A home question!\" says Mr. Tulkinghorn with a slight smile and cautiously shaking his head at the shaded face. \"No, not to-night.\"\n\"To-morrow?\"\n\"All things considered, I had better decline answering that question, Lady Dedlock. If I were to say I don't know when, exactly, you would not believe me, and it would answer no purpose. It may be to-morrow. I would rather say no more. You are prepared, and I hold out no expectations which circumstances might fail to justify. I wish you good evening.\"\nShe removes her hand, turns her pale face towards him as he walks silently to the door, and stops him once again as he is about to open it.\n\"Do you intend to remain in the house any time? I heard you were writing in the library. Are you going to return there?\"\n\"Only for my hat. I am going home.\"\nShe bows her eyes rather than her head, the movement is so slight and curious, and he withdraws. Clear of the room he looks at his watch but is inclined to doubt it by a minute or thereabouts. There is a splendid clock upon the staircase, famous, as splendid clocks not often are, for its accuracy. \"And what do YOU say,\" Mr. Tulkinghorn inquires, referring to it. \"What do you say?\"\nIf it said now, \"Don't go home!\" What a famous clock, hereafter, if it said to-night of all the nights that it has counted off, to this old man of all the young and old men who have ever stood before it, \"Don't go home!\" With its sharp clear bell it strikes three quarters after seven and ticks on again. \"Why, you are worse than I thought you,\" says Mr. Tulkinghorn, muttering reproof to his watch. \"Two minutes wrong? At this rate you won't last my time.\" What a watch to return good for evil if it ticked in answer, \"Don't go home!\"\nHe passes out into the streets and walks on, with his hands behind him, under the shadow of the lofty houses, many of whose mysteries, difficulties, mortgages, delicate affairs of all kinds, are treasured up within his old black satin waistcoat. He is in the confidence of the very bricks and mortar. The high chimney-stacks telegraph family secrets to him. Yet there is not a voice in a mile of them to whisper, \"Don't go home!\"\nThrough the stir and motion of the commoner streets; through the roar and jar of many vehicles, many feet, many voices; with the blazing shop-lights lighting him on, the west wind blowing him on, and the crowd pressing him on, he is pitilessly urged upon his way, and nothing meets him murmuring, \"Don't go home!\" Arrived at last in his dull room to light his candles, and look round and up, and see the Roman pointing from the ceiling, there is no new significance in the Roman's hand to-night or in the flutter of the attendant groups to give him the late warning, \"Don't come here!\"\nIt is a moonlight night, but the moon, being past the full, is only now rising over the great wilderness of London. The stars are shining as they shone above the turret-leads at Chesney Wold. This woman, as he has of late been so accustomed to call her, looks out upon them. Her soul is turbulent within her; she is sick at heart and restless. The large rooms are too cramped and close. She cannot endure their restraint and will walk alone in a neighbouring garden.\nToo capricious and imperious in all she does to be the cause of much surprise in those about her as to anything she does, this woman, loosely muffled, goes out into the moonlight. Mercury attends with the key. Having opened the garden-gate, he delivers the key into his Lady's hands at her request and is bidden to go back. She will walk there some time to ease her aching head. She may be an hour, she may be more. She needs no further escort. The gate shuts upon its spring with a clash, and he leaves her passing on into the dark shade of some trees.\nA fine night, and a bright large moon, and multitudes of stars. Mr. Tulkinghorn, in repairing to his cellar and in opening and shutting those resounding doors, has to cross a little prison-like yard. He looks up casually, thinking what a fine night, what a bright large moon, what multitudes of stars! A quiet night, too.\nA very quiet night. When the moon shines very brilliantly, a solitude and stillness seem to proceed from her that influence even crowded places full of life. Not only is it a still night on dusty high roads and on hill-summits, whence a wide expanse of country may be seen in repose, quieter and quieter as it spreads away into a fringe of trees against the sky with the grey ghost of a bloom upon them; not only is it a still night in gardens and in woods, and on the river where the water-meadows are fresh and green, and the stream sparkles on among pleasant islands, murmuring weirs, and whispering rushes; not only does the stillness attend it as it flows where houses cluster thick, where many bridges are reflected in it, where wharves and shipping make it black and awful, where it winds from these disfigurements through marshes whose grim beacons stand like skeletons washed ashore, where it expands through the bolder region of rising grounds, rich in cornfield wind-mill and steeple, and where it mingles with the ever-heaving sea; not only is it a still night on the deep, and on the shore where the watcher stands to see the ship with her spread wings cross the path of light that appears to be presented to only him; but even on this stranger's wilderness of London there is some rest. Its steeples and towers and its one great dome grow more ethereal; its smoky house-tops lose their grossness in the pale effulgence; the noises that arise from the streets are fewer and are softened, and the footsteps on the pavements pass more tranquilly away. In these fields of Mr. Tulkinghorn's inhabiting, where the shepherds play on Chancery pipes that have no stop, and keep their sheep in the fold by hook and by crook until they have shorn them exceeding close, every noise is merged, this moonlight night, into a distant ringing hum, as if the city were a vast glass, vibrating.\nWhat's that? Who fired a gun or pistol? Where was it?\nThe few foot-passengers start, stop, and stare about them. Some windows and doors are opened, and people come out to look. It was a loud report and echoed and rattled heavily. It shook one house, or so a man says who was passing. It has aroused all the dogs in the neighbourhood, who bark vehemently. Terrified cats scamper across the road. While the dogs are yet barking and howling--there is one dog howling like a demon--the church-clocks, as if they were startled too, begin to strike. The hum from the streets, likewise, seems to swell into a shout. But it is soon over. Before the last clock begins to strike ten, there is a lull. When it has ceased, the fine night, the bright large moon, and multitudes of stars, are left at peace again.\nHas Mr. Tulkinghorn been disturbed? His windows are dark and quiet, and his door is shut. It must be something unusual indeed to bring him out of his shell. Nothing is heard of him, nothing is seen of him. What power of cannon might it take to shake that rusty old man out of his immovable composure?\nFor many years the persistent Roman has been pointing, with no particular meaning, from that ceiling. It is not likely that he has any new meaning in him to-night. Once pointing, always pointing--like any Roman, or even Briton, with a single idea. There he is, no doubt, in his impossible attitude, pointing, unavailingly, all night long. Moonlight, darkness, dawn, sunrise, day. There he is still, eagerly pointing, and no one minds him.\nBut a little after the coming of the day come people to clean the rooms. And either the Roman has some new meaning in him, not expressed before, or the foremost of them goes wild, for looking up at his outstretched hand and looking down at what is below it, that person shrieks and flies. The others, looking in as the first one looked, shriek and fly too, and there is an alarm in the street.\nWhat does it mean? No light is admitted into the darkened chamber, and people unaccustomed to it enter, and treading softly but heavily, carry a weight into the bedroom and lay it down. There is whispering and wondering all day, strict search of every corner, careful tracing of steps, and careful noting of the disposition of every article of furniture. All eyes look up at the Roman, and all voices murmur, \"If he could only tell what he saw!\"\nHe is pointing at a table with a bottle (nearly full of wine) and a glass upon it and two candles that were blown out suddenly soon after being lighted. He is pointing at an empty chair and at a stain upon the ground before it that might be almost covered with a hand. These objects lie directly within his range. An excited imagination might suppose that there was something in them so terrific as to drive the rest of the composition, not only the attendant big-legged boys, but the clouds and flowers and pillars too--in short, the very body and soul of Allegory, and all the brains it has--stark mad. It happens surely that every one who comes into the darkened room and looks at these things looks up at the Roman and that he is invested in all eyes with mystery and awe, as if he were a paralysed dumb witness.\nSo it shall happen surely, through many years to come, that ghostly stories shall be told of the stain upon the floor, so easy to be covered, so hard to be got out, and that the Roman, pointing from the ceiling shall point, so long as dust and damp and spiders spare him, with far greater significance than he ever had in Mr. Tulkinghorn's time, and with a deadly meaning. For Mr. Tulkinghorn's time is over for evermore, and the Roman pointed at the murderous hand uplifted against his life, and pointed helplessly at him, from night to morning, lying face downward on the floor, shot through the heart.",
        "paragraph_chars": [
            [
                0,
                688
            ],
            [
                688,
                1500
            ],
            [
                1500,
                1906
            ],
            [
                1906,
                2055
            ],
            [
                2055,
                2804
            ],
            [
                2804,
                2812
            ],
            [
                2812,
                2921
            ],
            [
                2921,
                2952
            ],
            [
                2952,
                3015
            ],
            [
                3015,
                3267
            ],
            [
                3267,
                3338
            ],
            [
                3338,
                3493
            ],
            [
                3493,
                3575
            ],
            [
                3575,
                3645
            ],
            [
                3645,
                3743
            ],
            [
                3743,
                3931
            ],
            [
                3931,
                4021
            ],
            [
                4021,
                4045
            ],
            [
                4045,
                4189
            ],
            [
                4189,
                4339
            ],
            [
                4339,
                4371
            ],
            [
                4371,
                4396
            ],
            [
                4396,
                4574
            ],
            [
                4574,
                5015
            ],
            [
                5015,
                5196
            ],
            [
                5196,
                5270
            ],
            [
                5270,
                5361
            ],
            [
                5361,
                5366
            ],
            [
                5366,
                5469
            ],
            [
                5469,
                5736
            ],
            [
                5736,
                6096
            ],
            [
                6096,
                6304
            ],
            [
                6304,
                6357
            ],
            [
                6357,
                6404
            ],
            [
                6404,
                6487
            ],
            [
                6487,
                6551
            ],
            [
                6551,
                6970
            ],
            [
                6970,
                8151
            ],
            [
                8151,
                8417
            ],
            [
                8417,
                8477
            ],
            [
                8477,
                8646
            ],
            [
                8646,
                8725
            ],
            [
                8725,
                8805
            ],
            [
                8805,
                8992
            ],
            [
                8992,
                9125
            ],
            [
                9125,
                9355
            ],
            [
                9355,
                9488
            ],
            [
                9488,
                9751
            ],
            [
                9751,
                9906
            ],
            [
                9906,
                10008
            ],
            [
                10008,
                10226
            ],
            [
                10226,
                10241
            ],
            [
                10241,
                10264
            ],
            [
                10264,
                10492
            ],
            [
                10492,
                10519
            ],
            [
                10519,
                10790
            ],
            [
                10790,
                11030
            ],
            [
                11030,
                11123
            ],
            [
                11123,
                11153
            ],
            [
                11153,
                11387
            ],
            [
                11387,
                11454
            ],
            [
                11454,
                11480
            ],
            [
                11480,
                12494
            ],
            [
                12494,
                12841
            ],
            [
                12841,
                13087
            ],
            [
                13087,
                13480
            ],
            [
                13480,
                13697
            ],
            [
                13697,
                14118
            ],
            [
                14118,
                14159
            ],
            [
                14159,
                14175
            ],
            [
                14175,
                14302
            ],
            [
                14302,
                14441
            ],
            [
                14441,
                14479
            ],
            [
                14479,
                14787
            ],
            [
                14787,
                14957
            ],
            [
                14957,
                15145
            ],
            [
                15145,
                15287
            ],
            [
                15287,
                15567
            ],
            [
                15567,
                15616
            ],
            [
                15616,
                16300
            ],
            [
                16300,
                17044
            ],
            [
                17044,
                17229
            ],
            [
                17229,
                17719
            ],
            [
                17719,
                18103
            ],
            [
                18103,
                18710
            ],
            [
                18710,
                19227
            ],
            [
                19227,
                19594
            ],
            [
                19594,
                19619
            ],
            [
                19619,
                19829
            ],
            [
                19829,
                19839
            ],
            [
                19839,
                20063
            ],
            [
                20063,
                20292
            ],
            [
                20292,
                20325
            ],
            [
                20325,
                20456
            ],
            [
                20456,
                20469
            ],
            [
                20469,
                20730
            ],
            [
                20730,
                20743
            ],
            [
                20743,
                21282
            ],
            [
                21282,
                21361
            ],
            [
                21361,
                21690
            ],
            [
                21690,
                22279
            ],
            [
                22279,
                22493
            ],
            [
                22493,
                22609
            ],
            [
                22609,
                23289
            ],
            [
                23289,
                23603
            ],
            [
                23603,
                24061
            ],
            [
                24061,
                24313
            ],
            [
                24313,
                24556
            ],
            [
                24556,
                24579
            ],
            [
                24579,
                24670
            ],
            [
                24670,
                24798
            ],
            [
                24798,
                25025
            ],
            [
                25025,
                25066
            ],
            [
                25066,
                25087
            ],
            [
                25087,
                25144
            ],
            [
                25144,
                25276
            ],
            [
                25276,
                25289
            ],
            [
                25289,
                25643
            ],
            [
                25643,
                25783
            ],
            [
                25783,
                25904
            ],
            [
                25904,
                25940
            ],
            [
                25940,
                26324
            ],
            [
                26324,
                26860
            ],
            [
                26860,
                27290
            ],
            [
                27290,
                27876
            ],
            [
                27876,
                28343
            ],
            [
                28343,
                28897
            ],
            [
                28897,
                29219
            ],
            [
                29219,
                31109
            ],
            [
                31109,
                31163
            ],
            [
                31163,
                31909
            ],
            [
                31909,
                32210
            ],
            [
                32210,
                32649
            ],
            [
                32649,
                33043
            ],
            [
                33043,
                33489
            ],
            [
                33489,
                34306
            ],
            [
                34306,
                34910
            ]
        ],
        "segment_chars": [
            [
                0,
                88
            ],
            [
                88,
                258
            ],
            [
                258,
                538
            ],
            [
                538,
                688
            ],
            [
                688,
                849
            ],
            [
                849,
                921
            ],
            [
                921,
                1228
            ],
            [
                1228,
                1302
            ],
            [
                1302,
                1500
            ],
            [
                1500,
                1545
            ],
            [
                1545,
                1733
            ],
            [
                1733,
                1823
            ],
            [
                1823,
                1906
            ],
            [
                1906,
                2005
            ],
            [
                2005,
                2055
            ],
            [
                2055,
                2128
            ],
            [
                2128,
                2283
            ],
            [
                2283,
                2363
            ],
            [
                2363,
                2486
            ],
            [
                2486,
                2577
            ],
            [
                2577,
                2643
            ],
            [
                2643,
                2773
            ],
            [
                2773,
                2804
            ],
            [
                2804,
                2812
            ],
            [
                2812,
                2855
            ],
            [
                2855,
                2921
            ],
            [
                2921,
                2939
            ],
            [
                2939,
                2952
            ],
            [
                2952,
                2957
            ],
            [
                2957,
                3015
            ],
            [
                3015,
                3124
            ],
            [
                3124,
                3194
            ],
            [
                3194,
                3216
            ],
            [
                3216,
                3267
            ],
            [
                3267,
                3338
            ],
            [
                3338,
                3493
            ],
            [
                3493,
                3508
            ],
            [
                3508,
                3521
            ],
            [
                3521,
                3575
            ],
            [
                3575,
                3620
            ],
            [
                3620,
                3645
            ],
            [
                3645,
                3743
            ],
            [
                3743,
                3801
            ],
            [
                3801,
                3931
            ],
            [
                3931,
                3979
            ],
            [
                3979,
                4021
            ],
            [
                4021,
                4045
            ],
            [
                4045,
                4152
            ],
            [
                4152,
                4189
            ],
            [
                4189,
                4224
            ],
            [
                4224,
                4235
            ],
            [
                4235,
                4339
            ],
            [
                4339,
                4349
            ],
            [
                4349,
                4371
            ],
            [
                4371,
                4384
            ],
            [
                4384,
                4396
            ],
            [
                4396,
                4448
            ],
            [
                4448,
                4574
            ],
            [
                4574,
                4697
            ],
            [
                4697,
                4707
            ],
            [
                4707,
                4842
            ],
            [
                4842,
                4868
            ],
            [
                4868,
                4906
            ],
            [
                4906,
                4978
            ],
            [
                4978,
                5015
            ],
            [
                5015,
                5132
            ],
            [
                5132,
                5196
            ],
            [
                5196,
                5247
            ],
            [
                5247,
                5270
            ],
            [
                5270,
                5361
            ],
            [
                5361,
                5366
            ],
            [
                5366,
                5415
            ],
            [
                5415,
                5440
            ],
            [
                5440,
                5469
            ],
            [
                5469,
                5541
            ],
            [
                5541,
                5553
            ],
            [
                5553,
                5642
            ],
            [
                5642,
                5681
            ],
            [
                5681,
                5736
            ],
            [
                5736,
                5812
            ],
            [
                5812,
                5921
            ],
            [
                5921,
                6096
            ],
            [
                6096,
                6172
            ],
            [
                6172,
                6242
            ],
            [
                6242,
                6304
            ],
            [
                6304,
                6357
            ],
            [
                6357,
                6370
            ],
            [
                6370,
                6382
            ],
            [
                6382,
                6404
            ],
            [
                6404,
                6420
            ],
            [
                6420,
                6442
            ],
            [
                6442,
                6487
            ],
            [
                6487,
                6521
            ],
            [
                6521,
                6551
            ],
            [
                6551,
                6696
            ],
            [
                6696,
                6803
            ],
            [
                6803,
                6937
            ],
            [
                6937,
                6970
            ],
            [
                6970,
                7223
            ],
            [
                7223,
                7530
            ],
            [
                7530,
                7722
            ],
            [
                7722,
                7927
            ],
            [
                7927,
                8151
            ],
            [
                8151,
                8289
            ],
            [
                8289,
                8417
            ],
            [
                8417,
                8455
            ],
            [
                8455,
                8477
            ],
            [
                8477,
                8610
            ],
            [
                8610,
                8646
            ],
            [
                8646,
                8675
            ],
            [
                8675,
                8725
            ],
            [
                8725,
                8769
            ],
            [
                8769,
                8805
            ],
            [
                8805,
                8846
            ],
            [
                8846,
                8857
            ],
            [
                8857,
                8992
            ],
            [
                8992,
                9066
            ],
            [
                9066,
                9125
            ],
            [
                9125,
                9163
            ],
            [
                9163,
                9174
            ],
            [
                9174,
                9207
            ],
            [
                9207,
                9349
            ],
            [
                9349,
                9355
            ],
            [
                9355,
                9488
            ],
            [
                9488,
                9608
            ],
            [
                9608,
                9751
            ],
            [
                9751,
                9906
            ],
            [
                9906,
                10008
            ],
            [
                10008,
                10164
            ],
            [
                10164,
                10226
            ],
            [
                10226,
                10241
            ],
            [
                10241,
                10246
            ],
            [
                10246,
                10264
            ],
            [
                10264,
                10319
            ],
            [
                10319,
                10332
            ],
            [
                10332,
                10405
            ],
            [
                10405,
                10477
            ],
            [
                10477,
                10492
            ],
            [
                10492,
                10519
            ],
            [
                10519,
                10578
            ],
            [
                10578,
                10590
            ],
            [
                10590,
                10608
            ],
            [
                10608,
                10742
            ],
            [
                10742,
                10790
            ],
            [
                10790,
                10908
            ],
            [
                10908,
                11030
            ],
            [
                11030,
                11123
            ],
            [
                11123,
                11153
            ],
            [
                11153,
                11387
            ],
            [
                11387,
                11432
            ],
            [
                11432,
                11454
            ],
            [
                11454,
                11480
            ],
            [
                11480,
                11629
            ],
            [
                11629,
                12089
            ],
            [
                12089,
                12392
            ],
            [
                12392,
                12431
            ],
            [
                12431,
                12457
            ],
            [
                12457,
                12494
            ],
            [
                12494,
                12557
            ],
            [
                12557,
                12592
            ],
            [
                12592,
                12627
            ],
            [
                12627,
                12670
            ],
            [
                12670,
                12841
            ],
            [
                12841,
                12891
            ],
            [
                12891,
                12895
            ],
            [
                12895,
                13087
            ],
            [
                13087,
                13242
            ],
            [
                13242,
                13480
            ],
            [
                13480,
                13539
            ],
            [
                13539,
                13633
            ],
            [
                13633,
                13666
            ],
            [
                13666,
                13697
            ],
            [
                13697,
                13873
            ],
            [
                13873,
                13978
            ],
            [
                13978,
                13998
            ],
            [
                13998,
                14118
            ],
            [
                14118,
                14159
            ],
            [
                14159,
                14175
            ],
            [
                14175,
                14302
            ],
            [
                14302,
                14391
            ],
            [
                14391,
                14441
            ],
            [
                14441,
                14479
            ],
            [
                14479,
                14511
            ],
            [
                14511,
                14577
            ],
            [
                14577,
                14599
            ],
            [
                14599,
                14611
            ],
            [
                14611,
                14663
            ],
            [
                14663,
                14787
            ],
            [
                14787,
                14832
            ],
            [
                14832,
                14957
            ],
            [
                14957,
                15063
            ],
            [
                15063,
                15145
            ],
            [
                15145,
                15287
            ],
            [
                15287,
                15500
            ],
            [
                15500,
                15567
            ],
            [
                15567,
                15616
            ],
            [
                15616,
                15793
            ],
            [
                15793,
                15823
            ],
            [
                15823,
                15893
            ],
            [
                15893,
                15934
            ],
            [
                15934,
                16012
            ],
            [
                16012,
                16033
            ],
            [
                16033,
                16043
            ],
            [
                16043,
                16160
            ],
            [
                16160,
                16300
            ],
            [
                16300,
                16510
            ],
            [
                16510,
                16617
            ],
            [
                16617,
                16786
            ],
            [
                16786,
                16973
            ],
            [
                16973,
                17044
            ],
            [
                17044,
                17122
            ],
            [
                17122,
                17172
            ],
            [
                17172,
                17229
            ],
            [
                17229,
                17719
            ],
            [
                17719,
                17779
            ],
            [
                17779,
                17944
            ],
            [
                17944,
                18103
            ],
            [
                18103,
                18324
            ],
            [
                18324,
                18342
            ],
            [
                18342,
                18422
            ],
            [
                18422,
                18462
            ],
            [
                18462,
                18506
            ],
            [
                18506,
                18710
            ],
            [
                18710,
                18759
            ],
            [
                18759,
                18865
            ],
            [
                18865,
                19014
            ],
            [
                19014,
                19019
            ],
            [
                19019,
                19056
            ],
            [
                19056,
                19060
            ],
            [
                19060,
                19102
            ],
            [
                19102,
                19106
            ],
            [
                19106,
                19124
            ],
            [
                19124,
                19177
            ],
            [
                19177,
                19208
            ],
            [
                19208,
                19227
            ],
            [
                19227,
                19257
            ],
            [
                19257,
                19399
            ],
            [
                19399,
                19429
            ],
            [
                19429,
                19517
            ],
            [
                19517,
                19594
            ],
            [
                19594,
                19619
            ],
            [
                19619,
                19829
            ],
            [
                19829,
                19839
            ],
            [
                19839,
                19856
            ],
            [
                19856,
                19883
            ],
            [
                19883,
                19946
            ],
            [
                19946,
                19990
            ],
            [
                19990,
                20063
            ],
            [
                20063,
                20134
            ],
            [
                20134,
                20292
            ],
            [
                20292,
                20325
            ],
            [
                20325,
                20351
            ],
            [
                20351,
                20367
            ],
            [
                20367,
                20426
            ],
            [
                20426,
                20456
            ],
            [
                20456,
                20469
            ],
            [
                20469,
                20730
            ],
            [
                20730,
                20743
            ],
            [
                20743,
                20835
            ],
            [
                20835,
                20854
            ],
            [
                20854,
                20894
            ],
            [
                20894,
                21008
            ],
            [
                21008,
                21053
            ],
            [
                21053,
                21098
            ],
            [
                21098,
                21229
            ],
            [
                21229,
                21282
            ],
            [
                21282,
                21361
            ],
            [
                21361,
                21476
            ],
            [
                21476,
                21505
            ],
            [
                21505,
                21516
            ],
            [
                21516,
                21542
            ],
            [
                21542,
                21602
            ],
            [
                21602,
                21690
            ],
            [
                21690,
                21710
            ],
            [
                21710,
                21976
            ],
            [
                21976,
                22057
            ],
            [
                22057,
                22159
            ],
            [
                22159,
                22279
            ],
            [
                22279,
                22288
            ],
            [
                22288,
                22357
            ],
            [
                22357,
                22493
            ],
            [
                22493,
                22609
            ],
            [
                22609,
                22684
            ],
            [
                22684,
                22690
            ],
            [
                22690,
                22932
            ],
            [
                22932,
                22966
            ],
            [
                22966,
                23026
            ],
            [
                23026,
                23033
            ],
            [
                23033,
                23082
            ],
            [
                23082,
                23289
            ],
            [
                23289,
                23324
            ],
            [
                23324,
                23364
            ],
            [
                23364,
                23463
            ],
            [
                23463,
                23550
            ],
            [
                23550,
                23573
            ],
            [
                23573,
                23603
            ],
            [
                23603,
                23639
            ],
            [
                23639,
                23747
            ],
            [
                23747,
                23831
            ],
            [
                23831,
                23904
            ],
            [
                23904,
                23944
            ],
            [
                23944,
                24061
            ],
            [
                24061,
                24117
            ],
            [
                24117,
                24159
            ],
            [
                24159,
                24313
            ],
            [
                24313,
                24411
            ],
            [
                24411,
                24436
            ],
            [
                24436,
                24556
            ],
            [
                24556,
                24579
            ],
            [
                24579,
                24614
            ],
            [
                24614,
                24670
            ],
            [
                24670,
                24765
            ],
            [
                24765,
                24798
            ],
            [
                24798,
                24935
            ],
            [
                24935,
                24979
            ],
            [
                24979,
                25025
            ],
            [
                25025,
                25066
            ],
            [
                25066,
                25082
            ],
            [
                25082,
                25087
            ],
            [
                25087,
                25144
            ],
            [
                25144,
                25163
            ],
            [
                25163,
                25256
            ],
            [
                25256,
                25276
            ],
            [
                25276,
                25289
            ],
            [
                25289,
                25373
            ],
            [
                25373,
                25476
            ],
            [
                25476,
                25497
            ],
            [
                25497,
                25525
            ],
            [
                25525,
                25617
            ],
            [
                25617,
                25643
            ],
            [
                25643,
                25783
            ],
            [
                25783,
                25831
            ],
            [
                25831,
                25872
            ],
            [
                25872,
                25904
            ],
            [
                25904,
                25922
            ],
            [
                25922,
                25940
            ],
            [
                25940,
                26037
            ],
            [
                26037,
                26133
            ],
            [
                26133,
                26239
            ],
            [
                26239,
                26305
            ],
            [
                26305,
                26324
            ],
            [
                26324,
                26357
            ],
            [
                26357,
                26545
            ],
            [
                26545,
                26629
            ],
            [
                26629,
                26724
            ],
            [
                26724,
                26744
            ],
            [
                26744,
                26782
            ],
            [
                26782,
                26860
            ],
            [
                26860,
                27106
            ],
            [
                27106,
                27161
            ],
            [
                27161,
                27218
            ],
            [
                27218,
                27290
            ],
            [
                27290,
                27604
            ],
            [
                27604,
                27876
            ],
            [
                27876,
                27992
            ],
            [
                27992,
                28068
            ],
            [
                28068,
                28151
            ],
            [
                28151,
                28220
            ],
            [
                28220,
                28263
            ],
            [
                28263,
                28343
            ],
            [
                28343,
                28523
            ],
            [
                28523,
                28553
            ],
            [
                28553,
                28667
            ],
            [
                28667,
                28722
            ],
            [
                28722,
                28759
            ],
            [
                28759,
                28788
            ],
            [
                28788,
                28897
            ],
            [
                28897,
                28961
            ],
            [
                28961,
                29097
            ],
            [
                29097,
                29199
            ],
            [
                29199,
                29219
            ],
            [
                29219,
                29239
            ],
            [
                29239,
                29377
            ],
            [
                29377,
                30520
            ],
            [
                30520,
                30782
            ],
            [
                30782,
                31109
            ],
            [
                31109,
                31122
            ],
            [
                31122,
                31149
            ],
            [
                31149,
                31163
            ],
            [
                31163,
                31222
            ],
            [
                31222,
                31286
            ],
            [
                31286,
                31339
            ],
            [
                31339,
                31393
            ],
            [
                31393,
                31464
            ],
            [
                31464,
                31504
            ],
            [
                31504,
                31653
            ],
            [
                31653,
                31718
            ],
            [
                31718,
                31739
            ],
            [
                31739,
                31800
            ],
            [
                31800,
                31909
            ],
            [
                31909,
                31945
            ],
            [
                31945,
                31999
            ],
            [
                31999,
                32066
            ],
            [
                32066,
                32115
            ],
            [
                32115,
                32210
            ],
            [
                32210,
                32312
            ],
            [
                32312,
                32374
            ],
            [
                32374,
                32458
            ],
            [
                32458,
                32549
            ],
            [
                32549,
                32590
            ],
            [
                32590,
                32649
            ],
            [
                32649,
                32722
            ],
            [
                32722,
                32938
            ],
            [
                32938,
                33043
            ],
            [
                33043,
                33062
            ],
            [
                33062,
                33229
            ],
            [
                33229,
                33398
            ],
            [
                33398,
                33489
            ],
            [
                33489,
                33642
            ],
            [
                33642,
                33758
            ],
            [
                33758,
                33803
            ],
            [
                33803,
                34094
            ],
            [
                34094,
                34306
            ],
            [
                34306,
                34679
            ],
            [
                34679,
                34910
            ]
        ],
        "overlap_chars": [
            [
                0,
                88
            ],
            [
                88,
                157
            ],
            [
                256,
                258
            ],
            [
                258,
                309
            ],
            [
                320,
                380
            ],
            [
                473,
                538
            ],
            [
                538,
                559
            ],
            [
                572,
                600
            ],
            [
                602,
                618
            ],
            [
                686,
                688
            ],
            [
                688,
                749
            ],
            [
                832,
                849
            ],
            [
                849,
                881
            ],
            [
                898,
                921
            ],
            [
                1055,
                1119
            ],
            [
                1053,
                1054
            ],
            [
                1120,
                1172
            ],
            [
                1206,
                1228
            ],
            [
                1228,
                1236
            ],
            [
                1244,
                1301
            ],
            [
                1500,
                1528
            ],
            [
                1543,
                1545
            ],
            [
                1545,
                1552
            ],
            [
                1563,
                1594
            ],
            [
                1674,
                1733
            ],
            [
                1733,
                1823
            ],
            [
                1823,
                1906
            ],
            [
                1906,
                1953
            ],
            [
                1959,
                2005
            ],
            [
                2005,
                2023
            ],
            [
                2053,
                2055
            ],
            [
                2055,
                2060
            ],
            [
                2089,
                2098
            ],
            [
                2126,
                2128
            ],
            [
                2128,
                2131
            ],
            [
                2141,
                2170
            ],
            [
                2177,
                2224
            ],
            [
                2225,
                2230
            ],
            [
                2256,
                2283
            ],
            [
                2363,
                2411
            ],
            [
                2440,
                2486
            ],
            [
                2486,
                2577
            ],
            [
                2577,
                2606
            ],
            [
                2627,
                2643
            ],
            [
                2643,
                2678
            ],
            [
                2704,
                2709
            ],
            [
                2741,
                2772
            ],
            [
                2804,
                2812
            ],
            [
                2812,
                2855
            ],
            [
                2855,
                2921
            ],
            [
                2921,
                2922
            ],
            [
                2939,
                2941
            ],
            [
                2929,
                2937
            ],
            [
                2945,
                2952
            ],
            [
                2952,
                2957
            ],
            [
                2957,
                2960
            ],
            [
                2989,
                3015
            ],
            [
                3015,
                3124
            ],
            [
                3216,
                3230
            ],
            [
                3239,
                3267
            ],
            [
                3291,
                3299
            ],
            [
                3307,
                3314
            ],
            [
                3319,
                3338
            ],
            [
                3338,
                3375
            ],
            [
                3418,
                3419
            ],
            [
                3438,
                3482
            ],
            [
                3490,
                3493
            ],
            [
                3493,
                3508
            ],
            [
                3508,
                3521
            ],
            [
                3521,
                3524
            ],
            [
                3530,
                3575
            ],
            [
                3575,
                3579
            ],
            [
                3586,
                3591
            ],
            [
                3618,
                3620
            ],
            [
                3632,
                3645
            ],
            [
                3645,
                3677
            ],
            [
                3679,
                3697
            ],
            [
                3699,
                3716
            ],
            [
                3741,
                3743
            ],
            [
                3743,
                3801
            ],
            [
                3801,
                3815
            ],
            [
                3887,
                3889
            ],
            [
                3858,
                3860
            ],
            [
                3894,
                3902
            ],
            [
                3909,
                3931
            ],
            [
                3931,
                3953
            ],
            [
                3977,
                3979
            ],
            [
                4002,
                4003
            ],
            [
                4004,
                4021
            ],
            [
                4021,
                4045
            ],
            [
                4045,
                4152
            ],
            [
                4152,
                4189
            ],
            [
                4189,
                4210
            ],
            [
                4217,
                4224
            ],
            [
                4224,
                4235
            ],
            [
                4253,
                4277
            ],
            [
                4290,
                4302
            ],
            [
                4314,
                4339
            ],
            [
                4339,
                4349
            ],
            [
                4349,
                4371
            ],
            [
                4371,
                4384
            ],
            [
                4384,
                4396
            ],
            [
                4396,
                4448
            ],
            [
                4448,
                4455
            ],
            [
                4514,
                4574
            ],
            [
                4574,
                4662
            ],
            [
                4695,
                4697
            ],
            [
                4697,
                4707
            ],
            [
                4707,
                4776
            ],
            [
                4787,
                4789
            ],
            [
                4790,
                4842
            ],
            [
                4868,
                4874
            ],
            [
                4886,
                4904
            ],
            [
                4904,
                4906
            ],
            [
                4906,
                4969
            ],
            [
                4976,
                4978
            ],
            [
                4978,
                5015
            ],
            [
                5015,
                5087
            ],
            [
                5107,
                5132
            ],
            [
                5132,
                5168
            ],
            [
                5194,
                5196
            ],
            [
                5196,
                5197
            ],
            [
                5202,
                5217
            ],
            [
                5245,
                5247
            ],
            [
                5247,
                5270
            ],
            [
                5270,
                5308
            ],
            [
                5336,
                5361
            ],
            [
                5361,
                5366
            ],
            [
                5415,
                5419
            ],
            [
                5440,
                5469
            ],
            [
                5469,
                5541
            ],
            [
                5541,
                5553
            ],
            [
                5553,
                5598
            ],
            [
                5600,
                5619
            ],
            [
                5620,
                5634
            ],
            [
                5640,
                5642
            ],
            [
                5642,
                5679
            ],
            [
                5703,
                5704
            ],
            [
                5692,
                5703
            ],
            [
                5733,
                5736
            ],
            [
                5736,
                5739
            ],
            [
                5795,
                5812
            ],
            [
                5812,
                5920
            ],
            [
                6120,
                6132
            ],
            [
                6104,
                6107
            ],
            [
                6170,
                6172
            ],
            [
                6172,
                6217
            ],
            [
                6226,
                6242
            ],
            [
                6242,
                6304
            ],
            [
                6304,
                6333
            ],
            [
                6335,
                6357
            ],
            [
                6357,
                6370
            ],
            [
                6382,
                6403
            ],
            [
                6404,
                6420
            ],
            [
                6420,
                6441
            ],
            [
                6487,
                6521
            ],
            [
                6521,
                6551
            ],
            [
                6551,
                6668
            ],
            [
                6694,
                6696
            ],
            [
                6696,
                6711
            ],
            [
                6771,
                6803
            ],
            [
                6803,
                6860
            ],
            [
                6865,
                6936
            ],
            [
                7619,
                7625
            ],
            [
                7702,
                7708
            ],
            [
                7658,
                7659
            ],
            [
                7887,
                7888
            ],
            [
                7542,
                7562
            ],
            [
                7563,
                7604
            ],
            [
                7625,
                7630
            ],
            [
                7722,
                7761
            ],
            [
                7889,
                7925
            ],
            [
                7925,
                7927
            ],
            [
                8151,
                8196
            ],
            [
                8219,
                8289
            ],
            [
                8289,
                8296
            ],
            [
                8307,
                8382
            ],
            [
                8395,
                8417
            ],
            [
                8417,
                8455
            ],
            [
                8455,
                8477
            ],
            [
                8477,
                8610
            ],
            [
                8610,
                8643
            ],
            [
                8769,
                8805
            ],
            [
                8876,
                8885
            ],
            [
                8926,
                8929
            ],
            [
                8943,
                8992
            ],
            [
                9039,
                9040
            ],
            [
                9066,
                9088
            ],
            [
                9061,
                9064
            ],
            [
                9113,
                9125
            ],
            [
                9125,
                9163
            ],
            [
                9163,
                9174
            ],
            [
                9207,
                9214
            ],
            [
                9317,
                9349
            ],
            [
                9349,
                9355
            ],
            [
                9355,
                9488
            ],
            [
                9488,
                9521
            ],
            [
                9542,
                9545
            ],
            [
                9564,
                9608
            ],
            [
                9608,
                9669
            ],
            [
                9731,
                9751
            ],
            [
                9751,
                9906
            ],
            [
                10008,
                10053
            ],
            [
                10101,
                10154
            ],
            [
                10161,
                10163
            ],
            [
                10226,
                10241
            ],
            [
                10246,
                10264
            ],
            [
                10264,
                10283
            ],
            [
                10291,
                10300
            ],
            [
                10286,
                10289
            ],
            [
                10317,
                10318
            ],
            [
                10492,
                10519
            ],
            [
                10519,
                10520
            ],
            [
                10533,
                10543
            ],
            [
                10580,
                10588
            ],
            [
                11030,
                11123
            ],
            [
                11123,
                11153
            ],
            [
                11153,
                11222
            ],
            [
                11255,
                11268
            ],
            [
                11274,
                11276
            ],
            [
                11291,
                11384
            ],
            [
                11460,
                11480
            ],
            [
                11480,
                11619
            ],
            [
                11627,
                11629
            ],
            [
                11634,
                11636
            ],
            [
                11761,
                11801
            ],
            [
                11813,
                11850
            ],
            [
                11895,
                11908
            ],
            [
                11997,
                12002
            ],
            [
                11921,
                11931
            ],
            [
                12087,
                12089
            ],
            [
                12115,
                12121
            ],
            [
                12089,
                12092
            ],
            [
                12127,
                12159
            ],
            [
                12165,
                12175
            ],
            [
                12198,
                12216
            ],
            [
                12343,
                12392
            ],
            [
                12392,
                12429
            ],
            [
                12494,
                12540
            ],
            [
                12555,
                12557
            ],
            [
                12627,
                12670
            ],
            [
                12673,
                12676
            ],
            [
                12750,
                12841
            ],
            [
                12841,
                12891
            ],
            [
                12891,
                12895
            ],
            [
                12895,
                12908
            ],
            [
                12921,
                12928
            ],
            [
                12939,
                12943
            ],
            [
                13085,
                13087
            ],
            [
                13087,
                13148
            ],
            [
                13195,
                13225
            ],
            [
                13240,
                13242
            ],
            [
                13242,
                13367
            ],
            [
                13389,
                13408
            ],
            [
                13410,
                13446
            ],
            [
                13448,
                13480
            ],
            [
                13636,
                13666
            ],
            [
                13666,
                13697
            ],
            [
                13697,
                13698
            ],
            [
                13978,
                13996
            ],
            [
                13800,
                13802
            ],
            [
                13803,
                13825
            ],
            [
                13996,
                13998
            ],
            [
                14089,
                14090
            ],
            [
                13998,
                14089
            ],
            [
                14115,
                14118
            ],
            [
                14175,
                14176
            ],
            [
                14178,
                14258
            ],
            [
                14299,
                14302
            ],
            [
                14391,
                14441
            ],
            [
                14441,
                14479
            ],
            [
                14479,
                14511
            ],
            [
                14511,
                14577
            ],
            [
                14577,
                14599
            ],
            [
                14599,
                14611
            ],
            [
                14759,
                14762
            ],
            [
                14726,
                14728
            ],
            [
                14785,
                14787
            ],
            [
                14787,
                14814
            ],
            [
                14819,
                14832
            ],
            [
                14832,
                14882
            ],
            [
                14905,
                14908
            ],
            [
                14883,
                14903
            ],
            [
                14955,
                14957
            ],
            [
                14957,
                15063
            ],
            [
                15063,
                15145
            ],
            [
                15145,
                15193
            ],
            [
                15248,
                15287
            ],
            [
                15287,
                15367
            ],
            [
                15381,
                15500
            ],
            [
                15500,
                15567
            ],
            [
                15567,
                15616
            ],
            [
                15616,
                15714
            ],
            [
                15748,
                15792
            ],
            [
                15793,
                15823
            ],
            [
                15823,
                15843
            ],
            [
                15873,
                15893
            ],
            [
                15893,
                15933
            ],
            [
                15934,
                16012
            ],
            [
                16012,
                16033
            ],
            [
                16033,
                16043
            ],
            [
                16160,
                16300
            ],
            [
                16300,
                16353
            ],
            [
                16384,
                16387
            ],
            [
                16510,
                16617
            ],
            [
                16620,
                16621
            ],
            [
                16663,
                16667
            ],
            [
                16676,
                16777
            ],
            [
                16784,
                16786
            ],
            [
                16973,
                17044
            ],
            [
                17944,
                17997
            ],
            [
                18056,
                18103
            ],
            [
                18103,
                18266
            ],
            [
                18322,
                18324
            ],
            [
                18324,
                18342
            ],
            [
                18342,
                18357
            ],
            [
                18396,
                18405
            ],
            [
                18422,
                18462
            ],
            [
                18462,
                18506
            ],
            [
                18506,
                18531
            ],
            [
                18533,
                18561
            ],
            [
                18563,
                18596
            ],
            [
                18607,
                18628
            ],
            [
                18682,
                18710
            ],
            [
                18710,
                18741
            ],
            [
                18746,
                18750
            ],
            [
                18757,
                18759
            ],
            [
                18759,
                18772
            ],
            [
                18863,
                18865
            ],
            [
                18878,
                18882
            ],
            [
                18908,
                18927
            ],
            [
                18990,
                19014
            ],
            [
                19014,
                19019
            ],
            [
                19019,
                19056
            ],
            [
                19056,
                19060
            ],
            [
                19060,
                19102
            ],
            [
                19102,
                19106
            ],
            [
                19106,
                19124
            ],
            [
                19132,
                19177
            ],
            [
                19177,
                19208
            ],
            [
                19208,
                19227
            ],
            [
                19227,
                19257
            ],
            [
                19257,
                19285
            ],
            [
                19309,
                19340
            ],
            [
                19351,
                19380
            ],
            [
                19397,
                19399
            ],
            [
                19429,
                19437
            ],
            [
                19443,
                19468
            ],
            [
                19515,
                19517
            ],
            [
                19517,
                19594
            ],
            [
                19594,
                19619
            ],
            [
                19619,
                19671
            ],
            [
                19773,
                19829
            ],
            [
                19829,
                19839
            ],
            [
                19839,
                19856
            ],
            [
                19856,
                19883
            ],
            [
                19883,
                19946
            ],
            [
                19946,
                19990
            ],
            [
                19990,
                20063
            ],
            [
                20063,
                20065
            ],
            [
                20091,
                20134
            ],
            [
                20134,
                20143
            ],
            [
                20160,
                20265
            ],
            [
                20279,
                20292
            ],
            [
                20292,
                20325
            ],
            [
                20325,
                20329
            ],
            [
                20351,
                20367
            ],
            [
                20367,
                20404
            ],
            [
                20415,
                20426
            ],
            [
                20426,
                20456
            ],
            [
                20456,
                20469
            ],
            [
                20469,
                20482
            ],
            [
                20484,
                20494
            ],
            [
                20496,
                20547
            ],
            [
                20561,
                20566
            ],
            [
                20597,
                20600
            ],
            [
                20621,
                20625
            ],
            [
                20676,
                20706
            ],
            [
                20714,
                20730
            ],
            [
                20730,
                20743
            ],
            [
                20743,
                20802
            ],
            [
                20835,
                20854
            ],
            [
                20854,
                20892
            ],
            [
                20973,
                20974
            ],
            [
                20926,
                20966
            ],
            [
                20922,
                20925
            ],
            [
                20967,
                20973
            ],
            [
                21006,
                21008
            ],
            [
                21008,
                21053
            ],
            [
                21053,
                21098
            ],
            [
                21098,
                21105
            ],
            [
                21160,
                21201
            ],
            [
                21247,
                21282
            ],
            [
                21282,
                21334
            ],
            [
                21338,
                21361
            ],
            [
                21361,
                21409
            ],
            [
                21474,
                21476
            ],
            [
                21476,
                21505
            ],
            [
                21516,
                21523
            ],
            [
                21533,
                21542
            ],
            [
                21542,
                21602
            ],
            [
                21602,
                21656
            ],
            [
                21662,
                21690
            ],
            [
                21690,
                21710
            ],
            [
                21710,
                21784
            ],
            [
                21900,
                21904
            ],
            [
                21918,
                21936
            ],
            [
                21785,
                21858
            ],
            [
                21883,
                21898
            ],
            [
                21938,
                21976
            ],
            [
                21976,
                21996
            ],
            [
                22023,
                22037
            ],
            [
                22054,
                22057
            ],
            [
                22057,
                22070
            ],
            [
                22116,
                22158
            ],
            [
                22279,
                22288
            ],
            [
                22288,
                22314
            ],
            [
                22327,
                22328
            ],
            [
                22330,
                22357
            ],
            [
                22357,
                22408
            ],
            [
                22465,
                22493
            ],
            [
                22493,
                22584
            ],
            [
                22594,
                22609
            ],
            [
                22609,
                22655
            ],
            [
                22682,
                22684
            ],
            [
                22690,
                22725
            ],
            [
                22736,
                22761
            ],
            [
                22844,
                22870
            ],
            [
                22881,
                22904
            ],
            [
                22930,
                22932
            ],
            [
                22966,
                22997
            ],
            [
                23012,
                23026
            ],
            [
                23033,
                23082
            ],
            [
                23082,
                23137
            ],
            [
                23154,
                23192
            ],
            [
                23237,
                23289
            ],
            [
                23324,
                23362
            ],
            [
                23373,
                23391
            ],
            [
                23461,
                23463
            ],
            [
                23463,
                23550
            ],
            [
                23550,
                23573
            ],
            [
                23573,
                23603
            ],
            [
                23603,
                23639
            ],
            [
                23639,
                23651
            ],
            [
                23751,
                23761
            ],
            [
                23762,
                23767
            ],
            [
                23793,
                23808
            ],
            [
                23775,
                23792
            ],
            [
                23813,
                23831
            ],
            [
                23851,
                23861
            ],
            [
                23907,
                23944
            ],
            [
                23944,
                23981
            ],
            [
                24047,
                24061
            ],
            [
                24061,
                24090
            ],
            [
                24115,
                24117
            ],
            [
                24117,
                24159
            ],
            [
                24159,
                24188
            ],
            [
                24277,
                24289
            ],
            [
                24219,
                24221
            ],
            [
                24304,
                24313
            ],
            [
                24313,
                24411
            ],
            [
                24411,
                24436
            ],
            [
                24436,
                24556
            ],
            [
                24556,
                24579
            ],
            [
                24579,
                24614
            ],
            [
                24614,
                24636
            ],
            [
                24653,
                24670
            ],
            [
                24684,
                24692
            ],
            [
                24707,
                24715
            ],
            [
                24670,
                24673
            ],
            [
                24725,
                24765
            ],
            [
                24765,
                24778
            ],
            [
                24792,
                24798
            ],
            [
                24798,
                24810
            ],
            [
                24841,
                24855
            ],
            [
                24933,
                24935
            ],
            [
                24935,
                24957
            ],
            [
                25087,
                25094
            ],
            [
                25107,
                25132
            ],
            [
                25141,
                25144
            ],
            [
                25168,
                25203
            ],
            [
                25254,
                25256
            ],
            [
                25256,
                25257
            ],
            [
                25261,
                25264
            ],
            [
                25273,
                25276
            ],
            [
                25276,
                25277
            ],
            [
                25286,
                25289
            ],
            [
                25289,
                25290
            ],
            [
                25313,
                25325
            ],
            [
                25344,
                25373
            ],
            [
                25476,
                25485
            ],
            [
                25495,
                25497
            ],
            [
                25497,
                25525
            ],
            [
                25617,
                25643
            ],
            [
                25697,
                25729
            ],
            [
                25643,
                25646
            ],
            [
                25735,
                25755
            ],
            [
                25781,
                25783
            ],
            [
                25783,
                25820
            ],
            [
                25829,
                25831
            ],
            [
                25831,
                25872
            ],
            [
                25872,
                25904
            ],
            [
                25904,
                25922
            ],
            [
                25922,
                25940
            ],
            [
                25940,
                25979
            ],
            [
                26019,
                26037
            ],
            [
                26046,
                26076
            ],
            [
                26142,
                26177
            ],
            [
                26131,
                26132
            ],
            [
                26239,
                26259
            ],
            [
                26262,
                26286
            ],
            [
                26301,
                26304
            ],
            [
                26324,
                26357
            ],
            [
                26357,
                26376
            ],
            [
                26392,
                26394
            ],
            [
                26378,
                26387
            ],
            [
                26545,
                26621
            ],
            [
                26627,
                26628
            ],
            [
                26629,
                26669
            ],
            [
                26692,
                26695
            ],
            [
                26675,
                26690
            ],
            [
                26702,
                26724
            ],
            [
                26724,
                26742
            ],
            [
                26782,
                26794
            ],
            [
                26819,
                26860
            ],
            [
                26860,
                26903
            ],
            [
                26930,
                26993
            ],
            [
                27009,
                27018
            ],
            [
                27051,
                27088
            ],
            [
                27095,
                27106
            ],
            [
                27106,
                27161
            ],
            [
                27218,
                27290
            ],
            [
                27290,
                27324
            ],
            [
                27334,
                27451
            ],
            [
                27484,
                27603
            ],
            [
                27604,
                27636
            ],
            [
                27657,
                27658
            ],
            [
                27646,
                27657
            ],
            [
                27905,
                27913
            ],
            [
                27879,
                27881
            ],
            [
                27948,
                27992
            ],
            [
                27992,
                28067
            ],
            [
                28068,
                28102
            ],
            [
                28106,
                28151
            ],
            [
                28151,
                28220
            ],
            [
                28220,
                28263
            ],
            [
                28263,
                28343
            ],
            [
                28485,
                28493
            ],
            [
                28379,
                28382
            ],
            [
                28494,
                28523
            ],
            [
                28567,
                28583
            ],
            [
                28587,
                28625
            ],
            [
                28641,
                28667
            ],
            [
                28667,
                28722
            ],
            [
                28722,
                28759
            ],
            [
                28788,
                28802
            ],
            [
                28819,
                28831
            ],
            [
                28895,
                28897
            ],
            [
                28897,
                28961
            ],
            [
                28961,
                29004
            ],
            [
                29055,
                29097
            ],
            [
                29097,
                29146
            ],
            [
                29147,
                29151
            ],
            [
                29199,
                29219
            ],
            [
                29219,
                29239
            ],
            [
                29377,
                29429
            ],
            [
                29433,
                29445
            ],
            [
                29621,
                29738
            ],
            [
                30225,
                30303
            ],
            [
                30449,
                30520
            ],
            [
                30520,
                30586
            ],
            [
                30653,
                30663
            ],
            [
                30680,
                30691
            ],
            [
                30706,
                30759
            ],
            [
                30765,
                30782
            ],
            [
                30782,
                30784
            ],
            [
                30801,
                30818
            ],
            [
                30989,
                31023
            ],
            [
                31029,
                31109
            ],
            [
                31109,
                31122
            ],
            [
                31122,
                31149
            ],
            [
                31149,
                31163
            ],
            [
                31163,
                31170
            ],
            [
                31187,
                31222
            ],
            [
                31222,
                31286
            ],
            [
                31286,
                31317
            ],
            [
                31330,
                31339
            ],
            [
                31393,
                31451
            ],
            [
                31462,
                31464
            ],
            [
                31653,
                31718
            ],
            [
                31718,
                31739
            ],
            [
                31800,
                31882
            ],
            [
                31884,
                31909
            ],
            [
                31909,
                31945
            ],
            [
                31945,
                31999
            ],
            [
                31999,
                32066
            ],
            [
                32066,
                32114
            ],
            [
                32649,
                32667
            ],
            [
                32686,
                32689
            ],
            [
                32690,
                32722
            ],
            [
                32869,
                32885
            ],
            [
                32733,
                32736
            ],
            [
                32770,
                32771
            ],
            [
                32912,
                32938
            ],
            [
                32938,
                32960
            ],
            [
                32984,
                33043
            ],
            [
                33043,
                33062
            ],
            [
                33062,
                33108
            ],
            [
                33114,
                33120
            ],
            [
                33140,
                33146
            ],
            [
                33151,
                33178
            ],
            [
                33227,
                33229
            ],
            [
                33229,
                33354
            ],
            [
                33367,
                33397
            ],
            [
                33509,
                33514
            ],
            [
                33492,
                33494
            ],
            [
                33520,
                33549
            ],
            [
                33555,
                33562
            ],
            [
                33571,
                33642
            ],
            [
                33645,
                33647
            ],
            [
                33660,
                33678
            ],
            [
                33682,
                33715
            ],
            [
                33756,
                33757
            ],
            [
                34309,
                34469
            ],
            [
                34677,
                34679
            ],
            [
                34679,
                34726
            ],
            [
                34853,
                34910
            ]
        ],
        "row_chars": [
            [
                0,
                88
            ],
            [
                88,
                258
            ],
            [
                258,
                538
            ],
            [
                538,
                688
            ],
            [
                688,
                849
            ],
            [
                849,
                921
            ],
            [
                921,
                1228
            ],
            [
                1228,
                1302
            ],
            [
                1302,
                1500
            ],
            [
                1500,
                1545
            ],
            [
                1545,
                1733
            ],
            [
                1733,
                1823
            ],
            [
                1823,
                1906
            ],
            [
                1906,
                2005
            ],
            [
                2005,
                2055
            ],
            [
                2055,
                2128
            ],
            [
                2128,
                2283
            ],
            [
                2283,
                2363
            ],
            [
                2363,
                2486
            ],
            [
                2486,
                2577
            ],
            [
                2577,
                2643
            ],
            [
                2643,
                2773
            ],
            [
                2773,
                2804
            ],
            [
                2804,
                2812
            ],
            [
                2812,
                2855
            ],
            [
                2855,
                2921
            ],
            [
                2921,
                2952
            ],
            [
                2952,
                2957
            ],
            [
                2957,
                3015
            ],
            [
                3015,
                3124
            ],
            [
                3124,
                3194
            ],
            [
                3194,
                3216
            ],
            [
                3216,
                3267
            ],
            [
                3267,
                3338
            ],
            [
                3338,
                3493
            ],
            [
                3493,
                3508
            ],
            [
                3508,
                3521
            ],
            [
                3521,
                3575
            ],
            [
                3575,
                3620
            ],
            [
                3620,
                3645
            ],
            [
                3645,
                3743
            ],
            [
                3743,
                3801
            ],
            [
                3801,
                3931
            ],
            [
                3931,
                3979
            ],
            [
                3979,
                4021
            ],
            [
                4021,
                4045
            ],
            [
                4045,
                4152
            ],
            [
                4152,
                4189
            ],
            [
                4189,
                4224
            ],
            [
                4224,
                4235
            ],
            [
                4235,
                4339
            ],
            [
                4339,
                4349
            ],
            [
                4349,
                4371
            ],
            [
                4371,
                4384
            ],
            [
                4384,
                4396
            ],
            [
                4396,
                4448
            ],
            [
                4448,
                4574
            ],
            [
                4574,
                4697
            ],
            [
                4697,
                4707
            ],
            [
                4707,
                4842
            ],
            [
                4842,
                4868
            ],
            [
                4868,
                4906
            ],
            [
                4906,
                4978
            ],
            [
                4978,
                5015
            ],
            [
                5015,
                5132
            ],
            [
                5132,
                5196
            ],
            [
                5196,
                5247
            ],
            [
                5247,
                5270
            ],
            [
                5270,
                5361
            ],
            [
                5361,
                5366
            ],
            [
                5366,
                5415
            ],
            [
                5415,
                5469
            ],
            [
                5469,
                5541
            ],
            [
                5541,
                5553
            ],
            [
                5553,
                5642
            ],
            [
                5642,
                5736
            ],
            [
                5736,
                5812
            ],
            [
                5812,
                5921
            ],
            [
                5921,
                6096
            ],
            [
                6096,
                6172
            ],
            [
                6172,
                6242
            ],
            [
                6242,
                6304
            ],
            [
                6304,
                6357
            ],
            [
                6357,
                6370
            ],
            [
                6370,
                6382
            ],
            [
                6382,
                6404
            ],
            [
                6404,
                6420
            ],
            [
                6420,
                6442
            ],
            [
                6442,
                6487
            ],
            [
                6487,
                6521
            ],
            [
                6521,
                6551
            ],
            [
                6551,
                6696
            ],
            [
                6696,
                6803
            ],
            [
                6803,
                6937
            ],
            [
                6937,
                6970
            ],
            [
                6970,
                7223
            ],
            [
                7223,
                7530
            ],
            [
                7530,
                7927
            ],
            [
                7927,
                8151
            ],
            [
                8151,
                8289
            ],
            [
                8289,
                8417
            ],
            [
                8417,
                8455
            ],
            [
                8455,
                8477
            ],
            [
                8477,
                8610
            ],
            [
                8610,
                8646
            ],
            [
                8646,
                8675
            ],
            [
                8675,
                8725
            ],
            [
                8725,
                8769
            ],
            [
                8769,
                8805
            ],
            [
                8805,
                8846
            ],
            [
                8846,
                8857
            ],
            [
                8857,
                8992
            ],
            [
                8992,
                9125
            ],
            [
                9125,
                9163
            ],
            [
                9163,
                9174
            ],
            [
                9174,
                9207
            ],
            [
                9207,
                9349
            ],
            [
                9349,
                9355
            ],
            [
                9355,
                9488
            ],
            [
                9488,
                9608
            ],
            [
                9608,
                9751
            ],
            [
                9751,
                9906
            ],
            [
                9906,
                10008
            ],
            [
                10008,
                10164
            ],
            [
                10164,
                10226
            ],
            [
                10226,
                10241
            ],
            [
                10241,
                10246
            ],
            [
                10246,
                10264
            ],
            [
                10264,
                10319
            ],
            [
                10319,
                10332
            ],
            [
                10332,
                10405
            ],
            [
                10405,
                10477
            ],
            [
                10477,
                10492
            ],
            [
                10492,
                10519
            ],
            [
                10519,
                10590
            ],
            [
                10590,
                10608
            ],
            [
                10608,
                10742
            ],
            [
                10742,
                10790
            ],
            [
                10790,
                10908
            ],
            [
                10908,
                11030
            ],
            [
                11030,
                11123
            ],
            [
                11123,
                11153
            ],
            [
                11153,
                11387
            ],
            [
                11387,
                11432
            ],
            [
                11432,
                11454
            ],
            [
                11454,
                11480
            ],
            [
                11480,
                11629
            ],
            [
                11629,
                12089
            ],
            [
                12089,
                12392
            ],
            [
                12392,
                12431
            ],
            [
                12431,
                12457
            ],
            [
                12457,
                12494
            ],
            [
                12494,
                12557
            ],
            [
                12557,
                12592
            ],
            [
                12592,
                12627
            ],
            [
                12627,
                12670
            ],
            [
                12670,
                12841
            ],
            [
                12841,
                12891
            ],
            [
                12891,
                12895
            ],
            [
                12895,
                13087
            ],
            [
                13087,
                13242
            ],
            [
                13242,
                13480
            ],
            [
                13480,
                13539
            ],
            [
                13539,
                13633
            ],
            [
                13633,
                13666
            ],
            [
                13666,
                13697
            ],
            [
                13697,
                13998
            ],
            [
                13998,
                14118
            ],
            [
                14118,
                14159
            ],
            [
                14159,
                14175
            ],
            [
                14175,
                14302
            ],
            [
                14302,
                14391
            ],
            [
                14391,
                14441
            ],
            [
                14441,
                14479
            ],
            [
                14479,
                14511
            ],
            [
                14511,
                14577
            ],
            [
                14577,
                14599
            ],
            [
                14599,
                14611
            ],
            [
                14611,
                14663
            ],
            [
                14663,
                14787
            ],
            [
                14787,
                14832
            ],
            [
                14832,
                14957
            ],
            [
                14957,
                15063
            ],
            [
                15063,
                15145
            ],
            [
                15145,
                15287
            ],
            [
                15287,
                15500
            ],
            [
                15500,
                15567
            ],
            [
                15567,
                15616
            ],
            [
                15616,
                15793
            ],
            [
                15793,
                15823
            ],
            [
                15823,
                15893
            ],
            [
                15893,
                15934
            ],
            [
                15934,
                16012
            ],
            [
                16012,
                16033
            ],
            [
                16033,
                16043
            ],
            [
                16043,
                16160
            ],
            [
                16160,
                16300
            ],
            [
                16300,
                16617
            ],
            [
                16617,
                16786
            ],
            [
                16786,
                16973
            ],
            [
                16973,
                17044
            ],
            [
                17044,
                17122
            ],
            [
                17122,
                17172
            ],
            [
                17172,
                17229
            ],
            [
                17229,
                17719
            ],
            [
                17719,
                17779
            ],
            [
                17779,
                17944
            ],
            [
                17944,
                18103
            ],
            [
                18103,
                18324
            ],
            [
                18324,
                18342
            ],
            [
                18342,
                18462
            ],
            [
                18462,
                18506
            ],
            [
                18506,
                18710
            ],
            [
                18710,
                18759
            ],
            [
                18759,
                18865
            ],
            [
                18865,
                19014
            ],
            [
                19014,
                19019
            ],
            [
                19019,
                19056
            ],
            [
                19056,
                19060
            ],
            [
                19060,
                19102
            ],
            [
                19102,
                19106
            ],
            [
                19106,
                19124
            ],
            [
                19124,
                19177
            ],
            [
                19177,
                19208
            ],
            [
                19208,
                19227
            ],
            [
                19227,
                19257
            ],
            [
                19257,
                19399
            ],
            [
                19399,
                19429
            ],
            [
                19429,
                19517
            ],
            [
                19517,
                19594
            ],
            [
                19594,
                19619
            ],
            [
                19619,
                19829
            ],
            [
                19829,
                19839
            ],
            [
                19839,
                19856
            ],
            [
                19856,
                19883
            ],
            [
                19883,
                19946
            ],
            [
                19946,
                19990
            ],
            [
                19990,
                20063
            ],
            [
                20063,
                20134
            ],
            [
                20134,
                20292
            ],
            [
                20292,
                20325
            ],
            [
                20325,
                20367
            ],
            [
                20367,
                20426
            ],
            [
                20426,
                20456
            ],
            [
                20456,
                20469
            ],
            [
                20469,
                20730
            ],
            [
                20730,
                20743
            ],
            [
                20743,
                20854
            ],
            [
                20854,
                21008
            ],
            [
                21008,
                21053
            ],
            [
                21053,
                21098
            ],
            [
                21098,
                21282
            ],
            [
                21282,
                21361
            ],
            [
                21361,
                21476
            ],
            [
                21476,
                21505
            ],
            [
                21505,
                21516
            ],
            [
                21516,
                21542
            ],
            [
                21542,
                21602
            ],
            [
                21602,
                21690
            ],
            [
                21690,
                21710
            ],
            [
                21710,
                21976
            ],
            [
                21976,
                22057
            ],
            [
                22057,
                22159
            ],
            [
                22159,
                22279
            ],
            [
                22279,
                22288
            ],
            [
                22288,
                22357
            ],
            [
                22357,
                22493
            ],
            [
                22493,
                22609
            ],
            [
                22609,
                22684
            ],
            [
                22684,
                22690
            ],
            [
                22690,
                22932
            ],
            [
                22932,
                22966
            ],
            [
                22966,
                23026
            ],
            [
                23026,
                23033
            ],
            [
                23033,
                23082
            ],
            [
                23082,
                23289
            ],
            [
                23289,
                23324
            ],
            [
                23324,
                23463
            ],
            [
                23463,
                23550
            ],
            [
                23550,
                23573
            ],
            [
                23573,
                23603
            ],
            [
                23603,
                23639
            ],
            [
                23639,
                23831
            ],
            [
                23831,
                23944
            ],
            [
                23944,
                24061
            ],
            [
                24061,
                24117
            ],
            [
                24117,
                24159
            ],
            [
                24159,
                24313
            ],
            [
                24313,
                24411
            ],
            [
                24411,
                24436
            ],
            [
                24436,
                24556
            ],
            [
                24556,
                24579
            ],
            [
                24579,
                24614
            ],
            [
                24614,
                24670
            ],
            [
                24670,
                24765
            ],
            [
                24765,
                24798
            ],
            [
                24798,
                24935
            ],
            [
                24935,
                24979
            ],
            [
                24979,
                25025
            ],
            [
                25025,
                25066
            ],
            [
                25066,
                25082
            ],
            [
                25082,
                25087
            ],
            [
                25087,
                25144
            ],
            [
                25144,
                25163
            ],
            [
                25163,
                25256
            ],
            [
                25256,
                25276
            ],
            [
                25276,
                25289
            ],
            [
                25289,
                25373
            ],
            [
                25373,
                25476
            ],
            [
                25476,
                25497
            ],
            [
                25497,
                25525
            ],
            [
                25525,
                25617
            ],
            [
                25617,
                25643
            ],
            [
                25643,
                25783
            ],
            [
                25783,
                25831
            ],
            [
                25831,
                25872
            ],
            [
                25872,
                25904
            ],
            [
                25904,
                25922
            ],
            [
                25922,
                25940
            ],
            [
                25940,
                26037
            ],
            [
                26037,
                26239
            ],
            [
                26239,
                26305
            ],
            [
                26305,
                26324
            ],
            [
                26324,
                26357
            ],
            [
                26357,
                26545
            ],
            [
                26545,
                26629
            ],
            [
                26629,
                26724
            ],
            [
                26724,
                26744
            ],
            [
                26744,
                26782
            ],
            [
                26782,
                26860
            ],
            [
                26860,
                27106
            ],
            [
                27106,
                27161
            ],
            [
                27161,
                27218
            ],
            [
                27218,
                27290
            ],
            [
                27290,
                27604
            ],
            [
                27604,
                27876
            ],
            [
                27876,
                27992
            ],
            [
                27992,
                28068
            ],
            [
                28068,
                28151
            ],
            [
                28151,
                28220
            ],
            [
                28220,
                28263
            ],
            [
                28263,
                28343
            ],
            [
                28343,
                28523
            ],
            [
                28523,
                28553
            ],
            [
                28553,
                28667
            ],
            [
                28667,
                28722
            ],
            [
                28722,
                28759
            ],
            [
                28759,
                28788
            ],
            [
                28788,
                28897
            ],
            [
                28897,
                28961
            ],
            [
                28961,
                29097
            ],
            [
                29097,
                29219
            ],
            [
                29219,
                29239
            ],
            [
                29239,
                29377
            ],
            [
                29377,
                30520
            ],
            [
                30520,
                30782
            ],
            [
                30782,
                31109
            ],
            [
                31109,
                31122
            ],
            [
                31122,
                31149
            ],
            [
                31149,
                31163
            ],
            [
                31163,
                31222
            ],
            [
                31222,
                31286
            ],
            [
                31286,
                31339
            ],
            [
                31339,
                31393
            ],
            [
                31393,
                31464
            ],
            [
                31464,
                31504
            ],
            [
                31504,
                31653
            ],
            [
                31653,
                31718
            ],
            [
                31718,
                31739
            ],
            [
                31739,
                31800
            ],
            [
                31800,
                31909
            ],
            [
                31909,
                31945
            ],
            [
                31945,
                31999
            ],
            [
                31999,
                32066
            ],
            [
                32066,
                32115
            ],
            [
                32115,
                32210
            ],
            [
                32210,
                32312
            ],
            [
                32312,
                32374
            ],
            [
                32374,
                32458
            ],
            [
                32458,
                32549
            ],
            [
                32549,
                32590
            ],
            [
                32590,
                32649
            ],
            [
                32649,
                32722
            ],
            [
                32722,
                32938
            ],
            [
                32938,
                33043
            ],
            [
                33043,
                33062
            ],
            [
                33062,
                33229
            ],
            [
                33229,
                33398
            ],
            [
                33398,
                33489
            ],
            [
                33489,
                33642
            ],
            [
                33642,
                33758
            ],
            [
                33758,
                33803
            ],
            [
                33803,
                34094
            ],
            [
                34094,
                34306
            ],
            [
                34306,
                34679
            ],
            [
                34679,
                34910
            ]
        ]
    },
    "abridged": {
        "text": "The place in Lincolnshire has shut its many eyes again, and the house in town is awake. In Lincolnshire the Dedlocks of the past doze in their picture-frames. In town the Dedlocks of the present rattle in their carriages through the darkness of the night, and the Dedlock footmen loll away the drowsy mornings in the little windows of the hall. The fashionable world - tremendous orb, nearly five miles round - is in full swing.\nWhere the throng is thickest, where the lights are brightest, Lady Dedlock is. From the shining heights she has conquered, she is never absent. Though she has no assurance that what she is to those around her, she will remain another day, it is not in her nature to yield or to droop. They say that she has lately grown more handsome and more haughty.\nMr. Tulkinghorn says nothing. Now, as before, he is to be found in doorways, receiving patronage from the peerage and making no sign. Of all men he is still the last who might be supposed to have any influence upon my Lady. Of all women she is still the last who might be supposed to have any dread of him.\nOne thing has been much on her mind since their interview in his turret-room at Chesney Wold. She is now decided.\nIt is afternoon. The footmen, exhausted by looking out of windows, are reposing in the hall and hang their heavy powdered heads like overblown sunflowers. Sir Leicester, in the library, has fallen asleep over the report of a Parliamentary committee. My Lady sits in the room in which she gave audience to the young man of the name of Guppy. Rosa is with her and has been reading to her. Rosa is now at work upon embroidery, and my Lady watches her in silence.\n\"Rosa.\"\nThe pretty village face looks brightly up. Then, seeing how serious my Lady is, looks puzzled and surprised.\n\"Is the door shut?\"\nYes. She looks yet more surprised.\n\"I am about to place confidence in you, child, for I know I may trust your attachment, if not your judgment. Say nothing to anyone of what passes between us.\"\nRosa promises earnestly to be trustworthy.\n\"Do you know,\" Lady Dedlock asks her, \"that I am different to you from what I am to anyone?\"\n\"Yes, my Lady. Much kinder. But I often think I know you as you really are.\"\n\"You think so? Poor child!\"\nShe says it with a kind of scorn - though not of Rosa - and sits brooding.\n\"Do you think, Rosa, you are any relief or comfort to me? Do you suppose it gives me pleasure to have you near me?\"\n\"I don't know, my Lady. I hope and wish it was so.\"\n\"It is so, little one.\"\nThe pretty face is checked in its flush of pleasure by the dark expression on the handsome face before it. It looks timidly for an explanation.\n\"And if I were to say today, 'Go! Leave me!' it would give me great pain, child, and leave me very solitary.\"\n\"My Lady! Have I offended you?\"\n\"In nothing. Come here.\"\nRosa bends down on the footstool at my Lady's feet. My Lady lays her hand upon her dark hair and gently keeps it there.\n\"I told you, Rosa, that I wished you to be happy and that I would make you so if I could. I cannot. There are reasons now known to me, reasons in which you have no part, which mean it is far better for you that you should not remain here. I have decided that you shall not stay. I have written to the father of your lover, and he will be here today. All this I have done for your sake.\"\nThe weeping girl covers her hand with kisses and says what shall she do, when they are separated! Her mistress kisses her on the cheek.\n\"Be happy, child. Be beloved and happy!\"\n\"Ah, my Lady, I have sometimes thought - forgive me - that you are not happy.\"\n\"I!\"\n\"Pray let me stay a little while!\"\n\"I have said, my child, that what I do, I do for your sake, not my own. It is done. What I am towards you, Rosa, is what I am now - not what I shall be in a little while. Remember this, and keep my confidence, for my sake!\"\nShe leaves the room. Late in the afternoon, when she next appears upon the staircase, she is in her haughtiest and coldest state.\nMr. Rouncewell has arrived. Mr. Rouncewell is not in the library, but she goes to the library. Sir Leicester is there, and she wishes to speak to him first.\n\"Sir Leicester, I am desirous - but you are engaged.\"\nOh, dear no! Only Mr. Tulkinghorn. Always at hand. Haunting every place.\n\"I beg your pardon, Lady Dedlock. Will you allow me to retire?\"\nWith a look that plainly says, \"You know you have the power to remain if you will,\" she tells him it is not necessary. Mr. Tulkinghorn retires into a window opposite. Interposed between her and the fading light of day in the quiet street, his shadow falls upon her, and he darkens all before her.\nIt is a dull street at the best of times, a street of dismal grandeur, with a complicated garnish of iron-work that entwines itself over the flights of steps, and here and there a weak little iron hoop, sacred to the memory of departed oil-lamps. Therefore there is not much that Lady Dedlock could wish to see through the window in which Mr. Tulkinghorn stands. And yet she sends a look in that direction as if it were her heart's desire to have him moved out of the way.\nSir Leicester begs his Lady's pardon. She was about to say?\n\"Only that Mr. Rouncewell is here (he has called by my appointment) and that we had better make an end of the question of that girl. I am tired to death of the matter. Will you tell them to send him up?\"\nSir Leicester tells the footman, \"Request the iron gentleman to walk this way.\"\nWhen he comes, Sir Leicester receives him graciously.\n\"I hope you are well, Mr. Rouncewell. Be seated. My Lady was desirous to speak with you. Hem!\"\n\"I shall be very happy,\" returns the iron gentleman, \"to give my best attention to anything Lady Dedlock does me the honour to say.\"\nAs he turns towards her, he finds she seems less agreeable than on the former occasion. A distant supercilious air makes a cold atmosphere about her, which does not encourage openness.\n\"Pray, sir,\" says Lady Dedlock listlessly, \"may I be allowed to inquire whether anything has passed between you and your son respecting your son's fancy?\"\n\"If my memory serves me, Lady Dedlock, I said that I should seriously advise my son to conquer that - fancy.\"\n\"And did you?\"\n\"Of course I did.\"\nSir Leicester gives an approving nod.\n\"And pray has he done so?\"\n\"Lady Dedlock, I fear not.\"\n\"Because,\" proceeds my Lady, \"I have been thinking of the subject, which is tiresome to me.\"\n\"I am very sorry, I am sure.\"\n\"And also of what Sir Leicester said upon it, in which I quite concur. If you cannot assure us that this fancy is at an end, I have come to the conclusion that the girl had better leave me. She had better go.\"\n\"Excuse me, my Lady,\" Sir Leicester considerately interposes, \"but perhaps this may be doing an injury to the young woman which she has not deserved. It is her good fortune it is to have attracted the favour of an eminent lady and to live surrounded by great advantages. Should the young woman be deprived of these advantages simply because she has attracted the notice of Mr Rouncewell's son? Now, has she deserved this punishment?\"\n\"I beg your pardon,\" interposes Mr. Rouncewell. \"Pray dismiss that from your consideration. You may recollect that my first thought in the affair was directly opposed to her remaining here.\"\nDismiss the Dedlock patronage from consideration? Oh! Sir Leicester can scarcely believe his ears.\n\"It is not necessary,\" observes my Lady in her coldest manner, \"to enter into these matters. The girl is a very good girl; I have nothing whatever to say against her, but she is so far insensible to her many advantages that she is in love - or supposes she is, poor little fool - and unable to appreciate them.\"\nIn that case, Sir Leicester entirely agrees with my Lady. The young woman had better go.\n\"I have told her so,\" says Lady Dedlock languidly. \"Mr. Rouncewell, would you wish to have her sent back to the village, or would you like to take her with you?\"\n\"I should prefer the course which will the soonest relieve you of the incumbrance.\"\n\"Do I understand that you will take her with you?\"\nThe iron gentleman makes an iron bow.\n\"Sir Leicester, will you ring?\" Mr. Tulkinghorn steps forward from his window and pulls the bell. \"I had forgotten you. Thank you.\" The footman is instructed to bring Rosa.\nRosa has been crying and is still in distress. On her coming in, the ironmaster leaves his chair, and takes her arm in his.\n\"You are taken charge of, you see,\" says my Lady in her weary manner, \"and are going away well protected. I have mentioned that you are a very good girl, and you have nothing to cry for.\"\n\"She seems after all,\" observes Mr. Tulkinghorn, \"as if she were crying at going away.\"\n\"Why, she is not well-bred, you see,\" returns Mr. Rouncewell with some quickness, as if he were glad to have the lawyer to retort upon, \"and she is an inexperienced little thing and knows no better. If she had remained here, sir, she would have improved, no doubt.\"\n\"No doubt,\" is Mr. Tulkinghorn's composed reply.\nRosa sobs out that she is very sorry to leave my Lady, and that she was happy at Chesney Wold, and that she thanks my Lady over and over again.\n\"Out, you silly little puss!\" says the ironmaster, though not angrily. \"Have a spirit, if you're fond of Watt!\"\nMy Lady merely waves her off with indifference, saying, \"There, there, child! You are a good girl. Go away!\" Mr. Tulkinghorn, an indistinct form against the dark street now dotted with lamps, looms in my Lady's view, bigger and blacker than before.\n\"Sir Leicester and Lady Dedlock,\" says Mr. Rouncewell, \"I can very well understand, I assure you, how tiresome so small a matter must have become to Lady Dedlock. I only regret that I did not at first quietly exert my influence to take my young friend here away without troubling you. I hope you will excuse my want of acquaintance with the polite world.\"\nSir Leicester stands to return his parting salutation, and Mr. Rouncewell and Rosa leave the house.\nThen lights are brought in, discovering Mr. Tulkinghorn still standing in his window with his hands behind him and my Lady still sitting with his figure before her. She is very pale. Mr. Tulkinghorn thinks, \"The power of this woman is astonishing. She has been acting a part the whole time.\" But he can act a part too - his one unchanging character - and as he holds the door open for her to leave the room, fifty pairs of eyes should find no flaw in him.\nLady Dedlock dines alone in her room today. Sir Leicester has a political meeting. She asks, still deadly pale, whether he is gone out? Yes. Whether Mr. Tulkinghorn is gone yet? No. Presently she asks again, is he gone yet? No. What is he doing? The footman thinks he is writing letters in the library. Would my Lady wish to see him? Anything but that.\nBut he wishes to see my Lady. Within a few more minutes he sends his respects, and could my Lady receive him for a word or two? He comes in apologizing for intruding. When they are alone, my Lady waves her hand to dispense with such mockeries.\n\"What do you want, sir?\"\n\"Why, Lady Dedlock,\" says the lawyer, taking a chair, \"I am rather surprised by the course you have taken.\"\n\"Indeed?\"\n\"Yes, decidedly. I was not prepared for it. I consider it a departure from our agreement and your promise. It puts us in a new position, Lady Dedlock. I feel myself under the necessity of saying that I don't approve of it.\"\nHe looks at her, with his hands on his knees. Imperturbable as he is, there is still an indefinable freedom in his manner which is new and which does not escape her observation.\n\"I do not quite understand you.\"\n\"Oh, I think you do. Come, come, Lady Dedlock, we must not parry now. You know you like this girl.\"\n\"Well, sir?\"\n\"And you know - and I know - that you have not sent her away for the reasons you said, but to separate her from any reproach and exposure that hang over yourself.\"\n\"Well, sir?\"\n\"Well, Lady Dedlock,\" returns the lawyer, crossing his legs, \"I object to that. I consider that a dangerous proceeding, calculated to awaken speculation, doubt, and rumour. Besides, it is a violation of our agreement. You were to be exactly what you were before. Whereas you have been this evening very different, Lady Dedlock, transparently so!\"\n\"If, sir,\" she begins, \"in my knowledge of my secret-\" But he interrupts her.\n\"Now, Lady Dedlock, this is a matter of business. It is no longer your secret. That is your mistake. It is my secret, in trust for Sir Leicester and the family. If it were your secret, Lady Dedlock, we should not be holding this conversation.\"\n\"That is very true. If in my knowledge of the secret I do what I can to spare an innocent girl from my impending shame (especially, remembering your own reference to her when you told my story at Chesney Wold), I act upon a resolution I have taken. Nothing in the world could shake it.\" This she says with no more outward passion than himself.\n\"Really? Then you see, Lady Dedlock, you are not to be trusted. You have put the case in a perfectly plain way, and you are not to be trusted.\"\n\"Perhaps you may remember that I expressed some anxiety on this same point when we spoke at Chesney Wold?\"\n\"Yes,\" says Mr. Tulkinghorn, coolly getting up. \"I recollect, Lady Dedlock, that you referred to the girl, but our arrangement altogether forbade any action on your part. As to sparing the girl, of what value is she? Lady Dedlock, here is a family name compromised. One might have supposed that the course was straight on, neither to the right nor to the left, sparing nothing, treading everything under foot.\"\nShe lifts up her eyes and looks at him with a stern expression. \"This woman understands me,\" Mr. Tulkinghorn thinks as she lets her glance fall again. \"She cannot be spared. Why should she spare others?\"\nFor a little while they are silent. Lady Dedlock rises from the table and reclines in a lounging-chair, shading her face. Her manner is thoughtful, gloomy, concentrated. \"This woman,\" thinks Mr. Tulkinghorn, \"is a study.\"\nHe studies her at his leisure. She too studies something at her leisure. She is not the first to speak. At last he is driven to break the silence.\n\"Lady Dedlock, the most disagreeable part of this business interview remains, but it is business. Our agreement is broken. A lady of your sense and strength of character will be prepared for my now declaring it void and taking my own course.\"\n\"I am quite prepared.\"\nMr. Tulkinghorn inclines his head. \"That is all I have to say, Lady Dedlock.\"\nAs he is leaving the room she asks, \"This is the notice I was to receive? I wish not to misunderstand you.\"\n\"Not exactly, Lady Dedlock. But virtually the same.\"\n\"Do you think of undeceiving Sir Leicester tonight?\"\n\"No,\" says Mr. Tulkinghorn with a slight smile. \"Not tonight.\"\n\"Tomorrow?\"\n\"I had better not answer that question, Lady Dedlock. It may be tomorrow. I would rather say no more. I wish you good evening.\"\nAs he walks silently to the door she stops him once again.\n\"Do you intend to remain in the house? I heard you were writing in the library. Are you going to return there?\"\n\"Only for my hat. I am going home.\"\nShe bows her eyes rather than her head, and he withdraws. Outside the room he looks at his watch and then at a splendid clock upon the staircase.\n\"And what do you say?\" Mr. Tulkinghorn inquires of it.\nIf it said now, \"Don't go home!\" what a famous clock would it be hereafter. With its sharp clear bell it strikes three quarters after seven and ticks on.\n\"Why, you are worse than I thought you,\" mutters Mr. Tulkinghorn in reproof to his watch. \"Two minutes wrong.\" What a watch it would be if it ticked in answer, \"Don't go home!\"\nHe passes out into the streets and walks on, under the shadow of the lofty houses, many of whose mysteries and mortgages are treasured up within his old black waistcoat. He is in the confidence of the very bricks and mortar. Yet there is not a voice in a mile of them to whisper, \"Don't go home!\"\nThrough the stir and motion of the streets; through the roar and jar of many vehicles, many feet, many voices; with the blazing shop-lights lighting him, and the crowd pressing him on, he is pitilessly urged upon his way, and nothing meets him murmuring, \"Don't go home!\"\nArrived at last in his dull room, he lights his candles. The moon is rising over the great wilderness of London. The stars are shining as they shone above the turret-leads at Chesney Wold.\nThis woman, as he has of late been accustomed to call her, looks out upon them. Her soul is turbulent within her; she is sick at heart and restless. The large rooms are too cramped and close. She cannot endure their restraint and will walk alone in a neighbouring garden.\nLoosely muffled, she goes out into the moonlight. A footman opens the garden-gate, delivers the key into his Lady's hands and is bidden to go back. She will walk there some time to ease her aching head. She may be an hour, she may be more. The gate shuts with a clash.\nA fine night, and a bright large moon, and multitudes of stars. Mr. Tulkinghorn, in repairing to his cellar, has to cross a little prison-like yard. He looks up casually, thinking what a fine night, and what a quiet night, too.\nA very quiet night. Not only is it a still night on dusty high roads and hill-summits; not only is it a still night in gardens and in woods, and on the river where the water-meadows are fresh and green, until it mingles with the ever-heaving sea; not only is it a still night on the deep; but even on this stranger's wilderness of London there is some rest. Its steeples and towers and its one great dome grow more ethereal; the noises of the streets are softened, and the footsteps on the pavements pass tranquilly away. In Mr. Tulkinghorn's room, every noise is merged, this moonlit night, into a distant ringing hum, as if the city were a vast glass, vibrating.\nWhat's that? Who fired a gun or pistol? Where was it?\nThe few pedestrians start, stop, and stare about them. Some windows and doors are opened, and people come out to look. It was a loud report and echoed heavily. It has aroused all the dogs in the neighbourhood, who bark. The hum from the streets, likewise, seems to swell into a shout. But it is soon over. When it has ceased, the fine night, the bright large moon, and multitudes of stars are left at peace again.\nHas Mr. Tulkinghorn been disturbed? His windows are dark and quiet, and his door is shut. It must be something unusual indeed to bring him out of his shell. Nothing is heard of him, nothing is seen of him.\nBut a little after day-break come people to clean the rooms. And looking down upon the floor, one person shrieks and flies. The others, looking in, shriek and fly too, and there is an alarm in the street.\nWhat does it mean? No light is admitted into the darkened chamber. People enter, treading softly but heavily. There is whispering and wondering all day, strict search of every corner, careful tracing of steps, and careful noting of the position of every article of furniture.\nOn the table is a bottle (nearly full of wine), a glass and two candles that were blown out suddenly soon after being lighted. There is an empty chair and a stain upon the ground before it.\nIt shall happen surely, through many years to come, that ghostly stories shall be told of the stain upon the floor, so easy to be covered, so hard to be got out. For Mr. Tulkinghorn's time is over for evermore. He is lying face downward on the floor, shot through the heart.",
        "paragraph_chars": [
            [
                0,
                429
            ],
            [
                429,
                781
            ],
            [
                781,
                1088
            ],
            [
                1088,
                1202
            ],
            [
                1202,
                1662
            ],
            [
                1662,
                1670
            ],
            [
                1670,
                1779
            ],
            [
                1779,
                1799
            ],
            [
                1799,
                1834
            ],
            [
                1834,
                1993
            ],
            [
                1993,
                2036
            ],
            [
                2036,
                2129
            ],
            [
                2129,
                2206
            ],
            [
                2206,
                2234
            ],
            [
                2234,
                2309
            ],
            [
                2309,
                2425
            ],
            [
                2425,
                2477
            ],
            [
                2477,
                2501
            ],
            [
                2501,
                2645
            ],
            [
                2645,
                2755
            ],
            [
                2755,
                2787
            ],
            [
                2787,
                2812
            ],
            [
                2812,
                2932
            ],
            [
                2932,
                3319
            ],
            [
                3319,
                3455
            ],
            [
                3455,
                3496
            ],
            [
                3496,
                3575
            ],
            [
                3575,
                3580
            ],
            [
                3580,
                3615
            ],
            [
                3615,
                3839
            ],
            [
                3839,
                3969
            ],
            [
                3969,
                4126
            ],
            [
                4126,
                4180
            ],
            [
                4180,
                4253
            ],
            [
                4253,
                4317
            ],
            [
                4317,
                4614
            ],
            [
                4614,
                5087
            ],
            [
                5087,
                5147
            ],
            [
                5147,
                5351
            ],
            [
                5351,
                5431
            ],
            [
                5431,
                5485
            ],
            [
                5485,
                5580
            ],
            [
                5580,
                5713
            ],
            [
                5713,
                5898
            ],
            [
                5898,
                6053
            ],
            [
                6053,
                6163
            ],
            [
                6163,
                6178
            ],
            [
                6178,
                6197
            ],
            [
                6197,
                6235
            ],
            [
                6235,
                6262
            ],
            [
                6262,
                6290
            ],
            [
                6290,
                6383
            ],
            [
                6383,
                6413
            ],
            [
                6413,
                6623
            ],
            [
                6623,
                7057
            ],
            [
                7057,
                7248
            ],
            [
                7248,
                7347
            ],
            [
                7347,
                7659
            ],
            [
                7659,
                7748
            ],
            [
                7748,
                7910
            ],
            [
                7910,
                7994
            ],
            [
                7994,
                8045
            ],
            [
                8045,
                8083
            ],
            [
                8083,
                8256
            ],
            [
                8256,
                8380
            ],
            [
                8380,
                8568
            ],
            [
                8568,
                8656
            ],
            [
                8656,
                8922
            ],
            [
                8922,
                8971
            ],
            [
                8971,
                9115
            ],
            [
                9115,
                9227
            ],
            [
                9227,
                9476
            ],
            [
                9476,
                9832
            ],
            [
                9832,
                9932
            ],
            [
                9932,
                10388
            ],
            [
                10388,
                10741
            ],
            [
                10741,
                10985
            ],
            [
                10985,
                11010
            ],
            [
                11010,
                11118
            ],
            [
                11118,
                11128
            ],
            [
                11128,
                11352
            ],
            [
                11352,
                11530
            ],
            [
                11530,
                11563
            ],
            [
                11563,
                11663
            ],
            [
                11663,
                11676
            ],
            [
                11676,
                11840
            ],
            [
                11840,
                11853
            ],
            [
                11853,
                12200
            ],
            [
                12200,
                12278
            ],
            [
                12278,
                12522
            ],
            [
                12522,
                12866
            ],
            [
                12866,
                13010
            ],
            [
                13010,
                13117
            ],
            [
                13117,
                13528
            ],
            [
                13528,
                13732
            ],
            [
                13732,
                13954
            ],
            [
                13954,
                14101
            ],
            [
                14101,
                14344
            ],
            [
                14344,
                14367
            ],
            [
                14367,
                14445
            ],
            [
                14445,
                14553
            ],
            [
                14553,
                14606
            ],
            [
                14606,
                14659
            ],
            [
                14659,
                14722
            ],
            [
                14722,
                14734
            ],
            [
                14734,
                14862
            ],
            [
                14862,
                14921
            ],
            [
                14921,
                15033
            ],
            [
                15033,
                15069
            ],
            [
                15069,
                15215
            ],
            [
                15215,
                15270
            ],
            [
                15270,
                15424
            ],
            [
                15424,
                15601
            ],
            [
                15601,
                15898
            ],
            [
                15898,
                16170
            ],
            [
                16170,
                16359
            ],
            [
                16359,
                16631
            ],
            [
                16631,
                16900
            ],
            [
                16900,
                17128
            ],
            [
                17128,
                17793
            ],
            [
                17793,
                17847
            ],
            [
                17847,
                18261
            ],
            [
                18261,
                18467
            ],
            [
                18467,
                18672
            ],
            [
                18672,
                18948
            ],
            [
                18948,
                19138
            ],
            [
                19138,
                19412
            ]
        ],
        "segment_chars": [
            [
                0,
                88
            ],
            [
                88,
                159
            ],
            [
                159,
                345
            ],
            [
                345,
                429
            ],
            [
                429,
                508
            ],
            [
                508,
                573
            ],
            [
                573,
                714
            ],
            [
                714,
                781
            ],
            [
                781,
                811
            ],
            [
                811,
                915
            ],
            [
                915,
                1005
            ],
            [
                1005,
                1088
            ],
            [
                1088,
                1182
            ],
            [
                1182,
                1202
            ],
            [
                1202,
                1219
            ],
            [
                1219,
                1357
            ],
            [
                1357,
                1452
            ],
            [
                1452,
                1543
            ],
            [
                1543,
                1589
            ],
            [
                1589,
                1662
            ],
            [
                1662,
                1670
            ],
            [
                1670,
                1713
            ],
            [
                1713,
                1779
            ],
            [
                1779,
                1799
            ],
            [
                1799,
                1804
            ],
            [
                1804,
                1834
            ],
            [
                1834,
                1943
            ],
            [
                1943,
                1993
            ],
            [
                1993,
                2036
            ],
            [
                2036,
                2129
            ],
            [
                2129,
                2144
            ],
            [
                2144,
                2157
            ],
            [
                2157,
                2206
            ],
            [
                2206,
                2221
            ],
            [
                2221,
                2234
            ],
            [
                2234,
                2309
            ],
            [
                2309,
                2367
            ],
            [
                2367,
                2425
            ],
            [
                2425,
                2449
            ],
            [
                2449,
                2477
            ],
            [
                2477,
                2501
            ],
            [
                2501,
                2608
            ],
            [
                2608,
                2645
            ],
            [
                2645,
                2679
            ],
            [
                2679,
                2690
            ],
            [
                2690,
                2755
            ],
            [
                2755,
                2765
            ],
            [
                2765,
                2787
            ],
            [
                2787,
                2800
            ],
            [
                2800,
                2812
            ],
            [
                2812,
                2864
            ],
            [
                2864,
                2932
            ],
            [
                2932,
                3022
            ],
            [
                3022,
                3032
            ],
            [
                3032,
                3171
            ],
            [
                3171,
                3211
            ],
            [
                3211,
                3282
            ],
            [
                3282,
                3319
            ],
            [
                3319,
                3417
            ],
            [
                3417,
                3455
            ],
            [
                3455,
                3473
            ],
            [
                3473,
                3496
            ],
            [
                3496,
                3575
            ],
            [
                3575,
                3580
            ],
            [
                3580,
                3615
            ],
            [
                3615,
                3687
            ],
            [
                3687,
                3699
            ],
            [
                3699,
                3786
            ],
            [
                3786,
                3839
            ],
            [
                3839,
                3860
            ],
            [
                3860,
                3969
            ],
            [
                3969,
                3997
            ],
            [
                3997,
                4064
            ],
            [
                4064,
                4126
            ],
            [
                4126,
                4180
            ],
            [
                4180,
                4193
            ],
            [
                4193,
                4215
            ],
            [
                4215,
                4231
            ],
            [
                4231,
                4253
            ],
            [
                4253,
                4287
            ],
            [
                4287,
                4317
            ],
            [
                4317,
                4436
            ],
            [
                4436,
                4484
            ],
            [
                4484,
                4614
            ],
            [
                4614,
                4861
            ],
            [
                4861,
                4977
            ],
            [
                4977,
                5087
            ],
            [
                5087,
                5125
            ],
            [
                5125,
                5147
            ],
            [
                5147,
                5280
            ],
            [
                5280,
                5315
            ],
            [
                5315,
                5351
            ],
            [
                5351,
                5431
            ],
            [
                5431,
                5485
            ],
            [
                5485,
                5523
            ],
            [
                5523,
                5534
            ],
            [
                5534,
                5574
            ],
            [
                5574,
                5580
            ],
            [
                5580,
                5713
            ],
            [
                5713,
                5801
            ],
            [
                5801,
                5898
            ],
            [
                5898,
                6053
            ],
            [
                6053,
                6163
            ],
            [
                6163,
                6178
            ],
            [
                6178,
                6197
            ],
            [
                6197,
                6235
            ],
            [
                6235,
                6262
            ],
            [
                6262,
                6290
            ],
            [
                6290,
                6383
            ],
            [
                6383,
                6413
            ],
            [
                6413,
                6484
            ],
            [
                6484,
                6603
            ],
            [
                6603,
                6623
            ],
            [
                6623,
                6773
            ],
            [
                6773,
                6894
            ],
            [
                6894,
                7017
            ],
            [
                7017,
                7057
            ],
            [
                7057,
                7105
            ],
            [
                7105,
                7149
            ],
            [
                7149,
                7248
            ],
            [
                7248,
                7298
            ],
            [
                7298,
                7302
            ],
            [
                7302,
                7347
            ],
            [
                7347,
                7440
            ],
            [
                7440,
                7659
            ],
            [
                7659,
                7717
            ],
            [
                7717,
                7748
            ],
            [
                7748,
                7799
            ],
            [
                7799,
                7910
            ],
            [
                7910,
                7994
            ],
            [
                7994,
                8045
            ],
            [
                8045,
                8083
            ],
            [
                8083,
                8115
            ],
            [
                8115,
                8181
            ],
            [
                8181,
                8203
            ],
            [
                8203,
                8215
            ],
            [
                8215,
                8256
            ],
            [
                8256,
                8303
            ],
            [
                8303,
                8380
            ],
            [
                8380,
                8486
            ],
            [
                8486,
                8568
            ],
            [
                8568,
                8656
            ],
            [
                8656,
                8855
            ],
            [
                8855,
                8922
            ],
            [
                8922,
                8971
            ],
            [
                8971,
                9115
            ],
            [
                9115,
                9145
            ],
            [
                9145,
                9186
            ],
            [
                9186,
                9227
            ],
            [
                9227,
                9305
            ],
            [
                9305,
                9326
            ],
            [
                9326,
                9336
            ],
            [
                9336,
                9476
            ],
            [
                9476,
                9639
            ],
            [
                9639,
                9761
            ],
            [
                9761,
                9832
            ],
            [
                9832,
                9932
            ],
            [
                9932,
                10097
            ],
            [
                10097,
                10115
            ],
            [
                10115,
                10180
            ],
            [
                10180,
                10224
            ],
            [
                10224,
                10388
            ],
            [
                10388,
                10432
            ],
            [
                10432,
                10471
            ],
            [
                10471,
                10524
            ],
            [
                10524,
                10529
            ],
            [
                10529,
                10566
            ],
            [
                10566,
                10570
            ],
            [
                10570,
                10612
            ],
            [
                10612,
                10616
            ],
            [
                10616,
                10634
            ],
            [
                10634,
                10691
            ],
            [
                10691,
                10722
            ],
            [
                10722,
                10741
            ],
            [
                10741,
                10771
            ],
            [
                10771,
                10869
            ],
            [
                10869,
                10908
            ],
            [
                10908,
                10985
            ],
            [
                10985,
                11010
            ],
            [
                11010,
                11118
            ],
            [
                11118,
                11128
            ],
            [
                11128,
                11145
            ],
            [
                11145,
                11172
            ],
            [
                11172,
                11235
            ],
            [
                11235,
                11279
            ],
            [
                11279,
                11352
            ],
            [
                11352,
                11398
            ],
            [
                11398,
                11530
            ],
            [
                11530,
                11563
            ],
            [
                11563,
                11584
            ],
            [
                11584,
                11633
            ],
            [
                11633,
                11663
            ],
            [
                11663,
                11676
            ],
            [
                11676,
                11840
            ],
            [
                11840,
                11853
            ],
            [
                11853,
                11933
            ],
            [
                11933,
                12026
            ],
            [
                12026,
                12071
            ],
            [
                12071,
                12116
            ],
            [
                12116,
                12200
            ],
            [
                12200,
                12278
            ],
            [
                12278,
                12328
            ],
            [
                12328,
                12357
            ],
            [
                12357,
                12379
            ],
            [
                12379,
                12439
            ],
            [
                12439,
                12522
            ],
            [
                12522,
                12542
            ],
            [
                12542,
                12771
            ],
            [
                12771,
                12809
            ],
            [
                12809,
                12866
            ],
            [
                12866,
                12875
            ],
            [
                12875,
                12930
            ],
            [
                12930,
                13010
            ],
            [
                13010,
                13117
            ],
            [
                13117,
                13165
            ],
            [
                13165,
                13288
            ],
            [
                13288,
                13334
            ],
            [
                13334,
                13383
            ],
            [
                13383,
                13528
            ],
            [
                13528,
                13592
            ],
            [
                13592,
                13679
            ],
            [
                13679,
                13702
            ],
            [
                13702,
                13732
            ],
            [
                13732,
                13768
            ],
            [
                13768,
                13854
            ],
            [
                13854,
                13902
            ],
            [
                13902,
                13954
            ],
            [
                13954,
                13985
            ],
            [
                13985,
                14027
            ],
            [
                14027,
                14058
            ],
            [
                14058,
                14101
            ],
            [
                14101,
                14199
            ],
            [
                14199,
                14224
            ],
            [
                14224,
                14344
            ],
            [
                14344,
                14367
            ],
            [
                14367,
                14402
            ],
            [
                14402,
                14445
            ],
            [
                14445,
                14519
            ],
            [
                14519,
                14553
            ],
            [
                14553,
                14581
            ],
            [
                14581,
                14606
            ],
            [
                14606,
                14659
            ],
            [
                14659,
                14707
            ],
            [
                14707,
                14722
            ],
            [
                14722,
                14734
            ],
            [
                14734,
                14788
            ],
            [
                14788,
                14808
            ],
            [
                14808,
                14836
            ],
            [
                14836,
                14862
            ],
            [
                14862,
                14921
            ],
            [
                14921,
                14960
            ],
            [
                14960,
                15001
            ],
            [
                15001,
                15033
            ],
            [
                15033,
                15051
            ],
            [
                15051,
                15069
            ],
            [
                15069,
                15127
            ],
            [
                15127,
                15215
            ],
            [
                15215,
                15238
            ],
            [
                15238,
                15270
            ],
            [
                15270,
                15303
            ],
            [
                15303,
                15346
            ],
            [
                15346,
                15424
            ],
            [
                15424,
                15514
            ],
            [
                15514,
                15535
            ],
            [
                15535,
                15601
            ],
            [
                15601,
                15771
            ],
            [
                15771,
                15826
            ],
            [
                15826,
                15898
            ],
            [
                15898,
                16170
            ],
            [
                16170,
                16227
            ],
            [
                16227,
                16283
            ],
            [
                16283,
                16359
            ],
            [
                16359,
                16439
            ],
            [
                16439,
                16508
            ],
            [
                16508,
                16551
            ],
            [
                16551,
                16631
            ],
            [
                16631,
                16681
            ],
            [
                16681,
                16779
            ],
            [
                16779,
                16834
            ],
            [
                16834,
                16871
            ],
            [
                16871,
                16900
            ],
            [
                16900,
                16964
            ],
            [
                16964,
                17049
            ],
            [
                17049,
                17128
            ],
            [
                17128,
                17148
            ],
            [
                17148,
                17486
            ],
            [
                17486,
                17650
            ],
            [
                17650,
                17793
            ],
            [
                17793,
                17806
            ],
            [
                17806,
                17833
            ],
            [
                17833,
                17847
            ],
            [
                17847,
                17902
            ],
            [
                17902,
                17966
            ],
            [
                17966,
                18007
            ],
            [
                18007,
                18067
            ],
            [
                18067,
                18132
            ],
            [
                18132,
                18153
            ],
            [
                18153,
                18261
            ],
            [
                18261,
                18297
            ],
            [
                18297,
                18351
            ],
            [
                18351,
                18418
            ],
            [
                18418,
                18467
            ],
            [
                18467,
                18528
            ],
            [
                18528,
                18591
            ],
            [
                18591,
                18672
            ],
            [
                18672,
                18691
            ],
            [
                18691,
                18739
            ],
            [
                18739,
                18782
            ],
            [
                18782,
                18948
            ],
            [
                18948,
                19075
            ],
            [
                19075,
                19138
            ],
            [
                19138,
                19300
            ],
            [
                19300,
                19349
            ],
            [
                19349,
                19412
            ]
        ],
        "overlap_chars": [
            [
                0,
                88
            ],
            [
                88,
                157
            ],
            [
                157,
                159
            ],
            [
                159,
                210
            ],
            [
                211,
                271
            ],
            [
                280,
                345
            ],
            [
                345,
                366
            ],
            [
                380,
                408
            ],
            [
                411,
                427
            ],
            [
                427,
                429
            ],
            [
                429,
                490
            ],
            [
                491,
                508
            ],
            [
                508,
                540
            ],
            [
                550,
                573
            ],
            [
                573,
                637
            ],
            [
                637,
                638
            ],
            [
                639,
                691
            ],
            [
                692,
                714
            ],
            [
                714,
                722
            ],
            [
                723,
                780
            ],
            [
                781,
                809
            ],
            [
                809,
                811
            ],
            [
                811,
                818
            ],
            [
                825,
                856
            ],
            [
                856,
                915
            ],
            [
                915,
                1005
            ],
            [
                1005,
                1088
            ],
            [
                1088,
                1135
            ],
            [
                1136,
                1182
            ],
            [
                1182,
                1200
            ],
            [
                1200,
                1202
            ],
            [
                1202,
                1207
            ],
            [
                1208,
                1217
            ],
            [
                1217,
                1219
            ],
            [
                1219,
                1222
            ],
            [
                1230,
                1259
            ],
            [
                1267,
                1314
            ],
            [
                1324,
                1329
            ],
            [
                1330,
                1357
            ],
            [
                1357,
                1405
            ],
            [
                1406,
                1452
            ],
            [
                1452,
                1543
            ],
            [
                1543,
                1572
            ],
            [
                1573,
                1589
            ],
            [
                1589,
                1624
            ],
            [
                1624,
                1629
            ],
            [
                1630,
                1661
            ],
            [
                1662,
                1670
            ],
            [
                1670,
                1713
            ],
            [
                1713,
                1779
            ],
            [
                1779,
                1780
            ],
            [
                1780,
                1782
            ],
            [
                1783,
                1791
            ],
            [
                1792,
                1799
            ],
            [
                1799,
                1804
            ],
            [
                1804,
                1807
            ],
            [
                1808,
                1834
            ],
            [
                1834,
                1943
            ],
            [
                1943,
                1957
            ],
            [
                1965,
                1993
            ],
            [
                1998,
                2006
            ],
            [
                2007,
                2014
            ],
            [
                2017,
                2036
            ],
            [
                2036,
                2073
            ],
            [
                2074,
                2075
            ],
            [
                2075,
                2119
            ],
            [
                2126,
                2129
            ],
            [
                2129,
                2144
            ],
            [
                2144,
                2157
            ],
            [
                2157,
                2160
            ],
            [
                2161,
                2206
            ],
            [
                2206,
                2210
            ],
            [
                2211,
                2216
            ],
            [
                2219,
                2221
            ],
            [
                2221,
                2234
            ],
            [
                2234,
                2266
            ],
            [
                2269,
                2287
            ],
            [
                2290,
                2307
            ],
            [
                2307,
                2309
            ],
            [
                2309,
                2367
            ],
            [
                2367,
                2381
            ],
            [
                2382,
                2384
            ],
            [
                2391,
                2393
            ],
            [
                2394,
                2402
            ],
            [
                2403,
                2425
            ],
            [
                2425,
                2447
            ],
            [
                2447,
                2449
            ],
            [
                2449,
                2450
            ],
            [
                2460,
                2477
            ],
            [
                2477,
                2501
            ],
            [
                2501,
                2608
            ],
            [
                2608,
                2645
            ],
            [
                2645,
                2666
            ],
            [
                2672,
                2679
            ],
            [
                2679,
                2690
            ],
            [
                2693,
                2717
            ],
            [
                2717,
                2729
            ],
            [
                2730,
                2755
            ],
            [
                2755,
                2765
            ],
            [
                2765,
                2787
            ],
            [
                2787,
                2800
            ],
            [
                2800,
                2812
            ],
            [
                2812,
                2864
            ],
            [
                2864,
                2871
            ],
            [
                2872,
                2932
            ],
            [
                2932,
                3020
            ],
            [
                3020,
                3022
            ],
            [
                3022,
                3032
            ],
            [
                3032,
                3101
            ],
            [
                3113,
                3115
            ],
            [
                3119,
                3171
            ],
            [
                3171,
                3177
            ],
            [
                3186,
                3204
            ],
            [
                3209,
                3211
            ],
            [
                3211,
                3274
            ],
            [
                3280,
                3282
            ],
            [
                3282,
                3319
            ],
            [
                3319,
                3391
            ],
            [
                3392,
                3417
            ],
            [
                3417,
                3453
            ],
            [
                3453,
                3455
            ],
            [
                3455,
                3456
            ],
            [
                3456,
                3471
            ],
            [
                3471,
                3473
            ],
            [
                3473,
                3496
            ],
            [
                3496,
                3534
            ],
            [
                3550,
                3575
            ],
            [
                3575,
                3580
            ],
            [
                3581,
                3585
            ],
            [
                3586,
                3615
            ],
            [
                3615,
                3687
            ],
            [
                3687,
                3699
            ],
            [
                3699,
                3744
            ],
            [
                3747,
                3766
            ],
            [
                3770,
                3784
            ],
            [
                3784,
                3786
            ],
            [
                3786,
                3823
            ],
            [
                3823,
                3824
            ],
            [
                3825,
                3836
            ],
            [
                3836,
                3839
            ],
            [
                3839,
                3842
            ],
            [
                3843,
                3860
            ],
            [
                3860,
                3968
            ],
            [
                3971,
                3983
            ],
            [
                3984,
                3987
            ],
            [
                3995,
                3997
            ],
            [
                3997,
                4042
            ],
            [
                4048,
                4064
            ],
            [
                4064,
                4126
            ],
            [
                4126,
                4155
            ],
            [
                4158,
                4180
            ],
            [
                4180,
                4193
            ],
            [
                4193,
                4214
            ],
            [
                4215,
                4231
            ],
            [
                4231,
                4252
            ],
            [
                4253,
                4287
            ],
            [
                4287,
                4317
            ],
            [
                4317,
                4434
            ],
            [
                4434,
                4436
            ],
            [
                4436,
                4451
            ],
            [
                4452,
                4484
            ],
            [
                4484,
                4541
            ],
            [
                4542,
                4613
            ],
            [
                4627,
                4633
            ],
            [
                4634,
                4640
            ],
            [
                4654,
                4655
            ],
            [
                4683,
                4684
            ],
            [
                4704,
                4724
            ],
            [
                4730,
                4771
            ],
            [
                4771,
                4776
            ],
            [
                4777,
                4816
            ],
            [
                4817,
                4853
            ],
            [
                4859,
                4861
            ],
            [
                4861,
                4906
            ],
            [
                4907,
                4977
            ],
            [
                4977,
                4984
            ],
            [
                4985,
                5060
            ],
            [
                5065,
                5087
            ],
            [
                5087,
                5125
            ],
            [
                5125,
                5147
            ],
            [
                5147,
                5280
            ],
            [
                5280,
                5313
            ],
            [
                5315,
                5351
            ],
            [
                5355,
                5364
            ],
            [
                5371,
                5374
            ],
            [
                5382,
                5431
            ],
            [
                5444,
                5445
            ],
            [
                5446,
                5468
            ],
            [
                5469,
                5472
            ],
            [
                5473,
                5485
            ],
            [
                5485,
                5523
            ],
            [
                5523,
                5534
            ],
            [
                5534,
                5541
            ],
            [
                5542,
                5574
            ],
            [
                5574,
                5580
            ],
            [
                5580,
                5713
            ],
            [
                5713,
                5746
            ],
            [
                5747,
                5750
            ],
            [
                5757,
                5801
            ],
            [
                5801,
                5862
            ],
            [
                5878,
                5898
            ],
            [
                5898,
                6053
            ],
            [
                6053,
                6098
            ],
            [
                6099,
                6152
            ],
            [
                6160,
                6162
            ],
            [
                6163,
                6178
            ],
            [
                6179,
                6197
            ],
            [
                6197,
                6216
            ],
            [
                6220,
                6229
            ],
            [
                6230,
                6233
            ],
            [
                6233,
                6234
            ],
            [
                6235,
                6262
            ],
            [
                6262,
                6263
            ],
            [
                6268,
                6278
            ],
            [
                6279,
                6287
            ],
            [
                6290,
                6383
            ],
            [
                6383,
                6413
            ],
            [
                6413,
                6482
            ],
            [
                6484,
                6497
            ],
            [
                6505,
                6507
            ],
            [
                6508,
                6601
            ],
            [
                6603,
                6623
            ],
            [
                6623,
                6762
            ],
            [
                6771,
                6773
            ],
            [
                6776,
                6778
            ],
            [
                6783,
                6823
            ],
            [
                6824,
                6861
            ],
            [
                6862,
                6875
            ],
            [
                6876,
                6881
            ],
            [
                6882,
                6892
            ],
            [
                6892,
                6894
            ],
            [
                6894,
                6900
            ],
            [
                6901,
                6904
            ],
            [
                6905,
                6937
            ],
            [
                6938,
                6948
            ],
            [
                6949,
                6967
            ],
            [
                6968,
                7017
            ],
            [
                7017,
                7054
            ],
            [
                7057,
                7103
            ],
            [
                7103,
                7105
            ],
            [
                7106,
                7149
            ],
            [
                7149,
                7152
            ],
            [
                7157,
                7248
            ],
            [
                7248,
                7298
            ],
            [
                7298,
                7302
            ],
            [
                7302,
                7315
            ],
            [
                7329,
                7336
            ],
            [
                7341,
                7345
            ],
            [
                7345,
                7347
            ],
            [
                7347,
                7408
            ],
            [
                7408,
                7438
            ],
            [
                7438,
                7440
            ],
            [
                7440,
                7565
            ],
            [
                7566,
                7585
            ],
            [
                7588,
                7624
            ],
            [
                7627,
                7659
            ],
            [
                7687,
                7717
            ],
            [
                7717,
                7748
            ],
            [
                7748,
                7749
            ],
            [
                7749,
                7767
            ],
            [
                7767,
                7769
            ],
            [
                7775,
                7797
            ],
            [
                7797,
                7799
            ],
            [
                7814,
                7815
            ],
            [
                7816,
                7907
            ],
            [
                7907,
                7910
            ],
            [
                7910,
                7911
            ],
            [
                7911,
                7991
            ],
            [
                7991,
                7994
            ],
            [
                7995,
                8045
            ],
            [
                8045,
                8083
            ],
            [
                8083,
                8115
            ],
            [
                8115,
                8181
            ],
            [
                8181,
                8203
            ],
            [
                8203,
                8215
            ],
            [
                8215,
                8218
            ],
            [
                8241,
                8243
            ],
            [
                8254,
                8256
            ],
            [
                8256,
                8283
            ],
            [
                8290,
                8303
            ],
            [
                8303,
                8353
            ],
            [
                8354,
                8357
            ],
            [
                8358,
                8378
            ],
            [
                8378,
                8380
            ],
            [
                8380,
                8486
            ],
            [
                8486,
                8568
            ],
            [
                8568,
                8616
            ],
            [
                8617,
                8656
            ],
            [
                8656,
                8736
            ],
            [
                8736,
                8855
            ],
            [
                8855,
                8922
            ],
            [
                8922,
                8971
            ],
            [
                8971,
                9069
            ],
            [
                9070,
                9114
            ],
            [
                9115,
                9145
            ],
            [
                9145,
                9165
            ],
            [
                9166,
                9186
            ],
            [
                9186,
                9226
            ],
            [
                9227,
                9305
            ],
            [
                9305,
                9326
            ],
            [
                9326,
                9336
            ],
            [
                9336,
                9476
            ],
            [
                9476,
                9529
            ],
            [
                9529,
                9532
            ],
            [
                9532,
                9639
            ],
            [
                9639,
                9640
            ],
            [
                9641,
                9645
            ],
            [
                9658,
                9759
            ],
            [
                9759,
                9761
            ],
            [
                9761,
                9832
            ],
            [
                9832,
                9885
            ],
            [
                9885,
                9932
            ],
            [
                9932,
                10095
            ],
            [
                10095,
                10097
            ],
            [
                10097,
                10115
            ],
            [
                10115,
                10130
            ],
            [
                10131,
                10140
            ],
            [
                10140,
                10180
            ],
            [
                10180,
                10224
            ],
            [
                10224,
                10249
            ],
            [
                10252,
                10280
            ],
            [
                10283,
                10316
            ],
            [
                10338,
                10359
            ],
            [
                10360,
                10388
            ],
            [
                10388,
                10419
            ],
            [
                10420,
                10424
            ],
            [
                10430,
                10432
            ],
            [
                10432,
                10445
            ],
            [
                10469,
                10471
            ],
            [
                10475,
                10479
            ],
            [
                10479,
                10498
            ],
            [
                10500,
                10524
            ],
            [
                10524,
                10529
            ],
            [
                10529,
                10566
            ],
            [
                10566,
                10570
            ],
            [
                10570,
                10612
            ],
            [
                10612,
                10616
            ],
            [
                10616,
                10634
            ],
            [
                10646,
                10691
            ],
            [
                10691,
                10722
            ],
            [
                10722,
                10741
            ],
            [
                10741,
                10771
            ],
            [
                10771,
                10799
            ],
            [
                10806,
                10837
            ],
            [
                10838,
                10867
            ],
            [
                10867,
                10869
            ],
            [
                10869,
                10877
            ],
            [
                10881,
                10906
            ],
            [
                10906,
                10908
            ],
            [
                10908,
                10985
            ],
            [
                10985,
                11010
            ],
            [
                11010,
                11062
            ],
            [
                11062,
                11118
            ],
            [
                11118,
                11128
            ],
            [
                11128,
                11145
            ],
            [
                11145,
                11172
            ],
            [
                11172,
                11235
            ],
            [
                11235,
                11279
            ],
            [
                11279,
                11352
            ],
            [
                11352,
                11354
            ],
            [
                11355,
                11398
            ],
            [
                11398,
                11407
            ],
            [
                11407,
                11512
            ],
            [
                11517,
                11530
            ],
            [
                11530,
                11563
            ],
            [
                11563,
                11567
            ],
            [
                11568,
                11584
            ],
            [
                11584,
                11621
            ],
            [
                11622,
                11633
            ],
            [
                11633,
                11663
            ],
            [
                11663,
                11676
            ],
            [
                11676,
                11689
            ],
            [
                11692,
                11702
            ],
            [
                11705,
                11756
            ],
            [
                11761,
                11766
            ],
            [
                11779,
                11782
            ],
            [
                11783,
                11787
            ],
            [
                11788,
                11818
            ],
            [
                11824,
                11840
            ],
            [
                11840,
                11853
            ],
            [
                11853,
                11912
            ],
            [
                11914,
                11933
            ],
            [
                11933,
                11971
            ],
            [
                11971,
                11972
            ],
            [
                11973,
                12013
            ],
            [
                12014,
                12017
            ],
            [
                12018,
                12024
            ],
            [
                12024,
                12026
            ],
            [
                12026,
                12071
            ],
            [
                12071,
                12116
            ],
            [
                12116,
                12123
            ],
            [
                12124,
                12165
            ],
            [
                12165,
                12200
            ],
            [
                12200,
                12252
            ],
            [
                12255,
                12278
            ],
            [
                12278,
                12326
            ],
            [
                12326,
                12328
            ],
            [
                12328,
                12357
            ],
            [
                12357,
                12364
            ],
            [
                12370,
                12379
            ],
            [
                12379,
                12439
            ],
            [
                12439,
                12493
            ],
            [
                12494,
                12522
            ],
            [
                12522,
                12542
            ],
            [
                12542,
                12616
            ],
            [
                12617,
                12621
            ],
            [
                12622,
                12640
            ],
            [
                12641,
                12714
            ],
            [
                12715,
                12730
            ],
            [
                12733,
                12771
            ],
            [
                12771,
                12791
            ],
            [
                12792,
                12806
            ],
            [
                12806,
                12809
            ],
            [
                12809,
                12822
            ],
            [
                12823,
                12865
            ],
            [
                12866,
                12875
            ],
            [
                12875,
                12901
            ],
            [
                12901,
                12902
            ],
            [
                12903,
                12930
            ],
            [
                12930,
                12981
            ],
            [
                12982,
                13010
            ],
            [
                13010,
                13101
            ],
            [
                13102,
                13117
            ],
            [
                13117,
                13163
            ],
            [
                13163,
                13165
            ],
            [
                13166,
                13201
            ],
            [
                13202,
                13227
            ],
            [
                13228,
                13254
            ],
            [
                13263,
                13286
            ],
            [
                13286,
                13288
            ],
            [
                13288,
                13319
            ],
            [
                13320,
                13334
            ],
            [
                13334,
                13383
            ],
            [
                13383,
                13438
            ],
            [
                13438,
                13476
            ],
            [
                13476,
                13528
            ],
            [
                13528,
                13566
            ],
            [
                13572,
                13590
            ],
            [
                13590,
                13592
            ],
            [
                13592,
                13679
            ],
            [
                13679,
                13702
            ],
            [
                13702,
                13732
            ],
            [
                13732,
                13768
            ],
            [
                13768,
                13780
            ],
            [
                13781,
                13791
            ],
            [
                13796,
                13801
            ],
            [
                13802,
                13817
            ],
            [
                13818,
                13835
            ],
            [
                13836,
                13854
            ],
            [
                13854,
                13864
            ],
            [
                13865,
                13902
            ],
            [
                13902,
                13939
            ],
            [
                13940,
                13954
            ],
            [
                13954,
                13983
            ],
            [
                13983,
                13985
            ],
            [
                13985,
                14027
            ],
            [
                14027,
                14056
            ],
            [
                14066,
                14078
            ],
            [
                14079,
                14081
            ],
            [
                14092,
                14101
            ],
            [
                14101,
                14199
            ],
            [
                14199,
                14224
            ],
            [
                14224,
                14344
            ],
            [
                14344,
                14367
            ],
            [
                14367,
                14402
            ],
            [
                14402,
                14424
            ],
            [
                14428,
                14445
            ],
            [
                14445,
                14453
            ],
            [
                14462,
                14470
            ],
            [
                14471,
                14474
            ],
            [
                14479,
                14519
            ],
            [
                14519,
                14532
            ],
            [
                14547,
                14553
            ],
            [
                14553,
                14565
            ],
            [
                14565,
                14579
            ],
            [
                14579,
                14581
            ],
            [
                14581,
                14603
            ],
            [
                14606,
                14613
            ],
            [
                14623,
                14648
            ],
            [
                14656,
                14659
            ],
            [
                14670,
                14705
            ],
            [
                14705,
                14707
            ],
            [
                14707,
                14708
            ],
            [
                14708,
                14711
            ],
            [
                14719,
                14722
            ],
            [
                14722,
                14723
            ],
            [
                14731,
                14734
            ],
            [
                14734,
                14735
            ],
            [
                14735,
                14747
            ],
            [
                14759,
                14788
            ],
            [
                14788,
                14797
            ],
            [
                14806,
                14808
            ],
            [
                14808,
                14836
            ],
            [
                14836,
                14862
            ],
            [
                14862,
                14894
            ],
            [
                14895,
                14898
            ],
            [
                14899,
                14919
            ],
            [
                14919,
                14921
            ],
            [
                14921,
                14958
            ],
            [
                14958,
                14960
            ],
            [
                14960,
                15001
            ],
            [
                15001,
                15033
            ],
            [
                15033,
                15051
            ],
            [
                15051,
                15069
            ],
            [
                15069,
                15108
            ],
            [
                15109,
                15127
            ],
            [
                15135,
                15165
            ],
            [
                15178,
                15213
            ],
            [
                15213,
                15214
            ],
            [
                15215,
                15235
            ],
            [
                15238,
                15262
            ],
            [
                15266,
                15269
            ],
            [
                15270,
                15303
            ],
            [
                15303,
                15322
            ],
            [
                15329,
                15331
            ],
            [
                15335,
                15344
            ],
            [
                15346,
                15422
            ],
            [
                15422,
                15423
            ],
            [
                15424,
                15464
            ],
            [
                15465,
                15468
            ],
            [
                15473,
                15488
            ],
            [
                15492,
                15514
            ],
            [
                15514,
                15532
            ],
            [
                15535,
                15547
            ],
            [
                15560,
                15601
            ],
            [
                15601,
                15644
            ],
            [
                15644,
                15707
            ],
            [
                15712,
                15721
            ],
            [
                15722,
                15759
            ],
            [
                15760,
                15771
            ],
            [
                15771,
                15826
            ],
            [
                15826,
                15898
            ],
            [
                15898,
                15932
            ],
            [
                15933,
                16050
            ],
            [
                16050,
                16169
            ],
            [
                16170,
                16202
            ],
            [
                16202,
                16203
            ],
            [
                16214,
                16225
            ],
            [
                16227,
                16235
            ],
            [
                16236,
                16238
            ],
            [
                16239,
                16283
            ],
            [
                16283,
                16358
            ],
            [
                16359,
                16393
            ],
            [
                16394,
                16439
            ],
            [
                16439,
                16508
            ],
            [
                16508,
                16551
            ],
            [
                16551,
                16631
            ],
            [
                16639,
                16647
            ],
            [
                16648,
                16651
            ],
            [
                16652,
                16681
            ],
            [
                16697,
                16713
            ],
            [
                16714,
                16752
            ],
            [
                16753,
                16779
            ],
            [
                16779,
                16834
            ],
            [
                16834,
                16871
            ],
            [
                16871,
                16885
            ],
            [
                16886,
                16898
            ],
            [
                16898,
                16900
            ],
            [
                16900,
                16964
            ],
            [
                16964,
                17007
            ],
            [
                17007,
                17049
            ],
            [
                17049,
                17098
            ],
            [
                17103,
                17107
            ],
            [
                17108,
                17128
            ],
            [
                17128,
                17148
            ],
            [
                17148,
                17200
            ],
            [
                17201,
                17213
            ],
            [
                17213,
                17330
            ],
            [
                17337,
                17415
            ],
            [
                17415,
                17486
            ],
            [
                17486,
                17552
            ],
            [
                17553,
                17563
            ],
            [
                17567,
                17578
            ],
            [
                17579,
                17632
            ],
            [
                17633,
                17650
            ],
            [
                17650,
                17652
            ],
            [
                17653,
                17670
            ],
            [
                17675,
                17709
            ],
            [
                17713,
                17793
            ],
            [
                17793,
                17806
            ],
            [
                17806,
                17833
            ],
            [
                17833,
                17847
            ],
            [
                17847,
                17854
            ],
            [
                17867,
                17902
            ],
            [
                17902,
                17966
            ],
            [
                17966,
                17997
            ],
            [
                17998,
                18007
            ],
            [
                18007,
                18065
            ],
            [
                18065,
                18067
            ],
            [
                18067,
                18132
            ],
            [
                18132,
                18153
            ],
            [
                18153,
                18235
            ],
            [
                18236,
                18261
            ],
            [
                18261,
                18297
            ],
            [
                18297,
                18351
            ],
            [
                18351,
                18418
            ],
            [
                18418,
                18466
            ],
            [
                18467,
                18485
            ],
            [
                18486,
                18489
            ],
            [
                18496,
                18528
            ],
            [
                18528,
                18544
            ],
            [
                18550,
                18553
            ],
            [
                18559,
                18560
            ],
            [
                18565,
                18591
            ],
            [
                18591,
                18613
            ],
            [
                18613,
                18672
            ],
            [
                18672,
                18691
            ],
            [
                18691,
                18737
            ],
            [
                18739,
                18745
            ],
            [
                18746,
                18752
            ],
            [
                18753,
                18780
            ],
            [
                18780,
                18782
            ],
            [
                18782,
                18907
            ],
            [
                18917,
                18947
            ],
            [
                18955,
                18960
            ],
            [
                18961,
                18963
            ],
            [
                18964,
                18993
            ],
            [
                18996,
                19003
            ],
            [
                19004,
                19075
            ],
            [
                19081,
                19083
            ],
            [
                19084,
                19102
            ],
            [
                19103,
                19136
            ],
            [
                19136,
                19137
            ],
            [
                19138,
                19298
            ],
            [
                19298,
                19300
            ],
            [
                19300,
                19347
            ],
            [
                19355,
                19412
            ]
        ],
        "row_chars": [
            [
                0,
                88
            ],
            [
                88,
                159
            ],
            [
                159,
                345
            ],
            [
                345,
                429
            ],
            [
                429,
                508
            ],
            [
                508,
                573
            ],
            [
                573,
                714
            ],
            [
                714,
                781
            ],
            [
                781,
                781
            ],
            [
                781,
                811
            ],
            [
                811,
                915
            ],
            [
                915,
                1005
            ],
            [
                1005,
                1088
            ],
            [
                1088,
                1182
            ],
            [
                1182,
                1202
            ],
            [
                1202,
                1219
            ],
            [
                1219,
                1357
            ],
            [
                1357,
                1357
            ],
            [
                1357,
                1452
            ],
            [
                1452,
                1543
            ],
            [
                1543,
                1589
            ],
            [
                1589,
                1662
            ],
            [
                1662,
                1662
            ],
            [
                1662,
                1670
            ],
            [
                1670,
                1713
            ],
            [
                1713,
                1779
            ],
            [
                1779,
                1799
            ],
            [
                1799,
                1804
            ],
            [
                1804,
                1834
            ],
            [
                1834,
                1943
            ],
            [
                1943,
                1943
            ],
            [
                1943,
                1943
            ],
            [
                1943,
                1993
            ],
            [
                1993,
                2036
            ],
            [
                2036,
                2129
            ],
            [
                2129,
                2144
            ],
            [
                2144,
                2157
            ],
            [
                2157,
                2206
            ],
            [
                2206,
                2221
            ],
            [
                2221,
                2234
            ],
            [
                2234,
                2309
            ],
            [
                2309,
                2367
            ],
            [
                2367,
                2425
            ],
            [
                2425,
                2449
            ],
            [
                2449,
                2477
            ],
            [
                2477,
                2501
            ],
            [
                2501,
                2608
            ],
            [
                2608,
                2645
            ],
            [
                2645,
                2679
            ],
            [
                2679,
                2690
            ],
            [
                2690,
                2755
            ],
            [
                2755,
                2765
            ],
            [
                2765,
                2787
            ],
            [
                2787,
                2800
            ],
            [
                2800,
                2812
            ],
            [
                2812,
                2864
            ],
            [
                2864,
                2932
            ],
            [
                2932,
                3022
            ],
            [
                3022,
                3032
            ],
            [
                3032,
                3171
            ],
            [
                3171,
                3171
            ],
            [
                3171,
                3211
            ],
            [
                3211,
                3282
            ],
            [
                3282,
                3319
            ],
            [
                3319,
                3417
            ],
            [
                3417,
                3455
            ],
            [
                3455,
                3473
            ],
            [
                3473,
                3496
            ],
            [
                3496,
                3575
            ],
            [
                3575,
                3580
            ],
            [
                3580,
                3580
            ],
            [
                3580,
                3615
            ],
            [
                3615,
                3687
            ],
            [
                3687,
                3699
            ],
            [
                3699,
                3786
            ],
            [
                3786,
                3839
            ],
            [
                3839,
                3860
            ],
            [
                3860,
                3969
            ],
            [
                3969,
                3969
            ],
            [
                3969,
                3997
            ],
            [
                3997,
                4064
            ],
            [
                4064,
                4126
            ],
            [
                4126,
                4180
            ],
            [
                4180,
                4193
            ],
            [
                4193,
                4193
            ],
            [
                4193,
                4215
            ],
            [
                4215,
                4231
            ],
            [
                4231,
                4253
            ],
            [
                4253,
                4253
            ],
            [
                4253,
                4287
            ],
            [
                4287,
                4317
            ],
            [
                4317,
                4436
            ],
            [
                4436,
                4484
            ],
            [
                4484,
                4614
            ],
            [
                4614,
                4614
            ],
            [
                4614,
                4614
            ],
            [
                4614,
                4614
            ],
            [
                4614,
                4861
            ],
            [
                4861,
                4861
            ],
            [
                4861,
                4977
            ],
            [
                4977,
                5087
            ],
            [
                5087,
                5125
            ],
            [
                5125,
                5147
            ],
            [
                5147,
                5280
            ],
            [
                5280,
                5315
            ],
            [
                5315,
                5315
            ],
            [
                5315,
                5315
            ],
            [
                5315,
                5315
            ],
            [
                5315,
                5351
            ],
            [
                5351,
                5351
            ],
            [
                5351,
                5351
            ],
            [
                5351,
                5431
            ],
            [
                5431,
                5485
            ],
            [
                5485,
                5523
            ],
            [
                5523,
                5534
            ],
            [
                5534,
                5534
            ],
            [
                5534,
                5574
            ],
            [
                5574,
                5580
            ],
            [
                5580,
                5713
            ],
            [
                5713,
                5801
            ],
            [
                5801,
                5898
            ],
            [
                5898,
                6053
            ],
            [
                6053,
                6053
            ],
            [
                6053,
                6163
            ],
            [
                6163,
                6163
            ],
            [
                6163,
                6178
            ],
            [
                6178,
                6178
            ],
            [
                6178,
                6197
            ],
            [
                6197,
                6235
            ],
            [
                6235,
                6235
            ],
            [
                6235,
                6235
            ],
            [
                6235,
                6235
            ],
            [
                6235,
                6235
            ],
            [
                6235,
                6262
            ],
            [
                6262,
                6290
            ],
            [
                6290,
                6290
            ],
            [
                6290,
                6290
            ],
            [
                6290,
                6290
            ],
            [
                6290,
                6290
            ],
            [
                6290,
                6290
            ],
            [
                6290,
                6383
            ],
            [
                6383,
                6413
            ],
            [
                6413,
                6603
            ],
            [
                6603,
                6603
            ],
            [
                6603,
                6603
            ],
            [
                6603,
                6623
            ],
            [
                6623,
                6773
            ],
            [
                6773,
                6894
            ],
            [
                6894,
                7017
            ],
            [
                7017,
                7057
            ],
            [
                7057,
                7057
            ],
            [
                7057,
                7057
            ],
            [
                7057,
                7105
            ],
            [
                7105,
                7105
            ],
            [
                7105,
                7105
            ],
            [
                7105,
                7149
            ],
            [
                7149,
                7248
            ],
            [
                7248,
                7298
            ],
            [
                7298,
                7302
            ],
            [
                7302,
                7347
            ],
            [
                7347,
                7440
            ],
            [
                7440,
                7659
            ],
            [
                7659,
                7659
            ],
            [
                7659,
                7659
            ],
            [
                7659,
                7717
            ],
            [
                7717,
                7748
            ],
            [
                7748,
                7799
            ],
            [
                7799,
                7910
            ],
            [
                7910,
                7910
            ],
            [
                7910,
                7910
            ],
            [
                7910,
                7994
            ],
            [
                7994,
                7994
            ],
            [
                7994,
                8045
            ],
            [
                8045,
                8083
            ],
            [
                8083,
                8115
            ],
            [
                8115,
                8181
            ],
            [
                8181,
                8203
            ],
            [
                8203,
                8215
            ],
            [
                8215,
                8215
            ],
            [
                8215,
                8256
            ],
            [
                8256,
                8303
            ],
            [
                8303,
                8380
            ],
            [
                8380,
                8486
            ],
            [
                8486,
                8568
            ],
            [
                8568,
                8656
            ],
            [
                8656,
                8855
            ],
            [
                8855,
                8922
            ],
            [
                8922,
                8971
            ],
            [
                8971,
                9115
            ],
            [
                9115,
                9145
            ],
            [
                9145,
                9186
            ],
            [
                9186,
                9227
            ],
            [
                9227,
                9305
            ],
            [
                9305,
                9326
            ],
            [
                9326,
                9336
            ],
            [
                9336,
                9336
            ],
            [
                9336,
                9476
            ],
            [
                9476,
                9639
            ],
            [
                9639,
                9761
            ],
            [
                9761,
                9761
            ],
            [
                9761,
                9832
            ],
            [
                9832,
                9832
            ],
            [
                9832,
                9832
            ],
            [
                9832,
                9832
            ],
            [
                9832,
                9832
            ],
            [
                9832,
                9832
            ],
            [
                9832,
                9832
            ],
            [
                9832,
                9932
            ],
            [
                9932,
                10097
            ],
            [
                10097,
                10115
            ],
            [
                10115,
                10180
            ],
            [
                10180,
                10224
            ],
            [
                10224,
                10388
            ],
            [
                10388,
                10432
            ],
            [
                10432,
                10471
            ],
            [
                10471,
                10524
            ],
            [
                10524,
                10529
            ],
            [
                10529,
                10566
            ],
            [
                10566,
                10570
            ],
            [
                10570,
                10612
            ],
            [
                10612,
                10616
            ],
            [
                10616,
                10634
            ],
            [
                10634,
                10691
            ],
            [
                10691,
                10722
            ],
            [
                10722,
                10741
            ],
            [
                10741,
                10771
            ],
            [
                10771,
                10869
            ],
            [
                10869,
                10869
            ],
            [
                10869,
                10908
            ],
            [
                10908,
                10985
            ],
            [
                10985,
                11010
            ],
            [
                11010,
                11118
            ],
            [
                11118,
                11128
            ],
            [
                11128,
                11145
            ],
            [
                11145,
                11172
            ],
            [
                11172,
                11235
            ],
            [
                11235,
                11279
            ],
            [
                11279,
                11352
            ],
            [
                11352,
                11398
            ],
            [
                11398,
                11530
            ],
            [
                11530,
                11563
            ],
            [
                11563,
                11584
            ],
            [
                11584,
                11633
            ],
            [
                11633,
                11663
            ],
            [
                11663,
                11676
            ],
            [
                11676,
                11840
            ],
            [
                11840,
                11853
            ],
            [
                11853,
                11933
            ],
            [
                11933,
                12026
            ],
            [
                12026,
                12071
            ],
            [
                12071,
                12116
            ],
            [
                12116,
                12200
            ],
            [
                12200,
                12278
            ],
            [
                12278,
                12328
            ],
            [
                12328,
                12357
            ],
            [
                12357,
                12357
            ],
            [
                12357,
                12379
            ],
            [
                12379,
                12439
            ],
            [
                12439,
                12522
            ],
            [
                12522,
                12542
            ],
            [
                12542,
                12771
            ],
            [
                12771,
                12809
            ],
            [
                12809,
                12866
            ],
            [
                12866,
                12866
            ],
            [
                12866,
                12875
            ],
            [
                12875,
                12930
            ],
            [
                12930,
                13010
            ],
            [
                13010,
                13117
            ],
            [
                13117,
                13165
            ],
            [
                13165,
                13165
            ],
            [
                13165,
                13288
            ],
            [
                13288,
                13288
            ],
            [
                13288,
                13334
            ],
            [
                13334,
                13334
            ],
            [
                13334,
                13383
            ],
            [
                13383,
                13528
            ],
            [
                13528,
                13528
            ],
            [
                13528,
                13592
            ],
            [
                13592,
                13679
            ],
            [
                13679,
                13702
            ],
            [
                13702,
                13732
            ],
            [
                13732,
                13768
            ],
            [
                13768,
                13854
            ],
            [
                13854,
                13902
            ],
            [
                13902,
                13954
            ],
            [
                13954,
                13985
            ],
            [
                13985,
                14027
            ],
            [
                14027,
                14101
            ],
            [
                14101,
                14199
            ],
            [
                14199,
                14224
            ],
            [
                14224,
                14344
            ],
            [
                14344,
                14367
            ],
            [
                14367,
                14402
            ],
            [
                14402,
                14445
            ],
            [
                14445,
                14519
            ],
            [
                14519,
                14553
            ],
            [
                14553,
                14581
            ],
            [
                14581,
                14606
            ],
            [
                14606,
                14606
            ],
            [
                14606,
                14606
            ],
            [
                14606,
                14606
            ],
            [
                14606,
                14606
            ],
            [
                14606,
                14659
            ],
            [
                14659,
                14659
            ],
            [
                14659,
                14707
            ],
            [
                14707,
                14722
            ],
            [
                14722,
                14734
            ],
            [
                14734,
                14788
            ],
            [
                14788,
                14788
            ],
            [
                14788,
                14808
            ],
            [
                14808,
                14836
            ],
            [
                14836,
                14836
            ],
            [
                14836,
                14862
            ],
            [
                14862,
                14921
            ],
            [
                14921,
                14960
            ],
            [
                14960,
                15001
            ],
            [
                15001,
                15033
            ],
            [
                15033,
                15051
            ],
            [
                15051,
                15069
            ],
            [
                15069,
                15127
            ],
            [
                15127,
                15215
            ],
            [
                15215,
                15270
            ],
            [
                15270,
                15270
            ],
            [
                15270,
                15303
            ],
            [
                15303,
                15346
            ],
            [
                15346,
                15424
            ],
            [
                15424,
                15514
            ],
            [
                15514,
                15535
            ],
            [
                15535,
                15535
            ],
            [
                15535,
                15601
            ],
            [
                15601,
                15771
            ],
            [
                15771,
                15826
            ],
            [
                15826,
                15826
            ],
            [
                15826,
                15898
            ],
            [
                15898,
                16170
            ],
            [
                16170,
                16227
            ],
            [
                16227,
                16283
            ],
            [
                16283,
                16359
            ],
            [
                16359,
                16439
            ],
            [
                16439,
                16508
            ],
            [
                16508,
                16551
            ],
            [
                16551,
                16631
            ],
            [
                16631,
                16681
            ],
            [
                16681,
                16681
            ],
            [
                16681,
                16779
            ],
            [
                16779,
                16834
            ],
            [
                16834,
                16871
            ],
            [
                16871,
                16871
            ],
            [
                16871,
                16900
            ],
            [
                16900,
                16964
            ],
            [
                16964,
                17049
            ],
            [
                17049,
                17128
            ],
            [
                17128,
                17148
            ],
            [
                17148,
                17148
            ],
            [
                17148,
                17486
            ],
            [
                17486,
                17650
            ],
            [
                17650,
                17793
            ],
            [
                17793,
                17806
            ],
            [
                17806,
                17833
            ],
            [
                17833,
                17847
            ],
            [
                17847,
                17902
            ],
            [
                17902,
                17966
            ],
            [
                17966,
                18007
            ],
            [
                18007,
                18007
            ],
            [
                18007,
                18067
            ],
            [
                18067,
                18067
            ],
            [
                18067,
                18067
            ],
            [
                18067,
                18132
            ],
            [
                18132,
                18153
            ],
            [
                18153,
                18153
            ],
            [
                18153,
                18261
            ],
            [
                18261,
                18297
            ],
            [
                18297,
                18351
            ],
            [
                18351,
                18418
            ],
            [
                18418,
                18467
            ],
            [
                18467,
                18467
            ],
            [
                18467,
                18467
            ],
            [
                18467,
                18467
            ],
            [
                18467,
                18467
            ],
            [
                18467,
                18467
            ],
            [
                18467,
                18467
            ],
            [
                18467,
                18467
            ],
            [
                18467,
                18528
            ],
            [
                18528,
                18591
            ],
            [
                18591,
                18672
            ],
            [
                18672,
                18691
            ],
            [
                18691,
                18782
            ],
            [
                18782,
                18948
            ],
            [
                18948,
                18948
            ],
            [
                18948,
                19075
            ],
            [
                19075,
                19138
            ],
            [
                19138,
                19138
            ],
            [
                19138,
                19138
            ],
            [
                19138,
                19138
            ],
            [
                19138,
                19300
            ],
            [
                19300,
                19412
            ]
        ]
    }
}