{
    "original": {
        "text": "Although the morning was raw, and although the fog still seemed heavy--I say seemed, for the windows were so encrusted with dirt that they would have made midsummer sunshine dim--I was sufficiently forewarned of the discomfort within doors at that early hour and sufficiently curious about London to think it a good idea on the part of Miss Jellyby when she proposed that we should go out for a walk.\n\"Ma won't be down for ever so long,\" she said, \"and then it's a chance if breakfast's ready for an hour afterwards, they dawdle so. As to Pa, he gets what he can and goes to the office. He never has what you would call a regular breakfast. Priscilla leaves him out the loaf and some milk, when there is any, overnight. Sometimes there isn't any milk, and sometimes the cat drinks it. But I'm afraid you must be tired, Miss Summerson, and perhaps you would rather go to bed.\"\n\"I am not at all tired, my dear,\" said I, \"and would much prefer to go out.\"\n\"If you're sure you would,\" returned Miss Jellyby, \"I'll get my things on.\"\nAda said she would go too, and was soon astir. I made a proposal to Peepy, in default of being able to do anything better for him, that he should let me wash him and afterwards lay him down on my bed again. To this he submitted with the best grace possible, staring at me during the whole operation as if he never had been, and never could again be, so astonished in his life--looking very miserable also, certainly, but making no complaint, and going snugly to sleep as soon as it was over. At first I was in two minds about taking such a liberty, but I soon reflected that nobody in the house was likely to notice it.\nWhat with the bustle of dispatching Peepy and the bustle of getting myself ready and helping Ada, I was soon quite in a glow. We found Miss Jellyby trying to warm herself at the fire in the writing-room, which Priscilla was then lighting with a smutty parlour candlestick, throwing the candle in to make it burn better. Everything was just as we had left it last night and was evidently intended to remain so. Below-stairs the dinner-cloth had not been taken away, but had been left ready for breakfast. Crumbs, dust, and waste-paper were all over the house. Some pewter pots and a milk-can hung on the area railings; the door stood open; and we met the cook round the corner coming out of a public-house, wiping her mouth. She mentioned, as she passed us, that she had been to see what o'clock it was.\nBut before we met the cook, we met Richard, who was dancing up and down Thavies Inn to warm his feet. He was agreeably surprised to see us stirring so soon and said he would gladly share our walk. So he took care of Ada, and Miss Jellyby and I went first. I may mention that Miss Jellyby had relapsed into her sulky manner and that I really should not have thought she liked me much unless she had told me so.\n\"Where would you wish to go?\" she asked.\n\"Anywhere, my dear,\" I replied.\n\"Anywhere's nowhere,\" said Miss Jellyby, stopping perversely.\n\"Let us go somewhere at any rate,\" said I.\nShe then walked me on very fast.\n\"I don't care!\" she said. \"Now, you are my witness, Miss Summerson, I say I don't care--but if he was to come to our house with his great, shining, lumpy forehead night after night till he was as old as Methuselah, I wouldn't have anything to say to him. Such ASSES as he and Ma make of themselves!\"\n\"My dear!\" I remonstrated, in allusion to the epithet and the vigorous emphasis Miss Jellyby set upon it. \"Your duty as a child--\"\n\"Oh! Don't talk of duty as a child, Miss Summerson; where's Ma's duty as a parent? All made over to the public and Africa, I suppose! Then let the public and Africa show duty as a child; it's much more their affair than mine. You are shocked, I dare say! Very well, so am I shocked too; so we are both shocked, and there's an end of it!\"\nShe walked me on faster yet.\n\"But for all that, I say again, he may come, and come, and come, and I won't have anything to say to him. I can't bear him. If there's any stuff in the world that I hate and detest, it's the stuff he and Ma talk. I wonder the very paving-stones opposite our house can have the patience to stay there and be a witness of such inconsistencies and contradictions as all that sounding nonsense, and Ma's management!\"\nI could not but understand her to refer to Mr. Quale, the young gentleman who had appeared after dinner yesterday. I was saved the disagreeable necessity of pursuing the subject by Richard and Ada coming up at a round pace, laughing and asking us if we meant to run a race. Thus interrupted, Miss Jellyby became silent and walked moodily on at my side while I admired the long successions and varieties of streets, the quantity of people already going to and fro, the number of vehicles passing and repassing, the busy preparations in the setting forth of shop windows and the sweeping out of shops, and the extraordinary creatures in rags secretly groping among the swept-out rubbish for pins and other refuse.\n\"So, cousin,\" said the cheerful voice of Richard to Ada behind me. \"We are never to get out of Chancery! We have come by another way to our place of meeting yesterday, and--by the Great Seal, here's the old lady again!\"\nTruly, there she was, immediately in front of us, curtsying, and smiling, and saying with her yesterday's air of patronage, \"The wards in Jarndyce! Ve-ry happy, I am sure!\"\n\"You are out early, ma'am,\" said I as she curtsied to me.\n\"Ye-es! I usually walk here early. Before the court sits. It's retired. I collect my thoughts here for the business of the day,\" said the old lady mincingly. \"The business of the day requires a great deal of thought. Chancery justice is so ve-ry difficult to follow.\"\n\"Who's this, Miss Summerson?\" whispered Miss Jellyby, drawing my arm tighter through her own.\nThe little old lady's hearing was remarkably quick. She answered for herself directly.\n\"A suitor, my child. At your service. I have the honour to attend court regularly. With my documents. Have I the pleasure of addressing another of the youthful parties in Jarndyce?\" said the old lady, recovering herself, with her head on one side, from a very low curtsy.\nRichard, anxious to atone for his thoughtlessness of yesterday, good-naturedly explained that Miss Jellyby was not connected with the suit.\n\"Ha!\" said the old lady. \"She does not expect a judgment? She will still grow old. But not so old. Oh, dear, no! This is the garden of Lincoln's Inn. I call it my garden. It is quite a bower in the summer-time. Where the birds sing melodiously. I pass the greater part of the long vacation here. In contemplation. You find the long vacation exceedingly long, don't you?\"\nWe said yes, as she seemed to expect us to say so.\n\"When the leaves are falling from the trees and there are no more flowers in bloom to make up into nosegays for the Lord Chancellor's court,\" said the old lady, \"the vacation is fulfilled and the sixth seal, mentioned in the Revelations, again prevails. Pray come and see my lodging. It will be a good omen for me. Youth, and hope, and beauty are very seldom there. It is a long, long time since I had a visit from either.\"\nShe had taken my hand, and leading me and Miss Jellyby away, beckoned Richard and Ada to come too. I did not know how to excuse myself and looked to Richard for aid. As he was half amused and half curious and all in doubt how to get rid of the old lady without offence, she continued to lead us away, and he and Ada continued to follow, our strange conductress informing us all the time, with much smiling condescension, that she lived close by.\nIt was quite true, as it soon appeared. She lived so close by that we had not time to have done humouring her for a few moments before she was at home. Slipping us out at a little side gate, the old lady stopped most unexpectedly in a narrow back street, part of some courts and lanes immediately outside the wall of the inn, and said, \"This is my lodging. Pray walk up!\"\nShe had stopped at a shop over which was written KROOK, RAG AND BOTTLE WAREHOUSE. Also, in long thin letters, KROOK, DEALER IN MARINE STORES. In one part of the window was a picture of a red paper mill at which a cart was unloading a quantity of sacks of old rags. In another was the inscription BONES BOUGHT. In another, KITCHEN-STUFF BOUGHT. In another, OLD IRON BOUGHT. In another, WASTE-PAPER BOUGHT. In another, LADIES' AND GENTLEMEN'S WARDROBES BOUGHT. Everything seemed to be bought and nothing to be sold there. In all parts of the window were quantities of dirty bottles--blacking bottles, medicine bottles, ginger-beer and soda-water bottles, pickle bottles, wine bottles, ink bottles; I am reminded by mentioning the latter that the shop had in several little particulars the air of being in a legal neighbourhood and of being, as it were, a dirty hanger-on and disowned relation of the law. There were a great many ink bottles. There was a little tottering bench of shabby old volumes outside the door, labelled \"Law Books, all at 9d.\" Some of the inscriptions I have enumerated were written in law-hand, like the papers I had seen in Kenge and Carboy's office and the letters I had so long received from the firm. Among them was one, in the same writing, having nothing to do with the business of the shop, but announcing that a respectable man aged forty-five wanted engrossing or copying to execute with neatness and dispatch: Address to Nemo, care of Mr. Krook, within. There were several second-hand bags, blue and red, hanging up. A little way within the shop-door lay heaps of old crackled parchment scrolls and discoloured and dog's-eared law-papers. I could have fancied that all the rusty keys, of which there must have been hundreds huddled together as old iron, had once belonged to doors of rooms or strong chests in lawyers' offices. The litter of rags tumbled partly into and partly out of a one-legged wooden scale, hanging without any counterpoise from a beam, might have been counsellors' bands and gowns torn up. One had only to fancy, as Richard whispered to Ada and me while we all stood looking in, that yonder bones in a corner, piled together and picked very clean, were the bones of clients, to make the picture complete.\nAs it was still foggy and dark, and as the shop was blinded besides by the wall of Lincoln's Inn, intercepting the light within a couple of yards, we should not have seen so much but for a lighted lantern that an old man in spectacles and a hairy cap was carrying about in the shop. Turning towards the door, he now caught sight of us. He was short, cadaverous, and withered, with his head sunk sideways between his shoulders and the breath issuing in visible smoke from his mouth as if he were on fire within. His throat, chin, and eyebrows were so frosted with white hairs and so gnarled with veins and puckered skin that he looked from his breast upward like some old root in a fall of snow.\n\"Hi, hi!\" said the old man, coming to the door. \"Have you anything to sell?\"\nWe naturally drew back and glanced at our conductress, who had been trying to open the house-door with a key she had taken from her pocket, and to whom Richard now said that as we had had the pleasure of seeing where she lived, we would leave her, being pressed for time. But she was not to be so easily left. She became so fantastically and pressingly earnest in her entreaties that we would walk up and see her apartment for an instant, and was so bent, in her harmless way, on leading me in, as part of the good omen she desired, that I (whatever the others might do) saw nothing for it but to comply. I suppose we were all more or less curious; at any rate, when the old man added his persuasions to hers and said, \"Aye, aye! Please her! It won't take a minute! Come in, come in! Come in through the shop if t'other door's out of order!\" we all went in, stimulated by Richard's laughing encouragement and relying on his protection.\n\"My landlord, Krook,\" said the little old lady, condescending to him from her lofty station as she presented him to us. \"He is called among the neighbours the Lord Chancellor. His shop is called the Court of Chancery. He is a very eccentric person. He is very odd. Oh, I assure you he is very odd!\"\nShe shook her head a great many times and tapped her forehead with her finger to express to us that we must have the goodness to excuse him, \"For he is a little--you know--M!\" said the old lady with great stateliness. The old man overheard, and laughed.\n\"It's true enough,\" he said, going before us with the lantern, \"that they call me the Lord Chancellor and call my shop Chancery. And why do you think they call me the Lord Chancellor and my shop Chancery?\"\n\"I don't know, I am sure!\" said Richard rather carelessly.\n\"You see,\" said the old man, stopping and turning round, \"they--Hi! Here's lovely hair! I have got three sacks of ladies' hair below, but none so beautiful and fine as this. What colour, and what texture!\"\n\"That'll do, my good friend!\" said Richard, strongly disapproving of his having drawn one of Ada's tresses through his yellow hand. \"You can admire as the rest of us do without taking that liberty.\"\nThe old man darted at him a sudden look which even called my attention from Ada, who, startled and blushing, was so remarkably beautiful that she seemed to fix the wandering attention of the little old lady herself. But as Ada interposed and laughingly said she could only feel proud of such genuine admiration, Mr. Krook shrunk into his former self as suddenly as he had leaped out of it.\n\"You see, I have so many things here,\" he resumed, holding up the lantern, \"of so many kinds, and all as the neighbours think (but THEY know nothing), wasting away and going to rack and ruin, that that's why they have given me and my place a christening. And I have so many old parchmentses and papers in my stock. And I have a liking for rust and must and cobwebs. And all's fish that comes to my net. And I can't abear to part with anything I once lay hold of (or so my neighbours think, but what do THEY know?) or to alter anything, or to have any sweeping, nor scouring, nor cleaning, nor repairing going on about me. That's the way I've got the ill name of Chancery. I don't mind. I go to see my noble and learned brother pretty well every day, when he sits in the Inn. He don't notice me, but I notice him. There's no great odds betwixt us. We both grub on in a muddle. Hi, Lady Jane!\"\nA large grey cat leaped from some neighbouring shelf on his shoulder and startled us all.\n\"Hi! Show 'em how you scratch. Hi! Tear, my lady!\" said her master.\nThe cat leaped down and ripped at a bundle of rags with her tigerish claws, with a sound that it set my teeth on edge to hear.\n\"She'd do as much for any one I was to set her on,\" said the old man. \"I deal in cat-skins among other general matters, and hers was offered to me. It's a very fine skin, as you may see, but I didn't have it stripped off! THAT warn't like Chancery practice though, says you!\"\nHe had by this time led us across the shop, and now opened a door in the back part of it, leading to the house-entry. As he stood with his hand upon the lock, the little old lady graciously observed to him before passing out, \"That will do, Krook. You mean well, but are tiresome. My young friends are pressed for time. I have none to spare myself, having to attend court very soon. My young friends are the wards in Jarndyce.\"\n\"Jarndyce!\" said the old man with a start.\n\"Jarndyce and Jarndyce. The great suit, Krook,\" returned his lodger.\n\"Hi!\" exclaimed the old man in a tone of thoughtful amazement and with a wider stare than before. \"Think of it!\"\nHe seemed so rapt all in a moment and looked so curiously at us that Richard said, \"Why, you appear to trouble yourself a good deal about the causes before your noble and learned brother, the other Chancellor!\"\n\"Yes,\" said the old man abstractedly. \"Sure! YOUR name now will be--\"\n\"Richard Carstone.\"\n\"Carstone,\" he repeated, slowly checking off that name upon his forefinger; and each of the others he went on to mention upon a separate finger. \"Yes. There was the name of Barbary, and the name of Clare, and the name of Dedlock, too, I think.\"\n\"He knows as much of the cause as the real salaried Chancellor!\" said Richard, quite astonished, to Ada and me.\n\"Aye!\" said the old man, coming slowly out of his abstraction. \"Yes! Tom Jarndyce--you'll excuse me, being related; but he was never known about court by any other name, and was as well known there as--she is now,\" nodding slightly at his lodger. \"Tom Jarndyce was often in here. He got into a restless habit of strolling about when the cause was on, or expected, talking to the little shopkeepers and telling 'em to keep out of Chancery, whatever they did. 'For,' says he, 'it's being ground to bits in a slow mill; it's being roasted at a slow fire; it's being stung to death by single bees; it's being drowned by drops; it's going mad by grains.' He was as near making away with himself, just where the young lady stands, as near could be.\"\nWe listened with horror.\n\"He come in at the door,\" said the old man, slowly pointing an imaginary track along the shop, \"on the day he did it--the whole neighbourhood had said for months before that he would do it, of a certainty sooner or later--he come in at the door that day, and walked along there, and sat himself on a bench that stood there, and asked me (you'll judge I was a mortal sight younger then) to fetch him a pint of wine. 'For,' says he, 'Krook, I am much depressed; my cause is on again, and I think I'm nearer judgment than I ever was.' I hadn't a mind to leave him alone; and I persuaded him to go to the tavern over the way there, t'other side my lane (I mean Chancery Lane); and I followed and looked in at the window, and saw him, comfortable as I thought, in the arm-chair by the fire, and company with him. I hadn't hardly got back here when I heard a shot go echoing and rattling right away into the inn. I ran out--neighbours ran out--twenty of us cried at once, 'Tom Jarndyce!'\"\nThe old man stopped, looked hard at us, looked down into the lantern, blew the light out, and shut the lantern up.\n\"We were right, I needn't tell the present hearers. Hi! To be sure, how the neighbourhood poured into court that afternoon while the cause was on! How my noble and learned brother, and all the rest of 'em, grubbed and muddled away as usual and tried to look as if they hadn't heard a word of the last fact in the case or as if they had--Oh, dear me!--nothing at all to do with it if they had heard of it by any chance!\"\nAda's colour had entirely left her, and Richard was scarcely less pale. Nor could I wonder, judging even from my emotions, and I was no party in the suit, that to hearts so untried and fresh it was a shock to come into the inheritance of a protracted misery, attended in the minds of many people with such dreadful recollections. I had another uneasiness, in the application of the painful story to the poor half-witted creature who had brought us there; but, to my surprise, she seemed perfectly unconscious of that and only led the way upstairs again, informing us with the toleration of a superior creature for the infirmities of a common mortal that her landlord was \"a little M, you know!\"\nShe lived at the top of the house, in a pretty large room, from which she had a glimpse of Lincoln's Inn Hall. This seemed to have been her principal inducement, originally, for taking up her residence there. She could look at it, she said, in the night, especially in the moonshine. Her room was clean, but very, very bare. I noticed the scantiest necessaries in the way of furniture; a few old prints from books, of Chancellors and barristers, wafered against the wall; and some half-dozen reticles and work-bags, \"containing documents,\" as she informed us. There were neither coals nor ashes in the grate, and I saw no articles of clothing anywhere, nor any kind of food. Upon a shelf in an open cupboard were a plate or two, a cup or two, and so forth, but all dry and empty. There was a more affecting meaning in her pinched appearance, I thought as I looked round, than I had understood before.\n\"Extremely honoured, I am sure,\" said our poor hostess with the greatest suavity, \"by this visit from the wards in Jarndyce. And very much indebted for the omen. It is a retired situation. Considering. I am limited as to situation. In consequence of the necessity of attending on the Chancellor. I have lived here many years. I pass my days in court, my evenings and my nights here. I find the nights long, for I sleep but little and think much. That is, of course, unavoidable, being in Chancery. I am sorry I cannot offer chocolate. I expect a judgment shortly and shall then place my establishment on a superior footing. At present, I don't mind confessing to the wards in Jarndyce (in strict confidence) that I sometimes find it difficult to keep up a genteel appearance. I have felt the cold here. I have felt something sharper than cold. It matters very little. Pray excuse the introduction of such mean topics.\"\nShe partly drew aside the curtain of the long, low garret window and called our attention to a number of bird-cages hanging there, some containing several birds. There were larks, linnets, and goldfinches--I should think at least twenty.\n\"I began to keep the little creatures,\" she said, \"with an object that the wards will readily comprehend. With the intention of restoring them to liberty. When my judgment should be given. Ye-es! They die in prison, though. Their lives, poor silly things, are so short in comparison with Chancery proceedings that, one by one, the whole collection has died over and over again. I doubt, do you know, whether one of these, though they are all young, will live to be free! Ve-ry mortifying, is it not?\"\nAlthough she sometimes asked a question, she never seemed to expect a reply, but rambled on as if she were in the habit of doing so when no one but herself was present.\n\"Indeed,\" she pursued, \"I positively doubt sometimes, I do assure you, whether while matters are still unsettled, and the sixth or Great Seal still prevails, I may not one day be found lying stark and senseless here, as I have found so many birds!\"\nRichard, answering what he saw in Ada's compassionate eyes, took the opportunity of laying some money, softly and unobserved, on the chimney-piece. We all drew nearer to the cages, feigning to examine the birds.\n\"I can't allow them to sing much,\" said the little old lady, \"for (you'll think this curious) I find my mind confused by the idea that they are singing while I am following the arguments in court. And my mind requires to be so very clear, you know! Another time, I'll tell you their names. Not at present. On a day of such good omen, they shall sing as much as they like. In honour of youth,\" a smile and curtsy, \"hope,\" a smile and curtsy, \"and beauty,\" a smile and curtsy. \"There! We'll let in the full light.\"\nThe birds began to stir and chirp.\n\"I cannot admit the air freely,\" said the little old lady--the room was close, and would have been the better for it--\"because the cat you saw downstairs, called Lady Jane, is greedy for their lives. She crouches on the parapet outside for hours and hours. I have discovered,\" whispering mysteriously, \"that her natural cruelty is sharpened by a jealous fear of their regaining their liberty. In consequence of the judgment I expect being shortly given. She is sly and full of malice. I half believe, sometimes, that she is no cat, but the wolf of the old saying. It is so very difficult to keep her from the door.\"\nSome neighbouring bells, reminding the poor soul that it was half-past nine, did more for us in the way of bringing our visit to an end than we could easily have done for ourselves. She hurriedly took up her little bag of documents, which she had laid upon the table on coming in, and asked if we were also going into court. On our answering no, and that we would on no account detain her, she opened the door to attend us downstairs.\n\"With such an omen, it is even more necessary than usual that I should be there before the Chancellor comes in,\" said she, \"for he might mention my case the first thing. I have a presentiment that he WILL mention it the first thing this morning.\"\nShe stopped to tell us in a whisper as we were going down that the whole house was filled with strange lumber which her landlord had bought piecemeal and had no wish to sell, in consequence of being a little M. This was on the first floor. But she had made a previous stoppage on the second floor and had silently pointed at a dark door there.\n\"The only other lodger,\" she now whispered in explanation, \"a law-writer. The children in the lanes here say he has sold himself to the devil. I don't know what he can have done with the money. Hush!\"\nShe appeared to mistrust that the lodger might hear her even there, and repeating \"Hush!\" went before us on tiptoe as though even the sound of her footsteps might reveal to him what she had said.\nPassing through the shop on our way out, as we had passed through it on our way in, we found the old man storing a quantity of packets of waste-paper in a kind of well in the floor. He seemed to be working hard, with the perspiration standing on his forehead, and had a piece of chalk by him, with which, as he put each separate package or bundle down, he made a crooked mark on the panelling of the wall.\nRichard and Ada, and Miss Jellyby, and the little old lady had gone by him, and I was going when he touched me on the arm to stay me, and chalked the letter J upon the wall--in a very curious manner, beginning with the end of the letter and shaping it backward. It was a capital letter, not a printed one, but just such a letter as any clerk in Messrs. Kenge and Carboy's office would have made.\n\"Can you read it?\" he asked me with a keen glance.\n\"Surely,\" said I. \"It's very plain.\"\n\"What is it?\"\n\"J.\"\nWith another glance at me, and a glance at the door, he rubbed it out and turned an \"a\" in its place (not a capital letter this time), and said, \"What's that?\"\nI told him. He then rubbed that out and turned the letter \"r,\" and asked me the same question. He went on quickly until he had formed in the same curious manner, beginning at the ends and bottoms of the letters, the word Jarndyce, without once leaving two letters on the wall together.\n\"What does that spell?\" he asked me.\nWhen I told him, he laughed. In the same odd way, yet with the same rapidity, he then produced singly, and rubbed out singly, the letters forming the words Bleak House. These, in some astonishment, I also read; and he laughed again.\n\"Hi!\" said the old man, laying aside the chalk. \"I have a turn for copying from memory, you see, miss, though I can neither read nor write.\"\nHe looked so disagreeable and his cat looked so wickedly at me, as if I were a blood-relation of the birds upstairs, that I was quite relieved by Richard's appearing at the door and saying, \"Miss Summerson, I hope you are not bargaining for the sale of your hair. Don't be tempted. Three sacks below are quite enough for Mr. Krook!\"\nI lost no time in wishing Mr. Krook good morning and joining my friends outside, where we parted with the little old lady, who gave us her blessing with great ceremony and renewed her assurance of yesterday in reference to her intention of settling estates on Ada and me. Before we finally turned out of those lanes, we looked back and saw Mr. Krook standing at his shop-door, in his spectacles, looking after us, with his cat upon his shoulder, and her tail sticking up on one side of his hairy cap like a tall feather.\n\"Quite an adventure for a morning in London!\" said Richard with a sigh. \"Ah, cousin, cousin, it's a weary word this Chancery!\"\n\"It is to me, and has been ever since I can remember,\" returned Ada. \"I am grieved that I should be the enemy--as I suppose I am--of a great number of relations and others, and that they should be my enemies--as I suppose they are--and that we should all be ruining one another without knowing how or why and be in constant doubt and discord all our lives. It seems very strange, as there must be right somewhere, that an honest judge in real earnest has not been able to find out through all these years where it is.\"\n\"Ah, cousin!\" said Richard. \"Strange, indeed! All this wasteful, wanton chess-playing IS very strange. To see that composed court yesterday jogging on so serenely and to think of the wretchedness of the pieces on the board gave me the headache and the heartache both together. My head ached with wondering how it happened, if men were neither fools nor rascals; and my heart ached to think they could possibly be either. But at all events, Ada--I may call you Ada?\"\n\"Of course you may, cousin Richard.\"\n\"At all events, Chancery will work none of its bad influences on US. We have happily been brought together, thanks to our good kinsman, and it can't divide us now!\"\n\"Never, I hope, cousin Richard!\" said Ada gently.\nMiss Jellyby gave my arm a squeeze and me a very significant look. I smiled in return, and we made the rest of the way back very pleasantly.\nIn half an hour after our arrival, Mrs. Jellyby appeared; and in the course of an hour the various things necessary for breakfast straggled one by one into the dining-room. I do not doubt that Mrs. Jellyby had gone to bed and got up in the usual manner, but she presented no appearance of having changed her dress. She was greatly occupied during breakfast, for the morning's post brought a heavy correspondence relative to Borrioboola-Gha, which would occasion her (she said) to pass a busy day. The children tumbled about, and notched memoranda of their accidents in their legs, which were perfect little calendars of distress; and Peepy was lost for an hour and a half, and brought home from Newgate market by a policeman. The equable manner in which Mrs. Jellyby sustained both his absence and his restoration to the family circle surprised us all.\nShe was by that time perseveringly dictating to Caddy, and Caddy was fast relapsing into the inky condition in which we had found her. At one o'clock an open carriage arrived for us, and a cart for our luggage. Mrs. Jellyby charged us with many remembrances to her good friend Mr. Jarndyce; Caddy left her desk to see us depart, kissed me in the passage, and stood biting her pen and sobbing on the steps; Peepy, I am happy to say, was asleep and spared the pain of separation (I was not without misgivings that he had gone to Newgate market in search of me); and all the other children got up behind the barouche and fell off, and we saw them, with great concern, scattered over the surface of Thavies Inn as we rolled out of its precincts.",
        "paragraph_chars": [
            [
                0,
                401
            ],
            [
                401,
                876
            ],
            [
                876,
                953
            ],
            [
                953,
                1029
            ],
            [
                1029,
                1649
            ],
            [
                1649,
                2452
            ],
            [
                2452,
                2862
            ],
            [
                2862,
                2903
            ],
            [
                2903,
                2935
            ],
            [
                2935,
                2997
            ],
            [
                2997,
                3040
            ],
            [
                3040,
                3073
            ],
            [
                3073,
                3373
            ],
            [
                3373,
                3504
            ],
            [
                3504,
                3842
            ],
            [
                3842,
                3871
            ],
            [
                3871,
                4284
            ],
            [
                4284,
                4996
            ],
            [
                4996,
                5216
            ],
            [
                5216,
                5389
            ],
            [
                5389,
                5447
            ],
            [
                5447,
                5715
            ],
            [
                5715,
                5809
            ],
            [
                5809,
                5896
            ],
            [
                5896,
                6168
            ],
            [
                6168,
                6308
            ],
            [
                6308,
                6679
            ],
            [
                6679,
                6730
            ],
            [
                6730,
                7154
            ],
            [
                7154,
                7600
            ],
            [
                7600,
                7972
            ],
            [
                7972,
                10231
            ],
            [
                10231,
                10926
            ],
            [
                10926,
                11003
            ],
            [
                11003,
                11939
            ],
            [
                11939,
                12238
            ],
            [
                12238,
                12492
            ],
            [
                12492,
                12698
            ],
            [
                12698,
                12757
            ],
            [
                12757,
                12963
            ],
            [
                12963,
                13162
            ],
            [
                13162,
                13552
            ],
            [
                13552,
                14444
            ],
            [
                14444,
                14534
            ],
            [
                14534,
                14602
            ],
            [
                14602,
                14729
            ],
            [
                14729,
                15005
            ],
            [
                15005,
                15433
            ],
            [
                15433,
                15476
            ],
            [
                15476,
                15545
            ],
            [
                15545,
                15658
            ],
            [
                15658,
                15869
            ],
            [
                15869,
                15939
            ],
            [
                15939,
                15959
            ],
            [
                15959,
                16204
            ],
            [
                16204,
                16316
            ],
            [
                16316,
                17060
            ],
            [
                17060,
                17085
            ],
            [
                17085,
                18068
            ],
            [
                18068,
                18183
            ],
            [
                18183,
                18603
            ],
            [
                18603,
                19298
            ],
            [
                19298,
                20199
            ],
            [
                20199,
                21118
            ],
            [
                21118,
                21356
            ],
            [
                21356,
                21857
            ],
            [
                21857,
                22026
            ],
            [
                22026,
                22275
            ],
            [
                22275,
                22487
            ],
            [
                22487,
                23000
            ],
            [
                23000,
                23035
            ],
            [
                23035,
                23651
            ],
            [
                23651,
                24086
            ],
            [
                24086,
                24333
            ],
            [
                24333,
                24677
            ],
            [
                24677,
                24878
            ],
            [
                24878,
                25074
            ],
            [
                25074,
                25480
            ],
            [
                25480,
                25876
            ],
            [
                25876,
                25927
            ],
            [
                25927,
                25964
            ],
            [
                25964,
                25978
            ],
            [
                25978,
                25983
            ],
            [
                25983,
                26143
            ],
            [
                26143,
                26429
            ],
            [
                26429,
                26466
            ],
            [
                26466,
                26699
            ],
            [
                26699,
                26840
            ],
            [
                26840,
                27173
            ],
            [
                27173,
                27694
            ],
            [
                27694,
                27821
            ],
            [
                27821,
                28340
            ],
            [
                28340,
                28806
            ],
            [
                28806,
                28843
            ],
            [
                28843,
                29008
            ],
            [
                29008,
                29058
            ],
            [
                29058,
                29199
            ],
            [
                29199,
                30052
            ],
            [
                30052,
                30793
            ]
        ],
        "segment_chars": [
            [
                0,
                401
            ],
            [
                401,
                533
            ],
            [
                533,
                587
            ],
            [
                587,
                641
            ],
            [
                641,
                720
            ],
            [
                720,
                785
            ],
            [
                785,
                876
            ],
            [
                876,
                953
            ],
            [
                953,
                1029
            ],
            [
                1029,
                1076
            ],
            [
                1076,
                1236
            ],
            [
                1236,
                1521
            ],
            [
                1521,
                1649
            ],
            [
                1649,
                1775
            ],
            [
                1775,
                1969
            ],
            [
                1969,
                2059
            ],
            [
                2059,
                2153
            ],
            [
                2153,
                2208
            ],
            [
                2208,
                2373
            ],
            [
                2373,
                2452
            ],
            [
                2452,
                2554
            ],
            [
                2554,
                2649
            ],
            [
                2649,
                2708
            ],
            [
                2708,
                2862
            ],
            [
                2862,
                2892
            ],
            [
                2892,
                2903
            ],
            [
                2903,
                2935
            ],
            [
                2935,
                2997
            ],
            [
                2997,
                3040
            ],
            [
                3040,
                3073
            ],
            [
                3073,
                3089
            ],
            [
                3089,
                3099
            ],
            [
                3099,
                3328
            ],
            [
                3328,
                3373
            ],
            [
                3373,
                3384
            ],
            [
                3384,
                3479
            ],
            [
                3479,
                3504
            ],
            [
                3504,
                3509
            ],
            [
                3509,
                3587
            ],
            [
                3587,
                3638
            ],
            [
                3638,
                3730
            ],
            [
                3730,
                3759
            ],
            [
                3759,
                3842
            ],
            [
                3842,
                3871
            ],
            [
                3871,
                3977
            ],
            [
                3977,
                3995
            ],
            [
                3995,
                4084
            ],
            [
                4084,
                4284
            ],
            [
                4284,
                4399
            ],
            [
                4399,
                4558
            ],
            [
                4558,
                4996
            ],
            [
                4996,
                5063
            ],
            [
                5063,
                5101
            ],
            [
                5101,
                5216
            ],
            [
                5216,
                5364
            ],
            [
                5364,
                5389
            ],
            [
                5389,
                5447
            ],
            [
                5447,
                5455
            ],
            [
                5455,
                5482
            ],
            [
                5482,
                5505
            ],
            [
                5505,
                5519
            ],
            [
                5519,
                5605
            ],
            [
                5605,
                5664
            ],
            [
                5664,
                5715
            ],
            [
                5715,
                5745
            ],
            [
                5745,
                5809
            ],
            [
                5809,
                5861
            ],
            [
                5861,
                5896
            ],
            [
                5896,
                5917
            ],
            [
                5917,
                5934
            ],
            [
                5934,
                5979
            ],
            [
                5979,
                5998
            ],
            [
                5998,
                6078
            ],
            [
                6078,
                6168
            ],
            [
                6168,
                6308
            ],
            [
                6308,
                6314
            ],
            [
                6314,
                6333
            ],
            [
                6333,
                6366
            ],
            [
                6366,
                6391
            ],
            [
                6391,
                6407
            ],
            [
                6407,
                6421
            ],
            [
                6421,
                6458
            ],
            [
                6458,
                6479
            ],
            [
                6479,
                6519
            ],
            [
                6519,
                6553
            ],
            [
                6553,
                6604
            ],
            [
                6604,
                6622
            ],
            [
                6622,
                6679
            ],
            [
                6679,
                6730
            ],
            [
                6730,
                6984
            ],
            [
                6984,
                7014
            ],
            [
                7014,
                7045
            ],
            [
                7045,
                7096
            ],
            [
                7096,
                7154
            ],
            [
                7154,
                7253
            ],
            [
                7253,
                7320
            ],
            [
                7320,
                7600
            ],
            [
                7600,
                7640
            ],
            [
                7640,
                7752
            ],
            [
                7752,
                7957
            ],
            [
                7957,
                7972
            ],
            [
                7972,
                8054
            ],
            [
                8054,
                8114
            ],
            [
                8114,
                8237
            ],
            [
                8237,
                8282
            ],
            [
                8282,
                8316
            ],
            [
                8316,
                8345
            ],
            [
                8345,
                8377
            ],
            [
                8377,
                8431
            ],
            [
                8431,
                8492
            ],
            [
                8492,
                8875
            ],
            [
                8875,
                8912
            ],
            [
                8912,
                9020
            ],
            [
                9020,
                9199
            ],
            [
                9199,
                9458
            ],
            [
                9458,
                9521
            ],
            [
                9521,
                9643
            ],
            [
                9643,
                9832
            ],
            [
                9832,
                10016
            ],
            [
                10016,
                10231
            ],
            [
                10231,
                10514
            ],
            [
                10514,
                10567
            ],
            [
                10567,
                10742
            ],
            [
                10742,
                10926
            ],
            [
                10926,
                10936
            ],
            [
                10936,
                10974
            ],
            [
                10974,
                11003
            ],
            [
                11003,
                11275
            ],
            [
                11275,
                11313
            ],
            [
                11313,
                11608
            ],
            [
                11608,
                11733
            ],
            [
                11733,
                11745
            ],
            [
                11745,
                11769
            ],
            [
                11769,
                11787
            ],
            [
                11787,
                11845
            ],
            [
                11845,
                11939
            ],
            [
                11939,
                12059
            ],
            [
                12059,
                12115
            ],
            [
                12115,
                12157
            ],
            [
                12157,
                12188
            ],
            [
                12188,
                12204
            ],
            [
                12204,
                12238
            ],
            [
                12238,
                12414
            ],
            [
                12414,
                12456
            ],
            [
                12456,
                12492
            ],
            [
                12492,
                12621
            ],
            [
                12621,
                12698
            ],
            [
                12698,
                12725
            ],
            [
                12725,
                12757
            ],
            [
                12757,
                12825
            ],
            [
                12825,
                12845
            ],
            [
                12845,
                12931
            ],
            [
                12931,
                12963
            ],
            [
                12963,
                12993
            ],
            [
                12993,
                13095
            ],
            [
                13095,
                13162
            ],
            [
                13162,
                13378
            ],
            [
                13378,
                13552
            ],
            [
                13552,
                13807
            ],
            [
                13807,
                13867
            ],
            [
                13867,
                13918
            ],
            [
                13918,
                13955
            ],
            [
                13955,
                14066
            ],
            [
                14066,
                14174
            ],
            [
                14174,
                14224
            ],
            [
                14224,
                14238
            ],
            [
                14238,
                14327
            ],
            [
                14327,
                14365
            ],
            [
                14365,
                14399
            ],
            [
                14399,
                14428
            ],
            [
                14428,
                14444
            ],
            [
                14444,
                14534
            ],
            [
                14534,
                14539
            ],
            [
                14539,
                14565
            ],
            [
                14565,
                14569
            ],
            [
                14569,
                14585
            ],
            [
                14585,
                14602
            ],
            [
                14602,
                14729
            ],
            [
                14729,
                14799
            ],
            [
                14799,
                14877
            ],
            [
                14877,
                14951
            ],
            [
                14951,
                15005
            ],
            [
                15005,
                15123
            ],
            [
                15123,
                15253
            ],
            [
                15253,
                15286
            ],
            [
                15286,
                15325
            ],
            [
                15325,
                15388
            ],
            [
                15388,
                15433
            ],
            [
                15433,
                15445
            ],
            [
                15445,
                15476
            ],
            [
                15476,
                15500
            ],
            [
                15500,
                15545
            ],
            [
                15545,
                15551
            ],
            [
                15551,
                15643
            ],
            [
                15643,
                15658
            ],
            [
                15658,
                15869
            ],
            [
                15869,
                15907
            ],
            [
                15907,
                15914
            ],
            [
                15914,
                15939
            ],
            [
                15939,
                15959
            ],
            [
                15959,
                16104
            ],
            [
                16104,
                16110
            ],
            [
                16110,
                16204
            ],
            [
                16204,
                16269
            ],
            [
                16269,
                16316
            ],
            [
                16316,
                16323
            ],
            [
                16323,
                16379
            ],
            [
                16379,
                16385
            ],
            [
                16385,
                16563
            ],
            [
                16563,
                16596
            ],
            [
                16596,
                16774
            ],
            [
                16774,
                16966
            ],
            [
                16966,
                17060
            ],
            [
                17060,
                17085
            ],
            [
                17085,
                17500
            ],
            [
                17500,
                17617
            ],
            [
                17617,
                17893
            ],
            [
                17893,
                17992
            ],
            [
                17992,
                18068
            ],
            [
                18068,
                18183
            ],
            [
                18183,
                18235
            ],
            [
                18235,
                18239
            ],
            [
                18239,
                18330
            ],
            [
                18330,
                18603
            ],
            [
                18603,
                18675
            ],
            [
                18675,
                18933
            ],
            [
                18933,
                19298
            ],
            [
                19298,
                19409
            ],
            [
                19409,
                19507
            ],
            [
                19507,
                19582
            ],
            [
                19582,
                19623
            ],
            [
                19623,
                19858
            ],
            [
                19858,
                19973
            ],
            [
                19973,
                20078
            ],
            [
                20078,
                20199
            ],
            [
                20199,
                20324
            ],
            [
                20324,
                20361
            ],
            [
                20361,
                20388
            ],
            [
                20388,
                20401
            ],
            [
                20401,
                20431
            ],
            [
                20431,
                20495
            ],
            [
                20495,
                20525
            ],
            [
                20525,
                20582
            ],
            [
                20582,
                20645
            ],
            [
                20645,
                20697
            ],
            [
                20697,
                20734
            ],
            [
                20734,
                20823
            ],
            [
                20823,
                20975
            ],
            [
                20975,
                21002
            ],
            [
                21002,
                21043
            ],
            [
                21043,
                21067
            ],
            [
                21067,
                21118
            ],
            [
                21118,
                21280
            ],
            [
                21280,
                21356
            ],
            [
                21356,
                21462
            ],
            [
                21462,
                21511
            ],
            [
                21511,
                21545
            ],
            [
                21545,
                21552
            ],
            [
                21552,
                21580
            ],
            [
                21580,
                21734
            ],
            [
                21734,
                21827
            ],
            [
                21827,
                21857
            ],
            [
                21857,
                22026
            ],
            [
                22026,
                22275
            ],
            [
                22275,
                22423
            ],
            [
                22423,
                22487
            ],
            [
                22487,
                22684
            ],
            [
                22684,
                22736
            ],
            [
                22736,
                22777
            ],
            [
                22777,
                22793
            ],
            [
                22793,
                22859
            ],
            [
                22859,
                22962
            ],
            [
                22962,
                22970
            ],
            [
                22970,
                23000
            ],
            [
                23000,
                23035
            ],
            [
                23035,
                23235
            ],
            [
                23235,
                23292
            ],
            [
                23292,
                23428
            ],
            [
                23428,
                23489
            ],
            [
                23489,
                23520
            ],
            [
                23520,
                23599
            ],
            [
                23599,
                23651
            ],
            [
                23651,
                23833
            ],
            [
                23833,
                23976
            ],
            [
                23976,
                24086
            ],
            [
                24086,
                24256
            ],
            [
                24256,
                24333
            ],
            [
                24333,
                24573
            ],
            [
                24573,
                24677
            ],
            [
                24677,
                24751
            ],
            [
                24751,
                24820
            ],
            [
                24820,
                24871
            ],
            [
                24871,
                24878
            ],
            [
                24878,
                24968
            ],
            [
                24968,
                25074
            ],
            [
                25074,
                25256
            ],
            [
                25256,
                25480
            ],
            [
                25480,
                25742
            ],
            [
                25742,
                25876
            ],
            [
                25876,
                25895
            ],
            [
                25895,
                25927
            ],
            [
                25927,
                25945
            ],
            [
                25945,
                25964
            ],
            [
                25964,
                25978
            ],
            [
                25978,
                25983
            ],
            [
                25983,
                26143
            ],
            [
                26143,
                26155
            ],
            [
                26155,
                26238
            ],
            [
                26238,
                26429
            ],
            [
                26429,
                26453
            ],
            [
                26453,
                26466
            ],
            [
                26466,
                26495
            ],
            [
                26495,
                26635
            ],
            [
                26635,
                26699
            ],
            [
                26699,
                26705
            ],
            [
                26705,
                26747
            ],
            [
                26747,
                26840
            ],
            [
                26840,
                27104
            ],
            [
                27104,
                27122
            ],
            [
                27122,
                27173
            ],
            [
                27173,
                27445
            ],
            [
                27445,
                27694
            ],
            [
                27694,
                27740
            ],
            [
                27740,
                27766
            ],
            [
                27766,
                27821
            ],
            [
                27821,
                27890
            ],
            [
                27890,
                28178
            ],
            [
                28178,
                28340
            ],
            [
                28340,
                28354
            ],
            [
                28354,
                28368
            ],
            [
                28368,
                28386
            ],
            [
                28386,
                28443
            ],
            [
                28443,
                28617
            ],
            [
                28617,
                28761
            ],
            [
                28761,
                28806
            ],
            [
                28806,
                28843
            ],
            [
                28843,
                28912
            ],
            [
                28912,
                29008
            ],
            [
                29008,
                29041
            ],
            [
                29041,
                29058
            ],
            [
                29058,
                29125
            ],
            [
                29125,
                29199
            ],
            [
                29199,
                29372
            ],
            [
                29372,
                29514
            ],
            [
                29514,
                29696
            ],
            [
                29696,
                29925
            ],
            [
                29925,
                30052
            ],
            [
                30052,
                30187
            ],
            [
                30187,
                30263
            ],
            [
                30263,
                30793
            ]
        ],
        "overlap_chars": [
            [
                0,
                69
            ],
            [
                89,
                92
            ],
            [
                124,
                128
            ],
            [
                113,
                118
            ],
            [
                93,
                100
            ],
            [
                83,
                84
            ],
            [
                179,
                184
            ],
            [
                276,
                283
            ],
            [
                284,
                299
            ],
            [
                349,
                353
            ],
            [
                336,
                348
            ],
            [
                358,
                401
            ],
            [
                401,
                457
            ],
            [
                475,
                484
            ],
            [
                487,
                533
            ],
            [
                539,
                541
            ],
            [
                546,
                587
            ],
            [
                587,
                639
            ],
            [
                1029,
                1050
            ],
            [
                1051,
                1054
            ],
            [
                1074,
                1076
            ],
            [
                1076,
                1077
            ],
            [
                1094,
                1102
            ],
            [
                1160,
                1236
            ],
            [
                1236,
                1256
            ],
            [
                1285,
                1286
            ],
            [
                1406,
                1413
            ],
            [
                1382,
                1392
            ],
            [
                1353,
                1356
            ],
            [
                1419,
                1428
            ],
            [
                1295,
                1297
            ],
            [
                1262,
                1265
            ],
            [
                1433,
                1520
            ],
            [
                2018,
                2021
            ],
            [
                1778,
                1852
            ],
            [
                1969,
                2017
            ],
            [
                2057,
                2059
            ],
            [
                2153,
                2208
            ],
            [
                2208,
                2372
            ],
            [
                2452,
                2503
            ],
            [
                2561,
                2590
            ],
            [
                2608,
                2649
            ],
            [
                2649,
                2708
            ],
            [
                2727,
                2774
            ],
            [
                2860,
                2862
            ],
            [
                2862,
                2892
            ],
            [
                2892,
                2903
            ],
            [
                2903,
                2935
            ],
            [
                2935,
                2984
            ],
            [
                2995,
                2997
            ],
            [
                2997,
                3040
            ],
            [
                3040,
                3055
            ],
            [
                3059,
                3073
            ],
            [
                3073,
                3089
            ],
            [
                3089,
                3099
            ],
            [
                3099,
                3100
            ],
            [
                3165,
                3328
            ],
            [
                3328,
                3373
            ],
            [
                3373,
                3384
            ],
            [
                3384,
                3398
            ],
            [
                3477,
                3479
            ],
            [
                3479,
                3500
            ],
            [
                3504,
                3509
            ],
            [
                3509,
                3522
            ],
            [
                3538,
                3587
            ],
            [
                3587,
                3638
            ],
            [
                3730,
                3759
            ],
            [
                3759,
                3777
            ],
            [
                3789,
                3790
            ],
            [
                3794,
                3842
            ],
            [
                3842,
                3852
            ],
            [
                3856,
                3871
            ],
            [
                3871,
                3888
            ],
            [
                3901,
                3977
            ],
            [
                3977,
                3995
            ],
            [
                4034,
                4040
            ],
            [
                4058,
                4084
            ],
            [
                4268,
                4270
            ],
            [
                4234,
                4237
            ],
            [
                4191,
                4195
            ],
            [
                4252,
                4260
            ],
            [
                4281,
                4284
            ],
            [
                4284,
                4285
            ],
            [
                4311,
                4399
            ],
            [
                4465,
                4480
            ],
            [
                4488,
                4490
            ],
            [
                4506,
                4558
            ],
            [
                4558,
                4621
            ],
            [
                4625,
                4655
            ],
            [
                4690,
                4697
            ],
            [
                4673,
                4676
            ],
            [
                4699,
                4702
            ],
            [
                4715,
                4721
            ],
            [
                4730,
                4778
            ],
            [
                4697,
                4698
            ],
            [
                4857,
                4968
            ],
            [
                4994,
                4996
            ],
            [
                4996,
                5044
            ],
            [
                5052,
                5061
            ],
            [
                5063,
                5101
            ],
            [
                5101,
                5113
            ],
            [
                5129,
                5131
            ],
            [
                5114,
                5128
            ],
            [
                5162,
                5167
            ],
            [
                5169,
                5216
            ],
            [
                5216,
                5237
            ],
            [
                5266,
                5275
            ],
            [
                5277,
                5300
            ],
            [
                5338,
                5364
            ],
            [
                5364,
                5389
            ],
            [
                5389,
                5423
            ],
            [
                5445,
                5447
            ],
            [
                5447,
                5448
            ],
            [
                5453,
                5455
            ],
            [
                5455,
                5482
            ],
            [
                5482,
                5505
            ],
            [
                5519,
                5605
            ],
            [
                5605,
                5662
            ],
            [
                5715,
                5745
            ],
            [
                5745,
                5767
            ],
            [
                5807,
                5809
            ],
            [
                5809,
                5828
            ],
            [
                5865,
                5885
            ],
            [
                5894,
                5896
            ],
            [
                5896,
                5917
            ],
            [
                5917,
                5934
            ],
            [
                5934,
                5979
            ],
            [
                5979,
                5998
            ],
            [
                5998,
                6078
            ],
            [
                6078,
                6095
            ],
            [
                6115,
                6142
            ],
            [
                6166,
                6168
            ],
            [
                6168,
                6175
            ],
            [
                6232,
                6308
            ],
            [
                6308,
                6314
            ],
            [
                6314,
                6333
            ],
            [
                6333,
                6366
            ],
            [
                6366,
                6391
            ],
            [
                6391,
                6407
            ],
            [
                6407,
                6421
            ],
            [
                6421,
                6458
            ],
            [
                6458,
                6479
            ],
            [
                6479,
                6519
            ],
            [
                6519,
                6539
            ],
            [
                6551,
                6553
            ],
            [
                6553,
                6604
            ],
            [
                6622,
                6679
            ],
            [
                6679,
                6715
            ],
            [
                6728,
                6730
            ],
            [
                6730,
                6773
            ],
            [
                6869,
                6984
            ],
            [
                6984,
                7014
            ],
            [
                7014,
                7045
            ],
            [
                7045,
                7072
            ],
            [
                7077,
                7088
            ],
            [
                7154,
                7180
            ],
            [
                7181,
                7213
            ],
            [
                7251,
                7253
            ],
            [
                7253,
                7320
            ],
            [
                7320,
                7358
            ],
            [
                7422,
                7423
            ],
            [
                7459,
                7469
            ],
            [
                7446,
                7448
            ],
            [
                7598,
                7600
            ],
            [
                7791,
                7803
            ],
            [
                7644,
                7649
            ],
            [
                7653,
                7661
            ],
            [
                7789,
                7790
            ],
            [
                7830,
                7853
            ],
            [
                7750,
                7751
            ],
            [
                7936,
                7957
            ],
            [
                7957,
                7972
            ],
            [
                7972,
                8054
            ],
            [
                8054,
                8114
            ],
            [
                8114,
                8143
            ],
            [
                8252,
                8282
            ],
            [
                8282,
                8316
            ],
            [
                8316,
                8345
            ],
            [
                8345,
                8377
            ],
            [
                8377,
                8431
            ],
            [
                8431,
                8491
            ],
            [
                8492,
                8551
            ],
            [
                8837,
                8838
            ],
            [
                8571,
                8654
            ],
            [
                8797,
                8800
            ],
            [
                8775,
                8776
            ],
            [
                8655,
                8666
            ],
            [
                8712,
                8724
            ],
            [
                8755,
                8771
            ],
            [
                8823,
                8824
            ],
            [
                8845,
                8875
            ],
            [
                8912,
                9007
            ],
            [
                9015,
                9020
            ],
            [
                9020,
                9044
            ],
            [
                9063,
                9097
            ],
            [
                9153,
                9166
            ],
            [
                9175,
                9188
            ],
            [
                9119,
                9144
            ],
            [
                9197,
                9199
            ],
            [
                9214,
                9217
            ],
            [
                9219,
                9238
            ],
            [
                9307,
                9352
            ],
            [
                9367,
                9374
            ],
            [
                9217,
                9218
            ],
            [
                9375,
                9457
            ],
            [
                9521,
                9533
            ],
            [
                9541,
                9571
            ],
            [
                9581,
                9598
            ],
            [
                9687,
                9688
            ],
            [
                9619,
                9622
            ],
            [
                9624,
                9641
            ],
            [
                9599,
                9602
            ],
            [
                9889,
                9890
            ],
            [
                9836,
                9850
            ],
            [
                10014,
                10016
            ],
            [
                10016,
                10066
            ],
            [
                10103,
                10231
            ],
            [
                10378,
                10380
            ],
            [
                10299,
                10301
            ],
            [
                10359,
                10360
            ],
            [
                10428,
                10435
            ],
            [
                10441,
                10451
            ],
            [
                10501,
                10512
            ],
            [
                10261,
                10262
            ],
            [
                10452,
                10481
            ],
            [
                10512,
                10514
            ],
            [
                10567,
                10742
            ],
            [
                10742,
                10745
            ],
            [
                10836,
                10844
            ],
            [
                10746,
                10752
            ],
            [
                10760,
                10763
            ],
            [
                10754,
                10758
            ],
            [
                10773,
                10805
            ],
            [
                10850,
                10864
            ],
            [
                10888,
                10926
            ],
            [
                10926,
                10936
            ],
            [
                10936,
                10974
            ],
            [
                10974,
                11003
            ],
            [
                11003,
                11040
            ],
            [
                11191,
                11194
            ],
            [
                11056,
                11111
            ],
            [
                11273,
                11275
            ],
            [
                11313,
                11326
            ],
            [
                11345,
                11425
            ],
            [
                11534,
                11542
            ],
            [
                11574,
                11608
            ],
            [
                11608,
                11629
            ],
            [
                11643,
                11681
            ],
            [
                11716,
                11733
            ],
            [
                11733,
                11745
            ],
            [
                11745,
                11767
            ],
            [
                11845,
                11939
            ],
            [
                11939,
                11985
            ],
            [
                12057,
                12059
            ],
            [
                12059,
                12115
            ],
            [
                12115,
                12157
            ],
            [
                12157,
                12188
            ],
            [
                12204,
                12207
            ],
            [
                12227,
                12238
            ],
            [
                12238,
                12256
            ],
            [
                12276,
                12315
            ],
            [
                12379,
                12398
            ],
            [
                12400,
                12408
            ],
            [
                12410,
                12414
            ],
            [
                12456,
                12492
            ],
            [
                12492,
                12621
            ],
            [
                12621,
                12641
            ],
            [
                12695,
                12698
            ],
            [
                12698,
                12725
            ],
            [
                12725,
                12737
            ],
            [
                12745,
                12757
            ],
            [
                12757,
                12819
            ],
            [
                12821,
                12825
            ],
            [
                12825,
                12845
            ],
            [
                12845,
                12912
            ],
            [
                12922,
                12929
            ],
            [
                12963,
                12993
            ],
            [
                12993,
                13095
            ],
            [
                13162,
                13180
            ],
            [
                13184,
                13196
            ],
            [
                13197,
                13201
            ],
            [
                13376,
                13377
            ],
            [
                13378,
                13381
            ],
            [
                13385,
                13388
            ],
            [
                13472,
                13473
            ],
            [
                13389,
                13453
            ],
            [
                13462,
                13472
            ],
            [
                13474,
                13552
            ],
            [
                13552,
                13602
            ],
            [
                13627,
                13628
            ],
            [
                13744,
                13748
            ],
            [
                13657,
                13671
            ],
            [
                13765,
                13807
            ],
            [
                13871,
                13899
            ],
            [
                13909,
                13918
            ],
            [
                13918,
                13955
            ],
            [
                13959,
                14013
            ],
            [
                14086,
                14111
            ],
            [
                14015,
                14017
            ],
            [
                14131,
                14139
            ],
            [
                14172,
                14174
            ],
            [
                14174,
                14180
            ],
            [
                14189,
                14201
            ],
            [
                14206,
                14224
            ],
            [
                14224,
                14238
            ],
            [
                14238,
                14327
            ],
            [
                14327,
                14365
            ],
            [
                14428,
                14444
            ],
            [
                14444,
                14472
            ],
            [
                14491,
                14499
            ],
            [
                14500,
                14534
            ],
            [
                14534,
                14539
            ],
            [
                14539,
                14563
            ],
            [
                14573,
                14585
            ],
            [
                14585,
                14602
            ],
            [
                14602,
                14676
            ],
            [
                14727,
                14729
            ],
            [
                14729,
                14750
            ],
            [
                14759,
                14799
            ],
            [
                15005,
                15070
            ],
            [
                15074,
                15082
            ],
            [
                15121,
                15123
            ],
            [
                15164,
                15203
            ],
            [
                15162,
                15163
            ],
            [
                15231,
                15253
            ],
            [
                15253,
                15286
            ],
            [
                15286,
                15325
            ],
            [
                15405,
                15433
            ],
            [
                15433,
                15445
            ],
            [
                15445,
                15476
            ],
            [
                15476,
                15500
            ],
            [
                15500,
                15545
            ],
            [
                15545,
                15551
            ],
            [
                15551,
                15606
            ],
            [
                15641,
                15643
            ],
            [
                15643,
                15658
            ],
            [
                15658,
                15660
            ],
            [
                15696,
                15806
            ],
            [
                15807,
                15818
            ],
            [
                15829,
                15869
            ],
            [
                15869,
                15907
            ],
            [
                15907,
                15914
            ],
            [
                15914,
                15935
            ],
            [
                15939,
                15959
            ],
            [
                15959,
                15982
            ],
            [
                16102,
                16104
            ],
            [
                16104,
                16110
            ],
            [
                16110,
                16204
            ],
            [
                16204,
                16246
            ],
            [
                16256,
                16269
            ],
            [
                16269,
                16299
            ],
            [
                16314,
                16316
            ],
            [
                16316,
                16323
            ],
            [
                16323,
                16339
            ],
            [
                16377,
                16379
            ],
            [
                16379,
                16385
            ],
            [
                16564,
                16596
            ],
            [
                16596,
                16609
            ],
            [
                16619,
                16666
            ],
            [
                16680,
                16694
            ],
            [
                16702,
                16774
            ],
            [
                16774,
                16791
            ],
            [
                16833,
                16966
            ],
            [
                16966,
                17005
            ],
            [
                17041,
                17043
            ],
            [
                17049,
                17060
            ],
            [
                17060,
                17085
            ],
            [
                17085,
                17128
            ],
            [
                17180,
                17201
            ],
            [
                17203,
                17246
            ],
            [
                17254,
                17274
            ],
            [
                17290,
                17305
            ],
            [
                17307,
                17317
            ],
            [
                17330,
                17338
            ],
            [
                17362,
                17390
            ],
            [
                17402,
                17423
            ],
            [
                17436,
                17500
            ],
            [
                17500,
                17565
            ],
            [
                17614,
                17617
            ],
            [
                17657,
                17692
            ],
            [
                17698,
                17705
            ],
            [
                17651,
                17652
            ],
            [
                17758,
                17826
            ],
            [
                17841,
                17893
            ],
            [
                17893,
                17953
            ],
            [
                17990,
                17992
            ],
            [
                17992,
                18001
            ],
            [
                18014,
                18021
            ],
            [
                18030,
                18068
            ],
            [
                18068,
                18107
            ],
            [
                18158,
                18161
            ],
            [
                18138,
                18146
            ],
            [
                18129,
                18136
            ],
            [
                18153,
                18156
            ],
            [
                18181,
                18183
            ],
            [
                18183,
                18197
            ],
            [
                18233,
                18235
            ],
            [
                18235,
                18239
            ],
            [
                18239,
                18330
            ],
            [
                18330,
                18388
            ],
            [
                18401,
                18451
            ],
            [
                18459,
                18464
            ],
            [
                18522,
                18523
            ],
            [
                18501,
                18503
            ],
            [
                18515,
                18518
            ],
            [
                18534,
                18562
            ],
            [
                18600,
                18603
            ],
            [
                18603,
                18675
            ],
            [
                18685,
                18686
            ],
            [
                18679,
                18684
            ],
            [
                18687,
                18693
            ],
            [
                18931,
                18933
            ],
            [
                19063,
                19078
            ],
            [
                18962,
                18965
            ],
            [
                19083,
                19089
            ],
            [
                19120,
                19123
            ],
            [
                19129,
                19169
            ],
            [
                19252,
                19298
            ],
            [
                19298,
                19337
            ],
            [
                19345,
                19409
            ],
            [
                19582,
                19623
            ],
            [
                19858,
                19868
            ],
            [
                19877,
                19910
            ],
            [
                19917,
                19973
            ],
            [
                19973,
                19985
            ],
            [
                20006,
                20040
            ],
            [
                20055,
                20078
            ],
            [
                20140,
                20149
            ],
            [
                20138,
                20139
            ],
            [
                20150,
                20175
            ],
            [
                20180,
                20190
            ],
            [
                20116,
                20138
            ],
            [
                20191,
                20199
            ],
            [
                20199,
                20253
            ],
            [
                20279,
                20324
            ],
            [
                20324,
                20361
            ],
            [
                20495,
                20525
            ],
            [
                20525,
                20582
            ],
            [
                20582,
                20617
            ],
            [
                20622,
                20645
            ],
            [
                20645,
                20697
            ],
            [
                20697,
                20734
            ],
            [
                20734,
                20823
            ],
            [
                20823,
                20975
            ],
            [
                20975,
                21002
            ],
            [
                21043,
                21065
            ],
            [
                21118,
                21158
            ],
            [
                21165,
                21248
            ],
            [
                21254,
                21264
            ],
            [
                21339,
                21354
            ],
            [
                21291,
                21322
            ],
            [
                21354,
                21356
            ],
            [
                21356,
                21411
            ],
            [
                21467,
                21511
            ],
            [
                21511,
                21545
            ],
            [
                21550,
                21552
            ],
            [
                21552,
                21580
            ],
            [
                21580,
                21591
            ],
            [
                21612,
                21734
            ],
            [
                21833,
                21857
            ],
            [
                21866,
                21869
            ],
            [
                21915,
                21948
            ],
            [
                22026,
                22033
            ],
            [
                22047,
                22048
            ],
            [
                22050,
                22051
            ],
            [
                22063,
                22104
            ],
            [
                22184,
                22275
            ],
            [
                22275,
                22283
            ],
            [
                22378,
                22384
            ],
            [
                22366,
                22376
            ],
            [
                22401,
                22421
            ],
            [
                22333,
                22334
            ],
            [
                22389,
                22399
            ],
            [
                22421,
                22422
            ],
            [
                22487,
                22501
            ],
            [
                22608,
                22611
            ],
            [
                22507,
                22552
            ],
            [
                22622,
                22626
            ],
            [
                22588,
                22595
            ],
            [
                22682,
                22684
            ],
            [
                22684,
                22695
            ],
            [
                22705,
                22724
            ],
            [
                22724,
                22736
            ],
            [
                22736,
                22777
            ],
            [
                22793,
                22859
            ],
            [
                22859,
                22877
            ],
            [
                22898,
                22899
            ],
            [
                22926,
                22927
            ],
            [
                22929,
                22941
            ],
            [
                22942,
                22962
            ],
            [
                22962,
                22970
            ],
            [
                22970,
                22986
            ],
            [
                22992,
                23000
            ],
            [
                23000,
                23035
            ],
            [
                23035,
                23092
            ],
            [
                23112,
                23113
            ],
            [
                23153,
                23235
            ],
            [
                23235,
                23292
            ],
            [
                23363,
                23365
            ],
            [
                23381,
                23388
            ],
            [
                23394,
                23428
            ],
            [
                23428,
                23458
            ],
            [
                23474,
                23489
            ],
            [
                23489,
                23518
            ],
            [
                23651,
                23674
            ],
            [
                23686,
                23726
            ],
            [
                23831,
                23833
            ],
            [
                23833,
                23882
            ],
            [
                23930,
                23976
            ],
            [
                23976,
                23995
            ],
            [
                24039,
                24086
            ],
            [
                24086,
                24256
            ],
            [
                24256,
                24264
            ],
            [
                24278,
                24290
            ],
            [
                24330,
                24333
            ],
            [
                24577,
                24580
            ],
            [
                24610,
                24633
            ],
            [
                24638,
                24669
            ],
            [
                24675,
                24677
            ],
            [
                24677,
                24705
            ],
            [
                24710,
                24751
            ],
            [
                24751,
                24820
            ],
            [
                24871,
                24877
            ],
            [
                25060,
                25063
            ],
            [
                24968,
                24982
            ],
            [
                25008,
                25011
            ],
            [
                24983,
                24992
            ],
            [
                25072,
                25074
            ],
            [
                25074,
                25113
            ],
            [
                25156,
                25256
            ],
            [
                25256,
                25258
            ],
            [
                25338,
                25358
            ],
            [
                25365,
                25393
            ],
            [
                25403,
                25410
            ],
            [
                25421,
                25456
            ],
            [
                25474,
                25480
            ],
            [
                25519,
                25522
            ],
            [
                25539,
                25542
            ],
            [
                25543,
                25547
            ],
            [
                25495,
                25496
            ],
            [
                25572,
                25604
            ],
            [
                25610,
                25652
            ],
            [
                25513,
                25514
            ],
            [
                25654,
                25679
            ],
            [
                25721,
                25741
            ],
            [
                25876,
                25895
            ],
            [
                25895,
                25927
            ],
            [
                25927,
                25945
            ],
            [
                25945,
                25950
            ],
            [
                25979,
                25983
            ],
            [
                25983,
                26056
            ],
            [
                26064,
                26083
            ],
            [
                26118,
                26143
            ],
            [
                26143,
                26155
            ],
            [
                26155,
                26157
            ],
            [
                26163,
                26182
            ],
            [
                26190,
                26215
            ],
            [
                26219,
                26238
            ],
            [
                26238,
                26248
            ],
            [
                26257,
                26276
            ],
            [
                26355,
                26429
            ],
            [
                26429,
                26453
            ],
            [
                26453,
                26466
            ],
            [
                26466,
                26495
            ],
            [
                26495,
                26514
            ],
            [
                26542,
                26583
            ],
            [
                26590,
                26635
            ],
            [
                26635,
                26699
            ],
            [
                26699,
                26705
            ],
            [
                26705,
                26709
            ],
            [
                26745,
                26747
            ],
            [
                26747,
                26749
            ],
            [
                26774,
                26840
            ],
            [
                26840,
                26865
            ],
            [
                26957,
                27104
            ],
            [
                27104,
                27122
            ],
            [
                27122,
                27133
            ],
            [
                27140,
                27173
            ],
            [
                27199,
                27221
            ],
            [
                27294,
                27295
            ],
            [
                27173,
                27174
            ],
            [
                27234,
                27294
            ],
            [
                27443,
                27445
            ],
            [
                27445,
                27454
            ],
            [
                27488,
                27617
            ],
            [
                27692,
                27694
            ],
            [
                27694,
                27713
            ],
            [
                27737,
                27740
            ],
            [
                27740,
                27766
            ],
            [
                27766,
                27769
            ],
            [
                27777,
                27804
            ],
            [
                27769,
                27770
            ],
            [
                27805,
                27821
            ],
            [
                27821,
                27890
            ],
            [
                27890,
                27910
            ],
            [
                27982,
                27985
            ],
            [
                28018,
                28020
            ],
            [
                27972,
                27981
            ],
            [
                27911,
                27920
            ],
            [
                28021,
                28028
            ],
            [
                27932,
                27944
            ],
            [
                28048,
                28051
            ],
            [
                28053,
                28125
            ],
            [
                28176,
                28178
            ],
            [
                28178,
                28199
            ],
            [
                28235,
                28255
            ],
            [
                28272,
                28301
            ],
            [
                28218,
                28223
            ],
            [
                28335,
                28340
            ],
            [
                28340,
                28354
            ],
            [
                28354,
                28368
            ],
            [
                28368,
                28386
            ],
            [
                28386,
                28443
            ],
            [
                28443,
                28479
            ],
            [
                28503,
                28617
            ],
            [
                28761,
                28783
            ],
            [
                28785,
                28806
            ],
            [
                28806,
                28843
            ],
            [
                28843,
                28912
            ],
            [
                28912,
                28919
            ],
            [
                28928,
                29008
            ],
            [
                29008,
                29041
            ],
            [
                29041,
                29058
            ],
            [
                29058,
                29075
            ],
            [
                29097,
                29125
            ],
            [
                29125,
                29156
            ],
            [
                29173,
                29181
            ],
            [
                29197,
                29199
            ],
            [
                29202,
                29260
            ],
            [
                29286,
                29372
            ],
            [
                29392,
                29404
            ],
            [
                29377,
                29380
            ],
            [
                29414,
                29416
            ],
            [
                29495,
                29514
            ],
            [
                29514,
                29610
            ],
            [
                29623,
                29638
            ],
            [
                29694,
                29696
            ],
            [
                29696,
                29722
            ],
            [
                29827,
                29925
            ],
            [
                29925,
                30012
            ],
            [
                30034,
                30052
            ],
            [
                30052,
                30072
            ],
            [
                30087,
                30187
            ],
            [
                30187,
                30233
            ],
            [
                30261,
                30263
            ],
            [
                30263,
                30390
            ],
            [
                30405,
                30416
            ],
            [
                30436,
                30456
            ],
            [
                30792,
                30793
            ],
            [
                30458,
                30531
            ],
            [
                30559,
                30678
            ],
            [
                30684,
                30735
            ],
            [
                30759,
                30771
            ]
        ],
        "row_chars": [
            [
                0,
                401
            ],
            [
                401,
                533
            ],
            [
                533,
                587
            ],
            [
                587,
                641
            ],
            [
                641,
                720
            ],
            [
                720,
                785
            ],
            [
                785,
                876
            ],
            [
                876,
                953
            ],
            [
                953,
                1029
            ],
            [
                1029,
                1076
            ],
            [
                1076,
                1236
            ],
            [
                1236,
                1521
            ],
            [
                1521,
                1649
            ],
            [
                1649,
                1775
            ],
            [
                1775,
                2059
            ],
            [
                2059,
                2153
            ],
            [
                2153,
                2208
            ],
            [
                2208,
                2373
            ],
            [
                2373,
                2452
            ],
            [
                2452,
                2649
            ],
            [
                2649,
                2708
            ],
            [
                2708,
                2862
            ],
            [
                2862,
                2892
            ],
            [
                2892,
                2903
            ],
            [
                2903,
                2935
            ],
            [
                2935,
                2997
            ],
            [
                2997,
                3040
            ],
            [
                3040,
                3073
            ],
            [
                3073,
                3089
            ],
            [
                3089,
                3099
            ],
            [
                3099,
                3328
            ],
            [
                3328,
                3373
            ],
            [
                3373,
                3384
            ],
            [
                3384,
                3479
            ],
            [
                3479,
                3504
            ],
            [
                3504,
                3509
            ],
            [
                3509,
                3587
            ],
            [
                3587,
                3638
            ],
            [
                3638,
                3730
            ],
            [
                3730,
                3759
            ],
            [
                3759,
                3842
            ],
            [
                3842,
                3871
            ],
            [
                3871,
                3977
            ],
            [
                3977,
                3995
            ],
            [
                3995,
                4084
            ],
            [
                4084,
                4284
            ],
            [
                4284,
                4399
            ],
            [
                4399,
                4558
            ],
            [
                4558,
                4996
            ],
            [
                4996,
                5101
            ],
            [
                5101,
                5216
            ],
            [
                5216,
                5364
            ],
            [
                5364,
                5389
            ],
            [
                5389,
                5447
            ],
            [
                5447,
                5455
            ],
            [
                5455,
                5482
            ],
            [
                5482,
                5505
            ],
            [
                5505,
                5519
            ],
            [
                5519,
                5605
            ],
            [
                5605,
                5664
            ],
            [
                5664,
                5715
            ],
            [
                5715,
                5745
            ],
            [
                5745,
                5809
            ],
            [
                5809,
                5896
            ],
            [
                5896,
                5917
            ],
            [
                5917,
                5934
            ],
            [
                5934,
                5979
            ],
            [
                5979,
                5998
            ],
            [
                5998,
                6078
            ],
            [
                6078,
                6168
            ],
            [
                6168,
                6308
            ],
            [
                6308,
                6314
            ],
            [
                6314,
                6333
            ],
            [
                6333,
                6366
            ],
            [
                6366,
                6391
            ],
            [
                6391,
                6407
            ],
            [
                6407,
                6421
            ],
            [
                6421,
                6458
            ],
            [
                6458,
                6479
            ],
            [
                6479,
                6519
            ],
            [
                6519,
                6553
            ],
            [
                6553,
                6604
            ],
            [
                6604,
                6622
            ],
            [
                6622,
                6679
            ],
            [
                6679,
                6730
            ],
            [
                6730,
                6984
            ],
            [
                6984,
                7014
            ],
            [
                7014,
                7045
            ],
            [
                7045,
                7096
            ],
            [
                7096,
                7154
            ],
            [
                7154,
                7253
            ],
            [
                7253,
                7320
            ],
            [
                7320,
                7600
            ],
            [
                7600,
                7640
            ],
            [
                7640,
                7957
            ],
            [
                7957,
                7972
            ],
            [
                7972,
                8054
            ],
            [
                8054,
                8114
            ],
            [
                8114,
                8282
            ],
            [
                8282,
                8316
            ],
            [
                8316,
                8345
            ],
            [
                8345,
                8377
            ],
            [
                8377,
                8431
            ],
            [
                8431,
                8492
            ],
            [
                8492,
                8875
            ],
            [
                8875,
                8912
            ],
            [
                8912,
                9020
            ],
            [
                9020,
                9199
            ],
            [
                9199,
                9458
            ],
            [
                9458,
                9521
            ],
            [
                9521,
                10016
            ],
            [
                10016,
                10231
            ],
            [
                10231,
                10514
            ],
            [
                10514,
                10567
            ],
            [
                10567,
                10742
            ],
            [
                10742,
                10926
            ],
            [
                10926,
                10936
            ],
            [
                10936,
                10974
            ],
            [
                10974,
                11003
            ],
            [
                11003,
                11275
            ],
            [
                11275,
                11313
            ],
            [
                11313,
                11608
            ],
            [
                11608,
                11733
            ],
            [
                11733,
                11745
            ],
            [
                11745,
                11769
            ],
            [
                11769,
                11787
            ],
            [
                11787,
                11845
            ],
            [
                11845,
                11939
            ],
            [
                11939,
                12059
            ],
            [
                12059,
                12115
            ],
            [
                12115,
                12157
            ],
            [
                12157,
                12188
            ],
            [
                12188,
                12204
            ],
            [
                12204,
                12238
            ],
            [
                12238,
                12414
            ],
            [
                12414,
                12456
            ],
            [
                12456,
                12492
            ],
            [
                12492,
                12621
            ],
            [
                12621,
                12698
            ],
            [
                12698,
                12725
            ],
            [
                12725,
                12757
            ],
            [
                12757,
                12825
            ],
            [
                12825,
                12845
            ],
            [
                12845,
                12931
            ],
            [
                12931,
                12963
            ],
            [
                12963,
                12993
            ],
            [
                12993,
                13095
            ],
            [
                13095,
                13162
            ],
            [
                13162,
                13378
            ],
            [
                13378,
                13552
            ],
            [
                13552,
                13807
            ],
            [
                13807,
                13867
            ],
            [
                13867,
                13918
            ],
            [
                13918,
                13955
            ],
            [
                13955,
                14174
            ],
            [
                14174,
                14224
            ],
            [
                14224,
                14238
            ],
            [
                14238,
                14327
            ],
            [
                14327,
                14365
            ],
            [
                14365,
                14399
            ],
            [
                14399,
                14428
            ],
            [
                14428,
                14444
            ],
            [
                14444,
                14534
            ],
            [
                14534,
                14539
            ],
            [
                14539,
                14585
            ],
            [
                14585,
                14602
            ],
            [
                14602,
                14729
            ],
            [
                14729,
                14799
            ],
            [
                14799,
                14877
            ],
            [
                14877,
                14951
            ],
            [
                14951,
                15005
            ],
            [
                15005,
                15123
            ],
            [
                15123,
                15253
            ],
            [
                15253,
                15286
            ],
            [
                15286,
                15325
            ],
            [
                15325,
                15388
            ],
            [
                15388,
                15433
            ],
            [
                15433,
                15445
            ],
            [
                15445,
                15476
            ],
            [
                15476,
                15500
            ],
            [
                15500,
                15545
            ],
            [
                15545,
                15551
            ],
            [
                15551,
                15643
            ],
            [
                15643,
                15658
            ],
            [
                15658,
                15869
            ],
            [
                15869,
                15907
            ],
            [
                15907,
                15914
            ],
            [
                15914,
                15939
            ],
            [
                15939,
                15959
            ],
            [
                15959,
                16104
            ],
            [
                16104,
                16110
            ],
            [
                16110,
                16204
            ],
            [
                16204,
                16269
            ],
            [
                16269,
                16316
            ],
            [
                16316,
                16323
            ],
            [
                16323,
                16379
            ],
            [
                16379,
                16385
            ],
            [
                16385,
                16563
            ],
            [
                16563,
                16596
            ],
            [
                16596,
                16774
            ],
            [
                16774,
                16966
            ],
            [
                16966,
                17060
            ],
            [
                17060,
                17085
            ],
            [
                17085,
                17500
            ],
            [
                17500,
                17617
            ],
            [
                17617,
                17893
            ],
            [
                17893,
                17992
            ],
            [
                17992,
                18068
            ],
            [
                18068,
                18183
            ],
            [
                18183,
                18235
            ],
            [
                18235,
                18239
            ],
            [
                18239,
                18330
            ],
            [
                18330,
                18603
            ],
            [
                18603,
                18675
            ],
            [
                18675,
                18933
            ],
            [
                18933,
                19298
            ],
            [
                19298,
                19409
            ],
            [
                19409,
                19507
            ],
            [
                19507,
                19582
            ],
            [
                19582,
                19623
            ],
            [
                19623,
                19858
            ],
            [
                19858,
                19973
            ],
            [
                19973,
                20078
            ],
            [
                20078,
                20199
            ],
            [
                20199,
                20324
            ],
            [
                20324,
                20361
            ],
            [
                20361,
                20388
            ],
            [
                20388,
                20401
            ],
            [
                20401,
                20431
            ],
            [
                20431,
                20495
            ],
            [
                20495,
                20525
            ],
            [
                20525,
                20582
            ],
            [
                20582,
                20645
            ],
            [
                20645,
                20697
            ],
            [
                20697,
                20734
            ],
            [
                20734,
                20823
            ],
            [
                20823,
                20975
            ],
            [
                20975,
                21002
            ],
            [
                21002,
                21043
            ],
            [
                21043,
                21067
            ],
            [
                21067,
                21118
            ],
            [
                21118,
                21356
            ],
            [
                21356,
                21511
            ],
            [
                21511,
                21545
            ],
            [
                21545,
                21552
            ],
            [
                21552,
                21580
            ],
            [
                21580,
                21734
            ],
            [
                21734,
                21827
            ],
            [
                21827,
                21857
            ],
            [
                21857,
                22026
            ],
            [
                22026,
                22275
            ],
            [
                22275,
                22423
            ],
            [
                22423,
                22487
            ],
            [
                22487,
                22684
            ],
            [
                22684,
                22736
            ],
            [
                22736,
                22777
            ],
            [
                22777,
                22793
            ],
            [
                22793,
                22859
            ],
            [
                22859,
                22962
            ],
            [
                22962,
                22970
            ],
            [
                22970,
                23000
            ],
            [
                23000,
                23035
            ],
            [
                23035,
                23235
            ],
            [
                23235,
                23292
            ],
            [
                23292,
                23428
            ],
            [
                23428,
                23489
            ],
            [
                23489,
                23520
            ],
            [
                23520,
                23599
            ],
            [
                23599,
                23651
            ],
            [
                23651,
                23833
            ],
            [
                23833,
                23976
            ],
            [
                23976,
                24086
            ],
            [
                24086,
                24256
            ],
            [
                24256,
                24333
            ],
            [
                24333,
                24573
            ],
            [
                24573,
                24677
            ],
            [
                24677,
                24751
            ],
            [
                24751,
                24820
            ],
            [
                24820,
                24871
            ],
            [
                24871,
                24878
            ],
            [
                24878,
                24968
            ],
            [
                24968,
                25074
            ],
            [
                25074,
                25256
            ],
            [
                25256,
                25480
            ],
            [
                25480,
                25742
            ],
            [
                25742,
                25876
            ],
            [
                25876,
                25895
            ],
            [
                25895,
                25927
            ],
            [
                25927,
                25945
            ],
            [
                25945,
                25983
            ],
            [
                25983,
                26143
            ],
            [
                26143,
                26155
            ],
            [
                26155,
                26238
            ],
            [
                26238,
                26429
            ],
            [
                26429,
                26453
            ],
            [
                26453,
                26466
            ],
            [
                26466,
                26495
            ],
            [
                26495,
                26635
            ],
            [
                26635,
                26699
            ],
            [
                26699,
                26705
            ],
            [
                26705,
                26747
            ],
            [
                26747,
                26840
            ],
            [
                26840,
                27104
            ],
            [
                27104,
                27122
            ],
            [
                27122,
                27173
            ],
            [
                27173,
                27445
            ],
            [
                27445,
                27694
            ],
            [
                27694,
                27740
            ],
            [
                27740,
                27766
            ],
            [
                27766,
                27821
            ],
            [
                27821,
                27890
            ],
            [
                27890,
                28178
            ],
            [
                28178,
                28340
            ],
            [
                28340,
                28354
            ],
            [
                28354,
                28368
            ],
            [
                28368,
                28386
            ],
            [
                28386,
                28443
            ],
            [
                28443,
                28617
            ],
            [
                28617,
                28761
            ],
            [
                28761,
                28806
            ],
            [
                28806,
                28843
            ],
            [
                28843,
                28912
            ],
            [
                28912,
                29008
            ],
            [
                29008,
                29041
            ],
            [
                29041,
                29058
            ],
            [
                29058,
                29125
            ],
            [
                29125,
                29199
            ],
            [
                29199,
                29372
            ],
            [
                29372,
                29514
            ],
            [
                29514,
                29696
            ],
            [
                29696,
                29925
            ],
            [
                29925,
                30052
            ],
            [
                30052,
                30187
            ],
            [
                30187,
                30263
            ],
            [
                30263,
                30793
            ]
        ]
    },
    "abridged": {
        "text": "Although the morning was raw, and although the fog still seemed heavy beyond the dirt-encrusted windows, I was curious enough about London to agree when Miss Jellyby proposed that we should go out for a walk.\n\"Ma won't be down for ever so long,\" she said, \"and then breakfast won't be ready for an hour afterwards, they dawdle so. Pa gets what he can and goes to the office. He never has what you would call a regular breakfast.\"\nAda said she would go out too. I suggested to Peepy that he should let me wash him and afterwards lay him down on my bed again. To this he submitted, looking astonished and miserable at the washing, certainly, but making no complaint, and going snugly to sleep as soon as it was over.\nAda and I found Miss Jellyby trying to warm herself at the fire in the writing-room, where everything was just as we had left it last night. Crumbs, dust, and waste-paper were all over the house. Some pewter pots and a milk-can hung on the area railings; the door stood open; and we met the cook round the corner coming out of a public-house, wiping her mouth.\nBut before we met the cook, we met Richard, who was agreeably surprised to see us and said he would gladly share our walk. So he took care of Ada, and Miss Jellyby and I went first. Miss Jellyby had relapsed into her sulky manner.\n\"Where would you wish to go?\" she asked.\n\"Anywhere, my dear,\" I replied.\n\"Anywhere's nowhere,\" said Miss Jellyby, stopping.\n\"Let us go somewhere at any rate,\" said I.\nShe then walked on very fast.\n\"I don't care!\" she said. \"If he was to come to our house with his great, shining, lumpy forehead night after night till he was as old as Methuselah, I wouldn't have anything to say to him. Such asses as he and Ma make of themselves!\"\n\"My dear!\" I remonstrated. \"Your duty as a child-\"\n\"Oh! Don't talk of that, Miss Summerson; where's Ma's duty as a parent? All made over to the public and Africa, I suppose! You are shocked, I dare say! Very well, so am I; we are both shocked, and there's an end of it!\"\nShe walked on faster yet.\n\"But for all that, he may come, and come, and come, and I won't have anything to say to him. I can't bear him. I hate the stuff he and Ma talk. It's all such nonsense!\"\nI understood her to refer to Mr. Quale, the young gentleman who had appeared after dinner yesterday. Richard and Ada came up, laughing and asking us if we meant to run a race. Thus interrupted, Miss Jellyby became silent and walked moodily at my side while I admired the streets and the people going to and fro, the number of vehicles passing, the sweeping out of shops, and the extraordinary creatures in rags secretly groping among the swept-out rubbish.\n\"So, cousin,\" said the cheerful voice of Richard behind me, \"we are never to get out of Chancery! We have come to it by another way, and - by the Great Seal, here's the old lady again!\"\nTruly, there she was, curtsying and smiling, and saying, \"The wards in Jarndyce! Ve-ry happy, I am sure!\"\n\"You are out early, ma'am,\" said I.\n\"Yes! I usually walk here early. Before the court sits. I collect my thoughts here for the business of the day,\" said the old lady mincingly. \"The business of the day requires a great deal of thought.\"\n\"Who's this, Miss Summerson?\" whispered Miss Jellyby.\nThe little old lady heard, and answered for herself.\n\"A suitor, my child. At your service. I have the honour to attend court regularly. With my documents. Have I the pleasure of addressing another of the youthful parties in Jarndyce?\" said the old lady, with her head on one side.\nRichard good-naturedly explained that Miss Jellyby was not connected with the suit.\n\"Ha!\" said the old lady. \"She does not expect a judgment? She will still grow old. But not so old. Oh, dear, no! This is the garden of Lincoln's Inn. I call it my garden. It is quite a bower in the summer-time. Where the birds sing. I pass the greater part of the long vacation here. You find the long vacation exceedingly long, don't you?\"\nWe said yes, as she seemed to expect it.\n\"When the leaves are falling from the trees,\" said the old lady, \"the vacation is fulfilled and the sixth seal, mentioned in the Revelations, again prevails. Pray come and see my lodging. It will be a good omen for me. Youth, and hope, and beauty very seldom visit.\"\nShe had taken my hand, and was leading me and Miss Jellyby away. I did not know how to excuse myself and looked to Richard for aid. As he was half amused and half curious, he and Ada followed us.\nThe old lady lived close by, in a narrow back street.\n\"This is my lodging. Pray walk up!\"\nShe had stopped at a shop over which was written KROOK, RAG AND BOTTLE WAREHOUSE. Also, in long thin letters, KROOK, DEALER IN MARINE STORES. In one part of the window was the inscription BONES BOUGHT. In another, KITCHEN-STUFF BOUGHT. In another, OLD IRON BOUGHT. In another, WASTE-PAPER BOUGHT. In another, LADIES' AND GENTLEMEN'S WARDROBES BOUGHT. Everything seemed to be bought and nothing to be sold there.\nIn all parts of the window were quantities of dirty bottles - medicine bottles, ginger-beer and soda-water bottles, pickle bottles, wine bottles, and a great many ink bottles. The shop had the air of being a disowned relation of the law. There was a little tottering bench of shabby old volumes outside the door, labelled \"Law Books, 9d.\" Some of the inscriptions were written in law-hand, like the letters I had received from Kenge and Carboy's office. One notice in the same writing announced that a respectable man aged forty-five wanted copying jobs, to execute with neatness and dispatch: Address to Nemo, care of Mr. Krook, within.\nA little way inside the shop-door lay heaps of old cracked parchment scrolls, dog-eared law-papers and a litter of rags. One had only to fancy, as Richard whispered to Ada, that yonder bones in a corner, piled together and picked very clean, were the bones of clients, to make the picture complete.\nWe could only see all this by a lantern carried by an old man in the shop, in spectacles and a hairy cap. He was short, cadaverous, and withered, with his head sunk sideways between his shoulders and the breath issuing in visible smoke from his mouth as if he were on fire within. His puckered throat and chin were so frosted with white hairs that he looked like some old root in a fall of snow.\n\"Hi, hi!\" said the old man, coming to the door. \"Have you anything to sell?\"\nWe naturally drew back and glanced at the old lady, who had been trying to open the house-door with a key. She became so pressingly earnest in her entreaties that we would walk up and see her apartment, that I saw nothing for it but to comply. I suppose we were all curious; at any rate, when the old man said, \"Aye, aye! Please her! It won't take a minute!\" we all went in, stimulated by Richard's laughing encouragement and relying on his protection.\n\"My landlord, Krook,\" said the little old lady. \"He is called among the neighbours the Lord Chancellor. His shop is called the Court of Chancery. He is a very eccentric person. Oh, very odd!\"\nShe shook her head and tapped her forehead with her finger. \"For he is a little - you know - M!\" The old man overheard, and laughed.\n\"It's true enough,\" he said, going before us with the lantern, \"that they call me the Lord Chancellor and call my shop Chancery. And why do you think that is?\"\n\"I don't know, I am sure!\" said Richard carelessly.\n\"You see,\" said the old man, stopping and turning round, \"they - Hi! Here's lovely hair! I have got three sacks of ladies' hair below, but none so beautiful as this!\"\n\"That'll do, my good friend!\" said Richard, strongly disapproving of his having drawn one of Ada's tresses through his yellow hand. The old man darted him a sudden startling look.\nBut Ada, blushing, interposed and laughingly said she could only feel proud of such admiration. Mr. Krook shrunk into his former self as suddenly as he had leaped out of it.\n\"You see, I have so many things here,\" he resumed, \"that the neighbours have given me and my place a christening. I have a liking for rust and cobwebs. And all's fish that comes to my net. I can't abear to part with anything I once lay hold of, or to have any sweeping or cleaning. That's how I've got the name of Chancery. I don't mind. I go to see my noble and learned brother pretty well every day, when he sits in the Inn. He don't notice me, but I notice him. Hi, Lady Jane!\"\nA large grey cat leaped from a shelf on to his shoulder and startled us all.\n\"Hi! Show 'em how you scratch, my lady!\" said her master.\nThe cat leaped down and ripped at a bundle of rags with her tigerish claws.\n\"She'd do as much for anyone I was to set her on,\" said the old man. He had by this time led us across the shop, and now opened a door at the back. The little old lady graciously observed,\n\"That will do, Krook. You mean well, but are tiresome. My young friends are pressed for time. They are the wards in Jarndyce.\"\n\"Jarndyce!\" said the old man with a start.\n\"Jarndyce and Jarndyce. The great suit, Krook,\" returned his lodger.\n\"Hi!\" exclaimed the old man in a tone of thoughtful amazement. \"Think of it!\"\nHe looked so curiously at us that Richard said, \"Why, you appear to trouble yourself a good deal about the causes set before your learned brother, the other Chancellor!\"\n\"Yes,\" said the old man abstractedly. \"Sure! Your name now will be-\"\n\"Richard Carstone.\"\n\"Carstone,\" he repeated. \"Yes. There was the name of Barbary, and the name of Clare, and the name of Dedlock, too, I think.\"\n\"He knows as much of the cause as the real Chancellor!\" said Richard, quite astonished.\n\"Aye!\" said the old man. \"Yes! Tom Jarndyce was often in here. He got into a habit of strolling about when the cause was on, talking to the shopkeepers and telling 'em to keep out of Chancery, whatever they did. 'For,' says he, 'it's being roasted at a slow fire; it's being stung to death by single bees; it's being drowned by drops; it's going mad by grains.' He was as near making away with himself as could be.\"\nWe listened with horror.\n\"He come in at the door,\" said the old man, \"on the day he did it - the whole neighbourhood had said for months that he would do it, sooner or later - he come in that day, and sat himself on a bench there, and asked me (I was a mortal sight younger then) to fetch him a pint of wine. 'For,' says he, 'Krook, I am much depressed; my cause is on again.' I persuaded him to go to the tavern across the way; and I followed and looked in at the window, and saw him, comfortable in the arm-chair by the fire, and company with him. I hadn't hardly got back here when I heard a shot go echoing. I ran out - neighbours ran out - twenty of us cried at once, 'Tom Jarndyce!'\"\nThe old man stopped, looked hard at us, and blew the lantern out.\n\"We were right. Hi! To be sure, how the neighbourhood poured into court that afternoon while the cause was on! How my noble and learned brother, and all the rest of 'em, muddled away as usual and tried to look as if they'd heard nothing, or had nothing at all to do with it!\"\nAda's colour had entirely left her, and Richard was scarcely less pale. I could not wonder. To my surprise, the old lady seemed unaffected and led the way upstairs again, informing us that her landlord was \"a little M, you know!\"\nShe lived at the top of the house, in a large room, from which she had a glimpse of Lincoln's Inn Hall. Her room was clean, but very, very bare. There were no coals nor ashes in the grate, and no articles of clothing anywhere, nor any kind of food. Upon a shelf were a plate or two, a cup or two, but all dry and empty. I thought, as I looked round, than I understood her pinched appearance better than before.\n\"Extremely honoured, I am sure,\" said our poor hostess, \"by this visit from the wards in Jarndyce. And very much indebted for the omen. I have lived here many years. I pass my days in court, my evenings and my nights here. I find the nights long, for I sleep little and think much. That is, of course, unavoidable, being in Chancery. I am sorry I cannot offer chocolate. I expect a judgment shortly and shall then place my establishment on a superior footing. At present, I don't mind confessing to the wards in Jarndyce (in strict confidence) that I sometimes find it difficult to keep up a genteel appearance. I have felt the cold here. It matters very little.\"\nShe partly drew aside the curtain of the low garret window and called our attention to a number of bird-cages hanging there, containing at least twenty larks, linnets, and goldfinches.\n\"I began to keep the little creatures,\" she said, \"with the intention of restoring them to liberty. When my judgment should be given. Yes! They die in prison, though. Their lives are so short in comparison with Chancery proceedings that, one by one, the whole collection has died over and over again. Very mortifying, is it not?\"\nShe did not seem to expect a reply, but rambled on:\n\"Indeed, I doubt sometimes, I do assure you, whether I may not one day be found lying stark and senseless here, as I have found so many birds!\"\nAda looked at Richard, who softly laid some money on the chimney-piece, unobserved.\n\"I can't allow the birds to sing much,\" said the little old lady, \"for they confuse my mind. And my mind needs to be so very clear in court, you know! Another time, I'll tell you their names. On a day of such good omen, they shall sing as much as they like. In honour of youth, hope, and beauty,\" with a smile and curtsy. \"There! We'll let in the light.\"\nThe birds began to stir and chirp.\n\"I cannot admit the air freely,\" said the little old lady, \"because the cat you saw downstairs, called Lady Jane, is greedy for their lives. She crouches on the parapet outside for hours and hours. She is jealous of their regaining their liberty. In consequence of the judgment that will be shortly given. She is sly and full of malice.\"\nSome neighbouring bells reminded the poor soul that it was half-past nine. She hurriedly took up her little bag of documents, and asked if we were also going into court. On our answering no, she opened the door to attend us downstairs.\n\"With such an omen, it is even more necessary than usual that I should be there before the Chancellor comes in,\" said she, \"for he might mention my case the first thing. I have a feeling that he will.\"\nShe stopped on the second floor and silently pointed at a dark door.\n\"The only other lodger,\" she whispered in explanation, \"a law-writer. The children in the lanes here say he has sold himself to the devil. Hush!\" She went before us down the stairs on tiptoe.\nPassing through the shop on our way out, we found the old man storing a quantity of packets of waste-paper in a kind of well in the floor. He had a piece of chalk, with which, as he put each package down, he made a crooked mark on the wall.\nThe others had all gone past, when he touched me on the arm to stop me, and chalked the letter J upon the wall, in a very curious manner, shaping it backward.\n\"Can you read it?\" he asked me with a keen glance.\n\"Surely,\" said I. \"It's J.\"\nWith another glance at me, and a glance at the door, he rubbed it out and wrote an \"a\" in its place, and said, \"What's that?\"\nI told him. He rubbed that out and wrote the letter \"r,\" and asked the same question. He went on this way until he had formed the word Jarndyce, without once leaving two letters on the wall together.\n\"What does that spell?\" he asked me.\nWhen I told him, he laughed. In the same odd way, he then produced singly, and rubbed out, the letters forming the words Bleak House. These, in some astonishment, I also read; and he laughed again.\n\"Hi!\" said he. \"I can copy from memory, you see, miss, though I can neither read nor write.\"\nHe looked so disagreeable that I was quite relieved by Richard's appearing at the door and saying, \"Miss Summerson, I hope you are not bargaining for the sale of your hair. Don't be tempted. Three sacks are quite enough for Mr. Krook!\"\nWishing Mr. Krook good morning, I joined my friends outside, where we parted with the little old lady. Before we left, we looked back and saw Mr. Krook standing at his shop-door, in his spectacles, looking after us, with his cat upon his shoulder.\n\"Quite an adventure!\" said Richard with a sigh. \"Ah, cousin, it's a weary word, this Chancery!\"\n\"It is to me, and has been ever since I can remember,\" returned Ada. \"I am grieved that I and my relations should be enemies - as I suppose we are - and that we should all be ruining one another without knowing how or why. It seems very strange that an honest judge has not been able to find out what the right thing is.\"\n\"Ah, cousin!\" said Richard. \"Strange, indeed! All this wasteful, wanton chess-playing is very strange. To see that composed court yesterday and to think of the wretchedness of the pieces on the board gave me the headache and the heartache both together. But at all events, Ada - I may call you Ada?\"\n\"Of course you may, cousin Richard.\"\n\"At all events, Chancery will work none of its bad influences on us. We have been brought together, thanks to our good kinsman, and it can't divide us now!\"\n\"Never, I hope, cousin Richard!\" said Ada gently.\nMiss Jellyby gave me a very significant look. I smiled in return, and we made our way back.\nHalf an hour after our arrival, Mrs. Jellyby appeared; and the various things necessary for breakfast straggled one by one into the dining-room. Mrs. Jellyby did not seem to have changed her dress. She was greatly occupied during breakfast, for the morning's post brought a heavy correspondence about Borrioboola-Gha. The children tumbled about; and Peepy was lost for an hour and a half, and brought home from Newgate market by a policeman. The equable manner in which Mrs. Jellyby sustained both his absence and his restoration surprised us all.\nShe was by that time dictating to Caddy, and Caddy was fast relapsing into the inky condition in which we had found her. At one o'clock an open carriage arrived for us. Mrs. Jellyby charged us with many remembrances to her good friend Mr. Jarndyce; Caddy left her desk to see us depart, kissed me, and stood sobbing on the steps. Peepy, I am happy to say, was asleep and spared the pain of separation (I feared that he had gone to Newgate market in search of me); and all the other children got up behind the barouche and fell off. We saw them, with great concern, scattered over the ground as we rolled away.",
        "paragraph_chars": [
            [
                0,
                209
            ],
            [
                209,
                430
            ],
            [
                430,
                715
            ],
            [
                715,
                1076
            ],
            [
                1076,
                1307
            ],
            [
                1307,
                1348
            ],
            [
                1348,
                1380
            ],
            [
                1380,
                1431
            ],
            [
                1431,
                1474
            ],
            [
                1474,
                1504
            ],
            [
                1504,
                1739
            ],
            [
                1739,
                1790
            ],
            [
                1790,
                2010
            ],
            [
                2010,
                2036
            ],
            [
                2036,
                2205
            ],
            [
                2205,
                2662
            ],
            [
                2662,
                2848
            ],
            [
                2848,
                2954
            ],
            [
                2954,
                2990
            ],
            [
                2990,
                3192
            ],
            [
                3192,
                3246
            ],
            [
                3246,
                3299
            ],
            [
                3299,
                3527
            ],
            [
                3527,
                3611
            ],
            [
                3611,
                3952
            ],
            [
                3952,
                3993
            ],
            [
                3993,
                4260
            ],
            [
                4260,
                4456
            ],
            [
                4456,
                4510
            ],
            [
                4510,
                4546
            ],
            [
                4546,
                4958
            ],
            [
                4958,
                5596
            ],
            [
                5596,
                5895
            ],
            [
                5895,
                6291
            ],
            [
                6291,
                6368
            ],
            [
                6368,
                6821
            ],
            [
                6821,
                7013
            ],
            [
                7013,
                7146
            ],
            [
                7146,
                7306
            ],
            [
                7306,
                7358
            ],
            [
                7358,
                7525
            ],
            [
                7525,
                7705
            ],
            [
                7705,
                7879
            ],
            [
                7879,
                8360
            ],
            [
                8360,
                8437
            ],
            [
                8437,
                8495
            ],
            [
                8495,
                8571
            ],
            [
                8571,
                8760
            ],
            [
                8760,
                8887
            ],
            [
                8887,
                8930
            ],
            [
                8930,
                8999
            ],
            [
                8999,
                9077
            ],
            [
                9077,
                9247
            ],
            [
                9247,
                9316
            ],
            [
                9316,
                9336
            ],
            [
                9336,
                9461
            ],
            [
                9461,
                9549
            ],
            [
                9549,
                9965
            ],
            [
                9965,
                9990
            ],
            [
                9990,
                10655
            ],
            [
                10655,
                10721
            ],
            [
                10721,
                10997
            ],
            [
                10997,
                11227
            ],
            [
                11227,
                11638
            ],
            [
                11638,
                12302
            ],
            [
                12302,
                12487
            ],
            [
                12487,
                12817
            ],
            [
                12817,
                12869
            ],
            [
                12869,
                13013
            ],
            [
                13013,
                13097
            ],
            [
                13097,
                13452
            ],
            [
                13452,
                13487
            ],
            [
                13487,
                13825
            ],
            [
                13825,
                14061
            ],
            [
                14061,
                14263
            ],
            [
                14263,
                14332
            ],
            [
                14332,
                14524
            ],
            [
                14524,
                14765
            ],
            [
                14765,
                14924
            ],
            [
                14924,
                14975
            ],
            [
                14975,
                15003
            ],
            [
                15003,
                15129
            ],
            [
                15129,
                15329
            ],
            [
                15329,
                15366
            ],
            [
                15366,
                15564
            ],
            [
                15564,
                15657
            ],
            [
                15657,
                15893
            ],
            [
                15893,
                16141
            ],
            [
                16141,
                16237
            ],
            [
                16237,
                16559
            ],
            [
                16559,
                16859
            ],
            [
                16859,
                16896
            ],
            [
                16896,
                17053
            ],
            [
                17053,
                17103
            ],
            [
                17103,
                17195
            ],
            [
                17195,
                17743
            ],
            [
                17743,
                18352
            ]
        ],
        "segment_chars": [
            [
                0,
                209
            ],
            [
                209,
                331
            ],
            [
                331,
                375
            ],
            [
                375,
                430
            ],
            [
                430,
                461
            ],
            [
                461,
                558
            ],
            [
                558,
                715
            ],
            [
                715,
                856
            ],
            [
                856,
                911
            ],
            [
                911,
                1076
            ],
            [
                1076,
                1199
            ],
            [
                1199,
                1258
            ],
            [
                1258,
                1307
            ],
            [
                1307,
                1337
            ],
            [
                1337,
                1348
            ],
            [
                1348,
                1380
            ],
            [
                1380,
                1431
            ],
            [
                1431,
                1474
            ],
            [
                1474,
                1504
            ],
            [
                1504,
                1520
            ],
            [
                1520,
                1530
            ],
            [
                1530,
                1694
            ],
            [
                1694,
                1739
            ],
            [
                1739,
                1750
            ],
            [
                1750,
                1766
            ],
            [
                1766,
                1790
            ],
            [
                1790,
                1795
            ],
            [
                1795,
                1862
            ],
            [
                1862,
                1913
            ],
            [
                1913,
                1942
            ],
            [
                1942,
                2010
            ],
            [
                2010,
                2036
            ],
            [
                2036,
                2129
            ],
            [
                2129,
                2147
            ],
            [
                2147,
                2180
            ],
            [
                2180,
                2205
            ],
            [
                2205,
                2306
            ],
            [
                2306,
                2381
            ],
            [
                2381,
                2662
            ],
            [
                2662,
                2760
            ],
            [
                2760,
                2848
            ],
            [
                2848,
                2929
            ],
            [
                2929,
                2954
            ],
            [
                2954,
                2990
            ],
            [
                2990,
                2996
            ],
            [
                2996,
                3023
            ],
            [
                3023,
                3046
            ],
            [
                3046,
                3132
            ],
            [
                3132,
                3192
            ],
            [
                3192,
                3222
            ],
            [
                3222,
                3246
            ],
            [
                3246,
                3299
            ],
            [
                3299,
                3320
            ],
            [
                3320,
                3337
            ],
            [
                3337,
                3382
            ],
            [
                3382,
                3401
            ],
            [
                3401,
                3481
            ],
            [
                3481,
                3527
            ],
            [
                3527,
                3611
            ],
            [
                3611,
                3617
            ],
            [
                3617,
                3636
            ],
            [
                3636,
                3669
            ],
            [
                3669,
                3694
            ],
            [
                3694,
                3710
            ],
            [
                3710,
                3724
            ],
            [
                3724,
                3761
            ],
            [
                3761,
                3782
            ],
            [
                3782,
                3822
            ],
            [
                3822,
                3844
            ],
            [
                3844,
                3895
            ],
            [
                3895,
                3952
            ],
            [
                3952,
                3993
            ],
            [
                3993,
                4151
            ],
            [
                4151,
                4181
            ],
            [
                4181,
                4212
            ],
            [
                4212,
                4260
            ],
            [
                4260,
                4325
            ],
            [
                4325,
                4392
            ],
            [
                4392,
                4456
            ],
            [
                4456,
                4510
            ],
            [
                4510,
                4531
            ],
            [
                4531,
                4546
            ],
            [
                4546,
                4628
            ],
            [
                4628,
                4688
            ],
            [
                4688,
                4748
            ],
            [
                4748,
                4782
            ],
            [
                4782,
                4811
            ],
            [
                4811,
                4843
            ],
            [
                4843,
                4897
            ],
            [
                4897,
                4958
            ],
            [
                4958,
                5134
            ],
            [
                5134,
                5196
            ],
            [
                5196,
                5297
            ],
            [
                5297,
                5412
            ],
            [
                5412,
                5596
            ],
            [
                5596,
                5717
            ],
            [
                5717,
                5895
            ],
            [
                5895,
                6001
            ],
            [
                6001,
                6176
            ],
            [
                6176,
                6291
            ],
            [
                6291,
                6301
            ],
            [
                6301,
                6339
            ],
            [
                6339,
                6368
            ],
            [
                6368,
                6475
            ],
            [
                6475,
                6612
            ],
            [
                6612,
                6690
            ],
            [
                6690,
                6702
            ],
            [
                6702,
                6727
            ],
            [
                6727,
                6821
            ],
            [
                6821,
                6869
            ],
            [
                6869,
                6925
            ],
            [
                6925,
                6967
            ],
            [
                6967,
                6998
            ],
            [
                6998,
                7013
            ],
            [
                7013,
                7073
            ],
            [
                7073,
                7110
            ],
            [
                7110,
                7146
            ],
            [
                7146,
                7275
            ],
            [
                7275,
                7306
            ],
            [
                7306,
                7333
            ],
            [
                7333,
                7358
            ],
            [
                7358,
                7427
            ],
            [
                7427,
                7447
            ],
            [
                7447,
                7525
            ],
            [
                7525,
                7555
            ],
            [
                7555,
                7657
            ],
            [
                7657,
                7705
            ],
            [
                7705,
                7801
            ],
            [
                7801,
                7879
            ],
            [
                7879,
                7993
            ],
            [
                7993,
                8031
            ],
            [
                8031,
                8068
            ],
            [
                8068,
                8161
            ],
            [
                8161,
                8203
            ],
            [
                8203,
                8217
            ],
            [
                8217,
                8306
            ],
            [
                8306,
                8344
            ],
            [
                8344,
                8360
            ],
            [
                8360,
                8437
            ],
            [
                8437,
                8442
            ],
            [
                8442,
                8478
            ],
            [
                8478,
                8495
            ],
            [
                8495,
                8571
            ],
            [
                8571,
                8640
            ],
            [
                8640,
                8719
            ],
            [
                8719,
                8760
            ],
            [
                8760,
                8782
            ],
            [
                8782,
                8815
            ],
            [
                8815,
                8854
            ],
            [
                8854,
                8887
            ],
            [
                8887,
                8899
            ],
            [
                8899,
                8930
            ],
            [
                8930,
                8954
            ],
            [
                8954,
                8999
            ],
            [
                8999,
                9005
            ],
            [
                9005,
                9062
            ],
            [
                9062,
                9077
            ],
            [
                9077,
                9247
            ],
            [
                9247,
                9285
            ],
            [
                9285,
                9292
            ],
            [
                9292,
                9316
            ],
            [
                9316,
                9336
            ],
            [
                9336,
                9361
            ],
            [
                9361,
                9367
            ],
            [
                9367,
                9461
            ],
            [
                9461,
                9517
            ],
            [
                9517,
                9549
            ],
            [
                9549,
                9556
            ],
            [
                9556,
                9574
            ],
            [
                9574,
                9580
            ],
            [
                9580,
                9612
            ],
            [
                9612,
                9761
            ],
            [
                9761,
                9911
            ],
            [
                9911,
                9965
            ],
            [
                9965,
                9990
            ],
            [
                9990,
                10274
            ],
            [
                10274,
                10342
            ],
            [
                10342,
                10515
            ],
            [
                10515,
                10577
            ],
            [
                10577,
                10655
            ],
            [
                10655,
                10721
            ],
            [
                10721,
                10737
            ],
            [
                10737,
                10741
            ],
            [
                10741,
                10832
            ],
            [
                10832,
                10997
            ],
            [
                10997,
                11069
            ],
            [
                11069,
                11089
            ],
            [
                11089,
                11227
            ],
            [
                11227,
                11331
            ],
            [
                11331,
                11372
            ],
            [
                11372,
                11476
            ],
            [
                11476,
                11547
            ],
            [
                11547,
                11638
            ],
            [
                11638,
                11737
            ],
            [
                11737,
                11774
            ],
            [
                11774,
                11804
            ],
            [
                11804,
                11861
            ],
            [
                11861,
                11920
            ],
            [
                11920,
                11972
            ],
            [
                11972,
                12009
            ],
            [
                12009,
                12098
            ],
            [
                12098,
                12250
            ],
            [
                12250,
                12277
            ],
            [
                12277,
                12302
            ],
            [
                12302,
                12487
            ],
            [
                12487,
                12587
            ],
            [
                12587,
                12621
            ],
            [
                12621,
                12626
            ],
            [
                12626,
                12654
            ],
            [
                12654,
                12788
            ],
            [
                12788,
                12817
            ],
            [
                12817,
                12869
            ],
            [
                12869,
                13013
            ],
            [
                13013,
                13097
            ],
            [
                13097,
                13190
            ],
            [
                13190,
                13248
            ],
            [
                13248,
                13289
            ],
            [
                13289,
                13355
            ],
            [
                13355,
                13419
            ],
            [
                13419,
                13427
            ],
            [
                13427,
                13452
            ],
            [
                13452,
                13487
            ],
            [
                13487,
                13628
            ],
            [
                13628,
                13685
            ],
            [
                13685,
                13734
            ],
            [
                13734,
                13793
            ],
            [
                13793,
                13825
            ],
            [
                13825,
                13900
            ],
            [
                13900,
                13995
            ],
            [
                13995,
                14061
            ],
            [
                14061,
                14231
            ],
            [
                14231,
                14263
            ],
            [
                14263,
                14332
            ],
            [
                14332,
                14402
            ],
            [
                14402,
                14471
            ],
            [
                14471,
                14478
            ],
            [
                14478,
                14524
            ],
            [
                14524,
                14663
            ],
            [
                14663,
                14765
            ],
            [
                14765,
                14924
            ],
            [
                14924,
                14943
            ],
            [
                14943,
                14975
            ],
            [
                14975,
                14993
            ],
            [
                14993,
                15003
            ],
            [
                15003,
                15129
            ],
            [
                15129,
                15141
            ],
            [
                15141,
                15215
            ],
            [
                15215,
                15329
            ],
            [
                15329,
                15353
            ],
            [
                15353,
                15366
            ],
            [
                15366,
                15395
            ],
            [
                15395,
                15500
            ],
            [
                15500,
                15564
            ],
            [
                15564,
                15570
            ],
            [
                15570,
                15579
            ],
            [
                15579,
                15657
            ],
            [
                15657,
                15830
            ],
            [
                15830,
                15848
            ],
            [
                15848,
                15893
            ],
            [
                15893,
                15996
            ],
            [
                15996,
                16141
            ],
            [
                16141,
                16163
            ],
            [
                16163,
                16189
            ],
            [
                16189,
                16237
            ],
            [
                16237,
                16306
            ],
            [
                16306,
                16460
            ],
            [
                16460,
                16559
            ],
            [
                16559,
                16573
            ],
            [
                16573,
                16587
            ],
            [
                16587,
                16605
            ],
            [
                16605,
                16662
            ],
            [
                16662,
                16813
            ],
            [
                16813,
                16859
            ],
            [
                16859,
                16896
            ],
            [
                16896,
                16965
            ],
            [
                16965,
                17053
            ],
            [
                17053,
                17086
            ],
            [
                17086,
                17103
            ],
            [
                17103,
                17149
            ],
            [
                17149,
                17195
            ],
            [
                17195,
                17340
            ],
            [
                17340,
                17393
            ],
            [
                17393,
                17513
            ],
            [
                17513,
                17637
            ],
            [
                17637,
                17743
            ],
            [
                17743,
                17864
            ],
            [
                17864,
                17912
            ],
            [
                17912,
                18073
            ],
            [
                18073,
                18275
            ],
            [
                18275,
                18352
            ]
        ],
        "overlap_chars": [
            [
                0,
                69
            ],
            [
                77,
                80
            ],
            [
                81,
                85
            ],
            [
                90,
                95
            ],
            [
                96,
                103
            ],
            [
                103,
                104
            ],
            [
                105,
                110
            ],
            [
                111,
                118
            ],
            [
                126,
                141
            ],
            [
                148,
                152
            ],
            [
                153,
                165
            ],
            [
                166,
                209
            ],
            [
                209,
                265
            ],
            [
                266,
                275
            ],
            [
                285,
                331
            ],
            [
                331,
                333
            ],
            [
                334,
                375
            ],
            [
                375,
                427
            ],
            [
                430,
                451
            ],
            [
                456,
                459
            ],
            [
                459,
                461
            ],
            [
                461,
                462
            ],
            [
                473,
                481
            ],
            [
                482,
                558
            ],
            [
                558,
                578
            ],
            [
                578,
                579
            ],
            [
                580,
                587
            ],
            [
                588,
                598
            ],
            [
                599,
                602
            ],
            [
                603,
                612
            ],
            [
                613,
                615
            ],
            [
                616,
                619
            ],
            [
                627,
                714
            ],
            [
                719,
                722
            ],
            [
                725,
                799
            ],
            [
                806,
                854
            ],
            [
                854,
                856
            ],
            [
                856,
                911
            ],
            [
                911,
                1075
            ],
            [
                1076,
                1127
            ],
            [
                1128,
                1157
            ],
            [
                1158,
                1199
            ],
            [
                1199,
                1258
            ],
            [
                1258,
                1305
            ],
            [
                1305,
                1307
            ],
            [
                1307,
                1337
            ],
            [
                1337,
                1348
            ],
            [
                1348,
                1380
            ],
            [
                1380,
                1429
            ],
            [
                1429,
                1431
            ],
            [
                1431,
                1474
            ],
            [
                1474,
                1489
            ],
            [
                1490,
                1504
            ],
            [
                1504,
                1520
            ],
            [
                1520,
                1530
            ],
            [
                1530,
                1531
            ],
            [
                1531,
                1694
            ],
            [
                1694,
                1739
            ],
            [
                1739,
                1750
            ],
            [
                1750,
                1764
            ],
            [
                1764,
                1766
            ],
            [
                1766,
                1787
            ],
            [
                1790,
                1795
            ],
            [
                1795,
                1808
            ],
            [
                1813,
                1862
            ],
            [
                1862,
                1913
            ],
            [
                1913,
                1942
            ],
            [
                1942,
                1960
            ],
            [
                1960,
                1961
            ],
            [
                1962,
                2010
            ],
            [
                2010,
                2020
            ],
            [
                2021,
                2036
            ],
            [
                2036,
                2053
            ],
            [
                2053,
                2129
            ],
            [
                2129,
                2147
            ],
            [
                2147,
                2153
            ],
            [
                2154,
                2180
            ],
            [
                2182,
                2184
            ],
            [
                2185,
                2188
            ],
            [
                2189,
                2193
            ],
            [
                2194,
                2202
            ],
            [
                2202,
                2205
            ],
            [
                2205,
                2206
            ],
            [
                2218,
                2306
            ],
            [
                2306,
                2321
            ],
            [
                2327,
                2329
            ],
            [
                2329,
                2381
            ],
            [
                2381,
                2444
            ],
            [
                2445,
                2475
            ],
            [
                2476,
                2483
            ],
            [
                2484,
                2487
            ],
            [
                2488,
                2491
            ],
            [
                2492,
                2498
            ],
            [
                2499,
                2547
            ],
            [
                2547,
                2548
            ],
            [
                2549,
                2660
            ],
            [
                2660,
                2662
            ],
            [
                2662,
                2710
            ],
            [
                2711,
                2720
            ],
            [
                2722,
                2760
            ],
            [
                2760,
                2772
            ],
            [
                2773,
                2775
            ],
            [
                2779,
                2793
            ],
            [
                2793,
                2798
            ],
            [
                2801,
                2848
            ],
            [
                2848,
                2869
            ],
            [
                2870,
                2879
            ],
            [
                2880,
                2903
            ],
            [
                2903,
                2929
            ],
            [
                2929,
                2954
            ],
            [
                2954,
                2988
            ],
            [
                2988,
                2990
            ],
            [
                2990,
                2991
            ],
            [
                2994,
                2996
            ],
            [
                2996,
                3023
            ],
            [
                3023,
                3046
            ],
            [
                3046,
                3132
            ],
            [
                3132,
                3189
            ],
            [
                3192,
                3222
            ],
            [
                3222,
                3244
            ],
            [
                3244,
                3246
            ],
            [
                3246,
                3265
            ],
            [
                3277,
                3297
            ],
            [
                3297,
                3299
            ],
            [
                3299,
                3320
            ],
            [
                3320,
                3337
            ],
            [
                3337,
                3382
            ],
            [
                3382,
                3401
            ],
            [
                3401,
                3481
            ],
            [
                3481,
                3498
            ],
            [
                3498,
                3525
            ],
            [
                3525,
                3527
            ],
            [
                3527,
                3534
            ],
            [
                3535,
                3611
            ],
            [
                3611,
                3617
            ],
            [
                3617,
                3636
            ],
            [
                3636,
                3669
            ],
            [
                3669,
                3694
            ],
            [
                3694,
                3710
            ],
            [
                3710,
                3724
            ],
            [
                3724,
                3761
            ],
            [
                3761,
                3782
            ],
            [
                3782,
                3822
            ],
            [
                3822,
                3842
            ],
            [
                3842,
                3844
            ],
            [
                3844,
                3895
            ],
            [
                3895,
                3952
            ],
            [
                3952,
                3988
            ],
            [
                3991,
                3993
            ],
            [
                3993,
                4036
            ],
            [
                4036,
                4151
            ],
            [
                4151,
                4181
            ],
            [
                4181,
                4212
            ],
            [
                4212,
                4239
            ],
            [
                4240,
                4251
            ],
            [
                4260,
                4286
            ],
            [
                4291,
                4323
            ],
            [
                4323,
                4325
            ],
            [
                4325,
                4392
            ],
            [
                4392,
                4430
            ],
            [
                4430,
                4431
            ],
            [
                4432,
                4442
            ],
            [
                4452,
                4454
            ],
            [
                4454,
                4456
            ],
            [
                4456,
                4468
            ],
            [
                4469,
                4474
            ],
            [
                4475,
                4483
            ],
            [
                4483,
                4484
            ],
            [
                4485,
                4508
            ],
            [
                4508,
                4509
            ],
            [
                4510,
                4531
            ],
            [
                4531,
                4546
            ],
            [
                4546,
                4628
            ],
            [
                4628,
                4688
            ],
            [
                4688,
                4717
            ],
            [
                4718,
                4748
            ],
            [
                4748,
                4782
            ],
            [
                4782,
                4811
            ],
            [
                4811,
                4843
            ],
            [
                4843,
                4897
            ],
            [
                4897,
                4957
            ],
            [
                4958,
                5017
            ],
            [
                5018,
                5019
            ],
            [
                5020,
                5103
            ],
            [
                5104,
                5107
            ],
            [
                5108,
                5109
            ],
            [
                5121,
                5132
            ],
            [
                5134,
                5146
            ],
            [
                5147,
                5163
            ],
            [
                5164,
                5165
            ],
            [
                5166,
                5196
            ],
            [
                5196,
                5291
            ],
            [
                5292,
                5297
            ],
            [
                5297,
                5321
            ],
            [
                5322,
                5356
            ],
            [
                5357,
                5370
            ],
            [
                5371,
                5384
            ],
            [
                5385,
                5410
            ],
            [
                5410,
                5412
            ],
            [
                5412,
                5415
            ],
            [
                5423,
                5442
            ],
            [
                5453,
                5498
            ],
            [
                5499,
                5506
            ],
            [
                5511,
                5512
            ],
            [
                5513,
                5595
            ],
            [
                5596,
                5608
            ],
            [
                5616,
                5646
            ],
            [
                5655,
                5672
            ],
            [
                5672,
                5673
            ],
            [
                5674,
                5677
            ],
            [
                5677,
                5694
            ],
            [
                5695,
                5698
            ],
            [
                5699,
                5700
            ],
            [
                5701,
                5715
            ],
            [
                5715,
                5717
            ],
            [
                5717,
                5767
            ],
            [
                5767,
                5895
            ],
            [
                5895,
                5897
            ],
            [
                5922,
                5924
            ],
            [
                5925,
                5926
            ],
            [
                5927,
                5934
            ],
            [
                5946,
                5956
            ],
            [
                5957,
                5968
            ],
            [
                5968,
                5969
            ],
            [
                5970,
                5999
            ],
            [
                5999,
                6001
            ],
            [
                6001,
                6176
            ],
            [
                6176,
                6179
            ],
            [
                6180,
                6188
            ],
            [
                6189,
                6195
            ],
            [
                6196,
                6199
            ],
            [
                6200,
                6204
            ],
            [
                6205,
                6237
            ],
            [
                6238,
                6252
            ],
            [
                6253,
                6291
            ],
            [
                6291,
                6301
            ],
            [
                6301,
                6339
            ],
            [
                6339,
                6368
            ],
            [
                6368,
                6405
            ],
            [
                6406,
                6409
            ],
            [
                6418,
                6473
            ],
            [
                6473,
                6475
            ],
            [
                6475,
                6488
            ],
            [
                6489,
                6569
            ],
            [
                6569,
                6577
            ],
            [
                6578,
                6612
            ],
            [
                6612,
                6633
            ],
            [
                6634,
                6672
            ],
            [
                6673,
                6690
            ],
            [
                6690,
                6702
            ],
            [
                6702,
                6724
            ],
            [
                6727,
                6821
            ],
            [
                6821,
                6867
            ],
            [
                6867,
                6869
            ],
            [
                6869,
                6925
            ],
            [
                6925,
                6967
            ],
            [
                6967,
                6998
            ],
            [
                6998,
                7001
            ],
            [
                7002,
                7013
            ],
            [
                7013,
                7031
            ],
            [
                7032,
                7071
            ],
            [
                7073,
                7092
            ],
            [
                7095,
                7103
            ],
            [
                7106,
                7110
            ],
            [
                7110,
                7146
            ],
            [
                7146,
                7275
            ],
            [
                7275,
                7295
            ],
            [
                7303,
                7306
            ],
            [
                7306,
                7333
            ],
            [
                7333,
                7345
            ],
            [
                7346,
                7358
            ],
            [
                7358,
                7420
            ],
            [
                7423,
                7427
            ],
            [
                7427,
                7447
            ],
            [
                7447,
                7514
            ],
            [
                7515,
                7522
            ],
            [
                7525,
                7555
            ],
            [
                7555,
                7657
            ],
            [
                7657,
                7675
            ],
            [
                7676,
                7688
            ],
            [
                7699,
                7703
            ],
            [
                7703,
                7704
            ],
            [
                7705,
                7708
            ],
            [
                7709,
                7712
            ],
            [
                7712,
                7713
            ],
            [
                7724,
                7788
            ],
            [
                7789,
                7799
            ],
            [
                7801,
                7879
            ],
            [
                7879,
                7929
            ],
            [
                7930,
                7931
            ],
            [
                7931,
                7935
            ],
            [
                7936,
                7950
            ],
            [
                7951,
                7993
            ],
            [
                7993,
                8021
            ],
            [
                8022,
                8031
            ],
            [
                8031,
                8068
            ],
            [
                8068,
                8122
            ],
            [
                8122,
                8147
            ],
            [
                8148,
                8150
            ],
            [
                8151,
                8159
            ],
            [
                8159,
                8161
            ],
            [
                8161,
                8167
            ],
            [
                8172,
                8184
            ],
            [
                8185,
                8203
            ],
            [
                8203,
                8217
            ],
            [
                8217,
                8306
            ],
            [
                8306,
                8344
            ],
            [
                8344,
                8360
            ],
            [
                8360,
                8388
            ],
            [
                8391,
                8399
            ],
            [
                8403,
                8437
            ],
            [
                8437,
                8442
            ],
            [
                8442,
                8466
            ],
            [
                8466,
                8478
            ],
            [
                8478,
                8495
            ],
            [
                8495,
                8569
            ],
            [
                8569,
                8571
            ],
            [
                8571,
                8592
            ],
            [
                8600,
                8640
            ],
            [
                8640,
                8705
            ],
            [
                8709,
                8717
            ],
            [
                8717,
                8719
            ],
            [
                8719,
                8758
            ],
            [
                8758,
                8759
            ],
            [
                8760,
                8782
            ],
            [
                8782,
                8815
            ],
            [
                8815,
                8854
            ],
            [
                8859,
                8887
            ],
            [
                8887,
                8899
            ],
            [
                8899,
                8930
            ],
            [
                8930,
                8954
            ],
            [
                8954,
                8999
            ],
            [
                8999,
                9005
            ],
            [
                9005,
                9060
            ],
            [
                9060,
                9062
            ],
            [
                9062,
                9077
            ],
            [
                9077,
                9079
            ],
            [
                9080,
                9190
            ],
            [
                9195,
                9206
            ],
            [
                9207,
                9247
            ],
            [
                9247,
                9285
            ],
            [
                9285,
                9292
            ],
            [
                9292,
                9313
            ],
            [
                9316,
                9336
            ],
            [
                9336,
                9359
            ],
            [
                9359,
                9361
            ],
            [
                9361,
                9367
            ],
            [
                9367,
                9461
            ],
            [
                9461,
                9503
            ],
            [
                9504,
                9517
            ],
            [
                9517,
                9547
            ],
            [
                9547,
                9549
            ],
            [
                9549,
                9556
            ],
            [
                9556,
                9572
            ],
            [
                9572,
                9574
            ],
            [
                9574,
                9580
            ],
            [
                9580,
                9612
            ],
            [
                9612,
                9625
            ],
            [
                9626,
                9673
            ],
            [
                9674,
                9688
            ],
            [
                9689,
                9761
            ],
            [
                9761,
                9778
            ],
            [
                9778,
                9911
            ],
            [
                9911,
                9950
            ],
            [
                9951,
                9953
            ],
            [
                9954,
                9965
            ],
            [
                9965,
                9990
            ],
            [
                9990,
                10033
            ],
            [
                10034,
                10055
            ],
            [
                10058,
                10101
            ],
            [
                10102,
                10122
            ],
            [
                10123,
                10138
            ],
            [
                10141,
                10151
            ],
            [
                10152,
                10160
            ],
            [
                10160,
                10188
            ],
            [
                10189,
                10210
            ],
            [
                10210,
                10274
            ],
            [
                10274,
                10339
            ],
            [
                10339,
                10342
            ],
            [
                10342,
                10377
            ],
            [
                10385,
                10392
            ],
            [
                10392,
                10393
            ],
            [
                10394,
                10462
            ],
            [
                10463,
                10515
            ],
            [
                10515,
                10575
            ],
            [
                10575,
                10577
            ],
            [
                10577,
                10586
            ],
            [
                10600,
                10607
            ],
            [
                10617,
                10655
            ],
            [
                10655,
                10694
            ],
            [
                10695,
                10698
            ],
            [
                10699,
                10707
            ],
            [
                10708,
                10715
            ],
            [
                10716,
                10719
            ],
            [
                10719,
                10721
            ],
            [
                10721,
                10735
            ],
            [
                10735,
                10737
            ],
            [
                10737,
                10741
            ],
            [
                10741,
                10832
            ],
            [
                10832,
                10890
            ],
            [
                10891,
                10941
            ],
            [
                10944,
                10949
            ],
            [
                10957,
                10958
            ],
            [
                10959,
                10961
            ],
            [
                10962,
                10965
            ],
            [
                10966,
                10994
            ],
            [
                10994,
                10997
            ],
            [
                10997,
                11069
            ],
            [
                11069,
                11070
            ],
            [
                11071,
                11076
            ],
            [
                11081,
                11087
            ],
            [
                11087,
                11089
            ],
            [
                11089,
                11104
            ],
            [
                11105,
                11108
            ],
            [
                11118,
                11124
            ],
            [
                11136,
                11139
            ],
            [
                11140,
                11180
            ],
            [
                11181,
                11227
            ],
            [
                11227,
                11266
            ],
            [
                11267,
                11331
            ],
            [
                11331,
                11372
            ],
            [
                11372,
                11382
            ],
            [
                11386,
                11419
            ],
            [
                11420,
                11476
            ],
            [
                11476,
                11488
            ],
            [
                11489,
                11523
            ],
            [
                11524,
                11547
            ],
            [
                11547,
                11556
            ],
            [
                11556,
                11557
            ],
            [
                11558,
                11583
            ],
            [
                11584,
                11594
            ],
            [
                11595,
                11617
            ],
            [
                11630,
                11638
            ],
            [
                11638,
                11692
            ],
            [
                11692,
                11737
            ],
            [
                11737,
                11774
            ],
            [
                11774,
                11804
            ],
            [
                11804,
                11861
            ],
            [
                11861,
                11896
            ],
            [
                11897,
                11920
            ],
            [
                11920,
                11972
            ],
            [
                11972,
                12009
            ],
            [
                12009,
                12098
            ],
            [
                12098,
                12250
            ],
            [
                12250,
                12277
            ],
            [
                12277,
                12299
            ],
            [
                12302,
                12342
            ],
            [
                12343,
                12426
            ],
            [
                12427,
                12437
            ],
            [
                12438,
                12453
            ],
            [
                12454,
                12485
            ],
            [
                12485,
                12487
            ],
            [
                12487,
                12542
            ],
            [
                12543,
                12587
            ],
            [
                12587,
                12621
            ],
            [
                12624,
                12626
            ],
            [
                12626,
                12654
            ],
            [
                12654,
                12665
            ],
            [
                12666,
                12788
            ],
            [
                12793,
                12817
            ],
            [
                12817,
                12820
            ],
            [
                12834,
                12867
            ],
            [
                12869,
                12876
            ],
            [
                12876,
                12877
            ],
            [
                12878,
                12879
            ],
            [
                12880,
                12921
            ],
            [
                12922,
                13013
            ],
            [
                13027,
                13035
            ],
            [
                13040,
                13046
            ],
            [
                13052,
                13062
            ],
            [
                13063,
                13083
            ],
            [
                13083,
                13084
            ],
            [
                13085,
                13095
            ],
            [
                13095,
                13096
            ],
            [
                13097,
                13111
            ],
            [
                13112,
                13115
            ],
            [
                13122,
                13167
            ],
            [
                13168,
                13172
            ],
            [
                13181,
                13188
            ],
            [
                13188,
                13190
            ],
            [
                13190,
                13201
            ],
            [
                13208,
                13227
            ],
            [
                13236,
                13248
            ],
            [
                13248,
                13289
            ],
            [
                13289,
                13355
            ],
            [
                13355,
                13373
            ],
            [
                13373,
                13374
            ],
            [
                13379,
                13380
            ],
            [
                13381,
                13393
            ],
            [
                13399,
                13419
            ],
            [
                13419,
                13427
            ],
            [
                13427,
                13443
            ],
            [
                13444,
                13452
            ],
            [
                13452,
                13487
            ],
            [
                13487,
                13544
            ],
            [
                13544,
                13545
            ],
            [
                13546,
                13628
            ],
            [
                13628,
                13685
            ],
            [
                13689,
                13691
            ],
            [
                13692,
                13699
            ],
            [
                13700,
                13734
            ],
            [
                13734,
                13764
            ],
            [
                13778,
                13793
            ],
            [
                13793,
                13822
            ],
            [
                13825,
                13848
            ],
            [
                13858,
                13898
            ],
            [
                13898,
                13900
            ],
            [
                13900,
                13949
            ],
            [
                13949,
                13995
            ],
            [
                13995,
                14014
            ],
            [
                14014,
                14061
            ],
            [
                14061,
                14231
            ],
            [
                14231,
                14239
            ],
            [
                14248,
                14260
            ],
            [
                14260,
                14263
            ],
            [
                14263,
                14266
            ],
            [
                14275,
                14298
            ],
            [
                14299,
                14330
            ],
            [
                14330,
                14332
            ],
            [
                14332,
                14360
            ],
            [
                14361,
                14402
            ],
            [
                14402,
                14471
            ],
            [
                14471,
                14477
            ],
            [
                14478,
                14481
            ],
            [
                14482,
                14496
            ],
            [
                14502,
                14505
            ],
            [
                14513,
                14522
            ],
            [
                14522,
                14524
            ],
            [
                14524,
                14563
            ],
            [
                14563,
                14663
            ],
            [
                14663,
                14665
            ],
            [
                14666,
                14686
            ],
            [
                14686,
                14714
            ],
            [
                14715,
                14722
            ],
            [
                14723,
                14758
            ],
            [
                14759,
                14765
            ],
            [
                14765,
                14768
            ],
            [
                14776,
                14779
            ],
            [
                14784,
                14788
            ],
            [
                14793,
                14794
            ],
            [
                14795,
                14827
            ],
            [
                14833,
                14875
            ],
            [
                14875,
                14876
            ],
            [
                14877,
                14902
            ],
            [
                14903,
                14923
            ],
            [
                14924,
                14943
            ],
            [
                14943,
                14975
            ],
            [
                14975,
                14993
            ],
            [
                14993,
                14998
            ],
            [
                14999,
                15003
            ],
            [
                15003,
                15076
            ],
            [
                15083,
                15102
            ],
            [
                15104,
                15129
            ],
            [
                15129,
                15141
            ],
            [
                15141,
                15143
            ],
            [
                15144,
                15163
            ],
            [
                15170,
                15195
            ],
            [
                15196,
                15215
            ],
            [
                15215,
                15225
            ],
            [
                15235,
                15254
            ],
            [
                15255,
                15329
            ],
            [
                15329,
                15353
            ],
            [
                15353,
                15366
            ],
            [
                15366,
                15395
            ],
            [
                15395,
                15414
            ],
            [
                15414,
                15455
            ],
            [
                15455,
                15500
            ],
            [
                15500,
                15564
            ],
            [
                15564,
                15570
            ],
            [
                15570,
                15574
            ],
            [
                15577,
                15579
            ],
            [
                15579,
                15581
            ],
            [
                15591,
                15657
            ],
            [
                15657,
                15682
            ],
            [
                15683,
                15830
            ],
            [
                15830,
                15848
            ],
            [
                15848,
                15859
            ],
            [
                15860,
                15893
            ],
            [
                15901,
                15923
            ],
            [
                15923,
                15924
            ],
            [
                15925,
                15926
            ],
            [
                15934,
                15994
            ],
            [
                15994,
                15996
            ],
            [
                15996,
                16005
            ],
            [
                16010,
                16139
            ],
            [
                16139,
                16141
            ],
            [
                16141,
                16160
            ],
            [
                16160,
                16163
            ],
            [
                16163,
                16189
            ],
            [
                16189,
                16192
            ],
            [
                16192,
                16219
            ],
            [
                16219,
                16220
            ],
            [
                16221,
                16237
            ],
            [
                16237,
                16306
            ],
            [
                16306,
                16326
            ],
            [
                16327,
                16330
            ],
            [
                16331,
                16333
            ],
            [
                16334,
                16343
            ],
            [
                16344,
                16353
            ],
            [
                16354,
                16361
            ],
            [
                16364,
                16376
            ],
            [
                16380,
                16383
            ],
            [
                16386,
                16458
            ],
            [
                16458,
                16460
            ],
            [
                16460,
                16481
            ],
            [
                16482,
                16502
            ],
            [
                16503,
                16532
            ],
            [
                16542,
                16547
            ],
            [
                16554,
                16559
            ],
            [
                16559,
                16573
            ],
            [
                16573,
                16587
            ],
            [
                16587,
                16605
            ],
            [
                16605,
                16662
            ],
            [
                16662,
                16698
            ],
            [
                16699,
                16813
            ],
            [
                16813,
                16835
            ],
            [
                16838,
                16859
            ],
            [
                16859,
                16896
            ],
            [
                16896,
                16965
            ],
            [
                16965,
                16972
            ],
            [
                16973,
                17053
            ],
            [
                17053,
                17086
            ],
            [
                17086,
                17103
            ],
            [
                17103,
                17120
            ],
            [
                17121,
                17149
            ],
            [
                17149,
                17180
            ],
            [
                17185,
                17193
            ],
            [
                17193,
                17195
            ],
            [
                17195,
                17253
            ],
            [
                17254,
                17340
            ],
            [
                17340,
                17352
            ],
            [
                17357,
                17360
            ],
            [
                17366,
                17368
            ],
            [
                17374,
                17393
            ],
            [
                17393,
                17489
            ],
            [
                17496,
                17511
            ],
            [
                17511,
                17513
            ],
            [
                17513,
                17539
            ],
            [
                17539,
                17637
            ],
            [
                17637,
                17724
            ],
            [
                17725,
                17743
            ],
            [
                17743,
                17763
            ],
            [
                17764,
                17864
            ],
            [
                17864,
                17910
            ],
            [
                17910,
                17912
            ],
            [
                17912,
                18039
            ],
            [
                18039,
                18050
            ],
            [
                18051,
                18071
            ],
            [
                18071,
                18072
            ],
            [
                18073,
                18146
            ],
            [
                18154,
                18273
            ],
            [
                18275,
                18326
            ],
            [
                18334,
                18346
            ]
        ],
        "row_chars": [
            [
                0,
                209
            ],
            [
                209,
                331
            ],
            [
                331,
                375
            ],
            [
                375,
                430
            ],
            [
                430,
                430
            ],
            [
                430,
                430
            ],
            [
                430,
                430
            ],
            [
                430,
                430
            ],
            [
                430,
                430
            ],
            [
                430,
                461
            ],
            [
                461,
                558
            ],
            [
                558,
                715
            ],
            [
                715,
                715
            ],
            [
                715,
                715
            ],
            [
                715,
                856
            ],
            [
                856,
                856
            ],
            [
                856,
                911
            ],
            [
                911,
                1076
            ],
            [
                1076,
                1076
            ],
            [
                1076,
                1199
            ],
            [
                1199,
                1258
            ],
            [
                1258,
                1307
            ],
            [
                1307,
                1337
            ],
            [
                1337,
                1348
            ],
            [
                1348,
                1380
            ],
            [
                1380,
                1431
            ],
            [
                1431,
                1474
            ],
            [
                1474,
                1504
            ],
            [
                1504,
                1520
            ],
            [
                1520,
                1530
            ],
            [
                1530,
                1694
            ],
            [
                1694,
                1739
            ],
            [
                1739,
                1750
            ],
            [
                1750,
                1766
            ],
            [
                1766,
                1790
            ],
            [
                1790,
                1795
            ],
            [
                1795,
                1862
            ],
            [
                1862,
                1913
            ],
            [
                1913,
                1913
            ],
            [
                1913,
                1942
            ],
            [
                1942,
                2010
            ],
            [
                2010,
                2036
            ],
            [
                2036,
                2129
            ],
            [
                2129,
                2147
            ],
            [
                2147,
                2180
            ],
            [
                2180,
                2205
            ],
            [
                2205,
                2306
            ],
            [
                2306,
                2381
            ],
            [
                2381,
                2662
            ],
            [
                2662,
                2760
            ],
            [
                2760,
                2848
            ],
            [
                2848,
                2929
            ],
            [
                2929,
                2954
            ],
            [
                2954,
                2990
            ],
            [
                2990,
                2996
            ],
            [
                2996,
                3023
            ],
            [
                3023,
                3046
            ],
            [
                3046,
                3046
            ],
            [
                3046,
                3132
            ],
            [
                3132,
                3192
            ],
            [
                3192,
                3192
            ],
            [
                3192,
                3222
            ],
            [
                3222,
                3246
            ],
            [
                3246,
                3299
            ],
            [
                3299,
                3320
            ],
            [
                3320,
                3337
            ],
            [
                3337,
                3382
            ],
            [
                3382,
                3401
            ],
            [
                3401,
                3481
            ],
            [
                3481,
                3527
            ],
            [
                3527,
                3611
            ],
            [
                3611,
                3617
            ],
            [
                3617,
                3636
            ],
            [
                3636,
                3669
            ],
            [
                3669,
                3694
            ],
            [
                3694,
                3710
            ],
            [
                3710,
                3724
            ],
            [
                3724,
                3761
            ],
            [
                3761,
                3782
            ],
            [
                3782,
                3822
            ],
            [
                3822,
                3844
            ],
            [
                3844,
                3895
            ],
            [
                3895,
                3895
            ],
            [
                3895,
                3952
            ],
            [
                3952,
                3993
            ],
            [
                3993,
                4151
            ],
            [
                4151,
                4181
            ],
            [
                4181,
                4212
            ],
            [
                4212,
                4260
            ],
            [
                4260,
                4260
            ],
            [
                4260,
                4325
            ],
            [
                4325,
                4392
            ],
            [
                4392,
                4456
            ],
            [
                4456,
                4456
            ],
            [
                4456,
                4531
            ],
            [
                4531,
                4546
            ],
            [
                4546,
                4628
            ],
            [
                4628,
                4688
            ],
            [
                4688,
                4748
            ],
            [
                4748,
                4782
            ],
            [
                4782,
                4811
            ],
            [
                4811,
                4843
            ],
            [
                4843,
                4897
            ],
            [
                4897,
                4958
            ],
            [
                4958,
                5196
            ],
            [
                5196,
                5196
            ],
            [
                5196,
                5297
            ],
            [
                5297,
                5412
            ],
            [
                5412,
                5596
            ],
            [
                5596,
                5596
            ],
            [
                5596,
                5717
            ],
            [
                5717,
                5895
            ],
            [
                5895,
                6001
            ],
            [
                6001,
                6001
            ],
            [
                6001,
                6176
            ],
            [
                6176,
                6291
            ],
            [
                6291,
                6301
            ],
            [
                6301,
                6339
            ],
            [
                6339,
                6368
            ],
            [
                6368,
                6475
            ],
            [
                6475,
                6475
            ],
            [
                6475,
                6612
            ],
            [
                6612,
                6690
            ],
            [
                6690,
                6702
            ],
            [
                6702,
                6727
            ],
            [
                6727,
                6727
            ],
            [
                6727,
                6727
            ],
            [
                6727,
                6821
            ],
            [
                6821,
                6869
            ],
            [
                6869,
                6925
            ],
            [
                6925,
                6967
            ],
            [
                6967,
                6998
            ],
            [
                6998,
                6998
            ],
            [
                6998,
                7013
            ],
            [
                7013,
                7110
            ],
            [
                7110,
                7110
            ],
            [
                7110,
                7146
            ],
            [
                7146,
                7275
            ],
            [
                7275,
                7306
            ],
            [
                7306,
                7333
            ],
            [
                7333,
                7358
            ],
            [
                7358,
                7427
            ],
            [
                7427,
                7447
            ],
            [
                7447,
                7525
            ],
            [
                7525,
                7525
            ],
            [
                7525,
                7555
            ],
            [
                7555,
                7657
            ],
            [
                7657,
                7657
            ],
            [
                7657,
                7705
            ],
            [
                7705,
                7879
            ],
            [
                7879,
                7993
            ],
            [
                7993,
                7993
            ],
            [
                7993,
                8031
            ],
            [
                8031,
                8068
            ],
            [
                8068,
                8161
            ],
            [
                8161,
                8203
            ],
            [
                8203,
                8217
            ],
            [
                8217,
                8306
            ],
            [
                8306,
                8344
            ],
            [
                8344,
                8344
            ],
            [
                8344,
                8344
            ],
            [
                8344,
                8360
            ],
            [
                8360,
                8437
            ],
            [
                8437,
                8442
            ],
            [
                8442,
                8478
            ],
            [
                8478,
                8495
            ],
            [
                8495,
                8571
            ],
            [
                8571,
                8640
            ],
            [
                8640,
                8640
            ],
            [
                8640,
                8640
            ],
            [
                8640,
                8640
            ],
            [
                8640,
                8719
            ],
            [
                8719,
                8782
            ],
            [
                8782,
                8815
            ],
            [
                8815,
                8854
            ],
            [
                8854,
                8854
            ],
            [
                8854,
                8887
            ],
            [
                8887,
                8899
            ],
            [
                8899,
                8930
            ],
            [
                8930,
                8954
            ],
            [
                8954,
                8999
            ],
            [
                8999,
                9005
            ],
            [
                9005,
                9062
            ],
            [
                9062,
                9077
            ],
            [
                9077,
                9247
            ],
            [
                9247,
                9285
            ],
            [
                9285,
                9292
            ],
            [
                9292,
                9316
            ],
            [
                9316,
                9336
            ],
            [
                9336,
                9361
            ],
            [
                9361,
                9367
            ],
            [
                9367,
                9461
            ],
            [
                9461,
                9517
            ],
            [
                9517,
                9549
            ],
            [
                9549,
                9556
            ],
            [
                9556,
                9574
            ],
            [
                9574,
                9580
            ],
            [
                9580,
                9580
            ],
            [
                9580,
                9612
            ],
            [
                9612,
                9761
            ],
            [
                9761,
                9911
            ],
            [
                9911,
                9965
            ],
            [
                9965,
                9990
            ],
            [
                9990,
                10274
            ],
            [
                10274,
                10342
            ],
            [
                10342,
                10515
            ],
            [
                10515,
                10577
            ],
            [
                10577,
                10655
            ],
            [
                10655,
                10721
            ],
            [
                10721,
                10737
            ],
            [
                10737,
                10741
            ],
            [
                10741,
                10832
            ],
            [
                10832,
                10997
            ],
            [
                10997,
                11069
            ],
            [
                11069,
                11089
            ],
            [
                11089,
                11227
            ],
            [
                11227,
                11331
            ],
            [
                11331,
                11331
            ],
            [
                11331,
                11331
            ],
            [
                11331,
                11372
            ],
            [
                11372,
                11372
            ],
            [
                11372,
                11476
            ],
            [
                11476,
                11547
            ],
            [
                11547,
                11638
            ],
            [
                11638,
                11737
            ],
            [
                11737,
                11774
            ],
            [
                11774,
                11774
            ],
            [
                11774,
                11774
            ],
            [
                11774,
                11774
            ],
            [
                11774,
                11774
            ],
            [
                11774,
                11804
            ],
            [
                11804,
                11861
            ],
            [
                11861,
                11920
            ],
            [
                11920,
                11972
            ],
            [
                11972,
                12009
            ],
            [
                12009,
                12098
            ],
            [
                12098,
                12250
            ],
            [
                12250,
                12277
            ],
            [
                12277,
                12277
            ],
            [
                12277,
                12302
            ],
            [
                12302,
                12302
            ],
            [
                12302,
                12487
            ],
            [
                12487,
                12587
            ],
            [
                12587,
                12621
            ],
            [
                12621,
                12626
            ],
            [
                12626,
                12654
            ],
            [
                12654,
                12788
            ],
            [
                12788,
                12788
            ],
            [
                12788,
                12817
            ],
            [
                12817,
                12869
            ],
            [
                12869,
                13013
            ],
            [
                13013,
                13097
            ],
            [
                13097,
                13097
            ],
            [
                13097,
                13190
            ],
            [
                13190,
                13248
            ],
            [
                13248,
                13289
            ],
            [
                13289,
                13289
            ],
            [
                13289,
                13355
            ],
            [
                13355,
                13419
            ],
            [
                13419,
                13427
            ],
            [
                13427,
                13452
            ],
            [
                13452,
                13487
            ],
            [
                13487,
                13628
            ],
            [
                13628,
                13685
            ],
            [
                13685,
                13734
            ],
            [
                13734,
                13793
            ],
            [
                13793,
                13825
            ],
            [
                13825,
                13825
            ],
            [
                13825,
                13825
            ],
            [
                13825,
                13900
            ],
            [
                13900,
                13995
            ],
            [
                13995,
                14061
            ],
            [
                14061,
                14231
            ],
            [
                14231,
                14263
            ],
            [
                14263,
                14263
            ],
            [
                14263,
                14332
            ],
            [
                14332,
                14402
            ],
            [
                14402,
                14471
            ],
            [
                14471,
                14471
            ],
            [
                14471,
                14478
            ],
            [
                14478,
                14478
            ],
            [
                14478,
                14524
            ],
            [
                14524,
                14663
            ],
            [
                14663,
                14765
            ],
            [
                14765,
                14924
            ],
            [
                14924,
                14924
            ],
            [
                14924,
                14943
            ],
            [
                14943,
                14975
            ],
            [
                14975,
                14993
            ],
            [
                14993,
                15003
            ],
            [
                15003,
                15129
            ],
            [
                15129,
                15141
            ],
            [
                15141,
                15215
            ],
            [
                15215,
                15329
            ],
            [
                15329,
                15353
            ],
            [
                15353,
                15366
            ],
            [
                15366,
                15395
            ],
            [
                15395,
                15500
            ],
            [
                15500,
                15564
            ],
            [
                15564,
                15570
            ],
            [
                15570,
                15579
            ],
            [
                15579,
                15657
            ],
            [
                15657,
                15830
            ],
            [
                15830,
                15848
            ],
            [
                15848,
                15893
            ],
            [
                15893,
                15996
            ],
            [
                15996,
                16141
            ],
            [
                16141,
                16163
            ],
            [
                16163,
                16189
            ],
            [
                16189,
                16237
            ],
            [
                16237,
                16306
            ],
            [
                16306,
                16460
            ],
            [
                16460,
                16559
            ],
            [
                16559,
                16573
            ],
            [
                16573,
                16587
            ],
            [
                16587,
                16605
            ],
            [
                16605,
                16662
            ],
            [
                16662,
                16813
            ],
            [
                16813,
                16813
            ],
            [
                16813,
                16859
            ],
            [
                16859,
                16896
            ],
            [
                16896,
                16965
            ],
            [
                16965,
                17053
            ],
            [
                17053,
                17086
            ],
            [
                17086,
                17103
            ],
            [
                17103,
                17149
            ],
            [
                17149,
                17195
            ],
            [
                17195,
                17340
            ],
            [
                17340,
                17393
            ],
            [
                17393,
                17513
            ],
            [
                17513,
                17637
            ],
            [
                17637,
                17743
            ],
            [
                17743,
                17864
            ],
            [
                17864,
                17912
            ],
            [
                17912,
                18352
            ]
        ]
    }
}