{
    "original": {
        "text": "But one other day had intervened when, early in the morning as we were going to breakfast, Mr. Woodcourt came in haste with the astounding news that a terrible murder had been committed for which Mr. George had been apprehended and was in custody. When he told us that a large reward was offered by Sir Leicester Dedlock for the murderer's apprehension, I did not in my first consternation understand why; but a few more words explained to me that the murdered person was Sir Leicester's lawyer, and immediately my mother's dread of him rushed into my remembrance.\nThis unforeseen and violent removal of one whom she had long watched and distrusted and who had long watched and distrusted her, one for whom she could have had few intervals of kindness, always dreading in him a dangerous and secret enemy, appeared so awful that my first thoughts were of her. How appalling to hear of such a death and be able to feel no pity! How dreadful to remember, perhaps, that she had sometimes even wished the old man away who was so swiftly hurried out of life!\nSuch crowding reflections, increasing the distress and fear I always felt when the name was mentioned, made me so agitated that I could scarcely hold my place at the table. I was quite unable to follow the conversation until I had had a little time to recover. But when I came to myself and saw how shocked my guardian was and found that they were earnestly speaking of the suspected man and recalling every favourable impression we had formed of him out of the good we had known of him, my interest and my fears were so strongly aroused in his behalf that I was quite set up again.\n\"Guardian, you don't think it possible that he is justly accused?\"\n\"My dear, I CAN'T think so. This man whom we have seen so open-hearted and compassionate, who with the might of a giant has the gentleness of a child, who looks as brave a fellow as ever lived and is so simple and quiet with it, this man justly accused of such a crime? I can't believe it. It's not that I don't or I won't. I can't!\"\n\"And I can't,\" said Mr. Woodcourt. \"Still, whatever we believe or know of him, we had better not forget that some appearances are against him. He bore an animosity towards the deceased gentleman. He has openly mentioned it in many places. He is said to have expressed himself violently towards him, and he certainly did about him, to my knowledge. He admits that he was alone on the scene of the murder within a few minutes of its commission. I sincerely believe him to be as innocent of any participation in it as I am, but these are all reasons for suspicion falling upon him.\"\n\"True,\" said my guardian. And he added, turning to me, \"It would be doing him a very bad service, my dear, to shut our eyes to the truth in any of these respects.\"\nI felt, of course, that we must admit, not only to ourselves but to others, the full force of the circumstances against him. Yet I knew withal (I could not help saying) that their weight would not induce us to desert him in his need.\n\"Heaven forbid!\" returned my guardian. \"We will stand by him, as he himself stood by the two poor creatures who are gone.\" He meant Mr. Gridley and the boy, to both of whom Mr. George had given shelter.\nMr. Woodcourt then told us that the trooper's man had been with him before day, after wandering about the streets all night like a distracted creature. That one of the trooper's first anxieties was that we should not suppose him guilty. That he had charged his messenger to represent his perfect innocence with every solemn assurance he could send us. That Mr. Woodcourt had only quieted the man by undertaking to come to our house very early in the morning with these representations. He added that he was now upon his way to see the prisoner himself.\nMy guardian said directly he would go too. Now, besides that I liked the retired soldier very much and that he liked me, I had that secret interest in what had happened which was only known to my guardian. I felt as if it came close and near to me. It seemed to become personally important to myself that the truth should be discovered and that no innocent people should be suspected, for suspicion, once run wild, might run wilder.\nIn a word, I felt as if it were my duty and obligation to go with them. My guardian did not seek to dissuade me, and I went.\nIt was a large prison with many courts and passages so like one another and so uniformly paved that I seemed to gain a new comprehension, as I passed along, of the fondness that solitary prisoners, shut up among the same staring walls from year to year, have had--as I have read--for a weed or a stray blade of grass. In an arched room by himself, like a cellar upstairs, with walls so glaringly white that they made the massive iron window-bars and iron-bound door even more profoundly black than they were, we found the trooper standing in a corner. He had been sitting on a bench there and had risen when he heard the locks and bolts turn.\nWhen he saw us, he came forward a step with his usual heavy tread, and there stopped and made a slight bow. But as I still advanced, putting out my hand to him, he understood us in a moment.\n\"This is a load off my mind, I do assure you, miss and gentlemen,\" said he, saluting us with great heartiness and drawing a long breath. \"And now I don't so much care how it ends.\"\nHe scarcely seemed to be the prisoner. What with his coolness and his soldierly bearing, he looked far more like the prison guard.\n\"This is even a rougher place than my gallery to receive a lady in,\" said Mr. George, \"but I know Miss Summerson will make the best of it.\" As he handed me to the bench on which he had been sitting, I sat down, which seemed to give him great satisfaction.\n\"I thank you, miss,\" said he.\n\"Now, George,\" observed my guardian, \"as we require no new assurances on your part, so I believe we need give you none on ours.\"\n\"Not at all, sir. I thank you with all my heart. If I was not innocent of this crime, I couldn't look at you and keep my secret to myself under the condescension of the present visit. I feel the present visit very much. I am not one of the eloquent sort, but I feel it, Miss Summerson and gentlemen, deeply.\"\nHe laid his hand for a moment on his broad chest and bent his head to us. Although he squared himself again directly, he expressed a great amount of natural emotion by these simple means.\n\"First,\" said my guardian, \"can we do anything for your personal comfort, George?\"\n\"For which, sir?\" he inquired, clearing his throat.\n\"For your personal comfort. Is there anything you want that would lessen the hardship of this confinement?\"\n\"Well, sir,\" replied George, after a little cogitation, \"I am equally obliged to you, but tobacco being against the rules, I can't say that there is.\"\n\"You will think of many little things perhaps, by and by. Whenever you do, George, let us know.\"\n\"Thank you, sir. Howsoever,\" observed Mr. George with one of his sunburnt smiles, \"a man who has been knocking about the world in a vagabond kind of a way as long as I have gets on well enough in a place like the present, so far as that goes.\"\n\"Next, as to your case,\" observed my guardian.\n\"Exactly so, sir,\" returned Mr. George, folding his arms upon his breast with perfect self-possession and a little curiosity.\n\"How does it stand now?\"\n\"Why, sir, it is under remand at present. Bucket gives me to understand that he will probably apply for a series of remands from time to time until the case is more complete. How it is to be made more complete I don't myself see, but I dare say Bucket will manage it somehow.\"\n\"Why, heaven save us, man,\" exclaimed my guardian, surprised into his old oddity and vehemence, \"you talk of yourself as if you were somebody else!\"\n\"No offence, sir,\" said Mr. George. \"I am very sensible of your kindness. But I don't see how an innocent man is to make up his mind to this kind of thing without knocking his head against the walls unless he takes it in that point of view.\n\"That is true enough to a certain extent,\" returned my guardian, softened. \"But my good fellow, even an innocent man must take ordinary precautions to defend himself.\"\n\"Certainly, sir. And I have done so. I have stated to the magistrates, 'Gentlemen, I am as innocent of this charge as yourselves; what has been stated against me in the way of facts is perfectly true; I know no more about it.' I intend to continue stating that, sir. What more can I do? It's the truth.\"\n\"But the mere truth won't do,\" rejoined my guardian.\n\"Won't it indeed, sir? Rather a bad look-out for me!\" Mr. George good-humouredly observed.\n\"You must have a lawyer,\" pursued my guardian. \"We must engage a good one for you.\"\n\"I ask your pardon, sir,\" said Mr. George with a step backward. \"I am equally obliged. But I must decidedly beg to be excused from anything of that sort.\"\n\"You won't have a lawyer?\"\n\"No, sir.\" Mr. George shook his head in the most emphatic manner. \"I thank you all the same, sir, but--no lawyer!\"\n\"Why not?\"\n\"I don't take kindly to the breed,\" said Mr. George. \"Gridley didn't. And--if you'll excuse my saying so much--I should hardly have thought you did yourself, sir.\"\n\"That's equity,\" my guardian explained, a little at a loss; \"that's equity, George.\"\n\"Is it, indeed, sir?\" returned the trooper in his off-hand manner. \"I am not acquainted with those shades of names myself, but in a general way I object to the breed.\"\nUnfolding his arms and changing his position, he stood with one massive hand upon the table and the other on his hip, as complete a picture of a man who was not to be moved from a fixed purpose as ever I saw. It was in vain that we all three talked to him and endeavoured to persuade him; he listened with that gentleness which went so well with his bluff bearing, but was evidently no more shaken by our representations that his place of confinement was.\n\"Pray think, once more, Mr. George,\" said I. \"Have you no wish in reference to your case?\"\n\"I certainly could wish it to be tried, miss,\" he returned, \"by court-martial; but that is out of the question, as I am well aware. If you will be so good as to favour me with your attention for a couple of minutes, miss, not more, I'll endeavour to explain myself as clearly as I can.\"\nHe looked at us all three in turn, shook his head a little as if he were adjusting it in the stock and collar of a tight uniform, and after a moment's reflection went on.\n\"You see, miss, I have been handcuffed and taken into custody and brought here. I am a marked and disgraced man, and here I am. My shooting gallery is rummaged, high and low, by Bucket; such property as I have--'tis small--is turned this way and that till it don't know itself; and (as aforesaid) here I am! I don't particular complain of that. Though I am in these present quarters through no immediately preceding fault of mine, I can very well understand that if I hadn't gone into the vagabond way in my youth, this wouldn't have happened. It HAS happened. Then comes the question how to meet it.\"\nHe rubbed his swarthy forehead for a moment with a good-humoured look and said apologetically, \"I am such a short-winded talker that I must think a bit.\" Having thought a bit, he looked up again and resumed.\n\"How to meet it. Now, the unfortunate deceased was himself a lawyer and had a pretty tight hold of me. I don't wish to rake up his ashes, but he had, what I should call if he was living, a devil of a tight hold of me. I don't like his trade the better for that. If I had kept clear of his trade, I should have kept outside this place. But that's not what I mean. Now, suppose I had killed him. Suppose I really had discharged into his body any one of those pistols recently fired off that Bucket has found at my place, and dear me, might have found there any day since it has been my place. What should I have done as soon as I was hard and fast here? Got a lawyer.\"\nHe stopped on hearing some one at the locks and bolts and did not resume until the door had been opened and was shut again. For what purpose opened, I will mention presently.\n\"I should have got a lawyer, and he would have said (as I have often read in the newspapers), 'My client says nothing, my client reserves his defence': my client this, that, and t'other. Well, 'tis not the custom of that breed to go straight, according to my opinion, or to think that other men do. Say I am innocent and I get a lawyer. He would be as likely to believe me guilty as not; perhaps more. What would he do, whether or not? Act as if I was--shut my mouth up, tell me not to commit myself, keep circumstances back, chop the evidence small, quibble, and get me off perhaps! But, Miss Summerson, do I care for getting off in that way; or would I rather be hanged in my own way--if you'll excuse my mentioning anything so disagreeable to a lady?\"\nHe had warmed into his subject now, and was under no further necessity to wait a bit.\n\"I would rather be hanged in my own way. And I mean to be! I don't intend to say,\" looking round upon us with his powerful arms akimbo and his dark eyebrows raised, \"that I am more partial to being hanged than another man. What I say is, I must come off clear and full or not at all. Therefore, when I hear stated against me what is true, I say it's true; and when they tell me, 'whatever you say will be used,' I tell them I don't mind that; I mean it to be used. If they can't make me innocent out of the whole truth, they are not likely to do it out of anything less, or anything else. And if they are, it's worth nothing to me.\"\nTaking a pace or two over the stone floor, he came back to the table and finished what he had to say.\n\"I thank you, miss and gentlemen both, many times for your attention, and many times more for your interest. That's the plain state of the matter as it points itself out to a mere trooper with a blunt broadsword kind of a mind. I have never done well in life beyond my duty as a soldier, and if the worst comes after all, I shall reap pretty much as I have sown. When I got over the first crash of being seized as a murderer--it don't take a rover who has knocked about so much as myself so very long to recover from a crash--I worked my way round to what you find me now. As such I shall remain. No relations will be disgraced by me or made unhappy for me, and--and that's all I've got to say.\"\nThe door had been opened to admit another soldier-looking man of less prepossessing appearance at first sight and a weather-tanned, bright-eyed wholesome woman with a basket, who, from her entrance, had been exceedingly attentive to all Mr. George had said. Mr. George had received them with a familiar nod and a friendly look, but without any more particular greeting in the midst of his address. He now shook them cordially by the hand and said, \"Miss Summerson and gentlemen, this is an old comrade of mine, Matthew Bagnet. And this is his wife, Mrs. Bagnet.\"\nMr. Bagnet made us a stiff military bow, and Mrs. Bagnet dropped us a curtsy.\n\"Real good friends of mine, they are,\" sald Mr. George. \"It was at their house I was taken.\"\n\"With a second-hand wiolinceller,\" Mr. Bagnet put in, twitching his head angrily. \"Of a good tone. For a friend. That money was no object to.\"\n\"Mat,\" said Mr. George, \"you have heard pretty well all I have been saying to this lady and these two gentlemen. I know it meets your approval?\"\nMr. Bagnet, after considering, referred the point to his wife. \"Old girl,\" said he. \"Tell him. Whether or not. It meets my approval.\"\n\"Why, George,\" exclaimed Mrs. Bagnet, who had been unpacking her basket, in which there was a piece of cold pickled pork, a little tea and sugar, and a brown loaf, \"you ought to know it don't. You ought to know it's enough to drive a person wild to hear you. You won't be got off this way, and you won't be got off that way--what do you mean by such picking and choosing? It's stuff and nonsense, George.\"\n\"Don't be severe upon me in my misfortunes, Mrs. Bagnet,\" said the trooper lightly.\n\"Oh! Bother your misfortunes,\" cried Mrs. Bagnet, \"if they don't make you more reasonable than that comes to. I never was so ashamed in my life to hear a man talk folly as I have been to hear you talk this day to the present company. Lawyers? Why, what but too many cooks should hinder you from having a dozen lawyers if the gentleman recommended them to you.\"\n\"This is a very sensible woman,\" said my guardian. \"I hope you will persuade him, Mrs. Bagnet.\"\n\"Persuade him, sir?\" she returned. \"Lord bless you, no. You don't know George. Now, there!\" Mrs. Bagnet left her basket to point him out with both her bare brown hands. \"There he stands! As self-willed and as determined a man, in the wrong way, as ever put a human creature under heaven out of patience! You could as soon take up and shoulder an eight and forty pounder by your own strength as turn that man when he has got a thing into his head and fixed it there. Why, don't I know him!\" cried Mrs. Bagnet. \"Don't I know you, George! You don't mean to set up for a new character with ME after all these years, I hope?\"\nHer friendly indignation had an exemplary effect upon her husband, who shook his head at the trooper several times as a silent recommendation to him to yield. Between whiles, Mrs. Bagnet looked at me; and I understood from the play of her eyes that she wished me to do something, though I did not comprehend what.\n\"But I have given up talking to you, old fellow, years and years,\" said Mrs. Bagnet as she blew a little dust off the pickled pork, looking at me again; \"and when ladies and gentlemen know you as well as I do, they'll give up talking to you too. If you are not too headstrong to accept of a bit of dinner, here it is.\"\n\"I accept it with many thanks,\" returned the trooper.\n\"Do you though, indeed?\" said Mrs. Bagnet, continuing to grumble on good-humouredly. \"I'm sure I'm surprised at that. I wonder you don't starve in your own way also. It would only be like you. Perhaps you'll set your mind upon THAT next.\" Here she again looked at me, and I now perceived from her glances at the door and at me, by turns, that she wished us to retire and to await her following us outside the prison. Communicating this by similar means to my guardian and Mr. Woodcourt, I rose.\n\"We hope you will think better of it, Mr. George,\" said I, \"and we shall come to see you again, trusting to find you more reasonable.\"\n\"More grateful, Miss Summerson, you can't find me,\" he returned.\n\"But more persuadable we can, I hope,\" said I. \"And let me entreat you to consider that the clearing up of this mystery and the discovery of the real perpetrator of this deed may be of the last importance to others besides yourself.\"\nHe heard me respectfully but without much heeding these words, which I spoke a little turned from him, already on my way to the door; he was observing (this they afterwards told me) my height and figure, which seemed to catch his attention all at once.\n\"'Tis curious,\" said he. \"And yet I thought so at the time!\"\nMy guardian asked him what he meant.\n\"Why, sir,\" he answered, \"when my ill fortune took me to the dead man's staircase on the night of his murder, I saw a shape so like Miss Summerson's go by me in the dark that I had half a mind to speak to it.\"\nFor an instant I felt such a shudder as I never felt before or since and hope I shall never feel again.\n\"It came downstairs as I went up,\" said the trooper, \"and crossed the moonlighted window with a loose black mantle on; I noticed a deep fringe to it. However, it has nothing to do with the present subject, excepting that Miss Summerson looked so like it at the moment that it came into my head.\"\nI cannot separate and define the feelings that arose in me after this; it is enough that the vague duty and obligation I had felt upon me from the first of following the investigation was, without my distinctly daring to ask myself any question, increased, and that I was indignantly sure of there being no possibility of a reason for my being afraid.\nWe three went out of the prison and walked up and down at some short distance from the gate, which was in a retired place. We had not waited long when Mr. and Mrs. Bagnet came out too and quickly joined us.\nThere was a tear in each of Mrs. Bagnet's eyes, and her face was flushed and hurried. \"I didn't let George see what I thought about it, you know, miss,\" was her first remark when she came up, \"but he's in a bad way, poor old fellow!\"\n\"Not with care and prudence and good help,\" said my guardian.\n\"A gentleman like you ought to know best, sir,\" returned Mrs. Bagnet, hurriedly drying her eyes on the hem of her grey cloak, \"but I am uneasy for him. He has been so careless and said so much that he never meant. The gentlemen of the juries might not understand him as Lignum and me do. And then such a number of circumstances have happened bad for him, and such a number of people will be brought forward to speak against him, and Bucket is so deep.\"\n\"With a second-hand wiolinceller. And said he played the fife. When a boy,\" Mr. Bagnet added with great solemnity.\n\"Now, I tell you, miss,\" said Mrs. Bagnet; \"and when I say miss, I mean all! Just come into the corner of the wall and I'll tell you!\"\nMrs. Bagnet hurried us into a more secluded place and was at first too breathless to proceed, occasioning Mr. Bagnet to say, \"Old girl! Tell 'em!\"\n\"Why, then, miss,\" the old girl proceeded, untying the strings of her bonnet for more air, \"you could as soon move Dover Castle as move George on this point unless you had got a new power to move him with. And I have got it!\"\n\"You are a jewel of a woman,\" said my guardian. \"Go on!\"\n\"Now, I tell you, miss,\" she proceeded, clapping her hands in her hurry and agitation a dozen times in every sentence, \"that what he says concerning no relations is all bosh. They don't know of him, but he does know of them. He has said more to me at odd times than to anybody else, and it warn't for nothing that he once spoke to my Woolwich about whitening and wrinkling mothers' heads. For fifty pounds he had seen his mother that day. She's alive and must be brought here straight!\"\nInstantly Mrs. Bagnet put some pins into her mouth and began pinning up her skirts all round a little higher than the level of her grey cloak, which she accomplished with surpassing dispatch and dexterity.\n\"Lignum,\" said Mrs. Bagnet, \"you take care of the children, old man, and give me the umbrella! I'm away to Lincolnshire to bring that old lady here.\"\n\"But, bless the woman,\" cried my guardian with his hand in his pocket, \"how is she going? What money has she got?\"\nMrs. Bagnet made another application to her skirts and brought forth a leathern purse in which she hastily counted over a few shillings and which she then shut up with perfect satisfaction.\n\"Never you mind for me, miss. I'm a soldier's wife and accustomed to travel my own way. Lignum, old boy,\" kissing him, \"one for yourself, three for the children. Now I'm away into Lincolnshire after George's mother!\"\nAnd she actually set off while we three stood looking at one another lost in amazement. She actually trudged away in her grey cloak at a sturdy pace, and turned the corner, and was gone.\n\"Mr. Bagnet,\" said my guardian. \"Do you mean to let her go in that way?\"\n\"Can't help it,\" he returned. \"Made her way home once from another quarter of the world. With the same grey cloak. And same umbrella. Whatever the old girl says, do. Do it! Whenever the old girl says, I'LL do it. She does it.\"\n\"Then she is as honest and genuine as she looks,\" rejoined my guardian, \"and it is impossible to say more for her.\"\n\"She's Colour-Sergeant of the Nonpareil battalion,\" said Mr. Bagnet, looking at us over his shoulder as he went his way also. \"And there's not such another. But I never own to it before her. Discipline must be maintained.\"",
        "paragraph_chars": [
            [
                0,
                565
            ],
            [
                565,
                1054
            ],
            [
                1054,
                1637
            ],
            [
                1637,
                1704
            ],
            [
                1704,
                2038
            ],
            [
                2038,
                2618
            ],
            [
                2618,
                2782
            ],
            [
                2782,
                3016
            ],
            [
                3016,
                3219
            ],
            [
                3219,
                3772
            ],
            [
                3772,
                4205
            ],
            [
                4205,
                4330
            ],
            [
                4330,
                4973
            ],
            [
                4973,
                5164
            ],
            [
                5164,
                5345
            ],
            [
                5345,
                5476
            ],
            [
                5476,
                5732
            ],
            [
                5732,
                5762
            ],
            [
                5762,
                5891
            ],
            [
                5891,
                6200
            ],
            [
                6200,
                6388
            ],
            [
                6388,
                6471
            ],
            [
                6471,
                6523
            ],
            [
                6523,
                6631
            ],
            [
                6631,
                6782
            ],
            [
                6782,
                6879
            ],
            [
                6879,
                7123
            ],
            [
                7123,
                7170
            ],
            [
                7170,
                7296
            ],
            [
                7296,
                7321
            ],
            [
                7321,
                7598
            ],
            [
                7598,
                7747
            ],
            [
                7747,
                7988
            ],
            [
                7988,
                8156
            ],
            [
                8156,
                8460
            ],
            [
                8460,
                8513
            ],
            [
                8513,
                8604
            ],
            [
                8604,
                8688
            ],
            [
                8688,
                8843
            ],
            [
                8843,
                8870
            ],
            [
                8870,
                8985
            ],
            [
                8985,
                8996
            ],
            [
                8996,
                9160
            ],
            [
                9160,
                9245
            ],
            [
                9245,
                9413
            ],
            [
                9413,
                9869
            ],
            [
                9869,
                9960
            ],
            [
                9960,
                10247
            ],
            [
                10247,
                10418
            ],
            [
                10418,
                11020
            ],
            [
                11020,
                11228
            ],
            [
                11228,
                11895
            ],
            [
                11895,
                12070
            ],
            [
                12070,
                12825
            ],
            [
                12825,
                12911
            ],
            [
                12911,
                13544
            ],
            [
                13544,
                13646
            ],
            [
                13646,
                14342
            ],
            [
                14342,
                14905
            ],
            [
                14905,
                14983
            ],
            [
                14983,
                15076
            ],
            [
                15076,
                15219
            ],
            [
                15219,
                15364
            ],
            [
                15364,
                15498
            ],
            [
                15498,
                15904
            ],
            [
                15904,
                15988
            ],
            [
                15988,
                16349
            ],
            [
                16349,
                16445
            ],
            [
                16445,
                17066
            ],
            [
                17066,
                17380
            ],
            [
                17380,
                17699
            ],
            [
                17699,
                17753
            ],
            [
                17753,
                18248
            ],
            [
                18248,
                18383
            ],
            [
                18383,
                18448
            ],
            [
                18448,
                18682
            ],
            [
                18682,
                18935
            ],
            [
                18935,
                18996
            ],
            [
                18996,
                19033
            ],
            [
                19033,
                19243
            ],
            [
                19243,
                19347
            ],
            [
                19347,
                19643
            ],
            [
                19643,
                19995
            ],
            [
                19995,
                20202
            ],
            [
                20202,
                20436
            ],
            [
                20436,
                20498
            ],
            [
                20498,
                20951
            ],
            [
                20951,
                21066
            ],
            [
                21066,
                21201
            ],
            [
                21201,
                21348
            ],
            [
                21348,
                21574
            ],
            [
                21574,
                21631
            ],
            [
                21631,
                22118
            ],
            [
                22118,
                22324
            ],
            [
                22324,
                22474
            ],
            [
                22474,
                22589
            ],
            [
                22589,
                22779
            ],
            [
                22779,
                22996
            ],
            [
                22996,
                23183
            ],
            [
                23183,
                23256
            ],
            [
                23256,
                23483
            ],
            [
                23483,
                23599
            ],
            [
                23599,
                23821
            ]
        ],
        "segment_chars": [
            [
                0,
                248
            ],
            [
                248,
                565
            ],
            [
                565,
                860
            ],
            [
                860,
                927
            ],
            [
                927,
                1054
            ],
            [
                1054,
                1227
            ],
            [
                1227,
                1315
            ],
            [
                1315,
                1637
            ],
            [
                1637,
                1704
            ],
            [
                1704,
                1732
            ],
            [
                1732,
                1974
            ],
            [
                1974,
                1994
            ],
            [
                1994,
                2028
            ],
            [
                2028,
                2038
            ],
            [
                2038,
                2073
            ],
            [
                2073,
                2181
            ],
            [
                2181,
                2234
            ],
            [
                2234,
                2277
            ],
            [
                2277,
                2386
            ],
            [
                2386,
                2481
            ],
            [
                2481,
                2618
            ],
            [
                2618,
                2644
            ],
            [
                2644,
                2782
            ],
            [
                2782,
                2907
            ],
            [
                2907,
                3016
            ],
            [
                3016,
                3033
            ],
            [
                3033,
                3055
            ],
            [
                3055,
                3139
            ],
            [
                3139,
                3219
            ],
            [
                3219,
                3371
            ],
            [
                3371,
                3456
            ],
            [
                3456,
                3571
            ],
            [
                3571,
                3705
            ],
            [
                3705,
                3772
            ],
            [
                3772,
                3815
            ],
            [
                3815,
                3978
            ],
            [
                3978,
                4021
            ],
            [
                4021,
                4205
            ],
            [
                4205,
                4277
            ],
            [
                4277,
                4330
            ],
            [
                4330,
                4648
            ],
            [
                4648,
                4882
            ],
            [
                4882,
                4973
            ],
            [
                4973,
                5081
            ],
            [
                5081,
                5164
            ],
            [
                5164,
                5301
            ],
            [
                5301,
                5345
            ],
            [
                5345,
                5384
            ],
            [
                5384,
                5476
            ],
            [
                5476,
                5616
            ],
            [
                5616,
                5732
            ],
            [
                5732,
                5762
            ],
            [
                5762,
                5891
            ],
            [
                5891,
                5909
            ],
            [
                5909,
                5940
            ],
            [
                5940,
                6075
            ],
            [
                6075,
                6111
            ],
            [
                6111,
                6200
            ],
            [
                6200,
                6274
            ],
            [
                6274,
                6388
            ],
            [
                6388,
                6471
            ],
            [
                6471,
                6489
            ],
            [
                6489,
                6523
            ],
            [
                6523,
                6551
            ],
            [
                6551,
                6631
            ],
            [
                6631,
                6782
            ],
            [
                6782,
                6840
            ],
            [
                6840,
                6879
            ],
            [
                6879,
                6896
            ],
            [
                6896,
                7123
            ],
            [
                7123,
                7170
            ],
            [
                7170,
                7296
            ],
            [
                7296,
                7321
            ],
            [
                7321,
                7363
            ],
            [
                7363,
                7496
            ],
            [
                7496,
                7598
            ],
            [
                7598,
                7747
            ],
            [
                7747,
                7783
            ],
            [
                7783,
                7821
            ],
            [
                7821,
                7988
            ],
            [
                7988,
                8063
            ],
            [
                8063,
                8156
            ],
            [
                8156,
                8173
            ],
            [
                8173,
                8193
            ],
            [
                8193,
                8383
            ],
            [
                8383,
                8423
            ],
            [
                8423,
                8443
            ],
            [
                8443,
                8460
            ],
            [
                8460,
                8513
            ],
            [
                8513,
                8536
            ],
            [
                8536,
                8567
            ],
            [
                8567,
                8604
            ],
            [
                8604,
                8651
            ],
            [
                8651,
                8688
            ],
            [
                8688,
                8752
            ],
            [
                8752,
                8775
            ],
            [
                8775,
                8843
            ],
            [
                8843,
                8870
            ],
            [
                8870,
                8881
            ],
            [
                8881,
                8936
            ],
            [
                8936,
                8985
            ],
            [
                8985,
                8996
            ],
            [
                8996,
                9049
            ],
            [
                9049,
                9066
            ],
            [
                9066,
                9160
            ],
            [
                9160,
                9245
            ],
            [
                9245,
                9267
            ],
            [
                9267,
                9312
            ],
            [
                9312,
                9413
            ],
            [
                9413,
                9622
            ],
            [
                9622,
                9869
            ],
            [
                9869,
                9914
            ],
            [
                9914,
                9960
            ],
            [
                9960,
                10092
            ],
            [
                10092,
                10247
            ],
            [
                10247,
                10418
            ],
            [
                10418,
                10498
            ],
            [
                10498,
                10546
            ],
            [
                10546,
                10726
            ],
            [
                10726,
                10763
            ],
            [
                10763,
                10962
            ],
            [
                10962,
                10979
            ],
            [
                10979,
                11020
            ],
            [
                11020,
                11174
            ],
            [
                11174,
                11228
            ],
            [
                11228,
                11245
            ],
            [
                11245,
                11331
            ],
            [
                11331,
                11446
            ],
            [
                11446,
                11490
            ],
            [
                11490,
                11563
            ],
            [
                11563,
                11591
            ],
            [
                11591,
                11622
            ],
            [
                11622,
                11819
            ],
            [
                11819,
                11880
            ],
            [
                11880,
                11895
            ],
            [
                11895,
                12019
            ],
            [
                12019,
                12070
            ],
            [
                12070,
                12257
            ],
            [
                12257,
                12369
            ],
            [
                12369,
                12407
            ],
            [
                12407,
                12472
            ],
            [
                12472,
                12506
            ],
            [
                12506,
                12654
            ],
            [
                12654,
                12825
            ],
            [
                12825,
                12911
            ],
            [
                12911,
                12952
            ],
            [
                12952,
                12970
            ],
            [
                12970,
                13134
            ],
            [
                13134,
                13195
            ],
            [
                13195,
                13376
            ],
            [
                13376,
                13500
            ],
            [
                13500,
                13544
            ],
            [
                13544,
                13646
            ],
            [
                13646,
                13755
            ],
            [
                13755,
                13874
            ],
            [
                13874,
                14009
            ],
            [
                14009,
                14219
            ],
            [
                14219,
                14243
            ],
            [
                14243,
                14342
            ],
            [
                14342,
                14600
            ],
            [
                14600,
                14740
            ],
            [
                14740,
                14869
            ],
            [
                14869,
                14905
            ],
            [
                14905,
                14983
            ],
            [
                14983,
                15039
            ],
            [
                15039,
                15076
            ],
            [
                15076,
                15158
            ],
            [
                15158,
                15175
            ],
            [
                15175,
                15189
            ],
            [
                15189,
                15219
            ],
            [
                15219,
                15332
            ],
            [
                15332,
                15364
            ],
            [
                15364,
                15427
            ],
            [
                15427,
                15448
            ],
            [
                15448,
                15459
            ],
            [
                15459,
                15475
            ],
            [
                15475,
                15498
            ],
            [
                15498,
                15691
            ],
            [
                15691,
                15757
            ],
            [
                15757,
                15870
            ],
            [
                15870,
                15904
            ],
            [
                15904,
                15988
            ],
            [
                15988,
                15993
            ],
            [
                15993,
                16098
            ],
            [
                16098,
                16222
            ],
            [
                16222,
                16231
            ],
            [
                16231,
                16349
            ],
            [
                16349,
                16400
            ],
            [
                16400,
                16445
            ],
            [
                16445,
                16466
            ],
            [
                16466,
                16480
            ],
            [
                16480,
                16501
            ],
            [
                16501,
                16524
            ],
            [
                16524,
                16537
            ],
            [
                16537,
                16614
            ],
            [
                16614,
                16632
            ],
            [
                16632,
                16749
            ],
            [
                16749,
                16911
            ],
            [
                16911,
                16935
            ],
            [
                16935,
                16954
            ],
            [
                16954,
                16981
            ],
            [
                16981,
                17066
            ],
            [
                17066,
                17225
            ],
            [
                17225,
                17380
            ],
            [
                17380,
                17626
            ],
            [
                17626,
                17699
            ],
            [
                17699,
                17753
            ],
            [
                17753,
                17778
            ],
            [
                17778,
                17838
            ],
            [
                17838,
                17871
            ],
            [
                17871,
                17919
            ],
            [
                17919,
                17946
            ],
            [
                17946,
                17992
            ],
            [
                17992,
                18170
            ],
            [
                18170,
                18248
            ],
            [
                18248,
                18383
            ],
            [
                18383,
                18448
            ],
            [
                18448,
                18495
            ],
            [
                18495,
                18682
            ],
            [
                18682,
                18935
            ],
            [
                18935,
                18960
            ],
            [
                18960,
                18996
            ],
            [
                18996,
                19033
            ],
            [
                19033,
                19243
            ],
            [
                19243,
                19347
            ],
            [
                19347,
                19497
            ],
            [
                19497,
                19643
            ],
            [
                19643,
                19995
            ],
            [
                19995,
                20118
            ],
            [
                20118,
                20202
            ],
            [
                20202,
                20288
            ],
            [
                20288,
                20436
            ],
            [
                20436,
                20498
            ],
            [
                20498,
                20650
            ],
            [
                20650,
                20712
            ],
            [
                20712,
                20786
            ],
            [
                20786,
                20951
            ],
            [
                20951,
                20985
            ],
            [
                20985,
                21014
            ],
            [
                21014,
                21066
            ],
            [
                21066,
                21143
            ],
            [
                21143,
                21201
            ],
            [
                21201,
                21337
            ],
            [
                21337,
                21348
            ],
            [
                21348,
                21554
            ],
            [
                21554,
                21574
            ],
            [
                21574,
                21622
            ],
            [
                21622,
                21631
            ],
            [
                21631,
                21806
            ],
            [
                21806,
                21856
            ],
            [
                21856,
                22020
            ],
            [
                22020,
                22070
            ],
            [
                22070,
                22118
            ],
            [
                22118,
                22324
            ],
            [
                22324,
                22419
            ],
            [
                22419,
                22474
            ],
            [
                22474,
                22564
            ],
            [
                22564,
                22589
            ],
            [
                22589,
                22779
            ],
            [
                22779,
                22809
            ],
            [
                22809,
                22867
            ],
            [
                22867,
                22941
            ],
            [
                22941,
                22996
            ],
            [
                22996,
                23084
            ],
            [
                23084,
                23183
            ],
            [
                23183,
                23215
            ],
            [
                23215,
                23256
            ],
            [
                23256,
                23286
            ],
            [
                23286,
                23345
            ],
            [
                23345,
                23371
            ],
            [
                23371,
                23390
            ],
            [
                23390,
                23422
            ],
            [
                23422,
                23429
            ],
            [
                23429,
                23469
            ],
            [
                23469,
                23483
            ],
            [
                23483,
                23599
            ],
            [
                23599,
                23725
            ],
            [
                23725,
                23756
            ],
            [
                23756,
                23790
            ],
            [
                23790,
                23821
            ]
        ],
        "overlap_chars": [
            [
                37,
                38
            ],
            [
                80,
                89
            ],
            [
                89,
                206
            ],
            [
                232,
                248
            ],
            [
                248,
                363
            ],
            [
                390,
                565
            ],
            [
                565,
                625
            ],
            [
                638,
                648
            ],
            [
                692,
                693
            ],
            [
                760,
                768
            ],
            [
                772,
                775
            ],
            [
                776,
                860
            ],
            [
                860,
                927
            ],
            [
                927,
                1013
            ],
            [
                1052,
                1054
            ],
            [
                1054,
                1079
            ],
            [
                1157,
                1167
            ],
            [
                1105,
                1108
            ],
            [
                1168,
                1198
            ],
            [
                1204,
                1227
            ],
            [
                1227,
                1315
            ],
            [
                1315,
                1340
            ],
            [
                1377,
                1441
            ],
            [
                1446,
                1455
            ],
            [
                1462,
                1472
            ],
            [
                1534,
                1571
            ],
            [
                1575,
                1605
            ],
            [
                1635,
                1637
            ],
            [
                1637,
                1680
            ],
            [
                1684,
                1686
            ],
            [
                1701,
                1704
            ],
            [
                1704,
                1732
            ],
            [
                1732,
                1854
            ],
            [
                1933,
                1941
            ],
            [
                1957,
                1974
            ],
            [
                1974,
                1992
            ],
            [
                2038,
                2073
            ],
            [
                2073,
                2080
            ],
            [
                2147,
                2181
            ],
            [
                2181,
                2234
            ],
            [
                2234,
                2277
            ],
            [
                2277,
                2335
            ],
            [
                2384,
                2386
            ],
            [
                2386,
                2481
            ],
            [
                2481,
                2510
            ],
            [
                2514,
                2522
            ],
            [
                2557,
                2618
            ],
            [
                2618,
                2643
            ],
            [
                2782,
                2819
            ],
            [
                2858,
                2907
            ],
            [
                2907,
                2917
            ],
            [
                2925,
                3016
            ],
            [
                3016,
                3033
            ],
            [
                3033,
                3055
            ],
            [
                3055,
                3139
            ],
            [
                3139,
                3219
            ],
            [
                3219,
                3268
            ],
            [
                3269,
                3369
            ],
            [
                3371,
                3375
            ],
            [
                3383,
                3394
            ],
            [
                3413,
                3416
            ],
            [
                3417,
                3456
            ],
            [
                3578,
                3593
            ],
            [
                3630,
                3676
            ],
            [
                3705,
                3749
            ],
            [
                3576,
                3578
            ],
            [
                3703,
                3704
            ],
            [
                3770,
                3772
            ],
            [
                3772,
                3815
            ],
            [
                3815,
                3827
            ],
            [
                3965,
                3967
            ],
            [
                3841,
                3860
            ],
            [
                3891,
                3940
            ],
            [
                3976,
                3978
            ],
            [
                3978,
                3998
            ],
            [
                4009,
                4021
            ],
            [
                4021,
                4064
            ],
            [
                4072,
                4155
            ],
            [
                4203,
                4205
            ],
            [
                4205,
                4244
            ],
            [
                4260,
                4277
            ],
            [
                4277,
                4330
            ],
            [
                4330,
                4361
            ],
            [
                4362,
                4381
            ],
            [
                4466,
                4467
            ],
            [
                4402,
                4405
            ],
            [
                4616,
                4623
            ],
            [
                4632,
                4648
            ],
            [
                4648,
                4706
            ],
            [
                4751,
                4779
            ],
            [
                4872,
                4873
            ],
            [
                4817,
                4822
            ],
            [
                4780,
                4795
            ],
            [
                4837,
                4859
            ],
            [
                4880,
                4881
            ],
            [
                4973,
                4991
            ],
            [
                4997,
                5004
            ],
            [
                5012,
                5043
            ],
            [
                5062,
                5081
            ],
            [
                5081,
                5084
            ],
            [
                5088,
                5089
            ],
            [
                5096,
                5132
            ],
            [
                5162,
                5164
            ],
            [
                5164,
                5251
            ],
            [
                5274,
                5301
            ],
            [
                5476,
                5484
            ],
            [
                5485,
                5489
            ],
            [
                5492,
                5539
            ],
            [
                5560,
                5561
            ],
            [
                5563,
                5615
            ],
            [
                5675,
                5685
            ],
            [
                5645,
                5647
            ],
            [
                5635,
                5644
            ],
            [
                5685,
                5732
            ],
            [
                5762,
                5800
            ],
            [
                5803,
                5844
            ],
            [
                5888,
                5891
            ],
            [
                5911,
                5920
            ],
            [
                5921,
                5940
            ],
            [
                5940,
                6028
            ],
            [
                6073,
                6075
            ],
            [
                6075,
                6081
            ],
            [
                6094,
                6104
            ],
            [
                6200,
                6216
            ],
            [
                6230,
                6266
            ],
            [
                6316,
                6317
            ],
            [
                6331,
                6388
            ],
            [
                6388,
                6416
            ],
            [
                6426,
                6434
            ],
            [
                6420,
                6422
            ],
            [
                6416,
                6419
            ],
            [
                6423,
                6425
            ],
            [
                6435,
                6471
            ],
            [
                6631,
                6659
            ],
            [
                6685,
                6692
            ],
            [
                6701,
                6720
            ],
            [
                6721,
                6728
            ],
            [
                6735,
                6782
            ],
            [
                6782,
                6783
            ],
            [
                6783,
                6786
            ],
            [
                6792,
                6800
            ],
            [
                6855,
                6879
            ],
            [
                6879,
                6896
            ],
            [
                6896,
                7019
            ],
            [
                7030,
                7087
            ],
            [
                7120,
                7123
            ],
            [
                7123,
                7169
            ],
            [
                7296,
                7321
            ],
            [
                7321,
                7363
            ],
            [
                7363,
                7369
            ],
            [
                7376,
                7378
            ],
            [
                7393,
                7444
            ],
            [
                7463,
                7496
            ],
            [
                7496,
                7538
            ],
            [
                7546,
                7598
            ],
            [
                7598,
                7648
            ],
            [
                7694,
                7703
            ],
            [
                7716,
                7747
            ],
            [
                7747,
                7783
            ],
            [
                7821,
                7862
            ],
            [
                7883,
                7945
            ],
            [
                7946,
                7961
            ],
            [
                7968,
                7986
            ],
            [
                7988,
                7989
            ],
            [
                7997,
                8008
            ],
            [
                8028,
                8051
            ],
            [
                8061,
                8063
            ],
            [
                8063,
                8067
            ],
            [
                8084,
                8109
            ],
            [
                8139,
                8156
            ],
            [
                8156,
                8173
            ],
            [
                8173,
                8193
            ],
            [
                8193,
                8206
            ],
            [
                8207,
                8226
            ],
            [
                8357,
                8363
            ],
            [
                8372,
                8380
            ],
            [
                8423,
                8443
            ],
            [
                8443,
                8460
            ],
            [
                8460,
                8512
            ],
            [
                8604,
                8627
            ],
            [
                8649,
                8651
            ],
            [
                8652,
                8688
            ],
            [
                8688,
                8752
            ],
            [
                8752,
                8757
            ],
            [
                8766,
                8775
            ],
            [
                8775,
                8843
            ],
            [
                8843,
                8870
            ],
            [
                8870,
                8880
            ],
            [
                8985,
                8996
            ],
            [
                8996,
                9049
            ],
            [
                9049,
                9066
            ],
            [
                9389,
                9410
            ],
            [
                9366,
                9367
            ],
            [
                9410,
                9413
            ],
            [
                9622,
                9654
            ],
            [
                9673,
                9785
            ],
            [
                9811,
                9817
            ],
            [
                9867,
                9869
            ],
            [
                10418,
                10426
            ],
            [
                10426,
                10427
            ],
            [
                10434,
                10460
            ],
            [
                10484,
                10498
            ],
            [
                10498,
                10529
            ],
            [
                10544,
                10546
            ],
            [
                10546,
                10627
            ],
            [
                10641,
                10668
            ],
            [
                10694,
                10699
            ],
            [
                10715,
                10726
            ],
            [
                10726,
                10763
            ],
            [
                10763,
                10769
            ],
            [
                10801,
                10811
            ],
            [
                10834,
                10854
            ],
            [
                10865,
                10962
            ],
            [
                10962,
                10977
            ],
            [
                10979,
                11020
            ],
            [
                11020,
                11033
            ],
            [
                11042,
                11063
            ],
            [
                11090,
                11093
            ],
            [
                11181,
                11194
            ],
            [
                11196,
                11198
            ],
            [
                11219,
                11228
            ],
            [
                11245,
                11331
            ],
            [
                11331,
                11376
            ],
            [
                11415,
                11446
            ],
            [
                11446,
                11490
            ],
            [
                11563,
                11566
            ],
            [
                11596,
                11622
            ],
            [
                11672,
                11692
            ],
            [
                11712,
                11746
            ],
            [
                11766,
                11770
            ],
            [
                11804,
                11808
            ],
            [
                11777,
                11782
            ],
            [
                11817,
                11819
            ],
            [
                11819,
                11859
            ],
            [
                11874,
                11880
            ],
            [
                11880,
                11895
            ],
            [
                11895,
                11916
            ],
            [
                11926,
                12019
            ],
            [
                12019,
                12070
            ],
            [
                12369,
                12407
            ],
            [
                12407,
                12456
            ],
            [
                12470,
                12472
            ],
            [
                12472,
                12488
            ],
            [
                12504,
                12506
            ],
            [
                12506,
                12521
            ],
            [
                12523,
                12536
            ],
            [
                12539,
                12570
            ],
            [
                12630,
                12654
            ],
            [
                12654,
                12674
            ],
            [
                12678,
                12679
            ],
            [
                12717,
                12722
            ],
            [
                12725,
                12741
            ],
            [
                13149,
                13195
            ],
            [
                13376,
                13480
            ],
            [
                13498,
                13500
            ],
            [
                13500,
                13544
            ],
            [
                13587,
                13589
            ],
            [
                13595,
                13625
            ],
            [
                13644,
                13646
            ],
            [
                13646,
                13684
            ],
            [
                13696,
                13714
            ],
            [
                13753,
                13755
            ],
            [
                13874,
                13875
            ],
            [
                13839,
                13872
            ],
            [
                13932,
                13933
            ],
            [
                13876,
                13932
            ],
            [
                13934,
                14009
            ],
            [
                14243,
                14307
            ],
            [
                14309,
                14342
            ],
            [
                14342,
                14391
            ],
            [
                14391,
                14403
            ],
            [
                14452,
                14520
            ],
            [
                14541,
                14600
            ],
            [
                14600,
                14668
            ],
            [
                14738,
                14740
            ],
            [
                14740,
                14867
            ],
            [
                14869,
                14872
            ],
            [
                14881,
                14905
            ],
            [
                14905,
                14983
            ],
            [
                14983,
                15021
            ],
            [
                15027,
                15039
            ],
            [
                15039,
                15076
            ],
            [
                15076,
                15095
            ],
            [
                15108,
                15157
            ],
            [
                15219,
                15293
            ],
            [
                15330,
                15332
            ],
            [
                15332,
                15364
            ],
            [
                15427,
                15443
            ],
            [
                15366,
                15375
            ],
            [
                15448,
                15459
            ],
            [
                15459,
                15475
            ],
            [
                15475,
                15498
            ],
            [
                15498,
                15691
            ],
            [
                15691,
                15757
            ],
            [
                15757,
                15787
            ],
            [
                15813,
                15821
            ],
            [
                15868,
                15870
            ],
            [
                15870,
                15901
            ],
            [
                16231,
                16235
            ],
            [
                16274,
                16277
            ],
            [
                16260,
                16266
            ],
            [
                16290,
                16349
            ],
            [
                16349,
                16400
            ],
            [
                16400,
                16445
            ],
            [
                16445,
                16466
            ],
            [
                16466,
                16480
            ],
            [
                16480,
                16501
            ],
            [
                16501,
                16524
            ],
            [
                16632,
                16749
            ],
            [
                16955,
                16981
            ],
            [
                16981,
                17066
            ],
            [
                17066,
                17090
            ],
            [
                17131,
                17132
            ],
            [
                17120,
                17131
            ],
            [
                17137,
                17166
            ],
            [
                17181,
                17225
            ],
            [
                17241,
                17380
            ],
            [
                17380,
                17427
            ],
            [
                17444,
                17463
            ],
            [
                17510,
                17626
            ],
            [
                17626,
                17665
            ],
            [
                17669,
                17699
            ],
            [
                17699,
                17716
            ],
            [
                17722,
                17753
            ],
            [
                17753,
                17760
            ],
            [
                17769,
                17778
            ],
            [
                17778,
                17794
            ],
            [
                17836,
                17838
            ],
            [
                17871,
                17919
            ],
            [
                17919,
                17927
            ],
            [
                17933,
                17944
            ],
            [
                17992,
                18069
            ],
            [
                18091,
                18126
            ],
            [
                18133,
                18136
            ],
            [
                18150,
                18170
            ],
            [
                18170,
                18248
            ],
            [
                18248,
                18369
            ],
            [
                18496,
                18499
            ],
            [
                18519,
                18597
            ],
            [
                18623,
                18632
            ],
            [
                18642,
                18682
            ],
            [
                18682,
                18758
            ],
            [
                18785,
                18814
            ],
            [
                18816,
                18832
            ],
            [
                18864,
                18921
            ],
            [
                18933,
                18935
            ],
            [
                18935,
                18960
            ],
            [
                18960,
                18996
            ],
            [
                18996,
                19033
            ],
            [
                19033,
                19243
            ],
            [
                19243,
                19347
            ],
            [
                19347,
                19442
            ],
            [
                19449,
                19454
            ],
            [
                19455,
                19464
            ],
            [
                19495,
                19497
            ],
            [
                19568,
                19600
            ],
            [
                19615,
                19643
            ],
            [
                19643,
                19651
            ],
            [
                19665,
                19713
            ],
            [
                19840,
                19842
            ],
            [
                19861,
                19863
            ],
            [
                19809,
                19826
            ],
            [
                19889,
                19903
            ],
            [
                19909,
                19949
            ],
            [
                19967,
                19995
            ],
            [
                19995,
                20049
            ],
            [
                20101,
                20102
            ],
            [
                20058,
                20086
            ],
            [
                20116,
                20118
            ],
            [
                20146,
                20174
            ],
            [
                20179,
                20182
            ],
            [
                20191,
                20202
            ],
            [
                20202,
                20207
            ],
            [
                20219,
                20221
            ],
            [
                20230,
                20274
            ],
            [
                20286,
                20287
            ],
            [
                20288,
                20354
            ],
            [
                20376,
                20436
            ],
            [
                20436,
                20498
            ],
            [
                20498,
                20593
            ],
            [
                20622,
                20650
            ],
            [
                20650,
                20712
            ],
            [
                20712,
                20786
            ],
            [
                20786,
                20794
            ],
            [
                20812,
                20856
            ],
            [
                20874,
                20948
            ],
            [
                21143,
                21168
            ],
            [
                21181,
                21201
            ],
            [
                21201,
                21230
            ],
            [
                21236,
                21244
            ],
            [
                21309,
                21310
            ],
            [
                21439,
                21504
            ],
            [
                21358,
                21364
            ],
            [
                21352,
                21353
            ],
            [
                21505,
                21554
            ],
            [
                21554,
                21574
            ],
            [
                21574,
                21622
            ],
            [
                21622,
                21631
            ],
            [
                21631,
                21636
            ],
            [
                21756,
                21806
            ],
            [
                21806,
                21856
            ],
            [
                21945,
                22020
            ],
            [
                22020,
                22070
            ],
            [
                22070,
                22115
            ],
            [
                22325,
                22331
            ],
            [
                22350,
                22351
            ],
            [
                22353,
                22382
            ],
            [
                22391,
                22419
            ],
            [
                22419,
                22474
            ],
            [
                22474,
                22515
            ],
            [
                22543,
                22564
            ],
            [
                22564,
                22589
            ],
            [
                22589,
                22600
            ],
            [
                22644,
                22667
            ],
            [
                22669,
                22703
            ],
            [
                22709,
                22724
            ],
            [
                22777,
                22779
            ],
            [
                22809,
                22867
            ],
            [
                22867,
                22941
            ],
            [
                22941,
                22996
            ],
            [
                22996,
                23064
            ],
            [
                23070,
                23084
            ],
            [
                23084,
                23087
            ],
            [
                23097,
                23145
            ],
            [
                23150,
                23183
            ],
            [
                23183,
                23215
            ],
            [
                23215,
                23256
            ],
            [
                23256,
                23286
            ],
            [
                23286,
                23345
            ],
            [
                23345,
                23371
            ],
            [
                23371,
                23390
            ],
            [
                23390,
                23420
            ],
            [
                23425,
                23429
            ],
            [
                23429,
                23467
            ],
            [
                23469,
                23483
            ],
            [
                23483,
                23505
            ],
            [
                23518,
                23553
            ],
            [
                23599,
                23666
            ],
            [
                23723,
                23725
            ],
            [
                23725,
                23756
            ],
            [
                23756,
                23790
            ],
            [
                23790,
                23821
            ]
        ],
        "row_chars": [
            [
                0,
                248
            ],
            [
                248,
                565
            ],
            [
                565,
                860
            ],
            [
                860,
                927
            ],
            [
                927,
                1054
            ],
            [
                1054,
                1227
            ],
            [
                1227,
                1315
            ],
            [
                1315,
                1637
            ],
            [
                1637,
                1704
            ],
            [
                1704,
                1732
            ],
            [
                1732,
                1974
            ],
            [
                1974,
                1994
            ],
            [
                1994,
                2028
            ],
            [
                2028,
                2038
            ],
            [
                2038,
                2073
            ],
            [
                2073,
                2181
            ],
            [
                2181,
                2234
            ],
            [
                2234,
                2277
            ],
            [
                2277,
                2386
            ],
            [
                2386,
                2481
            ],
            [
                2481,
                2618
            ],
            [
                2618,
                2644
            ],
            [
                2644,
                2782
            ],
            [
                2782,
                2907
            ],
            [
                2907,
                3016
            ],
            [
                3016,
                3033
            ],
            [
                3033,
                3055
            ],
            [
                3055,
                3139
            ],
            [
                3139,
                3219
            ],
            [
                3219,
                3456
            ],
            [
                3456,
                3571
            ],
            [
                3571,
                3772
            ],
            [
                3772,
                3815
            ],
            [
                3815,
                3978
            ],
            [
                3978,
                4021
            ],
            [
                4021,
                4205
            ],
            [
                4205,
                4277
            ],
            [
                4277,
                4330
            ],
            [
                4330,
                4648
            ],
            [
                4648,
                4882
            ],
            [
                4882,
                4973
            ],
            [
                4973,
                5081
            ],
            [
                5081,
                5164
            ],
            [
                5164,
                5301
            ],
            [
                5301,
                5345
            ],
            [
                5345,
                5384
            ],
            [
                5384,
                5476
            ],
            [
                5476,
                5616
            ],
            [
                5616,
                5732
            ],
            [
                5732,
                5762
            ],
            [
                5762,
                5891
            ],
            [
                5891,
                5909
            ],
            [
                5909,
                5940
            ],
            [
                5940,
                6075
            ],
            [
                6075,
                6111
            ],
            [
                6111,
                6200
            ],
            [
                6200,
                6388
            ],
            [
                6388,
                6471
            ],
            [
                6471,
                6489
            ],
            [
                6489,
                6523
            ],
            [
                6523,
                6551
            ],
            [
                6551,
                6631
            ],
            [
                6631,
                6782
            ],
            [
                6782,
                6879
            ],
            [
                6879,
                6896
            ],
            [
                6896,
                7123
            ],
            [
                7123,
                7170
            ],
            [
                7170,
                7296
            ],
            [
                7296,
                7321
            ],
            [
                7321,
                7363
            ],
            [
                7363,
                7496
            ],
            [
                7496,
                7598
            ],
            [
                7598,
                7747
            ],
            [
                7747,
                7783
            ],
            [
                7783,
                7821
            ],
            [
                7821,
                7988
            ],
            [
                7988,
                8063
            ],
            [
                8063,
                8156
            ],
            [
                8156,
                8173
            ],
            [
                8173,
                8193
            ],
            [
                8193,
                8383
            ],
            [
                8383,
                8423
            ],
            [
                8423,
                8443
            ],
            [
                8443,
                8460
            ],
            [
                8460,
                8513
            ],
            [
                8513,
                8536
            ],
            [
                8536,
                8567
            ],
            [
                8567,
                8604
            ],
            [
                8604,
                8651
            ],
            [
                8651,
                8688
            ],
            [
                8688,
                8752
            ],
            [
                8752,
                8775
            ],
            [
                8775,
                8843
            ],
            [
                8843,
                8870
            ],
            [
                8870,
                8881
            ],
            [
                8881,
                8936
            ],
            [
                8936,
                8985
            ],
            [
                8985,
                8996
            ],
            [
                8996,
                9049
            ],
            [
                9049,
                9066
            ],
            [
                9066,
                9160
            ],
            [
                9160,
                9245
            ],
            [
                9245,
                9267
            ],
            [
                9267,
                9312
            ],
            [
                9312,
                9413
            ],
            [
                9413,
                9622
            ],
            [
                9622,
                9869
            ],
            [
                9869,
                9914
            ],
            [
                9914,
                9960
            ],
            [
                9960,
                10092
            ],
            [
                10092,
                10247
            ],
            [
                10247,
                10418
            ],
            [
                10418,
                10498
            ],
            [
                10498,
                10546
            ],
            [
                10546,
                10726
            ],
            [
                10726,
                10763
            ],
            [
                10763,
                10962
            ],
            [
                10962,
                11020
            ],
            [
                11020,
                11228
            ],
            [
                11228,
                11245
            ],
            [
                11245,
                11331
            ],
            [
                11331,
                11446
            ],
            [
                11446,
                11490
            ],
            [
                11490,
                11563
            ],
            [
                11563,
                11622
            ],
            [
                11622,
                11819
            ],
            [
                11819,
                11880
            ],
            [
                11880,
                11895
            ],
            [
                11895,
                12019
            ],
            [
                12019,
                12070
            ],
            [
                12070,
                12257
            ],
            [
                12257,
                12369
            ],
            [
                12369,
                12407
            ],
            [
                12407,
                12472
            ],
            [
                12472,
                12506
            ],
            [
                12506,
                12654
            ],
            [
                12654,
                12825
            ],
            [
                12825,
                12911
            ],
            [
                12911,
                12952
            ],
            [
                12952,
                12970
            ],
            [
                12970,
                13134
            ],
            [
                13134,
                13195
            ],
            [
                13195,
                13376
            ],
            [
                13376,
                13500
            ],
            [
                13500,
                13544
            ],
            [
                13544,
                13646
            ],
            [
                13646,
                13755
            ],
            [
                13755,
                14009
            ],
            [
                14009,
                14219
            ],
            [
                14219,
                14243
            ],
            [
                14243,
                14342
            ],
            [
                14342,
                14600
            ],
            [
                14600,
                14740
            ],
            [
                14740,
                14905
            ],
            [
                14905,
                14983
            ],
            [
                14983,
                15039
            ],
            [
                15039,
                15076
            ],
            [
                15076,
                15158
            ],
            [
                15158,
                15175
            ],
            [
                15175,
                15189
            ],
            [
                15189,
                15219
            ],
            [
                15219,
                15332
            ],
            [
                15332,
                15364
            ],
            [
                15364,
                15459
            ],
            [
                15459,
                15475
            ],
            [
                15475,
                15498
            ],
            [
                15498,
                15691
            ],
            [
                15691,
                15757
            ],
            [
                15757,
                15870
            ],
            [
                15870,
                15904
            ],
            [
                15904,
                15988
            ],
            [
                15988,
                15993
            ],
            [
                15993,
                16098
            ],
            [
                16098,
                16222
            ],
            [
                16222,
                16231
            ],
            [
                16231,
                16349
            ],
            [
                16349,
                16400
            ],
            [
                16400,
                16445
            ],
            [
                16445,
                16466
            ],
            [
                16466,
                16480
            ],
            [
                16480,
                16501
            ],
            [
                16501,
                16524
            ],
            [
                16524,
                16537
            ],
            [
                16537,
                16614
            ],
            [
                16614,
                16632
            ],
            [
                16632,
                16749
            ],
            [
                16749,
                16911
            ],
            [
                16911,
                16935
            ],
            [
                16935,
                16954
            ],
            [
                16954,
                16981
            ],
            [
                16981,
                17066
            ],
            [
                17066,
                17225
            ],
            [
                17225,
                17380
            ],
            [
                17380,
                17626
            ],
            [
                17626,
                17699
            ],
            [
                17699,
                17753
            ],
            [
                17753,
                17778
            ],
            [
                17778,
                17838
            ],
            [
                17838,
                17871
            ],
            [
                17871,
                17919
            ],
            [
                17919,
                17946
            ],
            [
                17946,
                17992
            ],
            [
                17992,
                18170
            ],
            [
                18170,
                18248
            ],
            [
                18248,
                18383
            ],
            [
                18383,
                18448
            ],
            [
                18448,
                18495
            ],
            [
                18495,
                18682
            ],
            [
                18682,
                18935
            ],
            [
                18935,
                18960
            ],
            [
                18960,
                18996
            ],
            [
                18996,
                19033
            ],
            [
                19033,
                19243
            ],
            [
                19243,
                19347
            ],
            [
                19347,
                19497
            ],
            [
                19497,
                19643
            ],
            [
                19643,
                19995
            ],
            [
                19995,
                20118
            ],
            [
                20118,
                20202
            ],
            [
                20202,
                20288
            ],
            [
                20288,
                20436
            ],
            [
                20436,
                20498
            ],
            [
                20498,
                20650
            ],
            [
                20650,
                20712
            ],
            [
                20712,
                20786
            ],
            [
                20786,
                20951
            ],
            [
                20951,
                20985
            ],
            [
                20985,
                21014
            ],
            [
                21014,
                21066
            ],
            [
                21066,
                21143
            ],
            [
                21143,
                21201
            ],
            [
                21201,
                21337
            ],
            [
                21337,
                21348
            ],
            [
                21348,
                21554
            ],
            [
                21554,
                21574
            ],
            [
                21574,
                21622
            ],
            [
                21622,
                21631
            ],
            [
                21631,
                21806
            ],
            [
                21806,
                21856
            ],
            [
                21856,
                22020
            ],
            [
                22020,
                22070
            ],
            [
                22070,
                22118
            ],
            [
                22118,
                22324
            ],
            [
                22324,
                22419
            ],
            [
                22419,
                22474
            ],
            [
                22474,
                22564
            ],
            [
                22564,
                22589
            ],
            [
                22589,
                22779
            ],
            [
                22779,
                22809
            ],
            [
                22809,
                22867
            ],
            [
                22867,
                22941
            ],
            [
                22941,
                22996
            ],
            [
                22996,
                23084
            ],
            [
                23084,
                23183
            ],
            [
                23183,
                23215
            ],
            [
                23215,
                23256
            ],
            [
                23256,
                23286
            ],
            [
                23286,
                23345
            ],
            [
                23345,
                23371
            ],
            [
                23371,
                23390
            ],
            [
                23390,
                23429
            ],
            [
                23429,
                23483
            ],
            [
                23483,
                23599
            ],
            [
                23599,
                23725
            ],
            [
                23725,
                23756
            ],
            [
                23756,
                23790
            ],
            [
                23790,
                23821
            ]
        ]
    },
    "abridged": {
        "text": "Only two days later, at breakfast time, Mr. Woodcourt came in haste with the astounding news that a terrible murder had been committed for which Mr. George was in custody. When he told us that a large reward was offered by Sir Leicester Dedlock for the murderer's apprehension, I did not understand why; but a few more words explained to me that the murdered person was Sir Leicester's lawyer, and immediately my mother's dread of him rushed into my remembrance.\nThis unforeseen and violent removal of one whom she had long distrusted, dreading him as a dangerous and secret enemy, appeared so awful that my first thoughts were of her. How appalling to hear of such a death and be able to feel no pity! How dreadful to remember, perhaps, that she had sometimes even wished the old man away!\nSuch crowding reflections made me so distressed and agitated that I could scarcely keep my place at the table. I was quite unable to follow the conversation until I had had a little time to recover. But when I came to myself and found that they were earnestly speaking of the suspected man, recalling our favourable impressions of him, my interest and my fears were strongly aroused in his behalf.\n\"Guardian, you don't think it possible that Mr. George is guilty?\"\n\"My dear, I can't think so. This man whom we have seen so open-hearted and compassionate, who with the might of a giant has the gentleness of a child, this man guilty of such a crime? I can't believe it!\"\n\"And I can't,\" said Mr. Woodcourt. \"Still, some appearances are against him. He bore an animosity towards the deceased gentleman. He has openly mentioned it in many places. He is said to have expressed himself violently towards him. He admits that he was alone on the scene of the murder within a few minutes of its commission. I sincerely believe him to be innocent, but these are all reasons for suspicion falling upon him.\"\n\"True,\" said my guardian.\nI felt, of course, that we must admit the full force of the circumstances against him. Yet I knew (I could not help saying) that their weight would not induce us to desert him in his need.\n\"Heaven forbid!\" returned my guardian. \"We will stand by him, as he himself stood by the two poor creatures who are gone.\" He meant Mr. Gridley and the boy, to both of whom Mr. George had given shelter.\nMr. Woodcourt then told us that the trooper's man Phil Squod had been with him before day, after wandering about the streets all night like a distracted creature; and that the trooper was anxious that we should not suppose him guilty. Mr. Woodcourt had promised to come to our house very early in the morning; he added that he was now upon his way to see Mr. George in prison.\nMy guardian said directly he would go too. Now, besides my liking for the retired soldier, I had that secret interest in what had happened. I felt as if it came near to me. It seemed to become personally important to me that the truth should be discovered and that no innocent people should be suspected.\nIn a word, I felt as if it were my duty to go with them. My guardian did not seek to dissuade me, and I went.\nIt was a large prison with many identical courts and passages, and with no weed or blade of grass. In an arched room by himself, like a cellar upstairs, with massive iron window-bars and a black iron-bound door, we found the trooper.\nWhen he saw us, he stepped forward with his usual heavy tread, and made a slight bow. But I advanced, putting out my hand to him.\n\"This is a load off my mind, I do assure you, miss and gentlemen,\" said he, saluting us and drawing a long breath. \"This is an even rougher place than my gallery to receive a lady, but I know Miss Summerson will make the best of it.\"\nI sat down on the bench, which seemed to give him great satisfaction.\n\"Now, George,\" observed my guardian, \"we require no new assurances on your part.\"\n\"Thank you, sir, with all my heart. If I was not innocent of this crime, I couldn't look at you and keep my secret to myself. I feel your visit very deeply.\"\nHe laid his hand on his broad chest and bent his head, expressing a great amount of natural emotion by these simple means.\n\"First,\" said my guardian, \"is there anything we can do for your personal comfort, George?\"\n\"Well, sir,\" replied George, thinking, \"I am obliged to you, but since tobacco is against the rules, I can't say that there is.\"\n\"If you think of anything, George, let us know.\"\n\"Thank you, sir. Howsoever,\" observed Mr. George with one of his sunburnt smiles, \"a man who has been knocking about the world in a vagabond way as long as I have gets on well enough in a place like this.\"\n\"Next, as to your case,\" observed my guardian. \"How does it stand now?\"\n\"Why, sir, it is under remand at present. Bucket tells me that he will probably apply for a series of remands until the case is more complete. How it is to be made more complete I don't see, but I dare say Bucket will manage it somehow.\"\n\"Why, heaven save us, man,\" exclaimed my guardian, \"you talk as if you were somebody else!\"\n\"No offence, sir,\" said Mr. George. \"But I don't see how an innocent man is to cope with this kind of thing without knocking his head against the walls, unless he takes that point of view.\"\n\"True enough,\" returned my guardian. \"But even an innocent man must defend himself.\"\n\"Certainly, sir. And I have done so. I have stated my innocence to the magistrates, and have said I know nothing about it. What more can I do? It's the truth.\"\n\"But the mere truth won't do,\" rejoined my guardian. \"You must have a lawyer. We must engage a good one for you.\"\n\"I ask your pardon, sir,\" said Mr. George with a step backward. \"I am obliged. But I must decidedly beg to be excused from anything of that sort.\"\n\"You won't have a lawyer?\"\n\"No, sir.\"\n\"Why not?\"\n\"I don't take kindly to the breed,\" said Mr. George. \"Gridley didn't. I object to the breed, sir.\"\nIt was in vain that we all three endeavoured to persuade him; he listened with that gentleness which went so well with his bluff bearing, but was unshaken by our arguments.\n\"You see,\" he said, \"I have been handcuffed and brought here. I am a marked and disgraced man. My shooting gallery is rummaged, high and low, by Bucket; such property as I have is turned this way and that; and here I am! I don't particular complain of that. Though it is through no immediate fault of mine, I can understand that if I hadn't gone into the vagabond way in my youth, this wouldn't have happened. It has happened: then comes the question how to meet it.\"\nHe rubbed his forehead for a moment and thought a bit; then he resumed.\n\"Now, the unfortunate deceased was himself a lawyer and had a pretty tight hold of me. I don't wish to rake up his ashes, but he had a devil of a tight hold of me. I don't like his trade the better for that. But suppose I had killed him. with one of those pistols that Bucket has found at my place, which have always been there. What should I have done as soon as I was here? Got a lawyer.\"\nHe stopped on hearing someone at the locks and bolts and did not resume until the door had been opened and was shut again. For what purpose opened, I will mention presently.\n\"Say I am innocent and I get a lawyer. He would be as likely to believe me guilty as not. What would he do? Act as if I was - shut my mouth, tell me not to commit myself, and get me off perhaps! But, Miss Summerson, I would rather be hanged! I must come off clear and full or not at all. If they can't make me innocent out of the whole truth, they are not likely to do it out of anything less. And if they are, it's worth nothing to me.\"\nHe paced back to the table and finished his speech.\n\"I thank you, miss and gentlemen both, for your attention. I have a blunt broadsword kind of a mind, and have never done well in life beyond my duty as a soldier; and if the worst comes after all, I shall reap pretty much as I have sown. No relations will be disgraced by me or made unhappy for me, and - and that's all I've got to say.\"\nThe door had been opened to admit another soldierly-looking man and a weather-tanned, bright-eyed wholesome woman with a basket, who had been exceedingly attentive to all Mr. George had said. Mr. George had received them with a familiar nod and a friendly look. He now shook them cordially by the hand and said, \"Miss Summerson and gentlemen, this is an old comrade of mine, Matthew Bagnet, and his wife, Mrs. Bagnet.\"\nMr. Bagnet made us a stiff military bow, and Mrs. Bagnet dropped us a curtsy.\n\"Real good friends of mine, they are,\" said Mr. George. \"It was at their house I was taken.\"\n\"With a second-hand cello,\" Mr. Bagnet put in, twitching his head angrily.\n\"Mat,\" said Mr. George, \"you have heard pretty well all I have been saying. I know it meets your approval?\"\n\"Old girl,\" said Mr. Bagnet, \"Tell him. Whether or not. It meets my approval.\"\n\"Why, George,\" exclaimed Mrs. Bagnet, who had been unpacking her basket, in which there was a piece of cold pickled pork, a little tea and sugar, and a brown loaf, \"you ought to know it don't. You ought to know it's enough to drive a person wild to hear you. You won't be got off this way, or that way? It's stuff and nonsense, George. Why, you should have a dozen lawyers if the gentleman recommended them to you.\"\n\"This is a very sensible woman,\" said my guardian. \"I hope you will persuade him, Mrs. Bagnet.\"\n\"Persuade him, sir?\" she returned. \"Lord bless you, no. You don't know George. As self-willed and as determined a man, in the wrong way, as ever put a human creature under heaven out of patience! Don't I know you, George! You don't mean to set up for a new character with me after all these years, I hope?\"\nAt her friendly indignation, her husband shook his head at the trooper as a silent recommendation to him to yield. Mrs. Bagnet looked at me; and I understood from the play of her eyes that she wished me to do something, though I did not comprehend what.\n\"But I have given up talking to you, old fellow,\" said Mrs. Bagnet, looking at me again; \"and when ladies and gentlemen know you as well as I do, they'll give up talking to you too. If you are not too headstrong to accept a bit of dinner, here it is.\"\n\"I accept it with thanks,\" returned the trooper.\n\"Do you indeed?\" said Mrs. Bagnet. \"I wonder you don't starve in your own way also. It would be like you.\" Here she again looked at me, and I now perceived from her glances at the door that she wished us to retire and to wait for her outside the prison. Communicating this by similar means to my guardian and Mr. Woodcourt, I rose.\n\"We hope you will think better of it, Mr. George,\" said I, \"and we shall come to see you again, trusting to find you more persuadable. And please to consider that the clearing up of this mystery and the discovery of the real criminal may be of great importance to others besides yourself.\"\nHe heard me respectfully but without much heeding these words, which I spoke as I was already on my way to the door. He was observing my height and figure, which seemed to catch his attention.\n\"'Tis curious,\" said he. \"And yet I thought so at the time!\"\nMy guardian asked him what he meant.\n\"Why, sir,\" he answered, \"when my ill fortune took me to the dead man's staircase on the night of his murder, I saw a shape so like Miss Summerson's go by me in the dark that I had half a mind to speak to it.\"\nFor an instant I felt such a shudder as I never felt before or since and hope I shall never feel again.\n\"It came downstairs as I went up,\" said the trooper, \"and crossed the moonlighted window with a black fringed mantle on. Miss Summerson looked so like it that it came into my head.\"\nI cannot define the feelings that arose in me after this; but my determination to follow the investigation increased, and I was indignantly sure of there being no possible reason for my being afraid.\nWe three went out of the prison and walked up and down a short distance from the gate. Soon Mr. and Mrs. Bagnet came out and joined us.\nThere were tears in Mrs. Bagnet's eyes, and her face was flushed.\n\"I didn't let George see what I thought about it, you know, miss,\" she said when she came up, \"but he's in a bad way, poor old fellow!\"\n\"Not with care and prudence and good help,\" said my guardian.\n\"A gentleman like you ought to know best, sir,\" returned Mrs. Bagnet, hurriedly drying her eyes, \"but I am uneasy for him. He has been so careless and said so much that he never meant. The gentlemen of the juries might not understand him as Lignum and me do. And then so many circumstances have happened bad for him, and so many people will be brought forward to speak against him, and Bucket is so deep. Just come into the corner and I'll tell you!\"\nMrs. Bagnet hurried us into a secluded corner. \"You could as soon move Dover Castle as move George on this point, miss, unless you had got a new power to move him with. And I have got it!\"\n\"You are a jewel of a woman,\" said my guardian. \"Go on!\"\n\"Now, what he says concerning no relations is all bosh. They don't know of him, but he does know of them. He once spoke to my Woolwich about whitening and wrinkling mothers' heads. For fifty pounds he had seen his mother that day. She's alive and must be brought here straight! Lignum, you take care of the children, and give me the umbrella! I'm away to Lincolnshire to bring that old lady here.\"\n\"But, bless the woman,\" cried my guardian, \"how is she going? What money has she got?\"\nMrs. Bagnet brought forth a leather purse in which she hastily counted a few shillings.\n\"I'm a soldier's wife and accustomed to travel my own way. Lignum, old boy,\" kissing him, \"one for yourself, three for the children. Now I'm away into Lincolnshire after George's mother!\"\nAnd she actually set off while we three stood looking at one another in amazement. She trudged away in her grey cloak at a sturdy pace, turned the corner, and was gone.\n\"Mr. Bagnet,\" said my guardian. \"Do you mean to let her go in that way?\"\n\"Can't help it,\" he returned. \"Made her way home once from another quarter of the world. With the same grey cloak. And same umbrella. Whatever the old girl says, do it! Whenever the old girl says, I'll do it, she does it.\"\n\"Then she is as honest as she looks,\" rejoined my guardian.\n\"She's Colour-Sergeant of the Nonpareil battalion,\" said Mr. Bagnet. \"And there's not such another. But I never own to it before her. Discipline must be maintained.\"",
        "paragraph_chars": [
            [
                0,
                463
            ],
            [
                463,
                791
            ],
            [
                791,
                1189
            ],
            [
                1189,
                1256
            ],
            [
                1256,
                1461
            ],
            [
                1461,
                1888
            ],
            [
                1888,
                1914
            ],
            [
                1914,
                2103
            ],
            [
                2103,
                2306
            ],
            [
                2306,
                2683
            ],
            [
                2683,
                2988
            ],
            [
                2988,
                3098
            ],
            [
                3098,
                3332
            ],
            [
                3332,
                3462
            ],
            [
                3462,
                3696
            ],
            [
                3696,
                3766
            ],
            [
                3766,
                3848
            ],
            [
                3848,
                4006
            ],
            [
                4006,
                4129
            ],
            [
                4129,
                4221
            ],
            [
                4221,
                4350
            ],
            [
                4350,
                4399
            ],
            [
                4399,
                4605
            ],
            [
                4605,
                4677
            ],
            [
                4677,
                4915
            ],
            [
                4915,
                5007
            ],
            [
                5007,
                5197
            ],
            [
                5197,
                5282
            ],
            [
                5282,
                5442
            ],
            [
                5442,
                5556
            ],
            [
                5556,
                5703
            ],
            [
                5703,
                5730
            ],
            [
                5730,
                5741
            ],
            [
                5741,
                5752
            ],
            [
                5752,
                5851
            ],
            [
                5851,
                6024
            ],
            [
                6024,
                6492
            ],
            [
                6492,
                6564
            ],
            [
                6564,
                6955
            ],
            [
                6955,
                7129
            ],
            [
                7129,
                7567
            ],
            [
                7567,
                7619
            ],
            [
                7619,
                7957
            ],
            [
                7957,
                8376
            ],
            [
                8376,
                8454
            ],
            [
                8454,
                8547
            ],
            [
                8547,
                8622
            ],
            [
                8622,
                8730
            ],
            [
                8730,
                8809
            ],
            [
                8809,
                9225
            ],
            [
                9225,
                9321
            ],
            [
                9321,
                9628
            ],
            [
                9628,
                9882
            ],
            [
                9882,
                10134
            ],
            [
                10134,
                10183
            ],
            [
                10183,
                10515
            ],
            [
                10515,
                10805
            ],
            [
                10805,
                10998
            ],
            [
                10998,
                11059
            ],
            [
                11059,
                11096
            ],
            [
                11096,
                11306
            ],
            [
                11306,
                11410
            ],
            [
                11410,
                11592
            ],
            [
                11592,
                11792
            ],
            [
                11792,
                11928
            ],
            [
                11928,
                11994
            ],
            [
                11994,
                12130
            ],
            [
                12130,
                12192
            ],
            [
                12192,
                12643
            ],
            [
                12643,
                12832
            ],
            [
                12832,
                12889
            ],
            [
                12889,
                13287
            ],
            [
                13287,
                13374
            ],
            [
                13374,
                13462
            ],
            [
                13462,
                13650
            ],
            [
                13650,
                13819
            ],
            [
                13819,
                13892
            ],
            [
                13892,
                14115
            ],
            [
                14115,
                14175
            ],
            [
                14175,
                14340
            ]
        ],
        "segment_chars": [
            [
                0,
                172
            ],
            [
                172,
                463
            ],
            [
                463,
                636
            ],
            [
                636,
                703
            ],
            [
                703,
                791
            ],
            [
                791,
                902
            ],
            [
                902,
                990
            ],
            [
                990,
                1189
            ],
            [
                1189,
                1256
            ],
            [
                1256,
                1284
            ],
            [
                1284,
                1440
            ],
            [
                1440,
                1461
            ],
            [
                1461,
                1496
            ],
            [
                1496,
                1538
            ],
            [
                1538,
                1591
            ],
            [
                1591,
                1634
            ],
            [
                1634,
                1694
            ],
            [
                1694,
                1789
            ],
            [
                1789,
                1888
            ],
            [
                1888,
                1914
            ],
            [
                1914,
                2001
            ],
            [
                2001,
                2103
            ],
            [
                2103,
                2120
            ],
            [
                2120,
                2142
            ],
            [
                2142,
                2226
            ],
            [
                2226,
                2306
            ],
            [
                2306,
                2541
            ],
            [
                2541,
                2683
            ],
            [
                2683,
                2726
            ],
            [
                2726,
                2823
            ],
            [
                2823,
                2856
            ],
            [
                2856,
                2988
            ],
            [
                2988,
                3045
            ],
            [
                3045,
                3098
            ],
            [
                3098,
                3197
            ],
            [
                3197,
                3332
            ],
            [
                3332,
                3418
            ],
            [
                3418,
                3462
            ],
            [
                3462,
                3577
            ],
            [
                3577,
                3696
            ],
            [
                3696,
                3766
            ],
            [
                3766,
                3848
            ],
            [
                3848,
                3884
            ],
            [
                3884,
                3974
            ],
            [
                3974,
                4006
            ],
            [
                4006,
                4129
            ],
            [
                4129,
                4221
            ],
            [
                4221,
                4350
            ],
            [
                4350,
                4399
            ],
            [
                4399,
                4416
            ],
            [
                4416,
                4605
            ],
            [
                4605,
                4652
            ],
            [
                4652,
                4677
            ],
            [
                4677,
                4719
            ],
            [
                4719,
                4820
            ],
            [
                4820,
                4915
            ],
            [
                4915,
                5007
            ],
            [
                5007,
                5043
            ],
            [
                5043,
                5197
            ],
            [
                5197,
                5234
            ],
            [
                5234,
                5282
            ],
            [
                5282,
                5299
            ],
            [
                5299,
                5319
            ],
            [
                5319,
                5405
            ],
            [
                5405,
                5425
            ],
            [
                5425,
                5442
            ],
            [
                5442,
                5495
            ],
            [
                5495,
                5520
            ],
            [
                5520,
                5556
            ],
            [
                5556,
                5620
            ],
            [
                5620,
                5635
            ],
            [
                5635,
                5703
            ],
            [
                5703,
                5730
            ],
            [
                5730,
                5741
            ],
            [
                5741,
                5752
            ],
            [
                5752,
                5805
            ],
            [
                5805,
                5822
            ],
            [
                5822,
                5851
            ],
            [
                5851,
                6024
            ],
            [
                6024,
                6086
            ],
            [
                6086,
                6119
            ],
            [
                6119,
                6245
            ],
            [
                6245,
                6282
            ],
            [
                6282,
                6434
            ],
            [
                6434,
                6492
            ],
            [
                6492,
                6564
            ],
            [
                6564,
                6651
            ],
            [
                6651,
                6728
            ],
            [
                6728,
                6772
            ],
            [
                6772,
                6802
            ],
            [
                6802,
                6893
            ],
            [
                6893,
                6940
            ],
            [
                6940,
                6955
            ],
            [
                6955,
                7078
            ],
            [
                7078,
                7129
            ],
            [
                7129,
                7168
            ],
            [
                7168,
                7219
            ],
            [
                7219,
                7237
            ],
            [
                7237,
                7324
            ],
            [
                7324,
                7371
            ],
            [
                7371,
                7417
            ],
            [
                7417,
                7523
            ],
            [
                7523,
                7567
            ],
            [
                7567,
                7619
            ],
            [
                7619,
                7678
            ],
            [
                7678,
                7857
            ],
            [
                7857,
                7957
            ],
            [
                7957,
                8149
            ],
            [
                8149,
                8219
            ],
            [
                8219,
                8376
            ],
            [
                8376,
                8454
            ],
            [
                8454,
                8510
            ],
            [
                8510,
                8547
            ],
            [
                8547,
                8622
            ],
            [
                8622,
                8698
            ],
            [
                8698,
                8730
            ],
            [
                8730,
                8770
            ],
            [
                8770,
                8786
            ],
            [
                8786,
                8809
            ],
            [
                8809,
                9002
            ],
            [
                9002,
                9068
            ],
            [
                9068,
                9112
            ],
            [
                9112,
                9145
            ],
            [
                9145,
                9225
            ],
            [
                9225,
                9276
            ],
            [
                9276,
                9321
            ],
            [
                9321,
                9342
            ],
            [
                9342,
                9356
            ],
            [
                9356,
                9377
            ],
            [
                9377,
                9400
            ],
            [
                9400,
                9517
            ],
            [
                9517,
                9543
            ],
            [
                9543,
                9628
            ],
            [
                9628,
                9743
            ],
            [
                9743,
                9882
            ],
            [
                9882,
                10064
            ],
            [
                10064,
                10134
            ],
            [
                10134,
                10183
            ],
            [
                10183,
                10200
            ],
            [
                10200,
                10218
            ],
            [
                10218,
                10267
            ],
            [
                10267,
                10290
            ],
            [
                10290,
                10437
            ],
            [
                10437,
                10515
            ],
            [
                10515,
                10650
            ],
            [
                10650,
                10805
            ],
            [
                10805,
                10922
            ],
            [
                10922,
                10998
            ],
            [
                10998,
                11023
            ],
            [
                11023,
                11059
            ],
            [
                11059,
                11096
            ],
            [
                11096,
                11306
            ],
            [
                11306,
                11410
            ],
            [
                11410,
                11531
            ],
            [
                11531,
                11592
            ],
            [
                11592,
                11792
            ],
            [
                11792,
                11879
            ],
            [
                11879,
                11928
            ],
            [
                11928,
                11994
            ],
            [
                11994,
                12130
            ],
            [
                12130,
                12192
            ],
            [
                12192,
                12315
            ],
            [
                12315,
                12377
            ],
            [
                12377,
                12451
            ],
            [
                12451,
                12597
            ],
            [
                12597,
                12643
            ],
            [
                12643,
                12690
            ],
            [
                12690,
                12812
            ],
            [
                12812,
                12832
            ],
            [
                12832,
                12880
            ],
            [
                12880,
                12889
            ],
            [
                12889,
                12945
            ],
            [
                12945,
                12995
            ],
            [
                12995,
                13070
            ],
            [
                13070,
                13120
            ],
            [
                13120,
                13167
            ],
            [
                13167,
                13232
            ],
            [
                13232,
                13287
            ],
            [
                13287,
                13349
            ],
            [
                13349,
                13374
            ],
            [
                13374,
                13462
            ],
            [
                13462,
                13521
            ],
            [
                13521,
                13595
            ],
            [
                13595,
                13650
            ],
            [
                13650,
                13733
            ],
            [
                13733,
                13819
            ],
            [
                13819,
                13851
            ],
            [
                13851,
                13892
            ],
            [
                13892,
                13922
            ],
            [
                13922,
                13981
            ],
            [
                13981,
                14007
            ],
            [
                14007,
                14026
            ],
            [
                14026,
                14061
            ],
            [
                14061,
                14115
            ],
            [
                14115,
                14175
            ],
            [
                14175,
                14244
            ],
            [
                14244,
                14275
            ],
            [
                14275,
                14309
            ],
            [
                14309,
                14340
            ]
        ],
        "overlap_chars": [
            [
                19,
                20
            ],
            [
                24,
                33
            ],
            [
                38,
                155
            ],
            [
                156,
                172
            ],
            [
                172,
                287
            ],
            [
                288,
                463
            ],
            [
                463,
                523
            ],
            [
                524,
                534
            ],
            [
                534,
                535
            ],
            [
                536,
                544
            ],
            [
                545,
                548
            ],
            [
                552,
                636
            ],
            [
                636,
                703
            ],
            [
                703,
                789
            ],
            [
                789,
                791
            ],
            [
                791,
                816
            ],
            [
                817,
                827
            ],
            [
                839,
                842
            ],
            [
                843,
                873
            ],
            [
                879,
                902
            ],
            [
                902,
                990
            ],
            [
                990,
                1015
            ],
            [
                1016,
                1080
            ],
            [
                1082,
                1091
            ],
            [
                1096,
                1106
            ],
            [
                1119,
                1156
            ],
            [
                1157,
                1187
            ],
            [
                1187,
                1189
            ],
            [
                1189,
                1232
            ],
            [
                1244,
                1246
            ],
            [
                1253,
                1256
            ],
            [
                1256,
                1284
            ],
            [
                1284,
                1406
            ],
            [
                1407,
                1415
            ],
            [
                1423,
                1440
            ],
            [
                1440,
                1458
            ],
            [
                1461,
                1496
            ],
            [
                1496,
                1503
            ],
            [
                1504,
                1538
            ],
            [
                1538,
                1591
            ],
            [
                1591,
                1634
            ],
            [
                1634,
                1692
            ],
            [
                1692,
                1694
            ],
            [
                1694,
                1789
            ],
            [
                1789,
                1818
            ],
            [
                1819,
                1827
            ],
            [
                1827,
                1888
            ],
            [
                1888,
                1913
            ],
            [
                1914,
                1951
            ],
            [
                1952,
                2001
            ],
            [
                2001,
                2011
            ],
            [
                2012,
                2103
            ],
            [
                2103,
                2120
            ],
            [
                2120,
                2142
            ],
            [
                2142,
                2226
            ],
            [
                2226,
                2306
            ],
            [
                2306,
                2355
            ],
            [
                2367,
                2467
            ],
            [
                2473,
                2477
            ],
            [
                2478,
                2489
            ],
            [
                2490,
                2493
            ],
            [
                2502,
                2541
            ],
            [
                2543,
                2558
            ],
            [
                2568,
                2614
            ],
            [
                2616,
                2660
            ],
            [
                2661,
                2663
            ],
            [
                2663,
                2664
            ],
            [
                2681,
                2683
            ],
            [
                2683,
                2726
            ],
            [
                2726,
                2738
            ],
            [
                2739,
                2741
            ],
            [
                2753,
                2772
            ],
            [
                2772,
                2821
            ],
            [
                2821,
                2823
            ],
            [
                2823,
                2843
            ],
            [
                2844,
                2856
            ],
            [
                2856,
                2899
            ],
            [
                2903,
                2986
            ],
            [
                2986,
                2988
            ],
            [
                2988,
                3027
            ],
            [
                3028,
                3045
            ],
            [
                3045,
                3098
            ],
            [
                3098,
                3129
            ],
            [
                3140,
                3159
            ],
            [
                3159,
                3160
            ],
            [
                3161,
                3164
            ],
            [
                3173,
                3180
            ],
            [
                3181,
                3197
            ],
            [
                3197,
                3255
            ],
            [
                3256,
                3284
            ],
            [
                3285,
                3286
            ],
            [
                3287,
                3292
            ],
            [
                3293,
                3308
            ],
            [
                3308,
                3330
            ],
            [
                3330,
                3331
            ],
            [
                3332,
                3350
            ],
            [
                3359,
                3366
            ],
            [
                3367,
                3398
            ],
            [
                3399,
                3418
            ],
            [
                3418,
                3421
            ],
            [
                3422,
                3423
            ],
            [
                3424,
                3460
            ],
            [
                3460,
                3462
            ],
            [
                3462,
                3549
            ],
            [
                3550,
                3577
            ],
            [
                3577,
                3585
            ],
            [
                3589,
                3593
            ],
            [
                3594,
                3641
            ],
            [
                3641,
                3642
            ],
            [
                3643,
                3695
            ],
            [
                3696,
                3706
            ],
            [
                3707,
                3709
            ],
            [
                3710,
                3719
            ],
            [
                3719,
                3766
            ],
            [
                3766,
                3804
            ],
            [
                3804,
                3845
            ],
            [
                3845,
                3848
            ],
            [
                3849,
                3858
            ],
            [
                3865,
                3884
            ],
            [
                3884,
                3972
            ],
            [
                3972,
                3974
            ],
            [
                3974,
                3980
            ],
            [
                3986,
                3996
            ],
            [
                4006,
                4022
            ],
            [
                4023,
                4059
            ],
            [
                4059,
                4060
            ],
            [
                4072,
                4129
            ],
            [
                4129,
                4157
            ],
            [
                4166,
                4174
            ],
            [
                4175,
                4177
            ],
            [
                4178,
                4181
            ],
            [
                4182,
                4184
            ],
            [
                4185,
                4221
            ],
            [
                4221,
                4249
            ],
            [
                4258,
                4265
            ],
            [
                4266,
                4285
            ],
            [
                4292,
                4299
            ],
            [
                4303,
                4350
            ],
            [
                4350,
                4351
            ],
            [
                4354,
                4357
            ],
            [
                4358,
                4366
            ],
            [
                4375,
                4399
            ],
            [
                4399,
                4416
            ],
            [
                4416,
                4539
            ],
            [
                4540,
                4597
            ],
            [
                4602,
                4605
            ],
            [
                4605,
                4651
            ],
            [
                4652,
                4677
            ],
            [
                4677,
                4719
            ],
            [
                4719,
                4725
            ],
            [
                4732,
                4734
            ],
            [
                4735,
                4786
            ],
            [
                4787,
                4820
            ],
            [
                4820,
                4862
            ],
            [
                4863,
                4915
            ],
            [
                4915,
                4965
            ],
            [
                4966,
                4975
            ],
            [
                4976,
                5007
            ],
            [
                5007,
                5043
            ],
            [
                5044,
                5085
            ],
            [
                5096,
                5158
            ],
            [
                5160,
                5175
            ],
            [
                5176,
                5194
            ],
            [
                5197,
                5198
            ],
            [
                5198,
                5209
            ],
            [
                5209,
                5232
            ],
            [
                5232,
                5234
            ],
            [
                5234,
                5238
            ],
            [
                5239,
                5264
            ],
            [
                5265,
                5282
            ],
            [
                5282,
                5299
            ],
            [
                5299,
                5319
            ],
            [
                5319,
                5332
            ],
            [
                5346,
                5365
            ],
            [
                5380,
                5386
            ],
            [
                5395,
                5403
            ],
            [
                5405,
                5425
            ],
            [
                5425,
                5442
            ],
            [
                5442,
                5494
            ],
            [
                5495,
                5518
            ],
            [
                5518,
                5520
            ],
            [
                5520,
                5556
            ],
            [
                5556,
                5620
            ],
            [
                5620,
                5625
            ],
            [
                5626,
                5635
            ],
            [
                5635,
                5703
            ],
            [
                5703,
                5730
            ],
            [
                5730,
                5740
            ],
            [
                5741,
                5752
            ],
            [
                5752,
                5805
            ],
            [
                5805,
                5822
            ],
            [
                5822,
                5843
            ],
            [
                5843,
                5844
            ],
            [
                5848,
                5851
            ],
            [
                5851,
                5883
            ],
            [
                5884,
                5996
            ],
            [
                6006,
                6012
            ],
            [
                6022,
                6024
            ],
            [
                6024,
                6032
            ],
            [
                6042,
                6043
            ],
            [
                6045,
                6071
            ],
            [
                6072,
                6086
            ],
            [
                6086,
                6117
            ],
            [
                6117,
                6119
            ],
            [
                6119,
                6200
            ],
            [
                6201,
                6228
            ],
            [
                6228,
                6233
            ],
            [
                6234,
                6245
            ],
            [
                6245,
                6282
            ],
            [
                6282,
                6288
            ],
            [
                6295,
                6305
            ],
            [
                6316,
                6336
            ],
            [
                6337,
                6434
            ],
            [
                6434,
                6449
            ],
            [
                6451,
                6492
            ],
            [
                6492,
                6505
            ],
            [
                6506,
                6527
            ],
            [
                6528,
                6531
            ],
            [
                6532,
                6545
            ],
            [
                6552,
                6554
            ],
            [
                6555,
                6564
            ],
            [
                6565,
                6651
            ],
            [
                6651,
                6696
            ],
            [
                6697,
                6728
            ],
            [
                6728,
                6772
            ],
            [
                6772,
                6775
            ],
            [
                6776,
                6802
            ],
            [
                6807,
                6827
            ],
            [
                6828,
                6862
            ],
            [
                6869,
                6873
            ],
            [
                6881,
                6885
            ],
            [
                6886,
                6891
            ],
            [
                6891,
                6893
            ],
            [
                6893,
                6933
            ],
            [
                6934,
                6940
            ],
            [
                6940,
                6955
            ],
            [
                6955,
                6976
            ],
            [
                6985,
                7078
            ],
            [
                7078,
                7129
            ],
            [
                7130,
                7168
            ],
            [
                7168,
                7217
            ],
            [
                7217,
                7219
            ],
            [
                7219,
                7235
            ],
            [
                7235,
                7237
            ],
            [
                7237,
                7252
            ],
            [
                7255,
                7268
            ],
            [
                7268,
                7299
            ],
            [
                7300,
                7324
            ],
            [
                7324,
                7344
            ],
            [
                7345,
                7346
            ],
            [
                7347,
                7352
            ],
            [
                7353,
                7369
            ],
            [
                7371,
                7417
            ],
            [
                7417,
                7521
            ],
            [
                7521,
                7523
            ],
            [
                7523,
                7567
            ],
            [
                7567,
                7569
            ],
            [
                7576,
                7606
            ],
            [
                7617,
                7619
            ],
            [
                7619,
                7657
            ],
            [
                7658,
                7676
            ],
            [
                7676,
                7678
            ],
            [
                7678,
                7679
            ],
            [
                7685,
                7718
            ],
            [
                7718,
                7719
            ],
            [
                7724,
                7780
            ],
            [
                7782,
                7857
            ],
            [
                7857,
                7921
            ],
            [
                7924,
                7957
            ],
            [
                7957,
                8006
            ],
            [
                8008,
                8020
            ],
            [
                8021,
                8089
            ],
            [
                8090,
                8149
            ],
            [
                8149,
                8217
            ],
            [
                8217,
                8219
            ],
            [
                8219,
                8346
            ],
            [
                8348,
                8351
            ],
            [
                8352,
                8376
            ],
            [
                8376,
                8454
            ],
            [
                8454,
                8492
            ],
            [
                8498,
                8510
            ],
            [
                8510,
                8547
            ],
            [
                8547,
                8566
            ],
            [
                8572,
                8621
            ],
            [
                8622,
                8696
            ],
            [
                8696,
                8698
            ],
            [
                8698,
                8730
            ],
            [
                8730,
                8746
            ],
            [
                8749,
                8758
            ],
            [
                8759,
                8770
            ],
            [
                8770,
                8786
            ],
            [
                8786,
                8809
            ],
            [
                8809,
                9002
            ],
            [
                9002,
                9068
            ],
            [
                9068,
                9098
            ],
            [
                9102,
                9110
            ],
            [
                9110,
                9112
            ],
            [
                9112,
                9143
            ],
            [
                9145,
                9149
            ],
            [
                9150,
                9153
            ],
            [
                9154,
                9160
            ],
            [
                9166,
                9225
            ],
            [
                9225,
                9276
            ],
            [
                9276,
                9321
            ],
            [
                9321,
                9342
            ],
            [
                9342,
                9356
            ],
            [
                9356,
                9377
            ],
            [
                9377,
                9400
            ],
            [
                9400,
                9517
            ],
            [
                9517,
                9543
            ],
            [
                9543,
                9628
            ],
            [
                9631,
                9655
            ],
            [
                9655,
                9656
            ],
            [
                9657,
                9668
            ],
            [
                9669,
                9698
            ],
            [
                9699,
                9743
            ],
            [
                9743,
                9882
            ],
            [
                9882,
                9929
            ],
            [
                9929,
                9948
            ],
            [
                9948,
                10064
            ],
            [
                10064,
                10103
            ],
            [
                10104,
                10134
            ],
            [
                10134,
                10151
            ],
            [
                10152,
                10183
            ],
            [
                10183,
                10190
            ],
            [
                10191,
                10200
            ],
            [
                10200,
                10216
            ],
            [
                10216,
                10218
            ],
            [
                10219,
                10267
            ],
            [
                10267,
                10275
            ],
            [
                10276,
                10287
            ],
            [
                10290,
                10367
            ],
            [
                10368,
                10403
            ],
            [
                10413,
                10416
            ],
            [
                10417,
                10437
            ],
            [
                10437,
                10515
            ],
            [
                10515,
                10636
            ],
            [
                10650,
                10653
            ],
            [
                10661,
                10739
            ],
            [
                10749,
                10758
            ],
            [
                10765,
                10805
            ],
            [
                10805,
                10881
            ],
            [
                10891,
                10920
            ],
            [
                10922,
                10938
            ],
            [
                10939,
                10996
            ],
            [
                10996,
                10998
            ],
            [
                10998,
                11023
            ],
            [
                11023,
                11059
            ],
            [
                11059,
                11096
            ],
            [
                11096,
                11306
            ],
            [
                11306,
                11410
            ],
            [
                11410,
                11505
            ],
            [
                11506,
                11511
            ],
            [
                11520,
                11529
            ],
            [
                11529,
                11531
            ],
            [
                11531,
                11563
            ],
            [
                11564,
                11592
            ],
            [
                11592,
                11600
            ],
            [
                11601,
                11649
            ],
            [
                11654,
                11656
            ],
            [
                11671,
                11673
            ],
            [
                11681,
                11698
            ],
            [
                11699,
                11713
            ],
            [
                11714,
                11754
            ],
            [
                11764,
                11792
            ],
            [
                11792,
                11846
            ],
            [
                11847,
                11848
            ],
            [
                11849,
                11877
            ],
            [
                11877,
                11879
            ],
            [
                11884,
                11912
            ],
            [
                11913,
                11916
            ],
            [
                11917,
                11928
            ],
            [
                11928,
                11933
            ],
            [
                11945,
                11947
            ],
            [
                11948,
                11992
            ],
            [
                11992,
                11993
            ],
            [
                11994,
                12060
            ],
            [
                12070,
                12130
            ],
            [
                12130,
                12192
            ],
            [
                12192,
                12287
            ],
            [
                12287,
                12315
            ],
            [
                12315,
                12377
            ],
            [
                12377,
                12451
            ],
            [
                12451,
                12459
            ],
            [
                12468,
                12512
            ],
            [
                12521,
                12595
            ],
            [
                12597,
                12622
            ],
            [
                12623,
                12643
            ],
            [
                12643,
                12672
            ],
            [
                12673,
                12681
            ],
            [
                12688,
                12689
            ],
            [
                12690,
                12755
            ],
            [
                12755,
                12761
            ],
            [
                12761,
                12762
            ],
            [
                12763,
                12812
            ],
            [
                12812,
                12832
            ],
            [
                12832,
                12880
            ],
            [
                12880,
                12889
            ],
            [
                12889,
                12894
            ],
            [
                12895,
                12945
            ],
            [
                12945,
                12995
            ],
            [
                12995,
                13070
            ],
            [
                13070,
                13120
            ],
            [
                13120,
                13165
            ],
            [
                13167,
                13173
            ],
            [
                13173,
                13174
            ],
            [
                13175,
                13204
            ],
            [
                13204,
                13232
            ],
            [
                13232,
                13287
            ],
            [
                13287,
                13328
            ],
            [
                13328,
                13349
            ],
            [
                13349,
                13374
            ],
            [
                13374,
                13385
            ],
            [
                13386,
                13409
            ],
            [
                13410,
                13444
            ],
            [
                13445,
                13460
            ],
            [
                13460,
                13462
            ],
            [
                13463,
                13521
            ],
            [
                13521,
                13595
            ],
            [
                13595,
                13650
            ],
            [
                13650,
                13718
            ],
            [
                13719,
                13733
            ],
            [
                13733,
                13736
            ],
            [
                13737,
                13785
            ],
            [
                13786,
                13819
            ],
            [
                13819,
                13851
            ],
            [
                13851,
                13892
            ],
            [
                13892,
                13922
            ],
            [
                13922,
                13981
            ],
            [
                13981,
                14007
            ],
            [
                14007,
                14026
            ],
            [
                14026,
                14056
            ],
            [
                14057,
                14061
            ],
            [
                14061,
                14099
            ],
            [
                14101,
                14115
            ],
            [
                14115,
                14137
            ],
            [
                14138,
                14173
            ],
            [
                14175,
                14242
            ],
            [
                14242,
                14244
            ],
            [
                14244,
                14275
            ],
            [
                14275,
                14309
            ],
            [
                14309,
                14340
            ]
        ],
        "row_chars": [
            [
                0,
                172
            ],
            [
                172,
                463
            ],
            [
                463,
                636
            ],
            [
                636,
                703
            ],
            [
                703,
                791
            ],
            [
                791,
                902
            ],
            [
                902,
                990
            ],
            [
                990,
                1189
            ],
            [
                1189,
                1256
            ],
            [
                1256,
                1284
            ],
            [
                1284,
                1440
            ],
            [
                1440,
                1461
            ],
            [
                1461,
                1461
            ],
            [
                1461,
                1461
            ],
            [
                1461,
                1496
            ],
            [
                1496,
                1538
            ],
            [
                1538,
                1591
            ],
            [
                1591,
                1634
            ],
            [
                1634,
                1694
            ],
            [
                1694,
                1789
            ],
            [
                1789,
                1888
            ],
            [
                1888,
                1914
            ],
            [
                1914,
                1914
            ],
            [
                1914,
                2001
            ],
            [
                2001,
                2103
            ],
            [
                2103,
                2120
            ],
            [
                2120,
                2142
            ],
            [
                2142,
                2226
            ],
            [
                2226,
                2306
            ],
            [
                2306,
                2541
            ],
            [
                2541,
                2541
            ],
            [
                2541,
                2683
            ],
            [
                2683,
                2726
            ],
            [
                2726,
                2823
            ],
            [
                2823,
                2856
            ],
            [
                2856,
                2988
            ],
            [
                2988,
                3045
            ],
            [
                3045,
                3098
            ],
            [
                3098,
                3197
            ],
            [
                3197,
                3332
            ],
            [
                3332,
                3332
            ],
            [
                3332,
                3418
            ],
            [
                3418,
                3462
            ],
            [
                3462,
                3577
            ],
            [
                3577,
                3577
            ],
            [
                3577,
                3577
            ],
            [
                3577,
                3577
            ],
            [
                3577,
                3696
            ],
            [
                3696,
                3766
            ],
            [
                3766,
                3766
            ],
            [
                3766,
                3848
            ],
            [
                3848,
                3848
            ],
            [
                3848,
                3884
            ],
            [
                3884,
                3974
            ],
            [
                3974,
                4006
            ],
            [
                4006,
                4006
            ],
            [
                4006,
                4129
            ],
            [
                4129,
                4221
            ],
            [
                4221,
                4221
            ],
            [
                4221,
                4221
            ],
            [
                4221,
                4221
            ],
            [
                4221,
                4221
            ],
            [
                4221,
                4350
            ],
            [
                4350,
                4399
            ],
            [
                4399,
                4416
            ],
            [
                4416,
                4605
            ],
            [
                4605,
                4652
            ],
            [
                4652,
                4652
            ],
            [
                4652,
                4677
            ],
            [
                4677,
                4719
            ],
            [
                4719,
                4820
            ],
            [
                4820,
                4915
            ],
            [
                4915,
                5007
            ],
            [
                5007,
                5043
            ],
            [
                5043,
                5043
            ],
            [
                5043,
                5197
            ],
            [
                5197,
                5234
            ],
            [
                5234,
                5282
            ],
            [
                5282,
                5299
            ],
            [
                5299,
                5319
            ],
            [
                5319,
                5405
            ],
            [
                5405,
                5405
            ],
            [
                5405,
                5425
            ],
            [
                5425,
                5442
            ],
            [
                5442,
                5495
            ],
            [
                5495,
                5495
            ],
            [
                5495,
                5495
            ],
            [
                5495,
                5495
            ],
            [
                5495,
                5520
            ],
            [
                5520,
                5556
            ],
            [
                5556,
                5620
            ],
            [
                5620,
                5635
            ],
            [
                5635,
                5703
            ],
            [
                5703,
                5730
            ],
            [
                5730,
                5741
            ],
            [
                5741,
                5741
            ],
            [
                5741,
                5741
            ],
            [
                5741,
                5752
            ],
            [
                5752,
                5805
            ],
            [
                5805,
                5822
            ],
            [
                5822,
                5822
            ],
            [
                5822,
                5822
            ],
            [
                5822,
                5822
            ],
            [
                5822,
                5822
            ],
            [
                5822,
                5851
            ],
            [
                5851,
                5851
            ],
            [
                5851,
                6024
            ],
            [
                6024,
                6024
            ],
            [
                6024,
                6024
            ],
            [
                6024,
                6024
            ],
            [
                6024,
                6024
            ],
            [
                6024,
                6024
            ],
            [
                6024,
                6086
            ],
            [
                6086,
                6119
            ],
            [
                6119,
                6245
            ],
            [
                6245,
                6282
            ],
            [
                6282,
                6434
            ],
            [
                6434,
                6492
            ],
            [
                6492,
                6564
            ],
            [
                6564,
                6564
            ],
            [
                6564,
                6651
            ],
            [
                6651,
                6728
            ],
            [
                6728,
                6772
            ],
            [
                6772,
                6772
            ],
            [
                6772,
                6802
            ],
            [
                6802,
                6893
            ],
            [
                6893,
                6940
            ],
            [
                6940,
                6955
            ],
            [
                6955,
                7078
            ],
            [
                7078,
                7129
            ],
            [
                7129,
                7129
            ],
            [
                7129,
                7129
            ],
            [
                7129,
                7168
            ],
            [
                7168,
                7219
            ],
            [
                7219,
                7237
            ],
            [
                7237,
                7324
            ],
            [
                7324,
                7371
            ],
            [
                7371,
                7371
            ],
            [
                7371,
                7371
            ],
            [
                7371,
                7371
            ],
            [
                7371,
                7371
            ],
            [
                7371,
                7417
            ],
            [
                7417,
                7417
            ],
            [
                7417,
                7523
            ],
            [
                7523,
                7567
            ],
            [
                7567,
                7619
            ],
            [
                7619,
                7678
            ],
            [
                7678,
                7857
            ],
            [
                7857,
                7857
            ],
            [
                7857,
                7857
            ],
            [
                7857,
                7957
            ],
            [
                7957,
                8149
            ],
            [
                8149,
                8219
            ],
            [
                8219,
                8376
            ],
            [
                8376,
                8454
            ],
            [
                8454,
                8510
            ],
            [
                8510,
                8547
            ],
            [
                8547,
                8622
            ],
            [
                8622,
                8622
            ],
            [
                8622,
                8622
            ],
            [
                8622,
                8622
            ],
            [
                8622,
                8698
            ],
            [
                8698,
                8730
            ],
            [
                8730,
                8770
            ],
            [
                8770,
                8786
            ],
            [
                8786,
                8809
            ],
            [
                8809,
                9002
            ],
            [
                9002,
                9068
            ],
            [
                9068,
                9112
            ],
            [
                9112,
                9145
            ],
            [
                9145,
                9145
            ],
            [
                9145,
                9145
            ],
            [
                9145,
                9145
            ],
            [
                9145,
                9145
            ],
            [
                9145,
                9145
            ],
            [
                9145,
                9225
            ],
            [
                9225,
                9276
            ],
            [
                9276,
                9321
            ],
            [
                9321,
                9342
            ],
            [
                9342,
                9356
            ],
            [
                9356,
                9377
            ],
            [
                9377,
                9400
            ],
            [
                9400,
                9400
            ],
            [
                9400,
                9400
            ],
            [
                9400,
                9400
            ],
            [
                9400,
                9517
            ],
            [
                9517,
                9517
            ],
            [
                9517,
                9517
            ],
            [
                9517,
                9517
            ],
            [
                9517,
                9543
            ],
            [
                9543,
                9628
            ],
            [
                9628,
                9743
            ],
            [
                9743,
                9882
            ],
            [
                9882,
                10064
            ],
            [
                10064,
                10134
            ],
            [
                10134,
                10183
            ],
            [
                10183,
                10200
            ],
            [
                10200,
                10218
            ],
            [
                10218,
                10218
            ],
            [
                10218,
                10267
            ],
            [
                10267,
                10290
            ],
            [
                10290,
                10290
            ],
            [
                10290,
                10437
            ],
            [
                10437,
                10515
            ],
            [
                10515,
                10650
            ],
            [
                10650,
                10650
            ],
            [
                10650,
                10650
            ],
            [
                10650,
                10805
            ],
            [
                10805,
                10998
            ],
            [
                10998,
                11023
            ],
            [
                11023,
                11059
            ],
            [
                11059,
                11096
            ],
            [
                11096,
                11306
            ],
            [
                11306,
                11410
            ],
            [
                11410,
                11531
            ],
            [
                11531,
                11592
            ],
            [
                11592,
                11792
            ],
            [
                11792,
                11879
            ],
            [
                11879,
                11928
            ],
            [
                11928,
                11994
            ],
            [
                11994,
                12130
            ],
            [
                12130,
                12192
            ],
            [
                12192,
                12315
            ],
            [
                12315,
                12377
            ],
            [
                12377,
                12451
            ],
            [
                12451,
                12597
            ],
            [
                12597,
                12597
            ],
            [
                12597,
                12597
            ],
            [
                12597,
                12597
            ],
            [
                12597,
                12597
            ],
            [
                12597,
                12643
            ],
            [
                12643,
                12690
            ],
            [
                12690,
                12690
            ],
            [
                12690,
                12812
            ],
            [
                12812,
                12832
            ],
            [
                12832,
                12880
            ],
            [
                12880,
                12889
            ],
            [
                12889,
                12945
            ],
            [
                12945,
                12995
            ],
            [
                12995,
                13070
            ],
            [
                13070,
                13120
            ],
            [
                13120,
                13167
            ],
            [
                13167,
                13167
            ],
            [
                13167,
                13232
            ],
            [
                13232,
                13287
            ],
            [
                13287,
                13349
            ],
            [
                13349,
                13374
            ],
            [
                13374,
                13462
            ],
            [
                13462,
                13462
            ],
            [
                13462,
                13521
            ],
            [
                13521,
                13595
            ],
            [
                13595,
                13650
            ],
            [
                13650,
                13733
            ],
            [
                13733,
                13819
            ],
            [
                13819,
                13851
            ],
            [
                13851,
                13892
            ],
            [
                13892,
                13922
            ],
            [
                13922,
                13981
            ],
            [
                13981,
                14007
            ],
            [
                14007,
                14026
            ],
            [
                14026,
                14061
            ],
            [
                14061,
                14115
            ],
            [
                14115,
                14175
            ],
            [
                14175,
                14244
            ],
            [
                14244,
                14275
            ],
            [
                14275,
                14309
            ],
            [
                14309,
                14340
            ]
        ]
    }
}