{
    "original": {
        "text": "Mr. Bucket and his fat forefinger are much in consultation together under existing circumstances. When Mr. Bucket has a matter of this pressing interest under his consideration, the fat forefinger seems to rise, to the dignity of a familiar demon. He puts it to his ears, and it whispers information; he puts it to his lips, and it enjoins him to secrecy; he rubs it over his nose, and it sharpens his scent; he shakes it before a guilty man, and it charms him to his destruction. The Augurs of the Detective Temple invariably predict that when Mr. Bucket and that finger are in much conference, a terrible avenger will be heard of before long.\nOtherwise mildly studious in his observation of human nature, on the whole a benignant philosopher not disposed to be severe upon the follies of mankind, Mr. Bucket pervades a vast number of houses and strolls about an infinity of streets, to outward appearance rather languishing for want of an object. He is in the friendliest condition towards his species and will drink with most of them. He is free with his money, affable in his manners, innocent in his conversation--but through the placid stream of his life there glides an under-current of forefinger.\nTime and place cannot bind Mr. Bucket. Like man in the abstract, he is here to-day and gone to-morrow--but, very unlike man indeed, he is here again the next day. This evening he will be casually looking into the iron extinguishers at the door of Sir Leicester Dedlock's house in town; and to-morrow morning he will be walking on the leads at Chesney Wold, where erst the old man walked whose ghost is propitiated with a hundred guineas. Drawers, desks, pockets, all things belonging to him, Mr. Bucket examines. A few hours afterwards, he and the Roman will be alone together comparing forefingers.\nIt is likely that these occupations are irreconcilable with home enjoyment, but it is certain that Mr. Bucket at present does not go home. Though in general he highly appreciates the society of Mrs. Bucket--a lady of a natural detective genius, which if it had been improved by professional exercise, might have done great things, but which has paused at the level of a clever amateur--he holds himself aloof from that dear solace. Mrs. Bucket is dependent on their lodger (fortunately an amiable lady in whom she takes an interest) for companionship and conversation.\nA great crowd assembles in Lincoln's Inn Fields on the day of the funeral. Sir Leicester Dedlock attends the ceremony in person; strictly speaking, there are only three other human followers, that is to say, Lord Doodle, William Buffy, and the debilitated cousin (thrown in as a make-weight), but the amount of inconsolable carriages is immense. The peerage contributes more four-wheeled affliction than has ever been seen in that neighbourhood. Such is the assemblage of armorial bearings on coach panels that the Herald's College might be supposed to have lost its father and mother at a blow. The Duke of Foodle sends a splendid pile of dust and ashes, with silver wheel-boxes, patent axles, all the last improvements, and three bereaved worms, six feet high, holding on behind, in a bunch of woe. All the state coachmen in London seem plunged into mourning; and if that dead old man of the rusty garb be not beyond a taste in horseflesh (which appears impossible), it must be highly gratified this day.\nQuiet among the undertakers and the equipages and the calves of so many legs all steeped in grief, Mr. Bucket sits concealed in one of the inconsolable carriages and at his ease surveys the crowd through the lattice blinds. He has a keen eye for a crowd--as for what not?--and looking here and there, now from this side of the carriage, now from the other, now up at the house windows, now along the people's heads, nothing escapes him.\n\"And there you are, my partner, eh?\" says Mr. Bucket to himself, apostrophizing Mrs. Bucket, stationed, by his favour, on the steps of the deceased's house. \"And so you are. And so you are! And very well indeed you are looking, Mrs. Bucket!\"\nThe procession has not started yet, but is waiting for the cause of its assemblage to be brought out. Mr. Bucket, in the foremost emblazoned carriage, uses his two fat forefingers to hold the lattice a hair's breadth open while he looks.\nAnd it says a great deal for his attachment, as a husband, that he is still occupied with Mrs. B. \"There you are, my partner, eh?\" he murmuringly repeats. \"And our lodger with you. I'm taking notice of you, Mrs. Bucket; I hope you're all right in your health, my dear!\"\nNot another word does Mr. Bucket say, but sits with most attentive eyes until the sacked depository of noble secrets is brought down--Where are all those secrets now? Does he keep them yet? Did they fly with him on that sudden journey?--and until the procession moves, and Mr. Bucket's view is changed. After which he composes himself for an easy ride and takes note of the fittings of the carriage in case he should ever find such knowledge useful.\nContrast enough between Mr. Tulkinghorn shut up in his dark carriage and Mr. Bucket shut up in HIS. Between the immeasurable track of space beyond the little wound that has thrown the one into the fixed sleep which jolts so heavily over the stones of the streets, and the narrow track of blood which keeps the other in the watchful state expressed in every hair of his head! But it is all one to both; neither is troubled about that.\nMr. Bucket sits out the procession in his own easy manner and glides from the carriage when the opportunity he has settled with himself arrives. He makes for Sir Leicester Dedlock's, which is at present a sort of home to him, where he comes and goes as he likes at all hours, where he is always welcome and made much of, where he knows the whole establishment, and walks in an atmosphere of mysterious greatness.\nNo knocking or ringing for Mr. Bucket. He has caused himself to be provided with a key and can pass in at his pleasure. As he is crossing the hall, Mercury informs him, \"Here's another letter for you, Mr. Bucket, come by post,\" and gives it him.\n\"Another one, eh?\" says Mr. Bucket.\nIf Mercury should chance to be possessed by any lingering curiosity as to Mr. Bucket's letters, that wary person is not the man to gratify it. Mr. Bucket looks at him as if his face were a vista of some miles in length and he were leisurely contemplating the same.\n\"Do you happen to carry a box?\" says Mr. Bucket.\nUnfortunately Mercury is no snuff-taker.\n\"Could you fetch me a pinch from anywheres?\" says Mr. Bucket. \"Thankee. It don't matter what it is; I'm not particular as to the kind. Thankee!\"\nHaving leisurely helped himself from a canister borrowed from somebody downstairs for the purpose, and having made a considerable show of tasting it, first with one side of his nose and then with the other, Mr. Bucket, with much deliberation, pronounces it of the right sort and goes on, letter in hand.\nNow although Mr. Bucket walks upstairs to the little library within the larger one with the face of a man who receives some scores of letters every day, it happens that much correspondence is not incidental to his life. He is no great scribe, rather handling his pen like the pocket-staff he carries about with him always convenient to his grasp, and discourages correspondence with himself in others as being too artless and direct a way of doing delicate business. Further, he often sees damaging letters produced in evidence and has occasion to reflect that it was a green thing to write them. For these reasons he has very little to do with letters, either as sender or receiver. And yet he has received a round half-dozen within the last twenty-four hours.\n\"And this,\" says Mr. Bucket, spreading it out on the table, \"is in the same hand, and consists of the same two words.\"\nWhat two words?\nHe turns the key in the door, ungirdles his black pocket-book (book of fate to many), lays another letter by it, and reads, boldly written in each, \"Lady Dedlock.\"\n\"Yes, yes,\" says Mr. Bucket. \"But I could have made the money without this anonymous information.\"\nHaving put the letters in his book of fate and girdled it up again, he unlocks the door just in time to admit his dinner, which is brought upon a goodly tray with a decanter of sherry. Mr. Bucket frequently observes, in friendly circles where there is no restraint, that he likes a toothful of your fine old brown East Inder sherry better than anything you can offer him. Consequently he fills and empties his glass with a smack of his lips and is proceeding with his refreshment when an idea enters his mind.\nMr. Bucket softly opens the door of communication between that room and the next and looks in. The library is deserted, and the fire is sinking low. Mr. Bucket's eye, after taking a pigeon-flight round the room, alights upon a table where letters are usually put as they arrive. Several letters for Sir Leicester are upon it. Mr. Bucket draws near and examines the directions. \"No,\" he says, \"there's none in that hand. It's only me as is written to. I can break it to Sir Leicester Dedlock, Baronet, to-morrow.\"\nWith that he returns to finish his dinner with a good appetite, and after a light nap, is summoned into the drawing-room. Sir Leicester has received him there these several evenings past to know whether he has anything to report. The debilitated cousin (much exhausted by the funeral) and Volumnia are in attendance.\nMr. Bucket makes three distinctly different bows to these three people. A bow of homage to Sir Leicester, a bow of gallantry to Volumnia, and a bow of recognition to the debilitated Cousin, to whom it airily says, \"You are a swell about town, and you know me, and I know you.\" Having distributed these little specimens of his tact, Mr. Bucket rubs his hands.\n\"Have you anything new to communicate, officer?\" inquires Sir Leicester. \"Do you wish to hold any conversation with me in private?\"\n\"Why--not to-night, Sir Leicester Dedlock, Baronet.\"\n\"Because my time,\" pursues Sir Leicester, \"is wholly at your disposal with a view to the vindication of the outraged majesty of the law.\"\nMr. Bucket coughs and glances at Volumnia, rouged and necklaced, as though he would respectfully observe, \"I do assure you, you're a pretty creetur. I've seen hundreds worse looking at your time of life, I have indeed.\"\nThe fair Volumnia, not quite unconscious perhaps of the humanizing influence of her charms, pauses in the writing of cocked-hat notes and meditatively adjusts the pearl necklace. Mr. Bucket prices that decoration in his mind and thinks it as likely as not that Volumnia is writing poetry.\n\"If I have not,\" pursues Sir Leicester, \"in the most emphatic manner, adjured you, officer, to exercise your utmost skill in this atrocious case, I particularly desire to take the present opportunity of rectifying any omission I may have made. Let no expense be a consideration. I am prepared to defray all charges. You can incur none in pursuit of the object you have undertaken that I shall hesitate for a moment to bear.\"\nMr. Bucket made Sir Leicester's bow again as a response to this liberality.\n\"My mind,\" Sir Leicester adds with a generous warmth, \"has not, as may be easily supposed, recovered its tone since the late diabolical occurrence. It is not likely ever to recover its tone. But it is full of indignation to-night after undergoing the ordeal of consigning to the tomb the remains of a faithful, a zealous, a devoted adherent.\"\nSir Leicester's voice trembles and his grey hair stirs upon his head. Tears are in his eyes; the best part of his nature is aroused.\n\"I declare,\" he says, \"I solemnly declare that until this crime is discovered and, in the course of justice, punished, I almost feel as if there were a stain upon my name. A gentleman who has devoted a large portion of his life to me, a gentleman who has devoted the last day of his life to me, a gentleman who has constantly sat at my table and slept under my roof, goes from my house to his own, and is struck down within an hour of his leaving my house. I cannot say but that he may have been followed from my house, watched at my house, even first marked because of his association with my house--which may have suggested his possessing greater wealth and being altogether of greater importance than his own retiring demeanour would have indicated. If I cannot with my means and influence and my position bring all the perpetrators of such a crime to light, I fail in the assertion of my respect for that gentleman's memory and of my fidelity towards one who was ever faithful to me.\"\nWhile he makes this protestation with great emotion and earnestness, looking round the room as if he were addressing an assembly, Mr. Bucket glances at him with an observant gravity in which there might be, but for the audacity of the thought, a touch of compassion.\n\"The ceremony of to-day,\" continues Sir Leicester, \"strikingly illustrative of the respect in which my deceased friend\"--he lays a stress upon the word, for death levels all distinctions--\"was held by the flower of the land, has, I say, aggravated the shock I have received from this most horrible and audacious crime. If it were my brother who had committed it, I would not spare him.\"\nMr. Bucket looks very grave. Volumnia remarks of the deceased that he was the trustiest and dearest person!\n\"You must feel it as a deprivation to you, miss,\" replies Mr. Bucket soothingly, \"no doubt. He was calculated to BE a deprivation, I'm sure he was.\"\nVolumnia gives Mr. Bucket to understand, in reply, that her sensitive mind is fully made up never to get the better of it as long as she lives, that her nerves are unstrung for ever, and that she has not the least expectation of ever smiling again. Meanwhile she folds up a cocked hat for that redoubtable old general at Bath, descriptive of her melancholy condition.\n\"It gives a start to a delicate female,\" says Mr. Bucket sympathetically, \"but it'll wear off.\"\nVolumnia wishes of all things to know what is doing? Whether they are going to convict, or whatever it is, that dreadful soldier? Whether he had any accomplices, or whatever the thing is called in the law? And a great deal more to the like artless purpose.\n\"Why you see, miss,\" returns Mr. Bucket, bringing the finger into persuasive action--and such is his natural gallantry that he had almost said \"my dear\"--\"it ain't easy to answer those questions at the present moment. Not at the present moment. I've kept myself on this case, Sir Leicester Dedlock, Baronet,\" whom Mr. Bucket takes into the conversation in right of his importance, \"morning, noon, and night. But for a glass or two of sherry, I don't think I could have had my mind so much upon the stretch as it has been. I COULD answer your questions, miss, but duty forbids it. Sir Leicester Dedlock, Baronet, will very soon be made acquainted with all that has been traced. And I hope that he may find it\"--Mr. Bucket again looks grave--\"to his satisfaction.\"\nThe debilitated cousin only hopes some fler'll be executed--zample. Thinks more interest's wanted--get man hanged presentime--than get man place ten thousand a year. Hasn't a doubt--zample--far better hang wrong fler than no fler.\n\"YOU know life, you know, sir,\" says Mr. Bucket with a complimentary twinkle of his eye and crook of his finger, \"and you can confirm what I've mentioned to this lady. YOU don't want to be told that from information I have received I have gone to work. You're up to what a lady can't be expected to be up to. Lord! Especially in your elevated station of society, miss,\" says Mr. Bucket, quite reddening at another narrow escape from \"my dear.\"\n\"The officer, Volumnia,\" observes Sir Leicester, \"is faithful to his duty, and perfectly right.\"\nMr. Bucket murmurs, \"Glad to have the honour of your approbation, Sir Leicester Dedlock, Baronet.\"\n\"In fact, Volumnia,\" proceeds Sir Leicester, \"it is not holding up a good model for imitation to ask the officer any such questions as you have put to him. He is the best judge of his own responsibility; he acts upon his responsibility. And it does not become us, who assist in making the laws, to impede or interfere with those who carry them into execution. Or,\" says Sir Leicester somewhat sternly, for Volumnia was going to cut in before he had rounded his sentence, \"or who vindicate their outraged majesty.\"\nVolumnia with all humility explains that she had not merely the plea of curiosity to urge (in common with the giddy youth of her sex in general) but that she is perfectly dying with regret and interest for the darling man whose loss they all deplore.\n\"Very well, Volumnia,\" returns Sir Leicester. \"Then you cannot be too discreet.\"\nMr. Bucket takes the opportunity of a pause to be heard again.\n\"Sir Leicester Dedlock, Baronet, I have no objections to telling this lady, with your leave and among ourselves, that I look upon the case as pretty well complete. It is a beautiful case--a beautiful case--and what little is wanting to complete it, I expect to be able to supply in a few hours.\"\n\"I am very glad indeed to hear it,\" says Sir Leicester. \"Highly creditable to you.\"\n\"Sir Leicester Dedlock, Baronet,\" returns Mr. Bucket very seriously, \"I hope it may at one and the same time do me credit and prove satisfactory to all. When I depict it as a beautiful case, you see, miss,\" Mr. Bucket goes on, glancing gravely at Sir Leicester, \"I mean from my point of view. As considered from other points of view, such cases will always involve more or less unpleasantness. Very strange things comes to our knowledge in families, miss; bless your heart, what you would think to be phenomenons, quite.\"\nVolumnia, with her innocent little scream, supposes so.\n\"Aye, and even in gen-teel families, in high families, in great families,\" says Mr. Bucket, again gravely eyeing Sir Leicester aside. \"I have had the honour of being employed in high families before, and you have no idea--come, I'll go so far as to say not even YOU have any idea, sir,\" this to the debilitated cousin, \"what games goes on!\"\nThe cousin, who has been casting sofa-pillows on his head, in a prostration of boredom yawns, \"Vayli,\" being the used-up for \"very likely.\"\nSir Leicester, deeming it time to dismiss the officer, here majestically interposes with the words, \"Very good. Thank you!\" and also with a wave of his hand, implying not only that there is an end of the discourse, but that if high families fall into low habits they must take the consequences. \"You will not forget, officer,\" he adds with condescension, \"that I am at your disposal when you please.\"\nMr. Bucket (still grave) inquires if to-morrow morning, now, would suit, in case he should be as for'ard as he expects to be. Sir Leicester replies, \"All times are alike to me.\" Mr. Bucket makes his three bows and is withdrawing when a forgotten point occurs to him.\n\"Might I ask, by the by,\" he says in a low voice, cautiously returning, \"who posted the reward-bill on the staircase.\"\n\"I ordered it to be put up there,\" replies Sir Leicester.\n\"Would it be considered a liberty, Sir Leicester Dedlock, Baronet, if I was to ask you why?\"\n\"Not at all. I chose it as a conspicuous part of the house. I think it cannot be too prominently kept before the whole establishment. I wish my people to be impressed with the enormity of the crime, the determination to punish it, and the hopelessness of escape. At the same time, officer, if you in your better knowledge of the subject see any objection--\"\nMr. Bucket sees none now; the bill having been put up, had better not be taken down. Repeating his three bows he withdraws, closing the door on Volumnia's little scream, which is a preliminary to her remarking that that charmingly horrible person is a perfect Blue Chamber.\nIn his fondness for society and his adaptability to all grades, Mr. Bucket is presently standing before the hall-fire--bright and warm on the early winter night--admiring Mercury.\n\"Why, you're six foot two, I suppose?\" says Mr. Bucket.\n\"Three,\" says Mercury.\n\"Are you so much? But then, you see, you're broad in proportion and don't look it. You're not one of the weak-legged ones, you ain't. Was you ever modelled now?\" Mr. Bucket asks, conveying the expression of an artist into the turn of his eye and head.\nMercury never was modelled.\n\"Then you ought to be, you know,\" says Mr. Bucket; \"and a friend of mine that you'll hear of one day as a Royal Academy sculptor would stand something handsome to make a drawing of your proportions for the marble. My Lady's out, ain't she?\"\n\"Out to dinner.\"\n\"Goes out pretty well every day, don't she?\"\n\"Yes.\"\n\"Not to be wondered at!\" says Mr. Bucket. \"Such a fine woman as her, so handsome and so graceful and so elegant, is like a fresh lemon on a dinner-table, ornamental wherever she goes. Was your father in the same way of life as yourself?\"\nAnswer in the negative.\n\"Mine was,\" says Mr. Bucket. \"My father was first a page, then a footman, then a butler, then a steward, then an inn-keeper. Lived universally respected, and died lamented. Said with his last breath that he considered service the most honourable part of his career, and so it was. I've a brother in service, AND a brother-in-law. My Lady a good temper?\"\nMercury replies, \"As good as you can expect.\"\n\"Ah!\" says Mr. Bucket. \"A little spoilt? A little capricious? Lord! What can you anticipate when they're so handsome as that? And we like 'em all the better for it, don't we?\"\nMercury, with his hands in the pockets of his bright peach-blossom small-clothes, stretches his symmetrical silk legs with the air of a man of gallantry and can't deny it. Come the roll of wheels and a violent ringing at the bell. \"Talk of the angels,\" says Mr. Bucket. \"Here she is!\"\nThe doors are thrown open, and she passes through the hall. Still very pale, she is dressed in slight mourning and wears two beautiful bracelets. Either their beauty or the beauty of her arms is particularly attractive to Mr. Bucket. He looks at them with an eager eye and rattles something in his pocket--halfpence perhaps.\nNoticing him at his distance, she turns an inquiring look on the other Mercury who has brought her home.\n\"Mr. Bucket, my Lady.\"\nMr. Bucket makes a leg and comes forward, passing his familiar demon over the region of his mouth.\n\"Are you waiting to see Sir Leicester?\"\n\"No, my Lady, I've seen him!\"\n\"Have you anything to say to me?\"\n\"Not just at present, my Lady.\"\n\"Have you made any new discoveries?\"\n\"A few, my Lady.\"\nThis is merely in passing. She scarcely makes a stop, and sweeps upstairs alone. Mr. Bucket, moving towards the staircase-foot, watches her as she goes up the steps the old man came down to his grave, past murderous groups of statuary repeated with their shadowy weapons on the wall, past the printed bill, which she looks at going by, out of view.\n\"She's a lovely woman, too, she really is,\" says Mr. Bucket, coming back to Mercury. \"Don't look quite healthy though.\"\nIs not quite healthy, Mercury informs him. Suffers much from headaches.\nReally? That's a pity! Walking, Mr. Bucket would recommend for that. Well, she tries walking, Mercury rejoins. Walks sometimes for two hours when she has them bad. By night, too.\n\"Are you sure you're quite so much as six foot three?\" asks Mr. Bucket. \"Begging your pardon for interrupting you a moment?\"\nNot a doubt about it.\n\"You're so well put together that I shouldn't have thought it. But the household troops, though considered fine men, are built so straggling. Walks by night, does she? When it's moonlight, though?\"\nOh, yes. When it's moonlight! Of course. Oh, of course! Conversational and acquiescent on both sides.\n\"I suppose you ain't in the habit of walking yourself?\" says Mr. Bucket. \"Not much time for it, I should say?\"\nBesides which, Mercury don't like it. Prefers carriage exercise.\n\"To be sure,\" says Mr. Bucket. \"That makes a difference. Now I think of it,\" says Mr. Bucket, warming his hands and looking pleasantly at the blaze, \"she went out walking the very night of this business.\"\n\"To be sure she did! I let her into the garden over the way.\"\n\"And left her there. Certainly you did. I saw you doing it.\"\n\"I didn't see YOU,\" says Mercury.\n\"I was rather in a hurry,\" returns Mr. Bucket, \"for I was going to visit a aunt of mine that lives at Chelsea--next door but two to the old original Bun House--ninety year old the old lady is, a single woman, and got a little property. Yes, I chanced to be passing at the time. Let's see. What time might it be? It wasn't ten.\"\n\"Half-past nine.\"\n\"You're right. So it was. And if I don't deceive myself, my Lady was muffled in a loose black mantle, with a deep fringe to it?\"\n\"Of course she was.\"\nOf course she was. Mr. Bucket must return to a little work he has to get on with upstairs, but he must shake hands with Mercury in acknowledgment of his agreeable conversation, and will he--this is all he asks--will he, when he has a leisure half-hour, think of bestowing it on that Royal Academy sculptor, for the advantage of both parties?",
        "paragraph_chars": [
            [
                0,
                645
            ],
            [
                645,
                1206
            ],
            [
                1206,
                1806
            ],
            [
                1806,
                2375
            ],
            [
                2375,
                3382
            ],
            [
                3382,
                3819
            ],
            [
                3819,
                4061
            ],
            [
                4061,
                4299
            ],
            [
                4299,
                4569
            ],
            [
                4569,
                5019
            ],
            [
                5019,
                5453
            ],
            [
                5453,
                5866
            ],
            [
                5866,
                6112
            ],
            [
                6112,
                6148
            ],
            [
                6148,
                6413
            ],
            [
                6413,
                6462
            ],
            [
                6462,
                6503
            ],
            [
                6503,
                6648
            ],
            [
                6648,
                6952
            ],
            [
                6952,
                7714
            ],
            [
                7714,
                7833
            ],
            [
                7833,
                7849
            ],
            [
                7849,
                8013
            ],
            [
                8013,
                8112
            ],
            [
                8112,
                8622
            ],
            [
                8622,
                9135
            ],
            [
                9135,
                9452
            ],
            [
                9452,
                9811
            ],
            [
                9811,
                9943
            ],
            [
                9943,
                9996
            ],
            [
                9996,
                10134
            ],
            [
                10134,
                10354
            ],
            [
                10354,
                10643
            ],
            [
                10643,
                11068
            ],
            [
                11068,
                11144
            ],
            [
                11144,
                11487
            ],
            [
                11487,
                11620
            ],
            [
                11620,
                12609
            ],
            [
                12609,
                12876
            ],
            [
                12876,
                13263
            ],
            [
                13263,
                13371
            ],
            [
                13371,
                13520
            ],
            [
                13520,
                13888
            ],
            [
                13888,
                13984
            ],
            [
                13984,
                14241
            ],
            [
                14241,
                15004
            ],
            [
                15004,
                15235
            ],
            [
                15235,
                15679
            ],
            [
                15679,
                15776
            ],
            [
                15776,
                15875
            ],
            [
                15875,
                16389
            ],
            [
                16389,
                16640
            ],
            [
                16640,
                16721
            ],
            [
                16721,
                16784
            ],
            [
                16784,
                17080
            ],
            [
                17080,
                17164
            ],
            [
                17164,
                17686
            ],
            [
                17686,
                17742
            ],
            [
                17742,
                18083
            ],
            [
                18083,
                18223
            ],
            [
                18223,
                18624
            ],
            [
                18624,
                18891
            ],
            [
                18891,
                19010
            ],
            [
                19010,
                19068
            ],
            [
                19068,
                19161
            ],
            [
                19161,
                19519
            ],
            [
                19519,
                19793
            ],
            [
                19793,
                19973
            ],
            [
                19973,
                20029
            ],
            [
                20029,
                20052
            ],
            [
                20052,
                20304
            ],
            [
                20304,
                20332
            ],
            [
                20332,
                20573
            ],
            [
                20573,
                20590
            ],
            [
                20590,
                20635
            ],
            [
                20635,
                20642
            ],
            [
                20642,
                20880
            ],
            [
                20880,
                20904
            ],
            [
                20904,
                21258
            ],
            [
                21258,
                21304
            ],
            [
                21304,
                21480
            ],
            [
                21480,
                21765
            ],
            [
                21765,
                22090
            ],
            [
                22090,
                22195
            ],
            [
                22195,
                22218
            ],
            [
                22218,
                22317
            ],
            [
                22317,
                22357
            ],
            [
                22357,
                22387
            ],
            [
                22387,
                22421
            ],
            [
                22421,
                22453
            ],
            [
                22453,
                22490
            ],
            [
                22490,
                22508
            ],
            [
                22508,
                22857
            ],
            [
                22857,
                22977
            ],
            [
                22977,
                23049
            ],
            [
                23049,
                23228
            ],
            [
                23228,
                23353
            ],
            [
                23353,
                23375
            ],
            [
                23375,
                23573
            ],
            [
                23573,
                23675
            ],
            [
                23675,
                23786
            ],
            [
                23786,
                23851
            ],
            [
                23851,
                24056
            ],
            [
                24056,
                24118
            ],
            [
                24118,
                24179
            ],
            [
                24179,
                24213
            ],
            [
                24213,
                24541
            ],
            [
                24541,
                24559
            ],
            [
                24559,
                24688
            ],
            [
                24688,
                24709
            ],
            [
                24709,
                25050
            ]
        ],
        "segment_chars": [
            [
                0,
                98
            ],
            [
                98,
                248
            ],
            [
                248,
                481
            ],
            [
                481,
                645
            ],
            [
                645,
                949
            ],
            [
                949,
                1038
            ],
            [
                1038,
                1206
            ],
            [
                1206,
                1245
            ],
            [
                1245,
                1369
            ],
            [
                1369,
                1644
            ],
            [
                1644,
                1719
            ],
            [
                1719,
                1806
            ],
            [
                1806,
                1945
            ],
            [
                1945,
                2238
            ],
            [
                2238,
                2375
            ],
            [
                2375,
                2450
            ],
            [
                2450,
                2721
            ],
            [
                2721,
                2821
            ],
            [
                2821,
                2971
            ],
            [
                2971,
                3176
            ],
            [
                3176,
                3382
            ],
            [
                3382,
                3606
            ],
            [
                3606,
                3819
            ],
            [
                3819,
                3856
            ],
            [
                3856,
                3976
            ],
            [
                3976,
                3993
            ],
            [
                3993,
                4009
            ],
            [
                4009,
                4061
            ],
            [
                4061,
                4163
            ],
            [
                4163,
                4299
            ],
            [
                4299,
                4397
            ],
            [
                4397,
                4430
            ],
            [
                4430,
                4454
            ],
            [
                4454,
                4480
            ],
            [
                4480,
                4569
            ],
            [
                4569,
                4736
            ],
            [
                4736,
                4759
            ],
            [
                4759,
                4872
            ],
            [
                4872,
                5019
            ],
            [
                5019,
                5119
            ],
            [
                5119,
                5394
            ],
            [
                5394,
                5453
            ],
            [
                5453,
                5598
            ],
            [
                5598,
                5866
            ],
            [
                5866,
                5905
            ],
            [
                5905,
                5986
            ],
            [
                5986,
                6112
            ],
            [
                6112,
                6131
            ],
            [
                6131,
                6148
            ],
            [
                6148,
                6291
            ],
            [
                6291,
                6413
            ],
            [
                6413,
                6445
            ],
            [
                6445,
                6462
            ],
            [
                6462,
                6503
            ],
            [
                6503,
                6548
            ],
            [
                6548,
                6565
            ],
            [
                6565,
                6575
            ],
            [
                6575,
                6638
            ],
            [
                6638,
                6648
            ],
            [
                6648,
                6952
            ],
            [
                6952,
                7172
            ],
            [
                7172,
                7419
            ],
            [
                7419,
                7549
            ],
            [
                7549,
                7636
            ],
            [
                7636,
                7714
            ],
            [
                7714,
                7833
            ],
            [
                7833,
                7849
            ],
            [
                7849,
                8013
            ],
            [
                8013,
                8042
            ],
            [
                8042,
                8112
            ],
            [
                8112,
                8297
            ],
            [
                8297,
                8484
            ],
            [
                8484,
                8622
            ],
            [
                8622,
                8717
            ],
            [
                8717,
                8771
            ],
            [
                8771,
                8901
            ],
            [
                8901,
                8948
            ],
            [
                8948,
                8999
            ],
            [
                8999,
                9042
            ],
            [
                9042,
                9073
            ],
            [
                9073,
                9135
            ],
            [
                9135,
                9257
            ],
            [
                9257,
                9365
            ],
            [
                9365,
                9452
            ],
            [
                9452,
                9524
            ],
            [
                9524,
                9729
            ],
            [
                9729,
                9811
            ],
            [
                9811,
                9860
            ],
            [
                9860,
                9884
            ],
            [
                9884,
                9943
            ],
            [
                9943,
                9996
            ],
            [
                9996,
                10134
            ],
            [
                10134,
                10283
            ],
            [
                10283,
                10354
            ],
            [
                10354,
                10533
            ],
            [
                10533,
                10643
            ],
            [
                10643,
                10887
            ],
            [
                10887,
                10922
            ],
            [
                10922,
                10959
            ],
            [
                10959,
                11068
            ],
            [
                11068,
                11144
            ],
            [
                11144,
                11292
            ],
            [
                11292,
                11335
            ],
            [
                11335,
                11487
            ],
            [
                11487,
                11557
            ],
            [
                11557,
                11620
            ],
            [
                11620,
                11792
            ],
            [
                11792,
                12077
            ],
            [
                12077,
                12373
            ],
            [
                12373,
                12609
            ],
            [
                12609,
                12876
            ],
            [
                12876,
                13195
            ],
            [
                13195,
                13263
            ],
            [
                13263,
                13292
            ],
            [
                13292,
                13371
            ],
            [
                13371,
                13463
            ],
            [
                13463,
                13520
            ],
            [
                13520,
                13769
            ],
            [
                13769,
                13888
            ],
            [
                13888,
                13984
            ],
            [
                13984,
                14037
            ],
            [
                14037,
                14114
            ],
            [
                14114,
                14190
            ],
            [
                14190,
                14241
            ],
            [
                14241,
                14459
            ],
            [
                14459,
                14486
            ],
            [
                14486,
                14649
            ],
            [
                14649,
                14763
            ],
            [
                14763,
                14821
            ],
            [
                14821,
                14918
            ],
            [
                14918,
                15004
            ],
            [
                15004,
                15072
            ],
            [
                15072,
                15170
            ],
            [
                15170,
                15235
            ],
            [
                15235,
                15403
            ],
            [
                15403,
                15488
            ],
            [
                15488,
                15544
            ],
            [
                15544,
                15550
            ],
            [
                15550,
                15679
            ],
            [
                15679,
                15776
            ],
            [
                15776,
                15875
            ],
            [
                15875,
                16031
            ],
            [
                16031,
                16112
            ],
            [
                16112,
                16235
            ],
            [
                16235,
                16389
            ],
            [
                16389,
                16640
            ],
            [
                16640,
                16686
            ],
            [
                16686,
                16721
            ],
            [
                16721,
                16784
            ],
            [
                16784,
                16948
            ],
            [
                16948,
                17080
            ],
            [
                17080,
                17136
            ],
            [
                17136,
                17164
            ],
            [
                17164,
                17317
            ],
            [
                17317,
                17457
            ],
            [
                17457,
                17558
            ],
            [
                17558,
                17686
            ],
            [
                17686,
                17742
            ],
            [
                17742,
                17876
            ],
            [
                17876,
                18083
            ],
            [
                18083,
                18223
            ],
            [
                18223,
                18335
            ],
            [
                18335,
                18347
            ],
            [
                18347,
                18518
            ],
            [
                18518,
                18624
            ],
            [
                18624,
                18750
            ],
            [
                18750,
                18802
            ],
            [
                18802,
                18891
            ],
            [
                18891,
                19010
            ],
            [
                19010,
                19068
            ],
            [
                19068,
                19161
            ],
            [
                19161,
                19174
            ],
            [
                19174,
                19221
            ],
            [
                19221,
                19295
            ],
            [
                19295,
                19424
            ],
            [
                19424,
                19519
            ],
            [
                19519,
                19604
            ],
            [
                19604,
                19793
            ],
            [
                19793,
                19973
            ],
            [
                19973,
                20012
            ],
            [
                20012,
                20029
            ],
            [
                20029,
                20052
            ],
            [
                20052,
                20070
            ],
            [
                20070,
                20135
            ],
            [
                20135,
                20186
            ],
            [
                20186,
                20214
            ],
            [
                20214,
                20304
            ],
            [
                20304,
                20332
            ],
            [
                20332,
                20546
            ],
            [
                20546,
                20573
            ],
            [
                20573,
                20590
            ],
            [
                20590,
                20635
            ],
            [
                20635,
                20642
            ],
            [
                20642,
                20667
            ],
            [
                20667,
                20684
            ],
            [
                20684,
                20826
            ],
            [
                20826,
                20880
            ],
            [
                20880,
                20904
            ],
            [
                20904,
                20933
            ],
            [
                20933,
                21029
            ],
            [
                21029,
                21077
            ],
            [
                21077,
                21185
            ],
            [
                21185,
                21234
            ],
            [
                21234,
                21258
            ],
            [
                21258,
                21304
            ],
            [
                21304,
                21310
            ],
            [
                21310,
                21327
            ],
            [
                21327,
                21345
            ],
            [
                21345,
                21366
            ],
            [
                21366,
                21372
            ],
            [
                21372,
                21430
            ],
            [
                21430,
                21480
            ],
            [
                21480,
                21652
            ],
            [
                21652,
                21711
            ],
            [
                21711,
                21750
            ],
            [
                21750,
                21765
            ],
            [
                21765,
                21825
            ],
            [
                21825,
                21911
            ],
            [
                21911,
                21999
            ],
            [
                21999,
                22090
            ],
            [
                22090,
                22195
            ],
            [
                22195,
                22218
            ],
            [
                22218,
                22317
            ],
            [
                22317,
                22357
            ],
            [
                22357,
                22387
            ],
            [
                22387,
                22421
            ],
            [
                22421,
                22453
            ],
            [
                22453,
                22490
            ],
            [
                22490,
                22508
            ],
            [
                22508,
                22535
            ],
            [
                22535,
                22589
            ],
            [
                22589,
                22857
            ],
            [
                22857,
                22942
            ],
            [
                22942,
                22977
            ],
            [
                22977,
                23020
            ],
            [
                23020,
                23049
            ],
            [
                23049,
                23057
            ],
            [
                23057,
                23072
            ],
            [
                23072,
                23118
            ],
            [
                23118,
                23160
            ],
            [
                23160,
                23213
            ],
            [
                23213,
                23228
            ],
            [
                23228,
                23283
            ],
            [
                23283,
                23300
            ],
            [
                23300,
                23353
            ],
            [
                23353,
                23375
            ],
            [
                23375,
                23438
            ],
            [
                23438,
                23517
            ],
            [
                23517,
                23543
            ],
            [
                23543,
                23573
            ],
            [
                23573,
                23582
            ],
            [
                23582,
                23603
            ],
            [
                23603,
                23614
            ],
            [
                23614,
                23629
            ],
            [
                23629,
                23675
            ],
            [
                23675,
                23731
            ],
            [
                23731,
                23748
            ],
            [
                23748,
                23786
            ],
            [
                23786,
                23824
            ],
            [
                23824,
                23851
            ],
            [
                23851,
                23882
            ],
            [
                23882,
                23908
            ],
            [
                23908,
                24056
            ],
            [
                24056,
                24077
            ],
            [
                24077,
                24118
            ],
            [
                24118,
                24139
            ],
            [
                24139,
                24158
            ],
            [
                24158,
                24179
            ],
            [
                24179,
                24213
            ],
            [
                24213,
                24449
            ],
            [
                24449,
                24491
            ],
            [
                24491,
                24502
            ],
            [
                24502,
                24525
            ],
            [
                24525,
                24541
            ],
            [
                24541,
                24559
            ],
            [
                24559,
                24574
            ],
            [
                24574,
                24585
            ],
            [
                24585,
                24688
            ],
            [
                24688,
                24709
            ],
            [
                24709,
                24728
            ],
            [
                24728,
                25050
            ]
        ],
        "overlap_chars": [
            [
                0,
                67
            ],
            [
                96,
                98
            ],
            [
                98,
                113
            ],
            [
                118,
                152
            ],
            [
                176,
                196
            ],
            [
                246,
                248
            ],
            [
                248,
                270
            ],
            [
                299,
                323
            ],
            [
                354,
                380
            ],
            [
                407,
                441
            ],
            [
                479,
                480
            ],
            [
                801,
                949
            ],
            [
                949,
                991
            ],
            [
                1004,
                1038
            ],
            [
                1038,
                1117
            ],
            [
                1119,
                1206
            ],
            [
                1235,
                1243
            ],
            [
                1274,
                1281
            ],
            [
                1289,
                1297
            ],
            [
                1284,
                1285
            ],
            [
                1211,
                1214
            ],
            [
                1344,
                1369
            ],
            [
                1369,
                1409
            ],
            [
                1441,
                1495
            ],
            [
                1506,
                1539
            ],
            [
                1546,
                1568
            ],
            [
                1415,
                1418
            ],
            [
                1578,
                1592
            ],
            [
                1642,
                1644
            ],
            [
                1644,
                1692
            ],
            [
                1696,
                1718
            ],
            [
                1907,
                1945
            ],
            [
                1945,
                2011
            ],
            [
                2013,
                2190
            ],
            [
                2192,
                2214
            ],
            [
                2236,
                2238
            ],
            [
                2238,
                2356
            ],
            [
                2373,
                2375
            ],
            [
                2375,
                2450
            ],
            [
                2450,
                2479
            ],
            [
                2502,
                2503
            ],
            [
                2523,
                2566
            ],
            [
                2668,
                2721
            ],
            [
                2721,
                2821
            ],
            [
                3176,
                3235
            ],
            [
                3380,
                3382
            ],
            [
                3382,
                3409
            ],
            [
                3479,
                3577
            ],
            [
                3578,
                3589
            ],
            [
                3598,
                3606
            ],
            [
                3606,
                3608
            ],
            [
                3667,
                3682
            ],
            [
                3743,
                3745
            ],
            [
                3655,
                3658
            ],
            [
                3717,
                3722
            ],
            [
                3746,
                3796
            ],
            [
                3798,
                3819
            ],
            [
                3819,
                3856
            ],
            [
                3856,
                3883
            ],
            [
                3899,
                3976
            ],
            [
                4009,
                4061
            ],
            [
                4061,
                4119
            ],
            [
                4144,
                4163
            ],
            [
                4163,
                4173
            ],
            [
                4212,
                4252
            ],
            [
                4261,
                4299
            ],
            [
                4299,
                4342
            ],
            [
                4344,
                4397
            ],
            [
                4397,
                4430
            ],
            [
                4430,
                4454
            ],
            [
                4454,
                4480
            ],
            [
                4480,
                4481
            ],
            [
                4501,
                4532
            ],
            [
                4557,
                4569
            ],
            [
                4569,
                4650
            ],
            [
                4686,
                4701
            ],
            [
                4806,
                4809
            ],
            [
                4816,
                4841
            ],
            [
                4855,
                4872
            ],
            [
                4872,
                5019
            ],
            [
                5453,
                5463
            ],
            [
                5515,
                5548
            ],
            [
                5549,
                5560
            ],
            [
                5589,
                5598
            ],
            [
                5598,
                5755
            ],
            [
                5812,
                5866
            ],
            [
                5908,
                5911
            ],
            [
                5947,
                5986
            ],
            [
                5986,
                6013
            ],
            [
                6022,
                6091
            ],
            [
                6112,
                6131
            ],
            [
                6131,
                6147
            ],
            [
                6927,
                6952
            ],
            [
                6952,
                6993
            ],
            [
                6998,
                7004
            ],
            [
                6994,
                6997
            ],
            [
                7005,
                7012
            ],
            [
                7035,
                7070
            ],
            [
                7076,
                7104
            ],
            [
                7162,
                7170
            ],
            [
                7144,
                7147
            ],
            [
                7121,
                7140
            ],
            [
                7170,
                7172
            ],
            [
                7172,
                7194
            ],
            [
                7299,
                7314
            ],
            [
                7346,
                7419
            ],
            [
                7428,
                7483
            ],
            [
                7508,
                7519
            ],
            [
                7534,
                7549
            ],
            [
                7549,
                7636
            ],
            [
                7636,
                7659
            ],
            [
                7668,
                7672
            ],
            [
                7660,
                7661
            ],
            [
                7672,
                7714
            ],
            [
                7714,
                7833
            ],
            [
                7849,
                7851
            ],
            [
                7869,
                7878
            ],
            [
                7889,
                7910
            ],
            [
                7995,
                7996
            ],
            [
                7935,
                7995
            ],
            [
                7997,
                8013
            ],
            [
                8013,
                8042
            ],
            [
                8042,
                8112
            ],
            [
                8112,
                8146
            ],
            [
                8178,
                8250
            ],
            [
                8270,
                8297
            ],
            [
                8500,
                8622
            ],
            [
                8622,
                8654
            ],
            [
                8672,
                8717
            ],
            [
                8717,
                8771
            ],
            [
                8771,
                8787
            ],
            [
                8834,
                8901
            ],
            [
                8901,
                8948
            ],
            [
                8948,
                8998
            ],
            [
                8999,
                9042
            ],
            [
                9042,
                9073
            ],
            [
                9073,
                9122
            ],
            [
                9132,
                9135
            ],
            [
                9135,
                9257
            ],
            [
                9257,
                9365
            ],
            [
                9365,
                9387
            ],
            [
                9420,
                9452
            ],
            [
                9811,
                9860
            ],
            [
                9860,
                9884
            ],
            [
                9884,
                9943
            ],
            [
                9943,
                9944
            ],
            [
                9949,
                9952
            ],
            [
                9961,
                9996
            ],
            [
                9996,
                10134
            ],
            [
                10134,
                10208
            ],
            [
                10218,
                10283
            ],
            [
                10283,
                10354
            ],
            [
                10354,
                10371
            ],
            [
                10446,
                10455
            ],
            [
                10434,
                10437
            ],
            [
                10460,
                10467
            ],
            [
                10513,
                10533
            ],
            [
                10533,
                10643
            ],
            [
                10643,
                10644
            ],
            [
                10647,
                10648
            ],
            [
                10811,
                10813
            ],
            [
                10657,
                10684
            ],
            [
                10721,
                10724
            ],
            [
                10735,
                10787
            ],
            [
                10885,
                10887
            ],
            [
                10887,
                10920
            ],
            [
                11068,
                11078
            ],
            [
                11113,
                11114
            ],
            [
                11100,
                11103
            ],
            [
                11142,
                11144
            ],
            [
                11620,
                11632
            ],
            [
                11636,
                11640
            ],
            [
                11701,
                11702
            ],
            [
                11698,
                11701
            ],
            [
                11703,
                11705
            ],
            [
                11640,
                11686
            ],
            [
                11729,
                11792
            ],
            [
                11792,
                11854
            ],
            [
                11867,
                11874
            ],
            [
                11946,
                11986
            ],
            [
                12022,
                12077
            ],
            [
                12099,
                12139
            ],
            [
                12161,
                12165
            ],
            [
                12172,
                12219
            ],
            [
                12221,
                12275
            ],
            [
                12319,
                12331
            ],
            [
                12351,
                12373
            ],
            [
                12373,
                12392
            ],
            [
                12403,
                12412
            ],
            [
                12429,
                12434
            ],
            [
                12439,
                12458
            ],
            [
                12492,
                12495
            ],
            [
                12466,
                12491
            ],
            [
                12509,
                12547
            ],
            [
                12606,
                12609
            ],
            [
                12609,
                12617
            ],
            [
                12624,
                12628
            ],
            [
                12642,
                12660
            ],
            [
                12737,
                12814
            ],
            [
                12853,
                12876
            ],
            [
                13195,
                13234
            ],
            [
                13237,
                13238
            ],
            [
                13239,
                13263
            ],
            [
                13263,
                13292
            ],
            [
                13292,
                13371
            ],
            [
                13371,
                13450
            ],
            [
                13461,
                13462
            ],
            [
                13520,
                13528
            ],
            [
                13571,
                13624
            ],
            [
                13639,
                13641
            ],
            [
                13662,
                13715
            ],
            [
                13720,
                13723
            ],
            [
                13749,
                13753
            ],
            [
                13546,
                13548
            ],
            [
                13762,
                13769
            ],
            [
                14045,
                14114
            ],
            [
                14122,
                14124
            ],
            [
                14129,
                14177
            ],
            [
                14188,
                14189
            ],
            [
                14241,
                14324
            ],
            [
                14395,
                14435
            ],
            [
                14457,
                14459
            ],
            [
                14459,
                14486
            ],
            [
                14486,
                14516
            ],
            [
                14623,
                14649
            ],
            [
                14763,
                14821
            ],
            [
                14821,
                14918
            ],
            [
                14918,
                14949
            ],
            [
                14953,
                14979
            ],
            [
                14981,
                15004
            ],
            [
                15004,
                15042
            ],
            [
                15047,
                15062
            ],
            [
                15064,
                15072
            ],
            [
                15194,
                15215
            ],
            [
                15177,
                15178
            ],
            [
                15221,
                15228
            ],
            [
                15233,
                15235
            ],
            [
                15875,
                15930
            ],
            [
                15969,
                16006
            ],
            [
                16029,
                16031
            ],
            [
                16031,
                16077
            ],
            [
                16110,
                16112
            ],
            [
                16112,
                16172
            ],
            [
                16183,
                16233
            ],
            [
                16784,
                16815
            ],
            [
                16723,
                16731
            ],
            [
                16815,
                16816
            ],
            [
                16817,
                16875
            ],
            [
                16895,
                16948
            ],
            [
                16948,
                16970
            ],
            [
                16990,
                17080
            ],
            [
                17080,
                17136
            ],
            [
                17136,
                17164
            ],
            [
                17164,
                17247
            ],
            [
                17273,
                17317
            ],
            [
                17317,
                17370
            ],
            [
                17382,
                17389
            ],
            [
                17424,
                17457
            ],
            [
                17457,
                17528
            ],
            [
                17542,
                17558
            ],
            [
                17558,
                17577
            ],
            [
                17584,
                17618
            ],
            [
                17683,
                17686
            ],
            [
                17686,
                17742
            ],
            [
                17742,
                17747
            ],
            [
                17752,
                17756
            ],
            [
                17779,
                17833
            ],
            [
                17840,
                17868
            ],
            [
                17874,
                17875
            ],
            [
                18223,
                18311
            ],
            [
                18321,
                18335
            ],
            [
                18335,
                18347
            ],
            [
                18347,
                18350
            ],
            [
                18356,
                18379
            ],
            [
                18516,
                18517
            ],
            [
                18624,
                18660
            ],
            [
                18671,
                18678
            ],
            [
                18685,
                18696
            ],
            [
                18705,
                18707
            ],
            [
                18718,
                18749
            ],
            [
                18750,
                18802
            ],
            [
                18802,
                18812
            ],
            [
                18829,
                18891
            ],
            [
                18891,
                18914
            ],
            [
                18939,
                18940
            ],
            [
                18964,
                19007
            ],
            [
                19010,
                19068
            ],
            [
                19068,
                19161
            ],
            [
                19161,
                19174
            ],
            [
                19174,
                19221
            ],
            [
                19295,
                19422
            ],
            [
                19519,
                19529
            ],
            [
                19614,
                19617
            ],
            [
                19624,
                19628
            ],
            [
                19632,
                19641
            ],
            [
                19602,
                19603
            ],
            [
                19868,
                19870
            ],
            [
                19881,
                19900
            ],
            [
                19912,
                19918
            ],
            [
                19901,
                19910
            ],
            [
                19855,
                19856
            ],
            [
                19958,
                19963
            ],
            [
                19931,
                19934
            ],
            [
                19971,
                19973
            ],
            [
                19973,
                20012
            ],
            [
                20012,
                20029
            ],
            [
                20029,
                20042
            ],
            [
                20050,
                20052
            ],
            [
                20052,
                20070
            ],
            [
                20070,
                20135
            ],
            [
                20436,
                20466
            ],
            [
                20473,
                20546
            ],
            [
                20546,
                20573
            ],
            [
                20573,
                20590
            ],
            [
                20590,
                20635
            ],
            [
                20635,
                20642
            ],
            [
                20642,
                20667
            ],
            [
                20667,
                20684
            ],
            [
                20684,
                20709
            ],
            [
                20824,
                20826
            ],
            [
                21234,
                21241
            ],
            [
                21242,
                21258
            ],
            [
                21275,
                21304
            ],
            [
                21304,
                21310
            ],
            [
                21310,
                21327
            ],
            [
                21327,
                21345
            ],
            [
                21345,
                21366
            ],
            [
                21366,
                21372
            ],
            [
                21372,
                21430
            ],
            [
                21430,
                21480
            ],
            [
                21507,
                21510
            ],
            [
                21616,
                21619
            ],
            [
                21487,
                21506
            ],
            [
                21522,
                21525
            ],
            [
                21511,
                21518
            ],
            [
                21560,
                21561
            ],
            [
                21637,
                21652
            ],
            [
                21652,
                21711
            ],
            [
                21711,
                21750
            ],
            [
                21750,
                21765
            ],
            [
                21765,
                21825
            ],
            [
                21825,
                21911
            ],
            [
                21911,
                21999
            ],
            [
                21999,
                22033
            ],
            [
                22088,
                22090
            ],
            [
                22090,
                22102
            ],
            [
                22118,
                22154
            ],
            [
                22193,
                22195
            ],
            [
                22195,
                22218
            ],
            [
                22218,
                22228
            ],
            [
                22241,
                22271
            ],
            [
                22287,
                22291
            ],
            [
                22306,
                22317
            ],
            [
                22317,
                22357
            ],
            [
                22357,
                22387
            ],
            [
                22387,
                22421
            ],
            [
                22421,
                22453
            ],
            [
                22453,
                22490
            ],
            [
                22490,
                22508
            ],
            [
                22508,
                22535
            ],
            [
                22535,
                22589
            ],
            [
                22589,
                22599
            ],
            [
                22636,
                22672
            ],
            [
                22790,
                22843
            ],
            [
                22844,
                22857
            ],
            [
                22857,
                22878
            ],
            [
                22883,
                22916
            ],
            [
                22930,
                22932
            ],
            [
                22940,
                22942
            ],
            [
                22942,
                22977
            ],
            [
                23028,
                23047
            ],
            [
                22997,
                22998
            ],
            [
                22977,
                22979
            ],
            [
                23047,
                23049
            ],
            [
                23049,
                23057
            ],
            [
                23057,
                23072
            ],
            [
                23072,
                23118
            ],
            [
                23118,
                23142
            ],
            [
                23151,
                23160
            ],
            [
                23160,
                23213
            ],
            [
                23213,
                23228
            ],
            [
                23543,
                23573
            ],
            [
                23573,
                23581
            ],
            [
                23908,
                23962
            ],
            [
                23986,
                24056
            ],
            [
                24056,
                24077
            ],
            [
                24077,
                24118
            ],
            [
                24139,
                24148
            ],
            [
                24156,
                24158
            ],
            [
                24158,
                24179
            ],
            [
                24179,
                24203
            ],
            [
                24211,
                24213
            ],
            [
                24213,
                24322
            ],
            [
                24380,
                24388
            ],
            [
                24447,
                24449
            ],
            [
                24449,
                24491
            ],
            [
                24491,
                24502
            ],
            [
                24502,
                24525
            ],
            [
                24525,
                24541
            ],
            [
                24541,
                24559
            ],
            [
                24574,
                24585
            ],
            [
                24585,
                24688
            ],
            [
                24689,
                24706
            ],
            [
                24709,
                24718
            ],
            [
                24726,
                24728
            ],
            [
                24728,
                24767
            ],
            [
                24790,
                24806
            ],
            [
                24818,
                24823
            ],
            [
                24837,
                24884
            ],
            [
                24768,
                24770
            ]
        ],
        "row_chars": [
            [
                0,
                98
            ],
            [
                98,
                248
            ],
            [
                248,
                481
            ],
            [
                481,
                645
            ],
            [
                645,
                949
            ],
            [
                949,
                1038
            ],
            [
                1038,
                1206
            ],
            [
                1206,
                1369
            ],
            [
                1369,
                1644
            ],
            [
                1644,
                1719
            ],
            [
                1719,
                1806
            ],
            [
                1806,
                1945
            ],
            [
                1945,
                2238
            ],
            [
                2238,
                2375
            ],
            [
                2375,
                2450
            ],
            [
                2450,
                2721
            ],
            [
                2721,
                2821
            ],
            [
                2821,
                2971
            ],
            [
                2971,
                3176
            ],
            [
                3176,
                3382
            ],
            [
                3382,
                3606
            ],
            [
                3606,
                3819
            ],
            [
                3819,
                3856
            ],
            [
                3856,
                3976
            ],
            [
                3976,
                3993
            ],
            [
                3993,
                4009
            ],
            [
                4009,
                4061
            ],
            [
                4061,
                4163
            ],
            [
                4163,
                4299
            ],
            [
                4299,
                4397
            ],
            [
                4397,
                4430
            ],
            [
                4430,
                4454
            ],
            [
                4454,
                4480
            ],
            [
                4480,
                4569
            ],
            [
                4569,
                4872
            ],
            [
                4872,
                5019
            ],
            [
                5019,
                5119
            ],
            [
                5119,
                5394
            ],
            [
                5394,
                5453
            ],
            [
                5453,
                5598
            ],
            [
                5598,
                5866
            ],
            [
                5866,
                5905
            ],
            [
                5905,
                5986
            ],
            [
                5986,
                6112
            ],
            [
                6112,
                6131
            ],
            [
                6131,
                6148
            ],
            [
                6148,
                6291
            ],
            [
                6291,
                6413
            ],
            [
                6413,
                6445
            ],
            [
                6445,
                6462
            ],
            [
                6462,
                6503
            ],
            [
                6503,
                6548
            ],
            [
                6548,
                6565
            ],
            [
                6565,
                6575
            ],
            [
                6575,
                6638
            ],
            [
                6638,
                6648
            ],
            [
                6648,
                6952
            ],
            [
                6952,
                7172
            ],
            [
                7172,
                7419
            ],
            [
                7419,
                7549
            ],
            [
                7549,
                7636
            ],
            [
                7636,
                7714
            ],
            [
                7714,
                7833
            ],
            [
                7833,
                7849
            ],
            [
                7849,
                8013
            ],
            [
                8013,
                8042
            ],
            [
                8042,
                8112
            ],
            [
                8112,
                8297
            ],
            [
                8297,
                8484
            ],
            [
                8484,
                8622
            ],
            [
                8622,
                8717
            ],
            [
                8717,
                8771
            ],
            [
                8771,
                8901
            ],
            [
                8901,
                8948
            ],
            [
                8948,
                8999
            ],
            [
                8999,
                9042
            ],
            [
                9042,
                9073
            ],
            [
                9073,
                9135
            ],
            [
                9135,
                9257
            ],
            [
                9257,
                9365
            ],
            [
                9365,
                9452
            ],
            [
                9452,
                9524
            ],
            [
                9524,
                9729
            ],
            [
                9729,
                9811
            ],
            [
                9811,
                9860
            ],
            [
                9860,
                9884
            ],
            [
                9884,
                9943
            ],
            [
                9943,
                9996
            ],
            [
                9996,
                10134
            ],
            [
                10134,
                10283
            ],
            [
                10283,
                10354
            ],
            [
                10354,
                10533
            ],
            [
                10533,
                10643
            ],
            [
                10643,
                10887
            ],
            [
                10887,
                10922
            ],
            [
                10922,
                10959
            ],
            [
                10959,
                11068
            ],
            [
                11068,
                11144
            ],
            [
                11144,
                11292
            ],
            [
                11292,
                11335
            ],
            [
                11335,
                11487
            ],
            [
                11487,
                11557
            ],
            [
                11557,
                11620
            ],
            [
                11620,
                11792
            ],
            [
                11792,
                12077
            ],
            [
                12077,
                12373
            ],
            [
                12373,
                12609
            ],
            [
                12609,
                12876
            ],
            [
                12876,
                13195
            ],
            [
                13195,
                13263
            ],
            [
                13263,
                13292
            ],
            [
                13292,
                13371
            ],
            [
                13371,
                13463
            ],
            [
                13463,
                13520
            ],
            [
                13520,
                13769
            ],
            [
                13769,
                13888
            ],
            [
                13888,
                13984
            ],
            [
                13984,
                14037
            ],
            [
                14037,
                14114
            ],
            [
                14114,
                14190
            ],
            [
                14190,
                14241
            ],
            [
                14241,
                14459
            ],
            [
                14459,
                14486
            ],
            [
                14486,
                14649
            ],
            [
                14649,
                14763
            ],
            [
                14763,
                14821
            ],
            [
                14821,
                14918
            ],
            [
                14918,
                15004
            ],
            [
                15004,
                15072
            ],
            [
                15072,
                15170
            ],
            [
                15170,
                15235
            ],
            [
                15235,
                15403
            ],
            [
                15403,
                15488
            ],
            [
                15488,
                15544
            ],
            [
                15544,
                15550
            ],
            [
                15550,
                15679
            ],
            [
                15679,
                15776
            ],
            [
                15776,
                15875
            ],
            [
                15875,
                16031
            ],
            [
                16031,
                16112
            ],
            [
                16112,
                16235
            ],
            [
                16235,
                16389
            ],
            [
                16389,
                16640
            ],
            [
                16640,
                16686
            ],
            [
                16686,
                16721
            ],
            [
                16721,
                16948
            ],
            [
                16948,
                17080
            ],
            [
                17080,
                17136
            ],
            [
                17136,
                17164
            ],
            [
                17164,
                17317
            ],
            [
                17317,
                17457
            ],
            [
                17457,
                17558
            ],
            [
                17558,
                17686
            ],
            [
                17686,
                17742
            ],
            [
                17742,
                17876
            ],
            [
                17876,
                18083
            ],
            [
                18083,
                18223
            ],
            [
                18223,
                18335
            ],
            [
                18335,
                18347
            ],
            [
                18347,
                18518
            ],
            [
                18518,
                18624
            ],
            [
                18624,
                18750
            ],
            [
                18750,
                18802
            ],
            [
                18802,
                18891
            ],
            [
                18891,
                19010
            ],
            [
                19010,
                19068
            ],
            [
                19068,
                19161
            ],
            [
                19161,
                19174
            ],
            [
                19174,
                19221
            ],
            [
                19221,
                19295
            ],
            [
                19295,
                19424
            ],
            [
                19424,
                19519
            ],
            [
                19519,
                19793
            ],
            [
                19793,
                19973
            ],
            [
                19973,
                20012
            ],
            [
                20012,
                20029
            ],
            [
                20029,
                20052
            ],
            [
                20052,
                20070
            ],
            [
                20070,
                20135
            ],
            [
                20135,
                20186
            ],
            [
                20186,
                20214
            ],
            [
                20214,
                20304
            ],
            [
                20304,
                20332
            ],
            [
                20332,
                20546
            ],
            [
                20546,
                20573
            ],
            [
                20573,
                20590
            ],
            [
                20590,
                20635
            ],
            [
                20635,
                20642
            ],
            [
                20642,
                20667
            ],
            [
                20667,
                20684
            ],
            [
                20684,
                20826
            ],
            [
                20826,
                20880
            ],
            [
                20880,
                20904
            ],
            [
                20904,
                20933
            ],
            [
                20933,
                21029
            ],
            [
                21029,
                21077
            ],
            [
                21077,
                21185
            ],
            [
                21185,
                21234
            ],
            [
                21234,
                21258
            ],
            [
                21258,
                21304
            ],
            [
                21304,
                21310
            ],
            [
                21310,
                21327
            ],
            [
                21327,
                21345
            ],
            [
                21345,
                21366
            ],
            [
                21366,
                21372
            ],
            [
                21372,
                21430
            ],
            [
                21430,
                21480
            ],
            [
                21480,
                21652
            ],
            [
                21652,
                21711
            ],
            [
                21711,
                21750
            ],
            [
                21750,
                21765
            ],
            [
                21765,
                21825
            ],
            [
                21825,
                21911
            ],
            [
                21911,
                21999
            ],
            [
                21999,
                22090
            ],
            [
                22090,
                22195
            ],
            [
                22195,
                22218
            ],
            [
                22218,
                22317
            ],
            [
                22317,
                22357
            ],
            [
                22357,
                22387
            ],
            [
                22387,
                22421
            ],
            [
                22421,
                22453
            ],
            [
                22453,
                22490
            ],
            [
                22490,
                22508
            ],
            [
                22508,
                22535
            ],
            [
                22535,
                22589
            ],
            [
                22589,
                22857
            ],
            [
                22857,
                22942
            ],
            [
                22942,
                22977
            ],
            [
                22977,
                23049
            ],
            [
                23049,
                23057
            ],
            [
                23057,
                23072
            ],
            [
                23072,
                23118
            ],
            [
                23118,
                23160
            ],
            [
                23160,
                23213
            ],
            [
                23213,
                23228
            ],
            [
                23228,
                23283
            ],
            [
                23283,
                23300
            ],
            [
                23300,
                23353
            ],
            [
                23353,
                23375
            ],
            [
                23375,
                23438
            ],
            [
                23438,
                23517
            ],
            [
                23517,
                23543
            ],
            [
                23543,
                23573
            ],
            [
                23573,
                23582
            ],
            [
                23582,
                23603
            ],
            [
                23603,
                23614
            ],
            [
                23614,
                23629
            ],
            [
                23629,
                23675
            ],
            [
                23675,
                23731
            ],
            [
                23731,
                23748
            ],
            [
                23748,
                23786
            ],
            [
                23786,
                23824
            ],
            [
                23824,
                23851
            ],
            [
                23851,
                23882
            ],
            [
                23882,
                23908
            ],
            [
                23908,
                24056
            ],
            [
                24056,
                24077
            ],
            [
                24077,
                24118
            ],
            [
                24118,
                24139
            ],
            [
                24139,
                24158
            ],
            [
                24158,
                24179
            ],
            [
                24179,
                24213
            ],
            [
                24213,
                24449
            ],
            [
                24449,
                24491
            ],
            [
                24491,
                24502
            ],
            [
                24502,
                24525
            ],
            [
                24525,
                24541
            ],
            [
                24541,
                24559
            ],
            [
                24559,
                24574
            ],
            [
                24574,
                24585
            ],
            [
                24585,
                24688
            ],
            [
                24688,
                24709
            ],
            [
                24709,
                24728
            ],
            [
                24728,
                25050
            ]
        ]
    },
    "abridged": {
        "text": "Mr. Bucket and his fat forefinger are much in consultation together at present. When Mr. Bucket is considering a matter of this pressing interest, the fat forefinger is in frequent use. He puts it to his ears; he puts it to his lips; he rubs it over his nose; he shakes it before a guilty man.\nMr. Bucket pervades a vast number of houses and strolls about an infinity of streets, to outward appearance rather languishing for want of an object. He is in the friendliest condition towards others and will drink with most of them. He is free with his money, affable in his manners, innocent in his conversation - but through the placid stream of his life there glides an under-current of forefinger.\nMr. Bucket is here today and gone tomorrow - and then here again the next day. This evening he will be casually looking past the door of Sir Leicester Dedlock's house in town; and tomorrow morning he will be walking on the turrets at Chesney Wold, where once the deceased old man walked. Drawers, desks, pockets, all things belonging to Tulkinghorn, Mr. Bucket examines.\nMr. Bucket at present does not go home. Though in general he highly appreciates the society of Mrs. Bucket - a lady of a natural detective genius, which if it had been improved by professional exercise, might have done great things, but which has paused at the level of a clever amateur - he holds himself aloof for now. Mrs. Bucket is dependent on their lodger (fortunately an amiable lady in whom she takes an interest) for companionship.\nA great crowd assembles in Lincoln's Inn Fields on the day of the funeral. Sir Leicester Dedlock attends; there are only three other human followers, but the amount of inconsolable carriages is immense. The peerage contributes more four-wheeled affliction than has ever been seen in that neighbourhood. All the state coachmen in London seem plunged into mourning.\nQuiet among the undertakers, Mr. Bucket sits concealed in one of the inconsolable carriages and at his ease surveys the crowd keenly through the blinds. He looks here and there, up and down, now at the house windows, now along the people's heads; nothing escapes him.\n\"And there you are, my partner, eh?\" says Mr. Bucket to himself, meaning Mrs. Bucket, stationed, by his favour, on the steps of the deceased's house. \"And very well indeed you are looking, Mrs. Bucket!\"\nThe procession has not started yet, but is waiting for the coffin to be brought out. Mr. Bucket uses his two fat forefingers to hold the window a hair's breadth open while he looks.\nAnd it says a great deal for his attachment as a husband, that he is still occupied with Mrs. B. \"There you are, my partner, eh?\" he murmuringly repeats. \"And our lodger with you. I see you, Mrs. Bucket; I hope you're well, my dear!\"\nNot another word does Mr. Bucket say, but sits with most attentive eyes until the coffin is brought down and the procession moves, and his view is changed. After which he composes himself for an easy ride and takes note of the fittings of the carriage in case he should ever find such knowledge useful.\nMr. Bucket glides from the carriage when the right opportunity arrives. He makes for Sir Leicester Dedlock's, which is at present a sort of home to him, where he comes and goes as he likes at all hours, where he is always welcome, and walks in an atmosphere of mysterious greatness.\nMr. Bucket has a key and can pass in at his pleasure. As he is crossing the hall, a footman informs him, \"Here's another letter for you, Mr. Bucket, come by post.\"\n\"Another one, eh?\" says Mr. Bucket. He goes on, letter in hand.\nNow although Mr. Bucket walks upstairs to a little room in the library with the face of a man who receives scores of letters every day, his life does not involve much correspondence. He is no great scribe, and discourages letters from others as being too artless and direct a way of doing delicate business. He often sees damaging letters produced in evidence and reflects that it was naive to write them. For these reasons he has very little to do with letters, either as sender or receiver. And yet he has received half-a-dozen within the last twenty-four hours.\n\"And this,\" says Mr. Bucket, spreading it out on the table, \"is in the same hand, and consists of the same two words.\"\nHe locks the door, takes out his black pocket-book, lays another letter by it, and reads, boldly written in each: \"Lady Dedlock.\"\n\"Yes, yes,\" says Mr. Bucket. \"But I could have made the money without this anonymous information.\"\nHaving put the letters in his book, he unlocks the door just in time to admit his dinner, which is brought in with a decanter of sherry. Mr. Bucket fills and empties his glass with a smack of his lips and is proceeding with his refreshment when an idea enters his mind.\nMr. Bucket softly opens the door between that room and the next and looks in. The library is deserted, and the fire is sinking low. Mr. Bucket's eye alights upon a table where letters are usually put as they arrive. Several letters for Sir Leicester are upon it. Mr. Bucket draws near and examines the directions.\n\"No,\" he says, \"there's none in that hand. It's only me as is written to. I can break it to Sir Leicester Dedlock, Baronet, tomorrow.\"\nWith that he returns to finish his dinner with a good appetite, and after a light nap, is summoned into the drawing-room. Sir Leicester has received him there these several evenings past to know whether he has anything to report. The debilitated cousin and Volumnia are in attendance.\n\"Have you anything new to communicate, officer?\" inquires Sir Leicester. \"Do you wish to hold any conversation with me in private?\"\n\"Not tonight, Sir Leicester Dedlock, Baronet.\"\n\"Because my time,\" pursues Sir Leicester, \"is wholly at your disposal with a view to the vindication of the outraged majesty of the law.\"\nMr. Bucket coughs and glances at Volumnia, rouged and necklaced, as though to respectfully observe, \"I do assure you, you're a pretty creetur. I've seen hundreds worse looking at your time of life, I have indeed.\"\nThe fair Volumnia pauses in her writing to adjust the pearl necklace. Mr. Bucket prices that decoration in his mind and thinks it as likely as not that Volumnia is writing poetry.\n\"I am prepared to defray all costs,\" pursues Sir Leicester, \"to enable you to exercise your utmost skill in this atrocious case. Let no expense be a consideration.\"\nMr. Bucket makes a bow.\n\"I declare,\" says Sir Leicester, his voice trembling and tears in his eyes, \"I solemnly declare that until this crime is solved and punished, I almost feel as if there were a stain upon my name. A gentleman who has devoted a large portion of his life to me, who has sat at my table and slept under my roof, is struck down within an hour of his leaving my house. He may have been followed from my house, even marked because of his association with my house - which may have suggested his possessing greater wealth than his own appearance would have indicated. If I cannot with my influence bring the perpetrators of the crime to light, I fail in my respect for that gentleman's memory.\"\nWhile he says this with great emotion, Mr. Bucket glances at him with an observant gravity in which there might be a touch of compassion.\n\"If it were my brother who had committed this horrible and audacious crime,\" continues Sir Leicester, \"I would not spare him.\"\nMr. Bucket looks very grave. Volumnia remarks of the deceased that he was the trustiest and dearest person!\n\"You must feel it as a deprivation to you, miss,\" replies Mr. Bucket soothingly.\nVolumnia indicates that her sensitive mind is fully made up never to get over it, that her nerves are unstrung for ever, and that she does not expect ever to smile again. Are they are going to convict, or whatever it is, that dreadful soldier? Did he have any accomplices, or whatever the thing is called?\n\"Why you see, miss,\" returns Mr. Bucket, bringing the finger into persuasive action, \"it ain't easy to answer those questions. Not at the present moment. I've kept myself on this case, morning, noon, and night. I could answer your questions, miss, but duty forbids it. Sir Leicester Dedlock, Baronet, will very soon be made acquainted with all that has been traced. And I hope that he may find it\" - Mr. Bucket again looks grave - \"to his satisfaction.\"\nThe debilitated cousin only hopes some fella'll be executed - zample. Far better hang wrong fella than no fella.\n\"In fact, Volumnia,\" proceeds Sir Leicester, \"it is not advisable to ask the officer any such questions. He is the best judge of his own responsibility. And it does not become us, who assist in making the laws, to interfere with those who carry them into execution.\"\n\"Sir Leicester Dedlock, Baronet,\" says Mr. Bucket, \"I have no objections to telling this lady, with your leave, that I look upon the case as pretty well complete. It is a beautiful case, and what little is wanting to complete it, I expect to be able to supply in a few hours.\"\n\"I am very glad indeed to hear it,\" says Sir Leicester. \"Highly creditable to you.\"\n\"Sir Leicester Dedlock, Baronet,\" returns Mr. Bucket very seriously, \"I hope it may do me credit and prove satisfactory to all. When I depict it as a beautiful case, you see, miss,\" he goes on, \"I mean from my point of view. As considered from other points of view, such cases will always involve some unpleasantness. Very strange things come to our knowledge in families, miss.\"\nVolumnia, with her innocent little scream, supposes so.\n\"Aye, even in high families, in great families,\" says Mr. Bucket, gravely eyeing Sir Leicester.\nSir Leicester, deeming it time to dismiss the officer, here majestically interposes with, \"Very good. Thank you!\" and with a wave of his hand.\nMr. Bucket (still grave) inquires if tomorrow morning would suit, if he is then as for'ard as he expects to be.\nSir Leicester replies, \"All times are alike to me.\" Mr. Bucket bows and is withdrawing when a forgotten point occurs to him.\n\"Might I ask, by the by, who posted the reward-bill on the staircase?\"\n\"I ordered it to be put up there,\" replies Sir Leicester.\n\"Would it be considered a liberty, Sir Leicester Dedlock, Baronet, if I was to ask you why?\"\n\"Not at all. I chose it as a conspicuous part of the house. I wish my people to be impressed with the enormity of the crime, the determination to punish it, and the hopelessness of escape.\"\nMr. Bucket repeats his bows and withdraws. Soon he is standing before the bright hall-fire, admiring the footman.\n\"Why, you're six foot two, I suppose?\" says Mr. Bucket.\n\"Three,\" says the footman.\n\"Are you so much? But then, you see, you're broad in proportion and don't look it. A Royal Academy sculptor would pay something handsome to make a drawing of your proportions for the marble. My Lady's out, ain't she?\"\n\"Out to dinner.\"\n\"Goes out pretty well every day, don't she?\"\n\"Yes.\"\n\"Not to be wondered at!\" says Mr. Bucket. \"Such a fine woman as her. My Lady in a good temper?\"\n\"As good as you can expect.\"\n\"Ah!\" says Mr. Bucket. \"A little spoilt? A little capricious? Lord! What can you anticipate when they're so handsome as that? And we like 'em all the better for it, don't we?\"\nThe footman, with his hands in his pockets, can't deny it. Come the roll of wheels and a violent ringing at the bell. \"Talk of the angels,\" says Mr. Bucket. \"Here she is!\"\nThe doors are thrown open, and she passes through the hall. Still very pale, she is dressed in slight mourning and wears two beautiful bracelets. Either their beauty or the beauty of her arms is particularly attractive to Mr. Bucket. He looks at them with an eager eye.\nNoticing him, she turns an inquiring look on the manservant.\n\"Mr. Bucket, my Lady.\"\nMr. Bucket bows and comes forward, passing his forefinger over his mouth.\n\"Are you waiting to see Sir Leicester?\"\n\"No, my Lady, I've seen him!\"\n\"Have you anything to say to me?\"\n\"Not just at present, my Lady.\"\n\"Have you made any new discoveries?\"\n\"A few, my Lady.\"\nThis is merely in passing. She scarcely makes a stop, and sweeps upstairs alone. Mr. Bucket watches her as she goes up the steps, past the printed bill, which she looks at going by, and out of view.\n\"She's a lovely woman, she really is,\" says Mr. Bucket to the footman. \"Don't look quite healthy though.\"\nSuffers much from headaches, he is informed.\nReally? That's a pity! Walking, Mr. Bucket would recommend for that. Well, she tries walking, the footman rejoins. Walks sometimes for two hours when she has them bad. By night, too.\n\"When it's moonlight, though?\"\nOh, yes.\n\"Now I think of it,\" says Mr. Bucket, warming his hands at the blaze, \"she went out walking the very night of this business.\"\n\"To be sure she did! I let her into the garden over the way.\"\n\"Certainly. I saw you doing it.\"\n\"I didn't see you,\" says the footman.\n\"I was rather in a hurry,\" returns Mr. Bucket, \"for I was going to visit a aunt of mine that lives at Chelsea - ninety year old. Yes, I chanced to be passing at the time. Let's see. What time might it be? It wasn't ten.\"\n\"Half-past nine.\"\n\"So it was. And if I don't deceive myself, my Lady was muffled in a loose black mantle, with a deep fringe to it?\"\nOf course she was.\nOf course. Mr. Bucket must return to a little work upstairs, but he shakes hands in acknowledgment of his agreeable conversation before he goes.",
        "paragraph_chars": [
            [
                0,
                294
            ],
            [
                294,
                697
            ],
            [
                697,
                1068
            ],
            [
                1068,
                1509
            ],
            [
                1509,
                1873
            ],
            [
                1873,
                2141
            ],
            [
                2141,
                2344
            ],
            [
                2344,
                2526
            ],
            [
                2526,
                2760
            ],
            [
                2760,
                3063
            ],
            [
                3063,
                3346
            ],
            [
                3346,
                3510
            ],
            [
                3510,
                3574
            ],
            [
                3574,
                4139
            ],
            [
                4139,
                4258
            ],
            [
                4258,
                4388
            ],
            [
                4388,
                4487
            ],
            [
                4487,
                4757
            ],
            [
                4757,
                5071
            ],
            [
                5071,
                5206
            ],
            [
                5206,
                5491
            ],
            [
                5491,
                5623
            ],
            [
                5623,
                5670
            ],
            [
                5670,
                5808
            ],
            [
                5808,
                6022
            ],
            [
                6022,
                6202
            ],
            [
                6202,
                6367
            ],
            [
                6367,
                6391
            ],
            [
                6391,
                7077
            ],
            [
                7077,
                7215
            ],
            [
                7215,
                7342
            ],
            [
                7342,
                7450
            ],
            [
                7450,
                7531
            ],
            [
                7531,
                7837
            ],
            [
                7837,
                8291
            ],
            [
                8291,
                8404
            ],
            [
                8404,
                8671
            ],
            [
                8671,
                8948
            ],
            [
                8948,
                9032
            ],
            [
                9032,
                9412
            ],
            [
                9412,
                9468
            ],
            [
                9468,
                9564
            ],
            [
                9564,
                9707
            ],
            [
                9707,
                9819
            ],
            [
                9819,
                9944
            ],
            [
                9944,
                10015
            ],
            [
                10015,
                10073
            ],
            [
                10073,
                10166
            ],
            [
                10166,
                10356
            ],
            [
                10356,
                10470
            ],
            [
                10470,
                10526
            ],
            [
                10526,
                10553
            ],
            [
                10553,
                10771
            ],
            [
                10771,
                10788
            ],
            [
                10788,
                10833
            ],
            [
                10833,
                10840
            ],
            [
                10840,
                10936
            ],
            [
                10936,
                10965
            ],
            [
                10965,
                11141
            ],
            [
                11141,
                11313
            ],
            [
                11313,
                11583
            ],
            [
                11583,
                11644
            ],
            [
                11644,
                11667
            ],
            [
                11667,
                11741
            ],
            [
                11741,
                11781
            ],
            [
                11781,
                11811
            ],
            [
                11811,
                11845
            ],
            [
                11845,
                11877
            ],
            [
                11877,
                11914
            ],
            [
                11914,
                11932
            ],
            [
                11932,
                12131
            ],
            [
                12131,
                12237
            ],
            [
                12237,
                12282
            ],
            [
                12282,
                12465
            ],
            [
                12465,
                12496
            ],
            [
                12496,
                12505
            ],
            [
                12505,
                12631
            ],
            [
                12631,
                12693
            ],
            [
                12693,
                12726
            ],
            [
                12726,
                12764
            ],
            [
                12764,
                12985
            ],
            [
                12985,
                13003
            ],
            [
                13003,
                13118
            ],
            [
                13118,
                13137
            ],
            [
                13137,
                13281
            ]
        ],
        "segment_chars": [
            [
                0,
                80
            ],
            [
                80,
                186
            ],
            [
                186,
                294
            ],
            [
                294,
                444
            ],
            [
                444,
                528
            ],
            [
                528,
                697
            ],
            [
                697,
                776
            ],
            [
                776,
                985
            ],
            [
                985,
                1068
            ],
            [
                1068,
                1108
            ],
            [
                1108,
                1389
            ],
            [
                1389,
                1509
            ],
            [
                1509,
                1584
            ],
            [
                1584,
                1712
            ],
            [
                1712,
                1812
            ],
            [
                1812,
                1873
            ],
            [
                1873,
                2026
            ],
            [
                2026,
                2141
            ],
            [
                2141,
                2178
            ],
            [
                2178,
                2291
            ],
            [
                2291,
                2344
            ],
            [
                2344,
                2429
            ],
            [
                2429,
                2526
            ],
            [
                2526,
                2623
            ],
            [
                2623,
                2656
            ],
            [
                2656,
                2680
            ],
            [
                2680,
                2706
            ],
            [
                2706,
                2760
            ],
            [
                2760,
                2916
            ],
            [
                2916,
                3063
            ],
            [
                3063,
                3135
            ],
            [
                3135,
                3346
            ],
            [
                3346,
                3400
            ],
            [
                3400,
                3510
            ],
            [
                3510,
                3529
            ],
            [
                3529,
                3546
            ],
            [
                3546,
                3574
            ],
            [
                3574,
                3757
            ],
            [
                3757,
                3882
            ],
            [
                3882,
                3980
            ],
            [
                3980,
                4067
            ],
            [
                4067,
                4139
            ],
            [
                4139,
                4258
            ],
            [
                4258,
                4388
            ],
            [
                4388,
                4417
            ],
            [
                4417,
                4487
            ],
            [
                4487,
                4624
            ],
            [
                4624,
                4757
            ],
            [
                4757,
                4835
            ],
            [
                4835,
                4889
            ],
            [
                4889,
                4973
            ],
            [
                4973,
                5020
            ],
            [
                5020,
                5071
            ],
            [
                5071,
                5114
            ],
            [
                5114,
                5145
            ],
            [
                5145,
                5206
            ],
            [
                5206,
                5328
            ],
            [
                5328,
                5436
            ],
            [
                5436,
                5491
            ],
            [
                5491,
                5540
            ],
            [
                5540,
                5564
            ],
            [
                5564,
                5623
            ],
            [
                5623,
                5670
            ],
            [
                5670,
                5808
            ],
            [
                5808,
                5951
            ],
            [
                5951,
                6022
            ],
            [
                6022,
                6092
            ],
            [
                6092,
                6202
            ],
            [
                6202,
                6331
            ],
            [
                6331,
                6367
            ],
            [
                6367,
                6391
            ],
            [
                6391,
                6586
            ],
            [
                6586,
                6753
            ],
            [
                6753,
                6950
            ],
            [
                6950,
                7077
            ],
            [
                7077,
                7215
            ],
            [
                7215,
                7342
            ],
            [
                7342,
                7371
            ],
            [
                7371,
                7450
            ],
            [
                7450,
                7531
            ],
            [
                7531,
                7702
            ],
            [
                7702,
                7775
            ],
            [
                7775,
                7837
            ],
            [
                7837,
                7964
            ],
            [
                7964,
                7991
            ],
            [
                7991,
                8048
            ],
            [
                8048,
                8106
            ],
            [
                8106,
                8203
            ],
            [
                8203,
                8291
            ],
            [
                8291,
                8361
            ],
            [
                8361,
                8404
            ],
            [
                8404,
                8509
            ],
            [
                8509,
                8557
            ],
            [
                8557,
                8671
            ],
            [
                8671,
                8834
            ],
            [
                8834,
                8948
            ],
            [
                8948,
                9004
            ],
            [
                9004,
                9032
            ],
            [
                9032,
                9160
            ],
            [
                9160,
                9257
            ],
            [
                9257,
                9350
            ],
            [
                9350,
                9412
            ],
            [
                9412,
                9468
            ],
            [
                9468,
                9564
            ],
            [
                9564,
                9666
            ],
            [
                9666,
                9678
            ],
            [
                9678,
                9707
            ],
            [
                9707,
                9819
            ],
            [
                9819,
                9871
            ],
            [
                9871,
                9944
            ],
            [
                9944,
                10015
            ],
            [
                10015,
                10073
            ],
            [
                10073,
                10166
            ],
            [
                10166,
                10179
            ],
            [
                10179,
                10226
            ],
            [
                10226,
                10356
            ],
            [
                10356,
                10399
            ],
            [
                10399,
                10470
            ],
            [
                10470,
                10509
            ],
            [
                10509,
                10526
            ],
            [
                10526,
                10553
            ],
            [
                10553,
                10571
            ],
            [
                10571,
                10636
            ],
            [
                10636,
                10744
            ],
            [
                10744,
                10771
            ],
            [
                10771,
                10788
            ],
            [
                10788,
                10833
            ],
            [
                10833,
                10840
            ],
            [
                10840,
                10865
            ],
            [
                10865,
                10882
            ],
            [
                10882,
                10909
            ],
            [
                10909,
                10936
            ],
            [
                10936,
                10965
            ],
            [
                10965,
                10971
            ],
            [
                10971,
                10988
            ],
            [
                10988,
                11006
            ],
            [
                11006,
                11027
            ],
            [
                11027,
                11033
            ],
            [
                11033,
                11091
            ],
            [
                11091,
                11141
            ],
            [
                11141,
                11200
            ],
            [
                11200,
                11259
            ],
            [
                11259,
                11298
            ],
            [
                11298,
                11313
            ],
            [
                11313,
                11373
            ],
            [
                11373,
                11459
            ],
            [
                11459,
                11547
            ],
            [
                11547,
                11583
            ],
            [
                11583,
                11644
            ],
            [
                11644,
                11667
            ],
            [
                11667,
                11741
            ],
            [
                11741,
                11781
            ],
            [
                11781,
                11811
            ],
            [
                11811,
                11845
            ],
            [
                11845,
                11877
            ],
            [
                11877,
                11914
            ],
            [
                11914,
                11932
            ],
            [
                11932,
                11959
            ],
            [
                11959,
                12013
            ],
            [
                12013,
                12131
            ],
            [
                12131,
                12202
            ],
            [
                12202,
                12237
            ],
            [
                12237,
                12282
            ],
            [
                12282,
                12290
            ],
            [
                12290,
                12305
            ],
            [
                12305,
                12351
            ],
            [
                12351,
                12397
            ],
            [
                12397,
                12450
            ],
            [
                12450,
                12465
            ],
            [
                12465,
                12496
            ],
            [
                12496,
                12505
            ],
            [
                12505,
                12631
            ],
            [
                12631,
                12652
            ],
            [
                12652,
                12693
            ],
            [
                12693,
                12705
            ],
            [
                12705,
                12726
            ],
            [
                12726,
                12764
            ],
            [
                12764,
                12893
            ],
            [
                12893,
                12935
            ],
            [
                12935,
                12946
            ],
            [
                12946,
                12969
            ],
            [
                12969,
                12985
            ],
            [
                12985,
                13003
            ],
            [
                13003,
                13015
            ],
            [
                13015,
                13118
            ],
            [
                13118,
                13137
            ],
            [
                13137,
                13148
            ],
            [
                13148,
                13281
            ]
        ],
        "overlap_chars": [
            [
                0,
                67
            ],
            [
                78,
                80
            ],
            [
                80,
                95
            ],
            [
                111,
                145
            ],
            [
                145,
                165
            ],
            [
                184,
                186
            ],
            [
                186,
                208
            ],
            [
                208,
                232
            ],
            [
                232,
                258
            ],
            [
                258,
                292
            ],
            [
                292,
                293
            ],
            [
                296,
                444
            ],
            [
                444,
                486
            ],
            [
                494,
                528
            ],
            [
                528,
                607
            ],
            [
                610,
                697
            ],
            [
                699,
                707
            ],
            [
                708,
                715
            ],
            [
                722,
                730
            ],
            [
                740,
                741
            ],
            [
                742,
                745
            ],
            [
                751,
                776
            ],
            [
                776,
                816
            ],
            [
                822,
                876
            ],
            [
                886,
                919
            ],
            [
                928,
                950
            ],
            [
                956,
                959
            ],
            [
                969,
                983
            ],
            [
                983,
                985
            ],
            [
                985,
                1033
            ],
            [
                1045,
                1067
            ],
            [
                1070,
                1108
            ],
            [
                1108,
                1174
            ],
            [
                1177,
                1354
            ],
            [
                1357,
                1379
            ],
            [
                1387,
                1389
            ],
            [
                1389,
                1507
            ],
            [
                1507,
                1509
            ],
            [
                1509,
                1584
            ],
            [
                1584,
                1613
            ],
            [
                1613,
                1614
            ],
            [
                1615,
                1658
            ],
            [
                1659,
                1712
            ],
            [
                1712,
                1812
            ],
            [
                1812,
                1871
            ],
            [
                1871,
                1873
            ],
            [
                1873,
                1900
            ],
            [
                1900,
                1998
            ],
            [
                2006,
                2017
            ],
            [
                2018,
                2026
            ],
            [
                2026,
                2028
            ],
            [
                2035,
                2050
            ],
            [
                2051,
                2053
            ],
            [
                2054,
                2057
            ],
            [
                2062,
                2067
            ],
            [
                2068,
                2118
            ],
            [
                2120,
                2141
            ],
            [
                2141,
                2178
            ],
            [
                2178,
                2205
            ],
            [
                2214,
                2291
            ],
            [
                2292,
                2344
            ],
            [
                2344,
                2402
            ],
            [
                2410,
                2429
            ],
            [
                2429,
                2439
            ],
            [
                2440,
                2480
            ],
            [
                2488,
                2526
            ],
            [
                2526,
                2569
            ],
            [
                2570,
                2623
            ],
            [
                2623,
                2656
            ],
            [
                2656,
                2680
            ],
            [
                2680,
                2706
            ],
            [
                2706,
                2707
            ],
            [
                2712,
                2743
            ],
            [
                2748,
                2760
            ],
            [
                2760,
                2841
            ],
            [
                2849,
                2864
            ],
            [
                2865,
                2868
            ],
            [
                2869,
                2894
            ],
            [
                2899,
                2916
            ],
            [
                2916,
                3063
            ],
            [
                3063,
                3073
            ],
            [
                3074,
                3107
            ],
            [
                3114,
                3125
            ],
            [
                3126,
                3135
            ],
            [
                3135,
                3292
            ],
            [
                3292,
                3346
            ],
            [
                3357,
                3360
            ],
            [
                3361,
                3400
            ],
            [
                3400,
                3427
            ],
            [
                3438,
                3507
            ],
            [
                3510,
                3529
            ],
            [
                3529,
                3545
            ],
            [
                3549,
                3574
            ],
            [
                3574,
                3615
            ],
            [
                3618,
                3624
            ],
            [
                3633,
                3636
            ],
            [
                3637,
                3644
            ],
            [
                3645,
                3680
            ],
            [
                3681,
                3709
            ],
            [
                3710,
                3718
            ],
            [
                3724,
                3727
            ],
            [
                3736,
                3755
            ],
            [
                3755,
                3757
            ],
            [
                3757,
                3779
            ],
            [
                3780,
                3795
            ],
            [
                3809,
                3882
            ],
            [
                3882,
                3937
            ],
            [
                3947,
                3958
            ],
            [
                3965,
                3980
            ],
            [
                3980,
                4067
            ],
            [
                4067,
                4090
            ],
            [
                4091,
                4095
            ],
            [
                4096,
                4097
            ],
            [
                4097,
                4139
            ],
            [
                4139,
                4258
            ],
            [
                4258,
                4260
            ],
            [
                4267,
                4276
            ],
            [
                4287,
                4308
            ],
            [
                4308,
                4309
            ],
            [
                4310,
                4370
            ],
            [
                4372,
                4388
            ],
            [
                4388,
                4417
            ],
            [
                4417,
                4487
            ],
            [
                4487,
                4521
            ],
            [
                4521,
                4593
            ],
            [
                4597,
                4624
            ],
            [
                4635,
                4757
            ],
            [
                4757,
                4789
            ],
            [
                4790,
                4835
            ],
            [
                4835,
                4889
            ],
            [
                4889,
                4905
            ],
            [
                4906,
                4973
            ],
            [
                4973,
                5020
            ],
            [
                5020,
                5070
            ],
            [
                5071,
                5114
            ],
            [
                5114,
                5145
            ],
            [
                5145,
                5194
            ],
            [
                5203,
                5206
            ],
            [
                5206,
                5328
            ],
            [
                5328,
                5436
            ],
            [
                5436,
                5458
            ],
            [
                5459,
                5491
            ],
            [
                5491,
                5540
            ],
            [
                5540,
                5564
            ],
            [
                5564,
                5623
            ],
            [
                5623,
                5624
            ],
            [
                5624,
                5627
            ],
            [
                5635,
                5670
            ],
            [
                5670,
                5808
            ],
            [
                5808,
                5882
            ],
            [
                5886,
                5951
            ],
            [
                5951,
                6022
            ],
            [
                6022,
                6039
            ],
            [
                6040,
                6049
            ],
            [
                6050,
                6053
            ],
            [
                6054,
                6061
            ],
            [
                6072,
                6092
            ],
            [
                6092,
                6202
            ],
            [
                6202,
                6203
            ],
            [
                6203,
                6204
            ],
            [
                6217,
                6219
            ],
            [
                6236,
                6263
            ],
            [
                6273,
                6276
            ],
            [
                6277,
                6329
            ],
            [
                6329,
                6331
            ],
            [
                6331,
                6364
            ],
            [
                6367,
                6377
            ],
            [
                6384,
                6385
            ],
            [
                6386,
                6389
            ],
            [
                6389,
                6391
            ],
            [
                6391,
                6403
            ],
            [
                6404,
                6408
            ],
            [
                6422,
                6423
            ],
            [
                6444,
                6447
            ],
            [
                6454,
                6456
            ],
            [
                6465,
                6511
            ],
            [
                6523,
                6586
            ],
            [
                6586,
                6648
            ],
            [
                6649,
                6656
            ],
            [
                6657,
                6697
            ],
            [
                6698,
                6753
            ],
            [
                6753,
                6793
            ],
            [
                6794,
                6798
            ],
            [
                6799,
                6846
            ],
            [
                6849,
                6903
            ],
            [
                6904,
                6916
            ],
            [
                6928,
                6950
            ],
            [
                6950,
                6969
            ],
            [
                6970,
                6979
            ],
            [
                6980,
                6985
            ],
            [
                6986,
                7005
            ],
            [
                7006,
                7009
            ],
            [
                7010,
                7035
            ],
            [
                7036,
                7074
            ],
            [
                7074,
                7077
            ],
            [
                7077,
                7085
            ],
            [
                7091,
                7095
            ],
            [
                7096,
                7114
            ],
            [
                7114,
                7191
            ],
            [
                7192,
                7215
            ],
            [
                7216,
                7255
            ],
            [
                7315,
                7316
            ],
            [
                7318,
                7342
            ],
            [
                7342,
                7371
            ],
            [
                7371,
                7450
            ],
            [
                7450,
                7529
            ],
            [
                7529,
                7530
            ],
            [
                7531,
                7539
            ],
            [
                7550,
                7603
            ],
            [
                7609,
                7611
            ],
            [
                7611,
                7664
            ],
            [
                7670,
                7673
            ],
            [
                7681,
                7685
            ],
            [
                7686,
                7688
            ],
            [
                7695,
                7702
            ],
            [
                7706,
                7775
            ],
            [
                7779,
                7781
            ],
            [
                7787,
                7835
            ],
            [
                7835,
                7836
            ],
            [
                7837,
                7920
            ],
            [
                7922,
                7962
            ],
            [
                7962,
                7964
            ],
            [
                7964,
                7991
            ],
            [
                7991,
                8021
            ],
            [
                8022,
                8048
            ],
            [
                8048,
                8106
            ],
            [
                8106,
                8203
            ],
            [
                8203,
                8234
            ],
            [
                8239,
                8265
            ],
            [
                8268,
                8291
            ],
            [
                8291,
                8329
            ],
            [
                8335,
                8350
            ],
            [
                8353,
                8361
            ],
            [
                8361,
                8382
            ],
            [
                8387,
                8388
            ],
            [
                8389,
                8396
            ],
            [
                8402,
                8404
            ],
            [
                8404,
                8459
            ],
            [
                8470,
                8507
            ],
            [
                8507,
                8509
            ],
            [
                8509,
                8555
            ],
            [
                8555,
                8557
            ],
            [
                8557,
                8617
            ],
            [
                8618,
                8668
            ],
            [
                8671,
                8702
            ],
            [
                8712,
                8720
            ],
            [
                8720,
                8721
            ],
            [
                8723,
                8781
            ],
            [
                8781,
                8834
            ],
            [
                8834,
                8856
            ],
            [
                8858,
                8948
            ],
            [
                8948,
                9004
            ],
            [
                9004,
                9032
            ],
            [
                9032,
                9115
            ],
            [
                9116,
                9160
            ],
            [
                9160,
                9213
            ],
            [
                9217,
                9224
            ],
            [
                9224,
                9257
            ],
            [
                9257,
                9328
            ],
            [
                9334,
                9350
            ],
            [
                9350,
                9369
            ],
            [
                9375,
                9409
            ],
            [
                9409,
                9412
            ],
            [
                9412,
                9468
            ],
            [
                9468,
                9473
            ],
            [
                9474,
                9478
            ],
            [
                9479,
                9533
            ],
            [
                9534,
                9562
            ],
            [
                9562,
                9563
            ],
            [
                9564,
                9652
            ],
            [
                9652,
                9666
            ],
            [
                9666,
                9678
            ],
            [
                9678,
                9681
            ],
            [
                9682,
                9705
            ],
            [
                9705,
                9706
            ],
            [
                9707,
                9743
            ],
            [
                9753,
                9760
            ],
            [
                9761,
                9772
            ],
            [
                9776,
                9778
            ],
            [
                9787,
                9818
            ],
            [
                9819,
                9871
            ],
            [
                9871,
                9881
            ],
            [
                9882,
                9944
            ],
            [
                9944,
                9967
            ],
            [
                9967,
                9968
            ],
            [
                9969,
                10012
            ],
            [
                10015,
                10073
            ],
            [
                10073,
                10166
            ],
            [
                10166,
                10179
            ],
            [
                10179,
                10226
            ],
            [
                10226,
                10353
            ],
            [
                10356,
                10366
            ],
            [
                10375,
                10378
            ],
            [
                10379,
                10383
            ],
            [
                10388,
                10397
            ],
            [
                10397,
                10398
            ],
            [
                10407,
                10409
            ],
            [
                10410,
                10429
            ],
            [
                10430,
                10436
            ],
            [
                10437,
                10446
            ],
            [
                10446,
                10447
            ],
            [
                10451,
                10456
            ],
            [
                10457,
                10460
            ],
            [
                10468,
                10470
            ],
            [
                10470,
                10509
            ],
            [
                10509,
                10526
            ],
            [
                10526,
                10539
            ],
            [
                10551,
                10553
            ],
            [
                10553,
                10571
            ],
            [
                10571,
                10636
            ],
            [
                10636,
                10666
            ],
            [
                10671,
                10744
            ],
            [
                10744,
                10771
            ],
            [
                10771,
                10788
            ],
            [
                10788,
                10833
            ],
            [
                10833,
                10840
            ],
            [
                10840,
                10865
            ],
            [
                10865,
                10882
            ],
            [
                10882,
                10907
            ],
            [
                10907,
                10909
            ],
            [
                10909,
                10916
            ],
            [
                10920,
                10936
            ],
            [
                10936,
                10965
            ],
            [
                10965,
                10971
            ],
            [
                10971,
                10988
            ],
            [
                10988,
                11006
            ],
            [
                11006,
                11027
            ],
            [
                11027,
                11033
            ],
            [
                11033,
                11091
            ],
            [
                11091,
                11141
            ],
            [
                11141,
                11144
            ],
            [
                11149,
                11152
            ],
            [
                11152,
                11171
            ],
            [
                11172,
                11175
            ],
            [
                11176,
                11183
            ],
            [
                11183,
                11184
            ],
            [
                11185,
                11200
            ],
            [
                11200,
                11259
            ],
            [
                11259,
                11298
            ],
            [
                11298,
                11313
            ],
            [
                11313,
                11373
            ],
            [
                11373,
                11459
            ],
            [
                11459,
                11547
            ],
            [
                11547,
                11581
            ],
            [
                11581,
                11583
            ],
            [
                11583,
                11595
            ],
            [
                11595,
                11631
            ],
            [
                11642,
                11644
            ],
            [
                11644,
                11667
            ],
            [
                11667,
                11677
            ],
            [
                11683,
                11713
            ],
            [
                11725,
                11729
            ],
            [
                11730,
                11741
            ],
            [
                11741,
                11781
            ],
            [
                11781,
                11811
            ],
            [
                11811,
                11845
            ],
            [
                11845,
                11877
            ],
            [
                11877,
                11914
            ],
            [
                11914,
                11932
            ],
            [
                11932,
                11959
            ],
            [
                11959,
                12013
            ],
            [
                12013,
                12023
            ],
            [
                12024,
                12060
            ],
            [
                12060,
                12113
            ],
            [
                12118,
                12131
            ],
            [
                12131,
                12152
            ],
            [
                12152,
                12185
            ],
            [
                12186,
                12188
            ],
            [
                12200,
                12202
            ],
            [
                12202,
                12237
            ],
            [
                12245,
                12264
            ],
            [
                12264,
                12265
            ],
            [
                12269,
                12271
            ],
            [
                12280,
                12282
            ],
            [
                12282,
                12290
            ],
            [
                12290,
                12305
            ],
            [
                12305,
                12351
            ],
            [
                12351,
                12375
            ],
            [
                12388,
                12397
            ],
            [
                12397,
                12450
            ],
            [
                12450,
                12465
            ],
            [
                12466,
                12496
            ],
            [
                12496,
                12504
            ],
            [
                12506,
                12560
            ],
            [
                12561,
                12631
            ],
            [
                12631,
                12652
            ],
            [
                12652,
                12693
            ],
            [
                12694,
                12703
            ],
            [
                12703,
                12705
            ],
            [
                12705,
                12726
            ],
            [
                12726,
                12750
            ],
            [
                12762,
                12764
            ],
            [
                12764,
                12873
            ],
            [
                12883,
                12891
            ],
            [
                12891,
                12893
            ],
            [
                12893,
                12935
            ],
            [
                12935,
                12946
            ],
            [
                12946,
                12969
            ],
            [
                12969,
                12985
            ],
            [
                12985,
                13003
            ],
            [
                13004,
                13015
            ],
            [
                13015,
                13118
            ],
            [
                13118,
                13135
            ],
            [
                13137,
                13146
            ],
            [
                13146,
                13148
            ],
            [
                13148,
                13187
            ],
            [
                13188,
                13204
            ],
            [
                13212,
                13217
            ],
            [
                13218,
                13265
            ],
            [
                13273,
                13275
            ]
        ],
        "row_chars": [
            [
                0,
                80
            ],
            [
                80,
                186
            ],
            [
                186,
                294
            ],
            [
                294,
                294
            ],
            [
                294,
                444
            ],
            [
                444,
                528
            ],
            [
                528,
                697
            ],
            [
                697,
                776
            ],
            [
                776,
                985
            ],
            [
                985,
                1068
            ],
            [
                1068,
                1068
            ],
            [
                1068,
                1108
            ],
            [
                1108,
                1389
            ],
            [
                1389,
                1509
            ],
            [
                1509,
                1584
            ],
            [
                1584,
                1712
            ],
            [
                1712,
                1812
            ],
            [
                1812,
                1812
            ],
            [
                1812,
                1812
            ],
            [
                1812,
                1873
            ],
            [
                1873,
                2026
            ],
            [
                2026,
                2141
            ],
            [
                2141,
                2178
            ],
            [
                2178,
                2291
            ],
            [
                2291,
                2291
            ],
            [
                2291,
                2291
            ],
            [
                2291,
                2344
            ],
            [
                2344,
                2429
            ],
            [
                2429,
                2526
            ],
            [
                2526,
                2623
            ],
            [
                2623,
                2656
            ],
            [
                2656,
                2680
            ],
            [
                2680,
                2706
            ],
            [
                2706,
                2760
            ],
            [
                2760,
                2916
            ],
            [
                2916,
                3063
            ],
            [
                3063,
                3063
            ],
            [
                3063,
                3063
            ],
            [
                3063,
                3063
            ],
            [
                3063,
                3135
            ],
            [
                3135,
                3346
            ],
            [
                3346,
                3346
            ],
            [
                3346,
                3400
            ],
            [
                3400,
                3510
            ],
            [
                3510,
                3529
            ],
            [
                3529,
                3546
            ],
            [
                3546,
                3546
            ],
            [
                3546,
                3546
            ],
            [
                3546,
                3546
            ],
            [
                3546,
                3546
            ],
            [
                3546,
                3546
            ],
            [
                3546,
                3546
            ],
            [
                3546,
                3546
            ],
            [
                3546,
                3546
            ],
            [
                3546,
                3546
            ],
            [
                3546,
                3546
            ],
            [
                3546,
                3574
            ],
            [
                3574,
                3757
            ],
            [
                3757,
                3882
            ],
            [
                3882,
                3980
            ],
            [
                3980,
                4067
            ],
            [
                4067,
                4139
            ],
            [
                4139,
                4258
            ],
            [
                4258,
                4258
            ],
            [
                4258,
                4388
            ],
            [
                4388,
                4417
            ],
            [
                4417,
                4487
            ],
            [
                4487,
                4624
            ],
            [
                4624,
                4624
            ],
            [
                4624,
                4757
            ],
            [
                4757,
                4835
            ],
            [
                4835,
                4889
            ],
            [
                4889,
                4973
            ],
            [
                4973,
                5020
            ],
            [
                5020,
                5071
            ],
            [
                5071,
                5114
            ],
            [
                5114,
                5145
            ],
            [
                5145,
                5206
            ],
            [
                5206,
                5328
            ],
            [
                5328,
                5436
            ],
            [
                5436,
                5491
            ],
            [
                5491,
                5491
            ],
            [
                5491,
                5491
            ],
            [
                5491,
                5491
            ],
            [
                5491,
                5540
            ],
            [
                5540,
                5564
            ],
            [
                5564,
                5623
            ],
            [
                5623,
                5670
            ],
            [
                5670,
                5808
            ],
            [
                5808,
                5951
            ],
            [
                5951,
                6022
            ],
            [
                6022,
                6092
            ],
            [
                6092,
                6202
            ],
            [
                6202,
                6331
            ],
            [
                6331,
                6367
            ],
            [
                6367,
                6367
            ],
            [
                6367,
                6367
            ],
            [
                6367,
                6391
            ],
            [
                6391,
                6391
            ],
            [
                6391,
                6391
            ],
            [
                6391,
                6391
            ],
            [
                6391,
                6391
            ],
            [
                6391,
                6391
            ],
            [
                6391,
                6586
            ],
            [
                6586,
                6753
            ],
            [
                6753,
                6950
            ],
            [
                6950,
                7077
            ],
            [
                7077,
                7215
            ],
            [
                7215,
                7215
            ],
            [
                7215,
                7342
            ],
            [
                7342,
                7371
            ],
            [
                7371,
                7450
            ],
            [
                7450,
                7531
            ],
            [
                7531,
                7531
            ],
            [
                7531,
                7702
            ],
            [
                7702,
                7702
            ],
            [
                7702,
                7702
            ],
            [
                7702,
                7702
            ],
            [
                7702,
                7775
            ],
            [
                7775,
                7837
            ],
            [
                7837,
                7837
            ],
            [
                7837,
                7964
            ],
            [
                7964,
                7991
            ],
            [
                7991,
                8048
            ],
            [
                8048,
                8048
            ],
            [
                8048,
                8106
            ],
            [
                8106,
                8203
            ],
            [
                8203,
                8291
            ],
            [
                8291,
                8361
            ],
            [
                8361,
                8361
            ],
            [
                8361,
                8404
            ],
            [
                8404,
                8404
            ],
            [
                8404,
                8404
            ],
            [
                8404,
                8404
            ],
            [
                8404,
                8404
            ],
            [
                8404,
                8404
            ],
            [
                8404,
                8404
            ],
            [
                8404,
                8404
            ],
            [
                8404,
                8509
            ],
            [
                8509,
                8557
            ],
            [
                8557,
                8671
            ],
            [
                8671,
                8671
            ],
            [
                8671,
                8671
            ],
            [
                8671,
                8671
            ],
            [
                8671,
                8671
            ],
            [
                8671,
                8834
            ],
            [
                8834,
                8948
            ],
            [
                8948,
                9004
            ],
            [
                9004,
                9032
            ],
            [
                9032,
                9160
            ],
            [
                9160,
                9257
            ],
            [
                9257,
                9350
            ],
            [
                9350,
                9412
            ],
            [
                9412,
                9468
            ],
            [
                9468,
                9564
            ],
            [
                9564,
                9564
            ],
            [
                9564,
                9564
            ],
            [
                9564,
                9666
            ],
            [
                9666,
                9678
            ],
            [
                9678,
                9707
            ],
            [
                9707,
                9707
            ],
            [
                9707,
                9819
            ],
            [
                9819,
                9871
            ],
            [
                9871,
                9944
            ],
            [
                9944,
                10015
            ],
            [
                10015,
                10073
            ],
            [
                10073,
                10166
            ],
            [
                10166,
                10179
            ],
            [
                10179,
                10226
            ],
            [
                10226,
                10226
            ],
            [
                10226,
                10356
            ],
            [
                10356,
                10356
            ],
            [
                10356,
                10399
            ],
            [
                10399,
                10470
            ],
            [
                10470,
                10509
            ],
            [
                10509,
                10526
            ],
            [
                10526,
                10553
            ],
            [
                10553,
                10571
            ],
            [
                10571,
                10636
            ],
            [
                10636,
                10636
            ],
            [
                10636,
                10636
            ],
            [
                10636,
                10636
            ],
            [
                10636,
                10636
            ],
            [
                10636,
                10744
            ],
            [
                10744,
                10771
            ],
            [
                10771,
                10788
            ],
            [
                10788,
                10833
            ],
            [
                10833,
                10840
            ],
            [
                10840,
                10865
            ],
            [
                10865,
                10882
            ],
            [
                10882,
                10909
            ],
            [
                10909,
                10909
            ],
            [
                10909,
                10909
            ],
            [
                10909,
                10909
            ],
            [
                10909,
                10909
            ],
            [
                10909,
                10909
            ],
            [
                10909,
                10909
            ],
            [
                10909,
                10909
            ],
            [
                10909,
                10936
            ],
            [
                10936,
                10965
            ],
            [
                10965,
                10971
            ],
            [
                10971,
                10988
            ],
            [
                10988,
                11006
            ],
            [
                11006,
                11027
            ],
            [
                11027,
                11033
            ],
            [
                11033,
                11091
            ],
            [
                11091,
                11141
            ],
            [
                11141,
                11200
            ],
            [
                11200,
                11259
            ],
            [
                11259,
                11298
            ],
            [
                11298,
                11313
            ],
            [
                11313,
                11373
            ],
            [
                11373,
                11459
            ],
            [
                11459,
                11547
            ],
            [
                11547,
                11583
            ],
            [
                11583,
                11644
            ],
            [
                11644,
                11667
            ],
            [
                11667,
                11741
            ],
            [
                11741,
                11781
            ],
            [
                11781,
                11811
            ],
            [
                11811,
                11845
            ],
            [
                11845,
                11877
            ],
            [
                11877,
                11914
            ],
            [
                11914,
                11932
            ],
            [
                11932,
                11959
            ],
            [
                11959,
                12013
            ],
            [
                12013,
                12131
            ],
            [
                12131,
                12202
            ],
            [
                12202,
                12237
            ],
            [
                12237,
                12282
            ],
            [
                12282,
                12290
            ],
            [
                12290,
                12305
            ],
            [
                12305,
                12351
            ],
            [
                12351,
                12397
            ],
            [
                12397,
                12450
            ],
            [
                12450,
                12465
            ],
            [
                12465,
                12465
            ],
            [
                12465,
                12465
            ],
            [
                12465,
                12465
            ],
            [
                12465,
                12465
            ],
            [
                12465,
                12465
            ],
            [
                12465,
                12465
            ],
            [
                12465,
                12465
            ],
            [
                12465,
                12496
            ],
            [
                12496,
                12505
            ],
            [
                12505,
                12505
            ],
            [
                12505,
                12505
            ],
            [
                12505,
                12505
            ],
            [
                12505,
                12505
            ],
            [
                12505,
                12505
            ],
            [
                12505,
                12505
            ],
            [
                12505,
                12505
            ],
            [
                12505,
                12505
            ],
            [
                12505,
                12505
            ],
            [
                12505,
                12505
            ],
            [
                12505,
                12505
            ],
            [
                12505,
                12631
            ],
            [
                12631,
                12652
            ],
            [
                12652,
                12693
            ],
            [
                12693,
                12693
            ],
            [
                12693,
                12705
            ],
            [
                12705,
                12726
            ],
            [
                12726,
                12764
            ],
            [
                12764,
                12893
            ],
            [
                12893,
                12935
            ],
            [
                12935,
                12946
            ],
            [
                12946,
                12969
            ],
            [
                12969,
                12985
            ],
            [
                12985,
                13003
            ],
            [
                13003,
                13003
            ],
            [
                13003,
                13015
            ],
            [
                13015,
                13118
            ],
            [
                13118,
                13137
            ],
            [
                13137,
                13148
            ],
            [
                13148,
                13281
            ]
        ]
    }
}