{
    "original": {
        "text": "Impassive, as behoves its high breeding, the Dedlock town house stares at the other houses in the street of dismal grandeur and gives no outward sign of anything going wrong within. Carriages rattle, doors are battered at, the world exchanges calls; ancient charmers with skeleton throats and peachy cheeks that have a rather ghastly bloom upon them seen by daylight, when indeed these fascinating creatures look like Death and the Lady fused together, dazzle the eyes of men. Forth from the frigid mews come easily swinging carriages guided by short-legged coachmen in flaxen wigs, deep sunk into downy hammercloths, and up behind mount luscious Mercuries bearing sticks of state and wearing cocked hats broadwise, a spectacle for the angels.\nThe Dedlock town house changes not externally, and hours pass before its exalted dullness is disturbed within. But Volumnia the fair, being subject to the prevalent complaint of boredom and finding that disorder attacking her spirits with some virulence, ventures at length to repair to the library for change of scene. Her gentle tapping at the door producing no response, she opens it and peeps in; seeing no one there, takes possession.\nThe sprightly Dedlock is reputed, in that grass-grown city of the ancients, Bath, to be stimulated by an urgent curiosity which impels her on all convenient and inconvenient occasions to sidle about with a golden glass at her eye, peering into objects of every description. Certain it is that she avails herself of the present opportunity of hovering over her kinsman's letters and papers like a bird, taking a short peck at this document and a blink with her head on one side at that document, and hopping about from table to table with her glass at her eye in an inquisitive and restless manner. In the course of these researches she stumbles over something, and turning her glass in that direction, sees her kinsman lying on the ground like a felled tree.\nVolumnia's pet little scream acquires a considerable augmentation of reality from this surprise, and the house is quickly in commotion. Servants tear up and down stairs, bells are violently rung, doctors are sent for, and Lady Dedlock is sought in all directions, but not found. Nobody has seen or heard her since she last rang her bell. Her letter to Sir Leicester is discovered on her table, but it is doubtful yet whether he has not received another missive from another world requiring to be personally answered, and all the living languages, and all the dead, are as one to him.\nThey lay him down upon his bed, and chafe, and rub, and fan, and put ice to his head, and try every means of restoration. Howbeit, the day has ebbed away, and it is night in his room before his stertorous breathing lulls or his fixed eyes show any consciousness of the candle that is occasionally passed before them. But when this change begins, it goes on; and by and by he nods or moves his eyes or even his hand in token that he hears and comprehends.\nHe fell down, this morning, a handsome stately gentleman, somewhat infirm, but of a fine presence, and with a well-filled face. He lies upon his bed, an aged man with sunken cheeks, the decrepit shadow of himself. His voice was rich and mellow and he had so long been thoroughly persuaded of the weight and import to mankind of any word he said that his words really had come to sound as if there were something in them. But now he can only whisper, and what he whispers sounds like what it is--mere jumble and jargon.\nHis favourite and faithful housekeeper stands at his bedside. It is the first act he notices, and he clearly derives pleasure from it. After vainly trying to make himself understood in speech, he makes signs for a pencil. So inexpressively that they cannot at first understand him; it is his old housekeeper who makes out what he wants and brings in a slate.\nAfter pausing for some time, he slowly scrawls upon it in a hand that is not his, \"Chesney Wold?\"\nNo, she tells him; he is in London. He was taken ill in the library this morning. Right thankful she is that she happened to come to London and is able to attend upon him.\n\"It is not an illness of any serious consequence, Sir Leicester. You will be much better to-morrow, Sir Leicester. All the gentlemen say so.\" This, with the tears coursing down her fair old face.\nAfter making a survey of the room and looking with particular attention all round the bed where the doctors stand, he writes, \"My Lady.\"\n\"My Lady went out, Sir Leicester, before you were taken ill, and don't know of your illness yet.\"\nHe points again, in great agitation, at the two words. They all try to quiet him, but he points again with increased agitation. On their looking at one another, not knowing what to say, he takes the slate once more and writes \"My Lady. For God's sake, where?\" And makes an imploring moan.\nIt is thought better that his old housekeeper should give him Lady Dedlock's letter, the contents of which no one knows or can surmise. She opens it for him and puts it out for his perusal. Having read it twice by a great effort, he turns it down so that it shall not be seen and lies moaning. He passes into a kind of relapse or into a swoon, and it is an hour before he opens his eyes, reclining on his faithful and attached old servant's arm. The doctors know that he is best with her, and when not actively engaged about him, stand aloof.\nThe slate comes into requisition again, but the word he wants to write he cannot remember. His anxiety, his eagerness, and affliction at this pass are pitiable to behold. It seems as if he must go mad in the necessity he feels for haste and the inability under which he labours of expressing to do what or to fetch whom. He has written the letter B, and there stopped. Of a sudden, in the height of his misery, he puts Mr. before it. The old housekeeper suggests Bucket. Thank heaven! That's his meaning.\nMr. Bucket is found to be downstairs, by appointment. Shall he come up?\nThere is no possibility of misconstruing Sir Leicester's burning wish to see him or the desire he signifies to have the room cleared of every one but the housekeeper. It is speedily done, and Mr. Bucket appears. Of all men upon earth, Sir Leicester seems fallen from his high estate to place his sole trust and reliance upon this man.\n\"Sir Leicester Dedlock, Baronet, I'm sorry to see you like this. I hope you'll cheer up. I'm sure you will, on account of the family credit.\"\nSir Leicester puts her letter in his hands and looks intently in his face while he reads it. A new intelligence comes into Mr. Bucket's eye as he reads on; with one hook of his finger, while that eye is still glancing over the words, he indicates, \"Sir Leicester Dedlock, Baronet, I understand you.\"\nSir Leicester writes upon the slate. \"Full forgiveness. Find--\" Mr. Bucket stops his hand.\n\"Sir Leicester Dedlock, Baronet, I'll find her. But my search after her must be begun out of hand. Not a minute must be lost.\"\nWith the quickness of thought, he follows Sir Leicester Dedlock's look towards a little box upon a table.\n\"Bring it here, Sir Leicester Dedlock, Baronet? Certainly. Open it with one of these here keys? Certainly. The littlest key? TO be sure. Take the notes out? So I will. Count 'em? That's soon done. Twenty and thirty's fifty, and twenty's seventy, and fifty's one twenty, and forty's one sixty. Take 'em for expenses? That I'll do, and render an account of course. Don't spare money? No I won't.\"\nThe velocity and certainty of Mr. Bucket's interpretation on all these heads is little short of miraculous. Mrs. Rouncewell, who holds the light, is giddy with the swiftness of his eyes and hands as he starts up, furnished for his journey.\n\"You're George's mother, old lady; that's about what you are, I believe?\" says Mr. Bucket aside, with his hat already on and buttoning his coat.\n\"Yes, sir, I am his distressed mother.\"\n\"So I thought, according to what he mentioned to me just now. Well, then, I'll tell you something. You needn't be distressed no more. Your son's all right. Now, don't you begin a-crying, because what you've got to do is to take care of Sir Leicester Dedlock, Baronet, and you won't do that by crying. As to your son, he's all right, I tell you; and he sends his loving duty, and hoping you're the same. He's discharged honourable; that's about what HE is; with no more imputation on his character than there is on yours, and yours is a tidy one, I'LL bet a pound. You may trust me, for I took your son. He conducted himself in a game way, too, on that occasion; and he's a fine-made man, and you're a fine-made old lady, and you're a mother and son, the pair of you, as might be showed for models in a caravan. Sir Leicester Dedlock, Baronet, what you've trusted to me I'll go through with. Don't you be afraid of my turning out of my way, right or left, or taking a sleep, or a wash, or a shave till I have found what I go in search of. Say everything as is kind and forgiving on your part? Sir Leicester Dedlock, Baronet, I will. And I wish you better, and these family affairs smoothed over--as, Lord, many other family affairs equally has been, and equally will be, to the end of time.\"\nWith this peroration, Mr. Bucket, buttoned up, goes quietly out, looking steadily before him as if he were already piercing the night in quest of the fugitive.\nHis first step is to take himself to Lady Dedlock's rooms and look all over them for any trifling indication that may help him. The rooms are in darkness now; and to see Mr. Bucket with a wax-light in his hand, holding it above his head and taking a sharp mental inventory of the many delicate objects so curiously at variance with himself, would be to see a sight--which nobody DOES see, as he is particular to lock himself in.\n\"A spicy boudoir, this,\" says Mr. Bucket, who feels in a manner furbished up in his French by the blow of the morning. \"Must have cost a sight of money. Rum articles to cut away from, these; she must have been hard put to it!\"\nOpening and shutting table-drawers and looking into caskets and jewel-cases, he sees the reflection of himself in various mirrors, and moralizes thereon.\n\"One might suppose I was a-moving in the fashionable circles and getting myself up for almac's,\" says Mr. Bucket. \"I begin to think I must be a swell in the Guards without knowing it.\"\nEver looking about, he has opened a dainty little chest in an inner drawer. His great hand, turning over some gloves which it can scarcely feel, they are so light and soft within it, comes upon a white handkerchief.\n\"Hum! Let's have a look at YOU,\" says Mr. Bucket, putting down the light. \"What should YOU be kept by yourself for? What's YOUR motive? Are you her ladyship's property, or somebody else's? You've got a mark upon you somewheres or another, I suppose?\"\nHe finds it as he speaks, \"Esther Summerson.\"\n\"Oh!\" says Mr. Bucket, pausing, with his finger at his ear. \"Come, I'll take YOU.\"\nHe completes his observations as quietly and carefully as he has carried them on, leaves everything else precisely as he found it, glides away after some five minutes in all, and passes into the street. With a glance upward at the dimly lighted windows of Sir Leicester's room, he sets off, full-swing, to the nearest coach-stand, picks out the horse for his money, and directs to be driven to the shooting gallery. Mr. Bucket does not claim to be a scientific judge of horses, but he lays out a little money on the principal events in that line, and generally sums up his knowledge of the subject in the remark that when he sees a horse as can go, he knows him.\nHis knowledge is not at fault in the present instance. Clattering over the stones at a dangerous pace, yet thoughtfully bringing his keen eyes to bear on every slinking creature whom he passes in the midnight streets, and even on the lights in upper windows where people are going or gone to bed, and on all the turnings that he rattles by, and alike on the heavy sky, and on the earth where the snow lies thin--for something may present itself to assist him, anywhere--he dashes to his destination at such a speed that when he stops the horse half smothers him in a cloud of steam.\n\"Unbear him half a moment to freshen him up, and I'll be back.\"\nHe runs up the long wooden entry and finds the trooper smoking his pipe.\n\"I thought I should, George, after what you have gone through, my lad. I haven't a word to spare. Now, honour! All to save a woman. Miss Summerson that was here when Gridley died--that was the name, I know--all right--where does she live?\"\nThe trooper has just come from there and gives him the address, near Oxford Street.\n\"You won't repent it, George. Good night!\"\nHe is off again, with an impression of having seen Phil sitting by the frosty fire staring at him open-mouthed, and gallops away again, and gets out in a cloud of steam again.\nMr. Jarndyce, the only person up in the house, is just going to bed, rises from his book on hearing the rapid ringing at the bell, and comes down to the door in his dressing-gown.\n\"Don't be alarmed, sir.\" In a moment his visitor is confidential with him in the hall, has shut the door, and stands with his hand upon the lock. \"I've had the pleasure of seeing you before. Inspector Bucket. Look at that handkerchief, sir, Miss Esther Summerson's. Found it myself put away in a drawer of Lady Dedlock's, quarter of an hour ago. Not a moment to lose. Matter of life or death. You know Lady Dedlock?\"\n\"Yes.\"\n\"There has been a discovery there to-day. Family affairs have come out. Sir Leicester Dedlock, Baronet, has had a fit--apoplexy or paralysis--and couldn't be brought to, and precious time has been lost. Lady Dedlock disappeared this afternoon and left a letter for him that looks bad. Run your eye over it. Here it is!\"\nMr. Jarndyce, having read it, asks him what he thinks.\n\"I don't know. It looks like suicide. Anyways, there's more and more danger, every minute, of its drawing to that. I'd give a hundred pound an hour to have got the start of the present time. Now, Mr. Jarndyce, I am employed by Sir Leicester Dedlock, Baronet, to follow her and find her, to save her and take her his forgiveness. I have money and full power, but I want something else. I want Miss Summerson.\"\nMr. Jarndyce in a troubled voice repeats, \"Miss Summerson?\"\n\"Now, Mr. Jarndyce\"--Mr. Bucket has read his face with the greatest attention all along--\"I speak to you as a gentleman of a humane heart, and under such pressing circumstances as don't often happen. If ever delay was dangerous, it's dangerous now; and if ever you couldn't afterwards forgive yourself for causing it, this is the time. Eight or ten hours, worth, as I tell you, a hundred pound apiece at least, have been lost since Lady Dedlock disappeared. I am charged to find her. I am Inspector Bucket. Besides all the rest that's heavy on her, she has upon her, as she believes, suspicion of murder. If I follow her alone, she, being in ignorance of what Sir Leicester Dedlock, Baronet, has communicated to me, may be driven to desperation. But if I follow her in company with a young lady, answering to the description of a young lady that she has a tenderness for--I ask no question, and I say no more than that--she will give me credit for being friendly. Let me come up with her and be able to have the hold upon her of putting that young lady for'ard, and I'll save her and prevail with her if she is alive. Let me come up with her alone--a hard matter--and I'll do my best, but I don't answer for what the best may be. Time flies; it's getting on for one o'clock. When one strikes, there's another hour gone, and it's worth a thousand pound now instead of a hundred.\"\nThis is all true, and the pressing nature of the case cannot be questioned. Mr. Jarndyce begs him to remain there while he speaks to Miss Summerson. Mr. Bucket says he will, but acting on his usual principle, does no such thing, following upstairs instead and keeping his man in sight. So he remains, dodging and lurking about in the gloom of the staircase while they confer. In a very little time Mr. Jarndyce comes down and tells him that Miss Summerson will join him directly and place herself under his protection to accompany him where he pleases. Mr. Bucket, satisfied, expresses high approval and awaits her coming at the door.\nThere he mounts a high tower in his mind and looks out far and wide. Many solitary figures he perceives creeping through the streets; many solitary figures out on heaths, and roads, and lying under haystacks. But the figure that he seeks is not among them. Other solitaries he perceives, in nooks of bridges, looking over; and in shadowed places down by the river's level; and a dark, dark, shapeless object drifting with the tide, more solitary than all, clings with a drowning hold on his attention.\nWhere is she? Living or dead, where is she? If, as he folds the handkerchief and carefully puts it up, it were able with an enchanted power to bring before him the place where she found it and the night-landscape near the cottage where it covered the little child, would he descry her there? On the waste where the brick-kilns are burning with a pale blue flare, where the straw-roofs of the wretched huts in which the bricks are made are being scattered by the wind, where the clay and water are hard frozen and the mill in which the gaunt blind horse goes round all day looks like an instrument of human torture--traversing this deserted, blighted spot there is a lonely figure with the sad world to itself, pelted by the snow and driven by the wind, and cast out, it would seem, from all companionship. It is the figure of a woman, too; but it is miserably dressed, and no such clothes ever came through the hall and out at the great door of the Dedlock mansion.",
        "paragraph_chars": [
            [
                0,
                744
            ],
            [
                744,
                1184
            ],
            [
                1184,
                1943
            ],
            [
                1943,
                2527
            ],
            [
                2527,
                2982
            ],
            [
                2982,
                3501
            ],
            [
                3501,
                3860
            ],
            [
                3860,
                3958
            ],
            [
                3958,
                4130
            ],
            [
                4130,
                4326
            ],
            [
                4326,
                4463
            ],
            [
                4463,
                4561
            ],
            [
                4561,
                4850
            ],
            [
                4850,
                5393
            ],
            [
                5393,
                5898
            ],
            [
                5898,
                5970
            ],
            [
                5970,
                6305
            ],
            [
                6305,
                6447
            ],
            [
                6447,
                6747
            ],
            [
                6747,
                6838
            ],
            [
                6838,
                6965
            ],
            [
                6965,
                7071
            ],
            [
                7071,
                7466
            ],
            [
                7466,
                7706
            ],
            [
                7706,
                7851
            ],
            [
                7851,
                7891
            ],
            [
                7891,
                9182
            ],
            [
                9182,
                9342
            ],
            [
                9342,
                9771
            ],
            [
                9771,
                9998
            ],
            [
                9998,
                10152
            ],
            [
                10152,
                10337
            ],
            [
                10337,
                10553
            ],
            [
                10553,
                10804
            ],
            [
                10804,
                10850
            ],
            [
                10850,
                10933
            ],
            [
                10933,
                11596
            ],
            [
                11596,
                12179
            ],
            [
                12179,
                12243
            ],
            [
                12243,
                12316
            ],
            [
                12316,
                12556
            ],
            [
                12556,
                12640
            ],
            [
                12640,
                12683
            ],
            [
                12683,
                12859
            ],
            [
                12859,
                13039
            ],
            [
                13039,
                13456
            ],
            [
                13456,
                13463
            ],
            [
                13463,
                13783
            ],
            [
                13783,
                13838
            ],
            [
                13838,
                14247
            ],
            [
                14247,
                14307
            ],
            [
                14307,
                15686
            ],
            [
                15686,
                16321
            ],
            [
                16321,
                16823
            ],
            [
                16823,
                17788
            ]
        ],
        "segment_chars": [
            [
                0,
                182
            ],
            [
                182,
                477
            ],
            [
                477,
                744
            ],
            [
                744,
                855
            ],
            [
                855,
                1064
            ],
            [
                1064,
                1184
            ],
            [
                1184,
                1458
            ],
            [
                1458,
                1782
            ],
            [
                1782,
                1943
            ],
            [
                1943,
                2079
            ],
            [
                2079,
                2222
            ],
            [
                2222,
                2281
            ],
            [
                2281,
                2527
            ],
            [
                2527,
                2649
            ],
            [
                2649,
                2844
            ],
            [
                2844,
                2982
            ],
            [
                2982,
                3110
            ],
            [
                3110,
                3196
            ],
            [
                3196,
                3403
            ],
            [
                3403,
                3501
            ],
            [
                3501,
                3563
            ],
            [
                3563,
                3636
            ],
            [
                3636,
                3723
            ],
            [
                3723,
                3860
            ],
            [
                3860,
                3958
            ],
            [
                3958,
                3994
            ],
            [
                3994,
                4040
            ],
            [
                4040,
                4130
            ],
            [
                4130,
                4195
            ],
            [
                4195,
                4245
            ],
            [
                4245,
                4272
            ],
            [
                4272,
                4326
            ],
            [
                4326,
                4463
            ],
            [
                4463,
                4561
            ],
            [
                4561,
                4616
            ],
            [
                4616,
                4689
            ],
            [
                4689,
                4797
            ],
            [
                4797,
                4821
            ],
            [
                4821,
                4850
            ],
            [
                4850,
                4986
            ],
            [
                4986,
                5040
            ],
            [
                5040,
                5144
            ],
            [
                5144,
                5296
            ],
            [
                5296,
                5393
            ],
            [
                5393,
                5484
            ],
            [
                5484,
                5564
            ],
            [
                5564,
                5714
            ],
            [
                5714,
                5762
            ],
            [
                5762,
                5827
            ],
            [
                5827,
                5864
            ],
            [
                5864,
                5878
            ],
            [
                5878,
                5898
            ],
            [
                5898,
                5952
            ],
            [
                5952,
                5970
            ],
            [
                5970,
                6137
            ],
            [
                6137,
                6182
            ],
            [
                6182,
                6305
            ],
            [
                6305,
                6370
            ],
            [
                6370,
                6394
            ],
            [
                6394,
                6447
            ],
            [
                6447,
                6540
            ],
            [
                6540,
                6747
            ],
            [
                6747,
                6784
            ],
            [
                6784,
                6803
            ],
            [
                6803,
                6838
            ],
            [
                6838,
                6886
            ],
            [
                6886,
                6937
            ],
            [
                6937,
                6965
            ],
            [
                6965,
                7071
            ],
            [
                7071,
                7119
            ],
            [
                7119,
                7130
            ],
            [
                7130,
                7167
            ],
            [
                7167,
                7178
            ],
            [
                7178,
                7196
            ],
            [
                7196,
                7208
            ],
            [
                7208,
                7228
            ],
            [
                7228,
                7239
            ],
            [
                7239,
                7250
            ],
            [
                7250,
                7268
            ],
            [
                7268,
                7364
            ],
            [
                7364,
                7387
            ],
            [
                7387,
                7434
            ],
            [
                7434,
                7453
            ],
            [
                7453,
                7466
            ],
            [
                7466,
                7574
            ],
            [
                7574,
                7706
            ],
            [
                7706,
                7780
            ],
            [
                7780,
                7851
            ],
            [
                7851,
                7891
            ],
            [
                7891,
                7953
            ],
            [
                7953,
                7990
            ],
            [
                7990,
                8025
            ],
            [
                8025,
                8047
            ],
            [
                8047,
                8192
            ],
            [
                8192,
                8294
            ],
            [
                8294,
                8455
            ],
            [
                8455,
                8494
            ],
            [
                8494,
                8702
            ],
            [
                8702,
                8782
            ],
            [
                8782,
                8929
            ],
            [
                8929,
                8983
            ],
            [
                8983,
                9023
            ],
            [
                9023,
                9182
            ],
            [
                9182,
                9342
            ],
            [
                9342,
                9470
            ],
            [
                9470,
                9771
            ],
            [
                9771,
                9890
            ],
            [
                9890,
                9924
            ],
            [
                9924,
                9998
            ],
            [
                9998,
                10152
            ],
            [
                10152,
                10266
            ],
            [
                10266,
                10337
            ],
            [
                10337,
                10413
            ],
            [
                10413,
                10553
            ],
            [
                10553,
                10559
            ],
            [
                10559,
                10627
            ],
            [
                10627,
                10669
            ],
            [
                10669,
                10689
            ],
            [
                10689,
                10742
            ],
            [
                10742,
                10804
            ],
            [
                10804,
                10850
            ],
            [
                10850,
                10856
            ],
            [
                10856,
                10910
            ],
            [
                10910,
                10933
            ],
            [
                10933,
                11136
            ],
            [
                11136,
                11349
            ],
            [
                11349,
                11596
            ],
            [
                11596,
                11651
            ],
            [
                11651,
                12179
            ],
            [
                12179,
                12243
            ],
            [
                12243,
                12316
            ],
            [
                12316,
                12387
            ],
            [
                12387,
                12414
            ],
            [
                12414,
                12427
            ],
            [
                12427,
                12448
            ],
            [
                12448,
                12556
            ],
            [
                12556,
                12640
            ],
            [
                12640,
                12670
            ],
            [
                12670,
                12683
            ],
            [
                12683,
                12859
            ],
            [
                12859,
                13039
            ],
            [
                13039,
                13064
            ],
            [
                13064,
                13185
            ],
            [
                13185,
                13230
            ],
            [
                13230,
                13248
            ],
            [
                13248,
                13305
            ],
            [
                13305,
                13385
            ],
            [
                13385,
                13407
            ],
            [
                13407,
                13432
            ],
            [
                13432,
                13456
            ],
            [
                13456,
                13463
            ],
            [
                13463,
                13505
            ],
            [
                13505,
                13535
            ],
            [
                13535,
                13666
            ],
            [
                13666,
                13748
            ],
            [
                13748,
                13770
            ],
            [
                13770,
                13783
            ],
            [
                13783,
                13838
            ],
            [
                13838,
                13853
            ],
            [
                13853,
                13876
            ],
            [
                13876,
                13953
            ],
            [
                13953,
                14029
            ],
            [
                14029,
                14167
            ],
            [
                14167,
                14223
            ],
            [
                14223,
                14247
            ],
            [
                14247,
                14307
            ],
            [
                14307,
                14507
            ],
            [
                14507,
                14643
            ],
            [
                14643,
                14765
            ],
            [
                14765,
                14791
            ],
            [
                14791,
                14814
            ],
            [
                14814,
                14912
            ],
            [
                14912,
                15053
            ],
            [
                15053,
                15271
            ],
            [
                15271,
                15425
            ],
            [
                15425,
                15537
            ],
            [
                15537,
                15582
            ],
            [
                15582,
                15686
            ],
            [
                15686,
                15762
            ],
            [
                15762,
                15835
            ],
            [
                15835,
                15972
            ],
            [
                15972,
                16062
            ],
            [
                16062,
                16239
            ],
            [
                16239,
                16321
            ],
            [
                16321,
                16390
            ],
            [
                16390,
                16530
            ],
            [
                16530,
                16578
            ],
            [
                16578,
                16823
            ],
            [
                16823,
                16837
            ],
            [
                16837,
                16867
            ],
            [
                16867,
                17115
            ],
            [
                17115,
                17629
            ],
            [
                17629,
                17788
            ]
        ],
        "overlap_chars": [
            [
                0,
                161
            ],
            [
                168,
                182
            ],
            [
                795,
                846
            ],
            [
                853,
                855
            ],
            [
                855,
                877
            ],
            [
                997,
                1017
            ],
            [
                1028,
                1064
            ],
            [
                1064,
                1165
            ],
            [
                1182,
                1184
            ],
            [
                1477,
                1480
            ],
            [
                1499,
                1502
            ],
            [
                1511,
                1634
            ],
            [
                1661,
                1677
            ],
            [
                1635,
                1660
            ],
            [
                1677,
                1678
            ],
            [
                1683,
                1716
            ],
            [
                1743,
                1782
            ],
            [
                1782,
                1856
            ],
            [
                1884,
                1943
            ],
            [
                1943,
                1995
            ],
            [
                2009,
                2079
            ],
            [
                2079,
                2187
            ],
            [
                2205,
                2222
            ],
            [
                2281,
                2403
            ],
            [
                2522,
                2525
            ],
            [
                2433,
                2435
            ],
            [
                2409,
                2422
            ],
            [
                2458,
                2459
            ],
            [
                2527,
                2558
            ],
            [
                2583,
                2586
            ],
            [
                2568,
                2569
            ],
            [
                2592,
                2649
            ],
            [
                2658,
                2669
            ],
            [
                2680,
                2697
            ],
            [
                2710,
                2810
            ],
            [
                2824,
                2844
            ],
            [
                2844,
                2847
            ],
            [
                2889,
                2982
            ],
            [
                2982,
                3038
            ],
            [
                3108,
                3110
            ],
            [
                3110,
                3196
            ],
            [
                3196,
                3229
            ],
            [
                3401,
                3403
            ],
            [
                3403,
                3430
            ],
            [
                3477,
                3501
            ],
            [
                3501,
                3504
            ],
            [
                3519,
                3563
            ],
            [
                3563,
                3636
            ],
            [
                3636,
                3723
            ],
            [
                3758,
                3760
            ],
            [
                3789,
                3808
            ],
            [
                3813,
                3860
            ],
            [
                3889,
                3919
            ],
            [
                3920,
                3924
            ],
            [
                3940,
                3958
            ],
            [
                3958,
                3994
            ],
            [
                3994,
                4039
            ],
            [
                4130,
                4195
            ],
            [
                4195,
                4218
            ],
            [
                4272,
                4326
            ],
            [
                4326,
                4331
            ],
            [
                4364,
                4371
            ],
            [
                4398,
                4463
            ],
            [
                4463,
                4561
            ],
            [
                4561,
                4616
            ],
            [
                4616,
                4620
            ],
            [
                4625,
                4689
            ],
            [
                4689,
                4797
            ],
            [
                4797,
                4821
            ],
            [
                4821,
                4850
            ],
            [
                4850,
                4933
            ],
            [
                4984,
                4986
            ],
            [
                4986,
                5010
            ],
            [
                5016,
                5022
            ],
            [
                5038,
                5040
            ],
            [
                5040,
                5144
            ],
            [
                5144,
                5168
            ],
            [
                5187,
                5236
            ],
            [
                5294,
                5295
            ],
            [
                5393,
                5402
            ],
            [
                5426,
                5484
            ],
            [
                5484,
                5526
            ],
            [
                5540,
                5564
            ],
            [
                5564,
                5596
            ],
            [
                5620,
                5633
            ],
            [
                5638,
                5647
            ],
            [
                5685,
                5687
            ],
            [
                5691,
                5698
            ],
            [
                5611,
                5613
            ],
            [
                5712,
                5714
            ],
            [
                5714,
                5762
            ],
            [
                5762,
                5773
            ],
            [
                5802,
                5827
            ],
            [
                5827,
                5864
            ],
            [
                5864,
                5878
            ],
            [
                5878,
                5898
            ],
            [
                5898,
                5911
            ],
            [
                5924,
                5934
            ],
            [
                5950,
                5952
            ],
            [
                5952,
                5970
            ],
            [
                5970,
                6050
            ],
            [
                6051,
                6105
            ],
            [
                6116,
                6137
            ],
            [
                6137,
                6181
            ],
            [
                6305,
                6368
            ],
            [
                6447,
                6465
            ],
            [
                6470,
                6540
            ],
            [
                6540,
                6602
            ],
            [
                6681,
                6693
            ],
            [
                6638,
                6642
            ],
            [
                6747,
                6784
            ],
            [
                6784,
                6803
            ],
            [
                6803,
                6807
            ],
            [
                6811,
                6838
            ],
            [
                6838,
                6839
            ],
            [
                6871,
                6886
            ],
            [
                6886,
                6899
            ],
            [
                6910,
                6914
            ],
            [
                6935,
                6937
            ],
            [
                6937,
                6965
            ],
            [
                6965,
                7071
            ],
            [
                7071,
                7072
            ],
            [
                7072,
                7100
            ],
            [
                7117,
                7119
            ],
            [
                7119,
                7130
            ],
            [
                7130,
                7167
            ],
            [
                7208,
                7228
            ],
            [
                7228,
                7239
            ],
            [
                7239,
                7250
            ],
            [
                7250,
                7254
            ],
            [
                7350,
                7364
            ],
            [
                7364,
                7387
            ],
            [
                7387,
                7399
            ],
            [
                7432,
                7434
            ],
            [
                7434,
                7453
            ],
            [
                7453,
                7455
            ],
            [
                7456,
                7466
            ],
            [
                7466,
                7469
            ],
            [
                7493,
                7523
            ],
            [
                7543,
                7574
            ],
            [
                7574,
                7620
            ],
            [
                7662,
                7677
            ],
            [
                7689,
                7706
            ],
            [
                7706,
                7739
            ],
            [
                7766,
                7780
            ],
            [
                7780,
                7851
            ],
            [
                7851,
                7891
            ],
            [
                7891,
                7904
            ],
            [
                7951,
                7953
            ],
            [
                7953,
                7990
            ],
            [
                8025,
                8047
            ],
            [
                8047,
                8192
            ],
            [
                8192,
                8210
            ],
            [
                8243,
                8264
            ],
            [
                8292,
                8294
            ],
            [
                8294,
                8320
            ],
            [
                8410,
                8411
            ],
            [
                8347,
                8359
            ],
            [
                8371,
                8410
            ],
            [
                8453,
                8455
            ],
            [
                8557,
                8611
            ],
            [
                8518,
                8519
            ],
            [
                8625,
                8656
            ],
            [
                8700,
                8702
            ],
            [
                8702,
                8782
            ],
            [
                8785,
                8787
            ],
            [
                8887,
                8929
            ],
            [
                8929,
                8983
            ],
            [
                8983,
                9021
            ],
            [
                9182,
                9191
            ],
            [
                9202,
                9214
            ],
            [
                9229,
                9245
            ],
            [
                9340,
                9342
            ],
            [
                9346,
                9351
            ],
            [
                9368,
                9403
            ],
            [
                9409,
                9426
            ],
            [
                9451,
                9470
            ],
            [
                9470,
                9500
            ],
            [
                9512,
                9522
            ],
            [
                9759,
                9769
            ],
            [
                9551,
                9552
            ],
            [
                9501,
                9504
            ],
            [
                9528,
                9529
            ],
            [
                9534,
                9539
            ],
            [
                9564,
                9578
            ],
            [
                9769,
                9771
            ],
            [
                9771,
                9811
            ],
            [
                9888,
                9890
            ],
            [
                9890,
                9922
            ],
            [
                10357,
                10413
            ],
            [
                10413,
                10453
            ],
            [
                10518,
                10553
            ],
            [
                10553,
                10559
            ],
            [
                10559,
                10627
            ],
            [
                10627,
                10669
            ],
            [
                10669,
                10689
            ],
            [
                10689,
                10742
            ],
            [
                10742,
                10804
            ],
            [
                10804,
                10828
            ],
            [
                10830,
                10850
            ],
            [
                10850,
                10856
            ],
            [
                10856,
                10880
            ],
            [
                10908,
                10910
            ],
            [
                10910,
                10933
            ],
            [
                10933,
                10962
            ],
            [
                10978,
                10987
            ],
            [
                11013,
                11063
            ],
            [
                10974,
                10977
            ],
            [
                11064,
                11075
            ],
            [
                11119,
                11136
            ],
            [
                11211,
                11222
            ],
            [
                11236,
                11273
            ],
            [
                11141,
                11142
            ],
            [
                11278,
                11283
            ],
            [
                11297,
                11349
            ],
            [
                11349,
                11417
            ],
            [
                11545,
                11596
            ],
            [
                11596,
                11625
            ],
            [
                11649,
                11651
            ],
            [
                11651,
                11715
            ],
            [
                11729,
                11738
            ],
            [
                11750,
                11813
            ],
            [
                11982,
                12006
            ],
            [
                11891,
                11892
            ],
            [
                12066,
                12179
            ],
            [
                12243,
                12257
            ],
            [
                12270,
                12316
            ],
            [
                12316,
                12317
            ],
            [
                12387,
                12412
            ],
            [
                12335,
                12343
            ],
            [
                12412,
                12414
            ],
            [
                12414,
                12427
            ],
            [
                12427,
                12448
            ],
            [
                12448,
                12494
            ],
            [
                12534,
                12556
            ],
            [
                12556,
                12567
            ],
            [
                12597,
                12640
            ],
            [
                12640,
                12670
            ],
            [
                12670,
                12683
            ],
            [
                12683,
                12699
            ],
            [
                12795,
                12811
            ],
            [
                12832,
                12834
            ],
            [
                12837,
                12851
            ],
            [
                12857,
                12859
            ],
            [
                12859,
                12926
            ],
            [
                12959,
                13039
            ],
            [
                13039,
                13064
            ],
            [
                13064,
                13090
            ],
            [
                13113,
                13185
            ],
            [
                13185,
                13230
            ],
            [
                13230,
                13248
            ],
            [
                13248,
                13255
            ],
            [
                13261,
                13305
            ],
            [
                13305,
                13385
            ],
            [
                13385,
                13407
            ],
            [
                13407,
                13432
            ],
            [
                13432,
                13456
            ],
            [
                13456,
                13463
            ],
            [
                13463,
                13496
            ],
            [
                13503,
                13505
            ],
            [
                13505,
                13535
            ],
            [
                13535,
                13580
            ],
            [
                13582,
                13603
            ],
            [
                13633,
                13666
            ],
            [
                13666,
                13748
            ],
            [
                13748,
                13770
            ],
            [
                13770,
                13783
            ],
            [
                13783,
                13838
            ],
            [
                13838,
                13853
            ],
            [
                13853,
                13876
            ],
            [
                13876,
                13897
            ],
            [
                13907,
                13913
            ],
            [
                13929,
                13931
            ],
            [
                13947,
                13951
            ],
            [
                13913,
                13927
            ],
            [
                13951,
                13953
            ],
            [
                14029,
                14167
            ],
            [
                14167,
                14179
            ],
            [
                14194,
                14223
            ],
            [
                14223,
                14247
            ],
            [
                14247,
                14307
            ],
            [
                14307,
                14326
            ],
            [
                14330,
                14384
            ],
            [
                14396,
                14416
            ],
            [
                14432,
                14438
            ],
            [
                14417,
                14426
            ],
            [
                14505,
                14507
            ],
            [
                14507,
                14554
            ],
            [
                14641,
                14643
            ],
            [
                14643,
                14661
            ],
            [
                14718,
                14765
            ],
            [
                14765,
                14791
            ],
            [
                14791,
                14814
            ],
            [
                14814,
                14912
            ],
            [
                14912,
                14938
            ],
            [
                15023,
                15053
            ],
            [
                15053,
                15101
            ],
            [
                15148,
                15177
            ],
            [
                15179,
                15225
            ],
            [
                15227,
                15271
            ],
            [
                15537,
                15580
            ],
            [
                15762,
                15835
            ],
            [
                15835,
                15863
            ],
            [
                15895,
                15972
            ],
            [
                15975,
                15977
            ],
            [
                16013,
                16062
            ],
            [
                16086,
                16168
            ],
            [
                16207,
                16239
            ],
            [
                16239,
                16321
            ],
            [
                16321,
                16390
            ],
            [
                16390,
                16495
            ],
            [
                16507,
                16530
            ],
            [
                16530,
                16578
            ],
            [
                16578,
                16597
            ],
            [
                16628,
                16642
            ],
            [
                16621,
                16628
            ],
            [
                16642,
                16684
            ],
            [
                16692,
                16823
            ],
            [
                16823,
                16837
            ],
            [
                16837,
                16867
            ],
            [
                17115,
                17184
            ],
            [
                17289,
                17422
            ],
            [
                17429,
                17436
            ],
            [
                17201,
                17202
            ],
            [
                17445,
                17574
            ],
            [
                17627,
                17629
            ],
            [
                17629,
                17656
            ],
            [
                17661,
                17738
            ],
            [
                17765,
                17771
            ],
            [
                17754,
                17759
            ],
            [
                17772,
                17788
            ]
        ],
        "row_chars": [
            [
                0,
                182
            ],
            [
                182,
                477
            ],
            [
                477,
                744
            ],
            [
                744,
                855
            ],
            [
                855,
                1064
            ],
            [
                1064,
                1184
            ],
            [
                1184,
                1458
            ],
            [
                1458,
                1782
            ],
            [
                1782,
                1943
            ],
            [
                1943,
                2079
            ],
            [
                2079,
                2222
            ],
            [
                2222,
                2281
            ],
            [
                2281,
                2527
            ],
            [
                2527,
                2649
            ],
            [
                2649,
                2844
            ],
            [
                2844,
                2982
            ],
            [
                2982,
                3110
            ],
            [
                3110,
                3196
            ],
            [
                3196,
                3403
            ],
            [
                3403,
                3501
            ],
            [
                3501,
                3563
            ],
            [
                3563,
                3636
            ],
            [
                3636,
                3723
            ],
            [
                3723,
                3860
            ],
            [
                3860,
                3958
            ],
            [
                3958,
                3994
            ],
            [
                3994,
                4040
            ],
            [
                4040,
                4130
            ],
            [
                4130,
                4195
            ],
            [
                4195,
                4245
            ],
            [
                4245,
                4272
            ],
            [
                4272,
                4326
            ],
            [
                4326,
                4463
            ],
            [
                4463,
                4561
            ],
            [
                4561,
                4616
            ],
            [
                4616,
                4689
            ],
            [
                4689,
                4797
            ],
            [
                4797,
                4821
            ],
            [
                4821,
                4850
            ],
            [
                4850,
                4986
            ],
            [
                4986,
                5040
            ],
            [
                5040,
                5144
            ],
            [
                5144,
                5296
            ],
            [
                5296,
                5393
            ],
            [
                5393,
                5484
            ],
            [
                5484,
                5564
            ],
            [
                5564,
                5714
            ],
            [
                5714,
                5762
            ],
            [
                5762,
                5827
            ],
            [
                5827,
                5864
            ],
            [
                5864,
                5878
            ],
            [
                5878,
                5898
            ],
            [
                5898,
                5952
            ],
            [
                5952,
                5970
            ],
            [
                5970,
                6137
            ],
            [
                6137,
                6182
            ],
            [
                6182,
                6305
            ],
            [
                6305,
                6370
            ],
            [
                6370,
                6394
            ],
            [
                6394,
                6447
            ],
            [
                6447,
                6540
            ],
            [
                6540,
                6747
            ],
            [
                6747,
                6784
            ],
            [
                6784,
                6803
            ],
            [
                6803,
                6838
            ],
            [
                6838,
                6886
            ],
            [
                6886,
                6937
            ],
            [
                6937,
                6965
            ],
            [
                6965,
                7071
            ],
            [
                7071,
                7119
            ],
            [
                7119,
                7130
            ],
            [
                7130,
                7167
            ],
            [
                7167,
                7178
            ],
            [
                7178,
                7196
            ],
            [
                7196,
                7208
            ],
            [
                7208,
                7228
            ],
            [
                7228,
                7239
            ],
            [
                7239,
                7250
            ],
            [
                7250,
                7364
            ],
            [
                7364,
                7387
            ],
            [
                7387,
                7434
            ],
            [
                7434,
                7453
            ],
            [
                7453,
                7466
            ],
            [
                7466,
                7574
            ],
            [
                7574,
                7706
            ],
            [
                7706,
                7780
            ],
            [
                7780,
                7851
            ],
            [
                7851,
                7891
            ],
            [
                7891,
                7953
            ],
            [
                7953,
                7990
            ],
            [
                7990,
                8025
            ],
            [
                8025,
                8047
            ],
            [
                8047,
                8192
            ],
            [
                8192,
                8294
            ],
            [
                8294,
                8455
            ],
            [
                8455,
                8494
            ],
            [
                8494,
                8702
            ],
            [
                8702,
                8782
            ],
            [
                8782,
                8929
            ],
            [
                8929,
                8983
            ],
            [
                8983,
                9023
            ],
            [
                9023,
                9182
            ],
            [
                9182,
                9342
            ],
            [
                9342,
                9470
            ],
            [
                9470,
                9771
            ],
            [
                9771,
                9890
            ],
            [
                9890,
                9924
            ],
            [
                9924,
                9998
            ],
            [
                9998,
                10152
            ],
            [
                10152,
                10266
            ],
            [
                10266,
                10337
            ],
            [
                10337,
                10413
            ],
            [
                10413,
                10553
            ],
            [
                10553,
                10559
            ],
            [
                10559,
                10627
            ],
            [
                10627,
                10669
            ],
            [
                10669,
                10689
            ],
            [
                10689,
                10742
            ],
            [
                10742,
                10804
            ],
            [
                10804,
                10850
            ],
            [
                10850,
                10856
            ],
            [
                10856,
                10910
            ],
            [
                10910,
                10933
            ],
            [
                10933,
                11136
            ],
            [
                11136,
                11349
            ],
            [
                11349,
                11596
            ],
            [
                11596,
                11651
            ],
            [
                11651,
                12179
            ],
            [
                12179,
                12243
            ],
            [
                12243,
                12316
            ],
            [
                12316,
                12414
            ],
            [
                12414,
                12427
            ],
            [
                12427,
                12448
            ],
            [
                12448,
                12556
            ],
            [
                12556,
                12640
            ],
            [
                12640,
                12670
            ],
            [
                12670,
                12683
            ],
            [
                12683,
                12859
            ],
            [
                12859,
                13039
            ],
            [
                13039,
                13064
            ],
            [
                13064,
                13185
            ],
            [
                13185,
                13230
            ],
            [
                13230,
                13248
            ],
            [
                13248,
                13305
            ],
            [
                13305,
                13385
            ],
            [
                13385,
                13407
            ],
            [
                13407,
                13432
            ],
            [
                13432,
                13456
            ],
            [
                13456,
                13463
            ],
            [
                13463,
                13505
            ],
            [
                13505,
                13535
            ],
            [
                13535,
                13666
            ],
            [
                13666,
                13748
            ],
            [
                13748,
                13770
            ],
            [
                13770,
                13783
            ],
            [
                13783,
                13838
            ],
            [
                13838,
                13853
            ],
            [
                13853,
                13876
            ],
            [
                13876,
                13953
            ],
            [
                13953,
                14029
            ],
            [
                14029,
                14167
            ],
            [
                14167,
                14223
            ],
            [
                14223,
                14247
            ],
            [
                14247,
                14307
            ],
            [
                14307,
                14507
            ],
            [
                14507,
                14643
            ],
            [
                14643,
                14765
            ],
            [
                14765,
                14791
            ],
            [
                14791,
                14814
            ],
            [
                14814,
                14912
            ],
            [
                14912,
                15053
            ],
            [
                15053,
                15271
            ],
            [
                15271,
                15425
            ],
            [
                15425,
                15537
            ],
            [
                15537,
                15582
            ],
            [
                15582,
                15686
            ],
            [
                15686,
                15762
            ],
            [
                15762,
                15835
            ],
            [
                15835,
                15972
            ],
            [
                15972,
                16062
            ],
            [
                16062,
                16239
            ],
            [
                16239,
                16321
            ],
            [
                16321,
                16390
            ],
            [
                16390,
                16530
            ],
            [
                16530,
                16578
            ],
            [
                16578,
                16823
            ],
            [
                16823,
                16837
            ],
            [
                16837,
                16867
            ],
            [
                16867,
                17115
            ],
            [
                17115,
                17629
            ],
            [
                17629,
                17788
            ]
        ]
    },
    "abridged": {
        "text": "Impassive, as behoves its high breeding, the Dedlock town house stares at the other houses in the street of dismal grandeur and gives no outward sign of anything wrong within. Hours pass before its exalted dullness is disturbed. But Volumnia the fair, becoming bored, ventures at length to the library for change of scene. Her gentle tapping at the door producing no response, she opens it and peeps in; seeing no one there, enters.\nShe takes the opportunity of hovering over her kinsman's letters and papers like a bird, taking a short peck at this document and a blink at that document with her head on one side, hopping about from table to table in an inquisitive and restless manner. In the course of these researches she stumbles over something, and turning, sees her kinsman lying on the ground like a felled tree.\nVolumnia's pet little scream acquires a considerable increase of reality from this surprise, and the house is quickly in commotion. Servants tear up and down stairs, bells are violently rung, doctors are sent for, and Lady Dedlock is sought, but not found. Her letter to Sir Leicester is discovered on her table, but it is doubtful yet whether he has not received another missive summoning him to another world,\nThey lay him down upon his bed, fan him, put ice to his head, and try every means of restoration. The day has gone, and it is night before his stertorous breathing lulls or his fixed eyes show any consciousness of the candle that is passed before them. But by and by he nods or moves his eyes or even his hand in token that he hears and comprehends.\nHe fell down, this morning, a handsome stately gentleman. He lies upon his bed, an aged man with sunken cheeks, the decrepit shadow of himself. His voice was rich and mellow and self-important. But now he can only whisper mere jumble and jargon.\nHis faithful housekeeper stands at his bedside. It is the first act he notices, and he clearly derives pleasure from it. After vainly trying to make himself understood in speech, he makes signs for a pencil. At last his old housekeeper makes out what he wants and brings in a slate.\nHe slowly scrawls upon it in a strange hand, \"Chesney Wold?\"\nNo, she tells him; he is in London. He was taken ill in the library this morning.\n\"It is not an illness of any serious consequence, Sir Leicester. You will be much better tomorrow.\" This, with the tears coursing down her fair old face.\nAfter looking all round the bed where the doctors stand, he writes, \"My Lady.\"\n\"My Lady went out, Sir Leicester, before you were taken ill, and don't know of your illness yet.\"\nHe points again, in great agitation, at the two words. They try to quiet him, but he points again with increased agitation. On their looking at one another, not knowing what to say, he takes the slate once more and writes \"My Lady. For God's sake, where?\" And makes an imploring moan.\nIt is thought better that his old housekeeper should give him Lady Dedlock's letter. She opens it for him and holds it out. Having read it twice by a great effort, he turns it down so that it shall not be seen and lies moaning. He passes into a kind of swoon, and it is an hour before he opens his eyes.\nHe signs for the slate again, but the word he wants to write he cannot remember. His anxiety, his eagerness, and affliction are pitiable to behold. It seems as if he must go mad in his need for haste and his inability to express what or who he wants. He has written the letter B, and there stopped. Of a sudden, he puts Mr. before it. The old housekeeper suggests Bucket. Thank heaven! That's his meaning.\nMr. Bucket is downstairs. Shall he come up?\nThere is no possibility of misconstruing Sir Leicester's burning wish to see him, or the desire he signifies to have the room cleared of everyone but the housekeeper. It is speedily done, and Mr. Bucket appears.\n\"Sir Leicester Dedlock, Baronet, I'm sorry to see you like this.\"\nSir Leicester puts the letter in his hands and looks intently in his face while he reads it. A new intelligence comes into Mr. Bucket's eye as he reads on; he indicates that he understands it.\nSir Leicester writes upon the slate. \"Full forgiveness. Find-\" Mr. Bucket stops his hand.\n\"I'll find her. But my search must begin at once. Not a minute must be lost.\"\nWith the quickness of thought, he follows Sir Leicester Dedlock's look towards a little box upon a table.\n\"Shall I bring it here, Sir Leicester? Certainly. Open it with one of these here keys? Take the notes out? So I will. Count 'em? That's one sixty. Take 'em for expenses? That I'll do. Don't spare money? No, I won't.\"\nThe speed of Mr. Bucket's interpretation is little short of miraculous. Mrs. Rouncewell, who holds the light, is giddy as he starts up for his journey.\n\"You're George's mother, old lady, I believe?\" says Mr. Bucket aside, with his hat already on and buttoning his coat.\n\"Yes, sir, I am his distressed mother.\"\n\"So I thought. Well, then, I'll tell you something. Your son's all right. Now, don't you begin a-crying, because what you've got to do is to take care of Sir Leicester Dedlock, Baronet, and you won't do that by crying. As to your son, he sends his loving duty. He's discharged honourable, with no more stain on his character than there is on yours. He's a fine-made man, and you're a fine-made old lady, a true mother and son, the pair of you. Sir Leicester Dedlock, Baronet, what you've trusted to me I'll go through with. I shan't rest till I have found what I go in search of. Say everything as is kind and forgiving on your part? Sir Leicester Dedlock, Baronet, I will.\"\nWith this, Mr. Bucket goes quietly out.\nHe first takes himself to Lady Dedlock's rooms and looks all over them for anything that may help him. The rooms are in darkness now; Mr. Bucket locks himself in, and holds a light above his head.\n\"A spicy boudoir, this,\" says Mr. Bucket. \"Must have cost a sight of money!\"\nHe has opened a dainty little chest in an inner drawer. His great hand, turning over some gloves, comes upon a white handkerchief.\n\"Hum! Let's have a look at you,\" says Mr. Bucket, putting down the light. \"What should you be kept by yourself for? What's your motive? Are you her ladyship's property, or somebody else's? You've got a mark upon you somewheres or another, I suppose?\"\nHe finds it as he speaks: \"Esther Summerson.\"\n\"Oh!\" says Mr. Bucket, pausing. \"Come, I'll take you.\"\nHe completes his observations carefully, leaves everything else precisely as he found it, and glides away into the street. He sets off to the nearest coach-stand, picks out a horse, and directs to be driven to the shooting gallery. Mr. Bucket does not claim to be a scientific judge of horses, but he remarks that when he sees a horse as can go, he knows him.\nHis knowledge is not at fault tonight. Clattering over the stones at a dangerous pace, yet thoughtfully watching with keen eyes every slinking creature whom he passes in the midnight streets, where the snow lies thin, he dashes to his destination at such a speed that when he stops the horse half smothers him in a cloud of steam.\nHe runs up the entry and finds the trooper smoking his pipe.\n\"I haven't a word to spare, George. Now, honour! All to save a woman. Miss Summerson that was here when Gridley died - where does she live?\"\nThe trooper gives him the address, near Oxford Street.\n\"You won't repent it, George. Good night!\"\nHe is off again, and gallops away in another cloud of steam.\nMr. Jarndyce, the only person up in the house, is just going to bed when he hears the rapid ringing at the bell, and comes down to the door in his dressing-gown.\n\"Don't be alarmed, sir.\" In a moment his visitor is in the hall, has shut the door, and stands with his hand upon the lock. \"I've had the pleasure of seeing you before. Inspector Bucket. Look at this handkerchief, sir, Miss Esther Summerson's. Found it myself put away in a drawer of Lady Dedlock's, quarter of an hour ago. Not a moment to lose. Matter of life or death. You know Lady Dedlock?\"\n\"Yes.\"\n\"There has been a discovery there today. Family affairs have come out. Sir Leicester Dedlock, Baronet, has had a fit - apoplexy or paralysis - and precious time has been lost. Lady Dedlock disappeared this afternoon and left a letter for him that looks bad. Run your eye over it. Here it is!\"\nMr. Jarndyce, having read it, asks him what he thinks.\n\"I don't know. It looks like suicide. Anyways, there's more danger of that, every minute. Now, Mr. Jarndyce, I am employed by Sir Leicester Dedlock, Baronet, to follow her and find her, to save her and take her his forgiveness. I have money, but I want something else. I want Miss Summerson.\"\nMr. Jarndyce in a troubled voice repeats, \"Miss Summerson?\"\n\"Now, Mr. Jarndyce\" - Mr. Bucket has read his face with the greatest attention - \"I speak to you as a humane gentleman. If ever delay was dangerous, it's dangerous now. Eight or ten hours have been lost since Lady Dedlock disappeared. I am charged to find her. I am Inspector Bucket. Besides all the rest that's heavy on her, she has upon her, as she believes, suspicion of murder. If I follow her alone, she may be driven to desperation. But if I follow her in company with a young lady that she has a tenderness for - I ask no question, and I say no more than that - she will give me credit for being friendly. Time flies; it's getting on for one o'clock.\"\nMr. Jarndyce begs him to remain there while he speaks to Miss Summerson. Mr. Bucket says he will, but does no such thing, following upstairs instead and keeping his man in sight. He lurks in the gloom of the staircase while they confer. Mr. Jarndyce comes down and tells him that Miss Summerson will join him directly and will accompany him where he pleases. Mr. Bucket, satisfied, expresses high approval and awaits her coming at the door.\nThere he mounts a high tower in his mind and looks out far and wide. Many solitary figures he perceives creeping through the streets; many solitary figures out on heaths, and lying under haystacks. But the figure that he seeks is not among them. Other solitaries he imagines, looking over bridges; and in shadowed places down by the river; and a dark, dark, shapeless object drifting with the tide, more solitary than all, clings with a drowning hold on his attention.\nWhere is she? Living or dead, where is she? On the waste where the brick-kilns are burning with a pale blue flare, where the clay and water are hard frozen and the mill in which the gaunt blind horse goes round all day looks like an instrument of torture - traversing this deserted, blighted spot there is a lonely figure with the sad world to itself, pelted by the snow and driven by the wind. It is the figure of a woman; but it is miserably dressed, and no such clothes ever came through the hall of the great Dedlock mansion.",
        "paragraph_chars": [
            [
                0,
                433
            ],
            [
                433,
                821
            ],
            [
                821,
                1233
            ],
            [
                1233,
                1583
            ],
            [
                1583,
                1829
            ],
            [
                1829,
                2112
            ],
            [
                2112,
                2173
            ],
            [
                2173,
                2255
            ],
            [
                2255,
                2409
            ],
            [
                2409,
                2488
            ],
            [
                2488,
                2586
            ],
            [
                2586,
                2871
            ],
            [
                2871,
                3175
            ],
            [
                3175,
                3581
            ],
            [
                3581,
                3625
            ],
            [
                3625,
                3837
            ],
            [
                3837,
                3903
            ],
            [
                3903,
                4096
            ],
            [
                4096,
                4186
            ],
            [
                4186,
                4264
            ],
            [
                4264,
                4370
            ],
            [
                4370,
                4587
            ],
            [
                4587,
                4739
            ],
            [
                4739,
                4857
            ],
            [
                4857,
                4897
            ],
            [
                4897,
                5572
            ],
            [
                5572,
                5612
            ],
            [
                5612,
                5809
            ],
            [
                5809,
                5886
            ],
            [
                5886,
                6017
            ],
            [
                6017,
                6268
            ],
            [
                6268,
                6314
            ],
            [
                6314,
                6369
            ],
            [
                6369,
                6729
            ],
            [
                6729,
                7060
            ],
            [
                7060,
                7121
            ],
            [
                7121,
                7262
            ],
            [
                7262,
                7317
            ],
            [
                7317,
                7360
            ],
            [
                7360,
                7421
            ],
            [
                7421,
                7583
            ],
            [
                7583,
                7978
            ],
            [
                7978,
                7985
            ],
            [
                7985,
                8278
            ],
            [
                8278,
                8333
            ],
            [
                8333,
                8626
            ],
            [
                8626,
                8686
            ],
            [
                8686,
                9345
            ],
            [
                9345,
                9786
            ],
            [
                9786,
                10255
            ],
            [
                10255,
                10784
            ]
        ],
        "segment_chars": [
            [
                0,
                176
            ],
            [
                176,
                229
            ],
            [
                229,
                323
            ],
            [
                323,
                433
            ],
            [
                433,
                688
            ],
            [
                688,
                821
            ],
            [
                821,
                953
            ],
            [
                953,
                1078
            ],
            [
                1078,
                1233
            ],
            [
                1233,
                1331
            ],
            [
                1331,
                1486
            ],
            [
                1486,
                1583
            ],
            [
                1583,
                1641
            ],
            [
                1641,
                1727
            ],
            [
                1727,
                1777
            ],
            [
                1777,
                1829
            ],
            [
                1829,
                1877
            ],
            [
                1877,
                1950
            ],
            [
                1950,
                2037
            ],
            [
                2037,
                2112
            ],
            [
                2112,
                2173
            ],
            [
                2173,
                2209
            ],
            [
                2209,
                2255
            ],
            [
                2255,
                2320
            ],
            [
                2320,
                2355
            ],
            [
                2355,
                2409
            ],
            [
                2409,
                2488
            ],
            [
                2488,
                2586
            ],
            [
                2586,
                2641
            ],
            [
                2641,
                2710
            ],
            [
                2710,
                2818
            ],
            [
                2818,
                2842
            ],
            [
                2842,
                2871
            ],
            [
                2871,
                2956
            ],
            [
                2956,
                2995
            ],
            [
                2995,
                3099
            ],
            [
                3099,
                3175
            ],
            [
                3175,
                3256
            ],
            [
                3256,
                3323
            ],
            [
                3323,
                3426
            ],
            [
                3426,
                3474
            ],
            [
                3474,
                3510
            ],
            [
                3510,
                3547
            ],
            [
                3547,
                3561
            ],
            [
                3561,
                3581
            ],
            [
                3581,
                3607
            ],
            [
                3607,
                3625
            ],
            [
                3625,
                3792
            ],
            [
                3792,
                3837
            ],
            [
                3837,
                3903
            ],
            [
                3903,
                3996
            ],
            [
                3996,
                4096
            ],
            [
                4096,
                4133
            ],
            [
                4133,
                4152
            ],
            [
                4152,
                4186
            ],
            [
                4186,
                4202
            ],
            [
                4202,
                4236
            ],
            [
                4236,
                4264
            ],
            [
                4264,
                4370
            ],
            [
                4370,
                4409
            ],
            [
                4409,
                4420
            ],
            [
                4420,
                4457
            ],
            [
                4457,
                4477
            ],
            [
                4477,
                4488
            ],
            [
                4488,
                4499
            ],
            [
                4499,
                4517
            ],
            [
                4517,
                4540
            ],
            [
                4540,
                4554
            ],
            [
                4554,
                4573
            ],
            [
                4573,
                4587
            ],
            [
                4587,
                4659
            ],
            [
                4659,
                4739
            ],
            [
                4739,
                4786
            ],
            [
                4786,
                4857
            ],
            [
                4857,
                4897
            ],
            [
                4897,
                4912
            ],
            [
                4912,
                4949
            ],
            [
                4949,
                4971
            ],
            [
                4971,
                5116
            ],
            [
                5116,
                5158
            ],
            [
                5158,
                5246
            ],
            [
                5246,
                5341
            ],
            [
                5341,
                5421
            ],
            [
                5421,
                5477
            ],
            [
                5477,
                5531
            ],
            [
                5531,
                5572
            ],
            [
                5572,
                5612
            ],
            [
                5612,
                5715
            ],
            [
                5715,
                5809
            ],
            [
                5809,
                5851
            ],
            [
                5851,
                5886
            ],
            [
                5886,
                5942
            ],
            [
                5942,
                6017
            ],
            [
                6017,
                6023
            ],
            [
                6023,
                6091
            ],
            [
                6091,
                6133
            ],
            [
                6133,
                6153
            ],
            [
                6153,
                6206
            ],
            [
                6206,
                6268
            ],
            [
                6268,
                6314
            ],
            [
                6314,
                6320
            ],
            [
                6320,
                6346
            ],
            [
                6346,
                6369
            ],
            [
                6369,
                6492
            ],
            [
                6492,
                6601
            ],
            [
                6601,
                6729
            ],
            [
                6729,
                6768
            ],
            [
                6768,
                7060
            ],
            [
                7060,
                7121
            ],
            [
                7121,
                7157
            ],
            [
                7157,
                7170
            ],
            [
                7170,
                7191
            ],
            [
                7191,
                7262
            ],
            [
                7262,
                7317
            ],
            [
                7317,
                7347
            ],
            [
                7347,
                7360
            ],
            [
                7360,
                7421
            ],
            [
                7421,
                7583
            ],
            [
                7583,
                7608
            ],
            [
                7608,
                7707
            ],
            [
                7707,
                7752
            ],
            [
                7752,
                7770
            ],
            [
                7770,
                7827
            ],
            [
                7827,
                7907
            ],
            [
                7907,
                7929
            ],
            [
                7929,
                7954
            ],
            [
                7954,
                7978
            ],
            [
                7978,
                7985
            ],
            [
                7985,
                8026
            ],
            [
                8026,
                8056
            ],
            [
                8056,
                8161
            ],
            [
                8161,
                8243
            ],
            [
                8243,
                8265
            ],
            [
                8265,
                8278
            ],
            [
                8278,
                8333
            ],
            [
                8333,
                8348
            ],
            [
                8348,
                8371
            ],
            [
                8371,
                8423
            ],
            [
                8423,
                8561
            ],
            [
                8561,
                8602
            ],
            [
                8602,
                8626
            ],
            [
                8626,
                8686
            ],
            [
                8686,
                8806
            ],
            [
                8806,
                8855
            ],
            [
                8855,
                8921
            ],
            [
                8921,
                8947
            ],
            [
                8947,
                8970
            ],
            [
                8970,
                9068
            ],
            [
                9068,
                9125
            ],
            [
                9125,
                9299
            ],
            [
                9299,
                9345
            ],
            [
                9345,
                9418
            ],
            [
                9418,
                9524
            ],
            [
                9524,
                9582
            ],
            [
                9582,
                9704
            ],
            [
                9704,
                9786
            ],
            [
                9786,
                9855
            ],
            [
                9855,
                9984
            ],
            [
                9984,
                10032
            ],
            [
                10032,
                10255
            ],
            [
                10255,
                10269
            ],
            [
                10269,
                10299
            ],
            [
                10299,
                10650
            ],
            [
                10650,
                10784
            ]
        ],
        "overlap_chars": [
            [
                0,
                161
            ],
            [
                162,
                176
            ],
            [
                176,
                227
            ],
            [
                227,
                229
            ],
            [
                229,
                251
            ],
            [
                266,
                286
            ],
            [
                287,
                323
            ],
            [
                323,
                424
            ],
            [
                431,
                433
            ],
            [
                433,
                436
            ],
            [
                443,
                446
            ],
            [
                447,
                570
            ],
            [
                571,
                587
            ],
            [
                588,
                613
            ],
            [
                613,
                614
            ],
            [
                615,
                648
            ],
            [
                649,
                688
            ],
            [
                688,
                762
            ],
            [
                762,
                821
            ],
            [
                821,
                873
            ],
            [
                883,
                953
            ],
            [
                953,
                1061
            ],
            [
                1061,
                1078
            ],
            [
                1078,
                1200
            ],
            [
                1211,
                1214
            ],
            [
                1215,
                1217
            ],
            [
                1218,
                1231
            ],
            [
                1231,
                1232
            ],
            [
                1233,
                1264
            ],
            [
                1265,
                1268
            ],
            [
                1272,
                1273
            ],
            [
                1274,
                1331
            ],
            [
                1331,
                1342
            ],
            [
                1347,
                1364
            ],
            [
                1365,
                1465
            ],
            [
                1466,
                1486
            ],
            [
                1486,
                1489
            ],
            [
                1490,
                1583
            ],
            [
                1583,
                1639
            ],
            [
                1639,
                1641
            ],
            [
                1641,
                1727
            ],
            [
                1727,
                1760
            ],
            [
                1775,
                1777
            ],
            [
                1777,
                1804
            ],
            [
                1805,
                1829
            ],
            [
                1829,
                1832
            ],
            [
                1833,
                1877
            ],
            [
                1877,
                1950
            ],
            [
                1950,
                2037
            ],
            [
                2037,
                2039
            ],
            [
                2045,
                2064
            ],
            [
                2065,
                2112
            ],
            [
                2112,
                2142
            ],
            [
                2151,
                2155
            ],
            [
                2155,
                2173
            ],
            [
                2173,
                2209
            ],
            [
                2209,
                2254
            ],
            [
                2255,
                2320
            ],
            [
                2320,
                2343
            ],
            [
                2355,
                2409
            ],
            [
                2409,
                2414
            ],
            [
                2415,
                2422
            ],
            [
                2423,
                2488
            ],
            [
                2488,
                2586
            ],
            [
                2586,
                2641
            ],
            [
                2641,
                2645
            ],
            [
                2646,
                2710
            ],
            [
                2710,
                2818
            ],
            [
                2818,
                2842
            ],
            [
                2842,
                2871
            ],
            [
                2871,
                2954
            ],
            [
                2954,
                2956
            ],
            [
                2956,
                2980
            ],
            [
                2987,
                2993
            ],
            [
                2993,
                2995
            ],
            [
                2995,
                3099
            ],
            [
                3099,
                3123
            ],
            [
                3124,
                3173
            ],
            [
                3173,
                3174
            ],
            [
                3188,
                3197
            ],
            [
                3198,
                3256
            ],
            [
                3256,
                3298
            ],
            [
                3299,
                3323
            ],
            [
                3323,
                3355
            ],
            [
                3365,
                3378
            ],
            [
                3383,
                3392
            ],
            [
                3393,
                3395
            ],
            [
                3404,
                3411
            ],
            [
                3416,
                3418
            ],
            [
                3424,
                3426
            ],
            [
                3426,
                3474
            ],
            [
                3474,
                3485
            ],
            [
                3485,
                3510
            ],
            [
                3510,
                3547
            ],
            [
                3547,
                3561
            ],
            [
                3561,
                3581
            ],
            [
                3581,
                3594
            ],
            [
                3595,
                3605
            ],
            [
                3605,
                3607
            ],
            [
                3607,
                3625
            ],
            [
                3625,
                3705
            ],
            [
                3707,
                3761
            ],
            [
                3771,
                3792
            ],
            [
                3792,
                3836
            ],
            [
                3837,
                3900
            ],
            [
                3903,
                3921
            ],
            [
                3926,
                3996
            ],
            [
                3996,
                4058
            ],
            [
                4059,
                4071
            ],
            [
                4072,
                4076
            ],
            [
                4096,
                4133
            ],
            [
                4133,
                4152
            ],
            [
                4152,
                4156
            ],
            [
                4159,
                4186
            ],
            [
                4186,
                4187
            ],
            [
                4187,
                4202
            ],
            [
                4202,
                4215
            ],
            [
                4216,
                4220
            ],
            [
                4234,
                4236
            ],
            [
                4236,
                4264
            ],
            [
                4264,
                4370
            ],
            [
                4370,
                4371
            ],
            [
                4379,
                4407
            ],
            [
                4407,
                4409
            ],
            [
                4409,
                4420
            ],
            [
                4420,
                4457
            ],
            [
                4457,
                4477
            ],
            [
                4477,
                4488
            ],
            [
                4488,
                4499
            ],
            [
                4499,
                4503
            ],
            [
                4503,
                4517
            ],
            [
                4517,
                4540
            ],
            [
                4540,
                4552
            ],
            [
                4552,
                4554
            ],
            [
                4554,
                4573
            ],
            [
                4573,
                4575
            ],
            [
                4577,
                4587
            ],
            [
                4587,
                4590
            ],
            [
                4597,
                4627
            ],
            [
                4628,
                4659
            ],
            [
                4659,
                4705
            ],
            [
                4706,
                4721
            ],
            [
                4722,
                4739
            ],
            [
                4739,
                4772
            ],
            [
                4772,
                4786
            ],
            [
                4786,
                4857
            ],
            [
                4857,
                4897
            ],
            [
                4897,
                4910
            ],
            [
                4910,
                4912
            ],
            [
                4912,
                4949
            ],
            [
                4949,
                4971
            ],
            [
                4971,
                5116
            ],
            [
                5116,
                5134
            ],
            [
                5135,
                5156
            ],
            [
                5156,
                5158
            ],
            [
                5158,
                5184
            ],
            [
                5184,
                5185
            ],
            [
                5186,
                5198
            ],
            [
                5205,
                5244
            ],
            [
                5244,
                5246
            ],
            [
                5246,
                5300
            ],
            [
                5301,
                5302
            ],
            [
                5308,
                5339
            ],
            [
                5339,
                5341
            ],
            [
                5341,
                5421
            ],
            [
                5427,
                5429
            ],
            [
                5435,
                5477
            ],
            [
                5477,
                5531
            ],
            [
                5531,
                5569
            ],
            [
                5572,
                5581
            ],
            [
                5581,
                5593
            ],
            [
                5594,
                5610
            ],
            [
                5610,
                5612
            ],
            [
                5615,
                5620
            ],
            [
                5627,
                5662
            ],
            [
                5669,
                5686
            ],
            [
                5696,
                5715
            ],
            [
                5715,
                5745
            ],
            [
                5746,
                5756
            ],
            [
                5763,
                5773
            ],
            [
                5773,
                5774
            ],
            [
                5775,
                5778
            ],
            [
                5785,
                5786
            ],
            [
                5787,
                5792
            ],
            [
                5793,
                5807
            ],
            [
                5807,
                5809
            ],
            [
                5809,
                5849
            ],
            [
                5849,
                5851
            ],
            [
                5851,
                5883
            ],
            [
                5886,
                5942
            ],
            [
                5942,
                5982
            ],
            [
                5982,
                6017
            ],
            [
                6017,
                6023
            ],
            [
                6023,
                6091
            ],
            [
                6091,
                6133
            ],
            [
                6133,
                6153
            ],
            [
                6153,
                6206
            ],
            [
                6206,
                6268
            ],
            [
                6268,
                6292
            ],
            [
                6294,
                6314
            ],
            [
                6314,
                6320
            ],
            [
                6320,
                6344
            ],
            [
                6344,
                6346
            ],
            [
                6346,
                6369
            ],
            [
                6369,
                6398
            ],
            [
                6399,
                6408
            ],
            [
                6408,
                6458
            ],
            [
                6459,
                6462
            ],
            [
                6463,
                6474
            ],
            [
                6475,
                6492
            ],
            [
                6492,
                6503
            ],
            [
                6504,
                6541
            ],
            [
                6542,
                6543
            ],
            [
                6544,
                6549
            ],
            [
                6549,
                6601
            ],
            [
                6601,
                6669
            ],
            [
                6678,
                6729
            ],
            [
                6729,
                6758
            ],
            [
                6766,
                6768
            ],
            [
                6768,
                6832
            ],
            [
                6847,
                6856
            ],
            [
                6857,
                6920
            ],
            [
                6921,
                6945
            ],
            [
                6945,
                6946
            ],
            [
                6947,
                7060
            ],
            [
                7060,
                7074
            ],
            [
                7075,
                7121
            ],
            [
                7121,
                7122
            ],
            [
                7122,
                7147
            ],
            [
                7147,
                7155
            ],
            [
                7155,
                7157
            ],
            [
                7157,
                7170
            ],
            [
                7170,
                7191
            ],
            [
                7191,
                7237
            ],
            [
                7240,
                7262
            ],
            [
                7262,
                7273
            ],
            [
                7274,
                7317
            ],
            [
                7317,
                7347
            ],
            [
                7347,
                7360
            ],
            [
                7360,
                7376
            ],
            [
                7377,
                7393
            ],
            [
                7394,
                7396
            ],
            [
                7405,
                7419
            ],
            [
                7419,
                7421
            ],
            [
                7421,
                7488
            ],
            [
                7503,
                7583
            ],
            [
                7583,
                7608
            ],
            [
                7608,
                7634
            ],
            [
                7635,
                7707
            ],
            [
                7707,
                7752
            ],
            [
                7752,
                7770
            ],
            [
                7770,
                7777
            ],
            [
                7783,
                7827
            ],
            [
                7827,
                7907
            ],
            [
                7907,
                7929
            ],
            [
                7929,
                7954
            ],
            [
                7954,
                7978
            ],
            [
                7978,
                7985
            ],
            [
                7985,
                8018
            ],
            [
                8024,
                8026
            ],
            [
                8026,
                8056
            ],
            [
                8056,
                8101
            ],
            [
                8104,
                8125
            ],
            [
                8128,
                8161
            ],
            [
                8161,
                8243
            ],
            [
                8243,
                8265
            ],
            [
                8265,
                8278
            ],
            [
                8278,
                8333
            ],
            [
                8333,
                8348
            ],
            [
                8348,
                8371
            ],
            [
                8371,
                8392
            ],
            [
                8393,
                8399
            ],
            [
                8400,
                8402
            ],
            [
                8403,
                8407
            ],
            [
                8407,
                8421
            ],
            [
                8421,
                8423
            ],
            [
                8423,
                8561
            ],
            [
                8561,
                8573
            ],
            [
                8573,
                8602
            ],
            [
                8602,
                8626
            ],
            [
                8626,
                8686
            ],
            [
                8686,
                8705
            ],
            [
                8710,
                8764
            ],
            [
                8767,
                8787
            ],
            [
                8788,
                8794
            ],
            [
                8795,
                8804
            ],
            [
                8804,
                8806
            ],
            [
                8806,
                8853
            ],
            [
                8853,
                8855
            ],
            [
                8855,
                8873
            ],
            [
                8874,
                8921
            ],
            [
                8921,
                8947
            ],
            [
                8947,
                8970
            ],
            [
                8970,
                9068
            ],
            [
                9068,
                9094
            ],
            [
                9095,
                9125
            ],
            [
                9125,
                9173
            ],
            [
                9174,
                9203
            ],
            [
                9206,
                9252
            ],
            [
                9255,
                9299
            ],
            [
                9299,
                9342
            ],
            [
                9345,
                9418
            ],
            [
                9418,
                9446
            ],
            [
                9447,
                9524
            ],
            [
                9524,
                9526
            ],
            [
                9533,
                9582
            ],
            [
                9584,
                9666
            ],
            [
                9672,
                9704
            ],
            [
                9704,
                9786
            ],
            [
                9786,
                9855
            ],
            [
                9855,
                9960
            ],
            [
                9961,
                9984
            ],
            [
                9984,
                10032
            ],
            [
                10032,
                10051
            ],
            [
                10060,
                10074
            ],
            [
                10075,
                10082
            ],
            [
                10082,
                10124
            ],
            [
                10124,
                10255
            ],
            [
                10255,
                10269
            ],
            [
                10269,
                10299
            ],
            [
                10299,
                10368
            ],
            [
                10368,
                10501
            ],
            [
                10502,
                10509
            ],
            [
                10510,
                10511
            ],
            [
                10519,
                10648
            ],
            [
                10648,
                10650
            ],
            [
                10650,
                10677
            ],
            [
                10677,
                10754
            ],
            [
                10755,
                10761
            ],
            [
                10762,
                10767
            ],
            [
                10768,
                10784
            ]
        ],
        "row_chars": [
            [
                0,
                176
            ],
            [
                176,
                176
            ],
            [
                176,
                176
            ],
            [
                176,
                229
            ],
            [
                229,
                323
            ],
            [
                323,
                433
            ],
            [
                433,
                433
            ],
            [
                433,
                688
            ],
            [
                688,
                821
            ],
            [
                821,
                953
            ],
            [
                953,
                1078
            ],
            [
                1078,
                1078
            ],
            [
                1078,
                1233
            ],
            [
                1233,
                1331
            ],
            [
                1331,
                1486
            ],
            [
                1486,
                1583
            ],
            [
                1583,
                1641
            ],
            [
                1641,
                1727
            ],
            [
                1727,
                1777
            ],
            [
                1777,
                1829
            ],
            [
                1829,
                1877
            ],
            [
                1877,
                1950
            ],
            [
                1950,
                2037
            ],
            [
                2037,
                2112
            ],
            [
                2112,
                2173
            ],
            [
                2173,
                2209
            ],
            [
                2209,
                2255
            ],
            [
                2255,
                2255
            ],
            [
                2255,
                2320
            ],
            [
                2320,
                2355
            ],
            [
                2355,
                2355
            ],
            [
                2355,
                2409
            ],
            [
                2409,
                2488
            ],
            [
                2488,
                2586
            ],
            [
                2586,
                2641
            ],
            [
                2641,
                2710
            ],
            [
                2710,
                2818
            ],
            [
                2818,
                2842
            ],
            [
                2842,
                2871
            ],
            [
                2871,
                2956
            ],
            [
                2956,
                2995
            ],
            [
                2995,
                3099
            ],
            [
                3099,
                3175
            ],
            [
                3175,
                3175
            ],
            [
                3175,
                3256
            ],
            [
                3256,
                3323
            ],
            [
                3323,
                3426
            ],
            [
                3426,
                3474
            ],
            [
                3474,
                3510
            ],
            [
                3510,
                3547
            ],
            [
                3547,
                3561
            ],
            [
                3561,
                3581
            ],
            [
                3581,
                3607
            ],
            [
                3607,
                3625
            ],
            [
                3625,
                3792
            ],
            [
                3792,
                3837
            ],
            [
                3837,
                3837
            ],
            [
                3837,
                3903
            ],
            [
                3903,
                3903
            ],
            [
                3903,
                3903
            ],
            [
                3903,
                3996
            ],
            [
                3996,
                4096
            ],
            [
                4096,
                4133
            ],
            [
                4133,
                4152
            ],
            [
                4152,
                4186
            ],
            [
                4186,
                4202
            ],
            [
                4202,
                4236
            ],
            [
                4236,
                4264
            ],
            [
                4264,
                4370
            ],
            [
                4370,
                4409
            ],
            [
                4409,
                4420
            ],
            [
                4420,
                4457
            ],
            [
                4457,
                4457
            ],
            [
                4457,
                4457
            ],
            [
                4457,
                4457
            ],
            [
                4457,
                4477
            ],
            [
                4477,
                4488
            ],
            [
                4488,
                4499
            ],
            [
                4499,
                4517
            ],
            [
                4517,
                4540
            ],
            [
                4540,
                4554
            ],
            [
                4554,
                4573
            ],
            [
                4573,
                4587
            ],
            [
                4587,
                4659
            ],
            [
                4659,
                4739
            ],
            [
                4739,
                4786
            ],
            [
                4786,
                4857
            ],
            [
                4857,
                4897
            ],
            [
                4897,
                4912
            ],
            [
                4912,
                4949
            ],
            [
                4949,
                4949
            ],
            [
                4949,
                4971
            ],
            [
                4971,
                5116
            ],
            [
                5116,
                5158
            ],
            [
                5158,
                5246
            ],
            [
                5246,
                5246
            ],
            [
                5246,
                5341
            ],
            [
                5341,
                5421
            ],
            [
                5421,
                5477
            ],
            [
                5477,
                5531
            ],
            [
                5531,
                5572
            ],
            [
                5572,
                5572
            ],
            [
                5572,
                5612
            ],
            [
                5612,
                5715
            ],
            [
                5715,
                5809
            ],
            [
                5809,
                5851
            ],
            [
                5851,
                5886
            ],
            [
                5886,
                5886
            ],
            [
                5886,
                5886
            ],
            [
                5886,
                5886
            ],
            [
                5886,
                5886
            ],
            [
                5886,
                5942
            ],
            [
                5942,
                6017
            ],
            [
                6017,
                6023
            ],
            [
                6023,
                6091
            ],
            [
                6091,
                6133
            ],
            [
                6133,
                6153
            ],
            [
                6153,
                6206
            ],
            [
                6206,
                6268
            ],
            [
                6268,
                6314
            ],
            [
                6314,
                6320
            ],
            [
                6320,
                6346
            ],
            [
                6346,
                6369
            ],
            [
                6369,
                6492
            ],
            [
                6492,
                6601
            ],
            [
                6601,
                6729
            ],
            [
                6729,
                6768
            ],
            [
                6768,
                7060
            ],
            [
                7060,
                7060
            ],
            [
                7060,
                7121
            ],
            [
                7121,
                7157
            ],
            [
                7157,
                7170
            ],
            [
                7170,
                7191
            ],
            [
                7191,
                7262
            ],
            [
                7262,
                7317
            ],
            [
                7317,
                7347
            ],
            [
                7347,
                7360
            ],
            [
                7360,
                7421
            ],
            [
                7421,
                7583
            ],
            [
                7583,
                7608
            ],
            [
                7608,
                7707
            ],
            [
                7707,
                7752
            ],
            [
                7752,
                7770
            ],
            [
                7770,
                7827
            ],
            [
                7827,
                7907
            ],
            [
                7907,
                7929
            ],
            [
                7929,
                7954
            ],
            [
                7954,
                7978
            ],
            [
                7978,
                7985
            ],
            [
                7985,
                8026
            ],
            [
                8026,
                8056
            ],
            [
                8056,
                8161
            ],
            [
                8161,
                8243
            ],
            [
                8243,
                8265
            ],
            [
                8265,
                8278
            ],
            [
                8278,
                8333
            ],
            [
                8333,
                8348
            ],
            [
                8348,
                8371
            ],
            [
                8371,
                8423
            ],
            [
                8423,
                8423
            ],
            [
                8423,
                8561
            ],
            [
                8561,
                8602
            ],
            [
                8602,
                8626
            ],
            [
                8626,
                8686
            ],
            [
                8686,
                8806
            ],
            [
                8806,
                8855
            ],
            [
                8855,
                8921
            ],
            [
                8921,
                8947
            ],
            [
                8947,
                8970
            ],
            [
                8970,
                9068
            ],
            [
                9068,
                9125
            ],
            [
                9125,
                9299
            ],
            [
                9299,
                9299
            ],
            [
                9299,
                9299
            ],
            [
                9299,
                9345
            ],
            [
                9345,
                9345
            ],
            [
                9345,
                9345
            ],
            [
                9345,
                9418
            ],
            [
                9418,
                9524
            ],
            [
                9524,
                9582
            ],
            [
                9582,
                9704
            ],
            [
                9704,
                9786
            ],
            [
                9786,
                9855
            ],
            [
                9855,
                9984
            ],
            [
                9984,
                10032
            ],
            [
                10032,
                10255
            ],
            [
                10255,
                10269
            ],
            [
                10269,
                10299
            ],
            [
                10299,
                10299
            ],
            [
                10299,
                10650
            ],
            [
                10650,
                10784
            ]
        ]
    }
}