{
    "original": {
        "text": "Still impassive, as behoves its breeding, the Dedlock town house carries itself as usual towards the street of dismal grandeur. There are powdered heads from time to time in the little windows of the hall, looking out at the untaxed powder falling all day from the sky; and in the same conservatory there is peach blossom turning itself exotically to the great hall fire from the nipping weather out of doors. It is given out that my Lady has gone down into Lincolnshire, but is expected to return presently.\nRumour, busy overmuch, however, will not go down into Lincolnshire. It persists in flitting and chattering about town. It knows that that poor unfortunate man, Sir Leicester, has been sadly used. It hears, my dear child, all sorts of shocking things. It makes the world of five miles round quite merry. Not to know that there is something wrong at the Dedlocks' is to augur yourself unknown. One of the peachy-cheeked charmers with the skeleton throats is already apprised of all the principal circumstances that will come out before the Lords on Sir Leicester's application for a bill of divorce.\nAt Blaze and Sparkle's the jewellers and at Sheen and Gloss's the mercers, it is and will be for several hours the topic of the age, the feature of the century. The patronesses of those establishments, albeit so loftily inscrutable, being as nicely weighed and measured there as any other article of the stock-in-trade, are perfectly understood in this new fashion by the rawest hand behind the counter. \"Our people, Mr. Jones,\" said Blaze and Sparkle to the hand in question on engaging him, \"our people, sir, are sheep--mere sheep. Where two or three marked ones go, all the rest follow. Keep those two or three in your eye, Mr. Jones, and you have the flock.\" So, likewise, Sheen and Gloss to THEIR Jones, in reference to knowing where to have the fashionable people and how to bring what they (Sheen and Gloss) choose into fashion. On similar unerring principles, Mr. Sladdery the librarian, and indeed the great farmer of gorgeous sheep, admits this very day, \"Why yes, sir, there certainly ARE reports concerning Lady Dedlock, very current indeed among my high connexion, sir. You see, my high connexion must talk about something, sir; and it's only to get a subject into vogue with one or two ladies I could name to make it go down with the whole. Just what I should have done with those ladies, sir, in the case of any novelty you had left to me to bring in, they have done of themselves in this case through knowing Lady Dedlock and being perhaps a little innocently jealous of her too, sir. You'll find, sir, that this topic will be very popular among my high connexion. If it had been a speculation, sir, it would have brought money. And when I say so, you may trust to my being right, sir, for I have made it my business to study my high connexion and to be able to wind it up like a clock, sir.\"\nThus rumour thrives in the capital, and will not go down into Lincolnshire. By half-past five, post meridian, Horse Guards' time, it has even elicited a new remark from the Honourable Mr. Stables, which bids fair to outshine the old one, on which he has so long rested his colloquial reputation. This sparkling sally is to the effect that although he always knew she was the best-groomed woman in the stud, he had no idea she was a bolter. It is immensely received in turf-circles.\nAt feasts and festivals also, in firmaments she has often graced, and among constellations she outshone but yesterday, she is still the prevalent subject. What is it? Who is it? When was it? Where was it? How was it? She is discussed by her dear friends with all the genteelest slang in vogue, with the last new word, the last new manner, the last new drawl, and the perfection of polite indifference. A remarkable feature of the theme is that it is found to be so inspiring that several people come out upon it who never came out before--positively say things! William Buffy carries one of these smartnesses from the place where he dines down to the House, where the Whip for his party hands it about with his snuff-box to keep men together who want to be off, with such effect that the Speaker (who has had it privately insinuated into his own ear under the corner of his wig) cries, \"Order at the bar!\" three times without making an impression.\nAnd not the least amazing circumstance connected with her being vaguely the town talk is that people hovering on the confines of Mr. Sladdery's high connexion, people who know nothing and ever did know nothing about her, think it essential to their reputation to pretend that she is their topic too, and to retail her at second-hand with the last new word and the last new manner, and the last new drawl, and the last new polite indifference, and all the rest of it, all at second-hand but considered equal to new in inferior systems and to fainter stars. If there be any man of letters, art, or science among these little dealers, how noble in him to support the feeble sisters on such majestic crutches!\nSo goes the wintry day outside the Dedlock mansion. How within it?\nSir Leicester, lying in his bed, can speak a little, though with difficulty and indistinctness. He is enjoined to silence and to rest, and they have given him some opiate to lull his pain, for his old enemy is very hard with him. He is never asleep, though sometimes he seems to fall into a dull waking doze. He caused his bedstead to be moved out nearer to the window when he heard it was such inclement weather, and his head to be so adjusted that he could see the driving snow and sleet. He watches it as it falls, throughout the whole wintry day.\nUpon the least noise in the house, which is kept hushed, his hand is at the pencil. The old housekeeper, sitting by him, knows what he would write and whispers, \"No, he has not come back yet, Sir Leicester. It was late last night when he went. He has been but a little time gone yet.\"\nHe withdraws his hand and falls to looking at the sleet and snow again until they seem, by being long looked at, to fall so thick and fast that he is obliged to close his eyes for a minute on the giddy whirl of white flakes and icy blots.\nHe began to look at them as soon as it was light. The day is not yet far spent when he conceives it to be necessary that her rooms should be prepared for her. It is very cold and wet. Let there be good fires. Let them know that she is expected. Please see to it yourself. He writes to this purpose on his slate, and Mrs. Rouncewell with a heavy heart obeys.\n\"For I dread, George,\" the old lady says to her son, who waits below to keep her company when she has a little leisure, \"I dread, my dear, that my Lady will never more set foot within these walls.\"\n\"That's a bad presentiment, mother.\"\n\"Nor yet within the walls of Chesney Wold, my dear.\"\n\"That's worse. But why, mother?\"\n\"When I saw my Lady yesterday, George, she looked to me--and I may say at me too--as if the step on the Ghost's Walk had almost walked her down.\"\n\"Come, come! You alarm yourself with old-story fears, mother.\"\n\"No I don't, my dear. No I don't. It's going on for sixty year that I have been in this family, and I never had any fears for it before. But it's breaking up, my dear; the great old Dedlock family is breaking up.\"\n\"I hope not, mother.\"\n\"I am thankful I have lived long enough to be with Sir Leicester in this illness and trouble, for I know I am not too old nor too useless to be a welcomer sight to him than anybody else in my place would be. But the step on the Ghost's Walk will walk my Lady down, George; it has been many a day behind her, and now it will pass her and go on.\"\n\"Well, mother dear, I say again, I hope not.\"\n\"Ah, so do I, George,\" the old lady returns, shaking her head and parting her folded hands. \"But if my fears come true, and he has to know it, who will tell him!\"\n\"Are these her rooms?\"\n\"These are my Lady's rooms, just as she left them.\"\n\"Why, now,\" says the trooper, glancing round him and speaking in a lower voice, \"I begin to understand how you come to think as you do think, mother. Rooms get an awful look about them when they are fitted up, like these, for one person you are used to see in them, and that person is away under any shadow, let alone being God knows where.\"\nHe is not far out. As all partings foreshadow the great final one, so, empty rooms, bereft of a familiar presence, mournfully whisper what your room and what mine must one day be. My Lady's state has a hollow look, thus gloomy and abandoned; and in the inner apartment, where Mr. Bucket last night made his secret perquisition, the traces of her dresses and her ornaments, even the mirrors accustomed to reflect them when they were a portion of herself, have a desolate and vacant air. Dark and cold as the wintry day is, it is darker and colder in these deserted chambers than in many a hut that will barely exclude the weather; and though the servants heap fires in the grates and set the couches and the chairs within the warm glass screens that let their ruddy light shoot through to the furthest corners, there is a heavy cloud upon the rooms which no light will dispel.\nThe old housekeeper and her son remain until the preparations are complete, and then she returns upstairs. Volumnia has taken Mrs. Rouncewell's place in the meantime, though pearl necklaces and rouge pots, however calculated to embellish Bath, are but indifferent comforts to the invalid under present circumstances. Volumnia, not being supposed to know (and indeed not knowing) what is the matter, has found it a ticklish task to offer appropriate observations and consequently has supplied their place with distracting smoothings of the bed-linen, elaborate locomotion on tiptoe, vigilant peeping at her kinsman's eyes, and one exasperating whisper to herself of, \"He is asleep.\" In disproof of which superfluous remark Sir Leicester has indignantly written on the slate, \"I am not.\"\nYielding, therefore, the chair at the bedside to the quaint old housekeeper, Volumnia sits at a table a little removed, sympathetically sighing. Sir Leicester watches the sleet and snow and listens for the returning steps that he expects. In the ears of his old servant, looking as if she had stepped out of an old picture-frame to attend a summoned Dedlock to another world, the silence is fraught with echoes of her own words, \"Who will tell him!\"\nHe has been under his valet's hands this morning to be made presentable and is as well got up as the circumstances will allow. He is propped with pillows, his grey hair is brushed in its usual manner, his linen is arranged to a nicety, and he is wrapped in a responsible dressing-gown. His eye-glass and his watch are ready to his hand. It is necessary--less to his own dignity now perhaps than for her sake--that he should be seen as little disturbed and as much himself as may be. Women will talk, and Volumnia, though a Dedlock, is no exceptional case. He keeps her here, there is little doubt, to prevent her talking somewhere else. He is very ill, but he makes his present stand against distress of mind and body most courageously.\nThe fair Volumnia, being one of those sprightly girls who cannot long continue silent without imminent peril of seizure by the dragon Boredom, soon indicates the approach of that monster with a series of undisguisable yawns. Finding it impossible to suppress those yawns by any other process than conversation, she compliments Mrs. Rouncewell on her son, declaring that he positively is one of the finest figures she ever saw and as soldierly a looking person, she should think, as what's his name, her favourite Life Guardsman--the man she dotes on, the dearest of creatures--who was killed at Waterloo.\nSir Leicester hears this tribute with so much surprise and stares about him in such a confused way that Mrs. Rouncewell feels it necessary to explain.\n\"Miss Dedlock don't speak of my eldest son, Sir Leicester, but my youngest. I have found him. He has come home.\"\nSir Leicester breaks silence with a harsh cry. \"George? Your son George come home, Mrs. Rouncewell?\"\nThe old housekeeper wipes her eyes. \"Thank God. Yes, Sir Leicester.\"\nDoes this discovery of some one lost, this return of some one so long gone, come upon him as a strong confirmation of his hopes? Does he think, \"Shall I not, with the aid I have, recall her safely after this, there being fewer hours in her case than there are years in his?\"\nIt is of no use entreating him; he is determined to speak now, and he does. In a thick crowd of sounds, but still intelligibly enough to be understood.\n\"Why did you not tell me, Mrs. Rouncewell?\"\n\"It happened only yesterday, Sir Leicester, and I doubted your being well enough to be talked to of such things.\"\nBesides, the giddy Volumnia now remembers with her little scream that nobody was to have known of his being Mrs. Rouncewell's son and that she was not to have told. But Mrs. Rouncewell protests, with warmth enough to swell the stomacher, that of course she would have told Sir Leicester as soon as he got better.\n\"Where is your son George, Mrs. Rouncewell?\" asks Sir Leicester,\nMrs. Rouncewell, not a little alarmed by his disregard of the doctor's injunctions, replies, in London.\n\"Where in London?\"\nMrs. Rouncewell is constrained to admit that he is in the house.\n\"Bring him here to my room. Bring him directly.\"\nThe old lady can do nothing but go in search of him. Sir Leicester, with such power of movement as he has, arranges himself a little to receive him. When he has done so, he looks out again at the falling sleet and snow and listens again for the returning steps. A quantity of straw has been tumbled down in the street to deaden the noises there, and she might be driven to the door perhaps without his hearing wheels.\nHe is lying thus, apparently forgetful of his newer and minor surprise, when the housekeeper returns, accompanied by her trooper son. Mr. George approaches softly to the bedside, makes his bow, squares his chest, and stands, with his face flushed, very heartily ashamed of himself.\n\"Good heaven, and it is really George Rouncewell!\" exclaims Sir Leicester. \"Do you remember me, George?\"\nThe trooper needs to look at him and to separate this sound from that sound before he knows what he has said, but doing this and being a little helped by his mother, he replies, \"I must have a very bad memory, indeed, Sir Leicester, if I failed to remember you.\"\n\"When I look at you, George Rouncewell,\" Sir Leicester observes with difficulty, \"I see something of a boy at Chesney Wold--I remember well--very well.\"\nHe looks at the trooper until tears come into his eyes, and then he looks at the sleet and snow again.\n\"I ask your pardon, Sir Leicester,\" says the trooper, \"but would you accept of my arms to raise you up? You would lie easier, Sir Leicester, if you would allow me to move you.\"\n\"If you please, George Rouncewell; if you will be so good.\"\nThe trooper takes him in his arms like a child, lightly raises him, and turns him with his face more towards the window. \"Thank you. You have your mother's gentleness,\" returns Sir Leicester, \"and your own strength. Thank you.\"\nHe signs to him with his hand not to go away. George quietly remains at the bedside, waiting to be spoken to.\n\"Why did you wish for secrecy?\" It takes Sir Leicester some time to ask this.\n\"Truly I am not much to boast of, Sir Leicester, and I--I should still, Sir Leicester, if you was not so indisposed--which I hope you will not be long--I should still hope for the favour of being allowed to remain unknown in general. That involves explanations not very hard to be guessed at, not very well timed here, and not very creditable to myself. However opinions may differ on a variety of subjects, I should think it would be universally agreed, Sir Leicester, that I am not much to boast of.\"\n\"You have been a soldier,\" observes Sir Leicester, \"and a faithful one.\"\nGeorge makes his military bow. \"As far as that goes, Sir Leicester, I have done my duty under discipline, and it was the least I could do.\"\n\"You find me,\" says Sir Leicester, whose eyes are much attracted towards him, \"far from well, George Rouncewell.\"\n\"I am very sorry both to hear it and to see it, Sir Leicester.\"\n\"I am sure you are. No. In addition to my older malady, I have had a sudden and bad attack. Something that deadens,\" making an endeavour to pass one hand down one side, \"and confuses,\" touching his lips.\nGeorge, with a look of assent and sympathy, makes another bow. The different times when they were both young men (the trooper much the younger of the two) and looked at one another down at Chesney Wold arise before them both and soften both.\nSir Leicester, evidently with a great determination to say, in his own manner, something that is on his mind before relapsing into silence, tries to raise himself among his pillows a little more. George, observant of the action, takes him in his arms again and places him as he desires to be. \"Thank you, George. You are another self to me. You have often carried my spare gun at Chesney Wold, George. You are familiar to me in these strange circumstances, very familiar.\" He has put Sir Leicester's sounder arm over his shoulder in lifting him up, and Sir Leicester is slow in drawing it away again as he says these words.\n\"I was about to add,\" he presently goes on, \"I was about to add, respecting this attack, that it was unfortunately simultaneous with a slight misunderstanding between my Lady and myself. I do not mean that there was any difference between us (for there has been none), but that there was a misunderstanding of certain circumstances important only to ourselves, which deprives me, for a little while, of my Lady's society. She has found it necessary to make a journey--I trust will shortly return. Volumnia, do I make myself intelligible? The words are not quite under my command in the manner of pronouncing them.\"\nVolumnia understands him perfectly, and in truth he delivers himself with far greater plainness than could have been supposed possible a minute ago. The effort by which he does so is written in the anxious and labouring expression of his face. Nothing but the strength of his purpose enables him to make it.\n\"Therefore, Volumnia, I desire to say in your presence--and in the presence of my old retainer and friend, Mrs. Rouncewell, whose truth and fidelity no one can question, and in the presence of her son George, who comes back like a familiar recollection of my youth in the home of my ancestors at Chesney Wold--in case I should relapse, in case I should not recover, in case I should lose both my speech and the power of writing, though I hope for better things--\"\nThe old housekeeper weeping silently; Volumnia in the greatest agitation, with the freshest bloom on her cheeks; the trooper with his arms folded and his head a little bent, respectfully attentive.\n\"Therefore I desire to say, and to call you all to witness--beginning, Volumnia, with yourself, most solemnly--that I am on unaltered terms with Lady Dedlock. That I assert no cause whatever of complaint against her. That I have ever had the strongest affection for her, and that I retain it undiminished. Say this to herself, and to every one. If you ever say less than this, you will be guilty of deliberate falsehood to me.\"\nVolumnia tremblingly protests that she will observe his injunctions to the letter.\n\"My Lady is too high in position, too handsome, too accomplished, too superior in most respects to the best of those by whom she is surrounded, not to have her enemies and traducers, I dare say. Let it be known to them, as I make it known to you, that being of sound mind, memory, and understanding, I revoke no disposition I have made in her favour. I abridge nothing I have ever bestowed upon her. I am on unaltered terms with her, and I recall--having the full power to do it if I were so disposed, as you see--no act I have done for her advantage and happiness.\"\nHis formal array of words might have at any other time, as it has often had, something ludicrous in it, but at this time it is serious and affecting. His noble earnestness, his fidelity, his gallant shielding of her, his generous conquest of his own wrong and his own pride for her sake, are simply honourable, manly, and true. Nothing less worthy can be seen through the lustre of such qualities in the commonest mechanic, nothing less worthy can be seen in the best-born gentleman. In such a light both aspire alike, both rise alike, both children of the dust shine equally.\nOverpowered by his exertions, he lays his head back on his pillows and closes his eyes for not more than a minute, when he again resumes his watching of the weather and his attention to the muffled sounds. In the rendering of those little services, and in the manner of their acceptance, the trooper has become installed as necessary to him. Nothing has been said, but it is quite understood. He falls a step or two backward to be out of sight and mounts guard a little behind his mother's chair.\nThe day is now beginning to decline. The mist and the sleet into which the snow has all resolved itself are darker, and the blaze begins to tell more vividly upon the room walls and furniture. The gloom augments; the bright gas springs up in the streets; and the pertinacious oil lamps which yet hold their ground there, with their source of life half frozen and half thawed, twinkle gaspingly like fiery fish out of water--as they are. The world, which has been rumbling over the straw and pulling at the bell, \"to inquire,\" begins to go home, begins to dress, to dine, to discuss its dear friend with all the last new modes, as already mentioned.\nNow does Sir Leicester become worse, restless, uneasy, and in great pain. Volumnia, lighting a candle (with a predestined aptitude for doing something objectionable), is bidden to put it out again, for it is not yet dark enough. Yet it is very dark too, as dark as it will be all night. By and by she tries again. No! Put it out. It is not dark enough yet.\nHis old housekeeper is the first to understand that he is striving to uphold the fiction with himself that it is not growing late.\n\"Dear Sir Leicester, my honoured master,\" she softly whispers, \"I must, for your own good, and my duty, take the freedom of begging and praying that you will not lie here in the lone darkness watching and waiting and dragging through the time. Let me draw the curtains, and light the candles, and make things more comfortable about you. The church-clocks will strike the hours just the same, Sir Leicester, and the night will pass away just the same. My Lady will come back, just the same.\"\n\"I know it, Mrs. Rouncewell, but I am weak--and she has been so long gone.\"\n\"Not so very long, Sir Leicester. Not twenty-four hours yet.\"\n\"But that is a long time. Oh, it is a long time!\"\nHe says it with a groan that wrings her heart.\nShe knows that this is not a period for bringing the rough light upon him; she thinks his tears too sacred to be seen, even by her. Therefore she sits in the darkness for a while without a word, then gently begins to move about, now stirring the fire, now standing at the dark window looking out. Finally he tells her, with recovered self-command, \"As you say, Mrs. Rouncewell, it is no worse for being confessed. It is getting late, and they are not come. Light the room!\" When it is lighted and the weather shut out, it is only left to him to listen.\nBut they find that however dejected and ill he is, he brightens when a quiet pretence is made of looking at the fires in her rooms and being sure that everything is ready to receive her. Poor pretence as it is, these allusions to her being expected keep up hope within him.\nMidnight comes, and with it the same blank. The carriages in the streets are few, and other late sounds in that neighbourhood there are none, unless a man so very nomadically drunk as to stray into the frigid zone goes brawling and bellowing along the pavement. Upon this wintry night it is so still that listening to the intense silence is like looking at intense darkness. If any distant sound be audible in this case, it departs through the gloom like a feeble light in that, and all is heavier than before.\nThe corporation of servants are dismissed to bed (not unwilling to go, for they were up all last night), and only Mrs. Rouncewell and George keep watch in Sir Leicester's room. As the night lags tardily on--or rather when it seems to stop altogether, at between two and three o'clock--they find a restless craving on him to know more about the weather, now he cannot see it. Hence George, patrolling regularly every half-hour to the rooms so carefully looked after, extends his march to the hall-door, looks about him, and brings back the best report he can make of the worst of nights, the sleet still falling and even the stone footways lying ankle-deep in icy sludge.\nVolumnia, in her room up a retired landing on the staircase--the second turning past the end of the carving and gilding, a cousinly room containing a fearful abortion of a portrait of Sir Leicester banished for its crimes, and commanding in the day a solemn yard planted with dried-up shrubs like antediluvian specimens of black tea--is a prey to horrors of many kinds. Not last nor least among them, possibly, is a horror of what may befall her little income in the event, as she expresses it, \"of anything happening\" to Sir Leicester. Anything, in this sense, meaning one thing only; and that the last thing that can happen to the consciousness of any baronet in the known world.\nAn effect of these horrors is that Volumnia finds she cannot go to bed in her own room or sit by the fire in her own room, but must come forth with her fair head tied up in a profusion of shawl, and her fair form enrobed in drapery, and parade the mansion like a ghost, particularly haunting the rooms, warm and luxurious, prepared for one who still does not return. Solitude under such circumstances being not to be thought of, Volumnia is attended by her maid, who, impressed from her own bed for that purpose, extremely cold, very sleepy, and generally an injured maid as condemned by circumstances to take office with a cousin, when she had resolved to be maid to nothing less than ten thousand a year, has not a sweet expression of countenance.\nThe periodical visits of the trooper to these rooms, however, in the course of his patrolling is an assurance of protection and company both to mistress and maid, which renders them very acceptable in the small hours of the night. Whenever he is heard advancing, they both make some little decorative preparation to receive him; at other times they divide their watches into short scraps of oblivion and dialogues not wholly free from acerbity, as to whether Miss Dedlock, sitting with her feet upon the fender, was or was not falling into the fire when rescued (to her great displeasure) by her guardian genius the maid.\n\"How is Sir Leicester now, Mr. George?\" inquires Volumnia, adjusting her cowl over her head.\n\"Why, Sir Leicester is much the same, miss. He is very low and ill, and he even wanders a little sometimes.\"\n\"Has he asked for me?\" inquires Volumnia tenderly.\n\"Why, no, I can't say he has, miss. Not within my hearing, that is to say.\"\n\"This is a truly sad time, Mr. George.\"\n\"It is indeed, miss. Hadn't you better go to bed?\"\n\"You had a deal better go to bed, Miss Dedlock,\" quoth the maid sharply.\nBut Volumnia answers No! No! She may be asked for, she may be wanted at a moment's notice. She never should forgive herself \"if anything was to happen\" and she was not on the spot. She declines to enter on the question, mooted by the maid, how the spot comes to be there, and not in her room (which is nearer to Sir Leicester's), but staunchly declares that on the spot she will remain. Volumnia further makes a merit of not having \"closed an eye\"--as if she had twenty or thirty--though it is hard to reconcile this statement with her having most indisputably opened two within five minutes.\nBut when it comes to four o'clock, and still the same blank, Volumnia's constancy begins to fail her, or rather it begins to strengthen, for she now considers that it is her duty to be ready for the morrow, when much may be expected of her, that, in fact, howsoever anxious to remain upon the spot, it may be required of her, as an act of self-devotion, to desert the spot. So when the trooper reappears with his, \"Hadn't you better go to bed, miss?\" and when the maid protests, more sharply than before, \"You had a deal better go to bed, Miss Dedlock!\" she meekly rises and says, \"Do with me what you think best!\"\nMr. George undoubtedly thinks it best to escort her on his arm to the door of her cousinly chamber, and the maid as undoubtedly thinks it best to hustle her into bed with mighty little ceremony. Accordingly, these steps are taken; and now the trooper, in his rounds, has the house to himself.\nThere is no improvement in the weather. From the portico, from the eaves, from the parapet, from every ledge and post and pillar, drips the thawed snow. It has crept, as if for shelter, into the lintels of the great door--under it, into the corners of the windows, into every chink and crevice of retreat, and there wastes and dies. It is falling still; upon the roof, upon the skylight, even through the skylight, and drip, drip, drip, with the regularity of the Ghost's Walk, on the stone floor below.\nThe trooper, his old recollections awakened by the solitary grandeur of a great house--no novelty to him once at Chesney Wold--goes up the stairs and through the chief rooms, holding up his light at arm's length. Thinking of his varied fortunes within the last few weeks, and of his rustic boyhood, and of the two periods of his life so strangely brought together across the wide intermediate space; thinking of the murdered man whose image is fresh in his mind; thinking of the lady who has disappeared from these very rooms and the tokens of whose recent presence are all here; thinking of the master of the house upstairs and of the foreboding, \"Who will tell him!\" he looks here and looks there, and reflects how he MIGHT see something now, which it would tax his boldness to walk up to, lay his hand upon, and prove to be a fancy. But it is all blank, blank as the darkness above and below, while he goes up the great staircase again, blank as the oppressive silence.\n\"All is still in readiness, George Rouncewell?\"\n\"Quite orderly and right, Sir Leicester.\"\n\"No word of any kind?\"\nThe trooper shakes his head.\n\"No letter that can possibly have been overlooked?\"\nBut he knows there is no such hope as that and lays his head down without looking for an answer.\nVery familiar to him, as he said himself some hours ago, George Rouncewell lifts him into easier positions through the long remainder of the blank wintry night, and equally familiar with his unexpressed wish, extinguishes the light and undraws the curtains at the first late break of day. The day comes like a phantom. Cold, colourless, and vague, it sends a warning streak before it of a deathlike hue, as if it cried out, \"Look what I am bringing you who watch there! Who will tell him!\"",
        "paragraph_chars": [
            [
                0,
                509
            ],
            [
                509,
                1107
            ],
            [
                1107,
                2916
            ],
            [
                2916,
                3398
            ],
            [
                3398,
                4346
            ],
            [
                4346,
                5052
            ],
            [
                5052,
                5119
            ],
            [
                5119,
                5670
            ],
            [
                5670,
                5955
            ],
            [
                5955,
                6194
            ],
            [
                6194,
                6552
            ],
            [
                6552,
                6750
            ],
            [
                6750,
                6787
            ],
            [
                6787,
                6840
            ],
            [
                6840,
                6873
            ],
            [
                6873,
                7019
            ],
            [
                7019,
                7082
            ],
            [
                7082,
                7296
            ],
            [
                7296,
                7318
            ],
            [
                7318,
                7663
            ],
            [
                7663,
                7709
            ],
            [
                7709,
                7872
            ],
            [
                7872,
                7895
            ],
            [
                7895,
                7947
            ],
            [
                7947,
                8289
            ],
            [
                8289,
                9165
            ],
            [
                9165,
                9951
            ],
            [
                9951,
                10401
            ],
            [
                10401,
                11138
            ],
            [
                11138,
                11743
            ],
            [
                11743,
                11894
            ],
            [
                11894,
                12007
            ],
            [
                12007,
                12108
            ],
            [
                12108,
                12177
            ],
            [
                12177,
                12452
            ],
            [
                12452,
                12604
            ],
            [
                12604,
                12648
            ],
            [
                12648,
                12762
            ],
            [
                12762,
                13075
            ],
            [
                13075,
                13140
            ],
            [
                13140,
                13244
            ],
            [
                13244,
                13263
            ],
            [
                13263,
                13328
            ],
            [
                13328,
                13377
            ],
            [
                13377,
                13795
            ],
            [
                13795,
                14077
            ],
            [
                14077,
                14182
            ],
            [
                14182,
                14445
            ],
            [
                14445,
                14598
            ],
            [
                14598,
                14701
            ],
            [
                14701,
                14878
            ],
            [
                14878,
                14938
            ],
            [
                14938,
                15166
            ],
            [
                15166,
                15276
            ],
            [
                15276,
                15354
            ],
            [
                15354,
                15857
            ],
            [
                15857,
                15930
            ],
            [
                15930,
                16070
            ],
            [
                16070,
                16184
            ],
            [
                16184,
                16248
            ],
            [
                16248,
                16452
            ],
            [
                16452,
                16694
            ],
            [
                16694,
                17318
            ],
            [
                17318,
                17933
            ],
            [
                17933,
                18241
            ],
            [
                18241,
                18705
            ],
            [
                18705,
                18903
            ],
            [
                18903,
                19331
            ],
            [
                19331,
                19414
            ],
            [
                19414,
                19981
            ],
            [
                19981,
                20558
            ],
            [
                20558,
                21055
            ],
            [
                21055,
                21704
            ],
            [
                21704,
                22061
            ],
            [
                22061,
                22192
            ],
            [
                22192,
                22683
            ],
            [
                22683,
                22759
            ],
            [
                22759,
                22821
            ],
            [
                22821,
                22871
            ],
            [
                22871,
                22918
            ],
            [
                22918,
                23471
            ],
            [
                23471,
                23745
            ],
            [
                23745,
                24256
            ],
            [
                24256,
                24927
            ],
            [
                24927,
                25609
            ],
            [
                25609,
                26359
            ],
            [
                26359,
                26981
            ],
            [
                26981,
                27074
            ],
            [
                27074,
                27183
            ],
            [
                27183,
                27234
            ],
            [
                27234,
                27310
            ],
            [
                27310,
                27350
            ],
            [
                27350,
                27401
            ],
            [
                27401,
                27474
            ],
            [
                27474,
                28067
            ],
            [
                28067,
                28682
            ],
            [
                28682,
                28975
            ],
            [
                28975,
                29479
            ],
            [
                29479,
                30452
            ],
            [
                30452,
                30500
            ],
            [
                30500,
                30542
            ],
            [
                30542,
                30565
            ],
            [
                30565,
                30594
            ],
            [
                30594,
                30646
            ],
            [
                30646,
                30743
            ],
            [
                30743,
                31232
            ]
        ],
        "segment_chars": [
            [
                0,
                128
            ],
            [
                128,
                410
            ],
            [
                410,
                509
            ],
            [
                509,
                577
            ],
            [
                577,
                628
            ],
            [
                628,
                705
            ],
            [
                705,
                760
            ],
            [
                760,
                812
            ],
            [
                812,
                901
            ],
            [
                901,
                1107
            ],
            [
                1107,
                1268
            ],
            [
                1268,
                1511
            ],
            [
                1511,
                1641
            ],
            [
                1641,
                1697
            ],
            [
                1697,
                1770
            ],
            [
                1770,
                1943
            ],
            [
                1943,
                2190
            ],
            [
                2190,
                2362
            ],
            [
                2362,
                2608
            ],
            [
                2608,
                2688
            ],
            [
                2688,
                2752
            ],
            [
                2752,
                2916
            ],
            [
                2916,
                2992
            ],
            [
                2992,
                3212
            ],
            [
                3212,
                3356
            ],
            [
                3356,
                3398
            ],
            [
                3398,
                3553
            ],
            [
                3553,
                3565
            ],
            [
                3565,
                3576
            ],
            [
                3576,
                3589
            ],
            [
                3589,
                3603
            ],
            [
                3603,
                3615
            ],
            [
                3615,
                3800
            ],
            [
                3800,
                3960
            ],
            [
                3960,
                4304
            ],
            [
                4304,
                4346
            ],
            [
                4346,
                4902
            ],
            [
                4902,
                5052
            ],
            [
                5052,
                5104
            ],
            [
                5104,
                5119
            ],
            [
                5119,
                5215
            ],
            [
                5215,
                5349
            ],
            [
                5349,
                5428
            ],
            [
                5428,
                5610
            ],
            [
                5610,
                5670
            ],
            [
                5670,
                5754
            ],
            [
                5754,
                5877
            ],
            [
                5877,
                5914
            ],
            [
                5914,
                5955
            ],
            [
                5955,
                6194
            ],
            [
                6194,
                6244
            ],
            [
                6244,
                6353
            ],
            [
                6353,
                6378
            ],
            [
                6378,
                6403
            ],
            [
                6403,
                6439
            ],
            [
                6439,
                6466
            ],
            [
                6466,
                6552
            ],
            [
                6552,
                6750
            ],
            [
                6750,
                6787
            ],
            [
                6787,
                6840
            ],
            [
                6840,
                6855
            ],
            [
                6855,
                6873
            ],
            [
                6873,
                7019
            ],
            [
                7019,
                7032
            ],
            [
                7032,
                7082
            ],
            [
                7082,
                7104
            ],
            [
                7104,
                7116
            ],
            [
                7116,
                7219
            ],
            [
                7219,
                7296
            ],
            [
                7296,
                7318
            ],
            [
                7318,
                7526
            ],
            [
                7526,
                7663
            ],
            [
                7663,
                7709
            ],
            [
                7709,
                7801
            ],
            [
                7801,
                7872
            ],
            [
                7872,
                7895
            ],
            [
                7895,
                7947
            ],
            [
                7947,
                8097
            ],
            [
                8097,
                8289
            ],
            [
                8289,
                8308
            ],
            [
                8308,
                8469
            ],
            [
                8469,
                8775
            ],
            [
                8775,
                9165
            ],
            [
                9165,
                9272
            ],
            [
                9272,
                9482
            ],
            [
                9482,
                9847
            ],
            [
                9847,
                9951
            ],
            [
                9951,
                10096
            ],
            [
                10096,
                10190
            ],
            [
                10190,
                10401
            ],
            [
                10401,
                10528
            ],
            [
                10528,
                10687
            ],
            [
                10687,
                10738
            ],
            [
                10738,
                10884
            ],
            [
                10884,
                10957
            ],
            [
                10957,
                11038
            ],
            [
                11038,
                11138
            ],
            [
                11138,
                11363
            ],
            [
                11363,
                11743
            ],
            [
                11743,
                11894
            ],
            [
                11894,
                11970
            ],
            [
                11970,
                11988
            ],
            [
                11988,
                12007
            ],
            [
                12007,
                12054
            ],
            [
                12054,
                12063
            ],
            [
                12063,
                12108
            ],
            [
                12108,
                12144
            ],
            [
                12144,
                12156
            ],
            [
                12156,
                12177
            ],
            [
                12177,
                12306
            ],
            [
                12306,
                12452
            ],
            [
                12452,
                12528
            ],
            [
                12528,
                12604
            ],
            [
                12604,
                12648
            ],
            [
                12648,
                12762
            ],
            [
                12762,
                12927
            ],
            [
                12927,
                13075
            ],
            [
                13075,
                13120
            ],
            [
                13120,
                13140
            ],
            [
                13140,
                13244
            ],
            [
                13244,
                13263
            ],
            [
                13263,
                13328
            ],
            [
                13328,
                13356
            ],
            [
                13356,
                13377
            ],
            [
                13377,
                13430
            ],
            [
                13430,
                13526
            ],
            [
                13526,
                13639
            ],
            [
                13639,
                13795
            ],
            [
                13795,
                13929
            ],
            [
                13929,
                14077
            ],
            [
                14077,
                14128
            ],
            [
                14128,
                14152
            ],
            [
                14152,
                14182
            ],
            [
                14182,
                14445
            ],
            [
                14445,
                14598
            ],
            [
                14598,
                14701
            ],
            [
                14701,
                14805
            ],
            [
                14805,
                14878
            ],
            [
                14878,
                14938
            ],
            [
                14938,
                15059
            ],
            [
                15059,
                15071
            ],
            [
                15071,
                15154
            ],
            [
                15154,
                15166
            ],
            [
                15166,
                15212
            ],
            [
                15212,
                15276
            ],
            [
                15276,
                15308
            ],
            [
                15308,
                15354
            ],
            [
                15354,
                15588
            ],
            [
                15588,
                15708
            ],
            [
                15708,
                15857
            ],
            [
                15857,
                15930
            ],
            [
                15930,
                15961
            ],
            [
                15961,
                16070
            ],
            [
                16070,
                16184
            ],
            [
                16184,
                16248
            ],
            [
                16248,
                16268
            ],
            [
                16268,
                16272
            ],
            [
                16272,
                16340
            ],
            [
                16340,
                16452
            ],
            [
                16452,
                16515
            ],
            [
                16515,
                16694
            ],
            [
                16694,
                16890
            ],
            [
                16890,
                16987
            ],
            [
                16987,
                17007
            ],
            [
                17007,
                17035
            ],
            [
                17035,
                17096
            ],
            [
                17096,
                17167
            ],
            [
                17167,
                17318
            ],
            [
                17318,
                17505
            ],
            [
                17505,
                17740
            ],
            [
                17740,
                17815
            ],
            [
                17815,
                17856
            ],
            [
                17856,
                17933
            ],
            [
                17933,
                18082
            ],
            [
                18082,
                18177
            ],
            [
                18177,
                18241
            ],
            [
                18241,
                18705
            ],
            [
                18705,
                18903
            ],
            [
                18903,
                19062
            ],
            [
                19062,
                19120
            ],
            [
                19120,
                19209
            ],
            [
                19209,
                19248
            ],
            [
                19248,
                19331
            ],
            [
                19331,
                19414
            ],
            [
                19414,
                19609
            ],
            [
                19609,
                19765
            ],
            [
                19765,
                19814
            ],
            [
                19814,
                19981
            ],
            [
                19981,
                20131
            ],
            [
                20131,
                20309
            ],
            [
                20309,
                20465
            ],
            [
                20465,
                20558
            ],
            [
                20558,
                20764
            ],
            [
                20764,
                20900
            ],
            [
                20900,
                20951
            ],
            [
                20951,
                21055
            ],
            [
                21055,
                21092
            ],
            [
                21092,
                21248
            ],
            [
                21248,
                21492
            ],
            [
                21492,
                21704
            ],
            [
                21704,
                21778
            ],
            [
                21778,
                21933
            ],
            [
                21933,
                21991
            ],
            [
                21991,
                22018
            ],
            [
                22018,
                22022
            ],
            [
                22022,
                22034
            ],
            [
                22034,
                22061
            ],
            [
                22061,
                22192
            ],
            [
                22192,
                22436
            ],
            [
                22436,
                22529
            ],
            [
                22529,
                22643
            ],
            [
                22643,
                22683
            ],
            [
                22683,
                22759
            ],
            [
                22759,
                22793
            ],
            [
                22793,
                22821
            ],
            [
                22821,
                22847
            ],
            [
                22847,
                22871
            ],
            [
                22871,
                22918
            ],
            [
                22918,
                23050
            ],
            [
                23050,
                23215
            ],
            [
                23215,
                23332
            ],
            [
                23332,
                23375
            ],
            [
                23375,
                23392
            ],
            [
                23392,
                23471
            ],
            [
                23471,
                23658
            ],
            [
                23658,
                23745
            ],
            [
                23745,
                23789
            ],
            [
                23789,
                24007
            ],
            [
                24007,
                24120
            ],
            [
                24120,
                24256
            ],
            [
                24256,
                24433
            ],
            [
                24433,
                24631
            ],
            [
                24631,
                24927
            ],
            [
                24927,
                25297
            ],
            [
                25297,
                25464
            ],
            [
                25464,
                25609
            ],
            [
                25609,
                25976
            ],
            [
                25976,
                26359
            ],
            [
                26359,
                26590
            ],
            [
                26590,
                26981
            ],
            [
                26981,
                27021
            ],
            [
                27021,
                27074
            ],
            [
                27074,
                27118
            ],
            [
                27118,
                27183
            ],
            [
                27183,
                27206
            ],
            [
                27206,
                27234
            ],
            [
                27234,
                27270
            ],
            [
                27270,
                27310
            ],
            [
                27310,
                27350
            ],
            [
                27350,
                27371
            ],
            [
                27371,
                27401
            ],
            [
                27401,
                27474
            ],
            [
                27474,
                27499
            ],
            [
                27499,
                27503
            ],
            [
                27503,
                27565
            ],
            [
                27565,
                27655
            ],
            [
                27655,
                27861
            ],
            [
                27861,
                28067
            ],
            [
                28067,
                28441
            ],
            [
                28441,
                28518
            ],
            [
                28518,
                28621
            ],
            [
                28621,
                28682
            ],
            [
                28682,
                28877
            ],
            [
                28877,
                28975
            ],
            [
                28975,
                29015
            ],
            [
                29015,
                29128
            ],
            [
                29128,
                29308
            ],
            [
                29308,
                29479
            ],
            [
                29479,
                29692
            ],
            [
                29692,
                30148
            ],
            [
                30148,
                30315
            ],
            [
                30315,
                30452
            ],
            [
                30452,
                30500
            ],
            [
                30500,
                30542
            ],
            [
                30542,
                30565
            ],
            [
                30565,
                30594
            ],
            [
                30594,
                30646
            ],
            [
                30646,
                30743
            ],
            [
                30743,
                31032
            ],
            [
                31032,
                31062
            ],
            [
                31062,
                31213
            ],
            [
                31213,
                31232
            ]
        ],
        "overlap_chars": [
            [
                0,
                64
            ],
            [
                83,
                88
            ],
            [
                108,
                128
            ],
            [
                410,
                509
            ],
            [
                509,
                516
            ],
            [
                532,
                540
            ],
            [
                580,
                628
            ],
            [
                628,
                641
            ],
            [
                647,
                651
            ],
            [
                669,
                682
            ],
            [
                684,
                705
            ],
            [
                705,
                760
            ],
            [
                760,
                812
            ],
            [
                2992,
                3009
            ],
            [
                3044,
                3152
            ],
            [
                3210,
                3212
            ],
            [
                3212,
                3356
            ],
            [
                3356,
                3371
            ],
            [
                3372,
                3398
            ],
            [
                3615,
                3800
            ],
            [
                4346,
                4349
            ],
            [
                4506,
                4529
            ],
            [
                4556,
                4565
            ],
            [
                4567,
                4585
            ],
            [
                4606,
                4718
            ],
            [
                4744,
                4749
            ],
            [
                4787,
                4811
            ],
            [
                4477,
                4478
            ],
            [
                5052,
                5104
            ],
            [
                5104,
                5119
            ],
            [
                5119,
                5215
            ],
            [
                5215,
                5220
            ],
            [
                5245,
                5315
            ],
            [
                5326,
                5349
            ],
            [
                5349,
                5388
            ],
            [
                5403,
                5428
            ],
            [
                5428,
                5462
            ],
            [
                5467,
                5508
            ],
            [
                5514,
                5532
            ],
            [
                5552,
                5554
            ],
            [
                5569,
                5571
            ],
            [
                5578,
                5610
            ],
            [
                5610,
                5670
            ],
            [
                5670,
                5754
            ],
            [
                5754,
                5877
            ],
            [
                5877,
                5914
            ],
            [
                5914,
                5925
            ],
            [
                5930,
                5955
            ],
            [
                5955,
                6041
            ],
            [
                6068,
                6178
            ],
            [
                6192,
                6194
            ],
            [
                6244,
                6353
            ],
            [
                6353,
                6378
            ],
            [
                6378,
                6403
            ],
            [
                6403,
                6439
            ],
            [
                6466,
                6475
            ],
            [
                6479,
                6483
            ],
            [
                6492,
                6552
            ],
            [
                6552,
                6604
            ],
            [
                6672,
                6680
            ],
            [
                6691,
                6747
            ],
            [
                6788,
                6840
            ],
            [
                6855,
                6873
            ],
            [
                6873,
                6928
            ],
            [
                6955,
                7019
            ],
            [
                7019,
                7032
            ],
            [
                7032,
                7082
            ],
            [
                7082,
                7085
            ],
            [
                7086,
                7104
            ],
            [
                7116,
                7219
            ],
            [
                7219,
                7248
            ],
            [
                7293,
                7296
            ],
            [
                7296,
                7318
            ],
            [
                7318,
                7382
            ],
            [
                7410,
                7427
            ],
            [
                7462,
                7526
            ],
            [
                7526,
                7663
            ],
            [
                7872,
                7895
            ],
            [
                7895,
                7947
            ],
            [
                7947,
                8081
            ],
            [
                8087,
                8097
            ],
            [
                8097,
                8155
            ],
            [
                8169,
                8183
            ],
            [
                8155,
                8156
            ],
            [
                8229,
                8242
            ],
            [
                8247,
                8254
            ],
            [
                8271,
                8289
            ],
            [
                8289,
                8294
            ],
            [
                8306,
                8308
            ],
            [
                8469,
                8478
            ],
            [
                8485,
                8497
            ],
            [
                8516,
                8529
            ],
            [
                8498,
                8502
            ],
            [
                8529,
                8530
            ],
            [
                8775,
                8876
            ],
            [
                8877,
                8880
            ],
            [
                8567,
                8568
            ],
            [
                8923,
                8967
            ],
            [
                9097,
                9165
            ],
            [
                9210,
                9240
            ],
            [
                9254,
                9272
            ],
            [
                9272,
                9290
            ],
            [
                9309,
                9314
            ],
            [
                9306,
                9308
            ],
            [
                9330,
                9369
            ],
            [
                9409,
                9412
            ],
            [
                9417,
                9452
            ],
            [
                9480,
                9482
            ],
            [
                9482,
                9495
            ],
            [
                9535,
                9542
            ],
            [
                9544,
                9567
            ],
            [
                9511,
                9513
            ],
            [
                9674,
                9724
            ],
            [
                9739,
                9745
            ],
            [
                9785,
                9815
            ],
            [
                9827,
                9847
            ],
            [
                9862,
                9867
            ],
            [
                9901,
                9904
            ],
            [
                9887,
                9900
            ],
            [
                9905,
                9951
            ],
            [
                9951,
                9971
            ],
            [
                9997,
                10052
            ],
            [
                10069,
                10096
            ],
            [
                10096,
                10190
            ],
            [
                10419,
                10428
            ],
            [
                10404,
                10407
            ],
            [
                10456,
                10460
            ],
            [
                10480,
                10482
            ],
            [
                10461,
                10472
            ],
            [
                10495,
                10528
            ],
            [
                10528,
                10580
            ],
            [
                10600,
                10611
            ],
            [
                10615,
                10623
            ],
            [
                10635,
                10659
            ],
            [
                10672,
                10687
            ],
            [
                10687,
                10738
            ],
            [
                10738,
                10753
            ],
            [
                10810,
                10842
            ],
            [
                10873,
                10884
            ],
            [
                10884,
                10913
            ],
            [
                10933,
                10938
            ],
            [
                10955,
                10957
            ],
            [
                10957,
                10974
            ],
            [
                10999,
                11038
            ],
            [
                11038,
                11070
            ],
            [
                11079,
                11138
            ],
            [
                11138,
                11231
            ],
            [
                11250,
                11341
            ],
            [
                11356,
                11363
            ],
            [
                11363,
                11396
            ],
            [
                11667,
                11670
            ],
            [
                11403,
                11408
            ],
            [
                11409,
                11411
            ],
            [
                11435,
                11636
            ],
            [
                11715,
                11743
            ],
            [
                11743,
                11797
            ],
            [
                11842,
                11862
            ],
            [
                11882,
                11894
            ],
            [
                11894,
                11970
            ],
            [
                11970,
                11988
            ],
            [
                11988,
                12007
            ],
            [
                12054,
                12063
            ],
            [
                12063,
                12078
            ],
            [
                12079,
                12108
            ],
            [
                12108,
                12144
            ],
            [
                12144,
                12156
            ],
            [
                12156,
                12177
            ],
            [
                12177,
                12213
            ],
            [
                12253,
                12306
            ],
            [
                12484,
                12528
            ],
            [
                12528,
                12604
            ],
            [
                12604,
                12648
            ],
            [
                12648,
                12762
            ],
            [
                12762,
                12808
            ],
            [
                12813,
                12831
            ],
            [
                12885,
                12887
            ],
            [
                12839,
                12842
            ],
            [
                12843,
                12845
            ],
            [
                12925,
                12927
            ],
            [
                12927,
                12955
            ],
            [
                13000,
                13062
            ],
            [
                13067,
                13075
            ],
            [
                13075,
                13084
            ],
            [
                13094,
                13120
            ],
            [
                13120,
                13140
            ],
            [
                13263,
                13278
            ],
            [
                13303,
                13328
            ],
            [
                13328,
                13343
            ],
            [
                13366,
                13377
            ],
            [
                13377,
                13389
            ],
            [
                13430,
                13526
            ],
            [
                13526,
                13639
            ],
            [
                13659,
                13667
            ],
            [
                13681,
                13758
            ],
            [
                13767,
                13795
            ],
            [
                13795,
                13811
            ],
            [
                13867,
                13929
            ],
            [
                13929,
                14077
            ],
            [
                14077,
                14090
            ],
            [
                14095,
                14128
            ],
            [
                14128,
                14152
            ],
            [
                14152,
                14182
            ],
            [
                14182,
                14202
            ],
            [
                14274,
                14295
            ],
            [
                14311,
                14445
            ],
            [
                14445,
                14567
            ],
            [
                14569,
                14584
            ],
            [
                14595,
                14598
            ],
            [
                14634,
                14701
            ],
            [
                14701,
                14769
            ],
            [
                14791,
                14805
            ],
            [
                14805,
                14878
            ],
            [
                14878,
                14879
            ],
            [
                14913,
                14938
            ],
            [
                14938,
                15019
            ],
            [
                15034,
                15058
            ],
            [
                15059,
                15071
            ],
            [
                15071,
                15152
            ],
            [
                15166,
                15181
            ],
            [
                15196,
                15212
            ],
            [
                15212,
                15276
            ],
            [
                15276,
                15308
            ],
            [
                15308,
                15354
            ],
            [
                15354,
                15408
            ],
            [
                15477,
                15483
            ],
            [
                15497,
                15499
            ],
            [
                15550,
                15588
            ],
            [
                15762,
                15857
            ],
            [
                15857,
                15930
            ],
            [
                15930,
                15961
            ],
            [
                15961,
                15962
            ],
            [
                15998,
                16017
            ],
            [
                16034,
                16070
            ],
            [
                16070,
                16082
            ],
            [
                16149,
                16181
            ],
            [
                16304,
                16340
            ],
            [
                16340,
                16364
            ],
            [
                16385,
                16452
            ],
            [
                16452,
                16474
            ],
            [
                16486,
                16515
            ],
            [
                16515,
                16554
            ],
            [
                16587,
                16594
            ],
            [
                16561,
                16564
            ],
            [
                16638,
                16671
            ],
            [
                16677,
                16694
            ],
            [
                16694,
                16707
            ],
            [
                16834,
                16890
            ],
            [
                16890,
                16897
            ],
            [
                16921,
                16986
            ],
            [
                16987,
                17007
            ],
            [
                17007,
                17035
            ],
            [
                17035,
                17096
            ],
            [
                17096,
                17166
            ],
            [
                17170,
                17318
            ],
            [
                17318,
                17342
            ],
            [
                17353,
                17363
            ],
            [
                17407,
                17411
            ],
            [
                17394,
                17405
            ],
            [
                17415,
                17503
            ],
            [
                17510,
                17513
            ],
            [
                17381,
                17382
            ],
            [
                17587,
                17590
            ],
            [
                17606,
                17624
            ],
            [
                17679,
                17740
            ],
            [
                17740,
                17784
            ],
            [
                17786,
                17815
            ],
            [
                17815,
                17854
            ],
            [
                17933,
                17984
            ],
            [
                18029,
                18082
            ],
            [
                18082,
                18126
            ],
            [
                18167,
                18177
            ],
            [
                18177,
                18241
            ],
            [
                18241,
                18295
            ],
            [
                18297,
                18322
            ],
            [
                18323,
                18326
            ],
            [
                18340,
                18364
            ],
            [
                18336,
                18339
            ],
            [
                18434,
                18448
            ],
            [
                18551,
                18575
            ],
            [
                18605,
                18668
            ],
            [
                18705,
                18777
            ],
            [
                18816,
                18903
            ],
            [
                18903,
                18961
            ],
            [
                19014,
                19062
            ],
            [
                19062,
                19068
            ],
            [
                19076,
                19120
            ],
            [
                19120,
                19177
            ],
            [
                19185,
                19209
            ],
            [
                19209,
                19220
            ],
            [
                19228,
                19236
            ],
            [
                19331,
                19374
            ],
            [
                19412,
                19414
            ],
            [
                19414,
                19479
            ],
            [
                19558,
                19581
            ],
            [
                19607,
                19609
            ],
            [
                19609,
                19633
            ],
            [
                19661,
                19685
            ],
            [
                19695,
                19725
            ],
            [
                19757,
                19763
            ],
            [
                19753,
                19756
            ],
            [
                19763,
                19765
            ],
            [
                19814,
                19853
            ],
            [
                19928,
                19981
            ],
            [
                19981,
                20006
            ],
            [
                20105,
                20131
            ],
            [
                20131,
                20152
            ],
            [
                20166,
                20230
            ],
            [
                20249,
                20272
            ],
            [
                20280,
                20308
            ],
            [
                20558,
                20648
            ],
            [
                20663,
                20672
            ],
            [
                20687,
                20722
            ],
            [
                20762,
                20764
            ],
            [
                20846,
                20900
            ],
            [
                20900,
                20932
            ],
            [
                20939,
                20951
            ],
            [
                20951,
                20953
            ],
            [
                21006,
                21018
            ],
            [
                21028,
                21055
            ],
            [
                21055,
                21092
            ],
            [
                21092,
                21114
            ],
            [
                21159,
                21221
            ],
            [
                21227,
                21248
            ],
            [
                21248,
                21257
            ],
            [
                21266,
                21271
            ],
            [
                21496,
                21501
            ],
            [
                21581,
                21599
            ],
            [
                21607,
                21652
            ],
            [
                21680,
                21704
            ],
            [
                21704,
                21739
            ],
            [
                21741,
                21778
            ],
            [
                21778,
                21805
            ],
            [
                21871,
                21873
            ],
            [
                21881,
                21933
            ],
            [
                21933,
                21952
            ],
            [
                21989,
                21991
            ],
            [
                21991,
                22018
            ],
            [
                22018,
                22022
            ],
            [
                22022,
                22034
            ],
            [
                22034,
                22043
            ],
            [
                22056,
                22059
            ],
            [
                22044,
                22055
            ],
            [
                22059,
                22061
            ],
            [
                22061,
                22080
            ],
            [
                22108,
                22149
            ],
            [
                22163,
                22192
            ],
            [
                22192,
                22262
            ],
            [
                22283,
                22286
            ],
            [
                22336,
                22404
            ],
            [
                22434,
                22436
            ],
            [
                22436,
                22529
            ],
            [
                22529,
                22643
            ],
            [
                22643,
                22683
            ],
            [
                22683,
                22725
            ],
            [
                22727,
                22730
            ],
            [
                22735,
                22759
            ],
            [
                22759,
                22760
            ],
            [
                22793,
                22818
            ],
            [
                22776,
                22791
            ],
            [
                22818,
                22821
            ],
            [
                22821,
                22847
            ],
            [
                22847,
                22871
            ],
            [
                22871,
                22918
            ],
            [
                22993,
                23050
            ],
            [
                23050,
                23146
            ],
            [
                23151,
                23168
            ],
            [
                23213,
                23215
            ],
            [
                23215,
                23301
            ],
            [
                23338,
                23350
            ],
            [
                23373,
                23375
            ],
            [
                23375,
                23391
            ],
            [
                23471,
                23489
            ],
            [
                23522,
                23658
            ],
            [
                23658,
                23681
            ],
            [
                23725,
                23745
            ],
            [
                23745,
                23789
            ],
            [
                23789,
                23848
            ],
            [
                23871,
                23885
            ],
            [
                24005,
                24007
            ],
            [
                24030,
                24119
            ],
            [
                24256,
                24259
            ],
            [
                24275,
                24304
            ],
            [
                24325,
                24326
            ],
            [
                24361,
                24433
            ],
            [
                24433,
                24450
            ],
            [
                24459,
                24461
            ],
            [
                24463,
                24506
            ],
            [
                24510,
                24539
            ],
            [
                24541,
                24584
            ],
            [
                24590,
                24607
            ],
            [
                24629,
                24631
            ],
            [
                24631,
                24763
            ],
            [
                24773,
                24870
            ],
            [
                24876,
                24927
            ],
            [
                24927,
                24936
            ],
            [
                24949,
                24951
            ],
            [
                24937,
                24948
            ],
            [
                25046,
                25047
            ],
            [
                25261,
                25297
            ],
            [
                25297,
                25300
            ],
            [
                25310,
                25464
            ],
            [
                25464,
                25511
            ],
            [
                25607,
                25609
            ],
            [
                25609,
                25695
            ],
            [
                25730,
                25783
            ],
            [
                25797,
                25802
            ],
            [
                25840,
                25904
            ],
            [
                25912,
                25916
            ],
            [
                25905,
                25910
            ],
            [
                25932,
                25976
            ],
            [
                26038,
                26075
            ],
            [
                26122,
                26154
            ],
            [
                26016,
                26019
            ],
            [
                26324,
                26342
            ],
            [
                26092,
                26095
            ],
            [
                26357,
                26359
            ],
            [
                26359,
                26420
            ],
            [
                26453,
                26515
            ],
            [
                26516,
                26520
            ],
            [
                26588,
                26590
            ],
            [
                26590,
                26686
            ],
            [
                26979,
                26981
            ],
            [
                26981,
                27021
            ],
            [
                27021,
                27053
            ],
            [
                27072,
                27074
            ],
            [
                27074,
                27075
            ],
            [
                27097,
                27118
            ],
            [
                27118,
                27183
            ],
            [
                27183,
                27206
            ],
            [
                27206,
                27234
            ],
            [
                27234,
                27268
            ],
            [
                27310,
                27350
            ],
            [
                27350,
                27371
            ],
            [
                27371,
                27401
            ],
            [
                27401,
                27409
            ],
            [
                27417,
                27449
            ],
            [
                27456,
                27474
            ],
            [
                27474,
                27499
            ],
            [
                27499,
                27503
            ],
            [
                27503,
                27523
            ],
            [
                27543,
                27565
            ],
            [
                27565,
                27655
            ],
            [
                27655,
                27670
            ],
            [
                27708,
                27712
            ],
            [
                27799,
                27801
            ],
            [
                27684,
                27692
            ],
            [
                27677,
                27679
            ],
            [
                27714,
                27765
            ],
            [
                27692,
                27693
            ],
            [
                27804,
                27861
            ],
            [
                27861,
                27877
            ],
            [
                27895,
                27898
            ],
            [
                27906,
                27921
            ],
            [
                27923,
                27953
            ],
            [
                27955,
                27961
            ],
            [
                28022,
                28045
            ],
            [
                28053,
                28065
            ],
            [
                28065,
                28067
            ],
            [
                28067,
                28306
            ],
            [
                28439,
                28441
            ],
            [
                28441,
                28518
            ],
            [
                28621,
                28682
            ],
            [
                28682,
                28692
            ],
            [
                28705,
                28733
            ],
            [
                28745,
                28763
            ],
            [
                28773,
                28794
            ],
            [
                28810,
                28877
            ],
            [
                28877,
                28975
            ],
            [
                28975,
                29015
            ],
            [
                29067,
                29103
            ],
            [
                29105,
                29128
            ],
            [
                29308,
                29479
            ],
            [
                29479,
                29490
            ],
            [
                29611,
                29692
            ],
            [
                29692,
                29777
            ],
            [
                29789,
                29842
            ],
            [
                29877,
                29907
            ],
            [
                29940,
                30004
            ],
            [
                30057,
                30103
            ],
            [
                30125,
                30126
            ],
            [
                30148,
                30269
            ],
            [
                30313,
                30315
            ],
            [
                30315,
                30348
            ],
            [
                30432,
                30452
            ],
            [
                30452,
                30465
            ],
            [
                30478,
                30500
            ],
            [
                30500,
                30542
            ],
            [
                30542,
                30565
            ],
            [
                30565,
                30594
            ],
            [
                30594,
                30646
            ],
            [
                30646,
                30680
            ],
            [
                30689,
                30743
            ],
            [
                30800,
                30907
            ],
            [
                30952,
                30978
            ],
            [
                30987,
                31032
            ],
            [
                31032,
                31062
            ],
            [
                31062,
                31179
            ],
            [
                31192,
                31213
            ],
            [
                31213,
                31230
            ]
        ],
        "row_chars": [
            [
                0,
                128
            ],
            [
                128,
                410
            ],
            [
                410,
                509
            ],
            [
                509,
                628
            ],
            [
                628,
                705
            ],
            [
                705,
                760
            ],
            [
                760,
                812
            ],
            [
                812,
                901
            ],
            [
                901,
                1107
            ],
            [
                1107,
                1268
            ],
            [
                1268,
                1511
            ],
            [
                1511,
                1641
            ],
            [
                1641,
                1697
            ],
            [
                1697,
                1770
            ],
            [
                1770,
                1943
            ],
            [
                1943,
                2190
            ],
            [
                2190,
                2362
            ],
            [
                2362,
                2608
            ],
            [
                2608,
                2688
            ],
            [
                2688,
                2752
            ],
            [
                2752,
                2916
            ],
            [
                2916,
                2992
            ],
            [
                2992,
                3212
            ],
            [
                3212,
                3356
            ],
            [
                3356,
                3398
            ],
            [
                3398,
                3553
            ],
            [
                3553,
                3565
            ],
            [
                3565,
                3576
            ],
            [
                3576,
                3589
            ],
            [
                3589,
                3603
            ],
            [
                3603,
                3615
            ],
            [
                3615,
                3800
            ],
            [
                3800,
                3960
            ],
            [
                3960,
                4304
            ],
            [
                4304,
                4346
            ],
            [
                4346,
                4902
            ],
            [
                4902,
                5052
            ],
            [
                5052,
                5104
            ],
            [
                5104,
                5119
            ],
            [
                5119,
                5215
            ],
            [
                5215,
                5349
            ],
            [
                5349,
                5428
            ],
            [
                5428,
                5610
            ],
            [
                5610,
                5670
            ],
            [
                5670,
                5754
            ],
            [
                5754,
                5877
            ],
            [
                5877,
                5914
            ],
            [
                5914,
                5955
            ],
            [
                5955,
                6194
            ],
            [
                6194,
                6244
            ],
            [
                6244,
                6353
            ],
            [
                6353,
                6378
            ],
            [
                6378,
                6403
            ],
            [
                6403,
                6439
            ],
            [
                6439,
                6466
            ],
            [
                6466,
                6552
            ],
            [
                6552,
                6750
            ],
            [
                6750,
                6787
            ],
            [
                6787,
                6840
            ],
            [
                6840,
                6855
            ],
            [
                6855,
                6873
            ],
            [
                6873,
                7019
            ],
            [
                7019,
                7032
            ],
            [
                7032,
                7082
            ],
            [
                7082,
                7104
            ],
            [
                7104,
                7116
            ],
            [
                7116,
                7219
            ],
            [
                7219,
                7296
            ],
            [
                7296,
                7318
            ],
            [
                7318,
                7526
            ],
            [
                7526,
                7663
            ],
            [
                7663,
                7709
            ],
            [
                7709,
                7801
            ],
            [
                7801,
                7872
            ],
            [
                7872,
                7895
            ],
            [
                7895,
                7947
            ],
            [
                7947,
                8097
            ],
            [
                8097,
                8289
            ],
            [
                8289,
                8308
            ],
            [
                8308,
                8469
            ],
            [
                8469,
                9165
            ],
            [
                9165,
                9272
            ],
            [
                9272,
                9482
            ],
            [
                9482,
                9847
            ],
            [
                9847,
                9951
            ],
            [
                9951,
                10096
            ],
            [
                10096,
                10190
            ],
            [
                10190,
                10401
            ],
            [
                10401,
                10528
            ],
            [
                10528,
                10687
            ],
            [
                10687,
                10738
            ],
            [
                10738,
                10884
            ],
            [
                10884,
                10957
            ],
            [
                10957,
                11038
            ],
            [
                11038,
                11138
            ],
            [
                11138,
                11363
            ],
            [
                11363,
                11743
            ],
            [
                11743,
                11894
            ],
            [
                11894,
                11970
            ],
            [
                11970,
                11988
            ],
            [
                11988,
                12007
            ],
            [
                12007,
                12054
            ],
            [
                12054,
                12063
            ],
            [
                12063,
                12108
            ],
            [
                12108,
                12144
            ],
            [
                12144,
                12156
            ],
            [
                12156,
                12177
            ],
            [
                12177,
                12306
            ],
            [
                12306,
                12452
            ],
            [
                12452,
                12528
            ],
            [
                12528,
                12604
            ],
            [
                12604,
                12648
            ],
            [
                12648,
                12762
            ],
            [
                12762,
                12927
            ],
            [
                12927,
                13075
            ],
            [
                13075,
                13120
            ],
            [
                13120,
                13140
            ],
            [
                13140,
                13244
            ],
            [
                13244,
                13263
            ],
            [
                13263,
                13328
            ],
            [
                13328,
                13377
            ],
            [
                13377,
                13526
            ],
            [
                13526,
                13639
            ],
            [
                13639,
                13795
            ],
            [
                13795,
                13929
            ],
            [
                13929,
                14077
            ],
            [
                14077,
                14128
            ],
            [
                14128,
                14152
            ],
            [
                14152,
                14182
            ],
            [
                14182,
                14445
            ],
            [
                14445,
                14598
            ],
            [
                14598,
                14701
            ],
            [
                14701,
                14805
            ],
            [
                14805,
                14878
            ],
            [
                14878,
                14938
            ],
            [
                14938,
                15059
            ],
            [
                15059,
                15071
            ],
            [
                15071,
                15154
            ],
            [
                15154,
                15166
            ],
            [
                15166,
                15212
            ],
            [
                15212,
                15276
            ],
            [
                15276,
                15308
            ],
            [
                15308,
                15354
            ],
            [
                15354,
                15588
            ],
            [
                15588,
                15708
            ],
            [
                15708,
                15857
            ],
            [
                15857,
                15930
            ],
            [
                15930,
                15961
            ],
            [
                15961,
                16070
            ],
            [
                16070,
                16184
            ],
            [
                16184,
                16248
            ],
            [
                16248,
                16268
            ],
            [
                16268,
                16272
            ],
            [
                16272,
                16340
            ],
            [
                16340,
                16452
            ],
            [
                16452,
                16515
            ],
            [
                16515,
                16694
            ],
            [
                16694,
                16890
            ],
            [
                16890,
                16987
            ],
            [
                16987,
                17007
            ],
            [
                17007,
                17035
            ],
            [
                17035,
                17096
            ],
            [
                17096,
                17167
            ],
            [
                17167,
                17318
            ],
            [
                17318,
                17740
            ],
            [
                17740,
                17815
            ],
            [
                17815,
                17856
            ],
            [
                17856,
                17933
            ],
            [
                17933,
                18082
            ],
            [
                18082,
                18177
            ],
            [
                18177,
                18241
            ],
            [
                18241,
                18705
            ],
            [
                18705,
                18903
            ],
            [
                18903,
                19062
            ],
            [
                19062,
                19120
            ],
            [
                19120,
                19209
            ],
            [
                19209,
                19248
            ],
            [
                19248,
                19331
            ],
            [
                19331,
                19414
            ],
            [
                19414,
                19609
            ],
            [
                19609,
                19765
            ],
            [
                19765,
                19814
            ],
            [
                19814,
                19981
            ],
            [
                19981,
                20131
            ],
            [
                20131,
                20309
            ],
            [
                20309,
                20465
            ],
            [
                20465,
                20558
            ],
            [
                20558,
                20764
            ],
            [
                20764,
                20900
            ],
            [
                20900,
                20951
            ],
            [
                20951,
                21055
            ],
            [
                21055,
                21092
            ],
            [
                21092,
                21248
            ],
            [
                21248,
                21704
            ],
            [
                21704,
                21778
            ],
            [
                21778,
                21933
            ],
            [
                21933,
                21991
            ],
            [
                21991,
                22018
            ],
            [
                22018,
                22022
            ],
            [
                22022,
                22034
            ],
            [
                22034,
                22061
            ],
            [
                22061,
                22192
            ],
            [
                22192,
                22436
            ],
            [
                22436,
                22529
            ],
            [
                22529,
                22643
            ],
            [
                22643,
                22683
            ],
            [
                22683,
                22759
            ],
            [
                22759,
                22821
            ],
            [
                22821,
                22847
            ],
            [
                22847,
                22871
            ],
            [
                22871,
                22918
            ],
            [
                22918,
                23050
            ],
            [
                23050,
                23215
            ],
            [
                23215,
                23375
            ],
            [
                23375,
                23392
            ],
            [
                23392,
                23471
            ],
            [
                23471,
                23658
            ],
            [
                23658,
                23745
            ],
            [
                23745,
                23789
            ],
            [
                23789,
                24007
            ],
            [
                24007,
                24120
            ],
            [
                24120,
                24256
            ],
            [
                24256,
                24433
            ],
            [
                24433,
                24631
            ],
            [
                24631,
                24927
            ],
            [
                24927,
                25297
            ],
            [
                25297,
                25464
            ],
            [
                25464,
                25609
            ],
            [
                25609,
                25976
            ],
            [
                25976,
                26359
            ],
            [
                26359,
                26590
            ],
            [
                26590,
                26981
            ],
            [
                26981,
                27021
            ],
            [
                27021,
                27074
            ],
            [
                27074,
                27118
            ],
            [
                27118,
                27183
            ],
            [
                27183,
                27206
            ],
            [
                27206,
                27234
            ],
            [
                27234,
                27270
            ],
            [
                27270,
                27310
            ],
            [
                27310,
                27350
            ],
            [
                27350,
                27371
            ],
            [
                27371,
                27401
            ],
            [
                27401,
                27474
            ],
            [
                27474,
                27499
            ],
            [
                27499,
                27503
            ],
            [
                27503,
                27565
            ],
            [
                27565,
                27655
            ],
            [
                27655,
                27861
            ],
            [
                27861,
                28067
            ],
            [
                28067,
                28441
            ],
            [
                28441,
                28518
            ],
            [
                28518,
                28621
            ],
            [
                28621,
                28682
            ],
            [
                28682,
                28877
            ],
            [
                28877,
                28975
            ],
            [
                28975,
                29015
            ],
            [
                29015,
                29128
            ],
            [
                29128,
                29308
            ],
            [
                29308,
                29479
            ],
            [
                29479,
                29692
            ],
            [
                29692,
                30315
            ],
            [
                30315,
                30452
            ],
            [
                30452,
                30500
            ],
            [
                30500,
                30542
            ],
            [
                30542,
                30565
            ],
            [
                30565,
                30594
            ],
            [
                30594,
                30646
            ],
            [
                30646,
                30743
            ],
            [
                30743,
                31032
            ],
            [
                31032,
                31062
            ],
            [
                31062,
                31213
            ],
            [
                31213,
                31232
            ]
        ]
    },
    "abridged": {
        "text": "Still impassive, as behoves its breeding, the Dedlock town house bears its usual appearance of dismal grandeur. It is given out that my Lady has gone down into Lincolnshire, but is expected to return presently.\nRumour, however, persists in flitting and chattering about town. It knows that poor Sir Leicester has been sadly used. It hears, my dear child, all sorts of shocking things. It makes the world of five miles round quite merry. By half-past five in the afternoon, it has even elicited a new remark from the Honourable Mr. Stables, which bids fair to outshine the old one. This sparkling sally is to the effect that although he always knew she was the best-groomed woman in the stud, he had no idea she was a bolter. It is immensely well received in turf-circles.\nShe is discussed by her dear friends with all the genteelest slang in vogue, with the last new word, the last new manner, the last new drawl, and the perfection of polite indifference. And even people who know nothing about her think it essential to pretend that she is their topic too, and to retail her at second-hand with the last new word and the last new drawl, and all the rest of it.\nSo goes the wintry day outside the Dedlock mansion. How within it?\nSir Leicester, lying in his bed, can speak a little, though with difficulty and indistinctness. He is told to rest, and they have given him some opiate to lull his pain, for his gout is very hard with him. He is never asleep, though sometimes he falls into a dull waking doze. He caused his bedstead to be moved nearer to the window when he heard it was inclement weather, so he can see the driving snow and sleet. He watches it as it falls, throughout the whole wintry day.\nUpon the least noise in the house, which is kept hushed, his hand is at the pencil. The old housekeeper, sitting by him, knows what he would write and whispers, \"No, he has not come back yet, Sir Leicester. It was late last night when he went. He has been only a little time gone yet.\"\nHe withdraws his hand and falls to looking at the sleet and snow again until they seem to fall so thick and fast that he is obliged to close his eyes for a minute on the giddy whirl of white flakes.\nThe day is not yet far spent when he conceives it to be necessary that her rooms should be prepared for her. It is very cold and wet. Let there be good fires. Let them know that she is expected. He writes this on his slate, and Mrs. Rouncewell with a heavy heart obeys.\n\"For I dread, George,\" the old lady says to her son, \"I dread that my Lady will never more set foot within these walls. Nor yet within the walls of Chesney Wold, my dear.\"\n\"But why, mother?\"\n\"When I saw my Lady yesterday, George, she looked to me as if the step on the Ghost's Walk had almost walked her down.\"\n\"Come, come! You alarm yourself with old-story fears, mother.\"\n\"No, I don't, my dear. It's going on for sixty year that I have been in this family, and I never had any fears for it before. But it's breaking up, my dear.\"\n\"I hope not, mother.\"\n\"I am thankful I have lived long enough to be with Sir Leicester now, for I know I am a welcomer sight to him than anybody else in my place would be. But the step on the Ghost's Walk will walk my Lady down, George; it has been many a day behind her, and now it will pass her and go on.\"\n\"Are these her rooms?\"\n\"These are my Lady's rooms, just as she left them.\"\n\"Why, now,\" says the trooper, glancing round him and speaking in a lower voice, \"I begin to understand how you come to think as you do, mother. Rooms get an awful look about them when they are fitted up for one person, who is away under a shadow, God knows where.\"\nHe is right. My Lady's room has a hollow and abandoned look; dark and cold as the wintry day is, it is darker and colder in these deserted chambers than in many a poor hut. Though the servants heap fires in the grates, there is a heavy cloud upon the rooms which no light will dispel.\nWhen the preparations are complete, Mrs. Rouncewell returns upstairs. Volumnia has taken her place by Sir Leicester's bed, though pearl necklaces and rouge pots are indifferent comforts to the invalid. Volumnia, not knowing what is the matter, has resorted to distracting smoothings of the bed-linen, elaborate tiptoe-ing around, and one exasperating whisper of, \"He is asleep.\" Which has caused Sir Leicester to have indignantly written on the slate, \"I am not.\"\nYielding, therefore, to the quaint old housekeeper, Volumnia sits at a table, sympathetically sighing. Sir Leicester watches the sleet and snow and listens for the returning steps that he expects. His valet has made him as presentable as the circumstances will allow. He is propped with pillows, his grey hair is brushed, his linen neatly arranged, and he is wrapped in a dressing-gown. His eye-glass and his watch are ready to his hand. It is necessary that he should be seen as little as may be. Women will talk, and Volumnia is no exception. He keeps her here to prevent her talking somewhere else. He is very ill, but he makes his stand against distress of mind and body most courageously.\nThe fair Volumnia, being one of those sprightly girls who cannot long continue silent without seizure by the dragon Boredom, soon indicates the approach of that monster with a series of yawns. Finding it impossible to suppress the yawns except by conversation, she compliments Mrs. Rouncewell on her son, declaring that he positively is one of the finest figures she ever saw and as soldierly a looking person, she should think, as what's his name, who was killed at Waterloo.\nSir Leicester hears this tribute with so much surprise that Mrs. Rouncewell needs to explain.\n\"Miss Dedlock don't speak of my eldest son, Sir Leicester, but my youngest. I have found him. He has come home.\"\n\"George? Your son George is come home, Mrs. Rouncewell?\"\nThe old housekeeper wipes her eyes. \"Thank God. Yes, Sir Leicester.\"\nDoes this discovery of some one lost come upon him as a strong confirmation of his hopes? He is determined to speak now, and he does. In a thick crowd of sounds, but still intelligibly enough to be understood.\n\"Why did you not tell me, Mrs. Rouncewell?\"\n\"It happened only yesterday, Sir Leicester, and I doubted your being well enough to be talked to of such things.\"\nBesides, the giddy Volumnia now remembers with a little scream that George's presence was meant to be a secret. But Mrs. Rouncewell protests warmly that of course she would have told Sir Leicester as soon as he was better.\n\"Where is George, Mrs. Rouncewell?\" asks Sir Leicester,\nMrs. Rouncewell admits that he is in the house.\n\"Bring him here directly.\"\nThe old lady goes; and Sir Leicester, with such power of movement as he has, arranges himself a little to receive him. When he has done so, he looks out again at the falling sleet and snow and listens again for the returning steps. Straw has been laid in the street to deaden the noises there, and she might be driven to the door without his hearing wheels.\nHe is lying thus when the housekeeper returns, accompanied by her trooper son. Mr. George approaches softly to the bedside, makes his bow, squares his chest, and stands, with his face flushed, very heartily ashamed of himself.\n\"Good heaven, it is really George Rouncewell!\" exclaims Sir Leicester. \"Do you remember me, George?\"\nThe trooper needs to work out what he has said, but being a little helped by his mother, he replies, \"I must have a very bad memory, indeed, Sir Leicester, if I failed to remember you.\"\n\"When I look at you, George Rouncewell,\" Sir Leicester observes with difficulty, \"I see something of a boy at Chesney Wold - I remember well.\"\nTears come into his eyes, and then he looks at the sleet and snow again.\n\"I ask your pardon, Sir Leicester,\" says the trooper, \"but would you let me raise you up? You would lie easier, Sir Leicester, if you would allow me to move you.\"\n\"If you will be so good.\"\nThe trooper takes him in his arms like a child, lightly raises him, and turns him more towards the window.\n\"Thank you. You have your mother's gentleness,\" returns Sir Leicester, \"and your own strength.\"\nHe signs to him not to go away. George quietly remains at the bedside, waiting to be spoken to.\n\"Why did you wish for secrecy?\" It takes Sir Leicester some time to ask this.\n\"Truly I am not much to boast of, Sir Leicester, and I - I hope to be allowed to remain unknown in general. I should think it would be universally agreed, Sir Leicester, that I am not much to boast of.\"\n\"You have been a soldier,\" observes Sir Leicester, \"and a faithful one.\"\nGeorge makes his military bow. \"I have done my duty, and it was the least I could do.\"\n\"You find me far from well, George Rouncewell. I have had a sudden and bad attack. Something that deadens,\" trying to pass one hand down one side, \"and confuses,\" touching his lips.\nGeorge, with a look of sympathy, makes another bow. The different times when they were both younger men at Chesney Wold arise before them and soften both.\nSir Leicester tries to raise himself among his pillows a little more. George, observing this, takes him in his arms again and places him as he desires to be.\n\"Thank you, George. You are another self to me. You have often carried my spare gun at Chesney Wold, George. You are familiar to me in these strange circumstances, very familiar.\"\nGeorge has put Sir Leicester's sounder arm over his shoulder in lifting him up, and Sir Leicester is slow in drawing it away again as he says these words.\n\"I was about to add,\" he goes on, \"that this attack was unfortunately simultaneous with a slight misunderstanding between my Lady and myself - not a disagreement, but a misunderstanding which deprives me, for a little while, of my Lady's society. She has found it necessary to make a journey - I trust will shortly return. Volumnia, do I make myself intelligible?\"\nVolumnia understands him perfectly, and in truth he speaks more clearly than could have been supposed possible a minute ago. The effort by which he does so is written in his face. Nothing but the strength of his purpose enables him to make it.\n\"Therefore, Volumnia, I desire to say in your presence - and in the presence of my faithful old friend, Mrs. Rouncewell, and her son George - in case I should relapse, in case I should lose both my speech and the power of writing-\"\nThe old housekeeper weeping silently; Volumnia in the greatest agitation; the trooper with his arms folded and his head a little bent, respectfully attentive.\n\"Therefore I desire to say, and to call you all to witness that I am on unaltered terms with Lady Dedlock. That I have no cause whatever of complaint against her. That I have ever had the strongest affection for her, and retain it undiminished. Say this to her, and to everyone.\"\nVolumnia tremblingly protests that she will obey.\n\"My Lady is too high in position, too handsome, too accomplished, not to have her enemies. Let it be known to them, that being of sound mind and understanding, I revoke no favour from her. I am on unaltered terms with her, and I retract no act I have done for her advantage and happiness.\"\nHis formal array of words is serious and affecting. His noble earnestness, his gallant shielding of her, his generous conquest of his own pride for her sake, are honourable, manly, and true.\nOverpowered by his exertions, he lays his head back on his pillows and closes his eyes for a minute, then resumes his watching of the weather. The trooper has become installed as necessary to him. Nothing has been said, but it is understood. He mounts guard behind his mother's chair.\nThe day is now beginning to decline. The mist and the sleet are darker, and the blaze begins to tell more vividly upon the walls and furniture. The gloom grows; the world begins to go home, to dress, to dine, to discuss its dear friend, as already mentioned.\nNow does Sir Leicester become worse; restless, uneasy, and in great pain. Volumnia, lighting a candle, is told to put it out again, for it is not yet dark enough. Yet it is very dark by now. By and by she tries again. No! Put it out. It is not yet dark enough.\nHis old housekeeper realises that he is striving to uphold the fiction that it is not growing late.\n\"Dear Sir Leicester, my honoured master,\" she softly whispers, \"I must beg and pray that you will not lie here in the lone darkness watching and waiting. Let me draw the curtains, and light the candles, and make things more comfortable about you. The church-clocks will strike the hours just the same, Sir Leicester, and the night will pass away just the same. My Lady will come back, just the same.\"\n\"I know it, Mrs. Rouncewell, but I am weak - and he has been so long gone.\"\n\"Not twenty-four hours yet, Sir Leicester.\"\n\"But that is a long time. Oh, it is a long time!\"\nHe says it with a groan that wrings her heart.\nShe thinks his tears too sacred to be seen, even by her. Therefore she sits in the darkness for a while without a word, then gently begins to move about, stirring the fire. Finally he tells her, with recovered self-command, \"As you say, Mrs. Rouncewell, it is getting late. Light the room!\"\nBut they find that he brightens when a quiet pretence is made of looking at the fires in her rooms and being sure that everything is ready to receive her. Poor pretence as it is, it keeps up hope within him.\nMidnight comes, and with it the same blank. The carriages in the streets are few, and other late sounds there are none. It is so still that listening to the intense silence is like looking at intense darkness.\nThe servants are dismissed to bed, and only Mrs. Rouncewell and George keep watch in Sir Leicester's room. As the night lags on - or rather when it seems to stop altogether, between two and three o'clock - they find a restless craving on him to know about the weather. Hence George, patrolling regularly every half-hour to the rooms so carefully looked after, extends his march to the hall-door, looks around, and brings back the best report he can make of the worst of nights, the sleet still falling and the stone footways lying ankle-deep in icy sludge.\nVolumnia, up in her room, is a prey to horrors of many kinds. Not least among them, possibly, is a horror of what may befall her little income in the event, as she expresses it, \"of anything happening\" to Sir Leicester. Anything, in this sense, meaning one thing only.\nAn effect of these horrors is that Volumnia finds she cannot go to bed in her own room, but must come forth with her fair head tied up in a shawl, and parade the mansion like a ghost, particularly haunting the warm rooms prepared for one who still does not return. Volumnia is attended by her maid, who is extremely cold, very sleepy, and does not have a sweet expression on her face.\nThe periodical visits of the trooper to these rooms, however, is an assurance of protection and company both to mistress and to maid. Whenever he is heard advancing, they both make some little decorative preparation to receive him.\n\"How is Sir Leicester now, Mr. George?\" inquires Volumnia, adjusting her shawl.\n\"Much the same, miss. He is very low and ill, and he even wanders a little sometimes.\"\n\"Has he asked for me?\" inquires Volumnia tenderly.\n\"Why, no, I can't say he has, miss.\"\n\"This is a truly sad time, Mr. George.\"\n\"It is indeed, miss. Hadn't you better go to bed?\"\n\"You had better go to bed, Miss Dedlock,\" says the maid sharply.\nBut Volumnia answers No! No! She may be asked for at a moment's notice. She never should forgive herself \"if anything was to happen\" and she was not on the spot. She declines to answer her maid's question on how the spot comes to be there, and not in her room, but staunchly declares that on the spot she will remain. Volumnia further states that she has not \"closed an eye\" - as if she had twenty or thirty - though she indisputably opened two just five minutes ago.\nBut when it comes to four o'clock, and still the same blank, Volumnia's constancy begins to fail her, or rather it begins to strengthen, for she now considers that it is her duty to be ready for the morrow, when much may be expected of her. So when the trooper reappears with his, \"Hadn't you better go to bed, miss?\" she meekly rises and says, \"Do with me what you think best!\"\nMr. George thinks it best to escort her to the door of her chamber, and the maid thinks it best to hustle her into bed with mighty little ceremony. Accordingly, these steps are taken; and now the trooper, in his rounds, has the house to himself.\nThere is no improvement in the weather. From every ledge and post and pillar drips the thawed snow. It is falling still; upon the roof, upon the skylight, even through the skylight, and drip, drip, drip, with the regularity of the Ghost's Walk, on the stone floor below.\nThe trooper goes up the stairs and through the chief rooms, holding up his light at arm's length. Thinking of his varied fortunes within the last few weeks, and of his rustic boyhood, two periods of his life so strangely brought together now; thinking of the murdered man; thinking of the lady who has disappeared from these very rooms; thinking of the master of the house upstairs, he looks here and looks there, and reflects how he might see something now, which it would tax his boldness to walk up to. But it is all blank, blank as the oppressive silence.\n\"All is still ready, George Rouncewell?\"\n\"Quite orderly and right, Sir Leicester.\"\n\"No word of any kind?\"\nThe trooper shakes his head.\n\"No letter that can possibly have been overlooked?\"\nBut he knows there is no such hope and lays his head down without looking for an answer.\nGeorge Rouncewell lifts him into easier positions through the long remainder of the blank wintry night, and extinguishes the light and opens the curtains at the first late break of day. The day comes like a phantom. Cold, colourless, and vague, it sends a warning streak before it of a deathlike hue, as if it cried out, \"Look what I bring you who watch there! Who will tell him?\"",
        "paragraph_chars": [
            [
                0,
                211
            ],
            [
                211,
                772
            ],
            [
                772,
                1163
            ],
            [
                1163,
                1230
            ],
            [
                1230,
                1705
            ],
            [
                1705,
                1991
            ],
            [
                1991,
                2190
            ],
            [
                2190,
                2460
            ],
            [
                2460,
                2632
            ],
            [
                2632,
                2651
            ],
            [
                2651,
                2771
            ],
            [
                2771,
                2834
            ],
            [
                2834,
                2992
            ],
            [
                2992,
                3014
            ],
            [
                3014,
                3301
            ],
            [
                3301,
                3324
            ],
            [
                3324,
                3376
            ],
            [
                3376,
                3641
            ],
            [
                3641,
                3926
            ],
            [
                3926,
                4390
            ],
            [
                4390,
                5084
            ],
            [
                5084,
                5561
            ],
            [
                5561,
                5655
            ],
            [
                5655,
                5768
            ],
            [
                5768,
                5825
            ],
            [
                5825,
                5894
            ],
            [
                5894,
                6104
            ],
            [
                6104,
                6148
            ],
            [
                6148,
                6262
            ],
            [
                6262,
                6485
            ],
            [
                6485,
                6541
            ],
            [
                6541,
                6589
            ],
            [
                6589,
                6616
            ],
            [
                6616,
                6974
            ],
            [
                6974,
                7201
            ],
            [
                7201,
                7302
            ],
            [
                7302,
                7488
            ],
            [
                7488,
                7631
            ],
            [
                7631,
                7704
            ],
            [
                7704,
                7867
            ],
            [
                7867,
                7893
            ],
            [
                7893,
                8000
            ],
            [
                8000,
                8096
            ],
            [
                8096,
                8192
            ],
            [
                8192,
                8270
            ],
            [
                8270,
                8473
            ],
            [
                8473,
                8546
            ],
            [
                8546,
                8633
            ],
            [
                8633,
                8815
            ],
            [
                8815,
                8970
            ],
            [
                8970,
                9128
            ],
            [
                9128,
                9308
            ],
            [
                9308,
                9463
            ],
            [
                9463,
                9828
            ],
            [
                9828,
                10072
            ],
            [
                10072,
                10304
            ],
            [
                10304,
                10463
            ],
            [
                10463,
                10743
            ],
            [
                10743,
                10793
            ],
            [
                10793,
                11083
            ],
            [
                11083,
                11274
            ],
            [
                11274,
                11559
            ],
            [
                11559,
                11818
            ],
            [
                11818,
                12079
            ],
            [
                12079,
                12179
            ],
            [
                12179,
                12580
            ],
            [
                12580,
                12656
            ],
            [
                12656,
                12700
            ],
            [
                12700,
                12750
            ],
            [
                12750,
                12797
            ],
            [
                12797,
                13088
            ],
            [
                13088,
                13296
            ],
            [
                13296,
                13506
            ],
            [
                13506,
                14063
            ],
            [
                14063,
                14332
            ],
            [
                14332,
                14717
            ],
            [
                14717,
                14949
            ],
            [
                14949,
                15029
            ],
            [
                15029,
                15116
            ],
            [
                15116,
                15167
            ],
            [
                15167,
                15204
            ],
            [
                15204,
                15244
            ],
            [
                15244,
                15295
            ],
            [
                15295,
                15360
            ],
            [
                15360,
                15828
            ],
            [
                15828,
                16207
            ],
            [
                16207,
                16453
            ],
            [
                16453,
                16724
            ],
            [
                16724,
                17284
            ],
            [
                17284,
                17325
            ],
            [
                17325,
                17367
            ],
            [
                17367,
                17390
            ],
            [
                17390,
                17419
            ],
            [
                17419,
                17471
            ],
            [
                17471,
                17560
            ],
            [
                17560,
                17940
            ]
        ],
        "segment_chars": [
            [
                0,
                112
            ],
            [
                112,
                211
            ],
            [
                211,
                276
            ],
            [
                276,
                330
            ],
            [
                330,
                385
            ],
            [
                385,
                437
            ],
            [
                437,
                581
            ],
            [
                581,
                725
            ],
            [
                725,
                772
            ],
            [
                772,
                957
            ],
            [
                957,
                1163
            ],
            [
                1163,
                1215
            ],
            [
                1215,
                1230
            ],
            [
                1230,
                1326
            ],
            [
                1326,
                1436
            ],
            [
                1436,
                1507
            ],
            [
                1507,
                1645
            ],
            [
                1645,
                1705
            ],
            [
                1705,
                1789
            ],
            [
                1789,
                1912
            ],
            [
                1912,
                1949
            ],
            [
                1949,
                1991
            ],
            [
                1991,
                2190
            ],
            [
                2190,
                2299
            ],
            [
                2299,
                2324
            ],
            [
                2324,
                2349
            ],
            [
                2349,
                2385
            ],
            [
                2385,
                2460
            ],
            [
                2460,
                2580
            ],
            [
                2580,
                2632
            ],
            [
                2632,
                2651
            ],
            [
                2651,
                2771
            ],
            [
                2771,
                2784
            ],
            [
                2784,
                2834
            ],
            [
                2834,
                2857
            ],
            [
                2857,
                2960
            ],
            [
                2960,
                2992
            ],
            [
                2992,
                3014
            ],
            [
                3014,
                3164
            ],
            [
                3164,
                3301
            ],
            [
                3301,
                3324
            ],
            [
                3324,
                3376
            ],
            [
                3376,
                3520
            ],
            [
                3520,
                3641
            ],
            [
                3641,
                3654
            ],
            [
                3654,
                3814
            ],
            [
                3814,
                3926
            ],
            [
                3926,
                3996
            ],
            [
                3996,
                4128
            ],
            [
                4128,
                4305
            ],
            [
                4305,
                4390
            ],
            [
                4390,
                4493
            ],
            [
                4493,
                4587
            ],
            [
                4587,
                4658
            ],
            [
                4658,
                4777
            ],
            [
                4777,
                4828
            ],
            [
                4828,
                4888
            ],
            [
                4888,
                4935
            ],
            [
                4935,
                4992
            ],
            [
                4992,
                5084
            ],
            [
                5084,
                5277
            ],
            [
                5277,
                5561
            ],
            [
                5561,
                5655
            ],
            [
                5655,
                5731
            ],
            [
                5731,
                5749
            ],
            [
                5749,
                5768
            ],
            [
                5768,
                5777
            ],
            [
                5777,
                5825
            ],
            [
                5825,
                5861
            ],
            [
                5861,
                5873
            ],
            [
                5873,
                5894
            ],
            [
                5894,
                5984
            ],
            [
                5984,
                6028
            ],
            [
                6028,
                6104
            ],
            [
                6104,
                6148
            ],
            [
                6148,
                6262
            ],
            [
                6262,
                6374
            ],
            [
                6374,
                6485
            ],
            [
                6485,
                6521
            ],
            [
                6521,
                6541
            ],
            [
                6541,
                6589
            ],
            [
                6589,
                6616
            ],
            [
                6616,
                6735
            ],
            [
                6735,
                6848
            ],
            [
                6848,
                6974
            ],
            [
                6974,
                7053
            ],
            [
                7053,
                7201
            ],
            [
                7201,
                7248
            ],
            [
                7248,
                7272
            ],
            [
                7272,
                7302
            ],
            [
                7302,
                7488
            ],
            [
                7488,
                7631
            ],
            [
                7631,
                7704
            ],
            [
                7704,
                7794
            ],
            [
                7794,
                7867
            ],
            [
                7867,
                7893
            ],
            [
                7893,
                8000
            ],
            [
                8000,
                8012
            ],
            [
                8012,
                8096
            ],
            [
                8096,
                8128
            ],
            [
                8128,
                8192
            ],
            [
                8192,
                8224
            ],
            [
                8224,
                8270
            ],
            [
                8270,
                8378
            ],
            [
                8378,
                8473
            ],
            [
                8473,
                8546
            ],
            [
                8546,
                8577
            ],
            [
                8577,
                8633
            ],
            [
                8633,
                8680
            ],
            [
                8680,
                8716
            ],
            [
                8716,
                8815
            ],
            [
                8815,
                8867
            ],
            [
                8867,
                8970
            ],
            [
                8970,
                9040
            ],
            [
                9040,
                9128
            ],
            [
                9128,
                9148
            ],
            [
                9148,
                9176
            ],
            [
                9176,
                9237
            ],
            [
                9237,
                9308
            ],
            [
                9308,
                9463
            ],
            [
                9463,
                9710
            ],
            [
                9710,
                9786
            ],
            [
                9786,
                9828
            ],
            [
                9828,
                9953
            ],
            [
                9953,
                10008
            ],
            [
                10008,
                10072
            ],
            [
                10072,
                10304
            ],
            [
                10304,
                10463
            ],
            [
                10463,
                10570
            ],
            [
                10570,
                10626
            ],
            [
                10626,
                10708
            ],
            [
                10708,
                10743
            ],
            [
                10743,
                10793
            ],
            [
                10793,
                10884
            ],
            [
                10884,
                10982
            ],
            [
                10982,
                11083
            ],
            [
                11083,
                11135
            ],
            [
                11135,
                11274
            ],
            [
                11274,
                11417
            ],
            [
                11417,
                11471
            ],
            [
                11471,
                11516
            ],
            [
                11516,
                11559
            ],
            [
                11559,
                11596
            ],
            [
                11596,
                11703
            ],
            [
                11703,
                11818
            ],
            [
                11818,
                11892
            ],
            [
                11892,
                11981
            ],
            [
                11981,
                12009
            ],
            [
                12009,
                12036
            ],
            [
                12036,
                12040
            ],
            [
                12040,
                12052
            ],
            [
                12052,
                12079
            ],
            [
                12079,
                12179
            ],
            [
                12179,
                12333
            ],
            [
                12333,
                12426
            ],
            [
                12426,
                12540
            ],
            [
                12540,
                12580
            ],
            [
                12580,
                12656
            ],
            [
                12656,
                12700
            ],
            [
                12700,
                12726
            ],
            [
                12726,
                12750
            ],
            [
                12750,
                12797
            ],
            [
                12797,
                12854
            ],
            [
                12854,
                12970
            ],
            [
                12970,
                13071
            ],
            [
                13071,
                13088
            ],
            [
                13088,
                13243
            ],
            [
                13243,
                13296
            ],
            [
                13296,
                13340
            ],
            [
                13340,
                13416
            ],
            [
                13416,
                13506
            ],
            [
                13506,
                13613
            ],
            [
                13613,
                13775
            ],
            [
                13775,
                14063
            ],
            [
                14063,
                14125
            ],
            [
                14125,
                14283
            ],
            [
                14283,
                14332
            ],
            [
                14332,
                14597
            ],
            [
                14597,
                14717
            ],
            [
                14717,
                14851
            ],
            [
                14851,
                14949
            ],
            [
                14949,
                14989
            ],
            [
                14989,
                15029
            ],
            [
                15029,
                15051
            ],
            [
                15051,
                15116
            ],
            [
                15116,
                15139
            ],
            [
                15139,
                15167
            ],
            [
                15167,
                15204
            ],
            [
                15204,
                15244
            ],
            [
                15244,
                15265
            ],
            [
                15265,
                15295
            ],
            [
                15295,
                15360
            ],
            [
                15360,
                15385
            ],
            [
                15385,
                15389
            ],
            [
                15389,
                15432
            ],
            [
                15432,
                15522
            ],
            [
                15522,
                15678
            ],
            [
                15678,
                15828
            ],
            [
                15828,
                16069
            ],
            [
                16069,
                16146
            ],
            [
                16146,
                16207
            ],
            [
                16207,
                16355
            ],
            [
                16355,
                16453
            ],
            [
                16453,
                16493
            ],
            [
                16493,
                16553
            ],
            [
                16553,
                16724
            ],
            [
                16724,
                16822
            ],
            [
                16822,
                17230
            ],
            [
                17230,
                17284
            ],
            [
                17284,
                17325
            ],
            [
                17325,
                17367
            ],
            [
                17367,
                17390
            ],
            [
                17390,
                17419
            ],
            [
                17419,
                17471
            ],
            [
                17471,
                17560
            ],
            [
                17560,
                17746
            ],
            [
                17746,
                17776
            ],
            [
                17776,
                17921
            ],
            [
                17921,
                17940
            ]
        ],
        "overlap_chars": [
            [
                0,
                64
            ],
            [
                75,
                80
            ],
            [
                92,
                112
            ],
            [
                112,
                211
            ],
            [
                211,
                218
            ],
            [
                219,
                227
            ],
            [
                228,
                276
            ],
            [
                276,
                289
            ],
            [
                290,
                294
            ],
            [
                295,
                308
            ],
            [
                309,
                330
            ],
            [
                330,
                385
            ],
            [
                385,
                437
            ],
            [
                437,
                454
            ],
            [
                471,
                579
            ],
            [
                579,
                581
            ],
            [
                581,
                725
            ],
            [
                725,
                740
            ],
            [
                746,
                772
            ],
            [
                772,
                957
            ],
            [
                957,
                960
            ],
            [
                966,
                989
            ],
            [
                990,
                999
            ],
            [
                1000,
                1018
            ],
            [
                1019,
                1131
            ],
            [
                1132,
                1137
            ],
            [
                1137,
                1161
            ],
            [
                1161,
                1162
            ],
            [
                1163,
                1215
            ],
            [
                1215,
                1230
            ],
            [
                1230,
                1326
            ],
            [
                1326,
                1331
            ],
            [
                1337,
                1407
            ],
            [
                1413,
                1436
            ],
            [
                1436,
                1475
            ],
            [
                1482,
                1507
            ],
            [
                1507,
                1541
            ],
            [
                1542,
                1583
            ],
            [
                1584,
                1602
            ],
            [
                1603,
                1605
            ],
            [
                1606,
                1608
            ],
            [
                1613,
                1645
            ],
            [
                1645,
                1705
            ],
            [
                1705,
                1789
            ],
            [
                1789,
                1912
            ],
            [
                1912,
                1949
            ],
            [
                1949,
                1960
            ],
            [
                1966,
                1991
            ],
            [
                1991,
                2077
            ],
            [
                2078,
                2188
            ],
            [
                2188,
                2190
            ],
            [
                2190,
                2299
            ],
            [
                2299,
                2324
            ],
            [
                2324,
                2349
            ],
            [
                2349,
                2385
            ],
            [
                2385,
                2394
            ],
            [
                2395,
                2399
            ],
            [
                2400,
                2460
            ],
            [
                2460,
                2512
            ],
            [
                2513,
                2521
            ],
            [
                2522,
                2578
            ],
            [
                2580,
                2632
            ],
            [
                2633,
                2651
            ],
            [
                2651,
                2706
            ],
            [
                2707,
                2771
            ],
            [
                2771,
                2784
            ],
            [
                2784,
                2834
            ],
            [
                2834,
                2837
            ],
            [
                2839,
                2857
            ],
            [
                2857,
                2960
            ],
            [
                2960,
                2989
            ],
            [
                2989,
                2992
            ],
            [
                2992,
                3014
            ],
            [
                3014,
                3078
            ],
            [
                3082,
                3099
            ],
            [
                3100,
                3164
            ],
            [
                3164,
                3301
            ],
            [
                3301,
                3324
            ],
            [
                3324,
                3376
            ],
            [
                3376,
                3510
            ],
            [
                3510,
                3520
            ],
            [
                3520,
                3578
            ],
            [
                3579,
                3593
            ],
            [
                3593,
                3594
            ],
            [
                3599,
                3612
            ],
            [
                3615,
                3622
            ],
            [
                3623,
                3641
            ],
            [
                3641,
                3646
            ],
            [
                3652,
                3654
            ],
            [
                3654,
                3663
            ],
            [
                3669,
                3681
            ],
            [
                3682,
                3695
            ],
            [
                3696,
                3700
            ],
            [
                3700,
                3701
            ],
            [
                3702,
                3803
            ],
            [
                3809,
                3812
            ],
            [
                3812,
                3813
            ],
            [
                3814,
                3858
            ],
            [
                3858,
                3926
            ],
            [
                3931,
                3961
            ],
            [
                3978,
                3996
            ],
            [
                3996,
                4014
            ],
            [
                4019,
                4024
            ],
            [
                4041,
                4043
            ],
            [
                4047,
                4086
            ],
            [
                4087,
                4090
            ],
            [
                4091,
                4126
            ],
            [
                4126,
                4128
            ],
            [
                4128,
                4141
            ],
            [
                4142,
                4149
            ],
            [
                4150,
                4173
            ],
            [
                4183,
                4185
            ],
            [
                4186,
                4236
            ],
            [
                4237,
                4243
            ],
            [
                4254,
                4284
            ],
            [
                4285,
                4305
            ],
            [
                4305,
                4310
            ],
            [
                4311,
                4314
            ],
            [
                4322,
                4335
            ],
            [
                4344,
                4390
            ],
            [
                4390,
                4410
            ],
            [
                4411,
                4466
            ],
            [
                4466,
                4493
            ],
            [
                4493,
                4587
            ],
            [
                4587,
                4596
            ],
            [
                4597,
                4600
            ],
            [
                4601,
                4605
            ],
            [
                4610,
                4612
            ],
            [
                4613,
                4624
            ],
            [
                4625,
                4658
            ],
            [
                4658,
                4710
            ],
            [
                4710,
                4721
            ],
            [
                4729,
                4737
            ],
            [
                4737,
                4761
            ],
            [
                4762,
                4777
            ],
            [
                4777,
                4828
            ],
            [
                4828,
                4843
            ],
            [
                4844,
                4876
            ],
            [
                4877,
                4888
            ],
            [
                4888,
                4917
            ],
            [
                4918,
                4923
            ],
            [
                4933,
                4935
            ],
            [
                4935,
                4952
            ],
            [
                4953,
                4992
            ],
            [
                4992,
                5024
            ],
            [
                5025,
                5084
            ],
            [
                5084,
                5177
            ],
            [
                5178,
                5269
            ],
            [
                5270,
                5277
            ],
            [
                5277,
                5310
            ],
            [
                5311,
                5314
            ],
            [
                5315,
                5320
            ],
            [
                5328,
                5330
            ],
            [
                5331,
                5532
            ],
            [
                5533,
                5561
            ],
            [
                5561,
                5615
            ],
            [
                5616,
                5636
            ],
            [
                5643,
                5655
            ],
            [
                5655,
                5731
            ],
            [
                5731,
                5749
            ],
            [
                5749,
                5768
            ],
            [
                5768,
                5777
            ],
            [
                5777,
                5792
            ],
            [
                5796,
                5825
            ],
            [
                5825,
                5861
            ],
            [
                5861,
                5873
            ],
            [
                5873,
                5894
            ],
            [
                5894,
                5930
            ],
            [
                5931,
                5984
            ],
            [
                5984,
                6028
            ],
            [
                6028,
                6104
            ],
            [
                6104,
                6148
            ],
            [
                6148,
                6262
            ],
            [
                6262,
                6308
            ],
            [
                6311,
                6329
            ],
            [
                6336,
                6338
            ],
            [
                6348,
                6351
            ],
            [
                6358,
                6360
            ],
            [
                6372,
                6374
            ],
            [
                6374,
                6402
            ],
            [
                6410,
                6472
            ],
            [
                6477,
                6485
            ],
            [
                6485,
                6494
            ],
            [
                6495,
                6521
            ],
            [
                6521,
                6541
            ],
            [
                6541,
                6556
            ],
            [
                6564,
                6589
            ],
            [
                6589,
                6604
            ],
            [
                6605,
                6616
            ],
            [
                6616,
                6628
            ],
            [
                6639,
                6735
            ],
            [
                6735,
                6848
            ],
            [
                6854,
                6862
            ],
            [
                6868,
                6945
            ],
            [
                6946,
                6974
            ],
            [
                6974,
                6990
            ],
            [
                6991,
                7053
            ],
            [
                7053,
                7201
            ],
            [
                7201,
                7214
            ],
            [
                7215,
                7248
            ],
            [
                7248,
                7272
            ],
            [
                7272,
                7302
            ],
            [
                7302,
                7322
            ],
            [
                7332,
                7353
            ],
            [
                7354,
                7488
            ],
            [
                7488,
                7610
            ],
            [
                7613,
                7628
            ],
            [
                7628,
                7631
            ],
            [
                7637,
                7704
            ],
            [
                7704,
                7772
            ],
            [
                7780,
                7794
            ],
            [
                7794,
                7867
            ],
            [
                7867,
                7868
            ],
            [
                7868,
                7893
            ],
            [
                7893,
                7974
            ],
            [
                7975,
                7999
            ],
            [
                8000,
                8012
            ],
            [
                8012,
                8093
            ],
            [
                8096,
                8111
            ],
            [
                8112,
                8128
            ],
            [
                8128,
                8192
            ],
            [
                8192,
                8224
            ],
            [
                8224,
                8270
            ],
            [
                8270,
                8324
            ],
            [
                8327,
                8333
            ],
            [
                8337,
                8339
            ],
            [
                8340,
                8378
            ],
            [
                8378,
                8473
            ],
            [
                8473,
                8546
            ],
            [
                8546,
                8577
            ],
            [
                8577,
                8578
            ],
            [
                8578,
                8597
            ],
            [
                8597,
                8633
            ],
            [
                8633,
                8645
            ],
            [
                8646,
                8678
            ],
            [
                8680,
                8716
            ],
            [
                8716,
                8740
            ],
            [
                8748,
                8815
            ],
            [
                8815,
                8837
            ],
            [
                8838,
                8867
            ],
            [
                8867,
                8906
            ],
            [
                8907,
                8914
            ],
            [
                8915,
                8918
            ],
            [
                8919,
                8952
            ],
            [
                8953,
                8970
            ],
            [
                8970,
                8983
            ],
            [
                8984,
                9040
            ],
            [
                9040,
                9047
            ],
            [
                9062,
                9127
            ],
            [
                9128,
                9148
            ],
            [
                9148,
                9176
            ],
            [
                9176,
                9237
            ],
            [
                9237,
                9307
            ],
            [
                9315,
                9463
            ],
            [
                9463,
                9487
            ],
            [
                9488,
                9498
            ],
            [
                9498,
                9502
            ],
            [
                9503,
                9514
            ],
            [
                9515,
                9603
            ],
            [
                9606,
                9609
            ],
            [
                9624,
                9625
            ],
            [
                9626,
                9629
            ],
            [
                9630,
                9648
            ],
            [
                9649,
                9710
            ],
            [
                9710,
                9754
            ],
            [
                9757,
                9786
            ],
            [
                9786,
                9825
            ],
            [
                9828,
                9879
            ],
            [
                9900,
                9953
            ],
            [
                9953,
                9997
            ],
            [
                9998,
                10008
            ],
            [
                10008,
                10072
            ],
            [
                10072,
                10126
            ],
            [
                10129,
                10154
            ],
            [
                10164,
                10167
            ],
            [
                10168,
                10192
            ],
            [
                10193,
                10196
            ],
            [
                10197,
                10211
            ],
            [
                10214,
                10238
            ],
            [
                10238,
                10301
            ],
            [
                10304,
                10376
            ],
            [
                10376,
                10463
            ],
            [
                10463,
                10521
            ],
            [
                10522,
                10570
            ],
            [
                10570,
                10576
            ],
            [
                10582,
                10626
            ],
            [
                10626,
                10683
            ],
            [
                10684,
                10708
            ],
            [
                10708,
                10719
            ],
            [
                10723,
                10731
            ],
            [
                10743,
                10786
            ],
            [
                10791,
                10793
            ],
            [
                10793,
                10858
            ],
            [
                10859,
                10882
            ],
            [
                10882,
                10884
            ],
            [
                10884,
                10908
            ],
            [
                10909,
                10933
            ],
            [
                10934,
                10964
            ],
            [
                10965,
                10971
            ],
            [
                10977,
                10980
            ],
            [
                10980,
                10982
            ],
            [
                10982,
                11021
            ],
            [
                11030,
                11083
            ],
            [
                11083,
                11108
            ],
            [
                11109,
                11135
            ],
            [
                11135,
                11156
            ],
            [
                11156,
                11220
            ],
            [
                11221,
                11244
            ],
            [
                11245,
                11273
            ],
            [
                11274,
                11364
            ],
            [
                11365,
                11374
            ],
            [
                11380,
                11415
            ],
            [
                11415,
                11417
            ],
            [
                11417,
                11471
            ],
            [
                11471,
                11503
            ],
            [
                11504,
                11516
            ],
            [
                11516,
                11518
            ],
            [
                11519,
                11531
            ],
            [
                11532,
                11559
            ],
            [
                11559,
                11596
            ],
            [
                11596,
                11618
            ],
            [
                11619,
                11681
            ],
            [
                11682,
                11703
            ],
            [
                11703,
                11712
            ],
            [
                11718,
                11723
            ],
            [
                11724,
                11729
            ],
            [
                11730,
                11748
            ],
            [
                11749,
                11794
            ],
            [
                11794,
                11818
            ],
            [
                11818,
                11853
            ],
            [
                11855,
                11892
            ],
            [
                11892,
                11919
            ],
            [
                11921,
                11923
            ],
            [
                11929,
                11981
            ],
            [
                11981,
                12000
            ],
            [
                12007,
                12009
            ],
            [
                12009,
                12036
            ],
            [
                12036,
                12040
            ],
            [
                12040,
                12052
            ],
            [
                12052,
                12061
            ],
            [
                12062,
                12065
            ],
            [
                12066,
                12077
            ],
            [
                12077,
                12079
            ],
            [
                12079,
                12098
            ],
            [
                12108,
                12149
            ],
            [
                12150,
                12179
            ],
            [
                12179,
                12249
            ],
            [
                12254,
                12257
            ],
            [
                12263,
                12331
            ],
            [
                12331,
                12333
            ],
            [
                12333,
                12426
            ],
            [
                12426,
                12540
            ],
            [
                12540,
                12580
            ],
            [
                12580,
                12622
            ],
            [
                12625,
                12628
            ],
            [
                12632,
                12656
            ],
            [
                12656,
                12657
            ],
            [
                12657,
                12682
            ],
            [
                12682,
                12697
            ],
            [
                12697,
                12700
            ],
            [
                12700,
                12726
            ],
            [
                12726,
                12750
            ],
            [
                12750,
                12797
            ],
            [
                12797,
                12854
            ],
            [
                12854,
                12950
            ],
            [
                12951,
                12968
            ],
            [
                12968,
                12970
            ],
            [
                12970,
                13056
            ],
            [
                13057,
                13069
            ],
            [
                13069,
                13071
            ],
            [
                13071,
                13087
            ],
            [
                13088,
                13106
            ],
            [
                13107,
                13243
            ],
            [
                13243,
                13266
            ],
            [
                13276,
                13296
            ],
            [
                13296,
                13340
            ],
            [
                13340,
                13399
            ],
            [
                13400,
                13414
            ],
            [
                13414,
                13416
            ],
            [
                13416,
                13505
            ],
            [
                13506,
                13509
            ],
            [
                13510,
                13539
            ],
            [
                13539,
                13540
            ],
            [
                13541,
                13613
            ],
            [
                13613,
                13630
            ],
            [
                13631,
                13633
            ],
            [
                13636,
                13679
            ],
            [
                13680,
                13709
            ],
            [
                13712,
                13755
            ],
            [
                13756,
                13773
            ],
            [
                13773,
                13775
            ],
            [
                13775,
                13907
            ],
            [
                13914,
                14011
            ],
            [
                14012,
                14063
            ],
            [
                14063,
                14072
            ],
            [
                14073,
                14075
            ],
            [
                14076,
                14087
            ],
            [
                14087,
                14088
            ],
            [
                14089,
                14125
            ],
            [
                14125,
                14128
            ],
            [
                14129,
                14283
            ],
            [
                14283,
                14330
            ],
            [
                14330,
                14332
            ],
            [
                14332,
                14418
            ],
            [
                14418,
                14471
            ],
            [
                14472,
                14477
            ],
            [
                14477,
                14541
            ],
            [
                14542,
                14546
            ],
            [
                14547,
                14552
            ],
            [
                14553,
                14597
            ],
            [
                14597,
                14634
            ],
            [
                14638,
                14670
            ],
            [
                14676,
                14679
            ],
            [
                14685,
                14703
            ],
            [
                14707,
                14710
            ],
            [
                14715,
                14717
            ],
            [
                14717,
                14778
            ],
            [
                14779,
                14841
            ],
            [
                14845,
                14849
            ],
            [
                14849,
                14851
            ],
            [
                14851,
                14947
            ],
            [
                14947,
                14949
            ],
            [
                14949,
                14989
            ],
            [
                14989,
                15021
            ],
            [
                15027,
                15029
            ],
            [
                15029,
                15030
            ],
            [
                15030,
                15051
            ],
            [
                15051,
                15116
            ],
            [
                15116,
                15139
            ],
            [
                15139,
                15167
            ],
            [
                15167,
                15201
            ],
            [
                15204,
                15244
            ],
            [
                15244,
                15265
            ],
            [
                15265,
                15295
            ],
            [
                15295,
                15303
            ],
            [
                15304,
                15336
            ],
            [
                15342,
                15360
            ],
            [
                15360,
                15385
            ],
            [
                15385,
                15389
            ],
            [
                15389,
                15409
            ],
            [
                15410,
                15432
            ],
            [
                15432,
                15522
            ],
            [
                15522,
                15537
            ],
            [
                15549,
                15553
            ],
            [
                15553,
                15555
            ],
            [
                15556,
                15564
            ],
            [
                15565,
                15567
            ],
            [
                15568,
                15619
            ],
            [
                15619,
                15620
            ],
            [
                15621,
                15678
            ],
            [
                15678,
                15694
            ],
            [
                15715,
                15718
            ],
            [
                15719,
                15734
            ],
            [
                15737,
                15767
            ],
            [
                15770,
                15776
            ],
            [
                15781,
                15804
            ],
            [
                15810,
                15822
            ],
            [
                15826,
                15828
            ],
            [
                15828,
                16067
            ],
            [
                16067,
                16069
            ],
            [
                16069,
                16146
            ],
            [
                16146,
                16207
            ],
            [
                16207,
                16217
            ],
            [
                16218,
                16246
            ],
            [
                16247,
                16265
            ],
            [
                16266,
                16287
            ],
            [
                16288,
                16355
            ],
            [
                16355,
                16453
            ],
            [
                16453,
                16493
            ],
            [
                16493,
                16529
            ],
            [
                16530,
                16553
            ],
            [
                16553,
                16724
            ],
            [
                16724,
                16735
            ],
            [
                16741,
                16822
            ],
            [
                16822,
                16907
            ],
            [
                16908,
                16961
            ],
            [
                16965,
                16995
            ],
            [
                16995,
                17059
            ],
            [
                17059,
                17105
            ],
            [
                17105,
                17106
            ],
            [
                17107,
                17228
            ],
            [
                17228,
                17230
            ],
            [
                17230,
                17263
            ],
            [
                17264,
                17284
            ],
            [
                17284,
                17297
            ],
            [
                17303,
                17325
            ],
            [
                17325,
                17367
            ],
            [
                17367,
                17390
            ],
            [
                17390,
                17419
            ],
            [
                17419,
                17471
            ],
            [
                17471,
                17505
            ],
            [
                17506,
                17560
            ],
            [
                17560,
                17667
            ],
            [
                17668,
                17694
            ],
            [
                17701,
                17746
            ],
            [
                17746,
                17776
            ],
            [
                17776,
                17893
            ],
            [
                17900,
                17921
            ],
            [
                17921,
                17938
            ]
        ],
        "row_chars": [
            [
                0,
                112
            ],
            [
                112,
                112
            ],
            [
                112,
                211
            ],
            [
                211,
                276
            ],
            [
                276,
                330
            ],
            [
                330,
                385
            ],
            [
                385,
                437
            ],
            [
                437,
                437
            ],
            [
                437,
                437
            ],
            [
                437,
                437
            ],
            [
                437,
                437
            ],
            [
                437,
                437
            ],
            [
                437,
                437
            ],
            [
                437,
                437
            ],
            [
                437,
                437
            ],
            [
                437,
                437
            ],
            [
                437,
                437
            ],
            [
                437,
                437
            ],
            [
                437,
                437
            ],
            [
                437,
                437
            ],
            [
                437,
                437
            ],
            [
                437,
                437
            ],
            [
                437,
                581
            ],
            [
                581,
                725
            ],
            [
                725,
                772
            ],
            [
                772,
                772
            ],
            [
                772,
                772
            ],
            [
                772,
                772
            ],
            [
                772,
                772
            ],
            [
                772,
                772
            ],
            [
                772,
                772
            ],
            [
                772,
                957
            ],
            [
                957,
                957
            ],
            [
                957,
                957
            ],
            [
                957,
                957
            ],
            [
                957,
                1163
            ],
            [
                1163,
                1163
            ],
            [
                1163,
                1215
            ],
            [
                1215,
                1230
            ],
            [
                1230,
                1326
            ],
            [
                1326,
                1436
            ],
            [
                1436,
                1507
            ],
            [
                1507,
                1645
            ],
            [
                1645,
                1705
            ],
            [
                1705,
                1789
            ],
            [
                1789,
                1912
            ],
            [
                1912,
                1949
            ],
            [
                1949,
                1991
            ],
            [
                1991,
                2190
            ],
            [
                2190,
                2190
            ],
            [
                2190,
                2299
            ],
            [
                2299,
                2324
            ],
            [
                2324,
                2349
            ],
            [
                2349,
                2385
            ],
            [
                2385,
                2385
            ],
            [
                2385,
                2460
            ],
            [
                2460,
                2580
            ],
            [
                2580,
                2580
            ],
            [
                2580,
                2632
            ],
            [
                2632,
                2632
            ],
            [
                2632,
                2651
            ],
            [
                2651,
                2771
            ],
            [
                2771,
                2784
            ],
            [
                2784,
                2834
            ],
            [
                2834,
                2857
            ],
            [
                2857,
                2857
            ],
            [
                2857,
                2960
            ],
            [
                2960,
                2992
            ],
            [
                2992,
                3014
            ],
            [
                3014,
                3164
            ],
            [
                3164,
                3301
            ],
            [
                3301,
                3301
            ],
            [
                3301,
                3301
            ],
            [
                3301,
                3301
            ],
            [
                3301,
                3324
            ],
            [
                3324,
                3376
            ],
            [
                3376,
                3520
            ],
            [
                3520,
                3641
            ],
            [
                3641,
                3654
            ],
            [
                3654,
                3654
            ],
            [
                3654,
                3926
            ],
            [
                3926,
                3996
            ],
            [
                3996,
                4128
            ],
            [
                4128,
                4305
            ],
            [
                4305,
                4390
            ],
            [
                4390,
                4493
            ],
            [
                4493,
                4587
            ],
            [
                4587,
                4587
            ],
            [
                4587,
                4658
            ],
            [
                4658,
                4777
            ],
            [
                4777,
                4828
            ],
            [
                4828,
                4888
            ],
            [
                4888,
                4935
            ],
            [
                4935,
                4992
            ],
            [
                4992,
                5084
            ],
            [
                5084,
                5277
            ],
            [
                5277,
                5561
            ],
            [
                5561,
                5655
            ],
            [
                5655,
                5731
            ],
            [
                5731,
                5749
            ],
            [
                5749,
                5768
            ],
            [
                5768,
                5768
            ],
            [
                5768,
                5777
            ],
            [
                5777,
                5825
            ],
            [
                5825,
                5861
            ],
            [
                5861,
                5873
            ],
            [
                5873,
                5894
            ],
            [
                5894,
                5984
            ],
            [
                5984,
                5984
            ],
            [
                5984,
                6028
            ],
            [
                6028,
                6104
            ],
            [
                6104,
                6148
            ],
            [
                6148,
                6262
            ],
            [
                6262,
                6374
            ],
            [
                6374,
                6485
            ],
            [
                6485,
                6521
            ],
            [
                6521,
                6541
            ],
            [
                6541,
                6541
            ],
            [
                6541,
                6541
            ],
            [
                6541,
                6589
            ],
            [
                6589,
                6616
            ],
            [
                6616,
                6735
            ],
            [
                6735,
                6848
            ],
            [
                6848,
                6974
            ],
            [
                6974,
                7053
            ],
            [
                7053,
                7201
            ],
            [
                7201,
                7248
            ],
            [
                7248,
                7272
            ],
            [
                7272,
                7302
            ],
            [
                7302,
                7488
            ],
            [
                7488,
                7631
            ],
            [
                7631,
                7704
            ],
            [
                7704,
                7794
            ],
            [
                7794,
                7867
            ],
            [
                7867,
                7893
            ],
            [
                7893,
                8000
            ],
            [
                8000,
                8012
            ],
            [
                8012,
                8096
            ],
            [
                8096,
                8096
            ],
            [
                8096,
                8128
            ],
            [
                8128,
                8192
            ],
            [
                8192,
                8224
            ],
            [
                8224,
                8270
            ],
            [
                8270,
                8378
            ],
            [
                8378,
                8378
            ],
            [
                8378,
                8473
            ],
            [
                8473,
                8546
            ],
            [
                8546,
                8577
            ],
            [
                8577,
                8633
            ],
            [
                8633,
                8680
            ],
            [
                8680,
                8680
            ],
            [
                8680,
                8680
            ],
            [
                8680,
                8680
            ],
            [
                8680,
                8716
            ],
            [
                8716,
                8815
            ],
            [
                8815,
                8867
            ],
            [
                8867,
                8970
            ],
            [
                8970,
                9040
            ],
            [
                9040,
                9128
            ],
            [
                9128,
                9148
            ],
            [
                9148,
                9176
            ],
            [
                9176,
                9237
            ],
            [
                9237,
                9308
            ],
            [
                9308,
                9463
            ],
            [
                9463,
                9710
            ],
            [
                9710,
                9786
            ],
            [
                9786,
                9828
            ],
            [
                9828,
                9828
            ],
            [
                9828,
                9953
            ],
            [
                9953,
                10008
            ],
            [
                10008,
                10072
            ],
            [
                10072,
                10304
            ],
            [
                10304,
                10463
            ],
            [
                10463,
                10570
            ],
            [
                10570,
                10626
            ],
            [
                10626,
                10708
            ],
            [
                10708,
                10743
            ],
            [
                10743,
                10743
            ],
            [
                10743,
                10793
            ],
            [
                10793,
                10884
            ],
            [
                10884,
                10982
            ],
            [
                10982,
                10982
            ],
            [
                10982,
                11083
            ],
            [
                11083,
                11135
            ],
            [
                11135,
                11274
            ],
            [
                11274,
                11274
            ],
            [
                11274,
                11274
            ],
            [
                11274,
                11417
            ],
            [
                11417,
                11471
            ],
            [
                11471,
                11516
            ],
            [
                11516,
                11559
            ],
            [
                11559,
                11596
            ],
            [
                11596,
                11703
            ],
            [
                11703,
                11818
            ],
            [
                11818,
                11892
            ],
            [
                11892,
                11981
            ],
            [
                11981,
                12009
            ],
            [
                12009,
                12036
            ],
            [
                12036,
                12040
            ],
            [
                12040,
                12052
            ],
            [
                12052,
                12079
            ],
            [
                12079,
                12179
            ],
            [
                12179,
                12333
            ],
            [
                12333,
                12426
            ],
            [
                12426,
                12540
            ],
            [
                12540,
                12580
            ],
            [
                12580,
                12656
            ],
            [
                12656,
                12700
            ],
            [
                12700,
                12726
            ],
            [
                12726,
                12750
            ],
            [
                12750,
                12797
            ],
            [
                12797,
                12854
            ],
            [
                12854,
                12970
            ],
            [
                12970,
                13071
            ],
            [
                13071,
                13088
            ],
            [
                13088,
                13088
            ],
            [
                13088,
                13243
            ],
            [
                13243,
                13296
            ],
            [
                13296,
                13340
            ],
            [
                13340,
                13416
            ],
            [
                13416,
                13506
            ],
            [
                13506,
                13506
            ],
            [
                13506,
                13613
            ],
            [
                13613,
                13775
            ],
            [
                13775,
                14063
            ],
            [
                14063,
                14125
            ],
            [
                14125,
                14283
            ],
            [
                14283,
                14332
            ],
            [
                14332,
                14597
            ],
            [
                14597,
                14717
            ],
            [
                14717,
                14851
            ],
            [
                14851,
                14949
            ],
            [
                14949,
                14989
            ],
            [
                14989,
                15029
            ],
            [
                15029,
                15051
            ],
            [
                15051,
                15116
            ],
            [
                15116,
                15139
            ],
            [
                15139,
                15167
            ],
            [
                15167,
                15204
            ],
            [
                15204,
                15204
            ],
            [
                15204,
                15244
            ],
            [
                15244,
                15265
            ],
            [
                15265,
                15295
            ],
            [
                15295,
                15360
            ],
            [
                15360,
                15385
            ],
            [
                15385,
                15389
            ],
            [
                15389,
                15432
            ],
            [
                15432,
                15522
            ],
            [
                15522,
                15678
            ],
            [
                15678,
                15828
            ],
            [
                15828,
                16069
            ],
            [
                16069,
                16146
            ],
            [
                16146,
                16146
            ],
            [
                16146,
                16207
            ],
            [
                16207,
                16355
            ],
            [
                16355,
                16453
            ],
            [
                16453,
                16493
            ],
            [
                16493,
                16553
            ],
            [
                16553,
                16553
            ],
            [
                16553,
                16724
            ],
            [
                16724,
                16822
            ],
            [
                16822,
                17230
            ],
            [
                17230,
                17284
            ],
            [
                17284,
                17325
            ],
            [
                17325,
                17367
            ],
            [
                17367,
                17390
            ],
            [
                17390,
                17419
            ],
            [
                17419,
                17471
            ],
            [
                17471,
                17560
            ],
            [
                17560,
                17746
            ],
            [
                17746,
                17776
            ],
            [
                17776,
                17921
            ],
            [
                17921,
                17940
            ]
        ]
    }
}