{
    "original": {
        "text": "It was three o'clock in the morning when the houses outside London did at last begin to exclude the country and to close us in with streets. We had made our way along roads in a far worse condition than when we had traversed them by daylight, both the fall and the thaw having lasted ever since; but the energy of my companion never slackened. It had only been, as I thought, of less assistance than the horses in getting us on, and it had often aided them. They had stopped exhausted half-way up hills, they had been driven through streams of turbulent water, they had slipped down and become entangled with the harness; but he and his little lantern had been always ready, and when the mishap was set right, I had never heard any variation in his cool, \"Get on, my lads!\"\nThe steadiness and confidence with which he had directed our journey back I could not account for. Never wavering, he never even stopped to make an inquiry until we were within a few miles of London. A very few words, here and there, were then enough for him; and thus we came, at between three and four o'clock in the morning, into Islington.\nI will not dwell on the suspense and anxiety with which I reflected all this time that we were leaving my mother farther and farther behind every minute. I think I had some strong hope that he must be right and could not fail to have a satisfactory object in following this woman, but I tormented myself with questioning it and discussing it during the whole journey. What was to ensue when we found her and what could compensate us for this loss of time were questions also that I could not possibly dismiss; my mind was quite tortured by long dwelling on such reflections when we stopped.\nWe stopped in a high-street where there was a coach-stand. My companion paid our two drivers, who were as completely covered with splashes as if they had been dragged along the roads like the carriage itself, and giving them some brief direction where to take it, lifted me out of it and into a hackney-coach he had chosen from the rest.\n\"Why, my dear!\" he said as he did this. \"How wet you are!\"\nI had not been conscious of it. But the melted snow had found its way into the carriage, and I had got out two or three times when a fallen horse was plunging and had to be got up, and the wet had penetrated my dress. I assured him it was no matter, but the driver, who knew him, would not be dissuaded by me from running down the street to his stable, whence he brought an armful of clean dry straw. They shook it out and strewed it well about me, and I found it warm and comfortable.\n\"Now, my dear,\" said Mr. Bucket, with his head in at the window after I was shut up. \"We're a-going to mark this person down. It may take a little time, but you don't mind that. You're pretty sure that I've got a motive. Ain't you?\"\nI little thought what it was, little thought in how short a time I should understand it better, but I assured him that I had confidence in him.\n\"So you may have, my dear,\" he returned. \"And I tell you what! If you only repose half as much confidence in me as I repose in you after what I've experienced of you, that'll do. Lord! You're no trouble at all. I never see a young woman in any station of society--and I've seen many elevated ones too--conduct herself like you have conducted yourself since you was called out of your bed. You're a pattern, you know, that's what you are,\" said Mr. Bucket warmly; \"you're a pattern.\"\nI told him I was very glad, as indeed I was, to have been no hindrance to him, and that I hoped I should be none now.\n\"My dear,\" he returned, \"when a young lady is as mild as she's game, and as game as she's mild, that's all I ask, and more than I expect. She then becomes a queen, and that's about what you are yourself.\"\nWith these encouraging words--they really were encouraging to me under those lonely and anxious circumstances--he got upon the box, and we once more drove away. Where we drove I neither knew then nor have ever known since, but we appeared to seek out the narrowest and worst streets in London. Whenever I saw him directing the driver, I was prepared for our descending into a deeper complication of such streets, and we never failed to do so.\nSometimes we emerged upon a wider thoroughfare or came to a larger building than the generality, well lighted. Then we stopped at offices like those we had visited when we began our journey, and I saw him in consultation with others. Sometimes he would get down by an archway or at a street corner and mysteriously show the light of his little lantern. This would attract similar lights from various dark quarters, like so many insects, and a fresh consultation would be held. By degrees we appeared to contract our search within narrower and easier limits. Single police-officers on duty could now tell Mr. Bucket what he wanted to know and point to him where to go. At last we stopped for a rather long conversation between him and one of these men, which I supposed to be satisfactory from his manner of nodding from time to time. When it was finished he came to me looking very busy and very attentive.\n\"Now, Miss Summerson,\" he said to me, \"you won't be alarmed whatever comes off, I know. It's not necessary for me to give you any further caution than to tell you that we have marked this person down and that you may be of use to me before I know it myself. I don't like to ask such a thing, my dear, but would you walk a little way?\"\nOf course I got out directly and took his arm.\n\"It ain't so easy to keep your feet,\" said Mr. Bucket, \"but take time.\"\nAlthough I looked about me confusedly and hurriedly as we crossed the street, I thought I knew the place. \"Are we in Holborn?\" I asked him.\n\"Yes,\" said Mr. Bucket. \"Do you know this turning?\"\n\"It looks like Chancery Lane.\"\n\"And was christened so, my dear,\" said Mr. Bucket.\nWe turned down it, and as we went shuffling through the sleet, I heard the clocks strike half-past five. We passed on in silence and as quickly as we could with such a foot-hold, when some one coming towards us on the narrow pavement, wrapped in a cloak, stopped and stood aside to give me room. In the same moment I heard an exclamation of wonder and my own name from Mr. Woodcourt. I knew his voice very well.\nIt was so unexpected and so--I don't know what to call it, whether pleasant or painful--to come upon it after my feverish wandering journey, and in the midst of the night, that I could not keep back the tears from my eyes. It was like hearing his voice in a strange country.\n\"My dear Miss Summerson, that you should be out at this hour, and in such weather!\"\nHe had heard from my guardian of my having been called away on some uncommon business and said so to dispense with any explanation. I told him that we had but just left a coach and were going--but then I was obliged to look at my companion.\n\"Why, you see, Mr. Woodcourt\"--he had caught the name from me--\"we are a-going at present into the next street. Inspector Bucket.\"\nMr. Woodcourt, disregarding my remonstrances, had hurriedly taken off his cloak and was putting it about me. \"That's a good move, too,\" said Mr. Bucket, assisting, \"a very good move.\"\n\"May I go with you?\" said Mr. Woodcourt. I don't know whether to me or to my companion.\n\"Why, Lord!\" exclaimed Mr. Bucket, taking the answer on himself. \"Of course you may.\"\nIt was all said in a moment, and they took me between them, wrapped in the cloak.\n\"I have just left Richard,\" said Mr. Woodcourt. \"I have been sitting with him since ten o'clock last night.\"\n\"Oh, dear me, he is ill!\"\n\"No, no, believe me; not ill, but not quite well. He was depressed and faint--you know he gets so worried and so worn sometimes--and Ada sent to me of course; and when I came home I found her note and came straight here. Well! Richard revived so much after a little while, and Ada was so happy and so convinced of its being my doing, though God knows I had little enough to do with it, that I remained with him until he had been fast asleep some hours. As fast asleep as she is now, I hope!\"\nHis friendly and familiar way of speaking of them, his unaffected devotion to them, the grateful confidence with which I knew he had inspired my darling, and the comfort he was to her; could I separate all this from his promise to me? How thankless I must have been if it had not recalled the words he said to me when he was so moved by the change in my appearance: \"I will accept him as a trust, and it shall be a sacred one!\"\nWe now turned into another narrow street. \"Mr. Woodcourt,\" said Mr. Bucket, who had eyed him closely as we came along, \"our business takes us to a law-stationer's here, a certain Mr. Snagsby's. What, you know him, do you?\" He was so quick that he saw it in an instant.\n\"Yes, I know a little of him and have called upon him at this place.\"\n\"Indeed, sir?\" said Mr. Bucket. \"Then you will be so good as to let me leave Miss Summerson with you for a moment while I go and have half a word with him?\"\nThe last police-officer with whom he had conferred was standing silently behind us. I was not aware of it until he struck in on my saying I heard some one crying.\n\"Don't be alarmed, miss,\" he returned. \"It's Snagsby's servant.\"\n\"Why, you see,\" said Mr. Bucket, \"the girl's subject to fits, and has 'em bad upon her to-night. A most contrary circumstance it is, for I want certain information out of that girl, and she must be brought to reason somehow.\"\n\"At all events, they wouldn't be up yet if it wasn't for her, Mr. Bucket,\" said the other man. \"She's been at it pretty well all night, sir.\"\n\"Well, that's true,\" he returned. \"My light's burnt out. Show yours a moment.\"\nAll this passed in a whisper a door or two from the house in which I could faintly hear crying and moaning. In the little round of light produced for the purpose, Mr. Bucket went up to the door and knocked. The door was opened after he had knocked twice, and he went in, leaving us standing in the street.\n\"Miss Summerson,\" said Mr. Woodcourt, \"if without obtruding myself on your confidence I may remain near you, pray let me do so.\"\n\"You are truly kind,\" I answered. \"I need wish to keep no secret of my own from you; if I keep any, it is another's.\"\n\"I quite understand. Trust me, I will remain near you only so long as I can fully respect it.\"\n\"I trust implicitly to you,\" I said. \"I know and deeply feel how sacredly you keep your promise.\"\nAfter a short time the little round of light shone out again, and Mr. Bucket advanced towards us in it with his earnest face. \"Please to come in, Miss Summerson,\" he said, \"and sit down by the fire. Mr. Woodcourt, from information I have received I understand you are a medical man. Would you look to this girl and see if anything can be done to bring her round. She has a letter somewhere that I particularly want. It's not in her box, and I think it must be about her; but she is so twisted and clenched up that she is difficult to handle without hurting.\"\nWe all three went into the house together; although it was cold and raw, it smelt close too from being up all night. In the passage behind the door stood a scared, sorrowful-looking little man in a grey coat who seemed to have a naturally polite manner and spoke meekly.\n\"Downstairs, if you please, Mr. Bucket,\" said he. \"The lady will excuse the front kitchen; we use it as our workaday sitting-room. The back is Guster's bedroom, and in it she's a-carrying on, poor thing, to a frightful extent!\"\nWe went downstairs, followed by Mr. Snagsby, as I soon found the little man to be. In the front kitchen, sitting by the fire, was Mrs. Snagsby, with very red eyes and a very severe expression of face.\n\"My little woman,\" said Mr. Snagsby, entering behind us, \"to wave--not to put too fine a point upon it, my dear--hostilities for one single moment in the course of this prolonged night, here is Inspector Bucket, Mr. Woodcourt, and a lady.\"\nShe looked very much astonished, as she had reason for doing, and looked particularly hard at me.\n\"My little woman,\" said Mr. Snagsby, sitting down in the remotest corner by the door, as if he were taking a liberty, \"it is not unlikely that you may inquire of me why Inspector Bucket, Mr. Woodcourt, and a lady call upon us in Cook's Court, Cursitor Street, at the present hour. I don't know. I have not the least idea. If I was to be informed, I should despair of understanding, and I'd rather not be told.\"\nHe appeared so miserable, sitting with his head upon his hand, and I appeared so unwelcome, that I was going to offer an apology when Mr. Bucket took the matter on himself.\n\"Now, Mr. Snagsby,\" said he, \"the best thing you can do is to go along with Mr. Woodcourt to look after your Guster--\"\n\"My Guster, Mr. Bucket!\" cried Mr. Snagsby. \"Go on, sir, go on. I shall be charged with that next.\"\n\"And to hold the candle,\" pursued Mr. Bucket without correcting himself, \"or hold her, or make yourself useful in any way you're asked. Which there's not a man alive more ready to do, for you're a man of urbanity and suavity, you know, and you've got the sort of heart that can feel for another. Mr. Woodcourt, would you be so good as see to her, and if you can get that letter from her, to let me have it as soon as ever you can?\"\nAs they went out, Mr. Bucket made me sit down in a corner by the fire and take off my wet shoes, which he turned up to dry upon the fender, talking all the time.\n\"Don't you be at all put out, miss, by the want of a hospitable look from Mrs. Snagsby there, because she's under a mistake altogether. She'll find that out sooner than will be agreeable to a lady of her generally correct manner of forming her thoughts, because I'm a-going to explain it to her.\" Here, standing on the hearth with his wet hat and shawls in his hand, himself a pile of wet, he turned to Mrs. Snagsby. \"Now, the first thing that I say to you, as a married woman possessing what you may call charms, you know--'Believe Me, if All Those Endearing,' and cetrer--you're well acquainted with the song, because it's in vain for you to tell me that you and good society are strangers--charms--attractions, mind you, that ought to give you confidence in yourself--is, that you've done it.\"\nMrs. Snagsby looked rather alarmed, relented a little and faltered, what did Mr. Bucket mean.\n\"What does Mr. Bucket mean?\" he repeated, and I saw by his face that all the time he talked he was listening for the discovery of the letter, to my own great agitation, for I knew then how important it must be; \"I'll tell you what he means, ma'am. Go and see Othello acted. That's the tragedy for you.\"\nMrs. Snagsby consciously asked why.\n\"Why?\" said Mr. Bucket. \"Because you'll come to that if you don't look out. Why, at the very moment while I speak, I know what your mind's not wholly free from respecting this young lady. But shall I tell you who this young lady is? Now, come, you're what I call an intellectual woman--with your soul too large for your body, if you come to that, and chafing it--and you know me, and you recollect where you saw me last, and what was talked of in that circle. Don't you? Yes! Very well. This young lady is that young lady.\"\nMrs. Snagsby appeared to understand the reference better than I did at the time.\n\"And Toughey--him as you call Jo--was mixed up in the same business, and no other; and the law-writer that you know of was mixed up in the same business, and no other; and your husband, with no more knowledge of it than your great grandfather, was mixed up (by Mr. Tulkinghorn, deceased, his best customer) in the same business, and no other; and the whole bileing of people was mixed up in the same business, and no other. And yet a married woman, possessing your attractions, shuts her eyes (and sparklers too), and goes and runs her delicate-formed head against a wall. Why, I am ashamed of you! (I expected Mr. Woodcourt might have got it by this time.)\"\nMrs. Snagsby shook her head and put her handkerchief to her eyes.\n\"Is that all?\" said Mr. Bucket excitedly. \"No. See what happens. Another person mixed up in that business and no other, a person in a wretched state, comes here to-night and is seen a-speaking to your maid-servant; and between her and your maid-servant there passes a paper that I would give a hundred pound for, down. What do you do? You hide and you watch 'em, and you pounce upon that maid-servant--knowing what she's subject to and what a little thing will bring 'em on--in that surprising manner and with that severity that, by the Lord, she goes off and keeps off, when a life may be hanging upon that girl's words!\"\nHe so thoroughly meant what he said now that I involuntarily clasped my hands and felt the room turning away from me. But it stopped. Mr. Woodcourt came in, put a paper into his hand, and went away again.\n\"Now, Mrs. Snagsby, the only amends you can make,\" said Mr. Bucket, rapidly glancing at it, \"is to let me speak a word to this young lady in private here. And if you know of any help that you can give to that gentleman in the next kitchen there or can think of any one thing that's likelier than another to bring the girl round, do your swiftest and best!\" In an instant she was gone, and he had shut the door. \"Now my dear, you're steady and quite sure of yourself?\"\n\"Quite,\" said I.\n\"Whose writing is that?\"\nIt was my mother's. A pencil-writing, on a crushed and torn piece of paper, blotted with wet. Folded roughly like a letter, and directed to me at my guardian's.\n\"You know the hand,\" he said, \"and if you are firm enough to read it to me, do! But be particular to a word.\"\nIt had been written in portions, at different times. I read what follows:\nI came to the cottage with two objects. First, to see the dear one, if I could, once more--but only to see her--not to speak to her or let her know that I was near. The other object, to elude pursuit and to be lost. Do not blame the mother for her share. The assistance that she rendered me, she rendered on my strongest assurance that it was for the dear one's good. You remember her dead child. The men's consent I bought, but her help was freely given.\n\"'I came.' That was written,\" said my companion, \"when she rested there. It bears out what I made of it. I was right.\"\nThe next was written at another time:\nI have wandered a long distance, and for many hours, and I know that I must soon die. These streets! I have no purpose but to die. When I left, I had a worse, but I am saved from adding that guilt to the rest. Cold, wet, and fatigue are sufficient causes for my being found dead, but I shall die of others, though I suffer from these. It was right that all that had sustained me should give way at once and that I should die of terror and my conscience.\n\"Take courage,\" said Mr. Bucket. \"There's only a few words more.\"\nThose, too, were written at another time. To all appearance, almost in the dark:\nI have done all I could do to be lost. I shall be soon forgotten so, and shall disgrace him least. I have nothing about me by which I can be recognized. This paper I part with now. The place where I shall lie down, if I can get so far, has been often in my mind. Farewell. Forgive.\nMr. Bucket, supporting me with his arm, lowered me gently into my chair. \"Cheer up! Don't think me hard with you, my dear, but as soon as ever you feel equal to it, get your shoes on and be ready.\"\nI did as he required, but I was left there a long time, praying for my unhappy mother. They were all occupied with the poor girl, and I heard Mr. Woodcourt directing them and speaking to her often. At length he came in with Mr. Bucket and said that as it was important to address her gently, he thought it best that I should ask her for whatever information we desired to obtain. There was no doubt that she could now reply to questions if she were soothed and not alarmed. The questions, Mr. Bucket said, were how she came by the letter, what passed between her and the person who gave her the letter, and where the person went. Holding my mind as steadily as I could to these points, I went into the next room with them. Mr. Woodcourt would have remained outside, but at my solicitation went in with us.\nThe poor girl was sitting on the floor where they had laid her down. They stood around her, though at a little distance, that she might have air. She was not pretty and looked weak and poor, but she had a plaintive and a good face, though it was still a little wild. I kneeled on the ground beside her and put her poor head upon my shoulder, whereupon she drew her arm round my neck and burst into tears.\n\"My poor girl,\" said I, laying my face against her forehead, for indeed I was crying too, and trembling, \"it seems cruel to trouble you now, but more depends on our knowing something about this letter than I could tell you in an hour.\"\nShe began piteously declaring that she didn't mean any harm, she didn't mean any harm, Mrs. Snagsby!\n\"We are all sure of that,\" said I. \"But pray tell me how you got it.\"\n\"Yes, dear lady, I will, and tell you true. I'll tell true, indeed, Mrs. Snagsby.\"\n\"I am sure of that,\" said I. \"And how was it?\"\n\"I had been out on an errand, dear lady--long after it was dark--quite late; and when I came home, I found a common-looking person, all wet and muddy, looking up at our house. When she saw me coming in at the door, she called me back and said did I live here. And I said yes, and she said she knew only one or two places about here, but had lost her way and couldn't find them. Oh, what shall I do, what shall I do! They won't believe me! She didn't say any harm to me, and I didn't say any harm to her, indeed, Mrs. Snagsby!\"\nIt was necessary for her mistress to comfort her--which she did, I must say, with a good deal of contrition--before she could be got beyond this.\n\"She could not find those places,\" said I.\n\"No!\" cried the girl, shaking her head. \"No! Couldn't find them. And she was so faint, and lame, and miserable, Oh so wretched, that if you had seen her, Mr. Snagsby, you'd have given her half a crown, I know!\"\n\"Well, Guster, my girl,\" said he, at first not knowing what to say. \"I hope I should.\"\n\"And yet she was so well spoken,\" said the girl, looking at me with wide open eyes, \"that it made a person's heart bleed. And so she said to me, did I know the way to the burying ground? And I asked her which burying ground. And she said, the poor burying ground. And so I told her I had been a poor child myself, and it was according to parishes. But she said she meant a poor burying ground not very far from here, where there was an archway, and a step, and an iron gate.\"\nAs I watched her face and soothed her to go on, I saw that Mr. Bucket received this with a look which I could not separate from one of alarm.\n\"Oh, dear, dear!\" cried the girl, pressing her hair back with her hands. \"What shall I do, what shall I do! She meant the burying ground where the man was buried that took the sleeping-stuff--that you came home and told us of, Mr. Snagsby--that frightened me so, Mrs. Snagsby. Oh, I am frightened again. Hold me!\"\n\"You are so much better now,\" sald I. \"Pray, pray tell me more.\"\n\"Yes I will, yes I will! But don't be angry with me, that's a dear lady, because I have been so ill.\"\nAngry with her, poor soul!\n\"There! Now I will, now I will. So she said, could I tell her how to find it, and I said yes, and I told her; and she looked at me with eyes like almost as if she was blind, and herself all waving back. And so she took out the letter, and showed it me, and said if she was to put that in the post-office, it would be rubbed out and not minded and never sent; and would I take it from her, and send it, and the messenger would be paid at the house. And so I said yes, if it was no harm, and she said no--no harm. And so I took it from her, and she said she had nothing to give me, and I said I was poor myself and consequently wanted nothing. And so she said God bless you, and went.\"\n\"And did she go--\"\n\"Yes,\" cried the girl, anticipating the inquiry. \"Yes! She went the way I had shown her. Then I came in, and Mrs. Snagsby came behind me from somewhere and laid hold of me, and I was frightened.\"\nMr. Woodcourt took her kindly from me. Mr. Bucket wrapped me up, and immediately we were in the street. Mr. Woodcourt hesitated, but I said, \"Don't leave me now!\" and Mr. Bucket added, \"You'll be better with us, we may want you; don't lose time!\"\nI have the most confused impressions of that walk. I recollect that it was neither night nor day, that morning was dawning but the street-lamps were not yet put out, that the sleet was still falling and that all the ways were deep with it. I recollect a few chilled people passing in the streets. I recollect the wet house-tops, the clogged and bursting gutters and water-spouts, the mounds of blackened ice and snow over which we passed, the narrowness of the courts by which we went. At the same time I remember that the poor girl seemed to be yet telling her story audibly and plainly in my hearing, that I could feel her resting on my arm, that the stained house-fronts put on human shapes and looked at me, that great water-gates seemed to be opening and closing in my head or in the air, and that the unreal things were more substantial than the real.\nAt last we stood under a dark and miserable covered way, where one lamp was burning over an iron gate and where the morning faintly struggled in. The gate was closed. Beyond it was a burial ground--a dreadful spot in which the night was very slowly stirring, but where I could dimly see heaps of dishonoured graves and stones, hemmed in by filthy houses with a few dull lights in their windows and on whose walls a thick humidity broke out like a disease. On the step at the gate, drenched in the fearful wet of such a place, which oozed and splashed down everywhere, I saw, with a cry of pity and horror, a woman lying--Jenny, the mother of the dead child.\nI ran forward, but they stopped me, and Mr. Woodcourt entreated me with the greatest earnestness, even with tears, before I went up to the figure to listen for an instant to what Mr. Bucket said. I did so, as I thought. I did so, as I am sure.\n\"Miss Summerson, you'll understand me, if you think a moment. They changed clothes at the cottage.\"\nThey changed clothes at the cottage. I could repeat the words in my mind, and I knew what they meant of themselves, but I attached no meaning to them in any other connexion.\n\"And one returned,\" said Mr. Bucket, \"and one went on. And the one that went on only went on a certain way agreed upon to deceive and then turned across country and went home. Think a moment!\"\nI could repeat this in my mind too, but I had not the least idea what it meant. I saw before me, lying on the step, the mother of the dead child. She lay there with one arm creeping round a bar of the iron gate and seeming to embrace it. She lay there, who had so lately spoken to my mother. She lay there, a distressed, unsheltered, senseless creature. She who had brought my mother's letter, who could give me the only clue to where my mother was; she, who was to guide us to rescue and save her whom we had sought so far, who had come to this condition by some means connected with my mother that I could not follow, and might be passing beyond our reach and help at that moment; she lay there, and they stopped me! I saw but did not comprehend the solemn and compassionate look in Mr. Woodcourt's face. I saw but did not comprehend his touching the other on the breast to keep him back. I saw him stand uncovered in the bitter air, with a reverence for something. But my understanding for all this was gone.\nI even heard it said between them, \"Shall she go?\"\n\"She had better go. Her hands should be the first to touch her. They have a higher right than ours.\"\nI passed on to the gate and stooped down. I lifted the heavy head, put the long dank hair aside, and turned the face. And it was my mother, cold and dead.",
        "paragraph_chars": [
            [
                0,
                774
            ],
            [
                774,
                1118
            ],
            [
                1118,
                1709
            ],
            [
                1709,
                2047
            ],
            [
                2047,
                2106
            ],
            [
                2106,
                2592
            ],
            [
                2592,
                2825
            ],
            [
                2825,
                2969
            ],
            [
                2969,
                3452
            ],
            [
                3452,
                3570
            ],
            [
                3570,
                3775
            ],
            [
                3775,
                4218
            ],
            [
                4218,
                5125
            ],
            [
                5125,
                5460
            ],
            [
                5460,
                5507
            ],
            [
                5507,
                5579
            ],
            [
                5579,
                5719
            ],
            [
                5719,
                5771
            ],
            [
                5771,
                5802
            ],
            [
                5802,
                5853
            ],
            [
                5853,
                6265
            ],
            [
                6265,
                6540
            ],
            [
                6540,
                6624
            ],
            [
                6624,
                6865
            ],
            [
                6865,
                6996
            ],
            [
                6996,
                7180
            ],
            [
                7180,
                7268
            ],
            [
                7268,
                7354
            ],
            [
                7354,
                7436
            ],
            [
                7436,
                7545
            ],
            [
                7545,
                7571
            ],
            [
                7571,
                8063
            ],
            [
                8063,
                8491
            ],
            [
                8491,
                8760
            ],
            [
                8760,
                8830
            ],
            [
                8830,
                8987
            ],
            [
                8987,
                9150
            ],
            [
                9150,
                9215
            ],
            [
                9215,
                9441
            ],
            [
                9441,
                9583
            ],
            [
                9583,
                9662
            ],
            [
                9662,
                9968
            ],
            [
                9968,
                10097
            ],
            [
                10097,
                10215
            ],
            [
                10215,
                10310
            ],
            [
                10310,
                10408
            ],
            [
                10408,
                10967
            ],
            [
                10967,
                11238
            ],
            [
                11238,
                11466
            ],
            [
                11466,
                11667
            ],
            [
                11667,
                11907
            ],
            [
                11907,
                12005
            ],
            [
                12005,
                12416
            ],
            [
                12416,
                12589
            ],
            [
                12589,
                12708
            ],
            [
                12708,
                12808
            ],
            [
                12808,
                13240
            ],
            [
                13240,
                13402
            ],
            [
                13402,
                14199
            ],
            [
                14199,
                14293
            ],
            [
                14293,
                14596
            ],
            [
                14596,
                14632
            ],
            [
                14632,
                15156
            ],
            [
                15156,
                15237
            ],
            [
                15237,
                15896
            ],
            [
                15896,
                15962
            ],
            [
                15962,
                16585
            ],
            [
                16585,
                16790
            ],
            [
                16790,
                17258
            ],
            [
                17258,
                17275
            ],
            [
                17275,
                17300
            ],
            [
                17300,
                17461
            ],
            [
                17461,
                17571
            ],
            [
                17571,
                17645
            ],
            [
                17645,
                18101
            ],
            [
                18101,
                18220
            ],
            [
                18220,
                18258
            ],
            [
                18258,
                18712
            ],
            [
                18712,
                18778
            ],
            [
                18778,
                18859
            ],
            [
                18859,
                19141
            ],
            [
                19141,
                19339
            ],
            [
                19339,
                20145
            ],
            [
                20145,
                20550
            ],
            [
                20550,
                20786
            ],
            [
                20786,
                20887
            ],
            [
                20887,
                20957
            ],
            [
                20957,
                21040
            ],
            [
                21040,
                21087
            ],
            [
                21087,
                21614
            ],
            [
                21614,
                21760
            ],
            [
                21760,
                21803
            ],
            [
                21803,
                22014
            ],
            [
                22014,
                22101
            ],
            [
                22101,
                22577
            ],
            [
                22577,
                22719
            ],
            [
                22719,
                23033
            ],
            [
                23033,
                23098
            ],
            [
                23098,
                23200
            ],
            [
                23200,
                23227
            ],
            [
                23227,
                23911
            ],
            [
                23911,
                23930
            ],
            [
                23930,
                24126
            ],
            [
                24126,
                24373
            ],
            [
                24373,
                25231
            ],
            [
                25231,
                25889
            ],
            [
                25889,
                26133
            ],
            [
                26133,
                26233
            ],
            [
                26233,
                26407
            ],
            [
                26407,
                26600
            ],
            [
                26600,
                27612
            ],
            [
                27612,
                27663
            ],
            [
                27663,
                27764
            ],
            [
                27764,
                27918
            ]
        ],
        "segment_chars": [
            [
                0,
                141
            ],
            [
                141,
                344
            ],
            [
                344,
                458
            ],
            [
                458,
                774
            ],
            [
                774,
                873
            ],
            [
                873,
                974
            ],
            [
                974,
                1118
            ],
            [
                1118,
                1272
            ],
            [
                1272,
                1486
            ],
            [
                1486,
                1709
            ],
            [
                1709,
                1768
            ],
            [
                1768,
                2047
            ],
            [
                2047,
                2063
            ],
            [
                2063,
                2087
            ],
            [
                2087,
                2106
            ],
            [
                2106,
                2138
            ],
            [
                2138,
                2324
            ],
            [
                2324,
                2507
            ],
            [
                2507,
                2592
            ],
            [
                2592,
                2677
            ],
            [
                2677,
                2718
            ],
            [
                2718,
                2770
            ],
            [
                2770,
                2813
            ],
            [
                2813,
                2825
            ],
            [
                2825,
                2969
            ],
            [
                2969,
                3010
            ],
            [
                3010,
                3032
            ],
            [
                3032,
                3148
            ],
            [
                3148,
                3154
            ],
            [
                3154,
                3180
            ],
            [
                3180,
                3358
            ],
            [
                3358,
                3452
            ],
            [
                3452,
                3570
            ],
            [
                3570,
                3708
            ],
            [
                3708,
                3775
            ],
            [
                3775,
                3936
            ],
            [
                3936,
                4069
            ],
            [
                4069,
                4218
            ],
            [
                4218,
                4329
            ],
            [
                4329,
                4452
            ],
            [
                4452,
                4571
            ],
            [
                4571,
                4695
            ],
            [
                4695,
                4776
            ],
            [
                4776,
                4886
            ],
            [
                4886,
                5052
            ],
            [
                5052,
                5125
            ],
            [
                5125,
                5213
            ],
            [
                5213,
                5383
            ],
            [
                5383,
                5460
            ],
            [
                5460,
                5507
            ],
            [
                5507,
                5579
            ],
            [
                5579,
                5685
            ],
            [
                5685,
                5706
            ],
            [
                5706,
                5719
            ],
            [
                5719,
                5743
            ],
            [
                5743,
                5771
            ],
            [
                5771,
                5802
            ],
            [
                5802,
                5853
            ],
            [
                5853,
                5958
            ],
            [
                5958,
                6149
            ],
            [
                6149,
                6237
            ],
            [
                6237,
                6265
            ],
            [
                6265,
                6488
            ],
            [
                6488,
                6540
            ],
            [
                6540,
                6624
            ],
            [
                6624,
                6756
            ],
            [
                6756,
                6865
            ],
            [
                6865,
                6977
            ],
            [
                6977,
                6996
            ],
            [
                6996,
                7105
            ],
            [
                7105,
                7180
            ],
            [
                7180,
                7201
            ],
            [
                7201,
                7221
            ],
            [
                7221,
                7268
            ],
            [
                7268,
                7281
            ],
            [
                7281,
                7333
            ],
            [
                7333,
                7354
            ],
            [
                7354,
                7436
            ],
            [
                7436,
                7484
            ],
            [
                7484,
                7545
            ],
            [
                7545,
                7571
            ],
            [
                7571,
                7621
            ],
            [
                7621,
                7792
            ],
            [
                7792,
                7798
            ],
            [
                7798,
                8024
            ],
            [
                8024,
                8063
            ],
            [
                8063,
                8298
            ],
            [
                8298,
                8491
            ],
            [
                8491,
                8533
            ],
            [
                8533,
                8685
            ],
            [
                8685,
                8714
            ],
            [
                8714,
                8760
            ],
            [
                8760,
                8830
            ],
            [
                8830,
                8845
            ],
            [
                8845,
                8862
            ],
            [
                8862,
                8987
            ],
            [
                8987,
                9071
            ],
            [
                9071,
                9150
            ],
            [
                9150,
                9189
            ],
            [
                9189,
                9215
            ],
            [
                9215,
                9312
            ],
            [
                9312,
                9441
            ],
            [
                9441,
                9536
            ],
            [
                9536,
                9583
            ],
            [
                9583,
                9617
            ],
            [
                9617,
                9640
            ],
            [
                9640,
                9662
            ],
            [
                9662,
                9770
            ],
            [
                9770,
                9869
            ],
            [
                9869,
                9968
            ],
            [
                9968,
                10097
            ],
            [
                10097,
                10131
            ],
            [
                10131,
                10215
            ],
            [
                10215,
                10236
            ],
            [
                10236,
                10310
            ],
            [
                10310,
                10347
            ],
            [
                10347,
                10408
            ],
            [
                10408,
                10534
            ],
            [
                10534,
                10607
            ],
            [
                10607,
                10691
            ],
            [
                10691,
                10771
            ],
            [
                10771,
                10824
            ],
            [
                10824,
                10967
            ],
            [
                10967,
                11084
            ],
            [
                11084,
                11238
            ],
            [
                11238,
                11288
            ],
            [
                11288,
                11369
            ],
            [
                11369,
                11466
            ],
            [
                11466,
                11549
            ],
            [
                11549,
                11667
            ],
            [
                11667,
                11907
            ],
            [
                11907,
                12005
            ],
            [
                12005,
                12286
            ],
            [
                12286,
                12300
            ],
            [
                12300,
                12327
            ],
            [
                12327,
                12416
            ],
            [
                12416,
                12589
            ],
            [
                12589,
                12708
            ],
            [
                12708,
                12733
            ],
            [
                12733,
                12752
            ],
            [
                12752,
                12772
            ],
            [
                12772,
                12808
            ],
            [
                12808,
                12944
            ],
            [
                12944,
                13104
            ],
            [
                13104,
                13240
            ],
            [
                13240,
                13402
            ],
            [
                13402,
                13538
            ],
            [
                13538,
                13699
            ],
            [
                13699,
                13819
            ],
            [
                13819,
                14199
            ],
            [
                14199,
                14293
            ],
            [
                14293,
                14322
            ],
            [
                14322,
                14541
            ],
            [
                14541,
                14567
            ],
            [
                14567,
                14596
            ],
            [
                14596,
                14632
            ],
            [
                14632,
                14639
            ],
            [
                14639,
                14656
            ],
            [
                14656,
                14708
            ],
            [
                14708,
                14820
            ],
            [
                14820,
                14865
            ],
            [
                14865,
                15092
            ],
            [
                15092,
                15103
            ],
            [
                15103,
                15108
            ],
            [
                15108,
                15119
            ],
            [
                15119,
                15156
            ],
            [
                15156,
                15237
            ],
            [
                15237,
                15661
            ],
            [
                15661,
                15810
            ],
            [
                15810,
                15836
            ],
            [
                15836,
                15896
            ],
            [
                15896,
                15962
            ],
            [
                15962,
                15977
            ],
            [
                15977,
                16004
            ],
            [
                16004,
                16009
            ],
            [
                16009,
                16027
            ],
            [
                16027,
                16281
            ],
            [
                16281,
                16297
            ],
            [
                16297,
                16585
            ],
            [
                16585,
                16703
            ],
            [
                16703,
                16719
            ],
            [
                16719,
                16790
            ],
            [
                16790,
                16945
            ],
            [
                16945,
                17147
            ],
            [
                17147,
                17201
            ],
            [
                17201,
                17258
            ],
            [
                17258,
                17275
            ],
            [
                17275,
                17300
            ],
            [
                17300,
                17320
            ],
            [
                17320,
                17394
            ],
            [
                17394,
                17461
            ],
            [
                17461,
                17541
            ],
            [
                17541,
                17571
            ],
            [
                17571,
                17624
            ],
            [
                17624,
                17645
            ],
            [
                17645,
                17685
            ],
            [
                17685,
                17810
            ],
            [
                17810,
                17861
            ],
            [
                17861,
                17900
            ],
            [
                17900,
                18013
            ],
            [
                18013,
                18042
            ],
            [
                18042,
                18101
            ],
            [
                18101,
                18112
            ],
            [
                18112,
                18174
            ],
            [
                18174,
                18206
            ],
            [
                18206,
                18220
            ],
            [
                18220,
                18258
            ],
            [
                18258,
                18344
            ],
            [
                18344,
                18359
            ],
            [
                18359,
                18389
            ],
            [
                18389,
                18468
            ],
            [
                18468,
                18593
            ],
            [
                18593,
                18712
            ],
            [
                18712,
                18745
            ],
            [
                18745,
                18778
            ],
            [
                18778,
                18820
            ],
            [
                18820,
                18859
            ],
            [
                18859,
                18898
            ],
            [
                18898,
                18958
            ],
            [
                18958,
                19012
            ],
            [
                19012,
                19040
            ],
            [
                19040,
                19122
            ],
            [
                19122,
                19132
            ],
            [
                19132,
                19141
            ],
            [
                19141,
                19214
            ],
            [
                19214,
                19225
            ],
            [
                19225,
                19339
            ],
            [
                19339,
                19426
            ],
            [
                19426,
                19537
            ],
            [
                19537,
                19719
            ],
            [
                19719,
                19813
            ],
            [
                19813,
                19969
            ],
            [
                19969,
                20062
            ],
            [
                20062,
                20145
            ],
            [
                20145,
                20214
            ],
            [
                20214,
                20291
            ],
            [
                20291,
                20412
            ],
            [
                20412,
                20550
            ],
            [
                20550,
                20786
            ],
            [
                20786,
                20887
            ],
            [
                20887,
                20922
            ],
            [
                20922,
                20957
            ],
            [
                20957,
                21001
            ],
            [
                21001,
                21040
            ],
            [
                21040,
                21069
            ],
            [
                21069,
                21087
            ],
            [
                21087,
                21263
            ],
            [
                21263,
                21347
            ],
            [
                21347,
                21465
            ],
            [
                21465,
                21503
            ],
            [
                21503,
                21526
            ],
            [
                21526,
                21614
            ],
            [
                21614,
                21760
            ],
            [
                21760,
                21803
            ],
            [
                21803,
                21809
            ],
            [
                21809,
                21843
            ],
            [
                21843,
                21848
            ],
            [
                21848,
                21868
            ],
            [
                21868,
                22014
            ],
            [
                22014,
                22082
            ],
            [
                22082,
                22101
            ],
            [
                22101,
                22223
            ],
            [
                22223,
                22288
            ],
            [
                22288,
                22326
            ],
            [
                22326,
                22365
            ],
            [
                22365,
                22449
            ],
            [
                22449,
                22577
            ],
            [
                22577,
                22719
            ],
            [
                22719,
                22737
            ],
            [
                22737,
                22792
            ],
            [
                22792,
                22827
            ],
            [
                22827,
                22996
            ],
            [
                22996,
                23023
            ],
            [
                23023,
                23033
            ],
            [
                23033,
                23071
            ],
            [
                23071,
                23098
            ],
            [
                23098,
                23123
            ],
            [
                23123,
                23200
            ],
            [
                23200,
                23227
            ],
            [
                23227,
                23235
            ],
            [
                23235,
                23259
            ],
            [
                23259,
                23430
            ],
            [
                23430,
                23675
            ],
            [
                23675,
                23739
            ],
            [
                23739,
                23869
            ],
            [
                23869,
                23911
            ],
            [
                23911,
                23930
            ],
            [
                23930,
                23979
            ],
            [
                23979,
                23985
            ],
            [
                23985,
                24019
            ],
            [
                24019,
                24126
            ],
            [
                24126,
                24165
            ],
            [
                24165,
                24230
            ],
            [
                24230,
                24289
            ],
            [
                24289,
                24373
            ],
            [
                24373,
                24424
            ],
            [
                24424,
                24613
            ],
            [
                24613,
                24670
            ],
            [
                24670,
                24859
            ],
            [
                24859,
                25231
            ],
            [
                25231,
                25377
            ],
            [
                25377,
                25398
            ],
            [
                25398,
                25687
            ],
            [
                25687,
                25889
            ],
            [
                25889,
                26085
            ],
            [
                26085,
                26109
            ],
            [
                26109,
                26133
            ],
            [
                26133,
                26195
            ],
            [
                26195,
                26233
            ],
            [
                26233,
                26270
            ],
            [
                26270,
                26407
            ],
            [
                26407,
                26462
            ],
            [
                26462,
                26583
            ],
            [
                26583,
                26600
            ],
            [
                26600,
                26680
            ],
            [
                26680,
                26746
            ],
            [
                26746,
                26838
            ],
            [
                26838,
                26892
            ],
            [
                26892,
                26954
            ],
            [
                26954,
                27319
            ],
            [
                27319,
                27407
            ],
            [
                27407,
                27491
            ],
            [
                27491,
                27568
            ],
            [
                27568,
                27612
            ],
            [
                27612,
                27663
            ],
            [
                27663,
                27683
            ],
            [
                27683,
                27727
            ],
            [
                27727,
                27764
            ],
            [
                27764,
                27806
            ],
            [
                27806,
                27882
            ],
            [
                27882,
                27918
            ]
        ],
        "overlap_chars": [
            [
                0,
                40
            ],
            [
                60,
                66
            ],
            [
                71,
                78
            ],
            [
                112,
                141
            ],
            [
                141,
                202
            ],
            [
                248,
                251
            ],
            [
                294,
                299
            ],
            [
                314,
                326
            ],
            [
                304,
                310
            ],
            [
                327,
                344
            ],
            [
                716,
                721
            ],
            [
                400,
                410
            ],
            [
                463,
                503
            ],
            [
                566,
                577
            ],
            [
                583,
                620
            ],
            [
                360,
                361
            ],
            [
                626,
                709
            ],
            [
                749,
                774
            ],
            [
                848,
                871
            ],
            [
                793,
                803
            ],
            [
                831,
                847
            ],
            [
                871,
                873
            ],
            [
                889,
                974
            ],
            [
                1038,
                1051
            ],
            [
                1055,
                1118
            ],
            [
                1118,
                1141
            ],
            [
                1155,
                1185
            ],
            [
                1200,
                1272
            ],
            [
                1272,
                1273
            ],
            [
                1303,
                1324
            ],
            [
                1374,
                1441
            ],
            [
                1460,
                1486
            ],
            [
                1598,
                1599
            ],
            [
                1486,
                1497
            ],
            [
                1537,
                1572
            ],
            [
                1626,
                1657
            ],
            [
                1663,
                1691
            ],
            [
                1707,
                1709
            ],
            [
                1709,
                1736
            ],
            [
                1753,
                1768
            ],
            [
                1768,
                1802
            ],
            [
                1918,
                1944
            ],
            [
                1897,
                1909
            ],
            [
                1971,
                2017
            ],
            [
                2045,
                2047
            ],
            [
                2047,
                2063
            ],
            [
                2063,
                2070
            ],
            [
                2085,
                2087
            ],
            [
                2087,
                2106
            ],
            [
                2106,
                2138
            ],
            [
                2138,
                2324
            ],
            [
                2324,
                2370
            ],
            [
                2428,
                2457
            ],
            [
                2477,
                2507
            ],
            [
                2507,
                2511
            ],
            [
                2529,
                2592
            ],
            [
                2592,
                2655
            ],
            [
                2677,
                2718
            ],
            [
                2718,
                2770
            ],
            [
                2770,
                2804
            ],
            [
                2811,
                2813
            ],
            [
                2813,
                2825
            ],
            [
                2925,
                2969
            ],
            [
                2969,
                3010
            ],
            [
                3148,
                3154
            ],
            [
                3154,
                3180
            ],
            [
                3180,
                3205
            ],
            [
                3271,
                3300
            ],
            [
                3356,
                3358
            ],
            [
                3358,
                3430
            ],
            [
                3452,
                3478
            ],
            [
                3497,
                3529
            ],
            [
                3568,
                3570
            ],
            [
                3570,
                3708
            ],
            [
                3708,
                3775
            ],
            [
                3775,
                3803
            ],
            [
                3886,
                3936
            ],
            [
                3936,
                3952
            ],
            [
                3996,
                4068
            ],
            [
                4218,
                4284
            ],
            [
                4313,
                4319
            ],
            [
                4285,
                4293
            ],
            [
                4327,
                4329
            ],
            [
                4329,
                4347
            ],
            [
                4348,
                4355
            ],
            [
                4407,
                4452
            ],
            [
                4452,
                4571
            ],
            [
                4571,
                4695
            ],
            [
                4695,
                4756
            ],
            [
                4768,
                4776
            ],
            [
                4886,
                4935
            ],
            [
                4968,
                5010
            ],
            [
                5015,
                5032
            ],
            [
                5050,
                5052
            ],
            [
                5052,
                5104
            ],
            [
                5123,
                5125
            ],
            [
                5125,
                5193
            ],
            [
                5203,
                5213
            ],
            [
                5293,
                5324
            ],
            [
                5325,
                5328
            ],
            [
                5334,
                5357
            ],
            [
                5381,
                5383
            ],
            [
                5430,
                5460
            ],
            [
                5460,
                5507
            ],
            [
                5507,
                5579
            ],
            [
                5685,
                5706
            ],
            [
                5706,
                5717
            ],
            [
                5717,
                5719
            ],
            [
                5719,
                5723
            ],
            [
                5741,
                5743
            ],
            [
                5744,
                5771
            ],
            [
                5771,
                5802
            ],
            [
                5802,
                5803
            ],
            [
                5822,
                5824
            ],
            [
                5824,
                5853
            ],
            [
                5853,
                5958
            ],
            [
                5958,
                5970
            ],
            [
                5986,
                6008
            ],
            [
                6030,
                6036
            ],
            [
                6046,
                6149
            ],
            [
                6168,
                6216
            ],
            [
                6222,
                6236
            ],
            [
                6265,
                6292
            ],
            [
                6294,
                6351
            ],
            [
                6369,
                6488
            ],
            [
                6488,
                6540
            ],
            [
                6540,
                6624
            ],
            [
                6624,
                6709
            ],
            [
                6754,
                6756
            ],
            [
                6756,
                6778
            ],
            [
                6783,
                6815
            ],
            [
                6826,
                6827
            ],
            [
                6848,
                6865
            ],
            [
                6865,
                6894
            ],
            [
                6896,
                6926
            ],
            [
                6928,
                6943
            ],
            [
                6955,
                6977
            ],
            [
                6977,
                6996
            ],
            [
                6996,
                7009
            ],
            [
                7042,
                7104
            ],
            [
                7105,
                7124
            ],
            [
                7129,
                7158
            ],
            [
                7180,
                7201
            ],
            [
                7201,
                7219
            ],
            [
                7221,
                7268
            ],
            [
                7268,
                7281
            ],
            [
                7281,
                7301
            ],
            [
                7331,
                7333
            ],
            [
                7333,
                7354
            ],
            [
                7387,
                7436
            ],
            [
                7436,
                7484
            ],
            [
                7484,
                7545
            ],
            [
                7545,
                7571
            ],
            [
                7571,
                7578
            ],
            [
                7590,
                7621
            ],
            [
                7621,
                7647
            ],
            [
                7649,
                7698
            ],
            [
                7700,
                7712
            ],
            [
                7713,
                7718
            ],
            [
                7790,
                7792
            ],
            [
                7792,
                7798
            ],
            [
                7798,
                8024
            ],
            [
                8024,
                8063
            ],
            [
                8063,
                8146
            ],
            [
                8217,
                8242
            ],
            [
                8205,
                8215
            ],
            [
                8246,
                8298
            ],
            [
                8312,
                8313
            ],
            [
                8343,
                8452
            ],
            [
                8478,
                8484
            ],
            [
                8453,
                8458
            ],
            [
                8488,
                8491
            ],
            [
                8491,
                8533
            ],
            [
                8533,
                8685
            ],
            [
                8685,
                8714
            ],
            [
                8714,
                8760
            ],
            [
                8760,
                8813
            ],
            [
                8827,
                8830
            ],
            [
                8830,
                8845
            ],
            [
                8845,
                8862
            ],
            [
                8862,
                8867
            ],
            [
                8901,
                8963
            ],
            [
                8969,
                8987
            ],
            [
                8987,
                9071
            ],
            [
                9071,
                9111
            ],
            [
                9112,
                9150
            ],
            [
                9150,
                9189
            ],
            [
                9189,
                9215
            ],
            [
                9215,
                9292
            ],
            [
                9310,
                9312
            ],
            [
                9312,
                9395
            ],
            [
                9438,
                9441
            ],
            [
                9441,
                9476
            ],
            [
                9481,
                9513
            ],
            [
                9534,
                9536
            ],
            [
                9537,
                9580
            ],
            [
                9729,
                9768
            ],
            [
                9705,
                9719
            ],
            [
                9768,
                9770
            ],
            [
                9827,
                9855
            ],
            [
                9856,
                9867
            ],
            [
                9867,
                9869
            ],
            [
                9869,
                9888
            ],
            [
                9917,
                9968
            ],
            [
                9968,
                10009
            ],
            [
                10054,
                10075
            ],
            [
                10010,
                10027
            ],
            [
                10035,
                10053
            ],
            [
                10075,
                10097
            ],
            [
                10097,
                10131
            ],
            [
                10131,
                10133
            ],
            [
                10139,
                10215
            ],
            [
                10215,
                10234
            ],
            [
                10408,
                10430
            ],
            [
                10463,
                10504
            ],
            [
                10532,
                10533
            ],
            [
                10534,
                10607
            ],
            [
                10607,
                10621
            ],
            [
                10655,
                10691
            ],
            [
                10691,
                10769
            ],
            [
                10771,
                10824
            ],
            [
                10824,
                10967
            ],
            [
                10967,
                11008
            ],
            [
                11082,
                11084
            ],
            [
                11099,
                11178
            ],
            [
                11224,
                11236
            ],
            [
                11220,
                11223
            ],
            [
                11236,
                11238
            ],
            [
                11238,
                11288
            ],
            [
                11288,
                11369
            ],
            [
                11369,
                11466
            ],
            [
                11466,
                11484
            ],
            [
                11498,
                11509
            ],
            [
                11547,
                11549
            ],
            [
                11549,
                11657
            ],
            [
                11665,
                11667
            ],
            [
                11667,
                11725
            ],
            [
                11853,
                11907
            ],
            [
                11907,
                11938
            ],
            [
                11967,
                12005
            ],
            [
                12005,
                12054
            ],
            [
                12078,
                12090
            ],
            [
                12123,
                12124
            ],
            [
                12148,
                12155
            ],
            [
                12170,
                12230
            ],
            [
                12265,
                12286
            ],
            [
                12286,
                12300
            ],
            [
                12300,
                12327
            ],
            [
                12350,
                12351
            ],
            [
                12391,
                12416
            ],
            [
                12416,
                12560
            ],
            [
                12587,
                12589
            ],
            [
                12589,
                12619
            ],
            [
                12634,
                12637
            ],
            [
                12651,
                12704
            ],
            [
                12708,
                12733
            ],
            [
                12733,
                12752
            ],
            [
                12752,
                12763
            ],
            [
                12770,
                12772
            ],
            [
                12772,
                12808
            ],
            [
                12808,
                12812
            ],
            [
                12816,
                12852
            ],
            [
                12879,
                12882
            ],
            [
                12895,
                12944
            ],
            [
                12996,
                13004
            ],
            [
                12964,
                12967
            ],
            [
                13032,
                13104
            ],
            [
                13104,
                13128
            ],
            [
                13143,
                13195
            ],
            [
                13199,
                13224
            ],
            [
                13230,
                13240
            ],
            [
                13240,
                13285
            ],
            [
                13298,
                13402
            ],
            [
                13402,
                13415
            ],
            [
                13423,
                13444
            ],
            [
                13450,
                13538
            ],
            [
                13538,
                13623
            ],
            [
                13654,
                13699
            ],
            [
                13699,
                13768
            ],
            [
                13792,
                13818
            ],
            [
                13819,
                13924
            ],
            [
                13926,
                13971
            ],
            [
                14126,
                14171
            ],
            [
                14173,
                14199
            ],
            [
                14199,
                14234
            ],
            [
                14253,
                14291
            ],
            [
                14293,
                14322
            ],
            [
                14322,
                14433
            ],
            [
                14504,
                14541
            ],
            [
                14541,
                14567
            ],
            [
                14567,
                14596
            ],
            [
                14596,
                14608
            ],
            [
                14621,
                14632
            ],
            [
                14632,
                14639
            ],
            [
                14639,
                14656
            ],
            [
                14656,
                14708
            ],
            [
                14708,
                14715
            ],
            [
                14720,
                14731
            ],
            [
                14745,
                14820
            ],
            [
                14820,
                14865
            ],
            [
                14865,
                14916
            ],
            [
                14999,
                15092
            ],
            [
                15092,
                15103
            ],
            [
                15103,
                15108
            ],
            [
                15108,
                15119
            ],
            [
                15119,
                15156
            ],
            [
                15156,
                15223
            ],
            [
                15235,
                15237
            ],
            [
                15237,
                15241
            ],
            [
                15267,
                15269
            ],
            [
                15271,
                15523
            ],
            [
                15542,
                15593
            ],
            [
                15602,
                15661
            ],
            [
                15661,
                15729
            ],
            [
                15751,
                15810
            ],
            [
                15810,
                15836
            ],
            [
                15836,
                15896
            ],
            [
                15896,
                15962
            ],
            [
                15962,
                15977
            ],
            [
                15977,
                16004
            ],
            [
                16004,
                16009
            ],
            [
                16009,
                16027
            ],
            [
                16027,
                16122
            ],
            [
                16132,
                16281
            ],
            [
                16281,
                16297
            ],
            [
                16297,
                16362
            ],
            [
                16398,
                16428
            ],
            [
                16433,
                16435
            ],
            [
                16467,
                16585
            ],
            [
                16585,
                16620
            ],
            [
                16625,
                16703
            ],
            [
                16703,
                16706
            ],
            [
                16719,
                16790
            ],
            [
                16790,
                16945
            ],
            [
                16945,
                17020
            ],
            [
                17035,
                17050
            ],
            [
                17065,
                17071
            ],
            [
                17094,
                17126
            ],
            [
                17140,
                17147
            ],
            [
                17147,
                17201
            ],
            [
                17201,
                17205
            ],
            [
                17206,
                17258
            ],
            [
                17258,
                17275
            ],
            [
                17275,
                17300
            ],
            [
                17300,
                17320
            ],
            [
                17328,
                17394
            ],
            [
                17394,
                17400
            ],
            [
                17422,
                17427
            ],
            [
                17437,
                17461
            ],
            [
                17461,
                17462
            ],
            [
                17496,
                17539
            ],
            [
                17482,
                17489
            ],
            [
                17571,
                17624
            ],
            [
                17624,
                17645
            ],
            [
                17645,
                17685
            ],
            [
                17685,
                17734
            ],
            [
                17736,
                17755
            ],
            [
                17757,
                17810
            ],
            [
                17810,
                17861
            ],
            [
                17861,
                17900
            ],
            [
                17920,
                17923
            ],
            [
                17933,
                17935
            ],
            [
                17950,
                18013
            ],
            [
                18013,
                18042
            ],
            [
                18042,
                18101
            ],
            [
                18101,
                18112
            ],
            [
                18112,
                18128
            ],
            [
                18151,
                18172
            ],
            [
                18128,
                18148
            ],
            [
                18172,
                18174
            ],
            [
                18206,
                18220
            ],
            [
                18220,
                18258
            ],
            [
                18258,
                18344
            ],
            [
                18344,
                18359
            ],
            [
                18359,
                18389
            ],
            [
                18389,
                18468
            ],
            [
                18468,
                18593
            ],
            [
                18593,
                18605
            ],
            [
                18665,
                18712
            ],
            [
                18712,
                18745
            ],
            [
                18745,
                18778
            ],
            [
                18778,
                18820
            ],
            [
                18820,
                18859
            ],
            [
                18859,
                18898
            ],
            [
                18898,
                18923
            ],
            [
                18926,
                18958
            ],
            [
                18958,
                19012
            ],
            [
                19012,
                19040
            ],
            [
                19040,
                19122
            ],
            [
                19122,
                19132
            ],
            [
                19132,
                19141
            ],
            [
                19141,
                19214
            ],
            [
                19214,
                19225
            ],
            [
                19225,
                19278
            ],
            [
                19284,
                19339
            ],
            [
                19339,
                19426
            ],
            [
                19426,
                19494
            ],
            [
                19514,
                19529
            ],
            [
                19535,
                19537
            ],
            [
                19537,
                19707
            ],
            [
                19717,
                19719
            ],
            [
                19743,
                19812
            ],
            [
                19813,
                19969
            ],
            [
                20025,
                20061
            ],
            [
                20145,
                20183
            ],
            [
                20212,
                20214
            ],
            [
                20291,
                20294
            ],
            [
                20314,
                20325
            ],
            [
                20334,
                20412
            ],
            [
                20412,
                20550
            ],
            [
                20550,
                20786
            ],
            [
                20786,
                20887
            ],
            [
                20887,
                20922
            ],
            [
                20922,
                20957
            ],
            [
                20957,
                20972
            ],
            [
                20999,
                21001
            ],
            [
                21001,
                21023
            ],
            [
                21037,
                21040
            ],
            [
                21040,
                21069
            ],
            [
                21069,
                21070
            ],
            [
                21074,
                21087
            ],
            [
                21087,
                21116
            ],
            [
                21152,
                21263
            ],
            [
                21263,
                21288
            ],
            [
                21300,
                21305
            ],
            [
                21325,
                21347
            ],
            [
                21347,
                21465
            ],
            [
                21465,
                21467
            ],
            [
                21484,
                21503
            ],
            [
                21503,
                21526
            ],
            [
                21526,
                21614
            ],
            [
                21614,
                21662
            ],
            [
                21664,
                21721
            ],
            [
                21758,
                21760
            ],
            [
                21872,
                21888
            ],
            [
                21888,
                21889
            ],
            [
                21890,
                22014
            ],
            [
                22014,
                22047
            ],
            [
                22057,
                22082
            ],
            [
                22082,
                22101
            ],
            [
                22101,
                22117
            ],
            [
                22121,
                22183
            ],
            [
                22221,
                22223
            ],
            [
                22223,
                22226
            ],
            [
                22230,
                22288
            ],
            [
                22288,
                22326
            ],
            [
                22453,
                22461
            ],
            [
                22474,
                22577
            ],
            [
                22577,
                22581
            ],
            [
                22603,
                22672
            ],
            [
                22709,
                22719
            ],
            [
                22719,
                22737
            ],
            [
                22737,
                22751
            ],
            [
                22790,
                22792
            ],
            [
                22792,
                22827
            ],
            [
                22827,
                22909
            ],
            [
                22911,
                22919
            ],
            [
                22934,
                22957
            ],
            [
                22994,
                22996
            ],
            [
                22996,
                23023
            ],
            [
                23023,
                23033
            ],
            [
                23033,
                23062
            ],
            [
                23068,
                23071
            ],
            [
                23071,
                23098
            ],
            [
                23098,
                23102
            ],
            [
                23109,
                23110
            ],
            [
                23115,
                23123
            ],
            [
                23123,
                23169
            ],
            [
                23197,
                23200
            ],
            [
                23200,
                23227
            ],
            [
                23259,
                23357
            ],
            [
                23373,
                23399
            ],
            [
                23428,
                23430
            ],
            [
                23430,
                23488
            ],
            [
                23590,
                23627
            ],
            [
                23673,
                23675
            ],
            [
                23675,
                23678
            ],
            [
                23682,
                23728
            ],
            [
                23730,
                23739
            ],
            [
                23739,
                23839
            ],
            [
                23853,
                23869
            ],
            [
                23869,
                23911
            ],
            [
                23911,
                23926
            ],
            [
                23930,
                23934
            ],
            [
                23937,
                23951
            ],
            [
                23977,
                23979
            ],
            [
                23985,
                24019
            ],
            [
                24019,
                24126
            ],
            [
                24126,
                24165
            ],
            [
                24165,
                24230
            ],
            [
                24230,
                24289
            ],
            [
                24289,
                24373
            ],
            [
                24373,
                24424
            ],
            [
                24424,
                24538
            ],
            [
                24572,
                24575
            ],
            [
                24539,
                24571
            ],
            [
                24611,
                24613
            ],
            [
                24670,
                24681
            ],
            [
                24702,
                24833
            ],
            [
                24857,
                24859
            ],
            [
                24876,
                24886
            ],
            [
                25022,
                25231
            ],
            [
                25231,
                25332
            ],
            [
                25375,
                25377
            ],
            [
                25377,
                25398
            ],
            [
                25398,
                25427
            ],
            [
                25488,
                25489
            ],
            [
                25494,
                25624
            ],
            [
                25685,
                25687
            ],
            [
                25687,
                25756
            ],
            [
                25799,
                25850
            ],
            [
                25852,
                25889
            ],
            [
                25889,
                26003
            ],
            [
                26035,
                26085
            ],
            [
                26085,
                26093
            ],
            [
                26107,
                26108
            ],
            [
                26133,
                26195
            ],
            [
                26195,
                26233
            ],
            [
                26233,
                26270
            ],
            [
                26270,
                26407
            ],
            [
                26407,
                26462
            ],
            [
                26462,
                26583
            ],
            [
                26583,
                26600
            ],
            [
                26600,
                26680
            ],
            [
                26680,
                26744
            ],
            [
                26851,
                26892
            ],
            [
                26892,
                26954
            ],
            [
                26954,
                27084
            ],
            [
                27185,
                27194
            ],
            [
                27281,
                27319
            ],
            [
                27319,
                27407
            ],
            [
                27407,
                27452
            ],
            [
                27473,
                27490
            ],
            [
                27612,
                27613
            ],
            [
                27619,
                27663
            ],
            [
                27663,
                27683
            ],
            [
                27683,
                27727
            ],
            [
                27727,
                27764
            ],
            [
                27764,
                27806
            ],
            [
                27806,
                27882
            ],
            [
                27882,
                27918
            ]
        ],
        "row_chars": [
            [
                0,
                141
            ],
            [
                141,
                344
            ],
            [
                344,
                774
            ],
            [
                774,
                873
            ],
            [
                873,
                974
            ],
            [
                974,
                1118
            ],
            [
                1118,
                1272
            ],
            [
                1272,
                1486
            ],
            [
                1486,
                1709
            ],
            [
                1709,
                1768
            ],
            [
                1768,
                2047
            ],
            [
                2047,
                2063
            ],
            [
                2063,
                2087
            ],
            [
                2087,
                2106
            ],
            [
                2106,
                2138
            ],
            [
                2138,
                2324
            ],
            [
                2324,
                2507
            ],
            [
                2507,
                2592
            ],
            [
                2592,
                2718
            ],
            [
                2718,
                2770
            ],
            [
                2770,
                2813
            ],
            [
                2813,
                2825
            ],
            [
                2825,
                2969
            ],
            [
                2969,
                3010
            ],
            [
                3010,
                3032
            ],
            [
                3032,
                3148
            ],
            [
                3148,
                3154
            ],
            [
                3154,
                3180
            ],
            [
                3180,
                3358
            ],
            [
                3358,
                3452
            ],
            [
                3452,
                3570
            ],
            [
                3570,
                3708
            ],
            [
                3708,
                3775
            ],
            [
                3775,
                3936
            ],
            [
                3936,
                4069
            ],
            [
                4069,
                4218
            ],
            [
                4218,
                4329
            ],
            [
                4329,
                4452
            ],
            [
                4452,
                4571
            ],
            [
                4571,
                4695
            ],
            [
                4695,
                4776
            ],
            [
                4776,
                4886
            ],
            [
                4886,
                5052
            ],
            [
                5052,
                5125
            ],
            [
                5125,
                5213
            ],
            [
                5213,
                5383
            ],
            [
                5383,
                5460
            ],
            [
                5460,
                5507
            ],
            [
                5507,
                5579
            ],
            [
                5579,
                5685
            ],
            [
                5685,
                5706
            ],
            [
                5706,
                5719
            ],
            [
                5719,
                5743
            ],
            [
                5743,
                5771
            ],
            [
                5771,
                5802
            ],
            [
                5802,
                5853
            ],
            [
                5853,
                5958
            ],
            [
                5958,
                6149
            ],
            [
                6149,
                6237
            ],
            [
                6237,
                6265
            ],
            [
                6265,
                6488
            ],
            [
                6488,
                6540
            ],
            [
                6540,
                6624
            ],
            [
                6624,
                6756
            ],
            [
                6756,
                6865
            ],
            [
                6865,
                6977
            ],
            [
                6977,
                6996
            ],
            [
                6996,
                7105
            ],
            [
                7105,
                7180
            ],
            [
                7180,
                7201
            ],
            [
                7201,
                7268
            ],
            [
                7268,
                7281
            ],
            [
                7281,
                7333
            ],
            [
                7333,
                7354
            ],
            [
                7354,
                7436
            ],
            [
                7436,
                7484
            ],
            [
                7484,
                7545
            ],
            [
                7545,
                7571
            ],
            [
                7571,
                7621
            ],
            [
                7621,
                7792
            ],
            [
                7792,
                7798
            ],
            [
                7798,
                8024
            ],
            [
                8024,
                8063
            ],
            [
                8063,
                8298
            ],
            [
                8298,
                8491
            ],
            [
                8491,
                8533
            ],
            [
                8533,
                8685
            ],
            [
                8685,
                8714
            ],
            [
                8714,
                8760
            ],
            [
                8760,
                8830
            ],
            [
                8830,
                8845
            ],
            [
                8845,
                8862
            ],
            [
                8862,
                8987
            ],
            [
                8987,
                9071
            ],
            [
                9071,
                9150
            ],
            [
                9150,
                9189
            ],
            [
                9189,
                9215
            ],
            [
                9215,
                9312
            ],
            [
                9312,
                9441
            ],
            [
                9441,
                9536
            ],
            [
                9536,
                9583
            ],
            [
                9583,
                9617
            ],
            [
                9617,
                9640
            ],
            [
                9640,
                9662
            ],
            [
                9662,
                9770
            ],
            [
                9770,
                9869
            ],
            [
                9869,
                9968
            ],
            [
                9968,
                10097
            ],
            [
                10097,
                10131
            ],
            [
                10131,
                10215
            ],
            [
                10215,
                10236
            ],
            [
                10236,
                10310
            ],
            [
                10310,
                10347
            ],
            [
                10347,
                10408
            ],
            [
                10408,
                10534
            ],
            [
                10534,
                10607
            ],
            [
                10607,
                10691
            ],
            [
                10691,
                10771
            ],
            [
                10771,
                10824
            ],
            [
                10824,
                10967
            ],
            [
                10967,
                11084
            ],
            [
                11084,
                11238
            ],
            [
                11238,
                11288
            ],
            [
                11288,
                11369
            ],
            [
                11369,
                11466
            ],
            [
                11466,
                11549
            ],
            [
                11549,
                11667
            ],
            [
                11667,
                11907
            ],
            [
                11907,
                12005
            ],
            [
                12005,
                12286
            ],
            [
                12286,
                12300
            ],
            [
                12300,
                12327
            ],
            [
                12327,
                12416
            ],
            [
                12416,
                12589
            ],
            [
                12589,
                12708
            ],
            [
                12708,
                12733
            ],
            [
                12733,
                12752
            ],
            [
                12752,
                12772
            ],
            [
                12772,
                12808
            ],
            [
                12808,
                12944
            ],
            [
                12944,
                13104
            ],
            [
                13104,
                13240
            ],
            [
                13240,
                13402
            ],
            [
                13402,
                13538
            ],
            [
                13538,
                13699
            ],
            [
                13699,
                13819
            ],
            [
                13819,
                14199
            ],
            [
                14199,
                14293
            ],
            [
                14293,
                14322
            ],
            [
                14322,
                14541
            ],
            [
                14541,
                14567
            ],
            [
                14567,
                14596
            ],
            [
                14596,
                14632
            ],
            [
                14632,
                14639
            ],
            [
                14639,
                14656
            ],
            [
                14656,
                14708
            ],
            [
                14708,
                14820
            ],
            [
                14820,
                14865
            ],
            [
                14865,
                15092
            ],
            [
                15092,
                15103
            ],
            [
                15103,
                15108
            ],
            [
                15108,
                15119
            ],
            [
                15119,
                15156
            ],
            [
                15156,
                15237
            ],
            [
                15237,
                15661
            ],
            [
                15661,
                15810
            ],
            [
                15810,
                15836
            ],
            [
                15836,
                15896
            ],
            [
                15896,
                15962
            ],
            [
                15962,
                15977
            ],
            [
                15977,
                16004
            ],
            [
                16004,
                16009
            ],
            [
                16009,
                16027
            ],
            [
                16027,
                16281
            ],
            [
                16281,
                16297
            ],
            [
                16297,
                16585
            ],
            [
                16585,
                16703
            ],
            [
                16703,
                16790
            ],
            [
                16790,
                16945
            ],
            [
                16945,
                17147
            ],
            [
                17147,
                17201
            ],
            [
                17201,
                17258
            ],
            [
                17258,
                17275
            ],
            [
                17275,
                17300
            ],
            [
                17300,
                17320
            ],
            [
                17320,
                17394
            ],
            [
                17394,
                17461
            ],
            [
                17461,
                17541
            ],
            [
                17541,
                17571
            ],
            [
                17571,
                17624
            ],
            [
                17624,
                17645
            ],
            [
                17645,
                17685
            ],
            [
                17685,
                17810
            ],
            [
                17810,
                17861
            ],
            [
                17861,
                17900
            ],
            [
                17900,
                18013
            ],
            [
                18013,
                18042
            ],
            [
                18042,
                18101
            ],
            [
                18101,
                18112
            ],
            [
                18112,
                18174
            ],
            [
                18174,
                18206
            ],
            [
                18206,
                18220
            ],
            [
                18220,
                18258
            ],
            [
                18258,
                18344
            ],
            [
                18344,
                18359
            ],
            [
                18359,
                18389
            ],
            [
                18389,
                18468
            ],
            [
                18468,
                18593
            ],
            [
                18593,
                18712
            ],
            [
                18712,
                18745
            ],
            [
                18745,
                18778
            ],
            [
                18778,
                18820
            ],
            [
                18820,
                18859
            ],
            [
                18859,
                18898
            ],
            [
                18898,
                18958
            ],
            [
                18958,
                19012
            ],
            [
                19012,
                19040
            ],
            [
                19040,
                19122
            ],
            [
                19122,
                19132
            ],
            [
                19132,
                19141
            ],
            [
                19141,
                19214
            ],
            [
                19214,
                19225
            ],
            [
                19225,
                19339
            ],
            [
                19339,
                19426
            ],
            [
                19426,
                19537
            ],
            [
                19537,
                19719
            ],
            [
                19719,
                19813
            ],
            [
                19813,
                19969
            ],
            [
                19969,
                20062
            ],
            [
                20062,
                20145
            ],
            [
                20145,
                20214
            ],
            [
                20214,
                20291
            ],
            [
                20291,
                20412
            ],
            [
                20412,
                20550
            ],
            [
                20550,
                20786
            ],
            [
                20786,
                20887
            ],
            [
                20887,
                20922
            ],
            [
                20922,
                20957
            ],
            [
                20957,
                21001
            ],
            [
                21001,
                21040
            ],
            [
                21040,
                21069
            ],
            [
                21069,
                21087
            ],
            [
                21087,
                21263
            ],
            [
                21263,
                21347
            ],
            [
                21347,
                21465
            ],
            [
                21465,
                21503
            ],
            [
                21503,
                21526
            ],
            [
                21526,
                21614
            ],
            [
                21614,
                21760
            ],
            [
                21760,
                21803
            ],
            [
                21803,
                21809
            ],
            [
                21809,
                21843
            ],
            [
                21843,
                21848
            ],
            [
                21848,
                21868
            ],
            [
                21868,
                22014
            ],
            [
                22014,
                22082
            ],
            [
                22082,
                22101
            ],
            [
                22101,
                22223
            ],
            [
                22223,
                22288
            ],
            [
                22288,
                22326
            ],
            [
                22326,
                22365
            ],
            [
                22365,
                22449
            ],
            [
                22449,
                22577
            ],
            [
                22577,
                22719
            ],
            [
                22719,
                22737
            ],
            [
                22737,
                22792
            ],
            [
                22792,
                22827
            ],
            [
                22827,
                22996
            ],
            [
                22996,
                23023
            ],
            [
                23023,
                23033
            ],
            [
                23033,
                23071
            ],
            [
                23071,
                23098
            ],
            [
                23098,
                23123
            ],
            [
                23123,
                23200
            ],
            [
                23200,
                23227
            ],
            [
                23227,
                23235
            ],
            [
                23235,
                23259
            ],
            [
                23259,
                23430
            ],
            [
                23430,
                23675
            ],
            [
                23675,
                23739
            ],
            [
                23739,
                23869
            ],
            [
                23869,
                23911
            ],
            [
                23911,
                23930
            ],
            [
                23930,
                23979
            ],
            [
                23979,
                23985
            ],
            [
                23985,
                24019
            ],
            [
                24019,
                24126
            ],
            [
                24126,
                24165
            ],
            [
                24165,
                24230
            ],
            [
                24230,
                24289
            ],
            [
                24289,
                24373
            ],
            [
                24373,
                24424
            ],
            [
                24424,
                24613
            ],
            [
                24613,
                24670
            ],
            [
                24670,
                24859
            ],
            [
                24859,
                25231
            ],
            [
                25231,
                25377
            ],
            [
                25377,
                25398
            ],
            [
                25398,
                25687
            ],
            [
                25687,
                25889
            ],
            [
                25889,
                26085
            ],
            [
                26085,
                26109
            ],
            [
                26109,
                26133
            ],
            [
                26133,
                26195
            ],
            [
                26195,
                26233
            ],
            [
                26233,
                26270
            ],
            [
                26270,
                26407
            ],
            [
                26407,
                26462
            ],
            [
                26462,
                26583
            ],
            [
                26583,
                26600
            ],
            [
                26600,
                26680
            ],
            [
                26680,
                26892
            ],
            [
                26892,
                26954
            ],
            [
                26954,
                27319
            ],
            [
                27319,
                27407
            ],
            [
                27407,
                27491
            ],
            [
                27491,
                27568
            ],
            [
                27568,
                27612
            ],
            [
                27612,
                27663
            ],
            [
                27663,
                27683
            ],
            [
                27683,
                27727
            ],
            [
                27727,
                27764
            ],
            [
                27764,
                27806
            ],
            [
                27806,
                27882
            ],
            [
                27882,
                27918
            ]
        ]
    },
    "abridged": {
        "text": "It was three o'clock in the morning when London at last began to close us in with streets. We had made our way along roads in a far worse condition than on the previous day; but my companion's energy never slackened. Whenever the horses had stopped exhausted half-way up hills, or had slipped and become entangled with the harness, he and his little lantern had been always ready, and when the mishap was set right, he said the same cool, \"Get on, my lads!\"\nI could not account for his confidence on our journey back. He never even stopped to make an inquiry until we were within a few miles of London. Thus we came, between three and four o'clock in the morning, into Islington.\nI will not dwell on the anxiety with which I reflected that we were leaving my mother farther and farther behind every minute. I hoped that he must be right in following this woman, but I tormented myself with questioning it during the whole journey. I wondered what was to compensate us for this loss of time; my mind was quite tortured by dwelling on such reflections.\nWe stopped in a high-street by a coach-stand. My companion paid our two drivers, and giving them some brief directions about the carriage, lifted me out of it and into a hackney-coach.\n\"Why, my dear!\" he said. \"How wet you are!\"\nI had not been conscious of it. But the melted snow had found its way into the carriage, and I had got out two or three times when a fallen horse was plunging and had to be got up, and the wet had penetrated my dress. I assured him it was no matter, but the driver ran down the street to his stable to fetch an armful of clean dry straw. They strewed it well about me, and I found it warm and comfortable.\n\"Now, my dear,\" said Mr. Bucket, with his head in at the window, \"We're a-going to mark this person down. It may take a little time, but you don't mind that. You're pretty sure that I've got a reason. Ain't you?\"\nI assured him that I had confidence in him.\n\"So you may have, my dear,\" he returned. \"Lord! You're no trouble at all. I never see a young woman conduct herself like you have. You're a pattern, you know, that's what you are,\" said Mr. Bucket warmly.\nI told him I was very glad to have been no hindrance to him.\n\"My dear,\" he returned, \"when a young lady is as mild as she's game, and as game as she's mild, that's all I ask, and more than I expect. She then becomes a queen, and that's about what you are yourself.\"\nWith these encouraging words he got upon the box, and we once more drove away. Where we drove I did not know, but we appeared to seek out the narrowest and worst streets in London.\nSometimes we emerged upon a wider thoroughfare or came to a larger, well-lit building. Then we stopped at police offices, and I saw him in consultation with others. Sometimes he would get down by an archway or at a street corner and mysteriously show the light of his little lantern. This would attract similar lights from various dark quarters, like so many insects, and a fresh consultation would be held. By degrees we appeared to contract our search within narrower limits. At last we stopped for a rather long conversation with a single police officer, which I supposed to be satisfactory from Mr. Bucket's manner of nodding. When it was finished he came to me looking very busy.\n\"Now, Miss Summerson,\" he said to me, \"you won't be alarmed whatever happens, I know. We have marked this person down, and you may be of use to me. Would you walk a little way?\"\nOf course I got out directly and took his arm.\n\"It ain't so easy to keep your feet,\" said Mr. Bucket, \"but take time.\"\n\"Are we in Holborn?\" I asked him, as we crossed the street.\n\"Yes. Do you know this turning?\"\n\"It looks like Chancery Lane.\"\n\"So it is, my dear,\" said Mr. Bucket.\nWe turned down it, and as we went shuffling through the sleet, I heard the clocks strike half-past five. We passed on as quickly as we could, when someone coming towards us on the narrow pavement, wrapped in a cloak, stopped and stood aside to give me room. I heard an exclamation of wonder and my own name; it was Mr. Woodcourt.\nIt was so unexpected and so - I don't know what to call it, whether pleasant or painful - after my feverish wandering journey, and in the midst of the night, that I could not keep back the tears from my eyes. It was like hearing his voice in a strange country.\n\"My dear Miss Summerson, that you should be out at this hour, and in such weather!\"\nHe had heard from my guardian of my having been called away on some uncommon business. I told him that we had just left a coach and were going - I looked at my companion.\n\"Why, you see, Mr. Woodcourt\" - he had caught the name from me - \"we are a-going into the next street. Inspector Bucket.\"\nMr. Woodcourt had hurriedly taken off his cloak and was putting it about me.\n\"That's a good move,\" said Mr. Bucket, assisting him.\n\"May I go with you?\" said Mr. Woodcourt, I don't know whether to me or to my companion.\n\"Why, Lord!\" exclaimed Mr. Bucket. \"Of course you may.\"\nThey took me between them, wrapped in the cloak.\n\"I have just left Richard,\" said Mr. Woodcourt. \"I have been sitting with him since ten o'clock last night.\"\n\"Oh, dear me, he is ill!\"\n\"No, no; not ill, but not quite well. He was depressed and faint - you know he gets so worried and so worn sometimes - and Ada sent word to me. Well! Richard revived so much after a little while, and Ada was so happy and so convinced of its being my doing, though God knows I had little enough to do with it, that I remained with him until he had been fast asleep some hours. As fast asleep as she is now, I hope!\"\nHis friendly and familiar way of speaking of them, his unaffected devotion to them, and the comfort he was to my darling; could I separate all this from his promise to me? I recalled the words he said to me when he was so moved by the change in my appearance: \"I will accept him as a sacred trust!\"\nWe now turned into another narrow street. \"Mr. Woodcourt,\" said Mr. Bucket, who had eyed him closely as we came along, \"our business takes us to a law-stationer's here, a certain Mr. Snagsby's. What, you know him, do you?\" He was so quick that he saw it in an instant.\n\"Yes, I know a little of him and have called upon him here.\"\n\"Indeed, sir?\" said Mr. Bucket. \"Then may I leave Miss Summerson with you for a moment while I go and have a word with him?\"\nThe last police-officer with whom he had conferred was standing silently behind us. I was not aware of it until he struck in, on my saying I heard some one crying.\n\"Don't be alarmed, miss,\" he returned. \"It's Snagsby's servant.\"\n\"Why, you see,\" said Mr. Bucket, \"the girl's subject to fits, and has 'em bad tonight. A most contrary circumstance it is, for I want certain information out of that girl.\"\n\"At all events, they wouldn't be up if it wasn't for her, Mr. Bucket. She's been at it pretty well all night, sir,\" said the other man.\nI could faintly hear crying and moaning from the house. Mr. Bucket went up to the door with his lantern and knocked twice. The door was opened and he went in, leaving us standing in the street.\n\"Miss Summerson,\" said Mr. Woodcourt, \"if I may remain near you without obtruding on your confidence, pray let me do so.\"\n\"You are truly kind,\" I answered. \"I wish to keep no secret of my own from you; if I keep any, it is another's.\"\n\"I quite understand.\"\nAfter a short time the door opened again, and Mr. Bucket advanced towards us.\n\"Please to come in, Miss Summerson,\" he said, \"and sit down by the fire. Mr. Woodcourt, I understand you are a medical man. Would you look to this girl and see if anything can be done to bring her round? She has a letter somewhere that I particularly want. It's not in her box, and I think it must be about her; but she is so twisted and clenched up that she is difficult to handle without hurting.\"\nWe all three went into the house together. Behind the door stood a scared, sorrowful-looking little man in a grey coat who spoke meekly and politely.\n\"Downstairs, if you please, Mr. Bucket,\" said he. \"The lady will excuse the front kitchen; we use it as our workaday sitting-room. The back is Guster's bedroom, and in it she's a-carrying on, poor thing, to a frightful extent!\"\nWe went downstairs with Mr. Snagsby. In the front kitchen, sitting by the fire, was Mrs. Snagsby, with very red eyes and a very severe expression.\n\"My little woman,\" said Mr. Snagsby, entering behind us, \"here is Inspector Bucket, Mr. Woodcourt, and a lady.\"\nShe looked very much astonished, and looked particularly hard at me.\n\"My little woman,\" said Mr. Snagsby, sitting down by the door, \"you may ask why Inspector Bucket, Mr. Woodcourt, and a lady call upon us at the present hour. I don't know. I have not the least idea. In fact, I'd rather not be told.\"\nHe appeared so miserable, sitting with his head upon his hand, and I appeared so unwelcome, that I was going to offer an apology when Mr. Bucket spoke.\n\"Now, Mr. Snagsby,\" said he, \"you go along with Mr. Woodcourt to look after your Guster-\"\n\"My Guster, Mr. Bucket!\" cried Mr. Snagsby. \"Go on, sir. I shall be charged with that next.\"\n\"And hold the candle,\" pursued Mr. Bucket, \"or make yourself useful in any way you're asked. You're a humane man, you know, and you've got the sort of heart that can feel for another. Mr. Woodcourt, would you kindly see to her, and if you can get that letter from her, let me have it as soon as you can?\"\nAs they went out, Mr. Bucket made me sit down by the fire and take off my wet shoes, which he turned up to dry upon the fender, talking all the time.\n\"Don't you be put out, miss, by the lack of a hospitable look from Mrs. Snagsby there, because she's under a mistake altogether. She'll find that out sooner than will be agreeable to a lady of her generally correct thinking, because I'm a-going to explain it to her.\" Here, standing on the hearth with his wet hat and shawls in his hand, he turned to Mrs. Snagsby.\n\"Now, the first thing that I say to you, as a married woman possessing what you may call charms, you know - 'Believe Me, if All Those Endearing,' and cetra - charms that ought to give you confidence in yourself - is, that you've done it.\"\nMrs. Snagsby looked rather alarmed, and faltered, what did Mr. Bucket mean?\n\"What does Mr. Bucket mean?\" he repeated, and I saw by his face that all the time he talked he was listening for the discovery of the letter. \"I'll tell you what he means, ma'am. Go and see Othello acted. That's the tragedy for you.\"\nMrs. Snagsby asked why.\n\"Why?\" said Mr. Bucket. \"Because you'll come to that if you don't look out. Why, at this very moment, I know what your mind's not wholly free from respecting this young lady. But shall I tell you who this young lady is? Now, come, you're what I call an intellectual woman. You know me, and you recollect where you saw me last, and what was talked of in that circle. Don't you? Yes! Very well. This young lady is that young lady.\"\nMrs. Snagsby appeared to understand the reference better than I did.\n\"And the boy Jo was mixed up in the same business, and no other; and the law-writer that you know of was mixed up in the same business, and no other; and your husband, with no more knowledge of it than your great grandfather, was mixed up (by Mr. Tulkinghorn, deceased) in the same business, and no other; and the whole throng of people was mixed up in the same business, and no other. And yet a married woman, possessing your attractions, shuts her eyes and goes and runs her delicate-formed head against a wall. Why, I am ashamed of you! (I expected Mr. Woodcourt might have got it by this time.)\"\nMrs. Snagsby shook her head and put her handkerchief to her eyes.\n\"Is that all?\" said Mr. Bucket excitedly. \"No. See what happens. Another person mixed up in that business and no other, a person in a wretched state, comes here tonight and is seen a-speaking to your maid-servant; and between her and your maid-servant there passes a paper that I would give a hundred pound for, down. What do you do? You hide and you watch 'em, and you pounce upon that maid-servant - knowing what a little thing will bring on her fits - with that severity that, by the Lord, she goes off and keeps off, when a life may be hanging upon that girl's words!\"\nHe so thoroughly meant what he said that I involuntarily clasped my hands and felt the room turning away from me. But then Mr. Woodcourt came in, put a paper into his hand, and went away again.\n\"Now, Mrs. Snagsby, the only amends you can make,\" said Mr. Bucket, rapidly glancing at it, \"is to let me speak a word to this young lady in private here. And if you know of any help that you can give to that gentleman in the next room or can think of anything that's likely to bring the girl round, do your best!\" In an instant she was gone, and he had shut the door. \"Now, my dear, you're steady and quite sure of yourself?\"\n\"Quite,\" said I.\n\"Whose writing is that?\"\nIt was my mother's. Pencil-writing, on a crushed and torn piece of paper, blotted with wet. Folded, and addressed to me at my guardian's.\n\"If you are firm enough to read it to me, do!\" he said.\nIt had been written in portions, at different times. I read what follows:\nI came to the cottage with two objects. First, to see the dear one, if I could, once more - but only to see her - not to speak to her or let her know that I was near. The other object, to elude pursuit and to be lost. Do not blame the mother for her share. She helped me on my strongest assurance that it was for the dear one's good. You remember her dead child. The men's consent I bought, but her help was freely given.\n\"'I came.' That was written when she rested there,\" said my companion. \"I was right.\"\nThe next was written at another time:\nI have wandered a long distance, and for many hours, and I know that I must soon die. These streets! I have no purpose but to die. When I left, I had a worse, but I am saved from adding that guilt to the rest. Cold, wet, and fatigue are sufficient causes for my being found dead, but I shall die of others, though I suffer from these. It was right that I should die of terror and my conscience.\n\"Take courage,\" said Mr. Bucket. \"There's only a few words more.\"\nThose, too, were written at another time. To all appearance, almost in the dark:\nI have done all I could do to be lost. I shall be soon forgotten thus, and shall disgrace him least. I have nothing about me by which I can be recognized. This paper I part with now. The place where I shall lie down, if I can get so far, has been often in my mind. Farewell. Forgive.\nMr. Bucket, supporting me with his arm, lowered me gently into my chair. \"Cheer up! Don't think me hard with you, my dear, but as soon as you feel equal to it, get your shoes on and be ready.\"\nI did as he required, but I was left there a long time, praying for my unhappy mother. They were all occupied with the poor girl, and I heard Mr. Woodcourt speaking to her. At length he came in with Mr. Bucket and said that as it was important to address her gently, he thought it best that I should ask her for whatever information we desired. She could now reply to questions if she were soothed and not alarmed.\nThe questions, Mr. Bucket said, were how she came by the letter, what passed between her and the person who gave her the letter, and where the person went. I went into the next room with them.\nThe poor girl was sitting on the floor. She looked weak, but she had a plaintive and a good face, though it was still a little wild. I kneeled on the ground beside her and put her poor head upon my shoulder, whereupon she drew her arm round my neck and burst into tears.\n\"My poor girl,\" said I, laying my face against her forehead, for indeed I was crying too, and trembling, \"it seems cruel to trouble you now, but more depends on our knowing something about this letter than I could tell you in an hour.\"\nShe began piteously declaring that she didn't mean any harm, she didn't mean any harm, Mrs. Snagsby!\n\"We are all sure of that,\" said I. \"But pray tell me how you got it.\"\n\"Yes, dear lady. I'll tell true, indeed.\"\n\"I am sure of that,\" said I. \"How was it?\"\n\"I had been out on an errand, quite late; and when I came home, I found a common-looking person, all wet and muddy, looking up at our house. When she saw me coming in, she said did I live here. And I said yes, and she said she knew only one or two places about here, but had lost her way and couldn't find them. Oh, what shall I do! They won't believe me! She didn't say any harm to me, and I didn't say any harm to her, indeed, Mrs. Snagsby!\"\nIt was necessary for her mistress to comfort her - which she did, I must say, with a good deal of contrition.\n\"She was so faint,\" cried the girl, \"and lame, and miserable, oh so wretched, that if you had seen her, Mr. Snagsby, you'd have given her half a crown, I know!\"\n\"Well, Guster, my girl,\" said he, not knowing what to say. \"I hope I should.\"\n\"And yet she was well spoken,\" said the girl, looking at me with wide open eyes. \"And she said to me, did I know the way to the burying ground? And I asked her which burying ground. And she said, the poor burying ground not very far from here, where there was an archway, and a step, and an iron gate.\"\nAs I soothed her to go on, I saw that Mr. Bucket received this with a look of alarm.\n\"Oh, dear, dear!\" cried the girl. \"What shall I do, what shall I do! She meant the burying ground where the man was buried that took the sleeping-stuff - that you told us of, Mr. Snagsby. Oh, I am frightened again. Hold me!\"\n\"You are so much better now,\" said I. \"Pray, pray tell me more.\"\n\"Yes, I will! But don't be angry with me, that's a dear lady.\"\nAngry with her, poor soul!\n\"So she said, could I tell her how to find it, and I said yes, and I told her; and she looked at me almost as if she was blind. And so she took out the letter, and showed it me, and said would I take it from her, and send it. And I said yes, if it was no harm, and she said no - no harm. And so I took it from her, and she said she had nothing to give me, and I said I was poor myself and wanted nothing. And so she said God bless you, and went.\"\n\"And did she go-\"\n\"Yes!\" cried the girl. \"She went the way I had shown her. Then I came in, and Mrs. Snagsby came behind me from somewhere and laid hold of me, and I was frightened.\"\nMr. Woodcourt took her kindly from me. Mr. Bucket wrapped me up, and immediately we were in the street. Mr. Woodcourt hesitated, but I said, \"Don't leave me now!\" and Mr. Bucket added, \"You'll be better with us, we may want you; don't lose time!\"\nI have the most confused impressions of that walk. I recollect that it was neither night nor day, that morning was dawning but the street-lamps were not yet put out, and that the sleet was still falling. I recollect the clogged and bursting gutters and water-spouts, the mounds of blackened ice and snow over which we passed, the narrowness of the streets. I remember the stained house-fronts put on human shapes and looked at me, that great water-gates seemed to be opening and closing in my head or in the air, and that the unreal things were more substantial than the real.\nAt last we stood under a dark and miserable covered way, where one lamp was burning over an iron gate. The gate was closed. Beyond it was a burial ground, where I could dimly see heaps of dishonoured graves and stones, hemmed in by filthy houses with a few dull lights in their windows. On the step at the gate, drenched in the fearful wet of such a place, I saw, with a cry of pity and horror, a woman lying - Jenny, the mother of the dead child.\nI ran forward, but they stopped me, and Mr. Woodcourt entreated me with the greatest earnestness, even with tears, to listen for an instant to what Mr. Bucket said. I did so.\n\"Miss Summerson, you'll understand me, if you think a moment. They changed clothes at the cottage.\"\nThey changed clothes at the cottage. I could repeat the words in my mind, and I knew what they meant of themselves, but I attached no meaning to them in any other connexion.\n\"And one returned,\" said Mr. Bucket, \"and one went on. And the one that went on only went on a certain way agreed upon to deceive and then turned across country and went home. Think a moment!\"\nI could repeat this in my mind too, but I had not the least idea what it meant. I saw before me, lying on the step, the mother of the dead child, who had so lately spoken to my mother. She lay there, a distressed, unsheltered, senseless creature. She who had brought my mother's letter, who could give me the only clue to where my mother was; she, who was to guide us to rescue my mother; she lay there, and they stopped me! I saw but did not comprehend the solemn and compassionate look in Mr. Woodcourt's face. I saw but did not comprehend his touching the inspector to keep him back.\nI heard it said between them, \"Shall she go?\"\n\"She had better go. Her hands should be the first to touch her. They have a higher right than ours.\"\nI passed on to the gate and stooped down. I lifted the heavy head, put the long dank hair aside, and turned the face. And it was my mother, cold and dead.",
        "paragraph_chars": [
            [
                0,
                458
            ],
            [
                458,
                680
            ],
            [
                680,
                1051
            ],
            [
                1051,
                1236
            ],
            [
                1236,
                1280
            ],
            [
                1280,
                1686
            ],
            [
                1686,
                1899
            ],
            [
                1899,
                1943
            ],
            [
                1943,
                2148
            ],
            [
                2148,
                2209
            ],
            [
                2209,
                2414
            ],
            [
                2414,
                2595
            ],
            [
                2595,
                3280
            ],
            [
                3280,
                3458
            ],
            [
                3458,
                3505
            ],
            [
                3505,
                3577
            ],
            [
                3577,
                3637
            ],
            [
                3637,
                3670
            ],
            [
                3670,
                3701
            ],
            [
                3701,
                3739
            ],
            [
                3739,
                4069
            ],
            [
                4069,
                4330
            ],
            [
                4330,
                4414
            ],
            [
                4414,
                4585
            ],
            [
                4585,
                4707
            ],
            [
                4707,
                4784
            ],
            [
                4784,
                4838
            ],
            [
                4838,
                4926
            ],
            [
                4926,
                4982
            ],
            [
                4982,
                5031
            ],
            [
                5031,
                5140
            ],
            [
                5140,
                5166
            ],
            [
                5166,
                5581
            ],
            [
                5581,
                5880
            ],
            [
                5880,
                6149
            ],
            [
                6149,
                6210
            ],
            [
                6210,
                6335
            ],
            [
                6335,
                6499
            ],
            [
                6499,
                6564
            ],
            [
                6564,
                6737
            ],
            [
                6737,
                6873
            ],
            [
                6873,
                7067
            ],
            [
                7067,
                7189
            ],
            [
                7189,
                7302
            ],
            [
                7302,
                7324
            ],
            [
                7324,
                7402
            ],
            [
                7402,
                7802
            ],
            [
                7802,
                7952
            ],
            [
                7952,
                8180
            ],
            [
                8180,
                8327
            ],
            [
                8327,
                8439
            ],
            [
                8439,
                8508
            ],
            [
                8508,
                8741
            ],
            [
                8741,
                8893
            ],
            [
                8893,
                8983
            ],
            [
                8983,
                9076
            ],
            [
                9076,
                9381
            ],
            [
                9381,
                9531
            ],
            [
                9531,
                9896
            ],
            [
                9896,
                10135
            ],
            [
                10135,
                10211
            ],
            [
                10211,
                10445
            ],
            [
                10445,
                10469
            ],
            [
                10469,
                10899
            ],
            [
                10899,
                10968
            ],
            [
                10968,
                11568
            ],
            [
                11568,
                11634
            ],
            [
                11634,
                12207
            ],
            [
                12207,
                12401
            ],
            [
                12401,
                12828
            ],
            [
                12828,
                12845
            ],
            [
                12845,
                12870
            ],
            [
                12870,
                13008
            ],
            [
                13008,
                13064
            ],
            [
                13064,
                13138
            ],
            [
                13138,
                13560
            ],
            [
                13560,
                13646
            ],
            [
                13646,
                13684
            ],
            [
                13684,
                14079
            ],
            [
                14079,
                14145
            ],
            [
                14145,
                14226
            ],
            [
                14226,
                14510
            ],
            [
                14510,
                14703
            ],
            [
                14703,
                15118
            ],
            [
                15118,
                15311
            ],
            [
                15311,
                15582
            ],
            [
                15582,
                15818
            ],
            [
                15818,
                15919
            ],
            [
                15919,
                15989
            ],
            [
                15989,
                16031
            ],
            [
                16031,
                16074
            ],
            [
                16074,
                16518
            ],
            [
                16518,
                16628
            ],
            [
                16628,
                16789
            ],
            [
                16789,
                16867
            ],
            [
                16867,
                17170
            ],
            [
                17170,
                17255
            ],
            [
                17255,
                17480
            ],
            [
                17480,
                17545
            ],
            [
                17545,
                17608
            ],
            [
                17608,
                17635
            ],
            [
                17635,
                18082
            ],
            [
                18082,
                18100
            ],
            [
                18100,
                18265
            ],
            [
                18265,
                18512
            ],
            [
                18512,
                19089
            ],
            [
                19089,
                19537
            ],
            [
                19537,
                19712
            ],
            [
                19712,
                19812
            ],
            [
                19812,
                19986
            ],
            [
                19986,
                20179
            ],
            [
                20179,
                20766
            ],
            [
                20766,
                20812
            ],
            [
                20812,
                20913
            ],
            [
                20913,
                21067
            ]
        ],
        "segment_chars": [
            [
                0,
                91
            ],
            [
                91,
                217
            ],
            [
                217,
                458
            ],
            [
                458,
                518
            ],
            [
                518,
                603
            ],
            [
                603,
                680
            ],
            [
                680,
                807
            ],
            [
                807,
                931
            ],
            [
                931,
                1051
            ],
            [
                1051,
                1097
            ],
            [
                1097,
                1236
            ],
            [
                1236,
                1252
            ],
            [
                1252,
                1261
            ],
            [
                1261,
                1280
            ],
            [
                1280,
                1312
            ],
            [
                1312,
                1498
            ],
            [
                1498,
                1618
            ],
            [
                1618,
                1686
            ],
            [
                1686,
                1792
            ],
            [
                1792,
                1844
            ],
            [
                1844,
                1887
            ],
            [
                1887,
                1899
            ],
            [
                1899,
                1943
            ],
            [
                1943,
                1984
            ],
            [
                1984,
                1991
            ],
            [
                1991,
                2017
            ],
            [
                2017,
                2074
            ],
            [
                2074,
                2148
            ],
            [
                2148,
                2209
            ],
            [
                2209,
                2347
            ],
            [
                2347,
                2414
            ],
            [
                2414,
                2493
            ],
            [
                2493,
                2595
            ],
            [
                2595,
                2682
            ],
            [
                2682,
                2760
            ],
            [
                2760,
                2879
            ],
            [
                2879,
                3003
            ],
            [
                3003,
                3073
            ],
            [
                3073,
                3226
            ],
            [
                3226,
                3280
            ],
            [
                3280,
                3366
            ],
            [
                3366,
                3428
            ],
            [
                3428,
                3458
            ],
            [
                3458,
                3505
            ],
            [
                3505,
                3577
            ],
            [
                3577,
                3598
            ],
            [
                3598,
                3637
            ],
            [
                3637,
                3643
            ],
            [
                3643,
                3670
            ],
            [
                3670,
                3701
            ],
            [
                3701,
                3739
            ],
            [
                3739,
                3844
            ],
            [
                3844,
                3997
            ],
            [
                3997,
                4069
            ],
            [
                4069,
                4278
            ],
            [
                4278,
                4330
            ],
            [
                4330,
                4414
            ],
            [
                4414,
                4501
            ],
            [
                4501,
                4585
            ],
            [
                4585,
                4688
            ],
            [
                4688,
                4707
            ],
            [
                4707,
                4784
            ],
            [
                4784,
                4838
            ],
            [
                4838,
                4859
            ],
            [
                4859,
                4926
            ],
            [
                4926,
                4939
            ],
            [
                4939,
                4961
            ],
            [
                4961,
                4982
            ],
            [
                4982,
                5031
            ],
            [
                5031,
                5079
            ],
            [
                5079,
                5140
            ],
            [
                5140,
                5166
            ],
            [
                5166,
                5204
            ],
            [
                5204,
                5310
            ],
            [
                5310,
                5316
            ],
            [
                5316,
                5542
            ],
            [
                5542,
                5581
            ],
            [
                5581,
                5753
            ],
            [
                5753,
                5880
            ],
            [
                5880,
                5922
            ],
            [
                5922,
                6074
            ],
            [
                6074,
                6103
            ],
            [
                6103,
                6149
            ],
            [
                6149,
                6210
            ],
            [
                6210,
                6225
            ],
            [
                6225,
                6242
            ],
            [
                6242,
                6335
            ],
            [
                6335,
                6419
            ],
            [
                6419,
                6499
            ],
            [
                6499,
                6538
            ],
            [
                6538,
                6564
            ],
            [
                6564,
                6651
            ],
            [
                6651,
                6737
            ],
            [
                6737,
                6807
            ],
            [
                6807,
                6873
            ],
            [
                6873,
                6929
            ],
            [
                6929,
                6996
            ],
            [
                6996,
                7067
            ],
            [
                7067,
                7189
            ],
            [
                7189,
                7223
            ],
            [
                7223,
                7302
            ],
            [
                7302,
                7324
            ],
            [
                7324,
                7402
            ],
            [
                7402,
                7475
            ],
            [
                7475,
                7526
            ],
            [
                7526,
                7606
            ],
            [
                7606,
                7659
            ],
            [
                7659,
                7802
            ],
            [
                7802,
                7845
            ],
            [
                7845,
                7952
            ],
            [
                7952,
                8002
            ],
            [
                8002,
                8083
            ],
            [
                8083,
                8180
            ],
            [
                8180,
                8217
            ],
            [
                8217,
                8327
            ],
            [
                8327,
                8439
            ],
            [
                8439,
                8508
            ],
            [
                8508,
                8666
            ],
            [
                8666,
                8680
            ],
            [
                8680,
                8707
            ],
            [
                8707,
                8741
            ],
            [
                8741,
                8893
            ],
            [
                8893,
                8983
            ],
            [
                8983,
                9008
            ],
            [
                9008,
                9027
            ],
            [
                9027,
                9040
            ],
            [
                9040,
                9076
            ],
            [
                9076,
                9169
            ],
            [
                9169,
                9260
            ],
            [
                9260,
                9381
            ],
            [
                9381,
                9531
            ],
            [
                9531,
                9660
            ],
            [
                9660,
                9799
            ],
            [
                9799,
                9896
            ],
            [
                9896,
                10135
            ],
            [
                10135,
                10211
            ],
            [
                10211,
                10240
            ],
            [
                10240,
                10353
            ],
            [
                10353,
                10390
            ],
            [
                10390,
                10416
            ],
            [
                10416,
                10445
            ],
            [
                10445,
                10469
            ],
            [
                10469,
                10476
            ],
            [
                10476,
                10493
            ],
            [
                10493,
                10545
            ],
            [
                10545,
                10644
            ],
            [
                10644,
                10689
            ],
            [
                10689,
                10742
            ],
            [
                10742,
                10835
            ],
            [
                10835,
                10846
            ],
            [
                10846,
                10851
            ],
            [
                10851,
                10862
            ],
            [
                10862,
                10899
            ],
            [
                10899,
                10968
            ],
            [
                10968,
                11354
            ],
            [
                11354,
                11482
            ],
            [
                11482,
                11508
            ],
            [
                11508,
                11568
            ],
            [
                11568,
                11634
            ],
            [
                11634,
                11649
            ],
            [
                11649,
                11676
            ],
            [
                11676,
                11681
            ],
            [
                11681,
                11699
            ],
            [
                11699,
                11952
            ],
            [
                11952,
                11968
            ],
            [
                11968,
                12207
            ],
            [
                12207,
                12321
            ],
            [
                12321,
                12401
            ],
            [
                12401,
                12556
            ],
            [
                12556,
                12716
            ],
            [
                12716,
                12770
            ],
            [
                12770,
                12828
            ],
            [
                12828,
                12845
            ],
            [
                12845,
                12870
            ],
            [
                12870,
                12890
            ],
            [
                12890,
                12962
            ],
            [
                12962,
                13008
            ],
            [
                13008,
                13055
            ],
            [
                13055,
                13064
            ],
            [
                13064,
                13117
            ],
            [
                13117,
                13138
            ],
            [
                13138,
                13178
            ],
            [
                13178,
                13305
            ],
            [
                13305,
                13356
            ],
            [
                13356,
                13395
            ],
            [
                13395,
                13472
            ],
            [
                13472,
                13501
            ],
            [
                13501,
                13560
            ],
            [
                13560,
                13571
            ],
            [
                13571,
                13631
            ],
            [
                13631,
                13646
            ],
            [
                13646,
                13684
            ],
            [
                13684,
                13770
            ],
            [
                13770,
                13785
            ],
            [
                13785,
                13815
            ],
            [
                13815,
                13894
            ],
            [
                13894,
                14019
            ],
            [
                14019,
                14079
            ],
            [
                14079,
                14112
            ],
            [
                14112,
                14145
            ],
            [
                14145,
                14187
            ],
            [
                14187,
                14226
            ],
            [
                14226,
                14265
            ],
            [
                14265,
                14327
            ],
            [
                14327,
                14381
            ],
            [
                14381,
                14409
            ],
            [
                14409,
                14491
            ],
            [
                14491,
                14501
            ],
            [
                14501,
                14510
            ],
            [
                14510,
                14583
            ],
            [
                14583,
                14594
            ],
            [
                14594,
                14703
            ],
            [
                14703,
                14790
            ],
            [
                14790,
                14876
            ],
            [
                14876,
                15048
            ],
            [
                15048,
                15118
            ],
            [
                15118,
                15274
            ],
            [
                15274,
                15311
            ],
            [
                15311,
                15351
            ],
            [
                15351,
                15444
            ],
            [
                15444,
                15582
            ],
            [
                15582,
                15818
            ],
            [
                15818,
                15919
            ],
            [
                15919,
                15954
            ],
            [
                15954,
                15989
            ],
            [
                15989,
                16006
            ],
            [
                16006,
                16031
            ],
            [
                16031,
                16060
            ],
            [
                16060,
                16074
            ],
            [
                16074,
                16215
            ],
            [
                16215,
                16268
            ],
            [
                16268,
                16386
            ],
            [
                16386,
                16407
            ],
            [
                16407,
                16430
            ],
            [
                16430,
                16518
            ],
            [
                16518,
                16628
            ],
            [
                16628,
                16789
            ],
            [
                16789,
                16848
            ],
            [
                16848,
                16867
            ],
            [
                16867,
                16948
            ],
            [
                16948,
                17011
            ],
            [
                17011,
                17049
            ],
            [
                17049,
                17170
            ],
            [
                17170,
                17255
            ],
            [
                17255,
                17273
            ],
            [
                17273,
                17289
            ],
            [
                17289,
                17324
            ],
            [
                17324,
                17443
            ],
            [
                17443,
                17470
            ],
            [
                17470,
                17480
            ],
            [
                17480,
                17518
            ],
            [
                17518,
                17545
            ],
            [
                17545,
                17559
            ],
            [
                17559,
                17608
            ],
            [
                17608,
                17635
            ],
            [
                17635,
                17763
            ],
            [
                17763,
                17861
            ],
            [
                17861,
                17923
            ],
            [
                17923,
                18040
            ],
            [
                18040,
                18082
            ],
            [
                18082,
                18100
            ],
            [
                18100,
                18107
            ],
            [
                18107,
                18123
            ],
            [
                18123,
                18158
            ],
            [
                18158,
                18265
            ],
            [
                18265,
                18304
            ],
            [
                18304,
                18369
            ],
            [
                18369,
                18428
            ],
            [
                18428,
                18512
            ],
            [
                18512,
                18563
            ],
            [
                18563,
                18716
            ],
            [
                18716,
                18869
            ],
            [
                18869,
                19089
            ],
            [
                19089,
                19192
            ],
            [
                19192,
                19213
            ],
            [
                19213,
                19376
            ],
            [
                19376,
                19537
            ],
            [
                19537,
                19702
            ],
            [
                19702,
                19712
            ],
            [
                19712,
                19774
            ],
            [
                19774,
                19812
            ],
            [
                19812,
                19849
            ],
            [
                19849,
                19986
            ],
            [
                19986,
                20041
            ],
            [
                20041,
                20162
            ],
            [
                20162,
                20179
            ],
            [
                20179,
                20259
            ],
            [
                20259,
                20364
            ],
            [
                20364,
                20426
            ],
            [
                20426,
                20604
            ],
            [
                20604,
                20692
            ],
            [
                20692,
                20766
            ],
            [
                20766,
                20812
            ],
            [
                20812,
                20832
            ],
            [
                20832,
                20876
            ],
            [
                20876,
                20913
            ],
            [
                20913,
                20955
            ],
            [
                20955,
                21031
            ],
            [
                21031,
                21067
            ]
        ],
        "overlap_chars": [
            [
                0,
                40
            ],
            [
                41,
                47
            ],
            [
                48,
                55
            ],
            [
                62,
                91
            ],
            [
                91,
                152
            ],
            [
                156,
                159
            ],
            [
                172,
                177
            ],
            [
                178,
                190
            ],
            [
                193,
                199
            ],
            [
                200,
                217
            ],
            [
                220,
                225
            ],
            [
                226,
                236
            ],
            [
                237,
                277
            ],
            [
                281,
                292
            ],
            [
                293,
                330
            ],
            [
                330,
                331
            ],
            [
                332,
                415
            ],
            [
                433,
                458
            ],
            [
                458,
                481
            ],
            [
                486,
                496
            ],
            [
                500,
                516
            ],
            [
                516,
                518
            ],
            [
                518,
                603
            ],
            [
                603,
                616
            ],
            [
                617,
                680
            ],
            [
                680,
                703
            ],
            [
                704,
                734
            ],
            [
                735,
                807
            ],
            [
                807,
                808
            ],
            [
                815,
                836
            ],
            [
                837,
                904
            ],
            [
                905,
                931
            ],
            [
                931,
                932
            ],
            [
                942,
                953
            ],
            [
                954,
                989
            ],
            [
                989,
                1020
            ],
            [
                1021,
                1049
            ],
            [
                1049,
                1051
            ],
            [
                1051,
                1078
            ],
            [
                1082,
                1097
            ],
            [
                1097,
                1131
            ],
            [
                1132,
                1158
            ],
            [
                1176,
                1188
            ],
            [
                1188,
                1234
            ],
            [
                1234,
                1236
            ],
            [
                1236,
                1252
            ],
            [
                1252,
                1259
            ],
            [
                1259,
                1261
            ],
            [
                1261,
                1280
            ],
            [
                1280,
                1312
            ],
            [
                1312,
                1498
            ],
            [
                1498,
                1544
            ],
            [
                1549,
                1578
            ],
            [
                1588,
                1618
            ],
            [
                1618,
                1622
            ],
            [
                1623,
                1686
            ],
            [
                1686,
                1749
            ],
            [
                1751,
                1792
            ],
            [
                1792,
                1844
            ],
            [
                1844,
                1878
            ],
            [
                1885,
                1887
            ],
            [
                1887,
                1899
            ],
            [
                1899,
                1943
            ],
            [
                1943,
                1984
            ],
            [
                1985,
                1991
            ],
            [
                1991,
                2017
            ],
            [
                2017,
                2042
            ],
            [
                2043,
                2072
            ],
            [
                2072,
                2074
            ],
            [
                2074,
                2146
            ],
            [
                2148,
                2174
            ],
            [
                2175,
                2207
            ],
            [
                2207,
                2209
            ],
            [
                2209,
                2347
            ],
            [
                2347,
                2414
            ],
            [
                2414,
                2442
            ],
            [
                2443,
                2493
            ],
            [
                2493,
                2509
            ],
            [
                2522,
                2594
            ],
            [
                2595,
                2661
            ],
            [
                2661,
                2667
            ],
            [
                2672,
                2680
            ],
            [
                2680,
                2682
            ],
            [
                2682,
                2700
            ],
            [
                2708,
                2715
            ],
            [
                2715,
                2760
            ],
            [
                2760,
                2879
            ],
            [
                2879,
                3003
            ],
            [
                3003,
                3064
            ],
            [
                3065,
                3073
            ],
            [
                3073,
                3122
            ],
            [
                3151,
                3193
            ],
            [
                3207,
                3224
            ],
            [
                3224,
                3226
            ],
            [
                3226,
                3278
            ],
            [
                3278,
                3280
            ],
            [
                3280,
                3348
            ],
            [
                3356,
                3366
            ],
            [
                3366,
                3397
            ],
            [
                3399,
                3402
            ],
            [
                3403,
                3426
            ],
            [
                3426,
                3428
            ],
            [
                3428,
                3458
            ],
            [
                3458,
                3505
            ],
            [
                3505,
                3577
            ],
            [
                3577,
                3598
            ],
            [
                3598,
                3609
            ],
            [
                3635,
                3637
            ],
            [
                3637,
                3641
            ],
            [
                3641,
                3643
            ],
            [
                3643,
                3670
            ],
            [
                3670,
                3701
            ],
            [
                3701,
                3702
            ],
            [
                3702,
                3704
            ],
            [
                3710,
                3739
            ],
            [
                3739,
                3844
            ],
            [
                3844,
                3856
            ],
            [
                3857,
                3879
            ],
            [
                3879,
                3885
            ],
            [
                3894,
                3997
            ],
            [
                3997,
                4045
            ],
            [
                4054,
                4068
            ],
            [
                4069,
                4096
            ],
            [
                4099,
                4156
            ],
            [
                4159,
                4278
            ],
            [
                4278,
                4330
            ],
            [
                4330,
                4414
            ],
            [
                4414,
                4499
            ],
            [
                4499,
                4501
            ],
            [
                4501,
                4523
            ],
            [
                4524,
                4556
            ],
            [
                4559,
                4560
            ],
            [
                4568,
                4585
            ],
            [
                4585,
                4614
            ],
            [
                4617,
                4647
            ],
            [
                4650,
                4665
            ],
            [
                4666,
                4688
            ],
            [
                4688,
                4707
            ],
            [
                4707,
                4720
            ],
            [
                4721,
                4783
            ],
            [
                4784,
                4803
            ],
            [
                4803,
                4832
            ],
            [
                4838,
                4859
            ],
            [
                4859,
                4877
            ],
            [
                4879,
                4926
            ],
            [
                4926,
                4939
            ],
            [
                4939,
                4959
            ],
            [
                4959,
                4961
            ],
            [
                4961,
                4982
            ],
            [
                4982,
                5031
            ],
            [
                5031,
                5079
            ],
            [
                5079,
                5140
            ],
            [
                5140,
                5166
            ],
            [
                5166,
                5173
            ],
            [
                5173,
                5204
            ],
            [
                5204,
                5230
            ],
            [
                5233,
                5282
            ],
            [
                5285,
                5297
            ],
            [
                5303,
                5308
            ],
            [
                5308,
                5310
            ],
            [
                5310,
                5316
            ],
            [
                5316,
                5542
            ],
            [
                5542,
                5581
            ],
            [
                5581,
                5664
            ],
            [
                5665,
                5690
            ],
            [
                5691,
                5701
            ],
            [
                5701,
                5753
            ],
            [
                5753,
                5754
            ],
            [
                5755,
                5864
            ],
            [
                5865,
                5871
            ],
            [
                5872,
                5877
            ],
            [
                5877,
                5880
            ],
            [
                5880,
                5922
            ],
            [
                5922,
                6074
            ],
            [
                6074,
                6103
            ],
            [
                6103,
                6149
            ],
            [
                6149,
                6202
            ],
            [
                6207,
                6210
            ],
            [
                6210,
                6225
            ],
            [
                6225,
                6242
            ],
            [
                6242,
                6247
            ],
            [
                6254,
                6316
            ],
            [
                6317,
                6335
            ],
            [
                6335,
                6419
            ],
            [
                6419,
                6459
            ],
            [
                6461,
                6499
            ],
            [
                6499,
                6538
            ],
            [
                6538,
                6564
            ],
            [
                6564,
                6641
            ],
            [
                6649,
                6651
            ],
            [
                6651,
                6734
            ],
            [
                6734,
                6737
            ],
            [
                6737,
                6772
            ],
            [
                6773,
                6805
            ],
            [
                6805,
                6807
            ],
            [
                6807,
                6850
            ],
            [
                6873,
                6912
            ],
            [
                6913,
                6927
            ],
            [
                6927,
                6929
            ],
            [
                6931,
                6959
            ],
            [
                6977,
                6988
            ],
            [
                6994,
                6996
            ],
            [
                6996,
                7015
            ],
            [
                7016,
                7067
            ],
            [
                7067,
                7108
            ],
            [
                7109,
                7130
            ],
            [
                7131,
                7148
            ],
            [
                7149,
                7167
            ],
            [
                7167,
                7189
            ],
            [
                7189,
                7223
            ],
            [
                7223,
                7225
            ],
            [
                7226,
                7302
            ],
            [
                7302,
                7321
            ],
            [
                7324,
                7346
            ],
            [
                7359,
                7400
            ],
            [
                7400,
                7401
            ],
            [
                7402,
                7475
            ],
            [
                7475,
                7489
            ],
            [
                7490,
                7526
            ],
            [
                7526,
                7604
            ],
            [
                7606,
                7659
            ],
            [
                7659,
                7802
            ],
            [
                7802,
                7843
            ],
            [
                7843,
                7845
            ],
            [
                7845,
                7924
            ],
            [
                7925,
                7937
            ],
            [
                7938,
                7941
            ],
            [
                7950,
                7952
            ],
            [
                7952,
                8002
            ],
            [
                8002,
                8083
            ],
            [
                8083,
                8180
            ],
            [
                8180,
                8198
            ],
            [
                8204,
                8215
            ],
            [
                8215,
                8217
            ],
            [
                8217,
                8325
            ],
            [
                8325,
                8327
            ],
            [
                8327,
                8385
            ],
            [
                8385,
                8439
            ],
            [
                8439,
                8470
            ],
            [
                8470,
                8508
            ],
            [
                8508,
                8557
            ],
            [
                8558,
                8570
            ],
            [
                8571,
                8572
            ],
            [
                8572,
                8579
            ],
            [
                8584,
                8644
            ],
            [
                8645,
                8666
            ],
            [
                8666,
                8680
            ],
            [
                8680,
                8707
            ],
            [
                8714,
                8715
            ],
            [
                8716,
                8741
            ],
            [
                8741,
                8885
            ],
            [
                8891,
                8893
            ],
            [
                8893,
                8923
            ],
            [
                8923,
                8926
            ],
            [
                8927,
                8980
            ],
            [
                8983,
                9008
            ],
            [
                9008,
                9027
            ],
            [
                9027,
                9038
            ],
            [
                9038,
                9040
            ],
            [
                9040,
                9076
            ],
            [
                9076,
                9080
            ],
            [
                9081,
                9117
            ],
            [
                9117,
                9120
            ],
            [
                9120,
                9169
            ],
            [
                9169,
                9177
            ],
            [
                9185,
                9188
            ],
            [
                9188,
                9260
            ],
            [
                9260,
                9284
            ],
            [
                9292,
                9344
            ],
            [
                9345,
                9370
            ],
            [
                9371,
                9381
            ],
            [
                9381,
                9426
            ],
            [
                9427,
                9531
            ],
            [
                9531,
                9544
            ],
            [
                9545,
                9566
            ],
            [
                9572,
                9660
            ],
            [
                9660,
                9745
            ],
            [
                9754,
                9799
            ],
            [
                9799,
                9868
            ],
            [
                9869,
                9895
            ],
            [
                9896,
                10001
            ],
            [
                10004,
                10049
            ],
            [
                10061,
                10106
            ],
            [
                10109,
                10135
            ],
            [
                10135,
                10170
            ],
            [
                10171,
                10209
            ],
            [
                10211,
                10240
            ],
            [
                10240,
                10351
            ],
            [
                10353,
                10390
            ],
            [
                10390,
                10416
            ],
            [
                10416,
                10445
            ],
            [
                10445,
                10457
            ],
            [
                10458,
                10469
            ],
            [
                10469,
                10476
            ],
            [
                10476,
                10493
            ],
            [
                10493,
                10545
            ],
            [
                10545,
                10552
            ],
            [
                10558,
                10569
            ],
            [
                10569,
                10644
            ],
            [
                10644,
                10689
            ],
            [
                10689,
                10740
            ],
            [
                10742,
                10835
            ],
            [
                10835,
                10846
            ],
            [
                10846,
                10851
            ],
            [
                10851,
                10862
            ],
            [
                10862,
                10899
            ],
            [
                10899,
                10966
            ],
            [
                10966,
                10968
            ],
            [
                10968,
                10972
            ],
            [
                10981,
                10983
            ],
            [
                10984,
                11236
            ],
            [
                11236,
                11287
            ],
            [
                11295,
                11354
            ],
            [
                11354,
                11422
            ],
            [
                11423,
                11482
            ],
            [
                11482,
                11508
            ],
            [
                11508,
                11568
            ],
            [
                11568,
                11634
            ],
            [
                11634,
                11649
            ],
            [
                11649,
                11676
            ],
            [
                11676,
                11681
            ],
            [
                11681,
                11699
            ],
            [
                11699,
                11794
            ],
            [
                11803,
                11952
            ],
            [
                11952,
                11968
            ],
            [
                11968,
                12033
            ],
            [
                12044,
                12074
            ],
            [
                12075,
                12077
            ],
            [
                12089,
                12207
            ],
            [
                12207,
                12242
            ],
            [
                12243,
                12321
            ],
            [
                12321,
                12324
            ],
            [
                12330,
                12401
            ],
            [
                12401,
                12556
            ],
            [
                12556,
                12631
            ],
            [
                12637,
                12652
            ],
            [
                12662,
                12668
            ],
            [
                12676,
                12708
            ],
            [
                12709,
                12716
            ],
            [
                12716,
                12770
            ],
            [
                12770,
                12774
            ],
            [
                12776,
                12828
            ],
            [
                12828,
                12845
            ],
            [
                12845,
                12870
            ],
            [
                12870,
                12890
            ],
            [
                12896,
                12962
            ],
            [
                12962,
                12968
            ],
            [
                12968,
                12973
            ],
            [
                12984,
                13008
            ],
            [
                13008,
                13009
            ],
            [
                13009,
                13052
            ],
            [
                13055,
                13062
            ],
            [
                13064,
                13117
            ],
            [
                13117,
                13138
            ],
            [
                13138,
                13178
            ],
            [
                13178,
                13227
            ],
            [
                13230,
                13249
            ],
            [
                13252,
                13305
            ],
            [
                13305,
                13356
            ],
            [
                13356,
                13395
            ],
            [
                13395,
                13398
            ],
            [
                13406,
                13408
            ],
            [
                13409,
                13472
            ],
            [
                13472,
                13501
            ],
            [
                13501,
                13560
            ],
            [
                13560,
                13571
            ],
            [
                13571,
                13587
            ],
            [
                13588,
                13609
            ],
            [
                13609,
                13629
            ],
            [
                13629,
                13631
            ],
            [
                13632,
                13646
            ],
            [
                13646,
                13684
            ],
            [
                13684,
                13770
            ],
            [
                13770,
                13785
            ],
            [
                13785,
                13815
            ],
            [
                13815,
                13894
            ],
            [
                13894,
                14019
            ],
            [
                14019,
                14031
            ],
            [
                14032,
                14079
            ],
            [
                14079,
                14112
            ],
            [
                14112,
                14145
            ],
            [
                14145,
                14187
            ],
            [
                14187,
                14226
            ],
            [
                14226,
                14265
            ],
            [
                14265,
                14290
            ],
            [
                14295,
                14327
            ],
            [
                14327,
                14381
            ],
            [
                14381,
                14409
            ],
            [
                14409,
                14491
            ],
            [
                14491,
                14501
            ],
            [
                14501,
                14510
            ],
            [
                14510,
                14583
            ],
            [
                14583,
                14594
            ],
            [
                14594,
                14647
            ],
            [
                14648,
                14703
            ],
            [
                14703,
                14790
            ],
            [
                14790,
                14858
            ],
            [
                14859,
                14874
            ],
            [
                14874,
                14876
            ],
            [
                14876,
                15046
            ],
            [
                15046,
                15048
            ],
            [
                15048,
                15117
            ],
            [
                15118,
                15274
            ],
            [
                15274,
                15310
            ],
            [
                15311,
                15349
            ],
            [
                15349,
                15351
            ],
            [
                15351,
                15354
            ],
            [
                15355,
                15366
            ],
            [
                15366,
                15444
            ],
            [
                15444,
                15582
            ],
            [
                15582,
                15818
            ],
            [
                15818,
                15919
            ],
            [
                15919,
                15954
            ],
            [
                15954,
                15989
            ],
            [
                15989,
                16004
            ],
            [
                16004,
                16006
            ],
            [
                16006,
                16028
            ],
            [
                16028,
                16031
            ],
            [
                16031,
                16060
            ],
            [
                16060,
                16061
            ],
            [
                16061,
                16074
            ],
            [
                16074,
                16103
            ],
            [
                16104,
                16215
            ],
            [
                16215,
                16240
            ],
            [
                16240,
                16245
            ],
            [
                16246,
                16268
            ],
            [
                16268,
                16386
            ],
            [
                16386,
                16388
            ],
            [
                16388,
                16407
            ],
            [
                16407,
                16430
            ],
            [
                16430,
                16518
            ],
            [
                16518,
                16566
            ],
            [
                16569,
                16626
            ],
            [
                16626,
                16628
            ],
            [
                16629,
                16645
            ],
            [
                16662,
                16663
            ],
            [
                16665,
                16789
            ],
            [
                16789,
                16822
            ],
            [
                16823,
                16848
            ],
            [
                16848,
                16867
            ],
            [
                16867,
                16883
            ],
            [
                16884,
                16946
            ],
            [
                16946,
                16948
            ],
            [
                16949,
                16952
            ],
            [
                16953,
                17011
            ],
            [
                17011,
                17049
            ],
            [
                17053,
                17061
            ],
            [
                17067,
                17170
            ],
            [
                17170,
                17174
            ],
            [
                17175,
                17244
            ],
            [
                17245,
                17255
            ],
            [
                17255,
                17273
            ],
            [
                17273,
                17287
            ],
            [
                17287,
                17289
            ],
            [
                17289,
                17324
            ],
            [
                17324,
                17406
            ],
            [
                17409,
                17417
            ],
            [
                17418,
                17441
            ],
            [
                17441,
                17443
            ],
            [
                17443,
                17470
            ],
            [
                17470,
                17480
            ],
            [
                17480,
                17509
            ],
            [
                17515,
                17518
            ],
            [
                17518,
                17545
            ],
            [
                17545,
                17549
            ],
            [
                17549,
                17550
            ],
            [
                17551,
                17559
            ],
            [
                17559,
                17605
            ],
            [
                17605,
                17608
            ],
            [
                17608,
                17635
            ],
            [
                17636,
                17734
            ],
            [
                17735,
                17761
            ],
            [
                17761,
                17763
            ],
            [
                17763,
                17821
            ],
            [
                17822,
                17859
            ],
            [
                17859,
                17861
            ],
            [
                17861,
                17864
            ],
            [
                17865,
                17911
            ],
            [
                17914,
                17923
            ],
            [
                17923,
                18023
            ],
            [
                18024,
                18040
            ],
            [
                18040,
                18082
            ],
            [
                18082,
                18097
            ],
            [
                18100,
                18104
            ],
            [
                18107,
                18121
            ],
            [
                18121,
                18123
            ],
            [
                18124,
                18158
            ],
            [
                18158,
                18265
            ],
            [
                18265,
                18304
            ],
            [
                18304,
                18369
            ],
            [
                18369,
                18428
            ],
            [
                18428,
                18512
            ],
            [
                18512,
                18563
            ],
            [
                18563,
                18677
            ],
            [
                18678,
                18681
            ],
            [
                18682,
                18714
            ],
            [
                18714,
                18716
            ],
            [
                18716,
                18727
            ],
            [
                18728,
                18859
            ],
            [
                18867,
                18869
            ],
            [
                18869,
                18879
            ],
            [
                18880,
                19089
            ],
            [
                19089,
                19190
            ],
            [
                19190,
                19192
            ],
            [
                19192,
                19213
            ],
            [
                19213,
                19242
            ],
            [
                19242,
                19243
            ],
            [
                19244,
                19374
            ],
            [
                19374,
                19376
            ],
            [
                19376,
                19445
            ],
            [
                19446,
                19497
            ],
            [
                19500,
                19537
            ],
            [
                19537,
                19651
            ],
            [
                19652,
                19702
            ],
            [
                19702,
                19710
            ],
            [
                19710,
                19711
            ],
            [
                19712,
                19774
            ],
            [
                19774,
                19812
            ],
            [
                19812,
                19849
            ],
            [
                19849,
                19986
            ],
            [
                19986,
                20041
            ],
            [
                20041,
                20162
            ],
            [
                20162,
                20179
            ],
            [
                20179,
                20259
            ],
            [
                20259,
                20323
            ],
            [
                20323,
                20364
            ],
            [
                20364,
                20426
            ],
            [
                20426,
                20556
            ],
            [
                20557,
                20566
            ],
            [
                20566,
                20604
            ],
            [
                20604,
                20692
            ],
            [
                20692,
                20737
            ],
            [
                20748,
                20765
            ],
            [
                20766,
                20767
            ],
            [
                20768,
                20812
            ],
            [
                20812,
                20832
            ],
            [
                20832,
                20876
            ],
            [
                20876,
                20913
            ],
            [
                20913,
                20955
            ],
            [
                20955,
                21031
            ],
            [
                21031,
                21067
            ]
        ],
        "row_chars": [
            [
                0,
                91
            ],
            [
                91,
                217
            ],
            [
                217,
                458
            ],
            [
                458,
                518
            ],
            [
                518,
                603
            ],
            [
                603,
                680
            ],
            [
                680,
                807
            ],
            [
                807,
                931
            ],
            [
                931,
                1051
            ],
            [
                1051,
                1097
            ],
            [
                1097,
                1236
            ],
            [
                1236,
                1252
            ],
            [
                1252,
                1261
            ],
            [
                1261,
                1280
            ],
            [
                1280,
                1312
            ],
            [
                1312,
                1498
            ],
            [
                1498,
                1618
            ],
            [
                1618,
                1686
            ],
            [
                1686,
                1792
            ],
            [
                1792,
                1844
            ],
            [
                1844,
                1887
            ],
            [
                1887,
                1899
            ],
            [
                1899,
                1943
            ],
            [
                1943,
                1984
            ],
            [
                1984,
                1984
            ],
            [
                1984,
                1984
            ],
            [
                1984,
                1991
            ],
            [
                1991,
                2017
            ],
            [
                2017,
                2074
            ],
            [
                2074,
                2148
            ],
            [
                2148,
                2209
            ],
            [
                2209,
                2347
            ],
            [
                2347,
                2414
            ],
            [
                2414,
                2493
            ],
            [
                2493,
                2595
            ],
            [
                2595,
                2595
            ],
            [
                2595,
                2682
            ],
            [
                2682,
                2760
            ],
            [
                2760,
                2879
            ],
            [
                2879,
                3003
            ],
            [
                3003,
                3073
            ],
            [
                3073,
                3073
            ],
            [
                3073,
                3226
            ],
            [
                3226,
                3280
            ],
            [
                3280,
                3366
            ],
            [
                3366,
                3428
            ],
            [
                3428,
                3458
            ],
            [
                3458,
                3505
            ],
            [
                3505,
                3577
            ],
            [
                3577,
                3577
            ],
            [
                3577,
                3598
            ],
            [
                3598,
                3637
            ],
            [
                3637,
                3643
            ],
            [
                3643,
                3670
            ],
            [
                3670,
                3701
            ],
            [
                3701,
                3739
            ],
            [
                3739,
                3844
            ],
            [
                3844,
                3997
            ],
            [
                3997,
                4069
            ],
            [
                4069,
                4069
            ],
            [
                4069,
                4278
            ],
            [
                4278,
                4330
            ],
            [
                4330,
                4414
            ],
            [
                4414,
                4501
            ],
            [
                4501,
                4585
            ],
            [
                4585,
                4688
            ],
            [
                4688,
                4707
            ],
            [
                4707,
                4784
            ],
            [
                4784,
                4838
            ],
            [
                4838,
                4859
            ],
            [
                4859,
                4926
            ],
            [
                4926,
                4939
            ],
            [
                4939,
                4961
            ],
            [
                4961,
                4982
            ],
            [
                4982,
                5031
            ],
            [
                5031,
                5079
            ],
            [
                5079,
                5140
            ],
            [
                5140,
                5166
            ],
            [
                5166,
                5204
            ],
            [
                5204,
                5310
            ],
            [
                5310,
                5316
            ],
            [
                5316,
                5542
            ],
            [
                5542,
                5581
            ],
            [
                5581,
                5753
            ],
            [
                5753,
                5880
            ],
            [
                5880,
                5922
            ],
            [
                5922,
                6074
            ],
            [
                6074,
                6103
            ],
            [
                6103,
                6149
            ],
            [
                6149,
                6210
            ],
            [
                6210,
                6225
            ],
            [
                6225,
                6242
            ],
            [
                6242,
                6335
            ],
            [
                6335,
                6419
            ],
            [
                6419,
                6499
            ],
            [
                6499,
                6538
            ],
            [
                6538,
                6564
            ],
            [
                6564,
                6651
            ],
            [
                6651,
                6737
            ],
            [
                6737,
                6807
            ],
            [
                6807,
                6873
            ],
            [
                6873,
                6873
            ],
            [
                6873,
                6873
            ],
            [
                6873,
                6873
            ],
            [
                6873,
                6929
            ],
            [
                6929,
                6996
            ],
            [
                6996,
                7067
            ],
            [
                7067,
                7189
            ],
            [
                7189,
                7223
            ],
            [
                7223,
                7302
            ],
            [
                7302,
                7324
            ],
            [
                7324,
                7324
            ],
            [
                7324,
                7324
            ],
            [
                7324,
                7324
            ],
            [
                7324,
                7402
            ],
            [
                7402,
                7475
            ],
            [
                7475,
                7526
            ],
            [
                7526,
                7606
            ],
            [
                7606,
                7659
            ],
            [
                7659,
                7802
            ],
            [
                7802,
                7845
            ],
            [
                7845,
                7952
            ],
            [
                7952,
                8002
            ],
            [
                8002,
                8083
            ],
            [
                8083,
                8180
            ],
            [
                8180,
                8217
            ],
            [
                8217,
                8327
            ],
            [
                8327,
                8439
            ],
            [
                8439,
                8508
            ],
            [
                8508,
                8666
            ],
            [
                8666,
                8680
            ],
            [
                8680,
                8707
            ],
            [
                8707,
                8741
            ],
            [
                8741,
                8893
            ],
            [
                8893,
                8983
            ],
            [
                8983,
                9008
            ],
            [
                9008,
                9027
            ],
            [
                9027,
                9040
            ],
            [
                9040,
                9076
            ],
            [
                9076,
                9169
            ],
            [
                9169,
                9260
            ],
            [
                9260,
                9381
            ],
            [
                9381,
                9531
            ],
            [
                9531,
                9660
            ],
            [
                9660,
                9799
            ],
            [
                9799,
                9896
            ],
            [
                9896,
                10135
            ],
            [
                10135,
                10211
            ],
            [
                10211,
                10240
            ],
            [
                10240,
                10390
            ],
            [
                10390,
                10416
            ],
            [
                10416,
                10445
            ],
            [
                10445,
                10469
            ],
            [
                10469,
                10476
            ],
            [
                10476,
                10493
            ],
            [
                10493,
                10545
            ],
            [
                10545,
                10644
            ],
            [
                10644,
                10689
            ],
            [
                10689,
                10835
            ],
            [
                10835,
                10846
            ],
            [
                10846,
                10851
            ],
            [
                10851,
                10862
            ],
            [
                10862,
                10899
            ],
            [
                10899,
                10968
            ],
            [
                10968,
                11354
            ],
            [
                11354,
                11482
            ],
            [
                11482,
                11508
            ],
            [
                11508,
                11568
            ],
            [
                11568,
                11634
            ],
            [
                11634,
                11649
            ],
            [
                11649,
                11676
            ],
            [
                11676,
                11681
            ],
            [
                11681,
                11699
            ],
            [
                11699,
                11952
            ],
            [
                11952,
                11968
            ],
            [
                11968,
                12207
            ],
            [
                12207,
                12321
            ],
            [
                12321,
                12401
            ],
            [
                12401,
                12556
            ],
            [
                12556,
                12716
            ],
            [
                12716,
                12770
            ],
            [
                12770,
                12828
            ],
            [
                12828,
                12845
            ],
            [
                12845,
                12870
            ],
            [
                12870,
                12890
            ],
            [
                12890,
                12962
            ],
            [
                12962,
                13008
            ],
            [
                13008,
                13064
            ],
            [
                13064,
                13064
            ],
            [
                13064,
                13117
            ],
            [
                13117,
                13138
            ],
            [
                13138,
                13178
            ],
            [
                13178,
                13305
            ],
            [
                13305,
                13356
            ],
            [
                13356,
                13395
            ],
            [
                13395,
                13472
            ],
            [
                13472,
                13501
            ],
            [
                13501,
                13560
            ],
            [
                13560,
                13571
            ],
            [
                13571,
                13631
            ],
            [
                13631,
                13631
            ],
            [
                13631,
                13646
            ],
            [
                13646,
                13684
            ],
            [
                13684,
                13770
            ],
            [
                13770,
                13785
            ],
            [
                13785,
                13815
            ],
            [
                13815,
                13894
            ],
            [
                13894,
                14019
            ],
            [
                14019,
                14079
            ],
            [
                14079,
                14112
            ],
            [
                14112,
                14145
            ],
            [
                14145,
                14187
            ],
            [
                14187,
                14226
            ],
            [
                14226,
                14265
            ],
            [
                14265,
                14327
            ],
            [
                14327,
                14381
            ],
            [
                14381,
                14409
            ],
            [
                14409,
                14491
            ],
            [
                14491,
                14501
            ],
            [
                14501,
                14510
            ],
            [
                14510,
                14583
            ],
            [
                14583,
                14594
            ],
            [
                14594,
                14703
            ],
            [
                14703,
                14790
            ],
            [
                14790,
                14876
            ],
            [
                14876,
                15048
            ],
            [
                15048,
                15118
            ],
            [
                15118,
                15274
            ],
            [
                15274,
                15311
            ],
            [
                15311,
                15311
            ],
            [
                15311,
                15351
            ],
            [
                15351,
                15351
            ],
            [
                15351,
                15444
            ],
            [
                15444,
                15582
            ],
            [
                15582,
                15818
            ],
            [
                15818,
                15919
            ],
            [
                15919,
                15954
            ],
            [
                15954,
                15989
            ],
            [
                15989,
                16006
            ],
            [
                16006,
                16031
            ],
            [
                16031,
                16060
            ],
            [
                16060,
                16074
            ],
            [
                16074,
                16215
            ],
            [
                16215,
                16268
            ],
            [
                16268,
                16386
            ],
            [
                16386,
                16407
            ],
            [
                16407,
                16430
            ],
            [
                16430,
                16518
            ],
            [
                16518,
                16628
            ],
            [
                16628,
                16628
            ],
            [
                16628,
                16628
            ],
            [
                16628,
                16628
            ],
            [
                16628,
                16628
            ],
            [
                16628,
                16628
            ],
            [
                16628,
                16789
            ],
            [
                16789,
                16848
            ],
            [
                16848,
                16867
            ],
            [
                16867,
                16948
            ],
            [
                16948,
                17011
            ],
            [
                17011,
                17049
            ],
            [
                17049,
                17049
            ],
            [
                17049,
                17049
            ],
            [
                17049,
                17170
            ],
            [
                17170,
                17255
            ],
            [
                17255,
                17273
            ],
            [
                17273,
                17289
            ],
            [
                17289,
                17324
            ],
            [
                17324,
                17443
            ],
            [
                17443,
                17470
            ],
            [
                17470,
                17480
            ],
            [
                17480,
                17518
            ],
            [
                17518,
                17545
            ],
            [
                17545,
                17559
            ],
            [
                17559,
                17608
            ],
            [
                17608,
                17635
            ],
            [
                17635,
                17635
            ],
            [
                17635,
                17635
            ],
            [
                17635,
                17763
            ],
            [
                17763,
                17861
            ],
            [
                17861,
                17923
            ],
            [
                17923,
                18040
            ],
            [
                18040,
                18082
            ],
            [
                18082,
                18100
            ],
            [
                18100,
                18123
            ],
            [
                18123,
                18123
            ],
            [
                18123,
                18158
            ],
            [
                18158,
                18265
            ],
            [
                18265,
                18304
            ],
            [
                18304,
                18369
            ],
            [
                18369,
                18428
            ],
            [
                18428,
                18512
            ],
            [
                18512,
                18563
            ],
            [
                18563,
                18716
            ],
            [
                18716,
                18716
            ],
            [
                18716,
                18869
            ],
            [
                18869,
                19089
            ],
            [
                19089,
                19192
            ],
            [
                19192,
                19213
            ],
            [
                19213,
                19376
            ],
            [
                19376,
                19537
            ],
            [
                19537,
                19702
            ],
            [
                19702,
                19712
            ],
            [
                19712,
                19712
            ],
            [
                19712,
                19774
            ],
            [
                19774,
                19812
            ],
            [
                19812,
                19849
            ],
            [
                19849,
                19986
            ],
            [
                19986,
                20041
            ],
            [
                20041,
                20162
            ],
            [
                20162,
                20179
            ],
            [
                20179,
                20259
            ],
            [
                20259,
                20364
            ],
            [
                20364,
                20426
            ],
            [
                20426,
                20604
            ],
            [
                20604,
                20692
            ],
            [
                20692,
                20766
            ],
            [
                20766,
                20766
            ],
            [
                20766,
                20766
            ],
            [
                20766,
                20812
            ],
            [
                20812,
                20832
            ],
            [
                20832,
                20876
            ],
            [
                20876,
                20913
            ],
            [
                20913,
                20955
            ],
            [
                20955,
                21031
            ],
            [
                21031,
                21067
            ]
        ]
    }
}