{
    "original": {
        "text": "The days when I frequented that miserable corner which my dear girl brightened can never fade in my remembrance. I never see it, and I never wish to see it now; I have been there only once since, but in my memory there is a mournful glory shining on the place which will shine for ever.\nNot a day passed without my going there, of course. At first I found Mr. Skimpole there, on two or three occasions, idly playing the piano and talking in his usual vivacious strain. Now, besides my very much mistrusting the probability of his being there without making Richard poorer, I felt as if there were something in his careless gaiety too inconsistent with what I knew of the depths of Ada's life. I clearly perceived, too, that Ada shared my feelings. I therefore resolved, after much thinking of it, to make a private visit to Mr. Skimpole and try delicately to explain myself. My dear girl was the great consideration that made me bold.\nI set off one morning, accompanied by Charley, for Somers Town. As I approached the house, I was strongly inclined to turn back, for I felt what a desperate attempt it was to make an impression on Mr. Skimpole and how extremely likely it was that he would signally defeat me. However, I thought that being there, I would go through with it. I knocked with a trembling hand at Mr. Skimpole's door--literally with a hand, for the knocker was gone--and after a long parley gained admission from an Irishwoman, who was in the area when I knocked, breaking up the lid of a water-butt with a poker to light the fire with.\nMr. Skimpole, lying on the sofa in his room, playing the flute a little, was enchanted to see me. Now, who should receive me, he asked. Who would I prefer for mistress of the ceremonies? Would I have his Comedy daughter, his Beauty daughter, or his Sentiment daughter? Or would I have all the daughters at once in a perfect nosegay?\nI replied, half defeated already, that I wished to speak to himself only if he would give me leave.\n\"My dear Miss Summerson, most joyfully! Of course,\" he said, bringing his chair nearer mine and breaking into his fascinating smile, \"of course it's not business. Then it's pleasure!\"\nI said it certainly was not business that I came upon, but it was not quite a pleasant matter.\n\"Then, my dear Miss Summerson,\" said he with the frankest gaiety, \"don't allude to it. Why should you allude to anything that is NOT a pleasant matter? I never do. And you are a much pleasanter creature, in every point of view, than I. You are perfectly pleasant; I am imperfectly pleasant; then, if I never allude to an unpleasant matter, how much less should you! So that's disposed of, and we will talk of something else.\"\nAlthough I was embarrassed, I took courage to intimate that I still wished to pursue the subject.\n\"I should think it a mistake,\" said Mr. Skimpole with his airy laugh, \"if I thought Miss Summerson capable of making one. But I don't!\"\n\"Mr. Skimpole,\" said I, raising my eyes to his, \"I have so often heard you say that you are unacquainted with the common affairs of life--\"\n\"Meaning our three banking-house friends, L, S, and who's the junior partner? D?\" said Mr. Skimpole, brightly. \"Not an idea of them!\"\n\"--That perhaps,\" I went on, \"you will excuse my boldness on that account. I think you ought most seriously to know that Richard is poorer than he was.\"\n\"Dear me!\" said Mr. Skimpole. \"So am I, they tell me.\"\n\"And in very embarrassed circumstances.\"\n\"Parallel case, exactly!\" said Mr. Skimpole with a delighted countenance.\n\"This at present naturally causes Ada much secret anxiety, and as I think she is less anxious when no claims are made upon her by visitors, and as Richard has one uneasiness always heavy on his mind, it has occurred to me to take the liberty of saying that--if you would--not--\"\nI was coming to the point with great difficulty when he took me by both hands and with a radiant face and in the liveliest way anticipated it.\n\"Not go there? Certainly not, my dear Miss Summerson, most assuredly not. Why SHOULD I go there? When I go anywhere, I go for pleasure. I don't go anywhere for pain, because I was made for pleasure. Pain comes to ME when it wants me. Now, I have had very little pleasure at our dear Richard's lately, and your practical sagacity demonstrates why. Our young friends, losing the youthful poetry which was once so captivating in them, begin to think, 'This is a man who wants pounds.' So I am; I always want pounds; not for myself, but because tradespeople always want them of me. Next, our young friends begin to think, becoming mercenary, 'This is the man who HAD pounds, who borrowed them,' which I did. I always borrow pounds. So our young friends, reduced to prose (which is much to be regretted), degenerate in their power of imparting pleasure to me. Why should I go to see them, therefore? Absurd!\"\nThrough the beaming smile with which he regarded me as he reasoned thus, there now broke forth a look of disinterested benevolence quite astonishing.\n\"Besides,\" he said, pursuing his argument in his tone of light-hearted conviction, \"if I don't go anywhere for pain--which would be a perversion of the intention of my being, and a monstrous thing to do--why should I go anywhere to be the cause of pain? If I went to see our young friends in their present ill-regulated state of mind, I should give them pain. The associations with me would be disagreeable. They might say, 'This is the man who had pounds and who can't pay pounds,' which I can't, of course; nothing could be more out of the question! Then kindness requires that I shouldn't go near them--and I won't.\"\nHe finished by genially kissing my hand and thanking me. Nothing but Miss Summerson's fine tact, he said, would have found this out for him.\nI was much disconcerted, but I reflected that if the main point were gained, it mattered little how strangely he perverted everything leading to it. I had determined to mention something else, however, and I thought I was not to be put off in that.\n\"Mr. Skimpole,\" said I, \"I must take the liberty of saying before I conclude my visit that I was much surprised to learn, on the best authority, some little time ago, that you knew with whom that poor boy left Bleak House and that you accepted a present on that occasion. I have not mentioned it to my guardian, for I fear it would hurt him unnecessarily; but I may say to you that I was much surprised.\"\n\"No? Really surprised, my dear Miss Summerson?\" he returned inquiringly, raising his pleasant eyebrows.\n\"Greatly surprised.\"\nHe thought about it for a little while with a highly agreeable and whimsical expression of face, then quite gave it up and said in his most engaging manner, \"You know what a child I am. Why surprised?\"\nI was reluctant to enter minutely into that question, but as he begged I would, for he was really curious to know, I gave him to understand in the gentlest words I could use that his conduct seemed to involve a disregard of several moral obligations. He was much amused and interested when he heard this and said, \"No, really?\" with ingenuous simplicity.\n\"You know I don't intend to be responsible. I never could do it. Responsibility is a thing that has always been above me--or below me,\" said Mr. Skimpole. \"I don't even know which; but as I understand the way in which my dear Miss Summerson (always remarkable for her practical good sense and clearness) puts this case, I should imagine it was chiefly a question of money, do you know?\"\nI incautiously gave a qualified assent to this.\n\"Ah! Then you see,\" said Mr. Skimpole, shaking his head, \"I am hopeless of understanding it.\"\nI suggested, as I rose to go, that it was not right to betray my guardian's confidence for a bribe.\n\"My dear Miss Summerson,\" he returned with a candid hilarity that was all his own, \"I can't be bribed.\"\n\"Not by Mr. Bucket?\" said I.\n\"No,\" said he. \"Not by anybody. I don't attach any value to money. I don't care about it, I don't know about it, I don't want it, I don't keep it--it goes away from me directly. How can I be bribed?\"\nI showed that I was of a different opinion, though I had not the capacity for arguing the question.\n\"On the contrary,\" said Mr. Skimpole, \"I am exactly the man to be placed in a superior position in such a case as that. I am above the rest of mankind in such a case as that. I can act with philosophy in such a case as that. I am not warped by prejudices, as an Italian baby is by bandages. I am as free as the air. I feel myself as far above suspicion as Caesar's wife.\"\nAnything to equal the lightness of his manner and the playful impartiality with which he seemed to convince himself, as he tossed the matter about like a ball of feathers, was surely never seen in anybody else!\n\"Observe the case, my dear Miss Summerson. Here is a boy received into the house and put to bed in a state that I strongly object to. The boy being in bed, a man arrives--like the house that Jack built. Here is the man who demands the boy who is received into the house and put to bed in a state that I strongly object to. Here is a bank-note produced by the man who demands the boy who is received into the house and put to bed in a state that I strongly object to. Here is the Skimpole who accepts the bank-note produced by the man who demands the boy who is received into the house and put to bed in a state that I strongly object to. Those are the facts. Very well. Should the Skimpole have refused the note? WHY should the Skimpole have refused the note? Skimpole protests to Bucket, 'What's this for? I don't understand it, it is of no use to me, take it away.' Bucket still entreats Skimpole to accept it. Are there reasons why Skimpole, not being warped by prejudices, should accept it? Yes. Skimpole perceives them. What are they? Skimpole reasons with himself, this is a tamed lynx, an active police-officer, an intelligent man, a person of a peculiarly directed energy and great subtlety both of conception and execution, who discovers our friends and enemies for us when they run away, recovers our property for us when we are robbed, avenges us comfortably when we are murdered. This active police-officer and intelligent man has acquired, in the exercise of his art, a strong faith in money; he finds it very useful to him, and he makes it very useful to society. Shall I shake that faith in Bucket because I want it myself; shall I deliberately blunt one of Bucket's weapons; shall I positively paralyse Bucket in his next detective operation? And again. If it is blameable in Skimpole to take the note, it is blameable in Bucket to offer the note--much more blameable in Bucket, because he is the knowing man. Now, Skimpole wishes to think well of Bucket; Skimpole deems it essential, in its little place, to the general cohesion of things, that he SHOULD think well of Bucket. The state expressly asks him to trust to Bucket. And he does. And that's all he does!\"\nI had nothing to offer in reply to this exposition and therefore took my leave. Mr. Skimpole, however, who was in excellent spirits, would not hear of my returning home attended only by \"Little Coavinses,\" and accompanied me himself. He entertained me on the way with a variety of delightful conversation and assured me, at parting, that he should never forget the fine tact with which I had found that out for him about our young friends.\nAs it so happened that I never saw Mr. Skimpole again, I may at once finish what I know of his history. A coolness arose between him and my guardian, based principally on the foregoing grounds and on his having heartlessly disregarded my guardian's entreaties (as we afterwards learned from Ada) in reference to Richard. His being heavily in my guardian's debt had nothing to do with their separation. He died some five years afterwards and left a diary behind him, with letters and other materials towards his life, which was published and which showed him to have been the victim of a combination on the part of mankind against an amiable child. It was considered very pleasant reading, but I never read more of it myself than the sentence on which I chanced to light on opening the book. It was this: \"Jarndyce, in common with most other men I have known, is the incarnation of selfishness.\"\nAnd now I come to a part of my story touching myself very nearly indeed, and for which I was quite unprepared when the circumstance occurred. Whatever little lingerings may have now and then revived in my mind associated with my poor old face had only revived as belonging to a part of my life that was gone--gone like my infancy or my childhood. I have suppressed none of my many weaknesses on that subject, but have written them as faithfully as my memory has recalled them. And I hope to do, and mean to do, the same down to the last words of these pages, which I see now not so very far before me.\nThe months were gliding away, and my dear girl, sustained by the hopes she had confided in me, was the same beautiful star in the miserable corner. Richard, more worn and haggard, haunted the court day after day, listlessly sat there the whole day long when he knew there was no remote chance of the suit being mentioned, and became one of the stock sights of the place. I wonder whether any of the gentlemen remembered him as he was when he first went there.\nSo completely was he absorbed in his fixed idea that he used to avow in his cheerful moments that he should never have breathed the fresh air now \"but for Woodcourt.\" It was only Mr. Woodcourt who could occasionally divert his attention for a few hours at a time and rouse him, even when he sunk into a lethargy of mind and body that alarmed us greatly, and the returns of which became more frequent as the months went on. My dear girl was right in saying that he only pursued his errors the more desperately for her sake. I have no doubt that his desire to retrieve what he had lost was rendered the more intense by his grief for his young wife, and became like the madness of a gamester.\nI was there, as I have mentioned, at all hours. When I was there at night, I generally went home with Charley in a coach; sometimes my guardian would meet me in the neighbourhood, and we would walk home together. One evening he had arranged to meet me at eight o'clock. I could not leave, as I usually did, quite punctually at the time, for I was working for my dear girl and had a few stitches more to do to finish what I was about; but it was within a few minutes of the hour when I bundled up my little work-basket, gave my darling my last kiss for the night, and hurried downstairs. Mr. Woodcourt went with me, as it was dusk.\nWhen we came to the usual place of meeting--it was close by, and Mr. Woodcourt had often accompanied me before--my guardian was not there. We waited half an hour, walking up and down, but there were no signs of him. We agreed that he was either prevented from coming or that he had come and gone away, and Mr. Woodcourt proposed to walk home with me.\nIt was the first walk we had ever taken together, except that very short one to the usual place of meeting. We spoke of Richard and Ada the whole way. I did not thank him in words for what he had done--my appreciation of it had risen above all words then--but I hoped he might not be without some understanding of what I felt so strongly.\nArriving at home and going upstairs, we found that my guardian was out and that Mrs. Woodcourt was out too. We were in the very same room into which I had brought my blushing girl when her youthful lover, now her so altered husband, was the choice of her young heart, the very same room from which my guardian and I had watched them going away through the sunlight in the fresh bloom of their hope and promise.\nWe were standing by the opened window looking down into the street when Mr. Woodcourt spoke to me. I learned in a moment that he loved me. I learned in a moment that my scarred face was all unchanged to him. I learned in a moment that what I had thought was pity and compassion was devoted, generous, faithful love. Oh, too late to know it now, too late, too late. That was the first ungrateful thought I had. Too late.\n\"When I returned,\" he told me, \"when I came back, no richer than when I went away, and found you newly risen from a sick bed, yet so inspired by sweet consideration for others and so free from a selfish thought--\"\n\"Oh, Mr. Woodcourt, forbear, forbear!\" I entreated him. \"I do not deserve your high praise. I had many selfish thoughts at that time, many!\"\n\"Heaven knows, beloved of my life,\" said he, \"that my praise is not a lover's praise, but the truth. You do not know what all around you see in Esther Summerson, how many hearts she touches and awakens, what sacred admiration and what love she wins.\"\n\"Oh, Mr. Woodcourt,\" cried I, \"it is a great thing to win love, it is a great thing to win love! I am proud of it, and honoured by it; and the hearing of it causes me to shed these tears of mingled joy and sorrow--joy that I have won it, sorrow that I have not deserved it better; but I am not free to think of yours.\"\nI said it with a stronger heart, for when he praised me thus and when I heard his voice thrill with his belief that what he said was true, I aspired to be more worthy of it. It was not too late for that. Although I closed this unforeseen page in my life to-night, I could be worthier of it all through my life. And it was a comfort to me, and an impulse to me, and I felt a dignity rise up within me that was derived from him when I thought so.\nHe broke the silence.\n\"I should poorly show the trust that I have in the dear one who will evermore be as dear to me as now\"--and the deep earnestness with which he said it at once strengthened me and made me weep--\"if, after her assurance that she is not free to think of my love, I urged it. Dear Esther, let me only tell you that the fond idea of you which I took abroad was exalted to the heavens when I came home. I have always hoped, in the first hour when I seemed to stand in any ray of good fortune, to tell you this. I have always feared that I should tell it you in vain. My hopes and fears are both fulfilled to-night. I distress you. I have said enough.\"\nSomething seemed to pass into my place that was like the angel he thought me, and I felt so sorrowful for the loss he had sustained! I wished to help him in his trouble, as I had wished to do when he showed that first commiseration for me.\n\"Dear Mr. Woodcourt,\" said I, \"before we part to-night, something is left for me to say. I never could say it as I wish--I never shall--but--\"\nI had to think again of being more deserving of his love and his affliction before I could go on.\n\"--I am deeply sensible of your generosity, and I shall treasure its remembrance to my dying hour. I know full well how changed I am, I know you are not unacquainted with my history, and I know what a noble love that is which is so faithful. What you have said to me could have affected me so much from no other lips, for there are none that could give it such a value to me. It shall not be lost. It shall make me better.\"\nHe covered his eyes with his hand and turned away his head. How could I ever be worthy of those tears?\n\"If, in the unchanged intercourse we shall have together--in tending Richard and Ada, and I hope in many happier scenes of life--you ever find anything in me which you can honestly think is better than it used to be, believe that it will have sprung up from to-night and that I shall owe it to you. And never believe, dear dear Mr. Woodcourt, never believe that I forget this night or that while my heart beats it can be insensible to the pride and joy of having been beloved by you.\"\nHe took my hand and kissed it. He was like himself again, and I felt still more encouraged.\n\"I am induced by what you said just now,\" said I, \"to hope that you have succeeded in your endeavour.\"\n\"I have,\" he answered. \"With such help from Mr. Jarndyce as you who know him so well can imagine him to have rendered me, I have succeeded.\"\n\"Heaven bless him for it,\" said I, giving him my hand; \"and heaven bless you in all you do!\"\n\"I shall do it better for the wish,\" he answered; \"it will make me enter on these new duties as on another sacred trust from you.\"\n\"Ah! Richard!\" I exclaimed involuntarily, \"What will he do when you are gone!\"\n\"I am not required to go yet; I would not desert him, dear Miss Summerson, even if I were.\"\nOne other thing I felt it needful to touch upon before he left me. I knew that I should not be worthier of the love I could not take if I reserved it.\n\"Mr. Woodcourt,\" said I, \"you will be glad to know from my lips before I say good night that in the future, which is clear and bright before me, I am most happy, most fortunate, have nothing to regret or desire.\"\nIt was indeed a glad hearing to him, he replied.\n\"From my childhood I have been,\" said I, \"the object of the untiring goodness of the best of human beings, to whom I am so bound by every tie of attachment, gratitude, and love, that nothing I could do in the compass of a life could express the feelings of a single day.\"\n\"I share those feelings,\" he returned. \"You speak of Mr. Jarndyce.\"\n\"You know his virtues well,\" said I, \"but few can know the greatness of his character as I know it. All its highest and best qualities have been revealed to me in nothing more brightly than in the shaping out of that future in which I am so happy. And if your highest homage and respect had not been his already--which I know they are--they would have been his, I think, on this assurance and in the feeling it would have awakened in you towards him for my sake.\"\nHe fervently replied that indeed indeed they would have been. I gave him my hand again.\n\"Good night,\" I said, \"Good-bye.\"\n\"The first until we meet to-morrow, the second as a farewell to this theme between us for ever.\"\n\"Yes.\"\n\"Good night; good-bye.\"\nHe left me, and I stood at the dark window watching the street. His love, in all its constancy and generosity, had come so suddenly upon me that he had not left me a minute when my fortitude gave way again and the street was blotted out by my rushing tears.\nBut they were not tears of regret and sorrow. No. He had called me the beloved of his life and had said I would be evermore as dear to him as I was then, and I felt as if my heart would not hold the triumph of having heard those words. My first wild thought had died away. It was not too late to hear them, for it was not too late to be animated by them to be good, true, grateful, and contented. How easy my path, how much easier than his!",
        "paragraph_chars": [
            [
                0,
                287
            ],
            [
                287,
                935
            ],
            [
                935,
                1551
            ],
            [
                1551,
                1884
            ],
            [
                1884,
                1984
            ],
            [
                1984,
                2168
            ],
            [
                2168,
                2263
            ],
            [
                2263,
                2689
            ],
            [
                2689,
                2787
            ],
            [
                2787,
                2923
            ],
            [
                2923,
                3063
            ],
            [
                3063,
                3197
            ],
            [
                3197,
                3350
            ],
            [
                3350,
                3405
            ],
            [
                3405,
                3446
            ],
            [
                3446,
                3520
            ],
            [
                3520,
                3799
            ],
            [
                3799,
                3942
            ],
            [
                3942,
                4846
            ],
            [
                4846,
                4996
            ],
            [
                4996,
                5616
            ],
            [
                5616,
                5757
            ],
            [
                5757,
                6006
            ],
            [
                6006,
                6411
            ],
            [
                6411,
                6515
            ],
            [
                6515,
                6536
            ],
            [
                6536,
                6738
            ],
            [
                6738,
                7093
            ],
            [
                7093,
                7480
            ],
            [
                7480,
                7528
            ],
            [
                7528,
                7622
            ],
            [
                7622,
                7722
            ],
            [
                7722,
                7826
            ],
            [
                7826,
                7855
            ],
            [
                7855,
                8055
            ],
            [
                8055,
                8155
            ],
            [
                8155,
                8527
            ],
            [
                8527,
                8738
            ],
            [
                8738,
                10919
            ],
            [
                10919,
                11359
            ],
            [
                11359,
                12254
            ],
            [
                12254,
                12856
            ],
            [
                12856,
                13316
            ],
            [
                13316,
                14006
            ],
            [
                14006,
                14637
            ],
            [
                14637,
                14988
            ],
            [
                14988,
                15327
            ],
            [
                15327,
                15738
            ],
            [
                15738,
                16158
            ],
            [
                16158,
                16372
            ],
            [
                16372,
                16513
            ],
            [
                16513,
                16764
            ],
            [
                16764,
                17083
            ],
            [
                17083,
                17528
            ],
            [
                17528,
                17550
            ],
            [
                17550,
                18196
            ],
            [
                18196,
                18436
            ],
            [
                18436,
                18579
            ],
            [
                18579,
                18677
            ],
            [
                18677,
                19101
            ],
            [
                19101,
                19204
            ],
            [
                19204,
                19689
            ],
            [
                19689,
                19781
            ],
            [
                19781,
                19884
            ],
            [
                19884,
                20025
            ],
            [
                20025,
                20118
            ],
            [
                20118,
                20249
            ],
            [
                20249,
                20328
            ],
            [
                20328,
                20420
            ],
            [
                20420,
                20571
            ],
            [
                20571,
                20784
            ],
            [
                20784,
                20833
            ],
            [
                20833,
                21105
            ],
            [
                21105,
                21173
            ],
            [
                21173,
                21637
            ],
            [
                21637,
                21725
            ],
            [
                21725,
                21759
            ],
            [
                21759,
                21856
            ],
            [
                21856,
                21863
            ],
            [
                21863,
                21887
            ],
            [
                21887,
                22145
            ],
            [
                22145,
                22585
            ]
        ],
        "segment_chars": [
            [
                0,
                113
            ],
            [
                113,
                287
            ],
            [
                287,
                339
            ],
            [
                339,
                469
            ],
            [
                469,
                693
            ],
            [
                693,
                748
            ],
            [
                748,
                875
            ],
            [
                875,
                935
            ],
            [
                935,
                999
            ],
            [
                999,
                1211
            ],
            [
                1211,
                1276
            ],
            [
                1276,
                1551
            ],
            [
                1551,
                1649
            ],
            [
                1649,
                1687
            ],
            [
                1687,
                1738
            ],
            [
                1738,
                1820
            ],
            [
                1820,
                1884
            ],
            [
                1884,
                1984
            ],
            [
                1984,
                2024
            ],
            [
                2024,
                2147
            ],
            [
                2147,
                2168
            ],
            [
                2168,
                2263
            ],
            [
                2263,
                2350
            ],
            [
                2350,
                2415
            ],
            [
                2415,
                2427
            ],
            [
                2427,
                2499
            ],
            [
                2499,
                2629
            ],
            [
                2629,
                2689
            ],
            [
                2689,
                2787
            ],
            [
                2787,
                2909
            ],
            [
                2909,
                2923
            ],
            [
                2923,
                3063
            ],
            [
                3063,
                3141
            ],
            [
                3141,
                3145
            ],
            [
                3145,
                3174
            ],
            [
                3174,
                3197
            ],
            [
                3197,
                3272
            ],
            [
                3272,
                3350
            ],
            [
                3350,
                3361
            ],
            [
                3361,
                3380
            ],
            [
                3380,
                3405
            ],
            [
                3405,
                3446
            ],
            [
                3446,
                3472
            ],
            [
                3472,
                3520
            ],
            [
                3520,
                3799
            ],
            [
                3799,
                3942
            ],
            [
                3942,
                3957
            ],
            [
                3957,
                4016
            ],
            [
                4016,
                4039
            ],
            [
                4039,
                4078
            ],
            [
                4078,
                4141
            ],
            [
                4141,
                4176
            ],
            [
                4176,
                4289
            ],
            [
                4289,
                4424
            ],
            [
                4424,
                4520
            ],
            [
                4520,
                4646
            ],
            [
                4646,
                4670
            ],
            [
                4670,
                4797
            ],
            [
                4797,
                4837
            ],
            [
                4837,
                4846
            ],
            [
                4846,
                4996
            ],
            [
                4996,
                5250
            ],
            [
                5250,
                5356
            ],
            [
                5356,
                5404
            ],
            [
                5404,
                5548
            ],
            [
                5548,
                5616
            ],
            [
                5616,
                5673
            ],
            [
                5673,
                5757
            ],
            [
                5757,
                5906
            ],
            [
                5906,
                6006
            ],
            [
                6006,
                6278
            ],
            [
                6278,
                6411
            ],
            [
                6411,
                6416
            ],
            [
                6416,
                6459
            ],
            [
                6459,
                6515
            ],
            [
                6515,
                6536
            ],
            [
                6536,
                6722
            ],
            [
                6722,
                6738
            ],
            [
                6738,
                6989
            ],
            [
                6989,
                7066
            ],
            [
                7066,
                7093
            ],
            [
                7093,
                7137
            ],
            [
                7137,
                7158
            ],
            [
                7158,
                7248
            ],
            [
                7248,
                7480
            ],
            [
                7480,
                7528
            ],
            [
                7528,
                7533
            ],
            [
                7533,
                7622
            ],
            [
                7622,
                7722
            ],
            [
                7722,
                7826
            ],
            [
                7826,
                7847
            ],
            [
                7847,
                7855
            ],
            [
                7855,
                7870
            ],
            [
                7870,
                7887
            ],
            [
                7887,
                7922
            ],
            [
                7922,
                8033
            ],
            [
                8033,
                8055
            ],
            [
                8055,
                8155
            ],
            [
                8155,
                8275
            ],
            [
                8275,
                8330
            ],
            [
                8330,
                8380
            ],
            [
                8380,
                8446
            ],
            [
                8446,
                8471
            ],
            [
                8471,
                8527
            ],
            [
                8527,
                8738
            ],
            [
                8738,
                8781
            ],
            [
                8781,
                8872
            ],
            [
                8872,
                8941
            ],
            [
                8941,
                9061
            ],
            [
                9061,
                9205
            ],
            [
                9205,
                9376
            ],
            [
                9376,
                9397
            ],
            [
                9397,
                9408
            ],
            [
                9408,
                9451
            ],
            [
                9451,
                9498
            ],
            [
                9498,
                9545
            ],
            [
                9545,
                9606
            ],
            [
                9606,
                9651
            ],
            [
                9651,
                9733
            ],
            [
                9733,
                9738
            ],
            [
                9738,
                9763
            ],
            [
                9763,
                9778
            ],
            [
                9778,
                10130
            ],
            [
                10130,
                10316
            ],
            [
                10316,
                10497
            ],
            [
                10497,
                10508
            ],
            [
                10508,
                10664
            ],
            [
                10664,
                10832
            ],
            [
                10832,
                10881
            ],
            [
                10881,
                10894
            ],
            [
                10894,
                10919
            ],
            [
                10919,
                10999
            ],
            [
                10999,
                11153
            ],
            [
                11153,
                11359
            ],
            [
                11359,
                11463
            ],
            [
                11463,
                11680
            ],
            [
                11680,
                11761
            ],
            [
                11761,
                12007
            ],
            [
                12007,
                12150
            ],
            [
                12150,
                12254
            ],
            [
                12254,
                12396
            ],
            [
                12396,
                12601
            ],
            [
                12601,
                12731
            ],
            [
                12731,
                12856
            ],
            [
                12856,
                13004
            ],
            [
                13004,
                13227
            ],
            [
                13227,
                13316
            ],
            [
                13316,
                13483
            ],
            [
                13483,
                13739
            ],
            [
                13739,
                13839
            ],
            [
                13839,
                14006
            ],
            [
                14006,
                14054
            ],
            [
                14054,
                14219
            ],
            [
                14219,
                14276
            ],
            [
                14276,
                14593
            ],
            [
                14593,
                14637
            ],
            [
                14637,
                14776
            ],
            [
                14776,
                14853
            ],
            [
                14853,
                14988
            ],
            [
                14988,
                15096
            ],
            [
                15096,
                15139
            ],
            [
                15139,
                15327
            ],
            [
                15327,
                15435
            ],
            [
                15435,
                15738
            ],
            [
                15738,
                15837
            ],
            [
                15837,
                15877
            ],
            [
                15877,
                15946
            ],
            [
                15946,
                16054
            ],
            [
                16054,
                16103
            ],
            [
                16103,
                16148
            ],
            [
                16148,
                16158
            ],
            [
                16158,
                16372
            ],
            [
                16372,
                16411
            ],
            [
                16411,
                16428
            ],
            [
                16428,
                16464
            ],
            [
                16464,
                16513
            ],
            [
                16513,
                16614
            ],
            [
                16614,
                16764
            ],
            [
                16764,
                16861
            ],
            [
                16861,
                17083
            ],
            [
                17083,
                17257
            ],
            [
                17257,
                17287
            ],
            [
                17287,
                17394
            ],
            [
                17394,
                17528
            ],
            [
                17528,
                17550
            ],
            [
                17550,
                17822
            ],
            [
                17822,
                17947
            ],
            [
                17947,
                18055
            ],
            [
                18055,
                18111
            ],
            [
                18111,
                18159
            ],
            [
                18159,
                18175
            ],
            [
                18175,
                18196
            ],
            [
                18196,
                18329
            ],
            [
                18329,
                18436
            ],
            [
                18436,
                18525
            ],
            [
                18525,
                18579
            ],
            [
                18579,
                18677
            ],
            [
                18677,
                18776
            ],
            [
                18776,
                18919
            ],
            [
                18919,
                19053
            ],
            [
                19053,
                19075
            ],
            [
                19075,
                19101
            ],
            [
                19101,
                19161
            ],
            [
                19161,
                19204
            ],
            [
                19204,
                19503
            ],
            [
                19503,
                19689
            ],
            [
                19689,
                19720
            ],
            [
                19720,
                19781
            ],
            [
                19781,
                19884
            ],
            [
                19884,
                19907
            ],
            [
                19907,
                20025
            ],
            [
                20025,
                20118
            ],
            [
                20118,
                20249
            ],
            [
                20249,
                20254
            ],
            [
                20254,
                20264
            ],
            [
                20264,
                20328
            ],
            [
                20328,
                20420
            ],
            [
                20420,
                20487
            ],
            [
                20487,
                20571
            ],
            [
                20571,
                20784
            ],
            [
                20784,
                20833
            ],
            [
                20833,
                21105
            ],
            [
                21105,
                21144
            ],
            [
                21144,
                21173
            ],
            [
                21173,
                21273
            ],
            [
                21273,
                21421
            ],
            [
                21421,
                21637
            ],
            [
                21637,
                21699
            ],
            [
                21699,
                21725
            ],
            [
                21725,
                21759
            ],
            [
                21759,
                21856
            ],
            [
                21856,
                21863
            ],
            [
                21863,
                21887
            ],
            [
                21887,
                21951
            ],
            [
                21951,
                22145
            ],
            [
                22145,
                22191
            ],
            [
                22191,
                22195
            ],
            [
                22195,
                22381
            ],
            [
                22381,
                22418
            ],
            [
                22418,
                22542
            ],
            [
                22542,
                22585
            ]
        ],
        "overlap_chars": [
            [
                0,
                15
            ],
            [
                27,
                113
            ],
            [
                133,
                287
            ],
            [
                287,
                326
            ],
            [
                337,
                339
            ],
            [
                339,
                469
            ],
            [
                469,
                484
            ],
            [
                523,
                529
            ],
            [
                550,
                585
            ],
            [
                610,
                629
            ],
            [
                634,
                693
            ],
            [
                693,
                712
            ],
            [
                719,
                748
            ],
            [
                748,
                768
            ],
            [
                797,
                874
            ],
            [
                935,
                980
            ],
            [
                997,
                999
            ],
            [
                999,
                1018
            ],
            [
                1019,
                1190
            ],
            [
                1200,
                1211
            ],
            [
                1211,
                1276
            ],
            [
                1276,
                1330
            ],
            [
                1508,
                1509
            ],
            [
                1332,
                1379
            ],
            [
                1381,
                1392
            ],
            [
                1405,
                1440
            ],
            [
                1442,
                1456
            ],
            [
                1549,
                1551
            ],
            [
                1551,
                1613
            ],
            [
                1622,
                1649
            ],
            [
                1687,
                1737
            ],
            [
                1677,
                1686
            ],
            [
                1738,
                1820
            ],
            [
                1820,
                1822
            ],
            [
                1836,
                1839
            ],
            [
                1854,
                1884
            ],
            [
                1884,
                1956
            ],
            [
                1982,
                1984
            ],
            [
                1984,
                2024
            ],
            [
                2118,
                2147
            ],
            [
                2147,
                2168
            ],
            [
                2168,
                2263
            ],
            [
                2263,
                2350
            ],
            [
                2350,
                2415
            ],
            [
                2415,
                2427
            ],
            [
                2629,
                2631
            ],
            [
                2664,
                2689
            ],
            [
                2689,
                2734
            ],
            [
                2744,
                2787
            ],
            [
                2923,
                2946
            ],
            [
                2971,
                2972
            ],
            [
                3272,
                3350
            ],
            [
                3350,
                3361
            ],
            [
                3361,
                3380
            ],
            [
                3380,
                3405
            ],
            [
                3405,
                3446
            ],
            [
                3446,
                3472
            ],
            [
                3472,
                3506
            ],
            [
                3518,
                3520
            ],
            [
                3520,
                3525
            ],
            [
                3537,
                3562
            ],
            [
                3570,
                3659
            ],
            [
                3720,
                3776
            ],
            [
                3778,
                3790
            ],
            [
                3792,
                3795
            ],
            [
                3799,
                3876
            ],
            [
                3881,
                3904
            ],
            [
                3926,
                3942
            ],
            [
                3942,
                3957
            ],
            [
                3957,
                4016
            ],
            [
                4039,
                4078
            ],
            [
                4078,
                4106
            ],
            [
                4139,
                4141
            ],
            [
                4176,
                4251
            ],
            [
                4284,
                4289
            ],
            [
                4289,
                4424
            ],
            [
                4424,
                4453
            ],
            [
                4469,
                4470
            ],
            [
                4475,
                4512
            ],
            [
                4516,
                4520
            ],
            [
                4520,
                4600
            ],
            [
                4617,
                4625
            ],
            [
                4605,
                4611
            ],
            [
                4630,
                4646
            ],
            [
                4670,
                4797
            ],
            [
                4797,
                4837
            ],
            [
                4837,
                4846
            ],
            [
                4883,
                4885
            ],
            [
                4872,
                4876
            ],
            [
                4941,
                4942
            ],
            [
                4866,
                4871
            ],
            [
                4948,
                4996
            ],
            [
                4996,
                5009
            ],
            [
                5038,
                5044
            ],
            [
                5053,
                5066
            ],
            [
                5045,
                5049
            ],
            [
                5077,
                5111
            ],
            [
                5014,
                5015
            ],
            [
                5200,
                5250
            ],
            [
                5250,
                5356
            ],
            [
                5404,
                5503
            ],
            [
                5546,
                5548
            ],
            [
                5548,
                5600
            ],
            [
                5602,
                5616
            ],
            [
                5616,
                5673
            ],
            [
                5757,
                5856
            ],
            [
                5904,
                5906
            ],
            [
                5906,
                5957
            ],
            [
                6004,
                6006
            ],
            [
                6006,
                6073
            ],
            [
                6092,
                6126
            ],
            [
                6173,
                6227
            ],
            [
                6126,
                6127
            ],
            [
                6228,
                6249
            ],
            [
                6260,
                6278
            ],
            [
                6278,
                6346
            ],
            [
                6360,
                6411
            ],
            [
                6411,
                6416
            ],
            [
                6416,
                6422
            ],
            [
                6432,
                6459
            ],
            [
                6536,
                6555
            ],
            [
                6575,
                6581
            ],
            [
                6603,
                6623
            ],
            [
                6631,
                6637
            ],
            [
                6659,
                6722
            ],
            [
                6722,
                6738
            ],
            [
                6853,
                6916
            ],
            [
                6799,
                6801
            ],
            [
                6929,
                6938
            ],
            [
                6962,
                6989
            ],
            [
                6989,
                7066
            ],
            [
                7066,
                7093
            ],
            [
                7093,
                7102
            ],
            [
                7158,
                7213
            ],
            [
                7215,
                7248
            ],
            [
                7248,
                7333
            ],
            [
                7397,
                7464
            ],
            [
                7477,
                7480
            ],
            [
                7480,
                7494
            ],
            [
                7512,
                7515
            ],
            [
                7519,
                7528
            ],
            [
                7528,
                7533
            ],
            [
                7533,
                7622
            ],
            [
                7622,
                7722
            ],
            [
                7722,
                7745
            ],
            [
                7803,
                7804
            ],
            [
                7806,
                7823
            ],
            [
                7887,
                7922
            ],
            [
                7945,
                7983
            ],
            [
                8031,
                8033
            ],
            [
                8033,
                8055
            ],
            [
                8055,
                8107
            ],
            [
                8112,
                8115
            ],
            [
                8153,
                8155
            ],
            [
                8155,
                8198
            ],
            [
                8280,
                8330
            ],
            [
                8446,
                8471
            ],
            [
                8739,
                8781
            ],
            [
                8781,
                8872
            ],
            [
                8894,
                8907
            ],
            [
                8909,
                8941
            ],
            [
                8941,
                9061
            ],
            [
                9061,
                9205
            ],
            [
                9205,
                9376
            ],
            [
                9408,
                9451
            ],
            [
                9498,
                9545
            ],
            [
                9545,
                9567
            ],
            [
                9591,
                9606
            ],
            [
                9606,
                9651
            ],
            [
                9778,
                9818
            ],
            [
                9841,
                9876
            ],
            [
                10297,
                10316
            ],
            [
                10508,
                10600
            ],
            [
                10602,
                10621
            ],
            [
                10631,
                10664
            ],
            [
                10664,
                10708
            ],
            [
                10830,
                10832
            ],
            [
                10881,
                10894
            ],
            [
                10894,
                10919
            ],
            [
                10919,
                10950
            ],
            [
                10970,
                10999
            ],
            [
                11359,
                11463
            ],
            [
                11463,
                11526
            ],
            [
                11556,
                11680
            ],
            [
                11761,
                11823
            ],
            [
                11874,
                11945
            ],
            [
                11965,
                11980
            ],
            [
                11981,
                12007
            ],
            [
                12007,
                12150
            ],
            [
                12150,
                12254
            ],
            [
                12254,
                12306
            ],
            [
                12325,
                12363
            ],
            [
                12394,
                12396
            ],
            [
                12396,
                12516
            ],
            [
                12530,
                12561
            ],
            [
                12568,
                12572
            ],
            [
                12587,
                12600
            ],
            [
                12856,
                12902
            ],
            [
                12951,
                13004
            ],
            [
                13004,
                13079
            ],
            [
                13084,
                13089
            ],
            [
                13109,
                13176
            ],
            [
                13225,
                13226
            ],
            [
                13316,
                13483
            ],
            [
                13483,
                13627
            ],
            [
                13645,
                13673
            ],
            [
                13702,
                13706
            ],
            [
                13716,
                13738
            ],
            [
                13739,
                13779
            ],
            [
                13785,
                13839
            ],
            [
                13839,
                13903
            ],
            [
                13913,
                14006
            ],
            [
                14006,
                14011
            ],
            [
                14017,
                14054
            ],
            [
                14054,
                14163
            ],
            [
                14184,
                14218
            ],
            [
                14219,
                14276
            ],
            [
                14276,
                14293
            ],
            [
                14313,
                14329
            ],
            [
                14341,
                14400
            ],
            [
                14412,
                14421
            ],
            [
                14438,
                14443
            ],
            [
                14451,
                14483
            ],
            [
                14489,
                14593
            ],
            [
                14593,
                14637
            ],
            [
                14637,
                14679
            ],
            [
                14696,
                14697
            ],
            [
                14749,
                14776
            ],
            [
                14776,
                14853
            ],
            [
                14853,
                14988
            ],
            [
                14988,
                15036
            ],
            [
                15094,
                15096
            ],
            [
                15096,
                15139
            ],
            [
                15139,
                15188
            ],
            [
                15244,
                15264
            ],
            [
                15302,
                15327
            ],
            [
                15327,
                15435
            ],
            [
                15738,
                15761
            ],
            [
                15769,
                15837
            ],
            [
                15837,
                15877
            ],
            [
                15877,
                15946
            ],
            [
                15946,
                16054
            ],
            [
                16054,
                16103
            ],
            [
                16103,
                16148
            ],
            [
                16148,
                16158
            ],
            [
                16158,
                16368
            ],
            [
                16372,
                16391
            ],
            [
                16399,
                16400
            ],
            [
                16408,
                16411
            ],
            [
                16411,
                16428
            ],
            [
                16464,
                16513
            ],
            [
                16513,
                16614
            ],
            [
                16614,
                16629
            ],
            [
                16675,
                16690
            ],
            [
                16657,
                16663
            ],
            [
                16695,
                16764
            ],
            [
                16764,
                16826
            ],
            [
                16859,
                16861
            ],
            [
                16861,
                16976
            ],
            [
                16978,
                17083
            ],
            [
                17083,
                17124
            ],
            [
                17153,
                17164
            ],
            [
                17222,
                17257
            ],
            [
                17257,
                17287
            ],
            [
                17287,
                17336
            ],
            [
                17345,
                17346
            ],
            [
                17347,
                17394
            ],
            [
                17394,
                17491
            ],
            [
                17500,
                17508
            ],
            [
                17526,
                17528
            ],
            [
                17528,
                17550
            ],
            [
                17550,
                17551
            ],
            [
                17754,
                17757
            ],
            [
                17746,
                17747
            ],
            [
                17744,
                17746
            ],
            [
                17780,
                17811
            ],
            [
                17614,
                17618
            ],
            [
                17818,
                17822
            ],
            [
                17835,
                17947
            ],
            [
                17947,
                17966
            ],
            [
                18037,
                18055
            ],
            [
                18055,
                18111
            ],
            [
                18111,
                18148
            ],
            [
                18157,
                18159
            ],
            [
                18159,
                18175
            ],
            [
                18175,
                18196
            ],
            [
                18196,
                18329
            ],
            [
                18329,
                18364
            ],
            [
                18434,
                18436
            ],
            [
                18436,
                18481
            ],
            [
                18490,
                18525
            ],
            [
                18525,
                18555
            ],
            [
                18572,
                18575
            ],
            [
                18725,
                18741
            ],
            [
                18701,
                18719
            ],
            [
                18758,
                18776
            ],
            [
                18776,
                18809
            ],
            [
                18864,
                18919
            ],
            [
                18919,
                19053
            ],
            [
                19053,
                19075
            ],
            [
                19075,
                19101
            ],
            [
                19101,
                19161
            ],
            [
                19161,
                19204
            ],
            [
                19204,
                19207
            ],
            [
                19294,
                19295
            ],
            [
                19337,
                19341
            ],
            [
                19394,
                19405
            ],
            [
                19409,
                19419
            ],
            [
                19207,
                19208
            ],
            [
                19429,
                19461
            ],
            [
                19471,
                19481
            ],
            [
                19488,
                19503
            ],
            [
                19503,
                19689
            ],
            [
                19689,
                19720
            ],
            [
                19720,
                19781
            ],
            [
                19781,
                19884
            ],
            [
                19884,
                19907
            ],
            [
                19907,
                19912
            ],
            [
                19918,
                19940
            ],
            [
                20004,
                20025
            ],
            [
                20025,
                20118
            ],
            [
                20118,
                20249
            ],
            [
                20249,
                20254
            ],
            [
                20254,
                20264
            ],
            [
                20264,
                20328
            ],
            [
                20328,
                20420
            ],
            [
                20420,
                20437
            ],
            [
                20454,
                20486
            ],
            [
                20571,
                20621
            ],
            [
                20635,
                20784
            ],
            [
                20784,
                20804
            ],
            [
                20813,
                20833
            ],
            [
                20833,
                20952
            ],
            [
                20956,
                21009
            ],
            [
                21102,
                21105
            ],
            [
                21105,
                21144
            ],
            [
                21144,
                21173
            ],
            [
                21173,
                21273
            ],
            [
                21273,
                21332
            ],
            [
                21363,
                21421
            ],
            [
                21421,
                21484
            ],
            [
                21509,
                21561
            ],
            [
                21623,
                21637
            ],
            [
                21637,
                21662
            ],
            [
                21670,
                21699
            ],
            [
                21699,
                21725
            ],
            [
                21725,
                21759
            ],
            [
                21759,
                21783
            ],
            [
                21793,
                21856
            ],
            [
                21856,
                21863
            ],
            [
                21863,
                21887
            ],
            [
                21887,
                21951
            ],
            [
                21951,
                22059
            ],
            [
                22065,
                22086
            ],
            [
                22093,
                22145
            ],
            [
                22145,
                22191
            ],
            [
                22191,
                22195
            ],
            [
                22195,
                22256
            ],
            [
                22260,
                22268
            ],
            [
                22257,
                22259
            ],
            [
                22272,
                22283
            ],
            [
                22297,
                22381
            ],
            [
                22381,
                22418
            ],
            [
                22418,
                22542
            ],
            [
                22542,
                22585
            ]
        ],
        "row_chars": [
            [
                0,
                113
            ],
            [
                113,
                287
            ],
            [
                287,
                339
            ],
            [
                339,
                469
            ],
            [
                469,
                693
            ],
            [
                693,
                748
            ],
            [
                748,
                875
            ],
            [
                875,
                935
            ],
            [
                935,
                999
            ],
            [
                999,
                1211
            ],
            [
                1211,
                1276
            ],
            [
                1276,
                1551
            ],
            [
                1551,
                1649
            ],
            [
                1649,
                1738
            ],
            [
                1738,
                1820
            ],
            [
                1820,
                1884
            ],
            [
                1884,
                1984
            ],
            [
                1984,
                2024
            ],
            [
                2024,
                2147
            ],
            [
                2147,
                2168
            ],
            [
                2168,
                2263
            ],
            [
                2263,
                2350
            ],
            [
                2350,
                2415
            ],
            [
                2415,
                2427
            ],
            [
                2427,
                2499
            ],
            [
                2499,
                2629
            ],
            [
                2629,
                2689
            ],
            [
                2689,
                2787
            ],
            [
                2787,
                2909
            ],
            [
                2909,
                2923
            ],
            [
                2923,
                3350
            ],
            [
                3350,
                3361
            ],
            [
                3361,
                3380
            ],
            [
                3380,
                3405
            ],
            [
                3405,
                3446
            ],
            [
                3446,
                3472
            ],
            [
                3472,
                3520
            ],
            [
                3520,
                3799
            ],
            [
                3799,
                3942
            ],
            [
                3942,
                3957
            ],
            [
                3957,
                4016
            ],
            [
                4016,
                4039
            ],
            [
                4039,
                4078
            ],
            [
                4078,
                4141
            ],
            [
                4141,
                4176
            ],
            [
                4176,
                4289
            ],
            [
                4289,
                4424
            ],
            [
                4424,
                4520
            ],
            [
                4520,
                4646
            ],
            [
                4646,
                4670
            ],
            [
                4670,
                4797
            ],
            [
                4797,
                4837
            ],
            [
                4837,
                4846
            ],
            [
                4846,
                4996
            ],
            [
                4996,
                5250
            ],
            [
                5250,
                5356
            ],
            [
                5356,
                5404
            ],
            [
                5404,
                5548
            ],
            [
                5548,
                5616
            ],
            [
                5616,
                5673
            ],
            [
                5673,
                5757
            ],
            [
                5757,
                5906
            ],
            [
                5906,
                6006
            ],
            [
                6006,
                6278
            ],
            [
                6278,
                6411
            ],
            [
                6411,
                6416
            ],
            [
                6416,
                6459
            ],
            [
                6459,
                6515
            ],
            [
                6515,
                6536
            ],
            [
                6536,
                6722
            ],
            [
                6722,
                6738
            ],
            [
                6738,
                6989
            ],
            [
                6989,
                7066
            ],
            [
                7066,
                7093
            ],
            [
                7093,
                7248
            ],
            [
                7248,
                7480
            ],
            [
                7480,
                7528
            ],
            [
                7528,
                7533
            ],
            [
                7533,
                7622
            ],
            [
                7622,
                7722
            ],
            [
                7722,
                7826
            ],
            [
                7826,
                7847
            ],
            [
                7847,
                7855
            ],
            [
                7855,
                7870
            ],
            [
                7870,
                7887
            ],
            [
                7887,
                7922
            ],
            [
                7922,
                8033
            ],
            [
                8033,
                8055
            ],
            [
                8055,
                8155
            ],
            [
                8155,
                8330
            ],
            [
                8330,
                8380
            ],
            [
                8380,
                8446
            ],
            [
                8446,
                8471
            ],
            [
                8471,
                8527
            ],
            [
                8527,
                8738
            ],
            [
                8738,
                8781
            ],
            [
                8781,
                8872
            ],
            [
                8872,
                8941
            ],
            [
                8941,
                9061
            ],
            [
                9061,
                9205
            ],
            [
                9205,
                9376
            ],
            [
                9376,
                9397
            ],
            [
                9397,
                9408
            ],
            [
                9408,
                9451
            ],
            [
                9451,
                9498
            ],
            [
                9498,
                9545
            ],
            [
                9545,
                9606
            ],
            [
                9606,
                9651
            ],
            [
                9651,
                9733
            ],
            [
                9733,
                9738
            ],
            [
                9738,
                9763
            ],
            [
                9763,
                9778
            ],
            [
                9778,
                10316
            ],
            [
                10316,
                10497
            ],
            [
                10497,
                10508
            ],
            [
                10508,
                10664
            ],
            [
                10664,
                10832
            ],
            [
                10832,
                10881
            ],
            [
                10881,
                10894
            ],
            [
                10894,
                10919
            ],
            [
                10919,
                10999
            ],
            [
                10999,
                11153
            ],
            [
                11153,
                11359
            ],
            [
                11359,
                11463
            ],
            [
                11463,
                11680
            ],
            [
                11680,
                11761
            ],
            [
                11761,
                12007
            ],
            [
                12007,
                12150
            ],
            [
                12150,
                12254
            ],
            [
                12254,
                12396
            ],
            [
                12396,
                12601
            ],
            [
                12601,
                12731
            ],
            [
                12731,
                12856
            ],
            [
                12856,
                13004
            ],
            [
                13004,
                13227
            ],
            [
                13227,
                13316
            ],
            [
                13316,
                13483
            ],
            [
                13483,
                13739
            ],
            [
                13739,
                13839
            ],
            [
                13839,
                14006
            ],
            [
                14006,
                14054
            ],
            [
                14054,
                14219
            ],
            [
                14219,
                14276
            ],
            [
                14276,
                14593
            ],
            [
                14593,
                14637
            ],
            [
                14637,
                14776
            ],
            [
                14776,
                14853
            ],
            [
                14853,
                14988
            ],
            [
                14988,
                15096
            ],
            [
                15096,
                15139
            ],
            [
                15139,
                15327
            ],
            [
                15327,
                15435
            ],
            [
                15435,
                15738
            ],
            [
                15738,
                15837
            ],
            [
                15837,
                15877
            ],
            [
                15877,
                15946
            ],
            [
                15946,
                16054
            ],
            [
                16054,
                16103
            ],
            [
                16103,
                16148
            ],
            [
                16148,
                16158
            ],
            [
                16158,
                16372
            ],
            [
                16372,
                16411
            ],
            [
                16411,
                16428
            ],
            [
                16428,
                16464
            ],
            [
                16464,
                16513
            ],
            [
                16513,
                16614
            ],
            [
                16614,
                16764
            ],
            [
                16764,
                16861
            ],
            [
                16861,
                17083
            ],
            [
                17083,
                17257
            ],
            [
                17257,
                17287
            ],
            [
                17287,
                17394
            ],
            [
                17394,
                17528
            ],
            [
                17528,
                17550
            ],
            [
                17550,
                17822
            ],
            [
                17822,
                17947
            ],
            [
                17947,
                18055
            ],
            [
                18055,
                18111
            ],
            [
                18111,
                18159
            ],
            [
                18159,
                18175
            ],
            [
                18175,
                18196
            ],
            [
                18196,
                18329
            ],
            [
                18329,
                18436
            ],
            [
                18436,
                18525
            ],
            [
                18525,
                18776
            ],
            [
                18776,
                18919
            ],
            [
                18919,
                19053
            ],
            [
                19053,
                19075
            ],
            [
                19075,
                19101
            ],
            [
                19101,
                19161
            ],
            [
                19161,
                19204
            ],
            [
                19204,
                19503
            ],
            [
                19503,
                19689
            ],
            [
                19689,
                19720
            ],
            [
                19720,
                19781
            ],
            [
                19781,
                19884
            ],
            [
                19884,
                19907
            ],
            [
                19907,
                20025
            ],
            [
                20025,
                20118
            ],
            [
                20118,
                20249
            ],
            [
                20249,
                20254
            ],
            [
                20254,
                20264
            ],
            [
                20264,
                20328
            ],
            [
                20328,
                20420
            ],
            [
                20420,
                20487
            ],
            [
                20487,
                20571
            ],
            [
                20571,
                20784
            ],
            [
                20784,
                20833
            ],
            [
                20833,
                21105
            ],
            [
                21105,
                21144
            ],
            [
                21144,
                21173
            ],
            [
                21173,
                21273
            ],
            [
                21273,
                21421
            ],
            [
                21421,
                21637
            ],
            [
                21637,
                21699
            ],
            [
                21699,
                21725
            ],
            [
                21725,
                21759
            ],
            [
                21759,
                21856
            ],
            [
                21856,
                21863
            ],
            [
                21863,
                21887
            ],
            [
                21887,
                21951
            ],
            [
                21951,
                22145
            ],
            [
                22145,
                22191
            ],
            [
                22191,
                22195
            ],
            [
                22195,
                22381
            ],
            [
                22381,
                22418
            ],
            [
                22418,
                22542
            ],
            [
                22542,
                22585
            ]
        ]
    },
    "abridged": {
        "text": "The days when I visited that miserable corner which my dear girl brightened can never fade in my remembrance. I never wish to see it now; I have been there only once since, but in my memory there is a mournful glory shining on the place which will shine for ever.\nNot a day passed without my going there. At first I found Mr. Skimpole there, on two or three occasions, idly playing the piano and talking in his usual vivacious strain. Now, besides my fear of his making Richard poorer, I felt as if his careless gaiety was inconsistent with what I knew of the depths of Ada's life. I clearly perceived that Ada shared my feelings. I therefore resolved to make a private visit to Mr. Skimpole and try delicately to explain myself.\nI set off one morning, accompanied by Charley. As I approached the Skimpole house, I was strongly inclined to turn back, for I felt what a desperate attempt it was to make an impression on Mr. Skimpole and how extremely likely it was that he would defeat me. However, I thought that being there, I would go through with it. I knocked with a trembling hand at Mr. Skimpole's door - literally with a hand, for the knocker was gone - and after a while gained admission from an Irishwoman who was in the yard.\nMr. Skimpole, lying on the sofa in his room, playing the flute, was enchanted to see me. Who would I prefer for mistress of the ceremonies? he asked. Would I have his Comedy daughter, his Beauty daughter, or his Sentiment daughter? Or all three at once in a perfect nosegay?\nI replied, half defeated already, that I wished to speak to himself only.\n\"My dear Miss Summerson, most joyfully! Of course it's not business. Then it's pleasure!\"\nI said it certainly was not business that I came upon, but it was not quite a pleasant matter.\n\"Then, my dear Miss Summerson,\" said he with the frankest gaiety, \"don't allude to it. Why should you allude to anything that is not a pleasant matter? I never do. So let us talk of something else.\"\nAlthough I was embarrassed, I took courage to say that I still wished to pursue the subject.\n\"Mr. Skimpole,\" said I, \"I think you ought most seriously to know that Richard is poorer than he was.\"\n\"Dear me!\" said Mr. Skimpole. \"So am I, they tell me.\"\n\"And in very embarrassed circumstances.\"\n\"Parallel case, exactly!\" said Mr. Skimpole with a delighted face.\n\"This naturally causes Ada much anxiety, and as I think she is less anxious when no claims are made upon her by visitors, it has occurred to me to take the liberty of saying that - if you would - not-\"\nI was coming to the point with great difficulty when he took me by both hands with a radiant face and anticipated it.\n\"Not go there? Certainly not, my dear Miss Summerson, most assuredly not. When I go anywhere, I go for pleasure. I don't go anywhere for pain. Now, I have had very little pleasure at our dear Richard's lately, and your wisdom shows why. Our young friends, losing the youthful poetry which was once so captivating in them, begin to think, 'This is a man who wants pounds.' So I am; I always want pounds, because tradespeople always want them from me. Next, our young friends begin to think, becoming mercenary, 'This is the man who borrowed pounds,' which I did. So our young friends, reduced to prose (which is much to be regretted), degenerate in their power of imparting pleasure to me. Why should I go to see them, therefore? Absurd!\"\nThis he said with a smile of disinterested benevolence quite astonishing.\n\"Besides,\" he went on in his light-hearted tone, \"if I don't go anywhere for pain, why should I go anywhere to be the cause of pain? If I went to see our young friends in their present ill-regulated state of mind, I should give them pain. They might say, 'This is the man who had pounds and who can't pay pounds,' which I can't, of course! Then kindness requires that I shouldn't go near them - and I won't.\"\nHe finished by genially kissing my hand and thanking me. I was much disconcerted, but I reflected that if the main point were gained, it mattered little how. I had determined to mention something else, however.\n\"Mr. Skimpole,\" said I, \"I must take the liberty of saying before I go that I was much surprised to learn recently that you knew with whom that poor boy left Bleak House, and that you accepted money on that occasion. I have not mentioned it to my guardian, for I fear it would hurt him; but I may say to you that I was much surprised.\"\n\"No? Really, my dear Miss Summerson?\" He thought about it with a whimsical expression, then said in his most engaging manner, \"You know what a child I am. Why surprised?\"\nI gave him to understand in the gentlest words I could use that he seemed to have disregarded several moral obligations. He was much amused and interested when he heard this and said, \"No, really?\" with ingenuous simplicity.\n\"You know that responsibility is a thing that has always been above me - or below me,\" said Mr. Skimpole. \"I don't even know which; but as I understand the way in which my dear Miss Summerson puts this case, I should imagine it was chiefly a question of money?\"\nI incautiously assented to this.\n\"Ah! Then you see,\" said Mr. Skimpole, shaking his head, \"I am hopeless of understanding it.\"\nI suggested, as I rose to go, that it was not right to betray my guardian's confidence for a bribe.\n\"My dear Miss Summerson, I can't be bribed. I don't attach any value to money. I don't know about it, I don't want it. How can I be bribed?\"\nI showed that I was of a different opinion, though I was not able to argue.\n\"On the contrary,\" said Mr. Skimpole, \"I am above the rest of mankind in such a case as that. I am as free as the air. Observe the case, my dear Miss Summerson. Here is a boy received into the house and put to bed in a state that I strongly object to. A man arrives - like the house that Jack built. Here is the man who demands the boy who is received into the house and put to bed in a state that I strongly object to. Here is a bank-note produced by the man who demands the boy who is received into the house and put to bed in a state that I strongly object to. Here is the Skimpole who accepts the bank-note produced by the man who demands the boy who is received into the house and put to bed in a state that I strongly object to. Should the Skimpole have refused the note? Skimpole protests to Bucket, 'What's this for? I don't understand it, take it away.' Bucket still entreats Skimpole to accept it. Skimpole reasons with himself, this is a police-officer, an intelligent man, useful to society. If it is blameable in Skimpole to take the note, it is blameable in Bucket to offer the note - much more blameable, because he is the knowing man. Now, Skimpole wishes to think well of Bucket. And he does. And that's all he does!\"\nI had nothing to offer in reply and therefore took my leave. As it so happened that I never saw Mr. Skimpole again, I may at once finish what I know of his history. A coolness arose between him and my guardian, based principally on his having heartlessly disregarded my guardian's entreaties (as we afterwards learned from Ada) in reference to Richard. He died some five years afterwards and left a diary behind him, which was published and which showed him to have been the victim of a part of mankind combining against an amiable child. It was considered very pleasant reading, but I never read more of it myself than the sentence on which I chanced to light on opening the book. It was this: \"Jarndyce, in common with most other men I have known, is the incarnation of selfishness.\"\nAnd now I come to a part of my story touching myself, and for which I was quite unprepared. Whatever little lingerings may have now and then revived in my mind associated with my poor old face had only revived as a part of my life that was gone, like my childhood.\nThe months were gliding away, and my dear girl was the same beautiful star in the miserable corner. Richard, more worn and haggard, haunted the court day after day, listlessly sitting there even when he knew there was no remote chance of the suit being mentioned.\nSo completely was he absorbed in his fixed idea that he used to avow in his cheerful moments that he should never have breathed the fresh air now \"but for Woodcourt.\" It was only Mr. Woodcourt who could occasionally divert his attention for a few hours at a time and rouse him, even when he sunk into a lethargy that alarmed us greatly, and that returned more frequently as the months went on.\nMy dear girl was right in saying that he pursued his errors the more desperately for her sake. I have no doubt that his desire to retrieve what he had lost was made the more intense by his grief for his young wife, and became like the madness of a gamester.\nI was at their lodgings, as I have mentioned, at all hours. When I was there at night, I generally went home with Charley in a coach; sometimes my guardian would meet me, and we would walk home together.\nOne evening he had arranged to meet me at eight o'clock. I could not leave quite punctually, for I was working for my dear girl and had a few stitches to finish; but within a few minutes of the hour I bundled up my little work-basket, gave my darling my last kiss for the night, and hurried downstairs. Mr. Woodcourt went with me, as it was dusk.\nWhen we came to the usual place of meeting, my guardian was not there. We waited half an hour, walking up and down, but there were no signs of him. We agreed that he was either prevented from coming or that he had come and gone away, and Mr. Woodcourt proposed to walk home with me.\nIt was the first walk we had ever taken together. We spoke of Richard and Ada the whole way. I did not thank him in words for what he had done, but I hoped he might understand what I felt so strongly.\nArriving at home and going upstairs, we found that my guardian was out and that Mrs. Woodcourt was out too. We were standing by the open window looking down into the street when Mr. Woodcourt spoke to me. I learned in a moment that he loved me. I learned in a moment that my scarred face was all unchanged to him. I learned in a moment that what I had thought was pity and compassion was devoted, generous, faithful love. Oh, too late to know it now, too late, too late. That was the first ungrateful thought I had. Too late.\n\"When I returned,\" he told me, \"when I came back, no richer than when I went away, and found you newly risen from a sick bed, yet so inspired by sweet consideration for others and so free from a selfish thought-\"\n\"Oh, Mr. Woodcourt, stop, stop!\" I entreated him. \"I had many selfish thoughts at that time, many!\"\n\"Heaven knows, beloved of my life,\" said he, \"that my praise is not a lover's praise, but the truth. You do not know how many hearts Esther touches and awakens, what sacred admiration and what love she wins.\"\n\"Oh, Mr. Woodcourt,\" cried I, \"it is a great thing to win love! I am proud of it, and honoured by it; and the hearing of it causes me to shed these tears of mingled joy and sorrow - joy that I have won it, sorrow that I have not deserved it better; but I am not free to think of yours.\"\nI said it with a stronger heart, for when I heard his praise I aspired to be more worthy of it. It was not too late for that. Although I closed this unforeseen page in my life tonight, I felt I could be worthier of it all through my life. And it was a comfort to me, and an impulse to me, and I felt a dignity rise up within me that was gained from him.\nHe broke the silence.\n\"Dear Esther, if you are not free to think of my love, I will not urge it. Let me only tell you that the fond idea of you which I took abroad was exalted to the heavens when I came home. I have always hoped to tell you this. I have always feared that I should tell it you in vain. My hopes and fears are both fulfilled tonight. I distress you. I have said enough.\"\nSomething seemed to pass into my place that was like the angel he thought me, and I felt so sorrowful for the loss he had sustained! I wished to help him in his trouble.\n\"Dear Mr. Woodcourt,\" said I, \"before we part tonight, something is left for me to say. I never could say it as I wish - but - but I shall treasure the memory of your generosity to my dying hour. I know full well how changed I am. I know what a noble love that is which is so faithful. What you have said to me could have affected me so much from no other lips, for there are none that could give it such a value to me. It shall not be lost. It shall make me better.\"\nHe covered his eyes with his hand and turned away his head. How could I ever be worthy of those tears?\n\"If I am ever better than I used to be,\" I said, \"believe that it will have sprung up from tonight and that I owe it to you. And never believe, dear dear Mr. Woodcourt, never believe that I forget this night or that while my heart beats it can be insensible to the pride and joy of having been beloved by you.\"\nHe took my hand and kissed it. He was like himself again, and I felt still more encouraged.\n\"I am induced by what you said just now,\" said I, \"to hope that you have succeeded in your endeavour.\"\n\"I have,\" he answered. \"With help from Mr. Jarndyce, I have succeeded.\"\n\"Heaven bless him for it,\" said I, giving him my hand; \"and heaven bless you in all you do!\"\n\"I shall do it better for the wish,\" he answered; \"it will make me enter on these new duties as on another sacred trust from you.\"\n\"Ah! Richard!\" I exclaimed involuntarily, \"What will he do when you are gone!\"\n\"I am not required to go yet; I would not desert him, dear Miss Summerson, even if I were.\"\nOne other thing I needed to touch upon before he left me.\n\"Mr. Woodcourt,\" said I, \"you will be glad to know before I say good night that in the future, which is clear and bright before me, I am most happy, most fortunate, have nothing to regret or desire.\"\nIt was indeed a gladness to him, he replied.\n\"From my childhood I have been,\" said I, \"the object of the untiring goodness of the best of human beings, to whom I am bound by every tie of attachment, gratitude, and love.\"\n\"I share those feelings,\" he returned. \"You speak of Mr. Jarndyce.\"\n\"You know his virtues well,\" said I, \"but few can know the greatness of his character as I know it. All its highest and best qualities have been revealed to me in the shaping out of that future in which I am so happy. And if your highest homage and respect had not been his already, they would have been his, I think, on this assurance, for my sake.\"\nHe fervently replied that indeed they would have been. I gave him my hand again.\n\"Good night,\" I said, \"Good-bye.\"\n\"The first until we meet tomorrow, the second as a farewell to this theme between us for ever.\"\n\"Yes.\"\n\"Good night; good-bye.\"\nHe left me, and I stood at the dark window watching the street. His love, in all its constancy and generosity, had come so suddenly upon me that he had not left me a minute before my fortitude gave way and the street was blotted out by my rushing tears.\nBut they were not tears of regret and sorrow. No. He had called me the beloved of his life and had said I would evermore be dear to him, and I felt as if my heart would not hold the triumph of having heard those words. My first wild thought had died away. It was not too late to hear them, for it was not too late to be animated by them to be good, true, grateful, and contented. How easy my path, how much easier than his!",
        "paragraph_chars": [
            [
                0,
                264
            ],
            [
                264,
                730
            ],
            [
                730,
                1236
            ],
            [
                1236,
                1511
            ],
            [
                1511,
                1585
            ],
            [
                1585,
                1675
            ],
            [
                1675,
                1770
            ],
            [
                1770,
                1969
            ],
            [
                1969,
                2062
            ],
            [
                2062,
                2165
            ],
            [
                2165,
                2220
            ],
            [
                2220,
                2261
            ],
            [
                2261,
                2328
            ],
            [
                2328,
                2530
            ],
            [
                2530,
                2648
            ],
            [
                2648,
                3386
            ],
            [
                3386,
                3460
            ],
            [
                3460,
                3869
            ],
            [
                3869,
                4080
            ],
            [
                4080,
                4416
            ],
            [
                4416,
                4587
            ],
            [
                4587,
                4812
            ],
            [
                4812,
                5074
            ],
            [
                5074,
                5107
            ],
            [
                5107,
                5201
            ],
            [
                5201,
                5301
            ],
            [
                5301,
                5442
            ],
            [
                5442,
                5518
            ],
            [
                5518,
                6753
            ],
            [
                6753,
                7539
            ],
            [
                7539,
                7804
            ],
            [
                7804,
                8068
            ],
            [
                8068,
                8462
            ],
            [
                8462,
                8720
            ],
            [
                8720,
                8924
            ],
            [
                8924,
                9271
            ],
            [
                9271,
                9554
            ],
            [
                9554,
                9755
            ],
            [
                9755,
                10281
            ],
            [
                10281,
                10494
            ],
            [
                10494,
                10594
            ],
            [
                10594,
                10803
            ],
            [
                10803,
                11090
            ],
            [
                11090,
                11444
            ],
            [
                11444,
                11466
            ],
            [
                11466,
                11831
            ],
            [
                11831,
                12001
            ],
            [
                12001,
                12469
            ],
            [
                12469,
                12572
            ],
            [
                12572,
                12883
            ],
            [
                12883,
                12975
            ],
            [
                12975,
                13078
            ],
            [
                13078,
                13150
            ],
            [
                13150,
                13243
            ],
            [
                13243,
                13374
            ],
            [
                13374,
                13453
            ],
            [
                13453,
                13545
            ],
            [
                13545,
                13603
            ],
            [
                13603,
                13803
            ],
            [
                13803,
                13848
            ],
            [
                13848,
                14024
            ],
            [
                14024,
                14092
            ],
            [
                14092,
                14443
            ],
            [
                14443,
                14524
            ],
            [
                14524,
                14558
            ],
            [
                14558,
                14654
            ],
            [
                14654,
                14661
            ],
            [
                14661,
                14685
            ],
            [
                14685,
                14939
            ],
            [
                14939,
                15362
            ]
        ],
        "segment_chars": [
            [
                0,
                110
            ],
            [
                110,
                264
            ],
            [
                264,
                305
            ],
            [
                305,
                435
            ],
            [
                435,
                582
            ],
            [
                582,
                631
            ],
            [
                631,
                730
            ],
            [
                730,
                777
            ],
            [
                777,
                989
            ],
            [
                989,
                1054
            ],
            [
                1054,
                1236
            ],
            [
                1236,
                1325
            ],
            [
                1325,
                1376
            ],
            [
                1376,
                1386
            ],
            [
                1386,
                1468
            ],
            [
                1468,
                1511
            ],
            [
                1511,
                1585
            ],
            [
                1585,
                1625
            ],
            [
                1625,
                1654
            ],
            [
                1654,
                1675
            ],
            [
                1675,
                1770
            ],
            [
                1770,
                1857
            ],
            [
                1857,
                1922
            ],
            [
                1922,
                1934
            ],
            [
                1934,
                1969
            ],
            [
                1969,
                2062
            ],
            [
                2062,
                2165
            ],
            [
                2165,
                2176
            ],
            [
                2176,
                2195
            ],
            [
                2195,
                2220
            ],
            [
                2220,
                2261
            ],
            [
                2261,
                2287
            ],
            [
                2287,
                2328
            ],
            [
                2328,
                2530
            ],
            [
                2530,
                2648
            ],
            [
                2648,
                2663
            ],
            [
                2663,
                2722
            ],
            [
                2722,
                2761
            ],
            [
                2761,
                2791
            ],
            [
                2791,
                2885
            ],
            [
                2885,
                3020
            ],
            [
                3020,
                3098
            ],
            [
                3098,
                3210
            ],
            [
                3210,
                3337
            ],
            [
                3337,
                3377
            ],
            [
                3377,
                3386
            ],
            [
                3386,
                3460
            ],
            [
                3460,
                3593
            ],
            [
                3593,
                3699
            ],
            [
                3699,
                3800
            ],
            [
                3800,
                3869
            ],
            [
                3869,
                3926
            ],
            [
                3926,
                4027
            ],
            [
                4027,
                4080
            ],
            [
                4080,
                4297
            ],
            [
                4297,
                4416
            ],
            [
                4416,
                4421
            ],
            [
                4421,
                4454
            ],
            [
                4454,
                4571
            ],
            [
                4571,
                4587
            ],
            [
                4587,
                4708
            ],
            [
                4708,
                4785
            ],
            [
                4785,
                4812
            ],
            [
                4812,
                4918
            ],
            [
                4918,
                5074
            ],
            [
                5074,
                5107
            ],
            [
                5107,
                5112
            ],
            [
                5112,
                5201
            ],
            [
                5201,
                5301
            ],
            [
                5301,
                5345
            ],
            [
                5345,
                5380
            ],
            [
                5380,
                5420
            ],
            [
                5420,
                5442
            ],
            [
                5442,
                5518
            ],
            [
                5518,
                5612
            ],
            [
                5612,
                5637
            ],
            [
                5637,
                5679
            ],
            [
                5679,
                5770
            ],
            [
                5770,
                5818
            ],
            [
                5818,
                5938
            ],
            [
                5938,
                6082
            ],
            [
                6082,
                6253
            ],
            [
                6253,
                6296
            ],
            [
                6296,
                6343
            ],
            [
                6343,
                6381
            ],
            [
                6381,
                6426
            ],
            [
                6426,
                6522
            ],
            [
                6522,
                6669
            ],
            [
                6669,
                6715
            ],
            [
                6715,
                6728
            ],
            [
                6728,
                6753
            ],
            [
                6753,
                6814
            ],
            [
                6814,
                6918
            ],
            [
                6918,
                7106
            ],
            [
                7106,
                7292
            ],
            [
                7292,
                7435
            ],
            [
                7435,
                7539
            ],
            [
                7539,
                7631
            ],
            [
                7631,
                7804
            ],
            [
                7804,
                7904
            ],
            [
                7904,
                8068
            ],
            [
                8068,
                8235
            ],
            [
                8235,
                8462
            ],
            [
                8462,
                8557
            ],
            [
                8557,
                8720
            ],
            [
                8720,
                8780
            ],
            [
                8780,
                8924
            ],
            [
                8924,
                8981
            ],
            [
                8981,
                9227
            ],
            [
                9227,
                9271
            ],
            [
                9271,
                9342
            ],
            [
                9342,
                9419
            ],
            [
                9419,
                9554
            ],
            [
                9554,
                9604
            ],
            [
                9604,
                9647
            ],
            [
                9647,
                9755
            ],
            [
                9755,
                9863
            ],
            [
                9863,
                9960
            ],
            [
                9960,
                10000
            ],
            [
                10000,
                10069
            ],
            [
                10069,
                10177
            ],
            [
                10177,
                10226
            ],
            [
                10226,
                10271
            ],
            [
                10271,
                10281
            ],
            [
                10281,
                10494
            ],
            [
                10494,
                10527
            ],
            [
                10527,
                10544
            ],
            [
                10544,
                10594
            ],
            [
                10594,
                10695
            ],
            [
                10695,
                10803
            ],
            [
                10803,
                10867
            ],
            [
                10867,
                11090
            ],
            [
                11090,
                11186
            ],
            [
                11186,
                11216
            ],
            [
                11216,
                11329
            ],
            [
                11329,
                11444
            ],
            [
                11444,
                11466
            ],
            [
                11466,
                11541
            ],
            [
                11541,
                11653
            ],
            [
                11653,
                11691
            ],
            [
                11691,
                11747
            ],
            [
                11747,
                11794
            ],
            [
                11794,
                11810
            ],
            [
                11810,
                11831
            ],
            [
                11831,
                11964
            ],
            [
                11964,
                12001
            ],
            [
                12001,
                12089
            ],
            [
                12089,
                12197
            ],
            [
                12197,
                12232
            ],
            [
                12232,
                12287
            ],
            [
                12287,
                12421
            ],
            [
                12421,
                12443
            ],
            [
                12443,
                12469
            ],
            [
                12469,
                12529
            ],
            [
                12529,
                12572
            ],
            [
                12572,
                12697
            ],
            [
                12697,
                12883
            ],
            [
                12883,
                12914
            ],
            [
                12914,
                12975
            ],
            [
                12975,
                13078
            ],
            [
                13078,
                13101
            ],
            [
                13101,
                13150
            ],
            [
                13150,
                13243
            ],
            [
                13243,
                13374
            ],
            [
                13374,
                13379
            ],
            [
                13379,
                13389
            ],
            [
                13389,
                13453
            ],
            [
                13453,
                13545
            ],
            [
                13545,
                13603
            ],
            [
                13603,
                13803
            ],
            [
                13803,
                13848
            ],
            [
                13848,
                14024
            ],
            [
                14024,
                14063
            ],
            [
                14063,
                14092
            ],
            [
                14092,
                14192
            ],
            [
                14192,
                14310
            ],
            [
                14310,
                14443
            ],
            [
                14443,
                14498
            ],
            [
                14498,
                14524
            ],
            [
                14524,
                14558
            ],
            [
                14558,
                14654
            ],
            [
                14654,
                14661
            ],
            [
                14661,
                14685
            ],
            [
                14685,
                14749
            ],
            [
                14749,
                14939
            ],
            [
                14939,
                14985
            ],
            [
                14985,
                14989
            ],
            [
                14989,
                15158
            ],
            [
                15158,
                15195
            ],
            [
                15195,
                15319
            ],
            [
                15319,
                15362
            ]
        ],
        "overlap_chars": [
            [
                0,
                15
            ],
            [
                24,
                110
            ],
            [
                110,
                264
            ],
            [
                264,
                303
            ],
            [
                303,
                305
            ],
            [
                305,
                435
            ],
            [
                435,
                450
            ],
            [
                456,
                462
            ],
            [
                463,
                498
            ],
            [
                499,
                518
            ],
            [
                523,
                582
            ],
            [
                582,
                601
            ],
            [
                602,
                631
            ],
            [
                631,
                651
            ],
            [
                652,
                729
            ],
            [
                730,
                775
            ],
            [
                775,
                777
            ],
            [
                777,
                796
            ],
            [
                806,
                977
            ],
            [
                978,
                989
            ],
            [
                989,
                1054
            ],
            [
                1054,
                1108
            ],
            [
                1109,
                1110
            ],
            [
                1111,
                1158
            ],
            [
                1161,
                1172
            ],
            [
                1179,
                1214
            ],
            [
                1215,
                1229
            ],
            [
                1234,
                1236
            ],
            [
                1236,
                1298
            ],
            [
                1298,
                1325
            ],
            [
                1325,
                1375
            ],
            [
                1376,
                1385
            ],
            [
                1386,
                1468
            ],
            [
                1468,
                1470
            ],
            [
                1471,
                1474
            ],
            [
                1481,
                1511
            ],
            [
                1511,
                1583
            ],
            [
                1583,
                1585
            ],
            [
                1585,
                1625
            ],
            [
                1625,
                1654
            ],
            [
                1654,
                1675
            ],
            [
                1675,
                1770
            ],
            [
                1770,
                1857
            ],
            [
                1857,
                1922
            ],
            [
                1922,
                1934
            ],
            [
                1934,
                1936
            ],
            [
                1944,
                1969
            ],
            [
                1969,
                2014
            ],
            [
                2019,
                2062
            ],
            [
                2062,
                2085
            ],
            [
                2086,
                2087
            ],
            [
                2087,
                2165
            ],
            [
                2165,
                2176
            ],
            [
                2176,
                2195
            ],
            [
                2195,
                2220
            ],
            [
                2220,
                2261
            ],
            [
                2261,
                2287
            ],
            [
                2287,
                2321
            ],
            [
                2326,
                2328
            ],
            [
                2328,
                2333
            ],
            [
                2334,
                2359
            ],
            [
                2360,
                2449
            ],
            [
                2450,
                2506
            ],
            [
                2509,
                2521
            ],
            [
                2524,
                2527
            ],
            [
                2530,
                2607
            ],
            [
                2608,
                2631
            ],
            [
                2632,
                2648
            ],
            [
                2648,
                2663
            ],
            [
                2663,
                2722
            ],
            [
                2722,
                2761
            ],
            [
                2761,
                2789
            ],
            [
                2789,
                2791
            ],
            [
                2791,
                2866
            ],
            [
                2880,
                2885
            ],
            [
                2885,
                3020
            ],
            [
                3020,
                3049
            ],
            [
                3049,
                3050
            ],
            [
                3051,
                3088
            ],
            [
                3094,
                3098
            ],
            [
                3098,
                3178
            ],
            [
                3179,
                3187
            ],
            [
                3188,
                3194
            ],
            [
                3194,
                3210
            ],
            [
                3210,
                3337
            ],
            [
                3337,
                3377
            ],
            [
                3377,
                3386
            ],
            [
                3391,
                3393
            ],
            [
                3399,
                3403
            ],
            [
                3404,
                3405
            ],
            [
                3406,
                3411
            ],
            [
                3412,
                3460
            ],
            [
                3460,
                3473
            ],
            [
                3482,
                3488
            ],
            [
                3489,
                3502
            ],
            [
                3503,
                3507
            ],
            [
                3507,
                3541
            ],
            [
                3541,
                3542
            ],
            [
                3543,
                3593
            ],
            [
                3593,
                3699
            ],
            [
                3699,
                3798
            ],
            [
                3798,
                3800
            ],
            [
                3800,
                3852
            ],
            [
                3855,
                3869
            ],
            [
                3869,
                3926
            ],
            [
                3926,
                4025
            ],
            [
                4025,
                4027
            ],
            [
                4027,
                4078
            ],
            [
                4078,
                4080
            ],
            [
                4080,
                4147
            ],
            [
                4151,
                4185
            ],
            [
                4195,
                4249
            ],
            [
                4249,
                4250
            ],
            [
                4251,
                4272
            ],
            [
                4279,
                4297
            ],
            [
                4297,
                4365
            ],
            [
                4365,
                4416
            ],
            [
                4416,
                4421
            ],
            [
                4421,
                4427
            ],
            [
                4427,
                4454
            ],
            [
                4454,
                4473
            ],
            [
                4474,
                4480
            ],
            [
                4481,
                4501
            ],
            [
                4501,
                4507
            ],
            [
                4508,
                4571
            ],
            [
                4571,
                4587
            ],
            [
                4587,
                4650
            ],
            [
                4651,
                4653
            ],
            [
                4654,
                4663
            ],
            [
                4681,
                4708
            ],
            [
                4708,
                4785
            ],
            [
                4785,
                4812
            ],
            [
                4812,
                4821
            ],
            [
                4827,
                4882
            ],
            [
                4885,
                4918
            ],
            [
                4918,
                5003
            ],
            [
                5004,
                5071
            ],
            [
                5071,
                5074
            ],
            [
                5074,
                5088
            ],
            [
                5089,
                5092
            ],
            [
                5098,
                5107
            ],
            [
                5107,
                5112
            ],
            [
                5112,
                5201
            ],
            [
                5201,
                5301
            ],
            [
                5301,
                5324
            ],
            [
                5324,
                5325
            ],
            [
                5326,
                5343
            ],
            [
                5345,
                5380
            ],
            [
                5380,
                5418
            ],
            [
                5418,
                5420
            ],
            [
                5420,
                5442
            ],
            [
                5442,
                5494
            ],
            [
                5499,
                5502
            ],
            [
                5516,
                5518
            ],
            [
                5518,
                5561
            ],
            [
                5562,
                5612
            ],
            [
                5612,
                5637
            ],
            [
                5637,
                5679
            ],
            [
                5679,
                5770
            ],
            [
                5770,
                5783
            ],
            [
                5786,
                5818
            ],
            [
                5818,
                5938
            ],
            [
                5938,
                6082
            ],
            [
                6082,
                6253
            ],
            [
                6253,
                6296
            ],
            [
                6296,
                6343
            ],
            [
                6343,
                6365
            ],
            [
                6366,
                6381
            ],
            [
                6381,
                6426
            ],
            [
                6426,
                6466
            ],
            [
                6467,
                6502
            ],
            [
                6503,
                6522
            ],
            [
                6522,
                6614
            ],
            [
                6617,
                6636
            ],
            [
                6636,
                6669
            ],
            [
                6669,
                6713
            ],
            [
                6713,
                6715
            ],
            [
                6715,
                6728
            ],
            [
                6728,
                6753
            ],
            [
                6753,
                6784
            ],
            [
                6785,
                6814
            ],
            [
                6814,
                6918
            ],
            [
                6918,
                6981
            ],
            [
                6982,
                7106
            ],
            [
                7106,
                7168
            ],
            [
                7168,
                7239
            ],
            [
                7240,
                7255
            ],
            [
                7266,
                7292
            ],
            [
                7292,
                7435
            ],
            [
                7435,
                7539
            ],
            [
                7539,
                7591
            ],
            [
                7591,
                7629
            ],
            [
                7629,
                7631
            ],
            [
                7631,
                7751
            ],
            [
                7752,
                7783
            ],
            [
                7785,
                7789
            ],
            [
                7790,
                7803
            ],
            [
                7804,
                7850
            ],
            [
                7851,
                7904
            ],
            [
                7904,
                7979
            ],
            [
                7988,
                7993
            ],
            [
                7999,
                8066
            ],
            [
                8066,
                8067
            ],
            [
                8068,
                8235
            ],
            [
                8235,
                8379
            ],
            [
                8380,
                8408
            ],
            [
                8423,
                8427
            ],
            [
                8439,
                8461
            ],
            [
                8462,
                8502
            ],
            [
                8503,
                8557
            ],
            [
                8557,
                8621
            ],
            [
                8627,
                8720
            ],
            [
                8720,
                8725
            ],
            [
                8743,
                8780
            ],
            [
                8780,
                8889
            ],
            [
                8889,
                8923
            ],
            [
                8924,
                8981
            ],
            [
                8981,
                8998
            ],
            [
                8999,
                9015
            ],
            [
                9015,
                9074
            ],
            [
                9075,
                9084
            ],
            [
                9084,
                9089
            ],
            [
                9090,
                9122
            ],
            [
                9123,
                9227
            ],
            [
                9227,
                9271
            ],
            [
                9271,
                9313
            ],
            [
                9313,
                9314
            ],
            [
                9315,
                9342
            ],
            [
                9342,
                9419
            ],
            [
                9419,
                9554
            ],
            [
                9554,
                9602
            ],
            [
                9602,
                9604
            ],
            [
                9604,
                9647
            ],
            [
                9647,
                9696
            ],
            [
                9698,
                9718
            ],
            [
                9730,
                9755
            ],
            [
                9755,
                9863
            ],
            [
                9863,
                9886
            ],
            [
                9892,
                9960
            ],
            [
                9960,
                10000
            ],
            [
                10000,
                10069
            ],
            [
                10069,
                10177
            ],
            [
                10177,
                10226
            ],
            [
                10226,
                10271
            ],
            [
                10271,
                10281
            ],
            [
                10281,
                10491
            ],
            [
                10494,
                10513
            ],
            [
                10518,
                10519
            ],
            [
                10524,
                10527
            ],
            [
                10527,
                10544
            ],
            [
                10545,
                10594
            ],
            [
                10594,
                10695
            ],
            [
                10695,
                10710
            ],
            [
                10711,
                10726
            ],
            [
                10727,
                10733
            ],
            [
                10734,
                10803
            ],
            [
                10803,
                10865
            ],
            [
                10865,
                10867
            ],
            [
                10867,
                10982
            ],
            [
                10985,
                11090
            ],
            [
                11090,
                11131
            ],
            [
                11132,
                11143
            ],
            [
                11151,
                11186
            ],
            [
                11186,
                11216
            ],
            [
                11216,
                11265
            ],
            [
                11273,
                11274
            ],
            [
                11282,
                11329
            ],
            [
                11329,
                11426
            ],
            [
                11434,
                11442
            ],
            [
                11442,
                11444
            ],
            [
                11444,
                11466
            ],
            [
                11466,
                11467
            ],
            [
                11475,
                11478
            ],
            [
                11478,
                11479
            ],
            [
                11480,
                11482
            ],
            [
                11491,
                11522
            ],
            [
                11523,
                11527
            ],
            [
                11537,
                11541
            ],
            [
                11541,
                11653
            ],
            [
                11653,
                11672
            ],
            [
                11673,
                11691
            ],
            [
                11691,
                11747
            ],
            [
                11747,
                11784
            ],
            [
                11792,
                11794
            ],
            [
                11794,
                11810
            ],
            [
                11810,
                11831
            ],
            [
                11831,
                11964
            ],
            [
                11964,
                11999
            ],
            [
                11999,
                12001
            ],
            [
                12001,
                12046
            ],
            [
                12054,
                12089
            ],
            [
                12089,
                12119
            ],
            [
                12122,
                12125
            ],
            [
                12132,
                12148
            ],
            [
                12160,
                12178
            ],
            [
                12179,
                12197
            ],
            [
                12197,
                12230
            ],
            [
                12232,
                12287
            ],
            [
                12287,
                12421
            ],
            [
                12421,
                12443
            ],
            [
                12443,
                12469
            ],
            [
                12469,
                12529
            ],
            [
                12529,
                12572
            ],
            [
                12572,
                12575
            ],
            [
                12576,
                12577
            ],
            [
                12581,
                12585
            ],
            [
                12586,
                12597
            ],
            [
                12600,
                12610
            ],
            [
                12619,
                12620
            ],
            [
                12630,
                12662
            ],
            [
                12671,
                12681
            ],
            [
                12682,
                12697
            ],
            [
                12697,
                12883
            ],
            [
                12883,
                12914
            ],
            [
                12914,
                12975
            ],
            [
                12975,
                13078
            ],
            [
                13078,
                13101
            ],
            [
                13101,
                13106
            ],
            [
                13107,
                13129
            ],
            [
                13129,
                13150
            ],
            [
                13150,
                13243
            ],
            [
                13243,
                13374
            ],
            [
                13374,
                13379
            ],
            [
                13379,
                13389
            ],
            [
                13389,
                13453
            ],
            [
                13453,
                13545
            ],
            [
                13545,
                13562
            ],
            [
                13570,
                13602
            ],
            [
                13603,
                13653
            ],
            [
                13654,
                13803
            ],
            [
                13803,
                13823
            ],
            [
                13828,
                13848
            ],
            [
                13848,
                13967
            ],
            [
                13968,
                14021
            ],
            [
                14021,
                14024
            ],
            [
                14024,
                14063
            ],
            [
                14063,
                14092
            ],
            [
                14092,
                14192
            ],
            [
                14192,
                14251
            ],
            [
                14252,
                14310
            ],
            [
                14310,
                14373
            ],
            [
                14375,
                14427
            ],
            [
                14429,
                14443
            ],
            [
                14443,
                14468
            ],
            [
                14469,
                14498
            ],
            [
                14498,
                14524
            ],
            [
                14524,
                14558
            ],
            [
                14558,
                14582
            ],
            [
                14591,
                14654
            ],
            [
                14654,
                14661
            ],
            [
                14661,
                14685
            ],
            [
                14685,
                14749
            ],
            [
                14749,
                14857
            ],
            [
                14865,
                14886
            ],
            [
                14887,
                14939
            ],
            [
                14939,
                14985
            ],
            [
                14985,
                14989
            ],
            [
                14989,
                15050
            ],
            [
                15051,
                15059
            ],
            [
                15060,
                15062
            ],
            [
                15063,
                15074
            ],
            [
                15074,
                15158
            ],
            [
                15158,
                15195
            ],
            [
                15195,
                15319
            ],
            [
                15319,
                15362
            ]
        ],
        "row_chars": [
            [
                0,
                110
            ],
            [
                110,
                264
            ],
            [
                264,
                305
            ],
            [
                305,
                435
            ],
            [
                435,
                582
            ],
            [
                582,
                631
            ],
            [
                631,
                730
            ],
            [
                730,
                730
            ],
            [
                730,
                777
            ],
            [
                777,
                989
            ],
            [
                989,
                1054
            ],
            [
                1054,
                1236
            ],
            [
                1236,
                1325
            ],
            [
                1325,
                1386
            ],
            [
                1386,
                1468
            ],
            [
                1468,
                1511
            ],
            [
                1511,
                1585
            ],
            [
                1585,
                1625
            ],
            [
                1625,
                1654
            ],
            [
                1654,
                1675
            ],
            [
                1675,
                1770
            ],
            [
                1770,
                1857
            ],
            [
                1857,
                1922
            ],
            [
                1922,
                1934
            ],
            [
                1934,
                1934
            ],
            [
                1934,
                1934
            ],
            [
                1934,
                1969
            ],
            [
                1969,
                2062
            ],
            [
                2062,
                2062
            ],
            [
                2062,
                2062
            ],
            [
                2062,
                2165
            ],
            [
                2165,
                2176
            ],
            [
                2176,
                2195
            ],
            [
                2195,
                2220
            ],
            [
                2220,
                2261
            ],
            [
                2261,
                2287
            ],
            [
                2287,
                2328
            ],
            [
                2328,
                2530
            ],
            [
                2530,
                2648
            ],
            [
                2648,
                2663
            ],
            [
                2663,
                2722
            ],
            [
                2722,
                2722
            ],
            [
                2722,
                2761
            ],
            [
                2761,
                2791
            ],
            [
                2791,
                2791
            ],
            [
                2791,
                2885
            ],
            [
                2885,
                3020
            ],
            [
                3020,
                3098
            ],
            [
                3098,
                3210
            ],
            [
                3210,
                3210
            ],
            [
                3210,
                3337
            ],
            [
                3337,
                3377
            ],
            [
                3377,
                3386
            ],
            [
                3386,
                3460
            ],
            [
                3460,
                3593
            ],
            [
                3593,
                3699
            ],
            [
                3699,
                3699
            ],
            [
                3699,
                3800
            ],
            [
                3800,
                3869
            ],
            [
                3869,
                3926
            ],
            [
                3926,
                3926
            ],
            [
                3926,
                4027
            ],
            [
                4027,
                4080
            ],
            [
                4080,
                4297
            ],
            [
                4297,
                4416
            ],
            [
                4416,
                4421
            ],
            [
                4421,
                4454
            ],
            [
                4454,
                4454
            ],
            [
                4454,
                4454
            ],
            [
                4454,
                4571
            ],
            [
                4571,
                4587
            ],
            [
                4587,
                4708
            ],
            [
                4708,
                4785
            ],
            [
                4785,
                4812
            ],
            [
                4812,
                4918
            ],
            [
                4918,
                5074
            ],
            [
                5074,
                5107
            ],
            [
                5107,
                5112
            ],
            [
                5112,
                5201
            ],
            [
                5201,
                5301
            ],
            [
                5301,
                5345
            ],
            [
                5345,
                5345
            ],
            [
                5345,
                5345
            ],
            [
                5345,
                5345
            ],
            [
                5345,
                5345
            ],
            [
                5345,
                5380
            ],
            [
                5380,
                5420
            ],
            [
                5420,
                5442
            ],
            [
                5442,
                5518
            ],
            [
                5518,
                5612
            ],
            [
                5612,
                5612
            ],
            [
                5612,
                5612
            ],
            [
                5612,
                5637
            ],
            [
                5637,
                5637
            ],
            [
                5637,
                5637
            ],
            [
                5637,
                5679
            ],
            [
                5679,
                5770
            ],
            [
                5770,
                5818
            ],
            [
                5818,
                5938
            ],
            [
                5938,
                6082
            ],
            [
                6082,
                6253
            ],
            [
                6253,
                6253
            ],
            [
                6253,
                6253
            ],
            [
                6253,
                6296
            ],
            [
                6296,
                6296
            ],
            [
                6296,
                6343
            ],
            [
                6343,
                6381
            ],
            [
                6381,
                6426
            ],
            [
                6426,
                6426
            ],
            [
                6426,
                6426
            ],
            [
                6426,
                6426
            ],
            [
                6426,
                6426
            ],
            [
                6426,
                6522
            ],
            [
                6522,
                6522
            ],
            [
                6522,
                6522
            ],
            [
                6522,
                6669
            ],
            [
                6669,
                6715
            ],
            [
                6715,
                6715
            ],
            [
                6715,
                6728
            ],
            [
                6728,
                6753
            ],
            [
                6753,
                6814
            ],
            [
                6814,
                6814
            ],
            [
                6814,
                6814
            ],
            [
                6814,
                6918
            ],
            [
                6918,
                7106
            ],
            [
                7106,
                7106
            ],
            [
                7106,
                7292
            ],
            [
                7292,
                7435
            ],
            [
                7435,
                7539
            ],
            [
                7539,
                7631
            ],
            [
                7631,
                7804
            ],
            [
                7804,
                7804
            ],
            [
                7804,
                7804
            ],
            [
                7804,
                7904
            ],
            [
                7904,
                8068
            ],
            [
                8068,
                8068
            ],
            [
                8068,
                8235
            ],
            [
                8235,
                8462
            ],
            [
                8462,
                8557
            ],
            [
                8557,
                8720
            ],
            [
                8720,
                8780
            ],
            [
                8780,
                8924
            ],
            [
                8924,
                8981
            ],
            [
                8981,
                9227
            ],
            [
                9227,
                9271
            ],
            [
                9271,
                9342
            ],
            [
                9342,
                9419
            ],
            [
                9419,
                9554
            ],
            [
                9554,
                9604
            ],
            [
                9604,
                9647
            ],
            [
                9647,
                9755
            ],
            [
                9755,
                9863
            ],
            [
                9863,
                9863
            ],
            [
                9863,
                9960
            ],
            [
                9960,
                10000
            ],
            [
                10000,
                10069
            ],
            [
                10069,
                10177
            ],
            [
                10177,
                10226
            ],
            [
                10226,
                10271
            ],
            [
                10271,
                10281
            ],
            [
                10281,
                10494
            ],
            [
                10494,
                10527
            ],
            [
                10527,
                10544
            ],
            [
                10544,
                10544
            ],
            [
                10544,
                10594
            ],
            [
                10594,
                10695
            ],
            [
                10695,
                10803
            ],
            [
                10803,
                10867
            ],
            [
                10867,
                11090
            ],
            [
                11090,
                11186
            ],
            [
                11186,
                11216
            ],
            [
                11216,
                11329
            ],
            [
                11329,
                11444
            ],
            [
                11444,
                11466
            ],
            [
                11466,
                11541
            ],
            [
                11541,
                11653
            ],
            [
                11653,
                11691
            ],
            [
                11691,
                11747
            ],
            [
                11747,
                11794
            ],
            [
                11794,
                11810
            ],
            [
                11810,
                11831
            ],
            [
                11831,
                11964
            ],
            [
                11964,
                12001
            ],
            [
                12001,
                12089
            ],
            [
                12089,
                12197
            ],
            [
                12197,
                12287
            ],
            [
                12287,
                12421
            ],
            [
                12421,
                12443
            ],
            [
                12443,
                12469
            ],
            [
                12469,
                12529
            ],
            [
                12529,
                12572
            ],
            [
                12572,
                12697
            ],
            [
                12697,
                12883
            ],
            [
                12883,
                12914
            ],
            [
                12914,
                12975
            ],
            [
                12975,
                13078
            ],
            [
                13078,
                13101
            ],
            [
                13101,
                13150
            ],
            [
                13150,
                13243
            ],
            [
                13243,
                13374
            ],
            [
                13374,
                13379
            ],
            [
                13379,
                13389
            ],
            [
                13389,
                13453
            ],
            [
                13453,
                13545
            ],
            [
                13545,
                13603
            ],
            [
                13603,
                13603
            ],
            [
                13603,
                13803
            ],
            [
                13803,
                13848
            ],
            [
                13848,
                14024
            ],
            [
                14024,
                14063
            ],
            [
                14063,
                14092
            ],
            [
                14092,
                14192
            ],
            [
                14192,
                14310
            ],
            [
                14310,
                14443
            ],
            [
                14443,
                14498
            ],
            [
                14498,
                14524
            ],
            [
                14524,
                14558
            ],
            [
                14558,
                14654
            ],
            [
                14654,
                14661
            ],
            [
                14661,
                14685
            ],
            [
                14685,
                14749
            ],
            [
                14749,
                14939
            ],
            [
                14939,
                14985
            ],
            [
                14985,
                14989
            ],
            [
                14989,
                15158
            ],
            [
                15158,
                15195
            ],
            [
                15195,
                15319
            ],
            [
                15319,
                15362
            ]
        ]
    }
}