{
    "original": {
        "text": "I had not the courage to see any one that night. I had not even the courage to see myself, for I was afraid that my tears might a little reproach me. I went up to my room in the dark, and prayed in the dark, and lay down in the dark to sleep. I had no need of any light to read my guardian's letter by, for I knew it by heart. I took it from the place where I kept it, and repeated its contents by its own clear light of integrity and love, and went to sleep with it on my pillow.\nI was up very early in the morning and called Charley to come for a walk. We bought flowers for the breakfast-table, and came back and arranged them, and were as busy as possible. We were so early that I had a good time still for Charley's lesson before breakfast; Charley (who was not in the least improved in the old defective article of grammar) came through it with great applause; and we were altogether very notable. When my guardian appeared he said, \"Why, little woman, you look fresher than your flowers!\" And Mrs. Woodcourt repeated and translated a passage from the Mewlinnwillinwodd expressive of my being like a mountain with the sun upon it.\nThis was all so pleasant that I hope it made me still more like the mountain than I had been before. After breakfast I waited my opportunity and peeped about a little until I saw my guardian in his own room--the room of last night--by himself. Then I made an excuse to go in with my housekeeping keys, shutting the door after me.\n\"Well, Dame Durden?\" said my guardian; the post had brought him several letters, and he was writing. \"You want money?\"\n\"No, indeed, I have plenty in hand.\"\n\"There never was such a Dame Durden,\" said my guardian, \"for making money last.\"\nHe had laid down his pen and leaned back in his chair looking at me. I have often spoken of his bright face, but I thought I had never seen it look so bright and good. There was a high happiness upon it which made me think, \"He has been doing some great kindness this morning.\"\n\"There never was,\" said my guardian, musing as he smiled upon me, \"such a Dame Durden for making money last.\"\nHe had never yet altered his old manner. I loved it and him so much that when I now went up to him and took my usual chair, which was always put at his side--for sometimes I read to him, and sometimes I talked to him, and sometimes I silently worked by him--I hardly liked to disturb it by laying my hand on his breast. But I found I did not disturb it at all.\n\"Dear guardian,\" said I, \"I want to speak to you. Have I been remiss in anything?\"\n\"Remiss in anything, my dear!\"\n\"Have I not been what I have meant to be since--I brought the answer to your letter, guardian?\"\n\"You have been everything I could desire, my love.\"\n\"I am very glad indeed to hear that,\" I returned. \"You know, you said to me, was this the mistress of Bleak House. And I said, yes.\"\n\"Yes,\" said my guardian, nodding his head. He had put his arm about me as if there were something to protect me from and looked in my face, smiling.\n\"Since then,\" said I, \"we have never spoken on the subject except once.\"\n\"And then I said Bleak House was thinning fast; and so it was, my dear.\"\n\"And I said,\" I timidly reminded him, \"but its mistress remained.\"\nHe still held me in the same protecting manner and with the same bright goodness in his face.\n\"Dear guardian,\" said I, \"I know how you have felt all that has happened, and how considerate you have been. As so much time has passed, and as you spoke only this morning of my being so well again, perhaps you expect me to renew the subject. Perhaps I ought to do so. I will be the mistress of Bleak House when you please.\"\n\"See,\" he returned gaily, \"what a sympathy there must be between us! I have had nothing else, poor Rick excepted--it's a large exception--in my mind. When you came in, I was full of it. When shall we give Bleak House its mistress, little woman?\"\n\"When you please.\"\n\"Next month?\"\n\"Next month, dear guardian.\"\n\"The day on which I take the happiest and best step of my life--the day on which I shall be a man more exulting and more enviable than any other man in the world--the day on which I give Bleak House its little mistress--shall be next month then,\" said my guardian.\nI put my arms round his neck and kissed him just as I had done on the day when I brought my answer.\nA servant came to the door to announce Mr. Bucket, which was quite unnecessary, for Mr. Bucket was already looking in over the servant's shoulder. \"Mr. Jarndyce and Miss Summerson,\" said he, rather out of breath, \"with all apologies for intruding, WILL you allow me to order up a person that's on the stairs and that objects to being left there in case of becoming the subject of observations in his absence? Thank you. Be so good as chair that there member in this direction, will you?\" said Mr. Bucket, beckoning over the banisters.\nThis singular request produced an old man in a black skull-cap, unable to walk, who was carried up by a couple of bearers and deposited in the room near the door. Mr. Bucket immediately got rid of the bearers, mysteriously shut the door, and bolted it.\n\"Now you see, Mr. Jarndyce,\" he then began, putting down his hat and opening his subject with a flourish of his well-remembered finger, \"you know me, and Miss Summerson knows me. This gentleman likewise knows me, and his name is Smallweed. The discounting line is his line principally, and he's what you may call a dealer in bills. That's about what YOU are, you know, ain't you?\" said Mr. Bucket, stopping a little to address the gentleman in question, who was exceedingly suspicious of him.\nHe seemed about to dispute this designation of himself when he was seized with a violent fit of coughing.\n\"Now, moral, you know!\" said Mr. Bucket, improving the accident. \"Don't you contradict when there ain't no occasion, and you won't be took in that way. Now, Mr. Jarndyce, I address myself to you. I've been negotiating with this gentleman on behalf of Sir Leicester Dedlock, Baronet, and one way and another I've been in and out and about his premises a deal. His premises are the premises formerly occupied by Krook, marine store dealer--a relation of this gentleman's that you saw in his lifetime if I don't mistake?\"\nMy guardian replied, \"Yes.\"\n\"Well! You are to understand,\" said Mr. Bucket, \"that this gentleman he come into Krook's property, and a good deal of magpie property there was. Vast lots of waste-paper among the rest. Lord bless you, of no use to nobody!\"\nThe cunning of Mr. Bucket's eye and the masterly manner in which he contrived, without a look or a word against which his watchful auditor could protest, to let us know that he stated the case according to previous agreement and could say much more of Mr. Smallweed if he thought it advisable, deprived us of any merit in quite understanding him. His difficulty was increased by Mr. Smallweed's being deaf as well as suspicious and watching his face with the closest attention.\n\"Among them odd heaps of old papers, this gentleman, when he comes into the property, naturally begins to rummage, don't you see?\" said Mr. Bucket.\n\"To which? Say that again,\" cried Mr. Smallweed in a shrill, sharp voice.\n\"To rummage,\" repeated Mr. Bucket. \"Being a prudent man and accustomed to take care of your own affairs, you begin to rummage among the papers as you have come into; don't you?\"\n\"Of course I do,\" cried Mr. Smallweed.\n\"Of course you do,\" said Mr. Bucket conversationally, \"and much to blame you would be if you didn't. And so you chance to find, you know,\" Mr. Bucket went on, stooping over him with an air of cheerful raillery which Mr. Smallweed by no means reciprocated, \"and so you chance to find, you know, a paper with the signature of Jarndyce to it. Don't you?\"\nMr. Smallweed glanced with a troubled eye at us and grudgingly nodded assent.\n\"And coming to look at that paper at your full leisure and convenience--all in good time, for you're not curious to read it, and why should you be?--what do you find it to be but a will, you see. That's the drollery of it,\" said Mr. Bucket with the same lively air of recalling a joke for the enjoyment of Mr. Smallweed, who still had the same crest-fallen appearance of not enjoying it at all; \"what do you find it to be but a will?\"\n\"I don't know that it's good as a will or as anything else,\" snarled Mr. Smallweed.\nMr. Bucket eyed the old man for a moment--he had slipped and shrunk down in his chair into a mere bundle--as if he were much disposed to pounce upon him; nevertheless, he continued to bend over him with the same agreeable air, keeping the corner of one of his eyes upon us.\n\"Notwithstanding which,\" said Mr. Bucket, \"you get a little doubtful and uncomfortable in your mind about it, having a very tender mind of your own.\"\n\"Eh? What do you say I have got of my own?\" asked Mr. Smallweed with his hand to his ear.\n\"A very tender mind.\"\n\"Ho! Well, go on,\" said Mr. Smallweed.\n\"And as you've heard a good deal mentioned regarding a celebrated Chancery will case of the same name, and as you know what a card Krook was for buying all manner of old pieces of furniter, and books, and papers, and what not, and never liking to part with 'em, and always a-going to teach himself to read, you begin to think--and you never was more correct in your born days--'Ecod, if I don't look about me, I may get into trouble regarding this will.'\"\n\"Now, mind how you put it, Bucket,\" cried the old man anxiously with his hand at his ear. \"Speak up; none of your brimstone tricks. Pick me up; I want to hear better. Oh, Lord, I am shaken to bits!\"\nMr. Bucket had certainly picked him up at a dart. However, as soon as he could be heard through Mr. Smallweed's coughing and his vicious ejaculations of \"Oh, my bones! Oh, dear! I've no breath in my body! I'm worse than the chattering, clattering, brimstone pig at home!\" Mr. Bucket proceeded in the same convivial manner as before.\n\"So, as I happen to be in the habit of coming about your premises, you take me into your confidence, don't you?\"\nI think it would be impossible to make an admission with more ill will and a worse grace than Mr. Smallweed displayed when he admitted this, rendering it perfectly evident that Mr. Bucket was the very last person he would have thought of taking into his confidence if he could by any possibility have kept him out of it.\n\"And I go into the business with you--very pleasant we are over it; and I confirm you in your well-founded fears that you will get yourself into a most precious line if you don't come out with that there will,\" said Mr. Bucket emphatically; \"and accordingly you arrange with me that it shall be delivered up to this present Mr. Jarndyce, on no conditions. If it should prove to be valuable, you trusting yourself to him for your reward; that's about where it is, ain't it?\"\n\"That's what was agreed,\" Mr. Smallweed assented with the same bad grace.\n\"In consequence of which,\" said Mr. Bucket, dismissing his agreeable manner all at once and becoming strictly business-like, \"you've got that will upon your person at the present time, and the only thing that remains for you to do is just to out with it!\"\nHaving given us one glance out of the watching corner of his eye, and having given his nose one triumphant rub with his forefinger, Mr. Bucket stood with his eyes fastened on his confidential friend and his hand stretched forth ready to take the paper and present it to my guardian. It was not produced without much reluctance and many declarations on the part of Mr. Smallweed that he was a poor industrious man and that he left it to Mr. Jarndyce's honour not to let him lose by his honesty. Little by little he very slowly took from a breast-pocket a stained, discoloured paper which was much singed upon the outside and a little burnt at the edges, as if it had long ago been thrown upon a fire and hastily snatched off again. Mr. Bucket lost no time in transferring this paper, with the dexterity of a conjuror, from Mr. Smallweed to Mr. Jarndyce. As he gave it to my guardian, he whispered behind his fingers, \"Hadn't settled how to make their market of it. Quarrelled and hinted about it. I laid out twenty pound upon it. First the avaricious grandchildren split upon him on account of their objections to his living so unreasonably long, and then they split on one another. Lord! There ain't one of the family that wouldn't sell the other for a pound or two, except the old lady--and she's only out of it because she's too weak in her mind to drive a bargain.\"\n\"Mr Bucket,\" said my guardian aloud, \"whatever the worth of this paper may be to any one, my obligations are great to you; and if it be of any worth, I hold myself bound to see Mr. Smallweed remunerated accordingly.\"\n\"Not according to your merits, you know,\" said Mr. Bucket in friendly explanation to Mr. Smallweed. \"Don't you be afraid of that. According to its value.\"\n\"That is what I mean,\" said my guardian. \"You may observe, Mr. Bucket, that I abstain from examining this paper myself. The plain truth is, I have forsworn and abjured the whole business these many years, and my soul is sick of it. But Miss Summerson and I will immediately place the paper in the hands of my solicitor in the cause, and its existence shall be made known without delay to all other parties interested.\"\n\"Mr. Jarndyce can't say fairer than that, you understand,\" observed Mr. Bucket to his fellow-visitor. \"And it being now made clear to you that nobody's a-going to be wronged--which must be a great relief to YOUR mind--we may proceed with the ceremony of chairing you home again.\"\nHe unbolted the door, called in the bearers, wished us good morning, and with a look full of meaning and a crook of his finger at parting went his way.\nWe went our way too, which was to Lincoln's Inn, as quickly as possible. Mr. Kenge was disengaged, and we found him at his table in his dusty room with the inexpressive-looking books and the piles of papers. Chairs having been placed for us by Mr. Guppy, Mr. Kenge expressed the surprise and gratification he felt at the unusual sight of Mr. Jarndyce in his office. He turned over his double eye-glass as he spoke and was more Conversation Kenge than ever.\n\"I hope,\" said Mr. Kenge, \"that the genial influence of Miss Summerson,\" he bowed to me, \"may have induced Mr. Jarndyce,\" he bowed to him, \"to forego some little of his animosity towards a cause and towards a court which are--shall I say, which take their place in the stately vista of the pillars of our profession?\"\n\"I am inclined to think,\" returned my guardian, \"that Miss Summerson has seen too much of the effects of the court and the cause to exert any influence in their favour. Nevertheless, they are a part of the occasion of my being here. Mr. Kenge, before I lay this paper on your desk and have done with it, let me tell you how it has come into my hands.\"\nHe did so shortly and distinctly.\n\"It could not, sir,\" said Mr. Kenge, \"have been stated more plainly and to the purpose if it had been a case at law.\"\n\"Did you ever know English law, or equity either, plain and to the purpose?\" said my guardian.\n\"Oh, fie!\" said Mr. Kenge.\nAt first he had not seemed to attach much importance to the paper, but when he saw it he appeared more interested, and when he had opened and read a little of it through his eye-glass, he became amazed. \"Mr. Jarndyce,\" he said, looking off it, \"you have perused this?\"\n\"Not I!\" returned my guardian.\n\"But, my dear sir,\" said Mr. Kenge, \"it is a will of later date than any in the suit. It appears to be all in the testator's handwriting. It is duly executed and attested. And even if intended to be cancelled, as might possibly be supposed to be denoted by these marks of fire, it is NOT cancelled. Here it is, a perfect instrument!\"\n\"Well!\" said my guardian. \"What is that to me?\"\n\"Mr. Guppy!\" cried Mr. Kenge, raising his voice. \"I beg your pardon, Mr. Jarndyce.\"\n\"Sir.\"\n\"Mr. Vholes of Symond's Inn. My compliments. Jarndyce and Jarndyce. Glad to speak with him.\"\nMr. Guppy disappeared.\n\"You ask me what is this to you, Mr. Jarndyce. If you had perused this document, you would have seen that it reduces your interest considerably, though still leaving it a very handsome one, still leaving it a very handsome one,\" said Mr. Kenge, waving his hand persuasively and blandly. \"You would further have seen that the interests of Mr. Richard Carstone and of Miss Ada Clare, now Mrs. Richard Carstone, are very materially advanced by it.\"\n\"Kenge,\" said my guardian, \"if all the flourishing wealth that the suit brought into this vile court of Chancery could fall to my two young cousins, I should be well contented. But do you ask ME to believe that any good is to come of Jarndyce and Jarndyce?\"\n\"Oh, really, Mr. Jarndyce! Prejudice, prejudice. My dear sir, this is a very great country, a very great country. Its system of equity is a very great system, a very great system. Really, really!\"\nMy guardian said no more, and Mr. Vholes arrived. He was modestly impressed by Mr. Kenge's professional eminence.\n\"How do you do, Mr. Vholes? Will you be so good as to take a chair here by me and look over this paper?\"\nMr. Vholes did as he was asked and seemed to read it every word. He was not excited by it, but he was not excited by anything. When he had well examined it, he retired with Mr. Kenge into a window, and shading his mouth with his black glove, spoke to him at some length. I was not surprised to observe Mr. Kenge inclined to dispute what he said before he had said much, for I knew that no two people ever did agree about anything in Jarndyce and Jarndyce. But he seemed to get the better of Mr. Kenge too in a conversation that sounded as if it were almost composed of the words \"Receiver-General,\" \"Accountant-General,\" \"report,\" \"estate,\" and \"costs.\" When they had finished, they came back to Mr. Kenge's table and spoke aloud.\n\"Well! But this is a very remarkable document, Mr. Vholes,\" said Mr. Kenge.\nMr. Vholes said, \"Very much so.\"\n\"And a very important document, Mr. Vholes,\" said Mr. Kenge.\nAgain Mr. Vholes said, \"Very much so.\"\n\"And as you say, Mr. Vholes, when the cause is in the paper next term, this document will be an unexpected and interesting feature in it,\" said Mr. Kenge, looking loftily at my guardian.\nMr. Vholes was gratified, as a smaller practitioner striving to keep respectable, to be confirmed in any opinion of his own by such an authority.\n\"And when,\" asked my guardian, rising after a pause, during which Mr. Kenge had rattled his money and Mr. Vholes had picked his pimples, \"when is next term?\"\n\"Next term, Mr. Jarndyce, will be next month,\" said Mr. Kenge. \"Of course we shall at once proceed to do what is necessary with this document and to collect the necessary evidence concerning it; and of course you will receive our usual notification of the cause being in the paper.\"\n\"To which I shall pay, of course, my usual attention.\"\n\"Still bent, my dear sir,\" said Mr. Kenge, showing us through the outer office to the door, \"still bent, even with your enlarged mind, on echoing a popular prejudice? We are a prosperous community, Mr. Jarndyce, a very prosperous community. We are a great country, Mr. Jarndyce, we are a very great country. This is a great system, Mr. Jarndyce, and would you wish a great country to have a little system? Now, really, really!\"\nHe said this at the stair-head, gently moving his right hand as if it were a silver trowel with which to spread the cement of his words on the structure of the system and consolidate it for a thousand ages.",
        "paragraph_chars": [
            [
                0,
                481
            ],
            [
                481,
                1137
            ],
            [
                1137,
                1467
            ],
            [
                1467,
                1586
            ],
            [
                1586,
                1623
            ],
            [
                1623,
                1704
            ],
            [
                1704,
                1982
            ],
            [
                1982,
                2092
            ],
            [
                2092,
                2453
            ],
            [
                2453,
                2536
            ],
            [
                2536,
                2567
            ],
            [
                2567,
                2663
            ],
            [
                2663,
                2715
            ],
            [
                2715,
                2848
            ],
            [
                2848,
                2997
            ],
            [
                2997,
                3070
            ],
            [
                3070,
                3143
            ],
            [
                3143,
                3210
            ],
            [
                3210,
                3304
            ],
            [
                3304,
                3629
            ],
            [
                3629,
                3875
            ],
            [
                3875,
                3894
            ],
            [
                3894,
                3908
            ],
            [
                3908,
                3937
            ],
            [
                3937,
                4202
            ],
            [
                4202,
                4302
            ],
            [
                4302,
                4837
            ],
            [
                4837,
                5090
            ],
            [
                5090,
                5583
            ],
            [
                5583,
                5689
            ],
            [
                5689,
                6208
            ],
            [
                6208,
                6236
            ],
            [
                6236,
                6461
            ],
            [
                6461,
                6939
            ],
            [
                6939,
                7087
            ],
            [
                7087,
                7161
            ],
            [
                7161,
                7339
            ],
            [
                7339,
                7378
            ],
            [
                7378,
                7730
            ],
            [
                7730,
                7808
            ],
            [
                7808,
                8243
            ],
            [
                8243,
                8327
            ],
            [
                8327,
                8601
            ],
            [
                8601,
                8751
            ],
            [
                8751,
                8841
            ],
            [
                8841,
                8863
            ],
            [
                8863,
                8902
            ],
            [
                8902,
                9358
            ],
            [
                9358,
                9557
            ],
            [
                9557,
                9890
            ],
            [
                9890,
                10003
            ],
            [
                10003,
                10324
            ],
            [
                10324,
                10798
            ],
            [
                10798,
                10872
            ],
            [
                10872,
                11128
            ],
            [
                11128,
                12497
            ],
            [
                12497,
                12714
            ],
            [
                12714,
                12869
            ],
            [
                12869,
                13288
            ],
            [
                13288,
                13568
            ],
            [
                13568,
                13720
            ],
            [
                13720,
                14177
            ],
            [
                14177,
                14495
            ],
            [
                14495,
                14847
            ],
            [
                14847,
                14881
            ],
            [
                14881,
                14999
            ],
            [
                14999,
                15094
            ],
            [
                15094,
                15121
            ],
            [
                15121,
                15390
            ],
            [
                15390,
                15421
            ],
            [
                15421,
                15755
            ],
            [
                15755,
                15803
            ],
            [
                15803,
                15887
            ],
            [
                15887,
                15894
            ],
            [
                15894,
                15987
            ],
            [
                15987,
                16010
            ],
            [
                16010,
                16456
            ],
            [
                16456,
                16714
            ],
            [
                16714,
                16911
            ],
            [
                16911,
                17025
            ],
            [
                17025,
                17130
            ],
            [
                17130,
                17861
            ],
            [
                17861,
                17937
            ],
            [
                17937,
                17970
            ],
            [
                17970,
                18031
            ],
            [
                18031,
                18070
            ],
            [
                18070,
                18257
            ],
            [
                18257,
                18403
            ],
            [
                18403,
                18561
            ],
            [
                18561,
                18844
            ],
            [
                18844,
                18899
            ],
            [
                18899,
                19327
            ],
            [
                19327,
                19533
            ]
        ],
        "segment_chars": [
            [
                0,
                49
            ],
            [
                49,
                150
            ],
            [
                150,
                243
            ],
            [
                243,
                327
            ],
            [
                327,
                481
            ],
            [
                481,
                555
            ],
            [
                555,
                661
            ],
            [
                661,
                904
            ],
            [
                904,
                996
            ],
            [
                996,
                1137
            ],
            [
                1137,
                1238
            ],
            [
                1238,
                1381
            ],
            [
                1381,
                1467
            ],
            [
                1467,
                1488
            ],
            [
                1488,
                1568
            ],
            [
                1568,
                1586
            ],
            [
                1586,
                1623
            ],
            [
                1623,
                1704
            ],
            [
                1704,
                1773
            ],
            [
                1773,
                1872
            ],
            [
                1872,
                1982
            ],
            [
                1982,
                2092
            ],
            [
                2092,
                2133
            ],
            [
                2133,
                2412
            ],
            [
                2412,
                2453
            ],
            [
                2453,
                2503
            ],
            [
                2503,
                2536
            ],
            [
                2536,
                2567
            ],
            [
                2567,
                2663
            ],
            [
                2663,
                2715
            ],
            [
                2715,
                2765
            ],
            [
                2765,
                2830
            ],
            [
                2830,
                2848
            ],
            [
                2848,
                2891
            ],
            [
                2891,
                2997
            ],
            [
                2997,
                3070
            ],
            [
                3070,
                3143
            ],
            [
                3143,
                3210
            ],
            [
                3210,
                3304
            ],
            [
                3304,
                3413
            ],
            [
                3413,
                3547
            ],
            [
                3547,
                3573
            ],
            [
                3573,
                3629
            ],
            [
                3629,
                3698
            ],
            [
                3698,
                3779
            ],
            [
                3779,
                3815
            ],
            [
                3815,
                3875
            ],
            [
                3875,
                3894
            ],
            [
                3894,
                3908
            ],
            [
                3908,
                3937
            ],
            [
                3937,
                4202
            ],
            [
                4202,
                4302
            ],
            [
                4302,
                4449
            ],
            [
                4449,
                4711
            ],
            [
                4711,
                4722
            ],
            [
                4722,
                4790
            ],
            [
                4790,
                4837
            ],
            [
                4837,
                5000
            ],
            [
                5000,
                5090
            ],
            [
                5090,
                5269
            ],
            [
                5269,
                5330
            ],
            [
                5330,
                5422
            ],
            [
                5422,
                5471
            ],
            [
                5471,
                5583
            ],
            [
                5583,
                5689
            ],
            [
                5689,
                5713
            ],
            [
                5713,
                5754
            ],
            [
                5754,
                5841
            ],
            [
                5841,
                5885
            ],
            [
                5885,
                6048
            ],
            [
                6048,
                6208
            ],
            [
                6208,
                6236
            ],
            [
                6236,
                6243
            ],
            [
                6243,
                6382
            ],
            [
                6382,
                6423
            ],
            [
                6423,
                6461
            ],
            [
                6461,
                6808
            ],
            [
                6808,
                6939
            ],
            [
                6939,
                7070
            ],
            [
                7070,
                7087
            ],
            [
                7087,
                7098
            ],
            [
                7098,
                7161
            ],
            [
                7161,
                7196
            ],
            [
                7196,
                7339
            ],
            [
                7339,
                7378
            ],
            [
                7378,
                7479
            ],
            [
                7479,
                7718
            ],
            [
                7718,
                7730
            ],
            [
                7730,
                7808
            ],
            [
                7808,
                8004
            ],
            [
                8004,
                8243
            ],
            [
                8243,
                8327
            ],
            [
                8327,
                8601
            ],
            [
                8601,
                8751
            ],
            [
                8751,
                8756
            ],
            [
                8756,
                8795
            ],
            [
                8795,
                8841
            ],
            [
                8841,
                8863
            ],
            [
                8863,
                8868
            ],
            [
                8868,
                8902
            ],
            [
                8902,
                9358
            ],
            [
                9358,
                9448
            ],
            [
                9448,
                9490
            ],
            [
                9490,
                9525
            ],
            [
                9525,
                9557
            ],
            [
                9557,
                9607
            ],
            [
                9607,
                9725
            ],
            [
                9725,
                9735
            ],
            [
                9735,
                9762
            ],
            [
                9762,
                9829
            ],
            [
                9829,
                9890
            ],
            [
                9890,
                10003
            ],
            [
                10003,
                10324
            ],
            [
                10324,
                10680
            ],
            [
                10680,
                10798
            ],
            [
                10798,
                10872
            ],
            [
                10872,
                11128
            ],
            [
                11128,
                11411
            ],
            [
                11411,
                11622
            ],
            [
                11622,
                11859
            ],
            [
                11859,
                11981
            ],
            [
                11981,
                12092
            ],
            [
                12092,
                12124
            ],
            [
                12124,
                12157
            ],
            [
                12157,
                12310
            ],
            [
                12310,
                12316
            ],
            [
                12316,
                12497
            ],
            [
                12497,
                12714
            ],
            [
                12714,
                12814
            ],
            [
                12814,
                12844
            ],
            [
                12844,
                12869
            ],
            [
                12869,
                12910
            ],
            [
                12910,
                12989
            ],
            [
                12989,
                13101
            ],
            [
                13101,
                13288
            ],
            [
                13288,
                13390
            ],
            [
                13390,
                13568
            ],
            [
                13568,
                13720
            ],
            [
                13720,
                13793
            ],
            [
                13793,
                13928
            ],
            [
                13928,
                14086
            ],
            [
                14086,
                14177
            ],
            [
                14177,
                14495
            ],
            [
                14495,
                14664
            ],
            [
                14664,
                14728
            ],
            [
                14728,
                14847
            ],
            [
                14847,
                14881
            ],
            [
                14881,
                14999
            ],
            [
                14999,
                15076
            ],
            [
                15076,
                15094
            ],
            [
                15094,
                15105
            ],
            [
                15105,
                15121
            ],
            [
                15121,
                15324
            ],
            [
                15324,
                15390
            ],
            [
                15390,
                15399
            ],
            [
                15399,
                15421
            ],
            [
                15421,
                15507
            ],
            [
                15507,
                15559
            ],
            [
                15559,
                15593
            ],
            [
                15593,
                15720
            ],
            [
                15720,
                15755
            ],
            [
                15755,
                15763
            ],
            [
                15763,
                15781
            ],
            [
                15781,
                15803
            ],
            [
                15803,
                15808
            ],
            [
                15808,
                15816
            ],
            [
                15816,
                15852
            ],
            [
                15852,
                15887
            ],
            [
                15887,
                15894
            ],
            [
                15894,
                15923
            ],
            [
                15923,
                15939
            ],
            [
                15939,
                15962
            ],
            [
                15962,
                15987
            ],
            [
                15987,
                16010
            ],
            [
                16010,
                16057
            ],
            [
                16057,
                16297
            ],
            [
                16297,
                16456
            ],
            [
                16456,
                16633
            ],
            [
                16633,
                16714
            ],
            [
                16714,
                16741
            ],
            [
                16741,
                16763
            ],
            [
                16763,
                16828
            ],
            [
                16828,
                16894
            ],
            [
                16894,
                16911
            ],
            [
                16911,
                16961
            ],
            [
                16961,
                17025
            ],
            [
                17025,
                17053
            ],
            [
                17053,
                17130
            ],
            [
                17130,
                17195
            ],
            [
                17195,
                17257
            ],
            [
                17257,
                17401
            ],
            [
                17401,
                17586
            ],
            [
                17586,
                17784
            ],
            [
                17784,
                17861
            ],
            [
                17861,
                17868
            ],
            [
                17868,
                17937
            ],
            [
                17937,
                17970
            ],
            [
                17970,
                18031
            ],
            [
                18031,
                18070
            ],
            [
                18070,
                18257
            ],
            [
                18257,
                18403
            ],
            [
                18403,
                18561
            ],
            [
                18561,
                18624
            ],
            [
                18624,
                18844
            ],
            [
                18844,
                18899
            ],
            [
                18899,
                19066
            ],
            [
                19066,
                19140
            ],
            [
                19140,
                19207
            ],
            [
                19207,
                19305
            ],
            [
                19305,
                19327
            ],
            [
                19327,
                19533
            ]
        ],
        "overlap_chars": [
            [
                0,
                28
            ],
            [
                37,
                47
            ],
            [
                89,
                90
            ],
            [
                55,
                63
            ],
            [
                83,
                89
            ],
            [
                148,
                150
            ],
            [
                150,
                243
            ],
            [
                243,
                327
            ],
            [
                327,
                481
            ],
            [
                481,
                555
            ],
            [
                555,
                634
            ],
            [
                685,
                688
            ],
            [
                711,
                744
            ],
            [
                867,
                870
            ],
            [
                635,
                660
            ],
            [
                904,
                996
            ],
            [
                996,
                1014
            ],
            [
                1028,
                1075
            ],
            [
                1090,
                1137
            ],
            [
                1137,
                1218
            ],
            [
                1230,
                1238
            ],
            [
                1238,
                1262
            ],
            [
                1304,
                1343
            ],
            [
                1345,
                1367
            ],
            [
                1379,
                1381
            ],
            [
                1381,
                1467
            ],
            [
                1467,
                1488
            ],
            [
                1488,
                1504
            ],
            [
                1546,
                1547
            ],
            [
                1555,
                1568
            ],
            [
                1704,
                1706
            ],
            [
                1711,
                1773
            ],
            [
                1773,
                1872
            ],
            [
                1872,
                1982
            ],
            [
                2092,
                2133
            ],
            [
                2133,
                2214
            ],
            [
                2237,
                2248
            ],
            [
                2214,
                2215
            ],
            [
                2350,
                2412
            ],
            [
                2412,
                2415
            ],
            [
                2426,
                2433
            ],
            [
                2445,
                2453
            ],
            [
                2453,
                2503
            ],
            [
                2503,
                2533
            ],
            [
                2555,
                2556
            ],
            [
                2608,
                2613
            ],
            [
                2615,
                2663
            ],
            [
                2663,
                2715
            ],
            [
                2715,
                2765
            ],
            [
                2765,
                2830
            ],
            [
                2830,
                2848
            ],
            [
                2848,
                2880
            ],
            [
                2889,
                2891
            ],
            [
                2891,
                2997
            ],
            [
                2997,
                3070
            ],
            [
                3070,
                3143
            ],
            [
                3143,
                3210
            ],
            [
                3210,
                3304
            ],
            [
                3304,
                3340
            ],
            [
                3386,
                3413
            ],
            [
                3413,
                3510
            ],
            [
                3525,
                3547
            ],
            [
                3573,
                3629
            ],
            [
                3629,
                3698
            ],
            [
                3779,
                3796
            ],
            [
                3770,
                3777
            ],
            [
                3799,
                3810
            ],
            [
                3813,
                3815
            ],
            [
                3815,
                3875
            ],
            [
                3875,
                3894
            ],
            [
                3894,
                3908
            ],
            [
                3908,
                3937
            ],
            [
                3937,
                3999
            ],
            [
                4100,
                4155
            ],
            [
                4157,
                4202
            ],
            [
                4202,
                4302
            ],
            [
                4302,
                4424
            ],
            [
                4439,
                4448
            ],
            [
                4449,
                4520
            ],
            [
                4525,
                4657
            ],
            [
                4695,
                4711
            ],
            [
                4711,
                4722
            ],
            [
                4722,
                4735
            ],
            [
                4736,
                4790
            ],
            [
                4790,
                4837
            ],
            [
                4837,
                4972
            ],
            [
                4985,
                5000
            ],
            [
                5000,
                5090
            ],
            [
                5090,
                5094
            ],
            [
                5102,
                5121
            ],
            [
                5127,
                5133
            ],
            [
                5179,
                5201
            ],
            [
                5218,
                5227
            ],
            [
                5269,
                5283
            ],
            [
                5311,
                5330
            ],
            [
                5380,
                5422
            ],
            [
                5885,
                6041
            ],
            [
                6042,
                6048
            ],
            [
                6048,
                6060
            ],
            [
                6078,
                6104
            ],
            [
                6163,
                6208
            ],
            [
                6208,
                6236
            ],
            [
                6236,
                6243
            ],
            [
                6243,
                6382
            ],
            [
                6382,
                6406
            ],
            [
                6421,
                6423
            ],
            [
                6423,
                6461
            ],
            [
                6842,
                6853
            ],
            [
                6878,
                6888
            ],
            [
                6902,
                6939
            ],
            [
                6939,
                6990
            ],
            [
                7025,
                7052
            ],
            [
                7070,
                7087
            ],
            [
                7087,
                7098
            ],
            [
                7098,
                7161
            ],
            [
                7161,
                7196
            ],
            [
                7196,
                7216
            ],
            [
                7264,
                7339
            ],
            [
                7339,
                7378
            ],
            [
                7378,
                7430
            ],
            [
                7477,
                7479
            ],
            [
                7634,
                7718
            ],
            [
                7718,
                7730
            ],
            [
                7730,
                7799
            ],
            [
                7806,
                7808
            ],
            [
                7808,
                7862
            ],
            [
                7880,
                7896
            ],
            [
                7957,
                8004
            ],
            [
                8004,
                8014
            ],
            [
                8024,
                8056
            ],
            [
                8062,
                8092
            ],
            [
                8127,
                8128
            ],
            [
                8114,
                8127
            ],
            [
                8179,
                8182
            ],
            [
                8201,
                8243
            ],
            [
                8243,
                8327
            ],
            [
                8327,
                8367
            ],
            [
                8433,
                8446
            ],
            [
                8452,
                8552
            ],
            [
                8599,
                8601
            ],
            [
                8601,
                8709
            ],
            [
                8903,
                9020
            ],
            [
                9033,
                9071
            ],
            [
                9107,
                9113
            ],
            [
                9162,
                9227
            ],
            [
                9229,
                9277
            ],
            [
                9159,
                9160
            ],
            [
                9284,
                9358
            ],
            [
                9358,
                9359
            ],
            [
                9364,
                9448
            ],
            [
                9448,
                9490
            ],
            [
                9490,
                9523
            ],
            [
                9557,
                9567
            ],
            [
                9582,
                9607
            ],
            [
                9616,
                9685
            ],
            [
                9707,
                9723
            ],
            [
                9829,
                9878
            ],
            [
                9888,
                9890
            ],
            [
                9890,
                9893
            ],
            [
                9957,
                10003
            ],
            [
                10003,
                10073
            ],
            [
                10092,
                10110
            ],
            [
                10121,
                10143
            ],
            [
                10180,
                10229
            ],
            [
                10248,
                10279
            ],
            [
                10299,
                10324
            ],
            [
                10324,
                10360
            ],
            [
                10362,
                10366
            ],
            [
                10390,
                10468
            ],
            [
                10490,
                10634
            ],
            [
                10648,
                10680
            ],
            [
                10680,
                10718
            ],
            [
                10719,
                10798
            ],
            [
                10798,
                10872
            ],
            [
                10872,
                10915
            ],
            [
                10997,
                10998
            ],
            [
                11061,
                11113
            ],
            [
                11123,
                11125
            ],
            [
                11125,
                11128
            ],
            [
                11370,
                11379
            ],
            [
                11414,
                11417
            ],
            [
                11422,
                11430
            ],
            [
                11239,
                11243
            ],
            [
                11439,
                11552
            ],
            [
                11418,
                11421
            ],
            [
                11601,
                11622
            ],
            [
                11639,
                11718
            ],
            [
                11752,
                11779
            ],
            [
                11857,
                11859
            ],
            [
                11859,
                11869
            ],
            [
                11899,
                11980
            ],
            [
                11981,
                12023
            ],
            [
                12042,
                12045
            ],
            [
                12049,
                12071
            ],
            [
                12088,
                12092
            ],
            [
                12092,
                12102
            ],
            [
                12114,
                12124
            ],
            [
                12124,
                12157
            ],
            [
                12310,
                12316
            ],
            [
                12316,
                12393
            ],
            [
                12494,
                12497
            ],
            [
                12497,
                12500
            ],
            [
                12501,
                12574
            ],
            [
                12585,
                12601
            ],
            [
                12612,
                12618
            ],
            [
                12602,
                12611
            ],
            [
                12618,
                12629
            ],
            [
                12633,
                12639
            ],
            [
                12645,
                12648
            ],
            [
                12670,
                12687
            ],
            [
                12700,
                12714
            ],
            [
                12714,
                12814
            ],
            [
                12814,
                12844
            ],
            [
                12844,
                12869
            ],
            [
                12910,
                12938
            ],
            [
                12889,
                12908
            ],
            [
                12938,
                12939
            ],
            [
                12869,
                12870
            ],
            [
                12940,
                12989
            ],
            [
                12989,
                13024
            ],
            [
                13037,
                13055
            ],
            [
                13072,
                13101
            ],
            [
                13101,
                13104
            ],
            [
                13124,
                13187
            ],
            [
                13200,
                13288
            ],
            [
                13288,
                13390
            ],
            [
                13390,
                13394
            ],
            [
                13404,
                13407
            ],
            [
                13506,
                13512
            ],
            [
                13542,
                13547
            ],
            [
                13551,
                13568
            ],
            [
                13568,
                13640
            ],
            [
                13706,
                13720
            ],
            [
                13720,
                13740
            ],
            [
                13751,
                13793
            ],
            [
                13823,
                13831
            ],
            [
                13795,
                13802
            ],
            [
                13849,
                13866
            ],
            [
                13926,
                13928
            ],
            [
                13928,
                13934
            ],
            [
                13947,
                13974
            ],
            [
                13975,
                13994
            ],
            [
                13999,
                14025
            ],
            [
                14034,
                14085
            ],
            [
                14728,
                14737
            ],
            [
                14737,
                14738
            ],
            [
                14739,
                14775
            ],
            [
                14797,
                14846
            ],
            [
                14847,
                14868
            ],
            [
                14879,
                14881
            ],
            [
                15137,
                15140
            ],
            [
                15121,
                15129
            ],
            [
                15148,
                15258
            ],
            [
                15280,
                15282
            ],
            [
                15259,
                15276
            ],
            [
                15304,
                15323
            ],
            [
                15324,
                15348
            ],
            [
                15365,
                15390
            ],
            [
                15390,
                15399
            ],
            [
                15399,
                15421
            ],
            [
                15421,
                15507
            ],
            [
                15507,
                15559
            ],
            [
                15559,
                15569
            ],
            [
                15591,
                15593
            ],
            [
                15593,
                15639
            ],
            [
                15649,
                15660
            ],
            [
                15678,
                15720
            ],
            [
                15720,
                15755
            ],
            [
                15755,
                15763
            ],
            [
                15763,
                15781
            ],
            [
                15781,
                15803
            ],
            [
                15803,
                15808
            ],
            [
                15808,
                15816
            ],
            [
                15816,
                15852
            ],
            [
                15894,
                15895
            ],
            [
                15897,
                15923
            ],
            [
                15923,
                15939
            ],
            [
                15962,
                15987
            ],
            [
                15987,
                16010
            ],
            [
                16010,
                16011
            ],
            [
                16057,
                16089
            ],
            [
                16041,
                16055
            ],
            [
                16089,
                16198
            ],
            [
                16236,
                16270
            ],
            [
                16288,
                16297
            ],
            [
                16297,
                16351
            ],
            [
                16369,
                16372
            ],
            [
                16396,
                16417
            ],
            [
                16419,
                16456
            ],
            [
                16456,
                16494
            ],
            [
                16507,
                16633
            ],
            [
                16633,
                16714
            ],
            [
                16714,
                16741
            ],
            [
                16763,
                16828
            ],
            [
                16828,
                16894
            ],
            [
                16894,
                16911
            ],
            [
                16911,
                16960
            ],
            [
                17025,
                17053
            ],
            [
                17053,
                17091
            ],
            [
                17103,
                17130
            ],
            [
                17130,
                17144
            ],
            [
                17193,
                17195
            ],
            [
                17195,
                17257
            ],
            [
                17257,
                17331
            ],
            [
                17372,
                17401
            ],
            [
                17401,
                17474
            ],
            [
                17498,
                17586
            ],
            [
                17586,
                17630
            ],
            [
                17635,
                17657
            ],
            [
                17699,
                17784
            ],
            [
                17784,
                17861
            ],
            [
                17861,
                17868
            ],
            [
                17868,
                17897
            ],
            [
                17898,
                17937
            ],
            [
                17937,
                17970
            ],
            [
                18070,
                18113
            ],
            [
                18130,
                18257
            ],
            [
                18403,
                18407
            ],
            [
                18541,
                18560
            ],
            [
                18415,
                18440
            ],
            [
                18471,
                18472
            ],
            [
                18561,
                18562
            ],
            [
                18595,
                18624
            ],
            [
                18624,
                18702
            ],
            [
                18754,
                18759
            ],
            [
                18770,
                18844
            ],
            [
                18844,
                18899
            ],
            [
                18899,
                18923
            ],
            [
                19032,
                19064
            ],
            [
                18926,
                18952
            ],
            [
                18978,
                18992
            ],
            [
                19207,
                19214
            ],
            [
                19147,
                19163
            ],
            [
                19215,
                19305
            ],
            [
                19305,
                19326
            ]
        ],
        "row_chars": [
            [
                0,
                150
            ],
            [
                150,
                243
            ],
            [
                243,
                327
            ],
            [
                327,
                481
            ],
            [
                481,
                555
            ],
            [
                555,
                904
            ],
            [
                904,
                996
            ],
            [
                996,
                1137
            ],
            [
                1137,
                1238
            ],
            [
                1238,
                1381
            ],
            [
                1381,
                1467
            ],
            [
                1467,
                1488
            ],
            [
                1488,
                1568
            ],
            [
                1568,
                1586
            ],
            [
                1586,
                1623
            ],
            [
                1623,
                1704
            ],
            [
                1704,
                1773
            ],
            [
                1773,
                1872
            ],
            [
                1872,
                1982
            ],
            [
                1982,
                2092
            ],
            [
                2092,
                2133
            ],
            [
                2133,
                2412
            ],
            [
                2412,
                2453
            ],
            [
                2453,
                2503
            ],
            [
                2503,
                2663
            ],
            [
                2663,
                2715
            ],
            [
                2715,
                2765
            ],
            [
                2765,
                2830
            ],
            [
                2830,
                2848
            ],
            [
                2848,
                2891
            ],
            [
                2891,
                2997
            ],
            [
                2997,
                3070
            ],
            [
                3070,
                3143
            ],
            [
                3143,
                3210
            ],
            [
                3210,
                3304
            ],
            [
                3304,
                3413
            ],
            [
                3413,
                3547
            ],
            [
                3547,
                3573
            ],
            [
                3573,
                3629
            ],
            [
                3629,
                3698
            ],
            [
                3698,
                3815
            ],
            [
                3815,
                3875
            ],
            [
                3875,
                3894
            ],
            [
                3894,
                3908
            ],
            [
                3908,
                3937
            ],
            [
                3937,
                4202
            ],
            [
                4202,
                4302
            ],
            [
                4302,
                4449
            ],
            [
                4449,
                4711
            ],
            [
                4711,
                4722
            ],
            [
                4722,
                4790
            ],
            [
                4790,
                4837
            ],
            [
                4837,
                5000
            ],
            [
                5000,
                5090
            ],
            [
                5090,
                5330
            ],
            [
                5330,
                5422
            ],
            [
                5422,
                5471
            ],
            [
                5471,
                5583
            ],
            [
                5583,
                5689
            ],
            [
                5689,
                5713
            ],
            [
                5713,
                5754
            ],
            [
                5754,
                5841
            ],
            [
                5841,
                5885
            ],
            [
                5885,
                6048
            ],
            [
                6048,
                6208
            ],
            [
                6208,
                6236
            ],
            [
                6236,
                6243
            ],
            [
                6243,
                6382
            ],
            [
                6382,
                6423
            ],
            [
                6423,
                6461
            ],
            [
                6461,
                6808
            ],
            [
                6808,
                6939
            ],
            [
                6939,
                7087
            ],
            [
                7087,
                7098
            ],
            [
                7098,
                7161
            ],
            [
                7161,
                7196
            ],
            [
                7196,
                7339
            ],
            [
                7339,
                7378
            ],
            [
                7378,
                7479
            ],
            [
                7479,
                7718
            ],
            [
                7718,
                7730
            ],
            [
                7730,
                7808
            ],
            [
                7808,
                8004
            ],
            [
                8004,
                8243
            ],
            [
                8243,
                8327
            ],
            [
                8327,
                8601
            ],
            [
                8601,
                8751
            ],
            [
                8751,
                8756
            ],
            [
                8756,
                8795
            ],
            [
                8795,
                8841
            ],
            [
                8841,
                8863
            ],
            [
                8863,
                8868
            ],
            [
                8868,
                8902
            ],
            [
                8902,
                9358
            ],
            [
                9358,
                9448
            ],
            [
                9448,
                9490
            ],
            [
                9490,
                9525
            ],
            [
                9525,
                9557
            ],
            [
                9557,
                9607
            ],
            [
                9607,
                9725
            ],
            [
                9725,
                9735
            ],
            [
                9735,
                9762
            ],
            [
                9762,
                9829
            ],
            [
                9829,
                9890
            ],
            [
                9890,
                10003
            ],
            [
                10003,
                10324
            ],
            [
                10324,
                10680
            ],
            [
                10680,
                10798
            ],
            [
                10798,
                10872
            ],
            [
                10872,
                11128
            ],
            [
                11128,
                11622
            ],
            [
                11622,
                11859
            ],
            [
                11859,
                11981
            ],
            [
                11981,
                12092
            ],
            [
                12092,
                12124
            ],
            [
                12124,
                12157
            ],
            [
                12157,
                12310
            ],
            [
                12310,
                12316
            ],
            [
                12316,
                12497
            ],
            [
                12497,
                12714
            ],
            [
                12714,
                12814
            ],
            [
                12814,
                12844
            ],
            [
                12844,
                12869
            ],
            [
                12869,
                12989
            ],
            [
                12989,
                13101
            ],
            [
                13101,
                13288
            ],
            [
                13288,
                13390
            ],
            [
                13390,
                13568
            ],
            [
                13568,
                13720
            ],
            [
                13720,
                13793
            ],
            [
                13793,
                13928
            ],
            [
                13928,
                14086
            ],
            [
                14086,
                14177
            ],
            [
                14177,
                14495
            ],
            [
                14495,
                14664
            ],
            [
                14664,
                14728
            ],
            [
                14728,
                14847
            ],
            [
                14847,
                14881
            ],
            [
                14881,
                14999
            ],
            [
                14999,
                15076
            ],
            [
                15076,
                15094
            ],
            [
                15094,
                15121
            ],
            [
                15121,
                15324
            ],
            [
                15324,
                15390
            ],
            [
                15390,
                15399
            ],
            [
                15399,
                15421
            ],
            [
                15421,
                15507
            ],
            [
                15507,
                15559
            ],
            [
                15559,
                15593
            ],
            [
                15593,
                15720
            ],
            [
                15720,
                15755
            ],
            [
                15755,
                15763
            ],
            [
                15763,
                15781
            ],
            [
                15781,
                15803
            ],
            [
                15803,
                15808
            ],
            [
                15808,
                15816
            ],
            [
                15816,
                15852
            ],
            [
                15852,
                15887
            ],
            [
                15887,
                15894
            ],
            [
                15894,
                15923
            ],
            [
                15923,
                15939
            ],
            [
                15939,
                15962
            ],
            [
                15962,
                15987
            ],
            [
                15987,
                16010
            ],
            [
                16010,
                16297
            ],
            [
                16297,
                16456
            ],
            [
                16456,
                16633
            ],
            [
                16633,
                16714
            ],
            [
                16714,
                16741
            ],
            [
                16741,
                16763
            ],
            [
                16763,
                16828
            ],
            [
                16828,
                16894
            ],
            [
                16894,
                16911
            ],
            [
                16911,
                16961
            ],
            [
                16961,
                17025
            ],
            [
                17025,
                17053
            ],
            [
                17053,
                17130
            ],
            [
                17130,
                17195
            ],
            [
                17195,
                17257
            ],
            [
                17257,
                17401
            ],
            [
                17401,
                17586
            ],
            [
                17586,
                17784
            ],
            [
                17784,
                17861
            ],
            [
                17861,
                17868
            ],
            [
                17868,
                17937
            ],
            [
                17937,
                17970
            ],
            [
                17970,
                18031
            ],
            [
                18031,
                18070
            ],
            [
                18070,
                18257
            ],
            [
                18257,
                18403
            ],
            [
                18403,
                18561
            ],
            [
                18561,
                18624
            ],
            [
                18624,
                18844
            ],
            [
                18844,
                18899
            ],
            [
                18899,
                19305
            ],
            [
                19305,
                19327
            ],
            [
                19327,
                19533
            ]
        ]
    },
    "abridged": {
        "text": "I had not the courage to see anyone that night, not even myself. I went up to my room in the dark, and prayed in the dark, and lay down in the dark to sleep. I had no need of any light to read my guardian's letter by, for I knew it by heart. I took it from the place where I kept it, and repeated its contents by its own clear light of integrity and love, and went to sleep with it on my pillow.\nI was up very early in the morning and called Charley to come for a walk. We bought flowers for the breakfast-table, and came back and arranged them, and had Charley's lesson before breakfast, and were as busy as possible. When my guardian appeared he said, \"Why, little woman, you look fresher than your flowers!\" And Mrs. Woodcourt translated a passage from the Mewlinnwillinwodd about my being like a mountain with the sun upon it.\nThis was all so pleasant that I hope it made me still more like the mountain than before. After breakfast I waited until I saw my guardian in his own room - the room of last night. Then I made an excuse to go in with my housekeeping keys, shutting the door after me.\n\"Well, Dame Durden?\" said my guardian, who was writing. He laid down his pen and leaned back in his chair looking at me. I have often spoken of his bright face, but I thought I had never seen it look so bright and good. There was a high happiness upon it which made me think, \"He has been doing some great kindness this morning.\"\nHe had never yet altered his old manner. I loved it and him so much that when I now went up to him and took my usual chair at his side, I hardly liked to disturb it by laying my hand on his breast. But his manner did not change at all.\n\"Dear guardian,\" said I, \"I want to speak to you. Have I been remiss in anything, since - since I brought the answer to your letter, guardian?\"\n\"You have been everything I could desire, my love.\"\n\"I am very glad indeed to hear that,\" I returned. \"You know, you said to me, was this the mistress of Bleak House. And I said, yes.\"\n\"Yes,\" said my guardian, nodding. He had put his arm about me as if there were something to protect me from and looked in my face, smiling.\n\"Since then,\" said I, \"we have never spoken on the subject except once.\"\n\"And then I said Bleak House was thinning fast; and so it was, my dear.\"\n\"And I said,\" I timidly reminded him, \"but its mistress remained.\"\nHe still held me in the same protecting manner and with the same bright goodness in his face.\n\"Dear guardian,\" said I, \"I know how considerate you have been. As so much time has passed, and as you spoke only this morning of my being so well again, perhaps I ought to renew the subject. I will be the mistress of Bleak House when you please.\"\n\"See,\" he returned gaily, \"what a sympathy there must be between us! When you came in, my mind was full of the same thing. When shall we give Bleak House its mistress, little woman?\"\n\"When you please.\"\n\"Next month?\"\n\"Next month, dear guardian.\"\n\"The day on which I take the happiest and best step of my life - the day on which I give Bleak House its little mistress - shall be next month then,\" said my guardian.\nI put my arms round his neck and kissed him just as I had done on the day when I brought my answer.\nA servant came to the door to announce Mr. Bucket, which was quite unnecessary, for Mr. Bucket was already looking in over her shoulder.\n\"Mr. Jarndyce and Miss Summerson,\" said he, rather out of breath, \"with apologies for intruding, will you allow me to order up a person that's on the stairs and that objects to being left there in case of us talking about him in his absence? Thank you. Be so good as to chair that there member in this direction, will you?\" said Mr. Bucket, beckoning over the banisters.\nThis singular request produced an old man in a black skull-cap, unable to walk, who was carried up by a couple of bearers and deposited near the door. Mr. Bucket immediately got rid of the bearers, mysteriously shut the door, and bolted it.\n\"Now, Mr. Jarndyce,\" he began, with a flourish of his finger, \"this gentleman's name is Smallweed. He's what you may call a dealer in bills. I've been negotiating with this gentleman on behalf of Sir Leicester Dedlock, Baronet, and one way and another I've been in and out and about his premises a good deal. His premises were formerly occupied by Krook - whom you saw in his lifetime if I don't mistake?\"\nMy guardian replied, \"Yes.\"\n\"Well! You are to understand,\" said Mr. Bucket, \"that this gentleman he come into Krook's property, and a good deal of magpie property there was. Vast lots of waste-paper. Lord bless you, of no use to nobody!\"\nMr. Smallweed suspiciously watched his face with the closest attention.\n\"Among them odd heaps of old papers, this gentleman naturally begins to rummage,\" said Mr. Bucket.\n\"To which? Say that again,\" cried Mr. Smallweed in a shrill, sharp voice.\n\"To rummage,\" repeated Mr. Bucket. \"Being a prudent man, you begin to rummage among the papers as you have come into; don't you?\"\n\"Of course I do,\" cried Mr. Smallweed.\n\"Of course you do,\" said Mr. Bucket conversationally. \"And so you chance to find, you know, a paper with the signature of Jarndyce to it. Don't you?\"\nMr. Smallweed glanced with a troubled eye at us and grudgingly nodded.\n\"And coming to look at that paper at your full leisure - all in good time - what do you find it to be but a will, you see. That's the humour of it,\" said Mr. Bucket with the lively air of recalling a joke, which Mr. Smallweed did not share; \"what do you find it to be but a will?\"\n\"I don't know that it's good as a will or as anything else,\" snarled Mr. Smallweed.\nMr. Bucket eyed the old man for a moment as if he were disposed to pounce upon him; nevertheless, he continued to bend over him with the same agreeable air.\n\"Notwithstanding which,\" said Mr. Bucket, \"you get a little doubtful and uncomfortable in your mind about it. And as you've heard a good deal mentioned regarding a celebrated Chancery will case of the same name, and as you know how Krook was for buying all manner of old papers, and always a-going to teach himself to read, you begin to think - and you never was more correct in your born days - 'By heaven, if I don't look about me, I may get into trouble regarding this will.'\"\n\"Mind how you put it, Bucket,\" cried the old man anxiously with his hand at his ear. \"Speak up; none of your brimstone tricks. Pick me up; I want to hear better.\"\nMr. Bucket picked him up at a dart. As soon as he could be heard through Mr. Smallweed's coughing and his cries of \"Oh, my bones!\" Mr. Bucket proceeded in the same convivial manner.\n\"So you take me into your confidence, don't you?\"\nI think it would be impossible to make an admission with more ill will than Mr. Smallweed when he admitted this, as if Mr. Bucket was the very last person he would have taken into his confidence if he could have kept him out of it.\n\"And I go into the business with you very pleasantly; and I confirm you in your well-founded fears that you will get yourself into trouble if you don't come out with that there will,\" said Mr. Bucket emphatically; \"and accordingly you arrange with me that it shall be delivered up to Mr. Jarndyce, on no conditions. If it should prove to be valuable, you're trusting yourself to him for your reward; that's about where it is, ain't it?\"\n\"That's what was agreed,\" Mr. Smallweed assented with the same bad grace.\n\"In consequence of which,\" said Mr. Bucket, \"the only thing that remains for you to do is just to hand it over!\"\nThe paper was produced with much reluctance and many declarations on the part of Mr. Smallweed that he was a poor industrious man and that he hoped he would not lose by his honesty. He very slowly took from a breast-pocket a stained, discoloured paper which was a little burnt at the edges. Mr. Bucket transferred this paper, with the dexterity of a conjuror, from Mr. Smallweed to Mr. Jarndyce.\nAs he gave it to my guardian, he whispered, \"They hadn't settled how to make money from it. Quarrelled about it. I laid out twenty pound upon it. Lord! There ain't one of the family that wouldn't sell the other for a pound or two.\"\n\"Mr. Bucket,\" said my guardian aloud, \"whatever the worth of this paper may be, my obligations to you are great; and if it is of any value, I shall see Mr. Smallweed rewarded accordingly.\"\n\"Not according to your merits, you know,\" said Mr. Bucket in friendly explanation to Mr. Smallweed. \"Don't you be afraid of that. According to its value.\"\n\"You may observe, Mr. Bucket,\" said my guardian, \"that I abstain from examining this paper myself. The plain truth is, I have forsworn the whole business, and my soul is sick of it. But I will immediately place the paper in the hands of my solicitor, and its existence shall be made known without delay to all other parties interested.\"\n\"Mr. Jarndyce can't say fairer than that, you understand,\" observed Mr. Bucket to his fellow-visitor. \"And now we may chair you home again.\"\nHe unbolted the door, called in the bearers, wished us good morning, and went his way.\nWe went our way too, to Lincoln's Inn, as quickly as possible. We found Mr. Kenge in his dusty room. Chairs were placed for us by Mr. Guppy, while Mr. Kenge expressed his surprise and gratification at the unusual sight of Mr. Jarndyce in his office.\n\"Mr. Kenge,\" began my guardian, \"before I lay this paper on your desk, let me tell you how it has come into my hands.\" He did so shortly and plainly.\nMr. Kenge did not at first seem to attach much importance to the paper, but when he saw it he appeared more interested, and when he had opened it and read a little, he became amazed.\n\"Mr. Jarndyce,\" he said, \"you have perused this?\"\n\"Not I!\" returned my guardian.\n\"But, my dear sir,\" said Mr. Kenge, \"it is a will of later date than any in the suit. It appears to be all in the testator's handwriting. It is duly witnessed. And even if intended to be cancelled, as might be supposed from these marks of fire, it is not cancelled. Here it is, a perfect instrument!\"\n\"Well!\" said my guardian. \"What is that to me?\"\n\"Mr. Guppy!\" cried Mr. Kenge, raising his voice. \"Go seek Mr. Vholes of Symond's Inn. My compliments. Glad to speak with him.\"\nMr. Guppy disappeared.\n\"If you had perused this document, Mr. Jarndyce, you would have seen that it reduces your interest considerably, though still leaving it a very handsome one,\" said Mr. Kenge, waving his hand blandly. \"You would further have seen that the interests of Mr. and Mrs. Richard Carstone are very materially advanced by it.\"\n\"Kenge,\" said my guardian, \"if all the wealth that the suit brought into this vile court of Chancery could fall to my two young cousins, I should be well contented. But do you ask me to believe that any good is to come of Jarndyce and Jarndyce?\"\n\"Oh, really, Mr. Jarndyce! My dear sir, this is a very great country, a very great country. Its system of equity is a very great system, a very great system. Really, really!\"\nMy guardian said no more, and Mr. Vholes arrived.\n\"How do you do, Mr. Vholes? Will you be so good as to take a chair and look over this paper?\"\nMr. Vholes did so. He was not excited by it, but he was not excited by anything. When he had well examined it, he retired with Mr. Kenge into a window, and spoke to him at some length. I was not surprised to observe Mr. Kenge inclined to dispute what he said, for I knew that no two people ever did agree about anything in Jarndyce and Jarndyce. But he seemed to get the better of Mr. Kenge in a conversation that included the words \"Receiver-General,\" \"Accountant-General,\" \"report,\" \"estate,\" and \"costs.\" When they had finished, they came back to Mr. Kenge's table and spoke aloud.\n\"Well! But this is a very remarkable and important document, Mr. Vholes,\" said Mr. Kenge.\nMr. Vholes said, \"Very much so.\"\n\"And as you say, Mr. Vholes, when the cause appears next term, this document will be an unexpected and interesting feature in it,\" said Mr. Kenge, looking loftily at my guardian.\n\"And when is next term?\" asked my guardian, rising.\n\"Next month,\" said Mr. Kenge. \"Of course we shall at once proceed to do what is necessary with this document; and you will receive our usual notification of the cause being in the paper.\"\n\"To which I shall pay, of course, my usual attention.\"\n\"Still bent, my dear sir, on echoing a popular prejudice?\" said Mr. Kenge, showing us to the door, \"This is a great country, and a great system, Mr. Jarndyce, and would you wish a great country to have a little system? Now, really, really!\"",
        "paragraph_chars": [
            [
                0,
                396
            ],
            [
                396,
                831
            ],
            [
                831,
                1098
            ],
            [
                1098,
                1428
            ],
            [
                1428,
                1664
            ],
            [
                1664,
                1808
            ],
            [
                1808,
                1860
            ],
            [
                1860,
                1993
            ],
            [
                1993,
                2133
            ],
            [
                2133,
                2206
            ],
            [
                2206,
                2279
            ],
            [
                2279,
                2346
            ],
            [
                2346,
                2440
            ],
            [
                2440,
                2688
            ],
            [
                2688,
                2871
            ],
            [
                2871,
                2890
            ],
            [
                2890,
                2904
            ],
            [
                2904,
                2933
            ],
            [
                2933,
                3101
            ],
            [
                3101,
                3201
            ],
            [
                3201,
                3338
            ],
            [
                3338,
                3709
            ],
            [
                3709,
                3950
            ],
            [
                3950,
                4356
            ],
            [
                4356,
                4384
            ],
            [
                4384,
                4594
            ],
            [
                4594,
                4666
            ],
            [
                4666,
                4765
            ],
            [
                4765,
                4839
            ],
            [
                4839,
                4969
            ],
            [
                4969,
                5008
            ],
            [
                5008,
                5158
            ],
            [
                5158,
                5229
            ],
            [
                5229,
                5510
            ],
            [
                5510,
                5594
            ],
            [
                5594,
                5751
            ],
            [
                5751,
                6231
            ],
            [
                6231,
                6394
            ],
            [
                6394,
                6576
            ],
            [
                6576,
                6626
            ],
            [
                6626,
                6858
            ],
            [
                6858,
                7295
            ],
            [
                7295,
                7369
            ],
            [
                7369,
                7482
            ],
            [
                7482,
                7878
            ],
            [
                7878,
                8110
            ],
            [
                8110,
                8299
            ],
            [
                8299,
                8454
            ],
            [
                8454,
                8791
            ],
            [
                8791,
                8932
            ],
            [
                8932,
                9019
            ],
            [
                9019,
                9269
            ],
            [
                9269,
                9419
            ],
            [
                9419,
                9602
            ],
            [
                9602,
                9652
            ],
            [
                9652,
                9683
            ],
            [
                9683,
                9984
            ],
            [
                9984,
                10032
            ],
            [
                10032,
                10159
            ],
            [
                10159,
                10182
            ],
            [
                10182,
                10500
            ],
            [
                10500,
                10746
            ],
            [
                10746,
                10921
            ],
            [
                10921,
                10971
            ],
            [
                10971,
                11065
            ],
            [
                11065,
                11650
            ],
            [
                11650,
                11740
            ],
            [
                11740,
                11773
            ],
            [
                11773,
                11952
            ],
            [
                11952,
                12004
            ],
            [
                12004,
                12192
            ],
            [
                12192,
                12247
            ],
            [
                12247,
                12487
            ]
        ],
        "segment_chars": [
            [
                0,
                65
            ],
            [
                65,
                158
            ],
            [
                158,
                242
            ],
            [
                242,
                396
            ],
            [
                396,
                470
            ],
            [
                470,
                619
            ],
            [
                619,
                711
            ],
            [
                711,
                831
            ],
            [
                831,
                921
            ],
            [
                921,
                1012
            ],
            [
                1012,
                1098
            ],
            [
                1098,
                1119
            ],
            [
                1119,
                1154
            ],
            [
                1154,
                1219
            ],
            [
                1219,
                1318
            ],
            [
                1318,
                1428
            ],
            [
                1428,
                1469
            ],
            [
                1469,
                1626
            ],
            [
                1626,
                1664
            ],
            [
                1664,
                1714
            ],
            [
                1714,
                1808
            ],
            [
                1808,
                1860
            ],
            [
                1860,
                1910
            ],
            [
                1910,
                1975
            ],
            [
                1975,
                1993
            ],
            [
                1993,
                2027
            ],
            [
                2027,
                2133
            ],
            [
                2133,
                2206
            ],
            [
                2206,
                2279
            ],
            [
                2279,
                2346
            ],
            [
                2346,
                2440
            ],
            [
                2440,
                2504
            ],
            [
                2504,
                2632
            ],
            [
                2632,
                2688
            ],
            [
                2688,
                2757
            ],
            [
                2757,
                2811
            ],
            [
                2811,
                2871
            ],
            [
                2871,
                2890
            ],
            [
                2890,
                2904
            ],
            [
                2904,
                2933
            ],
            [
                2933,
                3101
            ],
            [
                3101,
                3201
            ],
            [
                3201,
                3338
            ],
            [
                3338,
                3580
            ],
            [
                3580,
                3591
            ],
            [
                3591,
                3662
            ],
            [
                3662,
                3709
            ],
            [
                3709,
                3860
            ],
            [
                3860,
                3950
            ],
            [
                3950,
                4049
            ],
            [
                4049,
                4091
            ],
            [
                4091,
                4259
            ],
            [
                4259,
                4356
            ],
            [
                4356,
                4384
            ],
            [
                4384,
                4391
            ],
            [
                4391,
                4530
            ],
            [
                4530,
                4556
            ],
            [
                4556,
                4594
            ],
            [
                4594,
                4666
            ],
            [
                4666,
                4765
            ],
            [
                4765,
                4776
            ],
            [
                4776,
                4839
            ],
            [
                4839,
                4874
            ],
            [
                4874,
                4969
            ],
            [
                4969,
                5008
            ],
            [
                5008,
                5062
            ],
            [
                5062,
                5146
            ],
            [
                5146,
                5158
            ],
            [
                5158,
                5229
            ],
            [
                5229,
                5352
            ],
            [
                5352,
                5510
            ],
            [
                5510,
                5594
            ],
            [
                5594,
                5751
            ],
            [
                5751,
                5861
            ],
            [
                5861,
                6231
            ],
            [
                6231,
                6316
            ],
            [
                6316,
                6358
            ],
            [
                6358,
                6394
            ],
            [
                6394,
                6430
            ],
            [
                6430,
                6525
            ],
            [
                6525,
                6576
            ],
            [
                6576,
                6626
            ],
            [
                6626,
                6858
            ],
            [
                6858,
                7174
            ],
            [
                7174,
                7295
            ],
            [
                7295,
                7369
            ],
            [
                7369,
                7482
            ],
            [
                7482,
                7664
            ],
            [
                7664,
                7773
            ],
            [
                7773,
                7878
            ],
            [
                7878,
                7970
            ],
            [
                7970,
                7991
            ],
            [
                7991,
                8024
            ],
            [
                8024,
                8030
            ],
            [
                8030,
                8110
            ],
            [
                8110,
                8299
            ],
            [
                8299,
                8399
            ],
            [
                8399,
                8429
            ],
            [
                8429,
                8454
            ],
            [
                8454,
                8553
            ],
            [
                8553,
                8636
            ],
            [
                8636,
                8791
            ],
            [
                8791,
                8893
            ],
            [
                8893,
                8932
            ],
            [
                8932,
                9019
            ],
            [
                9019,
                9082
            ],
            [
                9082,
                9120
            ],
            [
                9120,
                9269
            ],
            [
                9269,
                9388
            ],
            [
                9388,
                9419
            ],
            [
                9419,
                9602
            ],
            [
                9602,
                9652
            ],
            [
                9652,
                9661
            ],
            [
                9661,
                9683
            ],
            [
                9683,
                9769
            ],
            [
                9769,
                9821
            ],
            [
                9821,
                9843
            ],
            [
                9843,
                9949
            ],
            [
                9949,
                9984
            ],
            [
                9984,
                9992
            ],
            [
                9992,
                10010
            ],
            [
                10010,
                10032
            ],
            [
                10032,
                10037
            ],
            [
                10037,
                10045
            ],
            [
                10045,
                10081
            ],
            [
                10081,
                10118
            ],
            [
                10118,
                10134
            ],
            [
                10134,
                10159
            ],
            [
                10159,
                10182
            ],
            [
                10182,
                10382
            ],
            [
                10382,
                10500
            ],
            [
                10500,
                10665
            ],
            [
                10665,
                10746
            ],
            [
                10746,
                10773
            ],
            [
                10773,
                10838
            ],
            [
                10838,
                10904
            ],
            [
                10904,
                10921
            ],
            [
                10921,
                10971
            ],
            [
                10971,
                10999
            ],
            [
                10999,
                11065
            ],
            [
                11065,
                11084
            ],
            [
                11084,
                11146
            ],
            [
                11146,
                11250
            ],
            [
                11250,
                11411
            ],
            [
                11411,
                11573
            ],
            [
                11573,
                11650
            ],
            [
                11650,
                11657
            ],
            [
                11657,
                11740
            ],
            [
                11740,
                11773
            ],
            [
                11773,
                11952
            ],
            [
                11952,
                11977
            ],
            [
                11977,
                12004
            ],
            [
                12004,
                12034
            ],
            [
                12034,
                12192
            ],
            [
                12192,
                12247
            ],
            [
                12247,
                12306
            ],
            [
                12306,
                12466
            ],
            [
                12466,
                12487
            ]
        ],
        "overlap_chars": [
            [
                0,
                28
            ],
            [
                36,
                46
            ],
            [
                46,
                47
            ],
            [
                48,
                56
            ],
            [
                57,
                63
            ],
            [
                63,
                65
            ],
            [
                65,
                158
            ],
            [
                158,
                242
            ],
            [
                242,
                396
            ],
            [
                396,
                470
            ],
            [
                470,
                549
            ],
            [
                550,
                553
            ],
            [
                554,
                587
            ],
            [
                589,
                592
            ],
            [
                593,
                618
            ],
            [
                619,
                711
            ],
            [
                711,
                729
            ],
            [
                730,
                777
            ],
            [
                784,
                831
            ],
            [
                831,
                912
            ],
            [
                913,
                921
            ],
            [
                921,
                945
            ],
            [
                946,
                985
            ],
            [
                988,
                1010
            ],
            [
                1010,
                1012
            ],
            [
                1012,
                1098
            ],
            [
                1098,
                1119
            ],
            [
                1119,
                1135
            ],
            [
                1135,
                1136
            ],
            [
                1141,
                1154
            ],
            [
                1154,
                1156
            ],
            [
                1157,
                1219
            ],
            [
                1219,
                1318
            ],
            [
                1318,
                1428
            ],
            [
                1428,
                1469
            ],
            [
                1469,
                1550
            ],
            [
                1551,
                1562
            ],
            [
                1562,
                1563
            ],
            [
                1564,
                1626
            ],
            [
                1626,
                1629
            ],
            [
                1641,
                1648
            ],
            [
                1656,
                1664
            ],
            [
                1664,
                1714
            ],
            [
                1714,
                1744
            ],
            [
                1744,
                1745
            ],
            [
                1746,
                1751
            ],
            [
                1760,
                1808
            ],
            [
                1808,
                1860
            ],
            [
                1860,
                1910
            ],
            [
                1910,
                1975
            ],
            [
                1975,
                1993
            ],
            [
                1993,
                2025
            ],
            [
                2025,
                2027
            ],
            [
                2027,
                2133
            ],
            [
                2133,
                2206
            ],
            [
                2206,
                2279
            ],
            [
                2279,
                2346
            ],
            [
                2346,
                2440
            ],
            [
                2440,
                2476
            ],
            [
                2477,
                2504
            ],
            [
                2504,
                2601
            ],
            [
                2610,
                2632
            ],
            [
                2632,
                2688
            ],
            [
                2688,
                2757
            ],
            [
                2757,
                2774
            ],
            [
                2775,
                2782
            ],
            [
                2783,
                2794
            ],
            [
                2809,
                2811
            ],
            [
                2811,
                2871
            ],
            [
                2871,
                2890
            ],
            [
                2890,
                2904
            ],
            [
                2904,
                2933
            ],
            [
                2933,
                2995
            ],
            [
                2998,
                3053
            ],
            [
                3056,
                3101
            ],
            [
                3101,
                3201
            ],
            [
                3201,
                3323
            ],
            [
                3328,
                3337
            ],
            [
                3338,
                3409
            ],
            [
                3410,
                3542
            ],
            [
                3564,
                3580
            ],
            [
                3580,
                3591
            ],
            [
                3591,
                3604
            ],
            [
                3608,
                3662
            ],
            [
                3662,
                3709
            ],
            [
                3709,
                3844
            ],
            [
                3845,
                3860
            ],
            [
                3860,
                3950
            ],
            [
                3950,
                3954
            ],
            [
                3954,
                3973
            ],
            [
                3974,
                3980
            ],
            [
                3981,
                4003
            ],
            [
                4004,
                4013
            ],
            [
                4013,
                4027
            ],
            [
                4030,
                4049
            ],
            [
                4049,
                4091
            ],
            [
                4091,
                4247
            ],
            [
                4253,
                4259
            ],
            [
                4259,
                4271
            ],
            [
                4277,
                4303
            ],
            [
                4311,
                4356
            ],
            [
                4356,
                4384
            ],
            [
                4384,
                4391
            ],
            [
                4391,
                4530
            ],
            [
                4530,
                4554
            ],
            [
                4554,
                4556
            ],
            [
                4556,
                4594
            ],
            [
                4596,
                4607
            ],
            [
                4608,
                4618
            ],
            [
                4629,
                4666
            ],
            [
                4666,
                4717
            ],
            [
                4718,
                4745
            ],
            [
                4748,
                4765
            ],
            [
                4765,
                4776
            ],
            [
                4776,
                4839
            ],
            [
                4839,
                4874
            ],
            [
                4874,
                4894
            ],
            [
                4894,
                4969
            ],
            [
                4969,
                5008
            ],
            [
                5008,
                5060
            ],
            [
                5060,
                5062
            ],
            [
                5062,
                5146
            ],
            [
                5146,
                5158
            ],
            [
                5158,
                5227
            ],
            [
                5227,
                5229
            ],
            [
                5229,
                5283
            ],
            [
                5286,
                5302
            ],
            [
                5305,
                5352
            ],
            [
                5352,
                5362
            ],
            [
                5370,
                5402
            ],
            [
                5403,
                5433
            ],
            [
                5433,
                5434
            ],
            [
                5441,
                5454
            ],
            [
                5459,
                5462
            ],
            [
                5468,
                5510
            ],
            [
                5510,
                5594
            ],
            [
                5594,
                5634
            ],
            [
                5635,
                5648
            ],
            [
                5649,
                5749
            ],
            [
                5749,
                5751
            ],
            [
                5751,
                5859
            ],
            [
                5861,
                5978
            ],
            [
                5983,
                6021
            ],
            [
                6022,
                6028
            ],
            [
                6028,
                6093
            ],
            [
                6096,
                6144
            ],
            [
                6147,
                6148
            ],
            [
                6157,
                6231
            ],
            [
                6231,
                6232
            ],
            [
                6232,
                6316
            ],
            [
                6316,
                6358
            ],
            [
                6358,
                6391
            ],
            [
                6394,
                6404
            ],
            [
                6405,
                6430
            ],
            [
                6430,
                6499
            ],
            [
                6506,
                6522
            ],
            [
                6525,
                6574
            ],
            [
                6574,
                6576
            ],
            [
                6576,
                6579
            ],
            [
                6580,
                6626
            ],
            [
                6626,
                6696
            ],
            [
                6697,
                6715
            ],
            [
                6716,
                6738
            ],
            [
                6745,
                6794
            ],
            [
                6801,
                6832
            ],
            [
                6833,
                6858
            ],
            [
                6858,
                6894
            ],
            [
                6895,
                6899
            ],
            [
                6910,
                6988
            ],
            [
                6997,
                7141
            ],
            [
                7142,
                7174
            ],
            [
                7174,
                7212
            ],
            [
                7216,
                7295
            ],
            [
                7295,
                7369
            ],
            [
                7369,
                7412
            ],
            [
                7413,
                7414
            ],
            [
                7414,
                7466
            ],
            [
                7472,
                7474
            ],
            [
                7479,
                7482
            ],
            [
                7482,
                7491
            ],
            [
                7492,
                7495
            ],
            [
                7496,
                7504
            ],
            [
                7505,
                7509
            ],
            [
                7510,
                7623
            ],
            [
                7639,
                7642
            ],
            [
                7643,
                7664
            ],
            [
                7664,
                7743
            ],
            [
                7744,
                7771
            ],
            [
                7771,
                7773
            ],
            [
                7773,
                7783
            ],
            [
                7796,
                7877
            ],
            [
                7878,
                7920
            ],
            [
                7920,
                7923
            ],
            [
                7932,
                7954
            ],
            [
                7966,
                7970
            ],
            [
                7970,
                7980
            ],
            [
                7981,
                7991
            ],
            [
                7991,
                8024
            ],
            [
                8024,
                8030
            ],
            [
                8030,
                8107
            ],
            [
                8107,
                8110
            ],
            [
                8110,
                8113
            ],
            [
                8115,
                8188
            ],
            [
                8188,
                8204
            ],
            [
                8205,
                8211
            ],
            [
                8212,
                8221
            ],
            [
                8221,
                8232
            ],
            [
                8236,
                8242
            ],
            [
                8248,
                8251
            ],
            [
                8258,
                8275
            ],
            [
                8285,
                8299
            ],
            [
                8299,
                8399
            ],
            [
                8399,
                8429
            ],
            [
                8429,
                8454
            ],
            [
                8454,
                8482
            ],
            [
                8482,
                8501
            ],
            [
                8501,
                8502
            ],
            [
                8503,
                8504
            ],
            [
                8504,
                8553
            ],
            [
                8553,
                8588
            ],
            [
                8589,
                8607
            ],
            [
                8607,
                8636
            ],
            [
                8636,
                8639
            ],
            [
                8640,
                8703
            ],
            [
                8703,
                8791
            ],
            [
                8791,
                8893
            ],
            [
                8893,
                8897
            ],
            [
                8898,
                8901
            ],
            [
                8902,
                8908
            ],
            [
                8909,
                8914
            ],
            [
                8915,
                8932
            ],
            [
                8932,
                9004
            ],
            [
                9005,
                9019
            ],
            [
                9019,
                9039
            ],
            [
                9040,
                9082
            ],
            [
                9082,
                9090
            ],
            [
                9093,
                9100
            ],
            [
                9101,
                9118
            ],
            [
                9118,
                9120
            ],
            [
                9120,
                9126
            ],
            [
                9132,
                9159
            ],
            [
                9166,
                9185
            ],
            [
                9190,
                9216
            ],
            [
                9217,
                9268
            ],
            [
                9270,
                9279
            ],
            [
                9299,
                9300
            ],
            [
                9302,
                9338
            ],
            [
                9338,
                9387
            ],
            [
                9388,
                9409
            ],
            [
                9417,
                9419
            ],
            [
                9433,
                9436
            ],
            [
                9437,
                9445
            ],
            [
                9451,
                9561
            ],
            [
                9562,
                9564
            ],
            [
                9565,
                9582
            ],
            [
                9582,
                9601
            ],
            [
                9602,
                9626
            ],
            [
                9627,
                9652
            ],
            [
                9652,
                9661
            ],
            [
                9661,
                9683
            ],
            [
                9683,
                9769
            ],
            [
                9769,
                9821
            ],
            [
                9821,
                9831
            ],
            [
                9841,
                9843
            ],
            [
                9843,
                9889
            ],
            [
                9890,
                9901
            ],
            [
                9907,
                9949
            ],
            [
                9949,
                9984
            ],
            [
                9984,
                9992
            ],
            [
                9992,
                10010
            ],
            [
                10010,
                10032
            ],
            [
                10032,
                10037
            ],
            [
                10037,
                10045
            ],
            [
                10045,
                10081
            ],
            [
                10081,
                10082
            ],
            [
                10092,
                10118
            ],
            [
                10118,
                10134
            ],
            [
                10134,
                10159
            ],
            [
                10159,
                10182
            ],
            [
                10182,
                10183
            ],
            [
                10183,
                10215
            ],
            [
                10215,
                10229
            ],
            [
                10229,
                10338
            ],
            [
                10338,
                10372
            ],
            [
                10373,
                10382
            ],
            [
                10382,
                10436
            ],
            [
                10437,
                10440
            ],
            [
                10441,
                10462
            ],
            [
                10463,
                10500
            ],
            [
                10500,
                10538
            ],
            [
                10539,
                10665
            ],
            [
                10665,
                10746
            ],
            [
                10746,
                10773
            ],
            [
                10773,
                10838
            ],
            [
                10838,
                10904
            ],
            [
                10904,
                10921
            ],
            [
                10921,
                10970
            ],
            [
                10971,
                10999
            ],
            [
                10999,
                11037
            ],
            [
                11038,
                11065
            ],
            [
                11065,
                11079
            ],
            [
                11082,
                11084
            ],
            [
                11084,
                11146
            ],
            [
                11146,
                11220
            ],
            [
                11221,
                11250
            ],
            [
                11250,
                11323
            ],
            [
                11323,
                11411
            ],
            [
                11411,
                11455
            ],
            [
                11456,
                11478
            ],
            [
                11488,
                11573
            ],
            [
                11573,
                11650
            ],
            [
                11650,
                11657
            ],
            [
                11657,
                11686
            ],
            [
                11701,
                11740
            ],
            [
                11740,
                11773
            ],
            [
                11773,
                11816
            ],
            [
                11825,
                11952
            ],
            [
                11952,
                11956
            ],
            [
                11957,
                11976
            ],
            [
                11977,
                12002
            ],
            [
                12002,
                12003
            ],
            [
                12004,
                12005
            ],
            [
                12005,
                12034
            ],
            [
                12034,
                12112
            ],
            [
                12112,
                12117
            ],
            [
                12118,
                12192
            ],
            [
                12192,
                12247
            ],
            [
                12247,
                12271
            ],
            [
                12271,
                12303
            ],
            [
                12306,
                12332
            ],
            [
                12333,
                12347
            ],
            [
                12347,
                12354
            ],
            [
                12355,
                12371
            ],
            [
                12376,
                12466
            ],
            [
                12466,
                12487
            ]
        ],
        "row_chars": [
            [
                0,
                65
            ],
            [
                65,
                158
            ],
            [
                158,
                242
            ],
            [
                242,
                396
            ],
            [
                396,
                470
            ],
            [
                470,
                619
            ],
            [
                619,
                711
            ],
            [
                711,
                831
            ],
            [
                831,
                921
            ],
            [
                921,
                1012
            ],
            [
                1012,
                1098
            ],
            [
                1098,
                1119
            ],
            [
                1119,
                1154
            ],
            [
                1154,
                1154
            ],
            [
                1154,
                1154
            ],
            [
                1154,
                1154
            ],
            [
                1154,
                1219
            ],
            [
                1219,
                1318
            ],
            [
                1318,
                1428
            ],
            [
                1428,
                1428
            ],
            [
                1428,
                1469
            ],
            [
                1469,
                1626
            ],
            [
                1626,
                1664
            ],
            [
                1664,
                1714
            ],
            [
                1714,
                1808
            ],
            [
                1808,
                1860
            ],
            [
                1860,
                1910
            ],
            [
                1910,
                1975
            ],
            [
                1975,
                1993
            ],
            [
                1993,
                2027
            ],
            [
                2027,
                2133
            ],
            [
                2133,
                2206
            ],
            [
                2206,
                2279
            ],
            [
                2279,
                2346
            ],
            [
                2346,
                2440
            ],
            [
                2440,
                2504
            ],
            [
                2504,
                2632
            ],
            [
                2632,
                2632
            ],
            [
                2632,
                2688
            ],
            [
                2688,
                2757
            ],
            [
                2757,
                2811
            ],
            [
                2811,
                2871
            ],
            [
                2871,
                2890
            ],
            [
                2890,
                2904
            ],
            [
                2904,
                2933
            ],
            [
                2933,
                3101
            ],
            [
                3101,
                3201
            ],
            [
                3201,
                3338
            ],
            [
                3338,
                3580
            ],
            [
                3580,
                3591
            ],
            [
                3591,
                3662
            ],
            [
                3662,
                3709
            ],
            [
                3709,
                3860
            ],
            [
                3860,
                3950
            ],
            [
                3950,
                4049
            ],
            [
                4049,
                4091
            ],
            [
                4091,
                4091
            ],
            [
                4091,
                4091
            ],
            [
                4091,
                4091
            ],
            [
                4091,
                4091
            ],
            [
                4091,
                4091
            ],
            [
                4091,
                4091
            ],
            [
                4091,
                4091
            ],
            [
                4091,
                4259
            ],
            [
                4259,
                4356
            ],
            [
                4356,
                4384
            ],
            [
                4384,
                4391
            ],
            [
                4391,
                4530
            ],
            [
                4530,
                4556
            ],
            [
                4556,
                4594
            ],
            [
                4594,
                4594
            ],
            [
                4594,
                4666
            ],
            [
                4666,
                4765
            ],
            [
                4765,
                4776
            ],
            [
                4776,
                4839
            ],
            [
                4839,
                4874
            ],
            [
                4874,
                4969
            ],
            [
                4969,
                5008
            ],
            [
                5008,
                5062
            ],
            [
                5062,
                5146
            ],
            [
                5146,
                5158
            ],
            [
                5158,
                5229
            ],
            [
                5229,
                5352
            ],
            [
                5352,
                5510
            ],
            [
                5510,
                5594
            ],
            [
                5594,
                5751
            ],
            [
                5751,
                5861
            ],
            [
                5861,
                5861
            ],
            [
                5861,
                5861
            ],
            [
                5861,
                5861
            ],
            [
                5861,
                5861
            ],
            [
                5861,
                5861
            ],
            [
                5861,
                5861
            ],
            [
                5861,
                6231
            ],
            [
                6231,
                6316
            ],
            [
                6316,
                6358
            ],
            [
                6358,
                6394
            ],
            [
                6394,
                6394
            ],
            [
                6394,
                6430
            ],
            [
                6430,
                6525
            ],
            [
                6525,
                6525
            ],
            [
                6525,
                6525
            ],
            [
                6525,
                6525
            ],
            [
                6525,
                6576
            ],
            [
                6576,
                6626
            ],
            [
                6626,
                6858
            ],
            [
                6858,
                7174
            ],
            [
                7174,
                7295
            ],
            [
                7295,
                7369
            ],
            [
                7369,
                7482
            ],
            [
                7482,
                7664
            ],
            [
                7664,
                7773
            ],
            [
                7773,
                7878
            ],
            [
                7878,
                7970
            ],
            [
                7970,
                7991
            ],
            [
                7991,
                8024
            ],
            [
                8024,
                8024
            ],
            [
                8024,
                8030
            ],
            [
                8030,
                8110
            ],
            [
                8110,
                8299
            ],
            [
                8299,
                8399
            ],
            [
                8399,
                8429
            ],
            [
                8429,
                8454
            ],
            [
                8454,
                8553
            ],
            [
                8553,
                8636
            ],
            [
                8636,
                8791
            ],
            [
                8791,
                8893
            ],
            [
                8893,
                8932
            ],
            [
                8932,
                9019
            ],
            [
                9019,
                9082
            ],
            [
                9082,
                9120
            ],
            [
                9120,
                9269
            ],
            [
                9269,
                9269
            ],
            [
                9269,
                9269
            ],
            [
                9269,
                9269
            ],
            [
                9269,
                9269
            ],
            [
                9269,
                9388
            ],
            [
                9388,
                9419
            ],
            [
                9419,
                9419
            ],
            [
                9419,
                9419
            ],
            [
                9419,
                9419
            ],
            [
                9419,
                9419
            ],
            [
                9419,
                9602
            ],
            [
                9602,
                9652
            ],
            [
                9652,
                9661
            ],
            [
                9661,
                9683
            ],
            [
                9683,
                9769
            ],
            [
                9769,
                9821
            ],
            [
                9821,
                9843
            ],
            [
                9843,
                9949
            ],
            [
                9949,
                9984
            ],
            [
                9984,
                9992
            ],
            [
                9992,
                10010
            ],
            [
                10010,
                10032
            ],
            [
                10032,
                10037
            ],
            [
                10037,
                10045
            ],
            [
                10045,
                10081
            ],
            [
                10081,
                10081
            ],
            [
                10081,
                10081
            ],
            [
                10081,
                10118
            ],
            [
                10118,
                10134
            ],
            [
                10134,
                10134
            ],
            [
                10134,
                10159
            ],
            [
                10159,
                10182
            ],
            [
                10182,
                10382
            ],
            [
                10382,
                10500
            ],
            [
                10500,
                10665
            ],
            [
                10665,
                10746
            ],
            [
                10746,
                10773
            ],
            [
                10773,
                10773
            ],
            [
                10773,
                10838
            ],
            [
                10838,
                10904
            ],
            [
                10904,
                10921
            ],
            [
                10921,
                10971
            ],
            [
                10971,
                10971
            ],
            [
                10971,
                10999
            ],
            [
                10999,
                11065
            ],
            [
                11065,
                11084
            ],
            [
                11084,
                11146
            ],
            [
                11146,
                11250
            ],
            [
                11250,
                11411
            ],
            [
                11411,
                11573
            ],
            [
                11573,
                11650
            ],
            [
                11650,
                11657
            ],
            [
                11657,
                11740
            ],
            [
                11740,
                11773
            ],
            [
                11773,
                11773
            ],
            [
                11773,
                11773
            ],
            [
                11773,
                11952
            ],
            [
                11952,
                11952
            ],
            [
                11952,
                12004
            ],
            [
                12004,
                12034
            ],
            [
                12034,
                12192
            ],
            [
                12192,
                12247
            ],
            [
                12247,
                12466
            ],
            [
                12466,
                12487
            ],
            [
                12487,
                12487
            ]
        ]
    }
}