{
    "original": {
        "text": "Soon after I had that conversation with my guardian, he put a sealed paper in my hand one morning and said, \"This is for next month, my dear.\" I found in it two hundred pounds.\nI now began very quietly to make such preparations as I thought were necessary. Regulating my purchases by my guardian's taste, which I knew very well of course, I arranged my wardrobe to please him and hoped I should be highly successful. I did it all so quietly because I was not quite free from my old apprehension that Ada would be rather sorry and because my guardian was so quiet himself. I had no doubt that under all the circumstances we should be married in the most private and simple manner. Perhaps I should only have to say to Ada, \"Would you like to come and see me married to-morrow, my pet?\" Perhaps our wedding might even be as unpretending as her own, and I might not find it necessary to say anything about it until it was over. I thought that if I were to choose, I would like this best.\nThe only exception I made was Mrs. Woodcourt. I told her that I was going to be married to my guardian and that we had been engaged some time. She highly approved. She could never do enough for me and was remarkably softened now in comparison with what she had been when we first knew her. There was no trouble she would not have taken to have been of use to me, but I need hardly say that I only allowed her to take as little as gratified her kindness without tasking it.\nOf course this was not a time to neglect my guardian, and of course it was not a time for neglecting my darling. So I had plenty of occupation, which I was glad of; and as to Charley, she was absolutely not to be seen for needlework. To surround herself with great heaps of it--baskets full and tables full--and do a little, and spend a great deal of time in staring with her round eyes at what there was to do, and persuade herself that she was going to do it, were Charley's great dignities and delights.\nMeanwhile, I must say, I could not agree with my guardian on the subject of the will, and I had some sanguine hopes of Jarndyce and Jarndyce. Which of us was right will soon appear, but I certainly did encourage expectations. In Richard, the discovery gave occasion for a burst of business and agitation that buoyed him up for a little time, but he had lost the elasticity even of hope now and seemed to me to retain only its feverish anxieties. From something my guardian said one day when we were talking about this, I understood that my marriage would not take place until after the term-time we had been told to look forward to; and I thought the more, for that, how rejoiced I should be if I could be married when Richard and Ada were a little more prosperous.\nThe term was very near indeed when my guardian was called out of town and went down into Yorkshire on Mr. Woodcourt's business. He had told me beforehand that his presence there would be necessary. I had just come in one night from my dear girl's and was sitting in the midst of all my new clothes, looking at them all around me and thinking, when a letter from my guardian was brought to me. It asked me to join him in the country and mentioned by what stage-coach my place was taken and at what time in the morning I should have to leave town. It added in a postscript that I would not be many hours from Ada.\nI expected few things less than a journey at that time, but I was ready for it in half an hour and set off as appointed early next morning. I travelled all day, wondering all day what I could be wanted for at such a distance; now I thought it might be for this purpose, and now I thought it might be for that purpose, but I was never, never, never near the truth.\nIt was night when I came to my journey's end and found my guardian waiting for me. This was a great relief, for towards evening I had begun to fear (the more so as his letter was a very short one) that he might be ill. However, there he was, as well as it was possible to be; and when I saw his genial face again at its brightest and best, I said to myself, he has been doing some other great kindness. Not that it required much penetration to say that, because I knew that his being there at all was an act of kindness.\nSupper was ready at the hotel, and when we were alone at table he said, \"Full of curiosity, no doubt, little woman, to know why I have brought you here?\"\n\"Well, guardian,\" said I, \"without thinking myself a Fatima or you a Blue Beard, I am a little curious about it.\"\n\"Then to ensure your night's rest, my love,\" he returned gaily, \"I won't wait until to-morrow to tell you. I have very much wished to express to Woodcourt, somehow, my sense of his humanity to poor unfortunate Jo, his inestimable services to my young cousins, and his value to us all. When it was decided that he should settle here, it came into my head that I might ask his acceptance of some unpretending and suitable little place to lay his own head in. I therefore caused such a place to be looked out for, and such a place was found on very easy terms, and I have been touching it up for him and making it habitable. However, when I walked over it the day before yesterday and it was reported ready, I found that I was not housekeeper enough to know whether things were all as they ought to be. So I sent off for the best little housekeeper that could possibly be got to come and give me her advice and opinion. And here she is,\" said my guardian, \"laughing and crying both together!\"\nBecause he was so dear, so good, so admirable. I tried to tell him what I thought of him, but I could not articulate a word.\n\"Tut, tut!\" said my guardian. \"You make too much of it, little woman. Why, how you sob, Dame Durden, how you sob!\"\n\"It is with exquisite pleasure, guardian--with a heart full of thanks.\"\n\"Well, well,\" said he. \"I am delighted that you approve. I thought you would. I meant it as a pleasant surprise for the little mistress of Bleak House.\"\nI kissed him and dried my eyes. \"I know now!\" said I. \"I have seen this in your face a long while.\"\n\"No; have you really, my dear?\" said he. \"What a Dame Durden it is to read a face!\"\nHe was so quaintly cheerful that I could not long be otherwise, and was almost ashamed of having been otherwise at all. When I went to bed, I cried. I am bound to confess that I cried; but I hope it was with pleasure, though I am not quite sure it was with pleasure. I repeated every word of the letter twice over.\nA most beautiful summer morning succeeded, and after breakfast we went out arm in arm to see the house of which I was to give my mighty housekeeping opinion. We entered a flower-garden by a gate in a side wall, of which he had the key, and the first thing I saw was that the beds and flowers were all laid out according to the manner of my beds and flowers at home.\n\"You see, my dear,\" observed my guardian, standing still with a delighted face to watch my looks, \"knowing there could be no better plan, I borrowed yours.\"\nWe went on by a pretty little orchard, where the cherries were nestling among the green leaves and the shadows of the apple-trees were sporting on the grass, to the house itself--a cottage, quite a rustic cottage of doll's rooms; but such a lovely place, so tranquil and so beautiful, with such a rich and smiling country spread around it; with water sparkling away into the distance, here all overhung with summer-growth, there turning a humming mill; at its nearest point glancing through a meadow by the cheerful town, where cricket-players were assembling in bright groups and a flag was flying from a white tent that rippled in the sweet west wind. And still, as we went through the pretty rooms, out at the little rustic verandah doors, and underneath the tiny wooden colonnades garlanded with woodbine, jasmine, and honey-suckle, I saw in the papering on the walls, in the colours of the furniture, in the arrangement of all the pretty objects, MY little tastes and fancies, MY little methods and inventions which they used to laugh at while they praised them, my odd ways everywhere.\nI could not say enough in admiration of what was all so beautiful, but one secret doubt arose in my mind when I saw this, I thought, oh, would he be the happier for it! Would it not have been better for his peace that I should not have been so brought before him? Because although I was not what he thought me, still he loved me very dearly, and it might remind him mournfully of what be believed he had lost. I did not wish him to forget me--perhaps he might not have done so, without these aids to his memory--but my way was easier than his, and I could have reconciled myself even to that so that he had been the happier for it.\n\"And now, little woman,\" said my guardian, whom I had never seen so proud and joyful as in showing me these things and watching my appreciation of them, \"now, last of all, for the name of this house.\"\n\"What is it called, dear guardian?\"\n\"My child,\" said he, \"come and see,\"\nHe took me to the porch, which he had hitherto avoided, and said, pausing before we went out, \"My dear child, don't you guess the name?\"\n\"No!\" said I.\nWe went out of the porch and he showed me written over it, Bleak House.\nHe led me to a seat among the leaves close by, and sitting down beside me and taking my hand in his, spoke to me thus, \"My darling girl, in what there has been between us, I have, I hope, been really solicitous for your happiness. When I wrote you the letter to which you brought the answer,\" smiling as he referred to it, \"I had my own too much in view; but I had yours too. Whether, under different circumstances, I might ever have renewed the old dream I sometimes dreamed when you were very young, of making you my wife one day, I need not ask myself. I did renew it, and I wrote my letter, and you brought your answer. You are following what I say, my child?\"\nI was cold, and I trembled violently, but not a word he uttered was lost. As I sat looking fixedly at him and the sun's rays descended, softly shining through the leaves upon his bare head, I felt as if the brightness on him must be like the brightness of the angels.\n\"Hear me, my love, but do not speak. It is for me to speak now. When it was that I began to doubt whether what I had done would really make you happy is no matter. Woodcourt came home, and I soon had no doubt at all.\"\nI clasped him round the neck and hung my head upon his breast and wept. \"Lie lightly, confidently here, my child,\" said he, pressing me gently to him. \"I am your guardian and your father now. Rest confidently here.\"\nSoothingly, like the gentle rustling of the leaves; and genially, like the ripening weather; and radiantly and beneficently, like the sunshine, he went on.\n\"Understand me, my dear girl. I had no doubt of your being contented and happy with me, being so dutiful and so devoted; but I saw with whom you would be happier. That I penetrated his secret when Dame Durden was blind to it is no wonder, for I knew the good that could never change in her better far than she did. Well! I have long been in Allan Woodcourt's confidence, although he was not, until yesterday, a few hours before you came here, in mine. But I would not have my Esther's bright example lost; I would not have a jot of my dear girl's virtues unobserved and unhonoured; I would not have her admitted on sufferance into the line of Morgan ap-Kerrig, no, not for the weight in gold of all the mountains in Wales!\"\nHe stopped to kiss me on the forehead, and I sobbed and wept afresh. For I felt as if I could not bear the painful delight of his praise.\n\"Hush, little woman! Don't cry; this is to be a day of joy. I have looked forward to it,\" he said exultingly, \"for months on months! A few words more, Dame Trot, and I have said my say. Determined not to throw away one atom of my Esther's worth, I took Mrs. Woodcourt into a separate confidence. 'Now, madam,' said I, 'I clearly perceive--and indeed I know, to boot--that your son loves my ward. I am further very sure that my ward loves your son, but will sacrifice her love to a sense of duty and affection, and will sacrifice it so completely, so entirely, so religiously, that you should never suspect it though you watched her night and day.' Then I told her all our story--ours--yours and mine. 'Now, madam,' said I, 'come you, knowing this, and live with us. Come you, and see my child from hour to hour; set what you see against her pedigree, which is this, and this'--for I scorned to mince it--'and tell me what is the true legitimacy when you shall have quite made up your mind on that subject.' Why, honour to her old Welsh blood, my dear,\" cried my guardian with enthusiasm, \"I believe the heart it animates beats no less warmly, no less admiringly, no less lovingly, towards Dame Durden than my own!\"\nHe tenderly raised my head, and as I clung to him, kissed me in his old fatherly way again and again. What a light, now, on the protecting manner I had thought about!\n\"One more last word. When Allan Woodcourt spoke to you, my dear, he spoke with my knowledge and consent--but I gave him no encouragement, not I, for these surprises were my great reward, and I was too miserly to part with a scrap of it. He was to come and tell me all that passed, and he did. I have no more to say. My dearest, Allan Woodcourt stood beside your father when he lay dead--stood beside your mother. This is Bleak House. This day I give this house its little mistress; and before God, it is the brightest day in all my life!\"\nHe rose and raised me with him. We were no longer alone. My husband--I have called him by that name full seven happy years now--stood at my side.\n\"Allan,\" said my guardian, \"take from me a willing gift, the best wife that ever man had. What more can I say for you than that I know you deserve her! Take with her the little home she brings you. You know what she will make it, Allan; you know what she has made its namesake. Let me share its felicity sometimes, and what do I sacrifice? Nothing, nothing.\"\nHe kissed me once again, and now the tears were in his eyes as he said more softly, \"Esther, my dearest, after so many years, there is a kind of parting in this too. I know that my mistake has caused you some distress. Forgive your old guardian, in restoring him to his old place in your affections; and blot it out of your memory. Allan, take my dear.\"\nHe moved away from under the green roof of leaves, and stopping in the sunlight outside and turning cheerfully towards us, said, \"I shall be found about here somewhere. It's a west wind, little woman, due west! Let no one thank me any more, for I am going to revert to my bachelor habits, and if anybody disregards this warning, I'll run away and never come back!\"\nWhat happiness was ours that day, what joy, what rest, what hope, what gratitude, what bliss! We were to be married before the month was out, but when we were to come and take possession of our own house was to depend on Richard and Ada.\nWe all three went home together next day. As soon as we arrived in town, Allan went straight to see Richard and to carry our joyful news to him and my darling. Late as it was, I meant to go to her for a few minutes before lying down to sleep, but I went home with my guardian first to make his tea for him and to occupy the old chair by his side, for I did not like to think of its being empty so soon.\nWhen we came home we found that a young man had called three times in the course of that one day to see me and that having been told on the occasion of his third call that I was not expected to return before ten o'clock at night, he had left word that he would call about then. He had left his card three times. Mr. Guppy.\nAs I naturally speculated on the object of these visits, and as I always associated something ludicrous with the visitor, it fell out that in laughing about Mr. Guppy I told my guardian of his old proposal and his subsequent retraction. \"After that,\" said my guardian, \"we will certainly receive this hero.\" So instructions were given that Mr. Guppy should be shown in when he came again, and they were scarcely given when he did come again.\nHe was embarrassed when he found my guardian with me, but recovered himself and said, \"How de do, sir?\"\n\"How do you do, sir?\" returned my guardian.\n\"Thank you, sir, I am tolerable,\" returned Mr. Guppy. \"Will you allow me to introduce my mother, Mrs. Guppy of the Old Street Road, and my particular friend, Mr. Weevle. That is to say, my friend has gone by the name of Weevle, but his name is really and truly Jobling.\"\nMy guardian begged them to be seated, and they all sat down.\n\"Tony,\" said Mr. Guppy to his friend after an awkward silence. \"Will you open the case?\"\n\"Do it yourself,\" returned the friend rather tartly.\n\"Well, Mr. Jarndyce, sir,\" Mr. Guppy, after a moment's consideration, began, to the great diversion of his mother, which she displayed by nudging Mr. Jobling with her elbow and winking at me in a most remarkable manner, \"I had an idea that I should see Miss Summerson by herself and was not quite prepared for your esteemed presence. But Miss Summerson has mentioned to you, perhaps, that something has passed between us on former occasions?\"\n\"Miss Summerson,\" returned my guardian, smiling, \"has made a communication to that effect to me.\"\n\"That,\" said Mr. Guppy, \"makes matters easier. Sir, I have come out of my articles at Kenge and Carboy's, and I believe with satisfaction to all parties. I am now admitted (after undergoing an examination that's enough to badger a man blue, touching a pack of nonsense that he don't want to know) on the roll of attorneys and have taken out my certificate, if it would be any satisfaction to you to see it.\"\n\"Thank you, Mr. Guppy,\" returned my guardian. \"I am quite willing--I believe I use a legal phrase--to admit the certificate.\"\nMr. Guppy therefore desisted from taking something out of his pocket and proceeded without it.\n\"I have no capital myself, but my mother has a little property which takes the form of an annuity\"--here Mr. Guppy's mother rolled her head as if she never could sufficiently enjoy the observation, and put her handkerchief to her mouth, and again winked at me--\"and a few pounds for expenses out of pocket in conducting business will never be wanting, free of interest, which is an advantage, you know,\" said Mr. Guppy feelingly.\n\"Certainly an advantage,\" returned my guardian.\n\"I HAVE some connexion,\" pursued Mr. Guppy, \"and it lays in the direction of Walcot Square, Lambeth. I have therefore taken a 'ouse in that locality, which, in the opinion of my friends, is a hollow bargain (taxes ridiculous, and use of fixtures included in the rent), and intend setting up professionally for myself there forthwith.\"\nHere Mr. Guppy's mother fell into an extraordinary passion of rolling her head and smiling waggishly at anybody who would look at her.\n\"It's a six-roomer, exclusive of kitchens,\" said Mr. Guppy, \"and in the opinion of my friends, a commodious tenement. When I mention my friends, I refer principally to my friend Jobling, who I believe has known me,\" Mr. Guppy looked at him with a sentimental air, \"from boyhood's hour.\"\nMr. Jobling confirmed this with a sliding movement of his legs.\n\"My friend Jobling will render me his assistance in the capacity of clerk and will live in the 'ouse,\" said Mr. Guppy. \"My mother will likewise live in the 'ouse when her present quarter in the Old Street Road shall have ceased and expired; and consequently there will be no want of society. My friend Jobling is naturally aristocratic by taste, and besides being acquainted with the movements of the upper circles, fully backs me in the intentions I am now developing.\"\nMr. Jobling said \"Certainly\" and withdrew a little from the elbow of Mr Guppy's mother.\n\"Now, I have no occasion to mention to you, sir, you being in the confidence of Miss Summerson,\" said Mr. Guppy, \"(mother, I wish you'd be so good as to keep still), that Miss Summerson's image was formerly imprinted on my 'eart and that I made her a proposal of marriage.\"\n\"That I have heard,\" returned my guardian.\n\"Circumstances,\" pursued Mr. Guppy, \"over which I had no control, but quite the contrary, weakened the impression of that image for a time. At which time Miss Summerson's conduct was highly genteel; I may even add, magnanimous.\"\nMy guardian patted me on the shoulder and seemed much amused.\n\"Now, sir,\" said Mr. Guppy, \"I have got into that state of mind myself that I wish for a reciprocity of magnanimous behaviour. I wish to prove to Miss Summerson that I can rise to a heighth of which perhaps she hardly thought me capable. I find that the image which I did suppose had been eradicated from my 'eart is NOT eradicated. Its influence over me is still tremenjous, and yielding to it, I am willing to overlook the circumstances over which none of us have had any control and to renew those proposals to Miss Summerson which I had the honour to make at a former period. I beg to lay the 'ouse in Walcot Square, the business, and myself before Miss Summerson for her acceptance.\"\n\"Very magnanimous indeed, sir,\" observed my guardian.\n\"Well, sir,\" replied Mr. Guppy with candour, \"my wish is to BE magnanimous. I do not consider that in making this offer to Miss Summerson I am by any means throwing myself away; neither is that the opinion of my friends. Still, there are circumstances which I submit may be taken into account as a set off against any little drawbacks of mine, and so a fair and equitable balance arrived at.\"\n\"I take upon myself, sir,\" said my guardian, laughing as he rang the bell, \"to reply to your proposals on behalf of Miss Summerson. She is very sensible of your handsome intentions, and wishes you good evening, and wishes you well.\"\n\"Oh!\" said Mr. Guppy with a blank look. \"Is that tantamount, sir, to acceptance, or rejection, or consideration?\"\n\"To decided rejection, if you please,\" returned my guardian.\nMr. Guppy looked incredulously at his friend, and at his mother, who suddenly turned very angry, and at the floor, and at the ceiling.\n\"Indeed?\" said he. \"Then, Jobling, if you was the friend you represent yourself, I should think you might hand my mother out of the gangway instead of allowing her to remain where she ain't wanted.\"\nBut Mrs. Guppy positively refused to come out of the gangway. She wouldn't hear of it. \"Why, get along with you,\" said she to my guardian, \"what do you mean? Ain't my son good enough for you? You ought to be ashamed of yourself. Get out with you!\"\n\"My good lady,\" returned my guardian, \"it is hardly reasonable to ask me to get out of my own room.\"\n\"I don't care for that,\" said Mrs. Guppy. \"Get out with you. If we ain't good enough for you, go and procure somebody that is good enough. Go along and find 'em.\"\nI was quite unprepared for the rapid manner in which Mrs. Guppy's power of jocularity merged into a power of taking the profoundest offence.\n\"Go along and find somebody that's good enough for you,\" repeated Mrs. Guppy. \"Get out!\" Nothing seemed to astonish Mr. Guppy's mother so much and to make her so very indignant as our not getting out. \"Why don't you get out?\" said Mrs. Guppy. \"What are you stopping here for?\"\n\"Mother,\" interposed her son, always getting before her and pushing her back with one shoulder as she sidled at my guardian, \"WILL you hold your tongue?\"\n\"No, William,\" she returned, \"I won't! Not unless he gets out, I won't!\"\nHowever, Mr. Guppy and Mr. Jobling together closed on Mr. Guppy's mother (who began to be quite abusive) and took her, very much against her will, downstairs, her voice rising a stair higher every time her figure got a stair lower, and insisting that we should immediately go and find somebody who was good enough for us, and above all things that we should get out.",
        "paragraph_chars": [
            [
                0,
                177
            ],
            [
                177,
                985
            ],
            [
                985,
                1458
            ],
            [
                1458,
                1965
            ],
            [
                1965,
                2731
            ],
            [
                2731,
                3343
            ],
            [
                3343,
                3707
            ],
            [
                3707,
                4228
            ],
            [
                4228,
                4382
            ],
            [
                4382,
                4496
            ],
            [
                4496,
                5486
            ],
            [
                5486,
                5611
            ],
            [
                5611,
                5726
            ],
            [
                5726,
                5798
            ],
            [
                5798,
                5951
            ],
            [
                5951,
                6051
            ],
            [
                6051,
                6135
            ],
            [
                6135,
                6450
            ],
            [
                6450,
                6816
            ],
            [
                6816,
                6973
            ],
            [
                6973,
                8065
            ],
            [
                8065,
                8697
            ],
            [
                8697,
                8898
            ],
            [
                8898,
                8934
            ],
            [
                8934,
                8971
            ],
            [
                8971,
                9108
            ],
            [
                9108,
                9122
            ],
            [
                9122,
                9194
            ],
            [
                9194,
                9859
            ],
            [
                9859,
                10127
            ],
            [
                10127,
                10345
            ],
            [
                10345,
                10561
            ],
            [
                10561,
                10717
            ],
            [
                10717,
                11441
            ],
            [
                11441,
                11579
            ],
            [
                11579,
                12794
            ],
            [
                12794,
                12961
            ],
            [
                12961,
                13500
            ],
            [
                13500,
                13646
            ],
            [
                13646,
                14005
            ],
            [
                14005,
                14359
            ],
            [
                14359,
                14724
            ],
            [
                14724,
                14962
            ],
            [
                14962,
                15365
            ],
            [
                15365,
                15688
            ],
            [
                15688,
                16130
            ],
            [
                16130,
                16234
            ],
            [
                16234,
                16278
            ],
            [
                16278,
                16549
            ],
            [
                16549,
                16610
            ],
            [
                16610,
                16699
            ],
            [
                16699,
                16752
            ],
            [
                16752,
                17195
            ],
            [
                17195,
                17293
            ],
            [
                17293,
                17701
            ],
            [
                17701,
                17827
            ],
            [
                17827,
                17922
            ],
            [
                17922,
                18352
            ],
            [
                18352,
                18400
            ],
            [
                18400,
                18735
            ],
            [
                18735,
                18870
            ],
            [
                18870,
                19157
            ],
            [
                19157,
                19221
            ],
            [
                19221,
                19692
            ],
            [
                19692,
                19780
            ],
            [
                19780,
                20054
            ],
            [
                20054,
                20097
            ],
            [
                20097,
                20326
            ],
            [
                20326,
                20388
            ],
            [
                20388,
                21077
            ],
            [
                21077,
                21131
            ],
            [
                21131,
                21524
            ],
            [
                21524,
                21757
            ],
            [
                21757,
                21871
            ],
            [
                21871,
                21932
            ],
            [
                21932,
                22067
            ],
            [
                22067,
                22266
            ],
            [
                22266,
                22514
            ],
            [
                22514,
                22615
            ],
            [
                22615,
                22778
            ],
            [
                22778,
                22919
            ],
            [
                22919,
                23196
            ],
            [
                23196,
                23350
            ],
            [
                23350,
                23423
            ],
            [
                23423,
                23789
            ]
        ],
        "segment_chars": [
            [
                0,
                143
            ],
            [
                143,
                177
            ],
            [
                177,
                257
            ],
            [
                257,
                417
            ],
            [
                417,
                572
            ],
            [
                572,
                680
            ],
            [
                680,
                785
            ],
            [
                785,
                925
            ],
            [
                925,
                985
            ],
            [
                985,
                1031
            ],
            [
                1031,
                1128
            ],
            [
                1128,
                1149
            ],
            [
                1149,
                1275
            ],
            [
                1275,
                1458
            ],
            [
                1458,
                1571
            ],
            [
                1571,
                1692
            ],
            [
                1692,
                1965
            ],
            [
                1965,
                2107
            ],
            [
                2107,
                2191
            ],
            [
                2191,
                2411
            ],
            [
                2411,
                2731
            ],
            [
                2731,
                2859
            ],
            [
                2859,
                2929
            ],
            [
                2929,
                3124
            ],
            [
                3124,
                3277
            ],
            [
                3277,
                3343
            ],
            [
                3343,
                3483
            ],
            [
                3483,
                3707
            ],
            [
                3707,
                3790
            ],
            [
                3790,
                3926
            ],
            [
                3926,
                4110
            ],
            [
                4110,
                4228
            ],
            [
                4228,
                4382
            ],
            [
                4382,
                4496
            ],
            [
                4496,
                4603
            ],
            [
                4603,
                4781
            ],
            [
                4781,
                4953
            ],
            [
                4953,
                5118
            ],
            [
                5118,
                5296
            ],
            [
                5296,
                5413
            ],
            [
                5413,
                5486
            ],
            [
                5486,
                5533
            ],
            [
                5533,
                5611
            ],
            [
                5611,
                5623
            ],
            [
                5623,
                5641
            ],
            [
                5641,
                5681
            ],
            [
                5681,
                5726
            ],
            [
                5726,
                5798
            ],
            [
                5798,
                5821
            ],
            [
                5821,
                5855
            ],
            [
                5855,
                5876
            ],
            [
                5876,
                5951
            ],
            [
                5951,
                5983
            ],
            [
                5983,
                5997
            ],
            [
                5997,
                6005
            ],
            [
                6005,
                6051
            ],
            [
                6051,
                6083
            ],
            [
                6083,
                6092
            ],
            [
                6092,
                6135
            ],
            [
                6135,
                6255
            ],
            [
                6255,
                6284
            ],
            [
                6284,
                6402
            ],
            [
                6402,
                6450
            ],
            [
                6450,
                6608
            ],
            [
                6608,
                6816
            ],
            [
                6816,
                6973
            ],
            [
                6973,
                7627
            ],
            [
                7627,
                8065
            ],
            [
                8065,
                8234
            ],
            [
                8234,
                8329
            ],
            [
                8329,
                8475
            ],
            [
                8475,
                8697
            ],
            [
                8697,
                8898
            ],
            [
                8898,
                8934
            ],
            [
                8934,
                8971
            ],
            [
                8971,
                9108
            ],
            [
                9108,
                9114
            ],
            [
                9114,
                9122
            ],
            [
                9122,
                9194
            ],
            [
                9194,
                9425
            ],
            [
                9425,
                9570
            ],
            [
                9570,
                9750
            ],
            [
                9750,
                9818
            ],
            [
                9818,
                9859
            ],
            [
                9859,
                9933
            ],
            [
                9933,
                10127
            ],
            [
                10127,
                10164
            ],
            [
                10164,
                10191
            ],
            [
                10191,
                10291
            ],
            [
                10291,
                10345
            ],
            [
                10345,
                10417
            ],
            [
                10417,
                10496
            ],
            [
                10496,
                10537
            ],
            [
                10537,
                10561
            ],
            [
                10561,
                10717
            ],
            [
                10717,
                10747
            ],
            [
                10747,
                10880
            ],
            [
                10880,
                11032
            ],
            [
                11032,
                11038
            ],
            [
                11038,
                11169
            ],
            [
                11169,
                11441
            ],
            [
                11441,
                11510
            ],
            [
                11510,
                11579
            ],
            [
                11579,
                11600
            ],
            [
                11600,
                11639
            ],
            [
                11639,
                11712
            ],
            [
                11712,
                11765
            ],
            [
                11765,
                11875
            ],
            [
                11875,
                11975
            ],
            [
                11975,
                12227
            ],
            [
                12227,
                12280
            ],
            [
                12280,
                12345
            ],
            [
                12345,
                12586
            ],
            [
                12586,
                12794
            ],
            [
                12794,
                12896
            ],
            [
                12896,
                12961
            ],
            [
                12961,
                12982
            ],
            [
                12982,
                13198
            ],
            [
                13198,
                13254
            ],
            [
                13254,
                13277
            ],
            [
                13277,
                13374
            ],
            [
                13374,
                13395
            ],
            [
                13395,
                13500
            ],
            [
                13500,
                13532
            ],
            [
                13532,
                13557
            ],
            [
                13557,
                13646
            ],
            [
                13646,
                13736
            ],
            [
                13736,
                13798
            ],
            [
                13798,
                13844
            ],
            [
                13844,
                13924
            ],
            [
                13924,
                13986
            ],
            [
                13986,
                14005
            ],
            [
                14005,
                14171
            ],
            [
                14171,
                14224
            ],
            [
                14224,
                14337
            ],
            [
                14337,
                14359
            ],
            [
                14359,
                14528
            ],
            [
                14528,
                14570
            ],
            [
                14570,
                14724
            ],
            [
                14724,
                14818
            ],
            [
                14818,
                14962
            ],
            [
                14962,
                15004
            ],
            [
                15004,
                15122
            ],
            [
                15122,
                15365
            ],
            [
                15365,
                15643
            ],
            [
                15643,
                15677
            ],
            [
                15677,
                15688
            ],
            [
                15688,
                15925
            ],
            [
                15925,
                15996
            ],
            [
                15996,
                16130
            ],
            [
                16130,
                16234
            ],
            [
                16234,
                16256
            ],
            [
                16256,
                16278
            ],
            [
                16278,
                16332
            ],
            [
                16332,
                16448
            ],
            [
                16448,
                16549
            ],
            [
                16549,
                16610
            ],
            [
                16610,
                16673
            ],
            [
                16673,
                16699
            ],
            [
                16699,
                16752
            ],
            [
                16752,
                17086
            ],
            [
                17086,
                17195
            ],
            [
                17195,
                17293
            ],
            [
                17293,
                17340
            ],
            [
                17340,
                17447
            ],
            [
                17447,
                17701
            ],
            [
                17701,
                17747
            ],
            [
                17747,
                17827
            ],
            [
                17827,
                17922
            ],
            [
                17922,
                18352
            ],
            [
                18352,
                18400
            ],
            [
                18400,
                18501
            ],
            [
                18501,
                18735
            ],
            [
                18735,
                18870
            ],
            [
                18870,
                18988
            ],
            [
                18988,
                19157
            ],
            [
                19157,
                19221
            ],
            [
                19221,
                19340
            ],
            [
                19340,
                19513
            ],
            [
                19513,
                19692
            ],
            [
                19692,
                19780
            ],
            [
                19780,
                20054
            ],
            [
                20054,
                20097
            ],
            [
                20097,
                20237
            ],
            [
                20237,
                20326
            ],
            [
                20326,
                20388
            ],
            [
                20388,
                20515
            ],
            [
                20515,
                20626
            ],
            [
                20626,
                20721
            ],
            [
                20721,
                20968
            ],
            [
                20968,
                21077
            ],
            [
                21077,
                21131
            ],
            [
                21131,
                21207
            ],
            [
                21207,
                21352
            ],
            [
                21352,
                21524
            ],
            [
                21524,
                21656
            ],
            [
                21656,
                21757
            ],
            [
                21757,
                21763
            ],
            [
                21763,
                21797
            ],
            [
                21797,
                21871
            ],
            [
                21871,
                21932
            ],
            [
                21932,
                22067
            ],
            [
                22067,
                22077
            ],
            [
                22077,
                22086
            ],
            [
                22086,
                22266
            ],
            [
                22266,
                22328
            ],
            [
                22328,
                22353
            ],
            [
                22353,
                22424
            ],
            [
                22424,
                22458
            ],
            [
                22458,
                22495
            ],
            [
                22495,
                22514
            ],
            [
                22514,
                22615
            ],
            [
                22615,
                22657
            ],
            [
                22657,
                22676
            ],
            [
                22676,
                22754
            ],
            [
                22754,
                22778
            ],
            [
                22778,
                22919
            ],
            [
                22919,
                22997
            ],
            [
                22997,
                23008
            ],
            [
                23008,
                23120
            ],
            [
                23120,
                23145
            ],
            [
                23145,
                23162
            ],
            [
                23162,
                23196
            ],
            [
                23196,
                23350
            ],
            [
                23350,
                23389
            ],
            [
                23389,
                23423
            ],
            [
                23423,
                23789
            ]
        ],
        "overlap_chars": [
            [
                0,
                10
            ],
            [
                17,
                143
            ],
            [
                143,
                177
            ],
            [
                177,
                188
            ],
            [
                194,
                209
            ],
            [
                246,
                255
            ],
            [
                215,
                227
            ],
            [
                303,
                304
            ],
            [
                350,
                371
            ],
            [
                284,
                303
            ],
            [
                415,
                417
            ],
            [
                417,
                425
            ],
            [
                430,
                572
            ],
            [
                572,
                591
            ],
            [
                620,
                680
            ],
            [
                680,
                764
            ],
            [
                774,
                785
            ],
            [
                785,
                792
            ],
            [
                851,
                925
            ],
            [
                925,
                985
            ],
            [
                985,
                1031
            ],
            [
                1031,
                1128
            ],
            [
                1128,
                1149
            ],
            [
                1149,
                1227
            ],
            [
                1251,
                1274
            ],
            [
                1458,
                1511
            ],
            [
                1559,
                1571
            ],
            [
                1571,
                1692
            ],
            [
                1692,
                1734
            ],
            [
                1766,
                1824
            ],
            [
                1845,
                1965
            ],
            [
                1965,
                1974
            ],
            [
                1986,
                2050
            ],
            [
                2055,
                2065
            ],
            [
                2075,
                2107
            ],
            [
                2107,
                2191
            ],
            [
                2191,
                2216
            ],
            [
                2274,
                2310
            ],
            [
                2346,
                2350
            ],
            [
                2359,
                2368
            ],
            [
                2391,
                2399
            ],
            [
                2255,
                2258
            ],
            [
                2409,
                2411
            ],
            [
                2411,
                2550
            ],
            [
                2551,
                2560
            ],
            [
                2596,
                2611
            ],
            [
                2632,
                2731
            ],
            [
                2731,
                2788
            ],
            [
                2820,
                2859
            ],
            [
                2859,
                2929
            ],
            [
                2929,
                3045
            ],
            [
                3060,
                3124
            ],
            [
                3124,
                3179
            ],
            [
                3185,
                3196
            ],
            [
                3248,
                3275
            ],
            [
                3233,
                3247
            ],
            [
                3275,
                3277
            ],
            [
                3277,
                3321
            ],
            [
                3333,
                3343
            ],
            [
                3343,
                3344
            ],
            [
                3345,
                3353
            ],
            [
                3375,
                3404
            ],
            [
                3442,
                3483
            ],
            [
                3483,
                3513
            ],
            [
                3522,
                3548
            ],
            [
                3567,
                3651
            ],
            [
                3659,
                3670
            ],
            [
                3685,
                3707
            ],
            [
                3707,
                3790
            ],
            [
                3790,
                3856
            ],
            [
                3868,
                3926
            ],
            [
                3926,
                3934
            ],
            [
                3987,
                4013
            ],
            [
                4020,
                4087
            ],
            [
                4094,
                4110
            ],
            [
                4110,
                4118
            ],
            [
                4191,
                4196
            ],
            [
                4204,
                4207
            ],
            [
                4155,
                4159
            ],
            [
                4226,
                4228
            ],
            [
                4228,
                4284
            ],
            [
                4285,
                4382
            ],
            [
                4382,
                4409
            ],
            [
                4463,
                4484
            ],
            [
                4493,
                4496
            ],
            [
                4496,
                4501
            ],
            [
                4529,
                4579
            ],
            [
                4590,
                4603
            ],
            [
                4603,
                4676
            ],
            [
                4726,
                4734
            ],
            [
                4756,
                4759
            ],
            [
                4764,
                4781
            ],
            [
                4781,
                4866
            ],
            [
                4885,
                4889
            ],
            [
                4907,
                4931
            ],
            [
                4951,
                4953
            ],
            [
                4953,
                4978
            ],
            [
                4985,
                4997
            ],
            [
                5002,
                5010
            ],
            [
                5024,
                5069
            ],
            [
                5097,
                5118
            ],
            [
                5118,
                5173
            ],
            [
                5199,
                5296
            ],
            [
                5296,
                5361
            ],
            [
                5381,
                5399
            ],
            [
                5411,
                5413
            ],
            [
                5413,
                5486
            ],
            [
                5486,
                5533
            ],
            [
                5533,
                5552
            ],
            [
                5574,
                5591
            ],
            [
                5603,
                5611
            ],
            [
                5611,
                5623
            ],
            [
                5623,
                5641
            ],
            [
                5641,
                5681
            ],
            [
                5681,
                5726
            ],
            [
                5726,
                5737
            ],
            [
                5748,
                5766
            ],
            [
                5768,
                5798
            ],
            [
                5798,
                5821
            ],
            [
                5821,
                5855
            ],
            [
                5876,
                5951
            ],
            [
                5951,
                5983
            ],
            [
                5983,
                5990
            ],
            [
                5994,
                5997
            ],
            [
                5997,
                6005
            ],
            [
                6005,
                6051
            ],
            [
                6255,
                6274
            ],
            [
                6284,
                6386
            ],
            [
                6400,
                6402
            ],
            [
                6402,
                6450
            ],
            [
                6497,
                6608
            ],
            [
                6608,
                6659
            ],
            [
                6684,
                6816
            ],
            [
                6816,
                6973
            ],
            [
                6973,
                7067
            ],
            [
                7129,
                7150
            ],
            [
                7096,
                7097
            ],
            [
                7169,
                7188
            ],
            [
                7196,
                7312
            ],
            [
                7068,
                7071
            ],
            [
                7464,
                7472
            ],
            [
                7476,
                7549
            ],
            [
                7625,
                7627
            ],
            [
                7638,
                7815
            ],
            [
                7925,
                7957
            ],
            [
                8044,
                8065
            ],
            [
                8065,
                8101
            ],
            [
                8130,
                8169
            ],
            [
                8187,
                8232
            ],
            [
                8329,
                8449
            ],
            [
                8453,
                8475
            ],
            [
                8475,
                8506
            ],
            [
                8577,
                8656
            ],
            [
                8665,
                8697
            ],
            [
                8697,
                8781
            ],
            [
                8848,
                8898
            ],
            [
                8898,
                8934
            ],
            [
                8934,
                8968
            ],
            [
                9151,
                9153
            ],
            [
                9137,
                9146
            ],
            [
                9147,
                9150
            ],
            [
                9154,
                9163
            ],
            [
                9164,
                9194
            ],
            [
                9194,
                9230
            ],
            [
                9245,
                9286
            ],
            [
                9239,
                9240
            ],
            [
                9293,
                9294
            ],
            [
                9311,
                9330
            ],
            [
                9366,
                9367
            ],
            [
                9405,
                9425
            ],
            [
                9425,
                9484
            ],
            [
                9515,
                9516
            ],
            [
                9518,
                9530
            ],
            [
                9531,
                9547
            ],
            [
                9577,
                9578
            ],
            [
                9610,
                9611
            ],
            [
                9662,
                9669
            ],
            [
                9696,
                9717
            ],
            [
                9547,
                9564
            ],
            [
                9565,
                9569
            ],
            [
                9818,
                9859
            ],
            [
                9859,
                9895
            ],
            [
                9931,
                9933
            ],
            [
                9933,
                9949
            ],
            [
                9958,
                9964
            ],
            [
                9969,
                9983
            ],
            [
                9993,
                10127
            ],
            [
                10127,
                10164
            ],
            [
                10191,
                10291
            ],
            [
                10291,
                10345
            ],
            [
                10345,
                10416
            ],
            [
                10417,
                10418
            ],
            [
                10431,
                10496
            ],
            [
                10496,
                10535
            ],
            [
                10561,
                10616
            ],
            [
                10658,
                10667
            ],
            [
                10684,
                10717
            ],
            [
                10717,
                10747
            ],
            [
                10747,
                10785
            ],
            [
                10796,
                10880
            ],
            [
                11032,
                11038
            ],
            [
                11038,
                11125
            ],
            [
                11160,
                11169
            ],
            [
                11169,
                11172
            ],
            [
                11223,
                11441
            ],
            [
                11441,
                11492
            ],
            [
                11502,
                11510
            ],
            [
                11510,
                11579
            ],
            [
                11579,
                11600
            ],
            [
                11600,
                11639
            ],
            [
                11639,
                11712
            ],
            [
                11712,
                11739
            ],
            [
                11763,
                11765
            ],
            [
                11765,
                11875
            ],
            [
                11875,
                11916
            ],
            [
                11946,
                11975
            ],
            [
                11975,
                11979
            ],
            [
                11988,
                12057
            ],
            [
                12069,
                12088
            ],
            [
                12111,
                12124
            ],
            [
                12089,
                12092
            ],
            [
                12142,
                12227
            ],
            [
                12227,
                12256
            ],
            [
                12278,
                12280
            ],
            [
                12280,
                12345
            ],
            [
                12345,
                12349
            ],
            [
                12355,
                12371
            ],
            [
                12389,
                12443
            ],
            [
                12453,
                12454
            ],
            [
                12456,
                12478
            ],
            [
                12483,
                12523
            ],
            [
                12583,
                12586
            ],
            [
                12586,
                12668
            ],
            [
                12682,
                12687
            ],
            [
                12700,
                12718
            ],
            [
                12738,
                12794
            ],
            [
                12794,
                12884
            ],
            [
                12894,
                12895
            ],
            [
                12961,
                12982
            ],
            [
                12982,
                13064
            ],
            [
                13066,
                13097
            ],
            [
                13196,
                13198
            ],
            [
                13198,
                13254
            ],
            [
                13254,
                13277
            ],
            [
                13277,
                13346
            ],
            [
                13348,
                13374
            ],
            [
                13374,
                13395
            ],
            [
                13395,
                13500
            ],
            [
                13500,
                13532
            ],
            [
                13532,
                13557
            ],
            [
                13557,
                13567
            ],
            [
                13569,
                13599
            ],
            [
                13605,
                13626
            ],
            [
                13628,
                13646
            ],
            [
                13646,
                13736
            ],
            [
                13774,
                13798
            ],
            [
                13798,
                13844
            ],
            [
                13844,
                13924
            ],
            [
                13924,
                13940
            ],
            [
                13950,
                13986
            ],
            [
                13986,
                14005
            ],
            [
                14005,
                14109
            ],
            [
                14171,
                14224
            ],
            [
                14224,
                14303
            ],
            [
                14335,
                14337
            ],
            [
                14337,
                14359
            ],
            [
                14359,
                14446
            ],
            [
                14482,
                14486
            ],
            [
                14459,
                14469
            ],
            [
                14486,
                14528
            ],
            [
                14528,
                14558
            ],
            [
                14568,
                14570
            ],
            [
                14570,
                14724
            ],
            [
                14724,
                14762
            ],
            [
                14795,
                14818
            ],
            [
                14818,
                14894
            ],
            [
                14914,
                14962
            ],
            [
                14962,
                15004
            ],
            [
                15004,
                15122
            ],
            [
                15122,
                15176
            ],
            [
                15203,
                15365
            ],
            [
                15585,
                15587
            ],
            [
                15378,
                15453
            ],
            [
                15458,
                15471
            ],
            [
                15593,
                15594
            ],
            [
                15472,
                15475
            ],
            [
                15598,
                15630
            ],
            [
                15476,
                15480
            ],
            [
                15641,
                15643
            ],
            [
                15643,
                15677
            ],
            [
                15677,
                15688
            ],
            [
                15688,
                15744
            ],
            [
                15855,
                15876
            ],
            [
                15845,
                15854
            ],
            [
                15881,
                15924
            ],
            [
                15925,
                15996
            ],
            [
                15996,
                15998
            ],
            [
                16057,
                16061
            ],
            [
                16028,
                16037
            ],
            [
                16065,
                16076
            ],
            [
                16062,
                16064
            ],
            [
                16048,
                16056
            ],
            [
                16128,
                16130
            ],
            [
                16130,
                16234
            ],
            [
                16234,
                16256
            ],
            [
                16256,
                16278
            ],
            [
                16278,
                16332
            ],
            [
                16332,
                16385
            ],
            [
                16408,
                16446
            ],
            [
                16504,
                16505
            ],
            [
                16448,
                16463
            ],
            [
                16539,
                16549
            ],
            [
                16549,
                16610
            ],
            [
                16610,
                16673
            ],
            [
                16673,
                16699
            ],
            [
                16699,
                16752
            ],
            [
                16752,
                16788
            ],
            [
                16822,
                16828
            ],
            [
                16855,
                16865
            ],
            [
                16890,
                16893
            ],
            [
                16898,
                16928
            ],
            [
                16937,
                17030
            ],
            [
                17084,
                17086
            ],
            [
                17086,
                17195
            ],
            [
                17195,
                17196
            ],
            [
                17245,
                17248
            ],
            [
                17210,
                17242
            ],
            [
                17293,
                17340
            ],
            [
                17340,
                17404
            ],
            [
                17449,
                17464
            ],
            [
                17590,
                17648
            ],
            [
                17445,
                17446
            ],
            [
                17923,
                17968
            ],
            [
                18012,
                18020
            ],
            [
                18022,
                18026
            ],
            [
                18039,
                18061
            ],
            [
                18159,
                18181
            ],
            [
                18183,
                18187
            ],
            [
                18401,
                18407
            ],
            [
                18518,
                18534
            ],
            [
                17997,
                18000
            ],
            [
                18540,
                18548
            ],
            [
                18006,
                18008
            ],
            [
                18492,
                18499
            ],
            [
                18118,
                18119
            ],
            [
                18669,
                18735
            ],
            [
                18735,
                18758
            ],
            [
                18818,
                18870
            ],
            [
                18870,
                18988
            ],
            [
                19222,
                19244
            ],
            [
                19252,
                19254
            ],
            [
                19270,
                19321
            ],
            [
                19338,
                19340
            ],
            [
                19341,
                19350
            ],
            [
                19460,
                19513
            ],
            [
                19513,
                19570
            ],
            [
                19637,
                19692
            ],
            [
                19692,
                19719
            ],
            [
                19721,
                19747
            ],
            [
                19761,
                19762
            ],
            [
                19764,
                19771
            ],
            [
                19752,
                19757
            ],
            [
                19778,
                19780
            ],
            [
                19780,
                19785
            ],
            [
                19819,
                19822
            ],
            [
                19822,
                19827
            ],
            [
                19874,
                19892
            ],
            [
                19946,
                20054
            ],
            [
                20054,
                20097
            ],
            [
                20097,
                20111
            ],
            [
                20134,
                20161
            ],
            [
                20187,
                20237
            ],
            [
                20237,
                20294
            ],
            [
                20323,
                20326
            ],
            [
                20326,
                20388
            ],
            [
                20388,
                20418
            ],
            [
                20517,
                20569
            ],
            [
                20578,
                20626
            ],
            [
                20626,
                20655
            ],
            [
                20668,
                20721
            ],
            [
                20777,
                20882
            ],
            [
                20889,
                20916
            ],
            [
                21524,
                21656
            ],
            [
                21656,
                21757
            ],
            [
                21757,
                21763
            ],
            [
                21763,
                21797
            ],
            [
                21797,
                21805
            ],
            [
                21826,
                21871
            ],
            [
                21871,
                21872
            ],
            [
                21892,
                21932
            ],
            [
                21932,
                22027
            ],
            [
                22065,
                22067
            ],
            [
                22353,
                22424
            ],
            [
                22424,
                22458
            ],
            [
                22495,
                22514
            ],
            [
                22514,
                22615
            ],
            [
                22615,
                22657
            ],
            [
                22657,
                22676
            ],
            [
                22676,
                22715
            ],
            [
                22724,
                22740
            ],
            [
                22778,
                22843
            ],
            [
                22853,
                22863
            ],
            [
                22917,
                22919
            ],
            [
                23120,
                23145
            ],
            [
                23145,
                23149
            ],
            [
                23160,
                23162
            ],
            [
                23162,
                23196
            ],
            [
                23196,
                23224
            ],
            [
                23319,
                23350
            ],
            [
                23350,
                23362
            ],
            [
                23377,
                23378
            ],
            [
                23380,
                23387
            ],
            [
                23423,
                23476
            ],
            [
                23625,
                23628
            ],
            [
                23528,
                23598
            ],
            [
                23636,
                23639
            ],
            [
                23648,
                23695
            ],
            [
                23781,
                23789
            ]
        ],
        "row_chars": [
            [
                0,
                143
            ],
            [
                143,
                177
            ],
            [
                177,
                417
            ],
            [
                417,
                572
            ],
            [
                572,
                680
            ],
            [
                680,
                785
            ],
            [
                785,
                925
            ],
            [
                925,
                985
            ],
            [
                985,
                1031
            ],
            [
                1031,
                1128
            ],
            [
                1128,
                1149
            ],
            [
                1149,
                1275
            ],
            [
                1275,
                1458
            ],
            [
                1458,
                1571
            ],
            [
                1571,
                1692
            ],
            [
                1692,
                1965
            ],
            [
                1965,
                2107
            ],
            [
                2107,
                2191
            ],
            [
                2191,
                2411
            ],
            [
                2411,
                2731
            ],
            [
                2731,
                2859
            ],
            [
                2859,
                2929
            ],
            [
                2929,
                3124
            ],
            [
                3124,
                3277
            ],
            [
                3277,
                3343
            ],
            [
                3343,
                3483
            ],
            [
                3483,
                3707
            ],
            [
                3707,
                3790
            ],
            [
                3790,
                3926
            ],
            [
                3926,
                4110
            ],
            [
                4110,
                4228
            ],
            [
                4228,
                4382
            ],
            [
                4382,
                4496
            ],
            [
                4496,
                4603
            ],
            [
                4603,
                4781
            ],
            [
                4781,
                4953
            ],
            [
                4953,
                5118
            ],
            [
                5118,
                5296
            ],
            [
                5296,
                5413
            ],
            [
                5413,
                5486
            ],
            [
                5486,
                5533
            ],
            [
                5533,
                5611
            ],
            [
                5611,
                5623
            ],
            [
                5623,
                5641
            ],
            [
                5641,
                5681
            ],
            [
                5681,
                5726
            ],
            [
                5726,
                5798
            ],
            [
                5798,
                5821
            ],
            [
                5821,
                5855
            ],
            [
                5855,
                5876
            ],
            [
                5876,
                5951
            ],
            [
                5951,
                5983
            ],
            [
                5983,
                5997
            ],
            [
                5997,
                6005
            ],
            [
                6005,
                6051
            ],
            [
                6051,
                6083
            ],
            [
                6083,
                6092
            ],
            [
                6092,
                6135
            ],
            [
                6135,
                6255
            ],
            [
                6255,
                6402
            ],
            [
                6402,
                6450
            ],
            [
                6450,
                6608
            ],
            [
                6608,
                6816
            ],
            [
                6816,
                6973
            ],
            [
                6973,
                7627
            ],
            [
                7627,
                8065
            ],
            [
                8065,
                8234
            ],
            [
                8234,
                8329
            ],
            [
                8329,
                8475
            ],
            [
                8475,
                8697
            ],
            [
                8697,
                8898
            ],
            [
                8898,
                8934
            ],
            [
                8934,
                8971
            ],
            [
                8971,
                9108
            ],
            [
                9108,
                9114
            ],
            [
                9114,
                9122
            ],
            [
                9122,
                9194
            ],
            [
                9194,
                9425
            ],
            [
                9425,
                9818
            ],
            [
                9818,
                9859
            ],
            [
                9859,
                9933
            ],
            [
                9933,
                10127
            ],
            [
                10127,
                10164
            ],
            [
                10164,
                10191
            ],
            [
                10191,
                10291
            ],
            [
                10291,
                10345
            ],
            [
                10345,
                10417
            ],
            [
                10417,
                10496
            ],
            [
                10496,
                10537
            ],
            [
                10537,
                10561
            ],
            [
                10561,
                10717
            ],
            [
                10717,
                10747
            ],
            [
                10747,
                10880
            ],
            [
                10880,
                11032
            ],
            [
                11032,
                11038
            ],
            [
                11038,
                11169
            ],
            [
                11169,
                11441
            ],
            [
                11441,
                11510
            ],
            [
                11510,
                11579
            ],
            [
                11579,
                11600
            ],
            [
                11600,
                11639
            ],
            [
                11639,
                11712
            ],
            [
                11712,
                11765
            ],
            [
                11765,
                11875
            ],
            [
                11875,
                11975
            ],
            [
                11975,
                12227
            ],
            [
                12227,
                12280
            ],
            [
                12280,
                12345
            ],
            [
                12345,
                12586
            ],
            [
                12586,
                12794
            ],
            [
                12794,
                12896
            ],
            [
                12896,
                12961
            ],
            [
                12961,
                12982
            ],
            [
                12982,
                13198
            ],
            [
                13198,
                13254
            ],
            [
                13254,
                13277
            ],
            [
                13277,
                13374
            ],
            [
                13374,
                13395
            ],
            [
                13395,
                13500
            ],
            [
                13500,
                13532
            ],
            [
                13532,
                13557
            ],
            [
                13557,
                13646
            ],
            [
                13646,
                13736
            ],
            [
                13736,
                13798
            ],
            [
                13798,
                13844
            ],
            [
                13844,
                13924
            ],
            [
                13924,
                13986
            ],
            [
                13986,
                14005
            ],
            [
                14005,
                14224
            ],
            [
                14224,
                14337
            ],
            [
                14337,
                14359
            ],
            [
                14359,
                14528
            ],
            [
                14528,
                14570
            ],
            [
                14570,
                14724
            ],
            [
                14724,
                14818
            ],
            [
                14818,
                14962
            ],
            [
                14962,
                15004
            ],
            [
                15004,
                15122
            ],
            [
                15122,
                15365
            ],
            [
                15365,
                15643
            ],
            [
                15643,
                15677
            ],
            [
                15677,
                15688
            ],
            [
                15688,
                15925
            ],
            [
                15925,
                15996
            ],
            [
                15996,
                16130
            ],
            [
                16130,
                16234
            ],
            [
                16234,
                16256
            ],
            [
                16256,
                16278
            ],
            [
                16278,
                16332
            ],
            [
                16332,
                16549
            ],
            [
                16549,
                16610
            ],
            [
                16610,
                16673
            ],
            [
                16673,
                16699
            ],
            [
                16699,
                16752
            ],
            [
                16752,
                17086
            ],
            [
                17086,
                17195
            ],
            [
                17195,
                17293
            ],
            [
                17293,
                17340
            ],
            [
                17340,
                17701
            ],
            [
                17701,
                17747
            ],
            [
                17747,
                17827
            ],
            [
                17827,
                17922
            ],
            [
                17922,
                18735
            ],
            [
                18735,
                18870
            ],
            [
                18870,
                18988
            ],
            [
                18988,
                19157
            ],
            [
                19157,
                19221
            ],
            [
                19221,
                19340
            ],
            [
                19340,
                19513
            ],
            [
                19513,
                19692
            ],
            [
                19692,
                19780
            ],
            [
                19780,
                20054
            ],
            [
                20054,
                20097
            ],
            [
                20097,
                20237
            ],
            [
                20237,
                20326
            ],
            [
                20326,
                20388
            ],
            [
                20388,
                20626
            ],
            [
                20626,
                20721
            ],
            [
                20721,
                20968
            ],
            [
                20968,
                21077
            ],
            [
                21077,
                21131
            ],
            [
                21131,
                21207
            ],
            [
                21207,
                21352
            ],
            [
                21352,
                21524
            ],
            [
                21524,
                21656
            ],
            [
                21656,
                21757
            ],
            [
                21757,
                21763
            ],
            [
                21763,
                21797
            ],
            [
                21797,
                21871
            ],
            [
                21871,
                21932
            ],
            [
                21932,
                22067
            ],
            [
                22067,
                22077
            ],
            [
                22077,
                22086
            ],
            [
                22086,
                22266
            ],
            [
                22266,
                22328
            ],
            [
                22328,
                22353
            ],
            [
                22353,
                22424
            ],
            [
                22424,
                22458
            ],
            [
                22458,
                22495
            ],
            [
                22495,
                22514
            ],
            [
                22514,
                22615
            ],
            [
                22615,
                22657
            ],
            [
                22657,
                22676
            ],
            [
                22676,
                22754
            ],
            [
                22754,
                22778
            ],
            [
                22778,
                22919
            ],
            [
                22919,
                22997
            ],
            [
                22997,
                23008
            ],
            [
                23008,
                23120
            ],
            [
                23120,
                23145
            ],
            [
                23145,
                23162
            ],
            [
                23162,
                23196
            ],
            [
                23196,
                23350
            ],
            [
                23350,
                23389
            ],
            [
                23389,
                23423
            ],
            [
                23423,
                23789
            ]
        ]
    },
    "abridged": {
        "text": "Soon after that conversation with my guardian, he put a sealed paper in my hand one morning and said, \"This is for next month, my dear.\" I found in it two hundred pounds.\nI now began quietly to make necessary preparations, arranging my wardrobe to please my guardian's taste. I did it so quietly because I was not quite free from my old apprehension that Ada would be rather sorry and because my guardian was so quiet himself. I had no doubt that we should be married in the most private and simple manner. Perhaps I should only have to say to Ada, \"Would you like to come and see me married tomorrow, my pet?\" Perhaps I might not find it necessary to say anything about it until it was over. I thought that if I were to choose, I would like this best.\nThe only exception I made was Mrs. Woodcourt. I told her that I was going to be married to my guardian and that we had been engaged some time. She highly approved. She could never do enough for me and was remarkably softened now in comparison to when we first knew her.\nOf course this was not a time to neglect my guardian, nor my darling. So I had plenty of occupation, which I was glad of; and as to Charley, she was absolutely not to be seen for needlework. To surround herself with great heaps of it, and do a little, and spend a great deal of time in staring at what there was to do, and persuade herself that she was going to do it, were Charley's great dignities and delights.\nMeanwhile, I could not agree with my guardian on the subject of the will, for I had some hopes of Jarndyce and Jarndyce. Which of us was right will soon appear, but I certainly did encourage expectations. In Richard, the discovery buoyed him up for a little time, but hope seemed to make him feverish and anxious. From something my guardian said one day when we were talking about this, I understood that my marriage would not take place until after the Chancery term-time; and I thought how rejoiced I should be if I could be married when Richard and Ada were a little more prosperous.\nThe term was very near indeed when my guardian was called up to Yorkshire on Mr. Woodcourt's business. He had told me beforehand that his presence there would be necessary. I had just come in one night from my dear girl's and was sitting in the midst of all my new clothes, looking at them and thinking, when a letter from my guardian was brought to me. It asked me to join him in the country and mentioned by which stage-coach I should have to leave town in the morning. It added in a postscript that I would not be long away from Ada.\nI had not expected a journey at that time, but I set off as appointed early next morning. I travelled all day, wondering what I could be wanted for; now I thought it might be for this purpose, and now I thought it might be for that, but I was never near the truth.\nIt was night when I came to my journey's end and found my guardian waiting for me. This was a great relief, for towards evening I had begun to fear (as his letter was a very short one) that he might be ill. However, when I saw his genial face at its brightest and best, I said to myself, he has been doing some great kindness. Not that there was anything unusual in that.\nSupper was ready at the hotel, and when we were alone at the table he said, \"Full of curiosity, no doubt, little woman, to know why I have brought you here?\"\n\"Well, guardian,\" said I, \"I am a little curious.\"\n\"Then, my love,\" he returned gaily, \"I won't wait until tomorrow to tell you. I have very much wished to express to Woodcourt, somehow, my sense of his services and value to us all. When it was decided that he should settle here, it came into my head that I might ask him to accept some suitable little place to live. I therefore caused such a house to be looked for, and one was found on very easy terms, and I have been making it habitable. However, when I walked over it the day before yesterday, I found that I was not housekeeper enough to know whether things were all as they ought to be. So I sent off for the best little housekeeper that could possibly give me her advice. And here she is,\" said my guardian, \"laughing and crying both together!\"\nBecause he was so dear, so good, so admirable. I tried to tell him this, but I could not say a word.\n\"Tut, tut!\" said my guardian. \"You make too much of it, little woman. Why, how you sob, Dame Durden, how you sob!\"\n\"It is with pleasure, guardian - with a heart full of thanks.\"\n\"Well, well,\" said he. \"I am delighted that you approve. I meant it as a pleasant surprise for the little mistress of Bleak House.\"\nI kissed him and dried my eyes. \"I know!\" said I. \"I have seen this in your face a long while.\"\nWhen I went to bed, I am bound to confess that I cried; but I hope it was with pleasure, though I am not quite sure it was. I repeated every word of the letter twice over.\nAfter breakfast we went out arm in arm to see the house of which I was to give my mighty housekeeping opinion. We entered a flower-garden by a gate in a side wall, and the first thing I saw was that the beds and flowers were all laid out according to the manner of my beds and flowers at home.\n\"You see, my dear,\" observed my guardian, standing still with a delighted face to watch my looks, \"knowing there could be no better plan, I borrowed yours.\"\nWe went on by a pretty little orchard, where the cherries were nestling among the green leaves, to the house itself - a rustic cottage of small rooms; but such a lovely place, so tranquil and so beautiful, with such a rich and smiling country spread around it; and across a meadow the cheerful town, where cricket-players were assembling in bright groups. As we went through the pretty rooms, out at the little rustic verandah doors, and underneath the tiny wooden colonnades garlanded with woodbine, jasmine, and honey-suckle, I saw my little tastes and fancies, my odd ways everywhere.\nI could not say enough in admiration, but one secret doubt arose in my mind. I thought, oh, would he be the happier for it? Because although I was not what he thought me, still he loved me very dearly, and it might remind him mournfully of what he believed he had lost. I did not wish him to forget me - but my way was easier than his, and I could have reconciled myself even to that if he had been the happier for it.\n\"And now, little woman,\" said my guardian, whom I had never seen so proud and joyful, \"now, last of all, for the name of this house.\"\n\"What is it called, dear guardian?\"\n\"My child,\" said he, \"come and see.\"\nHe took me to the porch, and showed me, written over it, Bleak House.\nHe led me to a seat among the leaves. Sitting down beside me and taking my hand, he said, smiling, \"My darling girl, I wish for your happiness. When I wrote you the letter to which you brought the answer, I had my own happiness too much in view, for I had dreamed of making you my wife; but I had yours in view too. You are following what I say, my child?\"\nI was cold, and I trembled violently. As I sat looking at him in the sun's rays, softly shining through the leaves upon his bare head, I felt as if the brightness on him must be like the brightness of the angels.\n\"Hear me, my love, but do not speak. When it was that I began to doubt whether what I had done would really make you happy is no matter. Woodcourt came home, and I soon had no doubt at all.\"\nI clasped him round the neck and hung my head upon his breast and wept.\n\"Rest confidently here, my child,\" said he, pressing me gently to him. \"I am your guardian and your father now.\"\nSoothingly, like the gentle rustling of the leaves; and radiantly, like the sunshine, he went on.\n\"Understand me, my dear girl. I had no doubt of your being contented with me, being so dutiful and so devoted; but I saw with whom you would be happier. Well! I have long been in Allan Woodcourt's confidence, although he was not, until yesterday, in mine. But I would not have a jot of my dear girl's virtues unobserved and unhonoured; I would not have her admitted on sufferance into the line of Morgan ap-Kerrig, no, not for the weight in gold of all the mountains in Wales!\"\nHe stopped to kiss me on the forehead, and I sobbed afresh. For I felt as if I could not bear the painful delight of his praise.\n\"Hush, little woman! Don't cry; this is to be a day of joy. I have looked forward to it,\" he said exultingly, \"for months on months! A few words more, Dame Trot. Determined not to throw away one atom of my Esther's worth, I took Mrs. Woodcourt into a separate confidence. 'Now, madam,' said I, 'I clearly perceive that your son loves my ward. I am very sure that my ward loves your son, but will sacrifice her love to duty and affection, so completely and religiously, that you should never suspect it though you watched her night and day.' Then I told her all our story. 'Now, madam,' said I, 'come you, knowing this, and live with us. Come and see my child; set what you see against her pedigree, which is this' - for I scorned to mince words - 'and tell me what is the true legitimacy.' Why, honour to her old Welsh blood, my dear,\" cried my guardian with enthusiasm, \"her heart beats no less warmly, no less lovingly, towards Dame Durden than my own!\"\nHe tenderly raised my head, and as I clung to him, kissed me in his old fatherly way again.\n\"One more last word. When Allan Woodcourt spoke to you, my dear, he spoke with my knowledge and consent - but I gave him no encouragement. He was to come and tell me all that passed, and he did. I have no more to say. My dearest, Allan Woodcourt stood beside your father when he lay dead - stood beside your mother. This is Bleak House. This day I give this house its little mistress; and before God, it is the brightest day in all my life!\"\nHe rose and raised me with him. We were no longer alone. My husband - I have called him by that name seven happy years now - stood at my side.\n\"Allan,\" said my guardian, \"take from me a willing gift, the best wife that ever man had. I know you deserve her! Take with her the little home she brings you. You know what she will make it, Allan; you know what she has made its namesake. Let me share its happiness sometimes, and what do I sacrifice? Nothing, nothing.\"\nHe kissed me once again, and now the tears were in his eyes as he said more softly, \"Esther, my dearest, I know that my mistake has caused you some distress. Forgive your old guardian, in restoring him to his old place in your affections. Allan, take my dear.\"\nHe moved away from under the green roof of leaves, and stopping in the sunlight outside said cheerfully, \"I shall be found about here somewhere. It's a west wind, little woman! Let no one thank me any more, for I am going to revert to my bachelor habits, and if anybody disregards this warning, I'll run away and never come back!\"\nWhat happiness was ours that day, what gratitude, what bliss! We were to be married before the month was out, but when we were to come and live in our own house was to depend on Richard and Ada.\nWe all three went home together next day. As soon as we arrived in town, Allan went straight to see Richard and to carry our joyful news to him and my darling. Late as it was, I meant to go to her for a few minutes, but I went home with my guardian first to make his tea for him and to occupy the old chair by his side, for I did not like to think of its being empty so soon.\nAt home we found that a young man had called three times in the course of that day to see me, and had left word that he would call again that evening. He had left his card three times. Mr. Guppy.\nAs I naturally speculated on the object of these visits, I told my guardian of Mr. Guppy's old proposal and his subsequent retraction.\n\"After that,\" said my guardian, \"we will certainly receive this hero.\" So when Mr. Guppy came again, he was shown in.\nHe was embarrassed when he found my guardian with me, but recovered himself and said, \"How de do, sir?\"\n\"How do you do, sir?\" returned my guardian.\n\"Thank you, sir, I am tolerable,\" returned Mr. Guppy. \"Will you allow me to introduce my mother, Mrs. Guppy, and my particular friend, Mr. Weevle, that is to say, Jobling.\"\nMy guardian begged them to be seated, and they all sat down.\n\"Tony,\" said Mr. Guppy to his friend after an awkward silence. \"Will you open the case?\"\n\"Do it yourself,\" returned the friend rather tartly.\n\"Well, Mr. Jarndyce, sir,\" Mr. Guppy began, while his mother nudged Mr. Jobling with her elbow and winked at me in a most remarkable manner, \"I had an idea that I should see Miss Summerson by herself. But Miss Summerson has mentioned to you, perhaps, that something has passed between us on former occasions?\"\n\"She has,\" returned my guardian, smiling.\n\"That,\" said Mr. Guppy, \"makes matters easier. Sir, I have come out of my articles at Kenge and Carboy's, and I am now admitted on the roll of attorneys and have taken out my certificate. I have no capital myself, but my mother has a small annuity\" - here his mother rolled her head and again winked at me - \"and I have taken a 'ouse in the locality of Lambeth, and intend setting up professionally for myself there forthwith.\"\nHere Mr. Guppy's mother began smiling waggishly at anybody who would look at her.\n\"It's a six-roomer, exclusive of kitchens,\" said Mr. Guppy, \"and in the opinion of my friends, a commodious tenement. My friend Jobling will assist me in the capacity of clerk and will live in the 'ouse. Likewise my mother; and consequently there will be no want of society. My friend Jobling is naturally aristocratic by taste, and fully backs me in the intentions I am now developing.\"\nMr. Jobling said \"Certainly,\" and withdrew a little from Mrs. Guppy's elbow.\n\"Now, you may know, sir,\" said Mr. Guppy, \"that Miss Summerson's image was formerly imprinted on my 'eart and that I made her a proposal of marriage.\"\n\"That I have heard,\" returned my guardian.\n\"Circumstances over which I had no control weakened the impression of that image for a time. At which time Miss Summerson's conduct was highly genteel and generous.\"\nMy guardian patted me on the shoulder and seemed much amused.\n\"Now, sir,\" said Mr. Guppy, \"I wish to prove to Miss Summerson that I can rise to a height of which perhaps she hardly thought me capable. I find that the image which I supposed had been eradicated from my 'eart is not eradicated. Yielding to it, I am willing to overlook the circumstances over which none of us have had any control and to renew my proposals to Miss Summerson.\"\n\"I take upon myself, sir,\" said my guardian, laughing as he rang the bell, \"to reply to your proposals on behalf of Miss Summerson. She is very sensible of your handsome intentions, and wishes you good evening, and wishes you well.\"\n\"Oh!\" said Mr. Guppy with a blank look. \"Is that acceptance, or rejection, or consideration?\"\n\"Rejection, if you please,\" returned my guardian.\nMr. Guppy looked incredulously at his friend, and at his mother, who suddenly turned very angry.\n\"Why, get along with you,\" said she to my guardian, \"what do you mean? Ain't my son good enough for you? Get out with you!\"\n\"My good lady,\" returned my guardian, \"it is hardly reasonable to ask me to get out of my own room.\"\n\"I don't care for that,\" said Mrs. Guppy. \"Get out with you. If we ain't good enough for you, go and find somebody that is.\"\nI was quite unprepared for the rapid manner in which Mrs. Guppy's jocularity changed.\n\"Why don't you get out?\" she said. \"What are you stopping here for?\"\n\"Mother,\" interposed her son, \"will you hold your tongue?\"\n\"No, William, I won't!\"\nHowever, Mr. Guppy and Mr. Jobling together closed on her and took her, very much against her will, downstairs, her voice rising as she got lower, and insisting that we should immediately get out.",
        "paragraph_chars": [
            [
                0,
                171
            ],
            [
                171,
                753
            ],
            [
                753,
                1023
            ],
            [
                1023,
                1437
            ],
            [
                1437,
                2024
            ],
            [
                2024,
                2561
            ],
            [
                2561,
                2826
            ],
            [
                2826,
                3198
            ],
            [
                3198,
                3356
            ],
            [
                3356,
                3407
            ],
            [
                3407,
                4161
            ],
            [
                4161,
                4262
            ],
            [
                4262,
                4377
            ],
            [
                4377,
                4440
            ],
            [
                4440,
                4572
            ],
            [
                4572,
                4668
            ],
            [
                4668,
                4840
            ],
            [
                4840,
                5134
            ],
            [
                5134,
                5291
            ],
            [
                5291,
                5879
            ],
            [
                5879,
                6298
            ],
            [
                6298,
                6432
            ],
            [
                6432,
                6468
            ],
            [
                6468,
                6505
            ],
            [
                6505,
                6575
            ],
            [
                6575,
                6932
            ],
            [
                6932,
                7145
            ],
            [
                7145,
                7336
            ],
            [
                7336,
                7408
            ],
            [
                7408,
                7521
            ],
            [
                7521,
                7619
            ],
            [
                7619,
                8097
            ],
            [
                8097,
                8226
            ],
            [
                8226,
                9182
            ],
            [
                9182,
                9274
            ],
            [
                9274,
                9716
            ],
            [
                9716,
                9859
            ],
            [
                9859,
                10181
            ],
            [
                10181,
                10442
            ],
            [
                10442,
                10773
            ],
            [
                10773,
                10968
            ],
            [
                10968,
                11344
            ],
            [
                11344,
                11540
            ],
            [
                11540,
                11675
            ],
            [
                11675,
                11793
            ],
            [
                11793,
                11897
            ],
            [
                11897,
                11941
            ],
            [
                11941,
                12114
            ],
            [
                12114,
                12175
            ],
            [
                12175,
                12264
            ],
            [
                12264,
                12317
            ],
            [
                12317,
                12627
            ],
            [
                12627,
                12669
            ],
            [
                12669,
                13097
            ],
            [
                13097,
                13179
            ],
            [
                13179,
                13567
            ],
            [
                13567,
                13644
            ],
            [
                13644,
                13795
            ],
            [
                13795,
                13838
            ],
            [
                13838,
                14004
            ],
            [
                14004,
                14066
            ],
            [
                14066,
                14445
            ],
            [
                14445,
                14678
            ],
            [
                14678,
                14772
            ],
            [
                14772,
                14822
            ],
            [
                14822,
                14919
            ],
            [
                14919,
                15043
            ],
            [
                15043,
                15144
            ],
            [
                15144,
                15269
            ],
            [
                15269,
                15355
            ],
            [
                15355,
                15424
            ],
            [
                15424,
                15483
            ],
            [
                15483,
                15507
            ],
            [
                15507,
                15703
            ]
        ],
        "segment_chars": [
            [
                0,
                137
            ],
            [
                137,
                171
            ],
            [
                171,
                276
            ],
            [
                276,
                427
            ],
            [
                427,
                507
            ],
            [
                507,
                611
            ],
            [
                611,
                693
            ],
            [
                693,
                753
            ],
            [
                753,
                799
            ],
            [
                799,
                896
            ],
            [
                896,
                917
            ],
            [
                917,
                1023
            ],
            [
                1023,
                1093
            ],
            [
                1093,
                1214
            ],
            [
                1214,
                1437
            ],
            [
                1437,
                1558
            ],
            [
                1558,
                1642
            ],
            [
                1642,
                1751
            ],
            [
                1751,
                2024
            ],
            [
                2024,
                2127
            ],
            [
                2127,
                2197
            ],
            [
                2197,
                2378
            ],
            [
                2378,
                2496
            ],
            [
                2496,
                2561
            ],
            [
                2561,
                2651
            ],
            [
                2651,
                2826
            ],
            [
                2826,
                2909
            ],
            [
                2909,
                3033
            ],
            [
                3033,
                3153
            ],
            [
                3153,
                3198
            ],
            [
                3198,
                3356
            ],
            [
                3356,
                3407
            ],
            [
                3407,
                3485
            ],
            [
                3485,
                3589
            ],
            [
                3589,
                3725
            ],
            [
                3725,
                3850
            ],
            [
                3850,
                4002
            ],
            [
                4002,
                4088
            ],
            [
                4088,
                4161
            ],
            [
                4161,
                4208
            ],
            [
                4208,
                4262
            ],
            [
                4262,
                4274
            ],
            [
                4274,
                4292
            ],
            [
                4292,
                4332
            ],
            [
                4332,
                4377
            ],
            [
                4377,
                4440
            ],
            [
                4440,
                4463
            ],
            [
                4463,
                4497
            ],
            [
                4497,
                4572
            ],
            [
                4572,
                4604
            ],
            [
                4604,
                4614
            ],
            [
                4614,
                4622
            ],
            [
                4622,
                4668
            ],
            [
                4668,
                4792
            ],
            [
                4792,
                4840
            ],
            [
                4840,
                4951
            ],
            [
                4951,
                5134
            ],
            [
                5134,
                5291
            ],
            [
                5291,
                5647
            ],
            [
                5647,
                5879
            ],
            [
                5879,
                5956
            ],
            [
                5956,
                6003
            ],
            [
                6003,
                6149
            ],
            [
                6149,
                6298
            ],
            [
                6298,
                6432
            ],
            [
                6432,
                6468
            ],
            [
                6468,
                6505
            ],
            [
                6505,
                6575
            ],
            [
                6575,
                6613
            ],
            [
                6613,
                6719
            ],
            [
                6719,
                6891
            ],
            [
                6891,
                6932
            ],
            [
                6932,
                6970
            ],
            [
                6970,
                7145
            ],
            [
                7145,
                7182
            ],
            [
                7182,
                7282
            ],
            [
                7282,
                7336
            ],
            [
                7336,
                7408
            ],
            [
                7408,
                7479
            ],
            [
                7479,
                7521
            ],
            [
                7521,
                7619
            ],
            [
                7619,
                7649
            ],
            [
                7649,
                7772
            ],
            [
                7772,
                7778
            ],
            [
                7778,
                7875
            ],
            [
                7875,
                8097
            ],
            [
                8097,
                8157
            ],
            [
                8157,
                8226
            ],
            [
                8226,
                8247
            ],
            [
                8247,
                8286
            ],
            [
                8286,
                8359
            ],
            [
                8359,
                8388
            ],
            [
                8388,
                8498
            ],
            [
                8498,
                8569
            ],
            [
                8569,
                8767
            ],
            [
                8767,
                8798
            ],
            [
                8798,
                8863
            ],
            [
                8863,
                9016
            ],
            [
                9016,
                9182
            ],
            [
                9182,
                9274
            ],
            [
                9274,
                9295
            ],
            [
                9295,
                9413
            ],
            [
                9413,
                9469
            ],
            [
                9469,
                9492
            ],
            [
                9492,
                9590
            ],
            [
                9590,
                9611
            ],
            [
                9611,
                9716
            ],
            [
                9716,
                9748
            ],
            [
                9748,
                9773
            ],
            [
                9773,
                9859
            ],
            [
                9859,
                9949
            ],
            [
                9949,
                9973
            ],
            [
                9973,
                10019
            ],
            [
                10019,
                10099
            ],
            [
                10099,
                10162
            ],
            [
                10162,
                10181
            ],
            [
                10181,
                10339
            ],
            [
                10339,
                10420
            ],
            [
                10420,
                10442
            ],
            [
                10442,
                10587
            ],
            [
                10587,
                10619
            ],
            [
                10619,
                10773
            ],
            [
                10773,
                10835
            ],
            [
                10835,
                10968
            ],
            [
                10968,
                11010
            ],
            [
                11010,
                11128
            ],
            [
                11128,
                11344
            ],
            [
                11344,
                11495
            ],
            [
                11495,
                11529
            ],
            [
                11529,
                11540
            ],
            [
                11540,
                11675
            ],
            [
                11675,
                11746
            ],
            [
                11746,
                11793
            ],
            [
                11793,
                11897
            ],
            [
                11897,
                11919
            ],
            [
                11919,
                11941
            ],
            [
                11941,
                11995
            ],
            [
                11995,
                12114
            ],
            [
                12114,
                12175
            ],
            [
                12175,
                12238
            ],
            [
                12238,
                12264
            ],
            [
                12264,
                12317
            ],
            [
                12317,
                12518
            ],
            [
                12518,
                12627
            ],
            [
                12627,
                12669
            ],
            [
                12669,
                12716
            ],
            [
                12716,
                12857
            ],
            [
                12857,
                13097
            ],
            [
                13097,
                13179
            ],
            [
                13179,
                13297
            ],
            [
                13297,
                13383
            ],
            [
                13383,
                13454
            ],
            [
                13454,
                13567
            ],
            [
                13567,
                13644
            ],
            [
                13644,
                13795
            ],
            [
                13795,
                13838
            ],
            [
                13838,
                13931
            ],
            [
                13931,
                14004
            ],
            [
                14004,
                14066
            ],
            [
                14066,
                14205
            ],
            [
                14205,
                14297
            ],
            [
                14297,
                14445
            ],
            [
                14445,
                14577
            ],
            [
                14577,
                14678
            ],
            [
                14678,
                14684
            ],
            [
                14684,
                14718
            ],
            [
                14718,
                14772
            ],
            [
                14772,
                14822
            ],
            [
                14822,
                14919
            ],
            [
                14919,
                14990
            ],
            [
                14990,
                15024
            ],
            [
                15024,
                15043
            ],
            [
                15043,
                15144
            ],
            [
                15144,
                15186
            ],
            [
                15186,
                15205
            ],
            [
                15205,
                15269
            ],
            [
                15269,
                15355
            ],
            [
                15355,
                15380
            ],
            [
                15380,
                15390
            ],
            [
                15390,
                15424
            ],
            [
                15424,
                15483
            ],
            [
                15483,
                15507
            ],
            [
                15507,
                15703
            ]
        ],
        "overlap_chars": [
            [
                0,
                10
            ],
            [
                11,
                137
            ],
            [
                137,
                171
            ],
            [
                171,
                182
            ],
            [
                183,
                198
            ],
            [
                199,
                208
            ],
            [
                209,
                221
            ],
            [
                221,
                222
            ],
            [
                233,
                254
            ],
            [
                255,
                274
            ],
            [
                274,
                276
            ],
            [
                276,
                284
            ],
            [
                285,
                427
            ],
            [
                427,
                446
            ],
            [
                447,
                507
            ],
            [
                507,
                591
            ],
            [
                600,
                611
            ],
            [
                611,
                618
            ],
            [
                619,
                693
            ],
            [
                693,
                753
            ],
            [
                753,
                799
            ],
            [
                799,
                896
            ],
            [
                896,
                917
            ],
            [
                917,
                995
            ],
            [
                999,
                1022
            ],
            [
                1023,
                1076
            ],
            [
                1081,
                1093
            ],
            [
                1093,
                1214
            ],
            [
                1214,
                1256
            ],
            [
                1258,
                1316
            ],
            [
                1317,
                1437
            ],
            [
                1437,
                1446
            ],
            [
                1446,
                1510
            ],
            [
                1515,
                1525
            ],
            [
                1526,
                1558
            ],
            [
                1558,
                1642
            ],
            [
                1642,
                1667
            ],
            [
                1668,
                1704
            ],
            [
                1705,
                1709
            ],
            [
                1710,
                1719
            ],
            [
                1729,
                1737
            ],
            [
                1738,
                1741
            ],
            [
                1749,
                1751
            ],
            [
                1751,
                1890
            ],
            [
                1900,
                1909
            ],
            [
                1909,
                1924
            ],
            [
                1925,
                2024
            ],
            [
                2024,
                2081
            ],
            [
                2088,
                2127
            ],
            [
                2127,
                2197
            ],
            [
                2197,
                2313
            ],
            [
                2314,
                2378
            ],
            [
                2378,
                2433
            ],
            [
                2440,
                2451
            ],
            [
                2452,
                2479
            ],
            [
                2480,
                2494
            ],
            [
                2494,
                2496
            ],
            [
                2496,
                2540
            ],
            [
                2551,
                2561
            ],
            [
                2561,
                2562
            ],
            [
                2571,
                2579
            ],
            [
                2580,
                2609
            ],
            [
                2610,
                2651
            ],
            [
                2651,
                2681
            ],
            [
                2682,
                2708
            ],
            [
                2708,
                2792
            ],
            [
                2792,
                2803
            ],
            [
                2804,
                2826
            ],
            [
                2826,
                2909
            ],
            [
                2909,
                2975
            ],
            [
                2975,
                3033
            ],
            [
                3033,
                3041
            ],
            [
                3042,
                3068
            ],
            [
                3069,
                3136
            ],
            [
                3137,
                3153
            ],
            [
                3153,
                3161
            ],
            [
                3162,
                3167
            ],
            [
                3168,
                3171
            ],
            [
                3192,
                3196
            ],
            [
                3196,
                3198
            ],
            [
                3198,
                3254
            ],
            [
                3259,
                3356
            ],
            [
                3356,
                3383
            ],
            [
                3383,
                3404
            ],
            [
                3404,
                3407
            ],
            [
                3407,
                3412
            ],
            [
                3412,
                3462
            ],
            [
                3472,
                3485
            ],
            [
                3485,
                3558
            ],
            [
                3559,
                3567
            ],
            [
                3568,
                3571
            ],
            [
                3572,
                3589
            ],
            [
                3589,
                3674
            ],
            [
                3689,
                3693
            ],
            [
                3694,
                3718
            ],
            [
                3723,
                3725
            ],
            [
                3725,
                3750
            ],
            [
                3757,
                3769
            ],
            [
                3770,
                3778
            ],
            [
                3783,
                3828
            ],
            [
                3829,
                3850
            ],
            [
                3850,
                3905
            ],
            [
                3905,
                4002
            ],
            [
                4002,
                4067
            ],
            [
                4068,
                4086
            ],
            [
                4086,
                4088
            ],
            [
                4088,
                4161
            ],
            [
                4161,
                4208
            ],
            [
                4208,
                4227
            ],
            [
                4232,
                4249
            ],
            [
                4254,
                4262
            ],
            [
                4262,
                4274
            ],
            [
                4274,
                4292
            ],
            [
                4292,
                4332
            ],
            [
                4332,
                4377
            ],
            [
                4377,
                4388
            ],
            [
                4389,
                4407
            ],
            [
                4410,
                4440
            ],
            [
                4440,
                4463
            ],
            [
                4463,
                4497
            ],
            [
                4497,
                4572
            ],
            [
                4572,
                4604
            ],
            [
                4604,
                4611
            ],
            [
                4611,
                4614
            ],
            [
                4614,
                4622
            ],
            [
                4622,
                4668
            ],
            [
                4668,
                4687
            ],
            [
                4688,
                4790
            ],
            [
                4790,
                4792
            ],
            [
                4792,
                4840
            ],
            [
                4840,
                4951
            ],
            [
                4951,
                5002
            ],
            [
                5002,
                5134
            ],
            [
                5134,
                5291
            ],
            [
                5291,
                5385
            ],
            [
                5385,
                5406
            ],
            [
                5407,
                5408
            ],
            [
                5409,
                5428
            ],
            [
                5435,
                5551
            ],
            [
                5552,
                5555
            ],
            [
                5563,
                5571
            ],
            [
                5572,
                5645
            ],
            [
                5645,
                5647
            ],
            [
                5647,
                5824
            ],
            [
                5825,
                5857
            ],
            [
                5858,
                5879
            ],
            [
                5879,
                5915
            ],
            [
                5915,
                5954
            ],
            [
                5956,
                6001
            ],
            [
                6003,
                6123
            ],
            [
                6127,
                6149
            ],
            [
                6149,
                6180
            ],
            [
                6183,
                6262
            ],
            [
                6266,
                6298
            ],
            [
                6298,
                6382
            ],
            [
                6382,
                6432
            ],
            [
                6432,
                6468
            ],
            [
                6468,
                6502
            ],
            [
                6505,
                6507
            ],
            [
                6519,
                6528
            ],
            [
                6530,
                6533
            ],
            [
                6534,
                6543
            ],
            [
                6545,
                6575
            ],
            [
                6575,
                6611
            ],
            [
                6613,
                6654
            ],
            [
                6654,
                6655
            ],
            [
                6663,
                6664
            ],
            [
                6672,
                6691
            ],
            [
                6692,
                6693
            ],
            [
                6699,
                6719
            ],
            [
                6719,
                6778
            ],
            [
                6778,
                6779
            ],
            [
                6780,
                6792
            ],
            [
                6803,
                6819
            ],
            [
                6819,
                6820
            ],
            [
                6825,
                6826
            ],
            [
                6831,
                6838
            ],
            [
                6839,
                6860
            ],
            [
                6860,
                6877
            ],
            [
                6886,
                6890
            ],
            [
                6891,
                6932
            ],
            [
                6932,
                6968
            ],
            [
                6968,
                6970
            ],
            [
                6970,
                6986
            ],
            [
                6987,
                6993
            ],
            [
                6997,
                7011
            ],
            [
                7011,
                7145
            ],
            [
                7145,
                7182
            ],
            [
                7182,
                7282
            ],
            [
                7282,
                7336
            ],
            [
                7336,
                7407
            ],
            [
                7408,
                7409
            ],
            [
                7414,
                7479
            ],
            [
                7479,
                7518
            ],
            [
                7521,
                7576
            ],
            [
                7577,
                7586
            ],
            [
                7586,
                7619
            ],
            [
                7619,
                7649
            ],
            [
                7649,
                7687
            ],
            [
                7688,
                7772
            ],
            [
                7772,
                7778
            ],
            [
                7778,
                7865
            ],
            [
                7866,
                7875
            ],
            [
                7875,
                7878
            ],
            [
                7879,
                8097
            ],
            [
                8097,
                8148
            ],
            [
                8149,
                8157
            ],
            [
                8157,
                8226
            ],
            [
                8226,
                8247
            ],
            [
                8247,
                8286
            ],
            [
                8286,
                8359
            ],
            [
                8359,
                8386
            ],
            [
                8386,
                8388
            ],
            [
                8388,
                8498
            ],
            [
                8498,
                8539
            ],
            [
                8540,
                8569
            ],
            [
                8569,
                8573
            ],
            [
                8574,
                8643
            ],
            [
                8644,
                8663
            ],
            [
                8664,
                8677
            ],
            [
                8678,
                8681
            ],
            [
                8682,
                8767
            ],
            [
                8767,
                8796
            ],
            [
                8796,
                8798
            ],
            [
                8798,
                8863
            ],
            [
                8863,
                8867
            ],
            [
                8868,
                8884
            ],
            [
                8884,
                8938
            ],
            [
                8938,
                8939
            ],
            [
                8942,
                8964
            ],
            [
                8973,
                9013
            ],
            [
                9013,
                9016
            ],
            [
                9016,
                9098
            ],
            [
                9102,
                9107
            ],
            [
                9108,
                9126
            ],
            [
                9126,
                9182
            ],
            [
                9182,
                9272
            ],
            [
                9272,
                9273
            ],
            [
                9274,
                9295
            ],
            [
                9295,
                9377
            ],
            [
                9380,
                9411
            ],
            [
                9411,
                9413
            ],
            [
                9413,
                9469
            ],
            [
                9469,
                9492
            ],
            [
                9492,
                9561
            ],
            [
                9564,
                9590
            ],
            [
                9590,
                9611
            ],
            [
                9611,
                9716
            ],
            [
                9716,
                9748
            ],
            [
                9748,
                9773
            ],
            [
                9773,
                9783
            ],
            [
                9786,
                9816
            ],
            [
                9817,
                9838
            ],
            [
                9841,
                9859
            ],
            [
                9859,
                9949
            ],
            [
                9949,
                9973
            ],
            [
                9973,
                10019
            ],
            [
                10019,
                10099
            ],
            [
                10099,
                10115
            ],
            [
                10126,
                10162
            ],
            [
                10162,
                10181
            ],
            [
                10181,
                10285
            ],
            [
                10286,
                10339
            ],
            [
                10339,
                10418
            ],
            [
                10418,
                10420
            ],
            [
                10420,
                10442
            ],
            [
                10442,
                10529
            ],
            [
                10530,
                10534
            ],
            [
                10535,
                10545
            ],
            [
                10545,
                10587
            ],
            [
                10587,
                10617
            ],
            [
                10617,
                10619
            ],
            [
                10619,
                10773
            ],
            [
                10773,
                10811
            ],
            [
                10812,
                10835
            ],
            [
                10835,
                10911
            ],
            [
                10920,
                10968
            ],
            [
                10968,
                11010
            ],
            [
                11010,
                11128
            ],
            [
                11128,
                11182
            ],
            [
                11182,
                11344
            ],
            [
                11344,
                11346
            ],
            [
                11347,
                11422
            ],
            [
                11423,
                11436
            ],
            [
                11436,
                11437
            ],
            [
                11438,
                11441
            ],
            [
                11442,
                11474
            ],
            [
                11481,
                11485
            ],
            [
                11493,
                11495
            ],
            [
                11495,
                11529
            ],
            [
                11529,
                11540
            ],
            [
                11540,
                11596
            ],
            [
                11597,
                11618
            ],
            [
                11619,
                11628
            ],
            [
                11631,
                11674
            ],
            [
                11675,
                11746
            ],
            [
                11746,
                11748
            ],
            [
                11749,
                11753
            ],
            [
                11754,
                11763
            ],
            [
                11764,
                11775
            ],
            [
                11776,
                11778
            ],
            [
                11783,
                11791
            ],
            [
                11791,
                11793
            ],
            [
                11793,
                11897
            ],
            [
                11897,
                11919
            ],
            [
                11919,
                11941
            ],
            [
                11941,
                11995
            ],
            [
                11995,
                12048
            ],
            [
                12048,
                12086
            ],
            [
                12086,
                12087
            ],
            [
                12088,
                12103
            ],
            [
                12104,
                12114
            ],
            [
                12114,
                12175
            ],
            [
                12175,
                12238
            ],
            [
                12238,
                12264
            ],
            [
                12264,
                12317
            ],
            [
                12317,
                12353
            ],
            [
                12354,
                12360
            ],
            [
                12367,
                12377
            ],
            [
                12378,
                12381
            ],
            [
                12385,
                12415
            ],
            [
                12423,
                12516
            ],
            [
                12516,
                12518
            ],
            [
                12518,
                12627
            ],
            [
                12627,
                12628
            ],
            [
                12632,
                12635
            ],
            [
                12635,
                12667
            ],
            [
                12669,
                12716
            ],
            [
                12716,
                12780
            ],
            [
                12781,
                12796
            ],
            [
                12797,
                12855
            ],
            [
                12855,
                12856
            ],
            [
                12857,
                12902
            ],
            [
                12909,
                12917
            ],
            [
                12920,
                12924
            ],
            [
                12929,
                12951
            ],
            [
                12952,
                12974
            ],
            [
                12977,
                12981
            ],
            [
                12982,
                12988
            ],
            [
                12989,
                13005
            ],
            [
                13006,
                13009
            ],
            [
                13010,
                13018
            ],
            [
                13019,
                13021
            ],
            [
                13022,
                13029
            ],
            [
                13029,
                13030
            ],
            [
                13031,
                13097
            ],
            [
                13097,
                13120
            ],
            [
                13127,
                13179
            ],
            [
                13179,
                13297
            ],
            [
                13297,
                13319
            ],
            [
                13327,
                13329
            ],
            [
                13330,
                13381
            ],
            [
                13381,
                13383
            ],
            [
                13392,
                13401
            ],
            [
                13401,
                13454
            ],
            [
                13454,
                13511
            ],
            [
                13512,
                13567
            ],
            [
                13567,
                13594
            ],
            [
                13597,
                13623
            ],
            [
                13624,
                13625
            ],
            [
                13629,
                13636
            ],
            [
                13637,
                13642
            ],
            [
                13642,
                13644
            ],
            [
                13644,
                13649
            ],
            [
                13650,
                13653
            ],
            [
                13662,
                13667
            ],
            [
                13667,
                13685
            ],
            [
                13687,
                13795
            ],
            [
                13795,
                13838
            ],
            [
                13838,
                13852
            ],
            [
                13853,
                13880
            ],
            [
                13881,
                13931
            ],
            [
                13931,
                13988
            ],
            [
                14001,
                14004
            ],
            [
                14004,
                14066
            ],
            [
                14066,
                14096
            ],
            [
                14097,
                14149
            ],
            [
                14157,
                14205
            ],
            [
                14205,
                14234
            ],
            [
                14244,
                14297
            ],
            [
                14306,
                14411
            ],
            [
                14415,
                14442
            ],
            [
                14445,
                14577
            ],
            [
                14577,
                14678
            ],
            [
                14678,
                14684
            ],
            [
                14684,
                14718
            ],
            [
                14718,
                14726
            ],
            [
                14727,
                14772
            ],
            [
                14772,
                14773
            ],
            [
                14782,
                14822
            ],
            [
                14822,
                14917
            ],
            [
                14917,
                14919
            ],
            [
                14919,
                14990
            ],
            [
                14990,
                15024
            ],
            [
                15024,
                15043
            ],
            [
                15043,
                15144
            ],
            [
                15144,
                15186
            ],
            [
                15186,
                15205
            ],
            [
                15205,
                15244
            ],
            [
                15250,
                15266
            ],
            [
                15269,
                15334
            ],
            [
                15335,
                15345
            ],
            [
                15353,
                15355
            ],
            [
                15355,
                15380
            ],
            [
                15384,
                15388
            ],
            [
                15388,
                15390
            ],
            [
                15390,
                15424
            ],
            [
                15424,
                15452
            ],
            [
                15452,
                15483
            ],
            [
                15483,
                15495
            ],
            [
                15495,
                15496
            ],
            [
                15497,
                15504
            ],
            [
                15507,
                15560
            ],
            [
                15561,
                15564
            ],
            [
                15565,
                15635
            ],
            [
                15643,
                15646
            ],
            [
                15647,
                15694
            ],
            [
                15695,
                15703
            ]
        ],
        "row_chars": [
            [
                0,
                137
            ],
            [
                137,
                171
            ],
            [
                171,
                276
            ],
            [
                276,
                427
            ],
            [
                427,
                507
            ],
            [
                507,
                611
            ],
            [
                611,
                693
            ],
            [
                693,
                753
            ],
            [
                753,
                799
            ],
            [
                799,
                896
            ],
            [
                896,
                917
            ],
            [
                917,
                1023
            ],
            [
                1023,
                1023
            ],
            [
                1023,
                1093
            ],
            [
                1093,
                1214
            ],
            [
                1214,
                1437
            ],
            [
                1437,
                1558
            ],
            [
                1558,
                1642
            ],
            [
                1642,
                1751
            ],
            [
                1751,
                2024
            ],
            [
                2024,
                2127
            ],
            [
                2127,
                2197
            ],
            [
                2197,
                2378
            ],
            [
                2378,
                2496
            ],
            [
                2496,
                2561
            ],
            [
                2561,
                2651
            ],
            [
                2651,
                2826
            ],
            [
                2826,
                2909
            ],
            [
                2909,
                3033
            ],
            [
                3033,
                3153
            ],
            [
                3153,
                3198
            ],
            [
                3198,
                3356
            ],
            [
                3356,
                3407
            ],
            [
                3407,
                3485
            ],
            [
                3485,
                3589
            ],
            [
                3589,
                3725
            ],
            [
                3725,
                3850
            ],
            [
                3850,
                4002
            ],
            [
                4002,
                4088
            ],
            [
                4088,
                4161
            ],
            [
                4161,
                4208
            ],
            [
                4208,
                4262
            ],
            [
                4262,
                4274
            ],
            [
                4274,
                4292
            ],
            [
                4292,
                4332
            ],
            [
                4332,
                4377
            ],
            [
                4377,
                4440
            ],
            [
                4440,
                4463
            ],
            [
                4463,
                4497
            ],
            [
                4497,
                4497
            ],
            [
                4497,
                4572
            ],
            [
                4572,
                4604
            ],
            [
                4604,
                4614
            ],
            [
                4614,
                4622
            ],
            [
                4622,
                4668
            ],
            [
                4668,
                4668
            ],
            [
                4668,
                4668
            ],
            [
                4668,
                4668
            ],
            [
                4668,
                4668
            ],
            [
                4668,
                4792
            ],
            [
                4792,
                4840
            ],
            [
                4840,
                4951
            ],
            [
                4951,
                5134
            ],
            [
                5134,
                5291
            ],
            [
                5291,
                5647
            ],
            [
                5647,
                5879
            ],
            [
                5879,
                6003
            ],
            [
                6003,
                6003
            ],
            [
                6003,
                6149
            ],
            [
                6149,
                6298
            ],
            [
                6298,
                6432
            ],
            [
                6432,
                6468
            ],
            [
                6468,
                6505
            ],
            [
                6505,
                6505
            ],
            [
                6505,
                6505
            ],
            [
                6505,
                6505
            ],
            [
                6505,
                6575
            ],
            [
                6575,
                6719
            ],
            [
                6719,
                6891
            ],
            [
                6891,
                6932
            ],
            [
                6932,
                6970
            ],
            [
                6970,
                7145
            ],
            [
                7145,
                7182
            ],
            [
                7182,
                7182
            ],
            [
                7182,
                7282
            ],
            [
                7282,
                7336
            ],
            [
                7336,
                7408
            ],
            [
                7408,
                7479
            ],
            [
                7479,
                7521
            ],
            [
                7521,
                7521
            ],
            [
                7521,
                7619
            ],
            [
                7619,
                7649
            ],
            [
                7649,
                7772
            ],
            [
                7772,
                7772
            ],
            [
                7772,
                7778
            ],
            [
                7778,
                7875
            ],
            [
                7875,
                8097
            ],
            [
                8097,
                8157
            ],
            [
                8157,
                8226
            ],
            [
                8226,
                8247
            ],
            [
                8247,
                8286
            ],
            [
                8286,
                8359
            ],
            [
                8359,
                8388
            ],
            [
                8388,
                8498
            ],
            [
                8498,
                8569
            ],
            [
                8569,
                8767
            ],
            [
                8767,
                8798
            ],
            [
                8798,
                8863
            ],
            [
                8863,
                9016
            ],
            [
                9016,
                9182
            ],
            [
                9182,
                9274
            ],
            [
                9274,
                9274
            ],
            [
                9274,
                9295
            ],
            [
                9295,
                9413
            ],
            [
                9413,
                9469
            ],
            [
                9469,
                9492
            ],
            [
                9492,
                9590
            ],
            [
                9590,
                9611
            ],
            [
                9611,
                9716
            ],
            [
                9716,
                9748
            ],
            [
                9748,
                9773
            ],
            [
                9773,
                9859
            ],
            [
                9859,
                9949
            ],
            [
                9949,
                9973
            ],
            [
                9973,
                10019
            ],
            [
                10019,
                10099
            ],
            [
                10099,
                10162
            ],
            [
                10162,
                10181
            ],
            [
                10181,
                10339
            ],
            [
                10339,
                10420
            ],
            [
                10420,
                10442
            ],
            [
                10442,
                10587
            ],
            [
                10587,
                10619
            ],
            [
                10619,
                10773
            ],
            [
                10773,
                10835
            ],
            [
                10835,
                10968
            ],
            [
                10968,
                11010
            ],
            [
                11010,
                11128
            ],
            [
                11128,
                11344
            ],
            [
                11344,
                11495
            ],
            [
                11495,
                11529
            ],
            [
                11529,
                11540
            ],
            [
                11540,
                11675
            ],
            [
                11675,
                11746
            ],
            [
                11746,
                11793
            ],
            [
                11793,
                11897
            ],
            [
                11897,
                11919
            ],
            [
                11919,
                11941
            ],
            [
                11941,
                11995
            ],
            [
                11995,
                12114
            ],
            [
                12114,
                12175
            ],
            [
                12175,
                12238
            ],
            [
                12238,
                12264
            ],
            [
                12264,
                12317
            ],
            [
                12317,
                12518
            ],
            [
                12518,
                12627
            ],
            [
                12627,
                12669
            ],
            [
                12669,
                12716
            ],
            [
                12716,
                12857
            ],
            [
                12857,
                12857
            ],
            [
                12857,
                12857
            ],
            [
                12857,
                12857
            ],
            [
                12857,
                13097
            ],
            [
                13097,
                13179
            ],
            [
                13179,
                13297
            ],
            [
                13297,
                13297
            ],
            [
                13297,
                13297
            ],
            [
                13297,
                13383
            ],
            [
                13383,
                13454
            ],
            [
                13454,
                13567
            ],
            [
                13567,
                13644
            ],
            [
                13644,
                13795
            ],
            [
                13795,
                13838
            ],
            [
                13838,
                13931
            ],
            [
                13931,
                14004
            ],
            [
                14004,
                14066
            ],
            [
                14066,
                14205
            ],
            [
                14205,
                14297
            ],
            [
                14297,
                14445
            ],
            [
                14445,
                14445
            ],
            [
                14445,
                14445
            ],
            [
                14445,
                14445
            ],
            [
                14445,
                14445
            ],
            [
                14445,
                14445
            ],
            [
                14445,
                14577
            ],
            [
                14577,
                14678
            ],
            [
                14678,
                14684
            ],
            [
                14684,
                14718
            ],
            [
                14718,
                14772
            ],
            [
                14772,
                14822
            ],
            [
                14822,
                14919
            ],
            [
                14919,
                14919
            ],
            [
                14919,
                14919
            ],
            [
                14919,
                14919
            ],
            [
                14919,
                14919
            ],
            [
                14919,
                14919
            ],
            [
                14919,
                14990
            ],
            [
                14990,
                15024
            ],
            [
                15024,
                15024
            ],
            [
                15024,
                15043
            ],
            [
                15043,
                15144
            ],
            [
                15144,
                15186
            ],
            [
                15186,
                15205
            ],
            [
                15205,
                15269
            ],
            [
                15269,
                15269
            ],
            [
                15269,
                15355
            ],
            [
                15355,
                15355
            ],
            [
                15355,
                15355
            ],
            [
                15355,
                15355
            ],
            [
                15355,
                15380
            ],
            [
                15380,
                15390
            ],
            [
                15390,
                15424
            ],
            [
                15424,
                15483
            ],
            [
                15483,
                15507
            ],
            [
                15507,
                15507
            ],
            [
                15507,
                15703
            ]
        ]
    }
}