{
    "original": {
        "text": "Full seven happy years I have been the mistress of Bleak House. The few words that I have to add to what I have written are soon penned; then I and the unknown friend to whom I write will part for ever. Not without much dear remembrance on my side. Not without some, I hope, on his or hers.\nThey gave my darling into my arms, and through many weeks I never left her. The little child who was to have done so much was born before the turf was planted on its father's grave. It was a boy; and I, my husband, and my guardian gave him his father's name.\nThe help that my dear counted on did come to her, though it came, in the eternal wisdom, for another purpose. Though to bless and restore his mother, not his father, was the errand of this baby, its power was mighty to do it. When I saw the strength of the weak little hand and how its touch could heal my darling's heart and raised hope within her, I felt a new sense of the goodness and the tenderness of God.\nThey throve, and by degrees I saw my dear girl pass into my country garden and walk there with her infant in her arms. I was married then. I was the happiest of the happy.\nIt was at this time that my guardian joined us and asked Ada when she would come home.\n\"Both houses are your home, my dear,\" said he, \"but the older Bleak House claims priority. When you and my boy are strong enough to do it, come and take possession of your home.\"\nAda called him \"her dearest cousin, John.\" But he said, no, it must be guardian now. He was her guardian henceforth, and the boy's; and he had an old association with the name. So she called him guardian, and has called him guardian ever since. The children know him by no other name. I say the children; I have two little daughters.\nIt is difficult to believe that Charley (round-eyed still, and not at all grammatical) is married to a miller in our neighbourhood; yet so it is; and even now, looking up from my desk as I write early in the morning at my summer window, I see the very mill beginning to go round. I hope the miller will not spoil Charley; but he is very fond of her, and Charley is rather vain of such a match, for he is well to do and was in great request. So far as my small maid is concerned, I might suppose time to have stood for seven years as still as the mill did half an hour ago, since little Emma, Charley's sister, is exactly what Charley used to be. As to Tom, Charley's brother, I am really afraid to say what he did at school in ciphering, but I think it was decimals. He is apprenticed to the miller, whatever it was, and is a good bashful fellow, always falling in love with somebody and being ashamed of it.\nCaddy Jellyby passed her very last holidays with us and was a dearer creature than ever, perpetually dancing in and out of the house with the children as if she had never given a dancing-lesson in her life. Caddy keeps her own little carriage now instead of hiring one, and lives full two miles further westward than Newman Street. She works very hard, her husband (an excellent one) being lame and able to do very little. Still, she is more than contented and does all she has to do with all her heart. Mr. Jellyby spends his evenings at her new house with his head against the wall as he used to do in her old one. I have heard that Mrs. Jellyby was understood to suffer great mortification from her daughter's ignoble marriage and pursuits, but I hope she got over it in time. She has been disappointed in Borrioboola-Gha, which turned out a failure in consequence of the king of Borrioboola wanting to sell everybody--who survived the climate--for rum, but she has taken up with the rights of women to sit in Parliament, and Caddy tells me it is a mission involving more correspondence than the old one. I had almost forgotten Caddy's poor little girl. She is not such a mite now, but she is deaf and dumb. I believe there never was a better mother than Caddy, who learns, in her scanty intervals of leisure, innumerable deaf and dumb arts to soften the affliction of her child.\nAs if I were never to have done with Caddy, I am reminded here of Peepy and old Mr. Turveydrop. Peepy is in the Custom House, and doing extremely well. Old Mr. Turveydrop, very apoplectic, still exhibits his deportment about town, still enjoys himself in the old manner, is still believed in in the old way. He is constant in his patronage of Peepy and is understood to have bequeathed him a favourite French clock in his dressing-room--which is not his property.\nWith the first money we saved at home, we added to our pretty house by throwing out a little growlery expressly for my guardian, which we inaugurated with great splendour the next time he came down to see us. I try to write all this lightly, because my heart is full in drawing to an end, but when I write of him, my tears will have their way.\nI never look at him but I hear our poor dear Richard calling him a good man. To Ada and her pretty boy, he is the fondest father; to me he is what he has ever been, and what name can I give to that? He is my husband's best and dearest friend, he is our children's darling, he is the object of our deepest love and veneration. Yet while I feel towards him as if he were a superior being, I am so familiar with him and so easy with him that I almost wonder at myself. I have never lost my old names, nor has he lost his; nor do I ever, when he is with us, sit in any other place than in my old chair at his side, Dame Trot, Dame Durden, Little Woman--all just the same as ever; and I answer, \"Yes, dear guardian!\" just the same.\nI have never known the wind to be in the east for a single moment since the day when he took me to the porch to read the name. I remarked to him once that the wind seemed never in the east now, and he said, no, truly; it had finally departed from that quarter on that very day.\nI think my darling girl is more beautiful than ever. The sorrow that has been in her face--for it is not there now--seems to have purified even its innocent expression and to have given it a diviner quality. Sometimes when I raise my eyes and see her in the black dress that she still wears, teaching my Richard, I feel--it is difficult to express--as if it were so good to know that she remembers her dear Esther in her prayers.\nI call him my Richard! But he says that he has two mamas, and I am one.\nWe are not rich in the bank, but we have always prospered, and we have quite enough. I never walk out with my husband but I hear the people bless him. I never go into a house of any degree but I hear his praises or see them in grateful eyes. I never lie down at night but I know that in the course of that day he has alleviated pain and soothed some fellow-creature in the time of need. I know that from the beds of those who were past recovery, thanks have often, often gone up, in the last hour, for his patient ministration. Is not this to be rich?\nThe people even praise me as the doctor's wife. The people even like me as I go about, and make so much of me that I am quite abashed. I owe it all to him, my love, my pride! They like me for his sake, as I do everything I do in life for his sake.\nA night or two ago, after bustling about preparing for my darling and my guardian and little Richard, who are coming to-morrow, I was sitting out in the porch of all places, that dearly memorable porch, when Allan came home. So he said, \"My precious little woman, what are you doing here?\" And I said, \"The moon is shining so brightly, Allan, and the night is so delicious, that I have been sitting here thinking.\"\n\"What have you been thinking about, my dear?\" said Allan then.\n\"How curious you are!\" said I. \"I am almost ashamed to tell you, but I will. I have been thinking about my old looks--such as they were.\"\n\"And what have you been thinking about THEM, my busy bee?\" said Allan.\n\"I have been thinking that I thought it was impossible that you COULD have loved me any better, even if I had retained them.\"\n\"'Such as they were'?\" said Allan, laughing.\n\"Such as they were, of course.\"\n\"My dear Dame Durden,\" said Allan, drawing my arm through his, \"do you ever look in the glass?\"\n\"You know I do; you see me do it.\"\n\"And don't you know that you are prettier than you ever were?\"\n\"I did not know that; I am not certain that I know it now. But I know that my dearest little pets are very pretty, and that my darling is very beautiful, and that my husband is very handsome, and that my guardian has the brightest and most benevolent face that ever was seen, and that they can very well do without much beauty in me--even supposing--.\"",
        "paragraph_chars": [
            [
                0,
                291
            ],
            [
                291,
                550
            ],
            [
                550,
                962
            ],
            [
                962,
                1134
            ],
            [
                1134,
                1221
            ],
            [
                1221,
                1400
            ],
            [
                1400,
                1734
            ],
            [
                1734,
                2643
            ],
            [
                2643,
                4026
            ],
            [
                4026,
                4490
            ],
            [
                4490,
                4834
            ],
            [
                4834,
                5561
            ],
            [
                5561,
                5839
            ],
            [
                5839,
                6269
            ],
            [
                6269,
                6341
            ],
            [
                6341,
                6893
            ],
            [
                6893,
                7141
            ],
            [
                7141,
                7556
            ],
            [
                7556,
                7619
            ],
            [
                7619,
                7757
            ],
            [
                7757,
                7828
            ],
            [
                7828,
                7954
            ],
            [
                7954,
                7999
            ],
            [
                7999,
                8031
            ],
            [
                8031,
                8127
            ],
            [
                8127,
                8162
            ],
            [
                8162,
                8225
            ],
            [
                8225,
                8577
            ]
        ],
        "segment_chars": [
            [
                0,
                64
            ],
            [
                64,
                203
            ],
            [
                203,
                249
            ],
            [
                249,
                291
            ],
            [
                291,
                367
            ],
            [
                367,
                473
            ],
            [
                473,
                550
            ],
            [
                550,
                660
            ],
            [
                660,
                776
            ],
            [
                776,
                962
            ],
            [
                962,
                1081
            ],
            [
                1081,
                1101
            ],
            [
                1101,
                1134
            ],
            [
                1134,
                1221
            ],
            [
                1221,
                1312
            ],
            [
                1312,
                1400
            ],
            [
                1400,
                1443
            ],
            [
                1443,
                1485
            ],
            [
                1485,
                1577
            ],
            [
                1577,
                1645
            ],
            [
                1645,
                1685
            ],
            [
                1685,
                1734
            ],
            [
                1734,
                2014
            ],
            [
                2014,
                2175
            ],
            [
                2175,
                2380
            ],
            [
                2380,
                2501
            ],
            [
                2501,
                2643
            ],
            [
                2643,
                2850
            ],
            [
                2850,
                2975
            ],
            [
                2975,
                3066
            ],
            [
                3066,
                3147
            ],
            [
                3147,
                3260
            ],
            [
                3260,
                3423
            ],
            [
                3423,
                3751
            ],
            [
                3751,
                3800
            ],
            [
                3800,
                3854
            ],
            [
                3854,
                4026
            ],
            [
                4026,
                4122
            ],
            [
                4122,
                4178
            ],
            [
                4178,
                4334
            ],
            [
                4334,
                4490
            ],
            [
                4490,
                4699
            ],
            [
                4699,
                4834
            ],
            [
                4834,
                4911
            ],
            [
                4911,
                5033
            ],
            [
                5033,
                5160
            ],
            [
                5160,
                5300
            ],
            [
                5300,
                5546
            ],
            [
                5546,
                5561
            ],
            [
                5561,
                5688
            ],
            [
                5688,
                5839
            ],
            [
                5839,
                5892
            ],
            [
                5892,
                6047
            ],
            [
                6047,
                6269
            ],
            [
                6269,
                6292
            ],
            [
                6292,
                6341
            ],
            [
                6341,
                6426
            ],
            [
                6426,
                6492
            ],
            [
                6492,
                6583
            ],
            [
                6583,
                6728
            ],
            [
                6728,
                6869
            ],
            [
                6869,
                6893
            ],
            [
                6893,
                6941
            ],
            [
                6941,
                7028
            ],
            [
                7028,
                7068
            ],
            [
                7068,
                7141
            ],
            [
                7141,
                7366
            ],
            [
                7366,
                7431
            ],
            [
                7431,
                7556
            ],
            [
                7556,
                7602
            ],
            [
                7602,
                7619
            ],
            [
                7619,
                7642
            ],
            [
                7642,
                7650
            ],
            [
                7650,
                7696
            ],
            [
                7696,
                7757
            ],
            [
                7757,
                7816
            ],
            [
                7816,
                7828
            ],
            [
                7828,
                7954
            ],
            [
                7954,
                7977
            ],
            [
                7977,
                7999
            ],
            [
                7999,
                8031
            ],
            [
                8031,
                8127
            ],
            [
                8127,
                8162
            ],
            [
                8162,
                8225
            ],
            [
                8225,
                8284
            ],
            [
                8284,
                8577
            ]
        ],
        "overlap_chars": [
            [
                0,
                64
            ],
            [
                68,
                77
            ],
            [
                120,
                202
            ],
            [
                291,
                367
            ],
            [
                367,
                473
            ],
            [
                473,
                490
            ],
            [
                527,
                530
            ],
            [
                548,
                550
            ],
            [
                550,
                660
            ],
            [
                667,
                744
            ],
            [
                745,
                765
            ],
            [
                774,
                776
            ],
            [
                776,
                786
            ],
            [
                828,
                831
            ],
            [
                803,
                823
            ],
            [
                842,
                875
            ],
            [
                883,
                925
            ],
            [
                943,
                962
            ],
            [
                962,
                978
            ],
            [
                990,
                1008
            ],
            [
                1041,
                1045
            ],
            [
                1019,
                1036
            ],
            [
                1052,
                1081
            ],
            [
                1081,
                1101
            ],
            [
                1101,
                1134
            ],
            [
                1134,
                1221
            ],
            [
                1221,
                1312
            ],
            [
                1312,
                1400
            ],
            [
                1400,
                1443
            ],
            [
                1443,
                1485
            ],
            [
                1485,
                1504
            ],
            [
                1515,
                1531
            ],
            [
                1580,
                1583
            ],
            [
                1609,
                1645
            ],
            [
                1645,
                1685
            ],
            [
                1685,
                1734
            ],
            [
                1734,
                1773
            ],
            [
                1821,
                1955
            ],
            [
                1963,
                2014
            ],
            [
                2014,
                2175
            ],
            [
                2313,
                2346
            ],
            [
                2347,
                2380
            ],
            [
                2380,
                2409
            ],
            [
                2501,
                2532
            ],
            [
                2549,
                2643
            ],
            [
                2643,
                2648
            ],
            [
                2657,
                2667
            ],
            [
                2673,
                2702
            ],
            [
                2732,
                2850
            ],
            [
                2850,
                2889
            ],
            [
                2911,
                2922
            ],
            [
                2928,
                2937
            ],
            [
                2946,
                2950
            ],
            [
                2898,
                2900
            ],
            [
                2973,
                2975
            ],
            [
                2975,
                2995
            ],
            [
                3073,
                3099
            ],
            [
                3145,
                3147
            ],
            [
                3147,
                3260
            ],
            [
                3278,
                3423
            ],
            [
                3774,
                3798
            ],
            [
                3804,
                3854
            ],
            [
                3854,
                3918
            ],
            [
                3956,
                4026
            ],
            [
                4122,
                4127
            ],
            [
                4128,
                4178
            ],
            [
                4178,
                4256
            ],
            [
                4263,
                4295
            ],
            [
                4332,
                4334
            ],
            [
                4334,
                4440
            ],
            [
                4463,
                4490
            ],
            [
                4490,
                4560
            ],
            [
                4574,
                4699
            ],
            [
                4699,
                4730
            ],
            [
                4777,
                4834
            ],
            [
                4834,
                4911
            ],
            [
                4911,
                5033
            ],
            [
                5033,
                5160
            ],
            [
                5160,
                5176
            ],
            [
                5189,
                5237
            ],
            [
                5247,
                5250
            ],
            [
                5254,
                5299
            ],
            [
                5561,
                5688
            ],
            [
                5688,
                5839
            ],
            [
                5839,
                5892
            ],
            [
                5892,
                5928
            ],
            [
                5930,
                5953
            ],
            [
                6011,
                6024
            ],
            [
                5983,
                6006
            ],
            [
                6028,
                6047
            ],
            [
                6047,
                6158
            ],
            [
                6188,
                6269
            ],
            [
                6269,
                6292
            ],
            [
                6292,
                6341
            ],
            [
                6341,
                6381
            ],
            [
                6412,
                6426
            ],
            [
                6426,
                6492
            ],
            [
                6492,
                6515
            ],
            [
                6541,
                6555
            ],
            [
                6560,
                6583
            ],
            [
                6647,
                6653
            ],
            [
                6658,
                6663
            ],
            [
                6669,
                6680
            ],
            [
                6686,
                6728
            ],
            [
                6869,
                6893
            ],
            [
                6893,
                6941
            ],
            [
                6965,
                6979
            ],
            [
                6984,
                7028
            ],
            [
                7028,
                7068
            ],
            [
                7068,
                7141
            ],
            [
                7141,
                7257
            ],
            [
                7267,
                7299
            ],
            [
                7344,
                7365
            ],
            [
                7369,
                7430
            ],
            [
                7431,
                7556
            ],
            [
                7556,
                7602
            ],
            [
                7602,
                7612
            ],
            [
                7617,
                7619
            ],
            [
                7650,
                7696
            ],
            [
                7696,
                7735
            ],
            [
                7737,
                7757
            ],
            [
                7757,
                7816
            ],
            [
                7816,
                7828
            ],
            [
                7828,
                7854
            ],
            [
                7865,
                7867
            ],
            [
                7872,
                7954
            ],
            [
                7956,
                7973
            ],
            [
                7974,
                7977
            ],
            [
                7977,
                7999
            ],
            [
                7999,
                8031
            ],
            [
                8031,
                8127
            ],
            [
                8127,
                8162
            ],
            [
                8162,
                8225
            ],
            [
                8225,
                8245
            ],
            [
                8282,
                8284
            ],
            [
                8284,
                8557
            ],
            [
                8559,
                8573
            ]
        ],
        "row_chars": [
            [
                0,
                64
            ],
            [
                64,
                203
            ],
            [
                203,
                249
            ],
            [
                249,
                291
            ],
            [
                291,
                367
            ],
            [
                367,
                473
            ],
            [
                473,
                550
            ],
            [
                550,
                660
            ],
            [
                660,
                776
            ],
            [
                776,
                962
            ],
            [
                962,
                1081
            ],
            [
                1081,
                1101
            ],
            [
                1101,
                1134
            ],
            [
                1134,
                1221
            ],
            [
                1221,
                1312
            ],
            [
                1312,
                1400
            ],
            [
                1400,
                1443
            ],
            [
                1443,
                1485
            ],
            [
                1485,
                1645
            ],
            [
                1645,
                1685
            ],
            [
                1685,
                1734
            ],
            [
                1734,
                2014
            ],
            [
                2014,
                2175
            ],
            [
                2175,
                2380
            ],
            [
                2380,
                2643
            ],
            [
                2643,
                2850
            ],
            [
                2850,
                2975
            ],
            [
                2975,
                3147
            ],
            [
                3147,
                3260
            ],
            [
                3260,
                3423
            ],
            [
                3423,
                3751
            ],
            [
                3751,
                3854
            ],
            [
                3854,
                4026
            ],
            [
                4026,
                4122
            ],
            [
                4122,
                4178
            ],
            [
                4178,
                4334
            ],
            [
                4334,
                4490
            ],
            [
                4490,
                4699
            ],
            [
                4699,
                4834
            ],
            [
                4834,
                4911
            ],
            [
                4911,
                5033
            ],
            [
                5033,
                5160
            ],
            [
                5160,
                5300
            ],
            [
                5300,
                5546
            ],
            [
                5546,
                5561
            ],
            [
                5561,
                5688
            ],
            [
                5688,
                5839
            ],
            [
                5839,
                5892
            ],
            [
                5892,
                6047
            ],
            [
                6047,
                6269
            ],
            [
                6269,
                6292
            ],
            [
                6292,
                6341
            ],
            [
                6341,
                6426
            ],
            [
                6426,
                6492
            ],
            [
                6492,
                6583
            ],
            [
                6583,
                6728
            ],
            [
                6728,
                6869
            ],
            [
                6869,
                6893
            ],
            [
                6893,
                6941
            ],
            [
                6941,
                7028
            ],
            [
                7028,
                7068
            ],
            [
                7068,
                7141
            ],
            [
                7141,
                7366
            ],
            [
                7366,
                7431
            ],
            [
                7431,
                7556
            ],
            [
                7556,
                7602
            ],
            [
                7602,
                7619
            ],
            [
                7619,
                7642
            ],
            [
                7642,
                7650
            ],
            [
                7650,
                7696
            ],
            [
                7696,
                7757
            ],
            [
                7757,
                7816
            ],
            [
                7816,
                7828
            ],
            [
                7828,
                7954
            ],
            [
                7954,
                7977
            ],
            [
                7977,
                7999
            ],
            [
                7999,
                8031
            ],
            [
                8031,
                8127
            ],
            [
                8127,
                8162
            ],
            [
                8162,
                8225
            ],
            [
                8225,
                8284
            ],
            [
                8284,
                8577
            ]
        ]
    },
    "abridged": {
        "text": "Full seven happy years I have been the mistress of Bleak House. My last few words are soon penned; then I and the unknown friend to whom I write will part for ever.\nThey gave my darling into my arms, and through many weeks I never left her. The little child who was to have done so much was born before the turf was planted on its father's grave. It was a boy; and we called him Richard.\nThe help that my dear counted on did come to her, though it came, in the eternal wisdom, for another purpose. To bless and restore his mother, not his father, was the errand of this baby, and its power was mighty. When I saw how the weak little hand could heal my darling's heart and raise hope within her, I felt a new sense of the tenderness of God.\nThey throve, and soon I saw my dear girl walk in my country garden with her infant in her arms. I was married then. I was the happiest of the happy.\nIt was at this time that my guardian joined us and asked Ada when she would come home.\n\"Both houses are your home, my dear,\" said he, \"but the older Bleak House claims priority. When you and my boy are strong enough to do it, come and take possession of your home.\"\nAda called him \"her dearest cousin, John.\" But he said, no, it must be guardian now. He was her guardian, and the boy's; she has called him guardian ever since. The children know him by no other name. I say the children; I have two little daughters.\nIt is difficult to believe that Charley is married to a miller in our neighbourhood; yet so it is; and even now, looking up from my desk as I write early in the morning at my window, I see the very mill beginning to go round. I hope the miller will not spoil Charley; but he is very fond of her, and Charley is rather vain of such a match, for he is well to do and was in great request. Little Emma, Charley's sister, is now exactly what Charley used to be. As to Tom, Charley's brother, he is apprenticed to the miller, and is a good bashful fellow, always falling in love with somebody and being ashamed of it.\nCaddy passed her last holidays with us and was perpetually dancing in and out of the house with the children as if she had never given a dancing-lesson in her life. Caddy keeps her own little carriage now, and lives two miles west of her former house. She works very hard, but she is more than contented. Mr. Jellyby spends his evenings at her new house with his head against the wall as he used to do in her old one. Mrs. Jellyby was understood to suffer great mortification from her daughter's ignoble marriage and pursuits, but I hope she got over it in time. Caddy's poor little girl is not such a mite now, but she is deaf and dumb. I believe there never was a better mother than Caddy, who learns innumerable deaf and dumb arts to soften the affliction of her child.\nAs for Peepy, he is in the Custom House, and doing extremely well. Old Mr. Turveydrop, very apoplectic, still exhibits his deportment about town, and enjoys himself in the old manner. He is constant in his patronage of Peepy and is understood to have bequeathed him a favourite French clock, which is not his property.\nWith the first money we saved at home, we added to our pretty house by building a little growlery expressly for my guardian, which we inaugurated with great splendour the next time he came down to see us. I try to write all this lightly, but when I write of him, my tears will have their way.\nI never look at him but I hear our poor dear Richard calling him a good man. To Ada and her pretty boy, he is the fondest father; to me he is what he has ever been, and what name can I give to that? He is my husband's best and dearest friend, he is our children's darling, he is the object of our deepest love and veneration. Yet while I feel as if he were a superior being, I am so familiar and easy with him that I almost wonder at myself.\nI have never known the wind to be in the east for a single moment since the day when he took me to the porch to read the name. I remarked to him once that the wind seemed never in the east now, and he said, no, truly; it had finally departed from that quarter on that very day.\nI think my darling girl is more beautiful than ever. The sorrow that has been in her face - for it is not there now - seems to have given its innocent expression a diviner quality. Sometimes when I raise my eyes and see her in the black dress that she still wears, teaching my Richard, I feel as if it were so good to know that she remembers her dear Esther in her prayers.\nI call him my Richard! But he says that he has two mamas, and I am one.\nWe are not rich in the bank, but we have quite enough. I never walk out with my husband but I hear the people bless him. I never go into a house without hearing his praises or seeing them in grateful eyes. Every day he alleviates pain and soothes some fellow-creature in the time of need. Is not this to be rich?\nThe people even praise me as the doctor's wife. As I go about, they make so much of me that I am quite abashed. I owe it all to him, my love, my pride! They like me for his sake, as I do everything I do in life for his sake.\nA night or two ago, after bustling about preparing for my darling and my guardian and little Richard, who are coming tomorrow, I was sitting out in the porch when Allan came home.\nHe said, \"My precious little woman, what are you doing here?\"\nAnd I said, \"The moon is shining so brightly, Allan, and the night is so delicious, that I have been sitting here thinking.\"\n\"What have you been thinking about, my dear?\" said Allan.\n\"I am almost ashamed to tell you, but I will. I have been thinking about my old looks - such as they were.\"\n\"And what have you been thinking about them, my busy bee?\" said Allan.\n\"I have been thinking that it seems impossible that you could have loved me any better, even if I had retained them.\"\n\"Such as they were?\" said Allan, laughing.\n\"Such as they were, of course.\"\n\"My dear Dame Durden,\" said Allan, drawing my arm through his, \"do you ever look in the glass?\"\n\"You know I do; you see me do it.\"\n\"And don't you know that you are prettier than you ever were?\"\n\"I did not know that. But I know that my dearest little pets are very pretty, and that my darling is very beautiful, and that my husband is very handsome, and that my guardian has the brightest and most benevolent face that ever was seen, and that they can very well do without much beauty in me - even supposing-\"",
        "paragraph_chars": [
            [
                0,
                165
            ],
            [
                165,
                388
            ],
            [
                388,
                740
            ],
            [
                740,
                889
            ],
            [
                889,
                976
            ],
            [
                976,
                1155
            ],
            [
                1155,
                1405
            ],
            [
                1405,
                2018
            ],
            [
                2018,
                2791
            ],
            [
                2791,
                3110
            ],
            [
                3110,
                3403
            ],
            [
                3403,
                3845
            ],
            [
                3845,
                4123
            ],
            [
                4123,
                4497
            ],
            [
                4497,
                4569
            ],
            [
                4569,
                4882
            ],
            [
                4882,
                5107
            ],
            [
                5107,
                5287
            ],
            [
                5287,
                5349
            ],
            [
                5349,
                5474
            ],
            [
                5474,
                5532
            ],
            [
                5532,
                5640
            ],
            [
                5640,
                5711
            ],
            [
                5711,
                5829
            ],
            [
                5829,
                5872
            ],
            [
                5872,
                5904
            ],
            [
                5904,
                6000
            ],
            [
                6000,
                6035
            ],
            [
                6035,
                6098
            ],
            [
                6098,
                6412
            ]
        ],
        "segment_chars": [
            [
                0,
                64
            ],
            [
                64,
                165
            ],
            [
                165,
                241
            ],
            [
                241,
                347
            ],
            [
                347,
                388
            ],
            [
                388,
                498
            ],
            [
                498,
                602
            ],
            [
                602,
                740
            ],
            [
                740,
                836
            ],
            [
                836,
                856
            ],
            [
                856,
                889
            ],
            [
                889,
                976
            ],
            [
                976,
                1067
            ],
            [
                1067,
                1155
            ],
            [
                1155,
                1198
            ],
            [
                1198,
                1240
            ],
            [
                1240,
                1316
            ],
            [
                1316,
                1356
            ],
            [
                1356,
                1405
            ],
            [
                1405,
                1631
            ],
            [
                1631,
                1792
            ],
            [
                1792,
                1863
            ],
            [
                1863,
                2018
            ],
            [
                2018,
                2183
            ],
            [
                2183,
                2270
            ],
            [
                2270,
                2323
            ],
            [
                2323,
                2436
            ],
            [
                2436,
                2581
            ],
            [
                2581,
                2656
            ],
            [
                2656,
                2791
            ],
            [
                2791,
                2858
            ],
            [
                2858,
                2975
            ],
            [
                2975,
                3110
            ],
            [
                3110,
                3315
            ],
            [
                3315,
                3403
            ],
            [
                3403,
                3480
            ],
            [
                3480,
                3602
            ],
            [
                3602,
                3729
            ],
            [
                3729,
                3845
            ],
            [
                3845,
                3972
            ],
            [
                3972,
                4123
            ],
            [
                4123,
                4176
            ],
            [
                4176,
                4304
            ],
            [
                4304,
                4497
            ],
            [
                4497,
                4520
            ],
            [
                4520,
                4569
            ],
            [
                4569,
                4624
            ],
            [
                4624,
                4690
            ],
            [
                4690,
                4775
            ],
            [
                4775,
                4858
            ],
            [
                4858,
                4882
            ],
            [
                4882,
                4930
            ],
            [
                4930,
                4994
            ],
            [
                4994,
                5034
            ],
            [
                5034,
                5107
            ],
            [
                5107,
                5287
            ],
            [
                5287,
                5349
            ],
            [
                5349,
                5474
            ],
            [
                5474,
                5520
            ],
            [
                5520,
                5532
            ],
            [
                5532,
                5578
            ],
            [
                5578,
                5640
            ],
            [
                5640,
                5699
            ],
            [
                5699,
                5711
            ],
            [
                5711,
                5829
            ],
            [
                5829,
                5850
            ],
            [
                5850,
                5872
            ],
            [
                5872,
                5904
            ],
            [
                5904,
                6000
            ],
            [
                6000,
                6035
            ],
            [
                6035,
                6098
            ],
            [
                6098,
                6120
            ],
            [
                6120,
                6412
            ]
        ],
        "overlap_chars": [
            [
                0,
                64
            ],
            [
                72,
                81
            ],
            [
                82,
                164
            ],
            [
                165,
                241
            ],
            [
                241,
                347
            ],
            [
                347,
                364
            ],
            [
                375,
                378
            ],
            [
                386,
                388
            ],
            [
                388,
                498
            ],
            [
                498,
                575
            ],
            [
                580,
                600
            ],
            [
                600,
                602
            ],
            [
                602,
                612
            ],
            [
                613,
                616
            ],
            [
                617,
                637
            ],
            [
                638,
                671
            ],
            [
                678,
                720
            ],
            [
                721,
                740
            ],
            [
                740,
                756
            ],
            [
                762,
                780
            ],
            [
                781,
                785
            ],
            [
                789,
                806
            ],
            [
                807,
                836
            ],
            [
                836,
                856
            ],
            [
                856,
                889
            ],
            [
                889,
                976
            ],
            [
                976,
                1067
            ],
            [
                1067,
                1155
            ],
            [
                1155,
                1198
            ],
            [
                1198,
                1240
            ],
            [
                1240,
                1259
            ],
            [
                1259,
                1275
            ],
            [
                1276,
                1279
            ],
            [
                1280,
                1316
            ],
            [
                1316,
                1356
            ],
            [
                1356,
                1405
            ],
            [
                1405,
                1444
            ],
            [
                1445,
                1579
            ],
            [
                1580,
                1631
            ],
            [
                1631,
                1792
            ],
            [
                1792,
                1825
            ],
            [
                1830,
                1863
            ],
            [
                1863,
                1892
            ],
            [
                1893,
                1924
            ],
            [
                1924,
                2018
            ],
            [
                2018,
                2023
            ],
            [
                2024,
                2034
            ],
            [
                2035,
                2064
            ],
            [
                2065,
                2183
            ],
            [
                2183,
                2222
            ],
            [
                2222,
                2233
            ],
            [
                2234,
                2243
            ],
            [
                2244,
                2248
            ],
            [
                2249,
                2251
            ],
            [
                2268,
                2270
            ],
            [
                2270,
                2290
            ],
            [
                2295,
                2321
            ],
            [
                2321,
                2323
            ],
            [
                2323,
                2436
            ],
            [
                2436,
                2581
            ],
            [
                2581,
                2605
            ],
            [
                2606,
                2656
            ],
            [
                2656,
                2720
            ],
            [
                2721,
                2791
            ],
            [
                2798,
                2803
            ],
            [
                2808,
                2858
            ],
            [
                2858,
                2936
            ],
            [
                2941,
                2973
            ],
            [
                2973,
                2975
            ],
            [
                2975,
                3081
            ],
            [
                3083,
                3110
            ],
            [
                3110,
                3180
            ],
            [
                3190,
                3315
            ],
            [
                3315,
                3346
            ],
            [
                3346,
                3403
            ],
            [
                3403,
                3480
            ],
            [
                3480,
                3602
            ],
            [
                3602,
                3729
            ],
            [
                3729,
                3745
            ],
            [
                3746,
                3794
            ],
            [
                3795,
                3798
            ],
            [
                3799,
                3844
            ],
            [
                3845,
                3972
            ],
            [
                3972,
                4123
            ],
            [
                4123,
                4176
            ],
            [
                4176,
                4212
            ],
            [
                4215,
                4238
            ],
            [
                4247,
                4260
            ],
            [
                4261,
                4284
            ],
            [
                4285,
                4304
            ],
            [
                4304,
                4415
            ],
            [
                4416,
                4497
            ],
            [
                4497,
                4520
            ],
            [
                4520,
                4569
            ],
            [
                4569,
                4609
            ],
            [
                4610,
                4624
            ],
            [
                4624,
                4690
            ],
            [
                4690,
                4713
            ],
            [
                4730,
                4744
            ],
            [
                4752,
                4775
            ],
            [
                4781,
                4787
            ],
            [
                4788,
                4793
            ],
            [
                4799,
                4810
            ],
            [
                4816,
                4858
            ],
            [
                4858,
                4882
            ],
            [
                4882,
                4930
            ],
            [
                4930,
                4944
            ],
            [
                4950,
                4994
            ],
            [
                4994,
                5034
            ],
            [
                5034,
                5107
            ],
            [
                5107,
                5223
            ],
            [
                5232,
                5264
            ],
            [
                5265,
                5286
            ],
            [
                5287,
                5348
            ],
            [
                5349,
                5474
            ],
            [
                5474,
                5520
            ],
            [
                5520,
                5530
            ],
            [
                5530,
                5532
            ],
            [
                5532,
                5578
            ],
            [
                5578,
                5617
            ],
            [
                5620,
                5640
            ],
            [
                5640,
                5699
            ],
            [
                5699,
                5711
            ],
            [
                5711,
                5737
            ],
            [
                5738,
                5740
            ],
            [
                5747,
                5829
            ],
            [
                5830,
                5847
            ],
            [
                5847,
                5850
            ],
            [
                5850,
                5872
            ],
            [
                5872,
                5904
            ],
            [
                5904,
                6000
            ],
            [
                6000,
                6035
            ],
            [
                6035,
                6098
            ],
            [
                6098,
                6118
            ],
            [
                6118,
                6120
            ],
            [
                6120,
                6393
            ],
            [
                6396,
                6410
            ]
        ],
        "row_chars": [
            [
                0,
                64
            ],
            [
                64,
                165
            ],
            [
                165,
                165
            ],
            [
                165,
                165
            ],
            [
                165,
                241
            ],
            [
                241,
                347
            ],
            [
                347,
                388
            ],
            [
                388,
                498
            ],
            [
                498,
                602
            ],
            [
                602,
                740
            ],
            [
                740,
                836
            ],
            [
                836,
                856
            ],
            [
                856,
                889
            ],
            [
                889,
                976
            ],
            [
                976,
                1067
            ],
            [
                1067,
                1155
            ],
            [
                1155,
                1198
            ],
            [
                1198,
                1240
            ],
            [
                1240,
                1316
            ],
            [
                1316,
                1356
            ],
            [
                1356,
                1405
            ],
            [
                1405,
                1631
            ],
            [
                1631,
                1792
            ],
            [
                1792,
                1863
            ],
            [
                1863,
                2018
            ],
            [
                2018,
                2183
            ],
            [
                2183,
                2270
            ],
            [
                2270,
                2323
            ],
            [
                2323,
                2436
            ],
            [
                2436,
                2581
            ],
            [
                2581,
                2581
            ],
            [
                2581,
                2656
            ],
            [
                2656,
                2791
            ],
            [
                2791,
                2791
            ],
            [
                2791,
                2858
            ],
            [
                2858,
                2975
            ],
            [
                2975,
                3110
            ],
            [
                3110,
                3315
            ],
            [
                3315,
                3403
            ],
            [
                3403,
                3480
            ],
            [
                3480,
                3602
            ],
            [
                3602,
                3729
            ],
            [
                3729,
                3845
            ],
            [
                3845,
                3845
            ],
            [
                3845,
                3845
            ],
            [
                3845,
                3972
            ],
            [
                3972,
                4123
            ],
            [
                4123,
                4176
            ],
            [
                4176,
                4304
            ],
            [
                4304,
                4497
            ],
            [
                4497,
                4520
            ],
            [
                4520,
                4569
            ],
            [
                4569,
                4624
            ],
            [
                4624,
                4690
            ],
            [
                4690,
                4775
            ],
            [
                4775,
                4858
            ],
            [
                4858,
                4858
            ],
            [
                4858,
                4882
            ],
            [
                4882,
                4930
            ],
            [
                4930,
                4994
            ],
            [
                4994,
                5034
            ],
            [
                5034,
                5107
            ],
            [
                5107,
                5287
            ],
            [
                5287,
                5349
            ],
            [
                5349,
                5474
            ],
            [
                5474,
                5520
            ],
            [
                5520,
                5532
            ],
            [
                5532,
                5532
            ],
            [
                5532,
                5532
            ],
            [
                5532,
                5578
            ],
            [
                5578,
                5640
            ],
            [
                5640,
                5699
            ],
            [
                5699,
                5711
            ],
            [
                5711,
                5829
            ],
            [
                5829,
                5850
            ],
            [
                5850,
                5872
            ],
            [
                5872,
                5904
            ],
            [
                5904,
                6000
            ],
            [
                6000,
                6035
            ],
            [
                6035,
                6098
            ],
            [
                6098,
                6120
            ],
            [
                6120,
                6412
            ]
        ]
    }
}