{
    "original": {
        "text": "While Esther sleeps, and while Esther wakes, it is still wet weather down at the place in Lincolnshire. The rain is ever falling--drip, drip, drip--by day and night upon the broad flagged terrace-pavement, the Ghost's Walk. The weather is so very bad down in Lincolnshire that the liveliest imagination can scarcely apprehend its ever being fine again. Not that there is any superabundant life of imagination on the spot, for Sir Leicester is not here (and, truly, even if he were, would not do much for it in that particular), but is in Paris with my Lady; and solitude, with dusky wings, sits brooding upon Chesney Wold.\nThere may be some motions of fancy among the lower animals at Chesney Wold. The horses in the stables--the long stables in a barren, red-brick court-yard, where there is a great bell in a turret, and a clock with a large face, which the pigeons who live near it and who love to perch upon its shoulders seem to be always consulting--THEY may contemplate some mental pictures of fine weather on occasions, and may be better artists at them than the grooms. The old roan, so famous for cross-country work, turning his large eyeball to the grated window near his rack, may remember the fresh leaves that glisten there at other times and the scents that stream in, and may have a fine run with the hounds, while the human helper, clearing out the next stall, never stirs beyond his pitchfork and birch-broom. The grey, whose place is opposite the door and who with an impatient rattle of his halter pricks his ears and turns his head so wistfully when it is opened, and to whom the opener says, \"Woa grey, then, steady! Noabody wants you to-day!\" may know it quite as well as the man. The whole seemingly monotonous and uncompanionable half-dozen, stabled together, may pass the long wet hours when the door is shut in livelier communication than is held in the servants' hall or at the Dedlock Arms, or may even beguile the time by improving (perhaps corrupting) the pony in the loose-box in the corner.\nSo the mastiff, dozing in his kennel in the court-yard with his large head on his paws, may think of the hot sunshine when the shadows of the stable-buildings tire his patience out by changing and leave him at one time of the day no broader refuge than the shadow of his own house, where he sits on end, panting and growling short, and very much wanting something to worry besides himself and his chain. So now, half-waking and all-winking, he may recall the house full of company, the coach-houses full of vehicles, the stables full of horses, and the out-buildings full of attendants upon horses, until he is undecided about the present and comes forth to see how it is. Then, with that impatient shake of himself, he may growl in the spirit, \"Rain, rain, rain! Nothing but rain--and no family here!\" as he goes in again and lies down with a gloomy yawn.\nSo with the dogs in the kennel-buildings across the park, who have their restless fits and whose doleful voices when the wind has been very obstinate have even made it known in the house itself--upstairs, downstairs, and in my Lady's chamber. They may hunt the whole country-side, while the raindrops are pattering round their inactivity. So the rabbits with their self-betraying tails, frisking in and out of holes at roots of trees, may be lively with ideas of the breezy days when their ears are blown about or of those seasons of interest when there are sweet young plants to gnaw. The turkey in the poultry-yard, always troubled with a class-grievance (probably Christmas), may be reminiscent of that summer morning wrongfully taken from him when he got into the lane among the felled trees, where there was a barn and barley. The discontented goose, who stoops to pass under the old gateway, twenty feet high, may gabble out, if we only knew it, a waddling preference for weather when the gateway casts its shadow on the ground.\nBe this as it may, there is not much fancy otherwise stirring at Chesney Wold. If there be a little at any odd moment, it goes, like a little noise in that old echoing place, a long way and usually leads off to ghosts and mystery.\nIt has rained so hard and rained so long down in Lincolnshire that Mrs. Rouncewell, the old housekeeper at Chesney Wold, has several times taken off her spectacles and cleaned them to make certain that the drops were not upon the glasses. Mrs. Rouncewell might have been sufficiently assured by hearing the rain, but that she is rather deaf, which nothing will induce her to believe. She is a fine old lady, handsome, stately, wonderfully neat, and has such a back and such a stomacher that if her stays should turn out when she dies to have been a broad old-fashioned family fire-grate, nobody who knows her would have cause to be surprised. Weather affects Mrs. Rouncewell little. The house is there in all weathers, and the house, as she expresses it, \"is what she looks at.\" She sits in her room (in a side passage on the ground floor, with an arched window commanding a smooth quadrangle, adorned at regular intervals with smooth round trees and smooth round blocks of stone, as if the trees were going to play at bowls with the stones), and the whole house reposes on her mind. She can open it on occasion and be busy and fluttered, but it is shut up now and lies on the breadth of Mrs. Rouncewell's iron-bound bosom in a majestic sleep.\nIt is the next difficult thing to an impossibility to imagine Chesney Wold without Mrs. Rouncewell, but she has only been here fifty years. Ask her how long, this rainy day, and she shall answer \"fifty year, three months, and a fortnight, by the blessing of heaven, if I live till Tuesday.\" Mr. Rouncewell died some time before the decease of the pretty fashion of pig-tails, and modestly hid his own (if he took it with him) in a corner of the churchyard in the park near the mouldy porch. He was born in the market-town, and so was his young widow. Her progress in the family began in the time of the last Sir Leicester and originated in the still-room.\nThe present representative of the Dedlocks is an excellent master. He supposes all his dependents to be utterly bereft of individual characters, intentions, or opinions, and is persuaded that he was born to supersede the necessity of their having any. If he were to make a discovery to the contrary, he would be simply stunned--would never recover himself, most likely, except to gasp and die. But he is an excellent master still, holding it a part of his state to be so. He has a great liking for Mrs. Rouncewell; he says she is a most respectable, creditable woman. He always shakes hands with her when he comes down to Chesney Wold and when he goes away; and if he were very ill, or if he were knocked down by accident, or run over, or placed in any situation expressive of a Dedlock at a disadvantage, he would say if he could speak, \"Leave me, and send Mrs. Rouncewell here!\" feeling his dignity, at such a pass, safer with her than with anybody else.\nMrs. Rouncewell has known trouble. She has had two sons, of whom the younger ran wild, and went for a soldier, and never came back. Even to this hour, Mrs. Rouncewell's calm hands lose their composure when she speaks of him, and unfolding themselves from her stomacher, hover about her in an agitated manner as she says what a likely lad, what a fine lad, what a gay, good-humoured, clever lad he was! Her second son would have been provided for at Chesney Wold and would have been made steward in due season, but he took, when he was a schoolboy, to constructing steam-engines out of saucepans and setting birds to draw their own water with the least possible amount of labour, so assisting them with artful contrivance of hydraulic pressure that a thirsty canary had only, in a literal sense, to put his shoulder to the wheel and the job was done. This propensity gave Mrs. Rouncewell great uneasiness. She felt it with a mother's anguish to be a move in the Wat Tyler direction, well knowing that Sir Leicester had that general impression of an aptitude for any art to which smoke and a tall chimney might be considered essential. But the doomed young rebel (otherwise a mild youth, and very persevering), showing no sign of grace as he got older but, on the contrary, constructing a model of a power-loom, she was fain, with many tears, to mention his backslidings to the baronet. \"Mrs. Rouncewell,\" said Sir Leicester, \"I can never consent to argue, as you know, with any one on any subject. You had better get rid of your boy; you had better get him into some Works. The iron country farther north is, I suppose, the congenial direction for a boy with these tendencies.\" Farther north he went, and farther north he grew up; and if Sir Leicester Dedlock ever saw him when he came to Chesney Wold to visit his mother, or ever thought of him afterwards, it is certain that he only regarded him as one of a body of some odd thousand conspirators, swarthy and grim, who were in the habit of turning out by torchlight two or three nights in the week for unlawful purposes.\nNevertheless, Mrs. Rouncewell's son has, in the course of nature and art, grown up, and established himself, and married, and called unto him Mrs. Rouncewell's grandson, who, being out of his apprenticeship, and home from a journey in far countries, whither he was sent to enlarge his knowledge and complete his preparations for the venture of this life, stands leaning against the chimney-piece this very day in Mrs. Rouncewell's room at Chesney Wold.\n\"And, again and again, I am glad to see you, Watt! And, once again, I am glad to see you, Watt!\" says Mrs. Rouncewell. \"You are a fine young fellow. You are like your poor uncle George. Ah!\" Mrs. Rouncewell's hands unquiet, as usual, on this reference.\n\"They say I am like my father, grandmother.\"\n\"Like him, also, my dear--but most like your poor uncle George! And your dear father.\" Mrs. Rouncewell folds her hands again. \"He is well?\"\n\"Thriving, grandmother, in every way.\"\n\"I am thankful!\" Mrs. Rouncewell is fond of her son but has a plaintive feeling towards him, much as if he were a very honourable soldier who had gone over to the enemy.\n\"He is quite happy?\" says she.\n\"Quite.\"\n\"I am thankful! So he has brought you up to follow in his ways and has sent you into foreign countries and the like? Well, he knows best. There may be a world beyond Chesney Wold that I don't understand. Though I am not young, either. And I have seen a quantity of good company too!\"\n\"Grandmother,\" says the young man, changing the subject, \"what a very pretty girl that was I found with you just now. You called her Rosa?\"\n\"Yes, child. She is daughter of a widow in the village. Maids are so hard to teach, now-a-days, that I have put her about me young. She's an apt scholar and will do well. She shows the house already, very pretty. She lives with me at my table here.\"\n\"I hope I have not driven her away?\"\n\"She supposes we have family affairs to speak about, I dare say. She is very modest. It is a fine quality in a young woman. And scarcer,\" says Mrs. Rouncewell, expanding her stomacher to its utmost limits, \"than it formerly was!\"\nThe young man inclines his head in acknowledgment of the precepts of experience. Mrs. Rouncewell listens.\n\"Wheels!\" says she. They have long been audible to the younger ears of her companion. \"What wheels on such a day as this, for gracious sake?\"\nAfter a short interval, a tap at the door. \"Come in!\" A dark-eyed, dark-haired, shy, village beauty comes in--so fresh in her rosy and yet delicate bloom that the drops of rain which have beaten on her hair look like the dew upon a flower fresh gathered.\n\"What company is this, Rosa?\" says Mrs. Rouncewell.\n\"It's two young men in a gig, ma'am, who want to see the house--yes, and if you please, I told them so!\" in quick reply to a gesture of dissent from the housekeeper. \"I went to the hall-door and told them it was the wrong day and the wrong hour, but the young man who was driving took off his hat in the wet and begged me to bring this card to you.\"\n\"Read it, my dear Watt,\" says the housekeeper.\nRosa is so shy as she gives it to him that they drop it between them and almost knock their foreheads together as they pick it up. Rosa is shyer than before.\n\"Mr. Guppy\" is all the information the card yields.\n\"Guppy!\" repeats Mrs. Rouncewell, \"MR. Guppy! Nonsense, I never heard of him!\"\n\"If you please, he told ME that!\" says Rosa. \"But he said that he and the other young gentleman came from London only last night by the mail, on business at the magistrates' meeting, ten miles off, this morning, and that as their business was soon over, and they had heard a great deal said of Chesney Wold, and really didn't know what to do with themselves, they had come through the wet to see it. They are lawyers. He says he is not in Mr. Tulkinghorn's office, but he is sure he may make use of Mr. Tulkinghorn's name if necessary.\" Finding, now she leaves off, that she has been making quite a long speech, Rosa is shyer than ever.\nNow, Mr. Tulkinghorn is, in a manner, part and parcel of the place, and besides, is supposed to have made Mrs. Rouncewell's will. The old lady relaxes, consents to the admission of the visitors as a favour, and dismisses Rosa. The grandson, however, being smitten by a sudden wish to see the house himself, proposes to join the party. The grandmother, who is pleased that he should have that interest, accompanies him--though to do him justice, he is exceedingly unwilling to trouble her.\n\"Much obliged to you, ma'am!\" says Mr. Guppy, divesting himself of his wet dreadnought in the hall. \"Us London lawyers don't often get an out, and when we do, we like to make the most of it, you know.\"\nThe old housekeeper, with a gracious severity of deportment, waves her hand towards the great staircase. Mr. Guppy and his friend follow Rosa; Mrs. Rouncewell and her grandson follow them; a young gardener goes before to open the shutters.\nAs is usually the case with people who go over houses, Mr. Guppy and his friend are dead beat before they have well begun. They straggle about in wrong places, look at wrong things, don't care for the right things, gape when more rooms are opened, exhibit profound depression of spirits, and are clearly knocked up. In each successive chamber that they enter, Mrs. Rouncewell, who is as upright as the house itself, rests apart in a window-seat or other such nook and listens with stately approval to Rosa's exposition. Her grandson is so attentive to it that Rosa is shyer than ever--and prettier. Thus they pass on from room to room, raising the pictured Dedlocks for a few brief minutes as the young gardener admits the light, and reconsigning them to their graves as he shuts it out again. It appears to the afflicted Mr. Guppy and his inconsolable friend that there is no end to the Dedlocks, whose family greatness seems to consist in their never having done anything to distinguish themselves for seven hundred years.\nEven the long drawing-room of Chesney Wold cannot revive Mr. Guppy's spirits. He is so low that he droops on the threshold and has hardly strength of mind to enter. But a portrait over the chimney-piece, painted by the fashionable artist of the day, acts upon him like a charm. He recovers in a moment. He stares at it with uncommon interest; he seems to be fixed and fascinated by it.\n\"Dear me!\" says Mr. Guppy. \"Who's that?\"\n\"The picture over the fire-place,\" says Rosa, \"is the portrait of the present Lady Dedlock. It is considered a perfect likeness, and the best work of the master.\"\n\"Blest,\" says Mr. Guppy, staring in a kind of dismay at his friend, \"if I can ever have seen her. Yet I know her! Has the picture been engraved, miss?\"\n\"The picture has never been engraved. Sir Leicester has always refused permission.\"\n\"Well!\" says Mr. Guppy in a low voice. \"I'll be shot if it ain't very curious how well I know that picture! So that's Lady Dedlock, is it!\"\n\"The picture on the right is the present Sir Leicester Dedlock. The picture on the left is his father, the late Sir Leicester.\"\nMr. Guppy has no eyes for either of these magnates. \"It's unaccountable to me,\" he says, still staring at the portrait, \"how well I know that picture! I'm dashed,\" adds Mr. Guppy, looking round, \"if I don't think I must have had a dream of that picture, you know!\"\nAs no one present takes any especial interest in Mr. Guppy's dreams, the probability is not pursued. But he still remains so absorbed by the portrait that he stands immovable before it until the young gardener has closed the shutters, when he comes out of the room in a dazed state that is an odd though a sufficient substitute for interest and follows into the succeeding rooms with a confused stare, as if he were looking everywhere for Lady Dedlock again.\nHe sees no more of her. He sees her rooms, which are the last shown, as being very elegant, and he looks out of the windows from which she looked out, not long ago, upon the weather that bored her to death. All things have an end, even houses that people take infinite pains to see and are tired of before they begin to see them. He has come to the end of the sight, and the fresh village beauty to the end of her description; which is always this: \"The terrace below is much admired. It is called, from an old story in the family, the Ghost's Walk.\"\n\"No?\" says Mr. Guppy, greedily curious. \"What's the story, miss? Is it anything about a picture?\"\n\"Pray tell us the story,\" says Watt in a half whisper.\n\"I don't know it, sir.\" Rosa is shyer than ever.\n\"It is not related to visitors; it is almost forgotten,\" says the housekeeper, advancing. \"It has never been more than a family anecdote.\"\n\"You'll excuse my asking again if it has anything to do with a picture, ma'am,\" observes Mr. Guppy, \"because I do assure you that the more I think of that picture the better I know it, without knowing how I know it!\"\nThe story has nothing to do with a picture; the housekeeper can guarantee that. Mr. Guppy is obliged to her for the information and is, moreover, generally obliged. He retires with his friend, guided down another staircase by the young gardener, and presently is heard to drive away. It is now dusk. Mrs. Rouncewell can trust to the discretion of her two young hearers and may tell THEM how the terrace came to have that ghostly name.\nShe seats herself in a large chair by the fast-darkening window and tells them: \"In the wicked days, my dears, of King Charles the First--I mean, of course, in the wicked days of the rebels who leagued themselves against that excellent king--Sir Morbury Dedlock was the owner of Chesney Wold. Whether there was any account of a ghost in the family before those days, I can't say. I should think it very likely indeed.\"\nMrs. Rouncewell holds this opinion because she considers that a family of such antiquity and importance has a right to a ghost. She regards a ghost as one of the privileges of the upper classes, a genteel distinction to which the common people have no claim.\n\"Sir Morbury Dedlock,\" says Mrs. Rouncewell, \"was, I have no occasion to say, on the side of the blessed martyr. But it IS supposed that his Lady, who had none of the family blood in her veins, favoured the bad cause. It is said that she had relations among King Charles's enemies, that she was in correspondence with them, and that she gave them information. When any of the country gentlemen who followed his Majesty's cause met here, it is said that my Lady was always nearer to the door of their council-room than they supposed. Do you hear a sound like a footstep passing along the terrace, Watt?\"\nRosa draws nearer to the housekeeper.\n\"I hear the rain-drip on the stones,\" replies the young man, \"and I hear a curious echo--I suppose an echo--which is very like a halting step.\"\nThe housekeeper gravely nods and continues: \"Partly on account of this division between them, and partly on other accounts, Sir Morbury and his Lady led a troubled life. She was a lady of a haughty temper. They were not well suited to each other in age or character, and they had no children to moderate between them. After her favourite brother, a young gentleman, was killed in the civil wars (by Sir Morbury's near kinsman), her feeling was so violent that she hated the race into which she had married. When the Dedlocks were about to ride out from Chesney Wold in the king's cause, she is supposed to have more than once stolen down into the stables in the dead of night and lamed their horses; and the story is that once at such an hour, her husband saw her gliding down the stairs and followed her into the stall where his own favourite horse stood. There he seized her by the wrist, and in a struggle or in a fall or through the horse being frightened and lashing out, she was lamed in the hip and from that hour began to pine away.\"\nThe housekeeper has dropped her voice to a little more than a whisper.\n\"She had been a lady of a handsome figure and a noble carriage. She never complained of the change; she never spoke to any one of being crippled or of being in pain, but day by day she tried to walk upon the terrace, and with the help of the stone balustrade, went up and down, up and down, up and down, in sun and shadow, with greater difficulty every day. At last, one afternoon her husband (to whom she had never, on any persuasion, opened her lips since that night), standing at the great south window, saw her drop upon the pavement. He hastened down to raise her, but she repulsed him as he bent over her, and looking at him fixedly and coldly, said, 'I will die here where I have walked. And I will walk here, though I am in my grave. I will walk here until the pride of this house is humbled. And when calamity or when disgrace is coming to it, let the Dedlocks listen for my step!'\"\nWatt looks at Rosa. Rosa in the deepening gloom looks down upon the ground, half frightened and half shy.\n\"There and then she died. And from those days,\" says Mrs. Rouncewell, \"the name has come down--the Ghost's Walk. If the tread is an echo, it is an echo that is only heard after dark, and is often unheard for a long while together. But it comes back from time to time; and so sure as there is sickness or death in the family, it will be heard then.\"\n\"And disgrace, grandmother--\" says Watt.\n\"Disgrace never comes to Chesney Wold,\" returns the housekeeper.\nHer grandson apologizes with \"True. True.\"\n\"That is the story. Whatever the sound is, it is a worrying sound,\" says Mrs. Rouncewell, getting up from her chair; \"and what is to be noticed in it is that it MUST BE HEARD. My Lady, who is afraid of nothing, admits that when it is there, it must be heard. You cannot shut it out. Watt, there is a tall French clock behind you (placed there, 'a purpose) that has a loud beat when it is in motion and can play music. You understand how those things are managed?\"\n\"Pretty well, grandmother, I think.\"\n\"Set it a-going.\"\nWatt sets it a-going--music and all.\n\"Now, come hither,\" says the housekeeper. \"Hither, child, towards my Lady's pillow. I am not sure that it is dark enough yet, but listen! Can you hear the sound upon the terrace, through the music, and the beat, and everything?\"\n\"I certainly can!\"\n\"So my Lady says.\"",
        "paragraph_chars": [
            [
                0,
                623
            ],
            [
                623,
                2024
            ],
            [
                2024,
                2881
            ],
            [
                2881,
                3916
            ],
            [
                3916,
                4147
            ],
            [
                4147,
                5391
            ],
            [
                5391,
                6047
            ],
            [
                6047,
                7004
            ],
            [
                7004,
                9077
            ],
            [
                9077,
                9530
            ],
            [
                9530,
                9783
            ],
            [
                9783,
                9828
            ],
            [
                9828,
                9968
            ],
            [
                9968,
                10007
            ],
            [
                10007,
                10177
            ],
            [
                10177,
                10208
            ],
            [
                10208,
                10217
            ],
            [
                10217,
                10501
            ],
            [
                10501,
                10641
            ],
            [
                10641,
                10891
            ],
            [
                10891,
                10928
            ],
            [
                10928,
                11158
            ],
            [
                11158,
                11264
            ],
            [
                11264,
                11406
            ],
            [
                11406,
                11661
            ],
            [
                11661,
                11713
            ],
            [
                11713,
                12063
            ],
            [
                12063,
                12110
            ],
            [
                12110,
                12268
            ],
            [
                12268,
                12320
            ],
            [
                12320,
                12399
            ],
            [
                12399,
                13036
            ],
            [
                13036,
                13525
            ],
            [
                13525,
                13727
            ],
            [
                13727,
                13967
            ],
            [
                13967,
                14992
            ],
            [
                14992,
                15378
            ],
            [
                15378,
                15419
            ],
            [
                15419,
                15582
            ],
            [
                15582,
                15734
            ],
            [
                15734,
                15818
            ],
            [
                15818,
                15958
            ],
            [
                15958,
                16086
            ],
            [
                16086,
                16351
            ],
            [
                16351,
                16810
            ],
            [
                16810,
                17361
            ],
            [
                17361,
                17459
            ],
            [
                17459,
                17514
            ],
            [
                17514,
                17563
            ],
            [
                17563,
                17702
            ],
            [
                17702,
                17919
            ],
            [
                17919,
                18354
            ],
            [
                18354,
                18773
            ],
            [
                18773,
                19032
            ],
            [
                19032,
                19635
            ],
            [
                19635,
                19673
            ],
            [
                19673,
                19817
            ],
            [
                19817,
                20859
            ],
            [
                20859,
                20930
            ],
            [
                20930,
                21822
            ],
            [
                21822,
                21928
            ],
            [
                21928,
                22277
            ],
            [
                22277,
                22318
            ],
            [
                22318,
                22383
            ],
            [
                22383,
                22426
            ],
            [
                22426,
                22890
            ],
            [
                22890,
                22927
            ],
            [
                22927,
                22945
            ],
            [
                22945,
                22982
            ],
            [
                22982,
                23211
            ],
            [
                23211,
                23230
            ],
            [
                23230,
                23248
            ]
        ],
        "segment_chars": [
            [
                0,
                104
            ],
            [
                104,
                224
            ],
            [
                224,
                353
            ],
            [
                353,
                623
            ],
            [
                623,
                699
            ],
            [
                699,
                1079
            ],
            [
                1079,
                1428
            ],
            [
                1428,
                1639
            ],
            [
                1639,
                1666
            ],
            [
                1666,
                1704
            ],
            [
                1704,
                2024
            ],
            [
                2024,
                2428
            ],
            [
                2428,
                2697
            ],
            [
                2697,
                2788
            ],
            [
                2788,
                2827
            ],
            [
                2827,
                2881
            ],
            [
                2881,
                3124
            ],
            [
                3124,
                3220
            ],
            [
                3220,
                3467
            ],
            [
                3467,
                3713
            ],
            [
                3713,
                3916
            ],
            [
                3916,
                3995
            ],
            [
                3995,
                4147
            ],
            [
                4147,
                4386
            ],
            [
                4386,
                4531
            ],
            [
                4531,
                4790
            ],
            [
                4790,
                4830
            ],
            [
                4830,
                4926
            ],
            [
                4926,
                5231
            ],
            [
                5231,
                5391
            ],
            [
                5391,
                5531
            ],
            [
                5531,
                5682
            ],
            [
                5682,
                5882
            ],
            [
                5882,
                5942
            ],
            [
                5942,
                6047
            ],
            [
                6047,
                6114
            ],
            [
                6114,
                6299
            ],
            [
                6299,
                6441
            ],
            [
                6441,
                6519
            ],
            [
                6519,
                6615
            ],
            [
                6615,
                6928
            ],
            [
                6928,
                7004
            ],
            [
                7004,
                7039
            ],
            [
                7039,
                7136
            ],
            [
                7136,
                7406
            ],
            [
                7406,
                7854
            ],
            [
                7854,
                7909
            ],
            [
                7909,
                8138
            ],
            [
                8138,
                8389
            ],
            [
                8389,
                8501
            ],
            [
                8501,
                8577
            ],
            [
                8577,
                8681
            ],
            [
                8681,
                9077
            ],
            [
                9077,
                9530
            ],
            [
                9530,
                9581
            ],
            [
                9581,
                9627
            ],
            [
                9627,
                9649
            ],
            [
                9649,
                9679
            ],
            [
                9679,
                9716
            ],
            [
                9716,
                9721
            ],
            [
                9721,
                9783
            ],
            [
                9783,
                9828
            ],
            [
                9828,
                9892
            ],
            [
                9892,
                9915
            ],
            [
                9915,
                9954
            ],
            [
                9954,
                9968
            ],
            [
                9968,
                10007
            ],
            [
                10007,
                10024
            ],
            [
                10024,
                10177
            ],
            [
                10177,
                10198
            ],
            [
                10198,
                10208
            ],
            [
                10208,
                10217
            ],
            [
                10217,
                10233
            ],
            [
                10233,
                10334
            ],
            [
                10334,
                10355
            ],
            [
                10355,
                10421
            ],
            [
                10421,
                10452
            ],
            [
                10452,
                10501
            ],
            [
                10501,
                10619
            ],
            [
                10619,
                10641
            ],
            [
                10641,
                10654
            ],
            [
                10654,
                10697
            ],
            [
                10697,
                10773
            ],
            [
                10773,
                10812
            ],
            [
                10812,
                10854
            ],
            [
                10854,
                10891
            ],
            [
                10891,
                10928
            ],
            [
                10928,
                10993
            ],
            [
                10993,
                11013
            ],
            [
                11013,
                11052
            ],
            [
                11052,
                11158
            ],
            [
                11158,
                11239
            ],
            [
                11239,
                11264
            ],
            [
                11264,
                11274
            ],
            [
                11274,
                11284
            ],
            [
                11284,
                11350
            ],
            [
                11350,
                11406
            ],
            [
                11406,
                11449
            ],
            [
                11449,
                11460
            ],
            [
                11460,
                11661
            ],
            [
                11661,
                11691
            ],
            [
                11691,
                11713
            ],
            [
                11713,
                11818
            ],
            [
                11818,
                11879
            ],
            [
                11879,
                12063
            ],
            [
                12063,
                12110
            ],
            [
                12110,
                12241
            ],
            [
                12241,
                12268
            ],
            [
                12268,
                12320
            ],
            [
                12320,
                12329
            ],
            [
                12329,
                12366
            ],
            [
                12366,
                12399
            ],
            [
                12399,
                12433
            ],
            [
                12433,
                12444
            ],
            [
                12444,
                12799
            ],
            [
                12799,
                12817
            ],
            [
                12817,
                12936
            ],
            [
                12936,
                13036
            ],
            [
                13036,
                13166
            ],
            [
                13166,
                13263
            ],
            [
                13263,
                13371
            ],
            [
                13371,
                13525
            ],
            [
                13525,
                13555
            ],
            [
                13555,
                13625
            ],
            [
                13625,
                13727
            ],
            [
                13727,
                13832
            ],
            [
                13832,
                13967
            ],
            [
                13967,
                14090
            ],
            [
                14090,
                14283
            ],
            [
                14283,
                14487
            ],
            [
                14487,
                14566
            ],
            [
                14566,
                14761
            ],
            [
                14761,
                14992
            ],
            [
                14992,
                15070
            ],
            [
                15070,
                15157
            ],
            [
                15157,
                15270
            ],
            [
                15270,
                15295
            ],
            [
                15295,
                15378
            ],
            [
                15378,
                15389
            ],
            [
                15389,
                15405
            ],
            [
                15405,
                15419
            ],
            [
                15419,
                15511
            ],
            [
                15511,
                15582
            ],
            [
                15582,
                15680
            ],
            [
                15680,
                15696
            ],
            [
                15696,
                15734
            ],
            [
                15734,
                15772
            ],
            [
                15772,
                15818
            ],
            [
                15818,
                15826
            ],
            [
                15826,
                15857
            ],
            [
                15857,
                15926
            ],
            [
                15926,
                15958
            ],
            [
                15958,
                16022
            ],
            [
                16022,
                16086
            ],
            [
                16086,
                16138
            ],
            [
                16138,
                16237
            ],
            [
                16237,
                16351
            ],
            [
                16351,
                16452
            ],
            [
                16452,
                16810
            ],
            [
                16810,
                16834
            ],
            [
                16834,
                17017
            ],
            [
                17017,
                17140
            ],
            [
                17140,
                17295
            ],
            [
                17295,
                17361
            ],
            [
                17361,
                17367
            ],
            [
                17367,
                17401
            ],
            [
                17401,
                17426
            ],
            [
                17426,
                17459
            ],
            [
                17459,
                17514
            ],
            [
                17514,
                17538
            ],
            [
                17538,
                17563
            ],
            [
                17563,
                17653
            ],
            [
                17653,
                17702
            ],
            [
                17702,
                17919
            ],
            [
                17919,
                17999
            ],
            [
                17999,
                18084
            ],
            [
                18084,
                18203
            ],
            [
                18203,
                18219
            ],
            [
                18219,
                18354
            ],
            [
                18354,
                18647
            ],
            [
                18647,
                18734
            ],
            [
                18734,
                18773
            ],
            [
                18773,
                18901
            ],
            [
                18901,
                19032
            ],
            [
                19032,
                19145
            ],
            [
                19145,
                19250
            ],
            [
                19250,
                19392
            ],
            [
                19392,
                19565
            ],
            [
                19565,
                19635
            ],
            [
                19635,
                19673
            ],
            [
                19673,
                19817
            ],
            [
                19817,
                19987
            ],
            [
                19987,
                20023
            ],
            [
                20023,
                20135
            ],
            [
                20135,
                20324
            ],
            [
                20324,
                20674
            ],
            [
                20674,
                20859
            ],
            [
                20859,
                20930
            ],
            [
                20930,
                20994
            ],
            [
                20994,
                21288
            ],
            [
                21288,
                21469
            ],
            [
                21469,
                21625
            ],
            [
                21625,
                21672
            ],
            [
                21672,
                21731
            ],
            [
                21731,
                21822
            ],
            [
                21822,
                21842
            ],
            [
                21842,
                21928
            ],
            [
                21928,
                21954
            ],
            [
                21954,
                22041
            ],
            [
                22041,
                22159
            ],
            [
                22159,
                22277
            ],
            [
                22277,
                22318
            ],
            [
                22318,
                22383
            ],
            [
                22383,
                22419
            ],
            [
                22419,
                22426
            ],
            [
                22426,
                22446
            ],
            [
                22446,
                22602
            ],
            [
                22602,
                22685
            ],
            [
                22685,
                22709
            ],
            [
                22709,
                22844
            ],
            [
                22844,
                22890
            ],
            [
                22890,
                22927
            ],
            [
                22927,
                22945
            ],
            [
                22945,
                22982
            ],
            [
                22982,
                23024
            ],
            [
                23024,
                23066
            ],
            [
                23066,
                23120
            ],
            [
                23120,
                23211
            ],
            [
                23211,
                23230
            ],
            [
                23230,
                23248
            ]
        ],
        "overlap_chars": [
            [
                0,
                19
            ],
            [
                43,
                104
            ],
            [
                104,
                128
            ],
            [
                134,
                146
            ],
            [
                148,
                179
            ],
            [
                188,
                224
            ],
            [
                224,
                250
            ],
            [
                272,
                276
            ],
            [
                303,
                306
            ],
            [
                326,
                353
            ],
            [
                430,
                451
            ],
            [
                420,
                421
            ],
            [
                528,
                623
            ],
            [
                699,
                716
            ],
            [
                730,
                742
            ],
            [
                961,
                976
            ],
            [
                1001,
                1026
            ],
            [
                1077,
                1079
            ],
            [
                1079,
                1092
            ],
            [
                1127,
                1144
            ],
            [
                1153,
                1159
            ],
            [
                1167,
                1182
            ],
            [
                1112,
                1113
            ],
            [
                1183,
                1218
            ],
            [
                1241,
                1252
            ],
            [
                1426,
                1428
            ],
            [
                2027,
                2078
            ],
            [
                2110,
                2141
            ],
            [
                2217,
                2220
            ],
            [
                2468,
                2567
            ],
            [
                2695,
                2697
            ],
            [
                3467,
                3497
            ],
            [
                3560,
                3563
            ],
            [
                3582,
                3601
            ],
            [
                3628,
                3653
            ],
            [
                3660,
                3663
            ],
            [
                3705,
                3713
            ],
            [
                3935,
                3994
            ],
            [
                4147,
                4168
            ],
            [
                4209,
                4386
            ],
            [
                4531,
                4590
            ],
            [
                4592,
                4595
            ],
            [
                4788,
                4790
            ],
            [
                4790,
                4830
            ],
            [
                4926,
                4946
            ],
            [
                4966,
                4986
            ],
            [
                5190,
                5231
            ],
            [
                5231,
                5307
            ],
            [
                5370,
                5391
            ],
            [
                5474,
                5489
            ],
            [
                5499,
                5502
            ],
            [
                5508,
                5531
            ],
            [
                5942,
                6012
            ],
            [
                6028,
                6047
            ],
            [
                6047,
                6058
            ],
            [
                6081,
                6084
            ],
            [
                6090,
                6114
            ],
            [
                6114,
                6133
            ],
            [
                6145,
                6190
            ],
            [
                6204,
                6215
            ],
            [
                6297,
                6299
            ],
            [
                6299,
                6373
            ],
            [
                6439,
                6441
            ],
            [
                6519,
                6595
            ],
            [
                6608,
                6615
            ],
            [
                6615,
                6729
            ],
            [
                6853,
                6865
            ],
            [
                6883,
                6886
            ],
            [
                6900,
                6928
            ],
            [
                6928,
                6947
            ],
            [
                6965,
                7004
            ],
            [
                7004,
                7039
            ],
            [
                7039,
                7046
            ],
            [
                7051,
                7136
            ],
            [
                7136,
                7228
            ],
            [
                7312,
                7323
            ],
            [
                7343,
                7406
            ],
            [
                7406,
                7436
            ],
            [
                7486,
                7498
            ],
            [
                7450,
                7465
            ],
            [
                7499,
                7598
            ],
            [
                7752,
                7753
            ],
            [
                7859,
                7869
            ],
            [
                7870,
                7909
            ],
            [
                8241,
                8243
            ],
            [
                8289,
                8317
            ],
            [
                8326,
                8347
            ],
            [
                8376,
                8388
            ],
            [
                8389,
                8429
            ],
            [
                8537,
                8577
            ],
            [
                8577,
                8626
            ],
            [
                8637,
                8681
            ],
            [
                8708,
                8715
            ],
            [
                8689,
                8703
            ],
            [
                8725,
                8732
            ],
            [
                8824,
                8825
            ],
            [
                9165,
                9197
            ],
            [
                8704,
                8707
            ],
            [
                9219,
                9250
            ],
            [
                8864,
                8866
            ],
            [
                9258,
                9325
            ],
            [
                9430,
                9530
            ],
            [
                9530,
                9531
            ],
            [
                9546,
                9579
            ],
            [
                9627,
                9649
            ],
            [
                9649,
                9679
            ],
            [
                9679,
                9716
            ],
            [
                9716,
                9721
            ],
            [
                9739,
                9744
            ],
            [
                9752,
                9783
            ],
            [
                9783,
                9828
            ],
            [
                9828,
                9852
            ],
            [
                9915,
                9954
            ],
            [
                9954,
                9965
            ],
            [
                9965,
                9968
            ],
            [
                9968,
                10007
            ],
            [
                10007,
                10021
            ],
            [
                10233,
                10238
            ],
            [
                10284,
                10334
            ],
            [
                10334,
                10355
            ],
            [
                10355,
                10419
            ],
            [
                10501,
                10619
            ],
            [
                10619,
                10641
            ],
            [
                10641,
                10654
            ],
            [
                10654,
                10697
            ],
            [
                10697,
                10706
            ],
            [
                10710,
                10724
            ],
            [
                10773,
                10812
            ],
            [
                10812,
                10821
            ],
            [
                10841,
                10845
            ],
            [
                10852,
                10854
            ],
            [
                10854,
                10871
            ],
            [
                10884,
                10891
            ],
            [
                10891,
                10928
            ],
            [
                10928,
                10993
            ],
            [
                10993,
                11011
            ],
            [
                11019,
                11052
            ],
            [
                11052,
                11063
            ],
            [
                11135,
                11157
            ],
            [
                11239,
                11263
            ],
            [
                11264,
                11274
            ],
            [
                11274,
                11284
            ],
            [
                11350,
                11406
            ],
            [
                11430,
                11449
            ],
            [
                11460,
                11466
            ],
            [
                11484,
                11514
            ],
            [
                11466,
                11467
            ],
            [
                11516,
                11531
            ],
            [
                11545,
                11582
            ],
            [
                11601,
                11644
            ],
            [
                11659,
                11661
            ],
            [
                11661,
                11691
            ],
            [
                11691,
                11713
            ],
            [
                11713,
                11775
            ],
            [
                11880,
                11881
            ],
            [
                11908,
                11992
            ],
            [
                12025,
                12063
            ],
            [
                12063,
                12110
            ],
            [
                12110,
                12240
            ],
            [
                12268,
                12278
            ],
            [
                12303,
                12311
            ],
            [
                12318,
                12320
            ],
            [
                12320,
                12329
            ],
            [
                12329,
                12352
            ],
            [
                12357,
                12358
            ],
            [
                12376,
                12399
            ],
            [
                12399,
                12433
            ],
            [
                12433,
                12444
            ],
            [
                12444,
                12539
            ],
            [
                12539,
                12580
            ],
            [
                12609,
                12684
            ],
            [
                12693,
                12705
            ],
            [
                12756,
                12799
            ],
            [
                12799,
                12817
            ],
            [
                12817,
                12870
            ],
            [
                12898,
                12913
            ],
            [
                12933,
                12935
            ],
            [
                13036,
                13078
            ],
            [
                13090,
                13166
            ],
            [
                13166,
                13187
            ],
            [
                13243,
                13246
            ],
            [
                13188,
                13203
            ],
            [
                13221,
                13229
            ],
            [
                13204,
                13213
            ],
            [
                13261,
                13263
            ],
            [
                13263,
                13275
            ],
            [
                13284,
                13371
            ],
            [
                13371,
                13387
            ],
            [
                13395,
                13402
            ],
            [
                13436,
                13453
            ],
            [
                13455,
                13461
            ],
            [
                13481,
                13525
            ],
            [
                13525,
                13555
            ],
            [
                13555,
                13570
            ],
            [
                13592,
                13599
            ],
            [
                13612,
                13625
            ],
            [
                13625,
                13659
            ],
            [
                13663,
                13727
            ],
            [
                13727,
                13752
            ],
            [
                13755,
                13772
            ],
            [
                13786,
                13832
            ],
            [
                13832,
                13914
            ],
            [
                13965,
                13967
            ],
            [
                13967,
                14046
            ],
            [
                14095,
                14112
            ],
            [
                14113,
                14125
            ],
            [
                14147,
                14181
            ],
            [
                14187,
                14214
            ],
            [
                14255,
                14270
            ],
            [
                14281,
                14283
            ],
            [
                14283,
                14290
            ],
            [
                14302,
                14343
            ],
            [
                14351,
                14382
            ],
            [
                14395,
                14411
            ],
            [
                14431,
                14487
            ],
            [
                14487,
                14515
            ],
            [
                14522,
                14550
            ],
            [
                14552,
                14566
            ],
            [
                14566,
                14580
            ],
            [
                14584,
                14602
            ],
            [
                14611,
                14632
            ],
            [
                14759,
                14761
            ],
            [
                14761,
                14774
            ],
            [
                14789,
                14806
            ],
            [
                14820,
                14850
            ],
            [
                14855,
                14863
            ],
            [
                14990,
                14992
            ],
            [
                14992,
                15070
            ],
            [
                15088,
                15114
            ],
            [
                15155,
                15157
            ],
            [
                15157,
                15194
            ],
            [
                15242,
                15270
            ],
            [
                15295,
                15378
            ],
            [
                15378,
                15389
            ],
            [
                15389,
                15393
            ],
            [
                15403,
                15405
            ],
            [
                15405,
                15419
            ],
            [
                15419,
                15420
            ],
            [
                15466,
                15509
            ],
            [
                15451,
                15463
            ],
            [
                15509,
                15511
            ],
            [
                15511,
                15572
            ],
            [
                15579,
                15582
            ],
            [
                15582,
                15583
            ],
            [
                15654,
                15659
            ],
            [
                15660,
                15678
            ],
            [
                15588,
                15606
            ],
            [
                15615,
                15634
            ],
            [
                15678,
                15680
            ],
            [
                15680,
                15696
            ],
            [
                15696,
                15716
            ],
            [
                15725,
                15734
            ],
            [
                15734,
                15735
            ],
            [
                15770,
                15772
            ],
            [
                15772,
                15815
            ],
            [
                15815,
                15818
            ],
            [
                15818,
                15826
            ],
            [
                15826,
                15857
            ],
            [
                15857,
                15858
            ],
            [
                15883,
                15895
            ],
            [
                15905,
                15926
            ],
            [
                15926,
                15955
            ],
            [
                16282,
                16351
            ],
            [
                16456,
                16458
            ],
            [
                16465,
                16535
            ],
            [
                16584,
                16585
            ],
            [
                16692,
                16695
            ],
            [
                16594,
                16615
            ],
            [
                16621,
                16626
            ],
            [
                16709,
                16774
            ],
            [
                16786,
                16810
            ],
            [
                16834,
                16845
            ],
            [
                16893,
                16900
            ],
            [
                16846,
                16878
            ],
            [
                16902,
                16933
            ],
            [
                16980,
                16983
            ],
            [
                17015,
                17016
            ],
            [
                17175,
                17176
            ],
            [
                17259,
                17295
            ],
            [
                17295,
                17361
            ],
            [
                17401,
                17424
            ],
            [
                17512,
                17514
            ],
            [
                17459,
                17494
            ],
            [
                17514,
                17538
            ],
            [
                17538,
                17563
            ],
            [
                17563,
                17564
            ],
            [
                17595,
                17653
            ],
            [
                17653,
                17702
            ],
            [
                17702,
                17726
            ],
            [
                17733,
                17810
            ],
            [
                17832,
                17906
            ],
            [
                17916,
                17919
            ],
            [
                17919,
                17961
            ],
            [
                17997,
                17999
            ],
            [
                18087,
                18110
            ],
            [
                18163,
                18202
            ],
            [
                18203,
                18219
            ],
            [
                18219,
                18234
            ],
            [
                18266,
                18287
            ],
            [
                18306,
                18354
            ],
            [
                18354,
                18421
            ],
            [
                18432,
                18433
            ],
            [
                18434,
                18441
            ],
            [
                18449,
                18453
            ],
            [
                18465,
                18490
            ],
            [
                18453,
                18454
            ],
            [
                18600,
                18647
            ],
            [
                19033,
                19044
            ],
            [
                19078,
                19082
            ],
            [
                19108,
                19128
            ],
            [
                19143,
                19145
            ],
            [
                19145,
                19148
            ],
            [
                19250,
                19265
            ],
            [
                19169,
                19177
            ],
            [
                19226,
                19248
            ],
            [
                19354,
                19373
            ],
            [
                19195,
                19198
            ],
            [
                19290,
                19294
            ],
            [
                19302,
                19312
            ],
            [
                19379,
                19392
            ],
            [
                19392,
                19403
            ],
            [
                19439,
                19452
            ],
            [
                19459,
                19565
            ],
            [
                19565,
                19635
            ],
            [
                19635,
                19673
            ],
            [
                19673,
                19760
            ],
            [
                19781,
                19817
            ],
            [
                19817,
                19910
            ],
            [
                19941,
                19987
            ],
            [
                19987,
                20023
            ],
            [
                20023,
                20062
            ],
            [
                20082,
                20135
            ],
            [
                20135,
                20162
            ],
            [
                20183,
                20211
            ],
            [
                20213,
                20229
            ],
            [
                20235,
                20242
            ],
            [
                20162,
                20163
            ],
            [
                20245,
                20290
            ],
            [
                20322,
                20324
            ],
            [
                20324,
                20427
            ],
            [
                20450,
                20454
            ],
            [
                20460,
                20471
            ],
            [
                20493,
                20515
            ],
            [
                20479,
                20492
            ],
            [
                20515,
                20543
            ],
            [
                20544,
                20674
            ],
            [
                20674,
                20728
            ],
            [
                20732,
                20738
            ],
            [
                20792,
                20807
            ],
            [
                20819,
                20859
            ],
            [
                20859,
                20901
            ],
            [
                20921,
                20930
            ],
            [
                20930,
                20971
            ],
            [
                20992,
                20994
            ],
            [
                20994,
                21028
            ],
            [
                21188,
                21189
            ],
            [
                21075,
                21150
            ],
            [
                21190,
                21206
            ],
            [
                21253,
                21288
            ],
            [
                21288,
                21345
            ],
            [
                21382,
                21416
            ],
            [
                21429,
                21469
            ],
            [
                21469,
                21520
            ],
            [
                21540,
                21560
            ],
            [
                21573,
                21625
            ],
            [
                21625,
                21672
            ],
            [
                21672,
                21731
            ],
            [
                21731,
                21751
            ],
            [
                21757,
                21822
            ],
            [
                21822,
                21842
            ],
            [
                21842,
                21846
            ],
            [
                21870,
                21928
            ],
            [
                21928,
                21954
            ],
            [
                21954,
                22021
            ],
            [
                22023,
                22041
            ],
            [
                22041,
                22159
            ],
            [
                22159,
                22277
            ],
            [
                22277,
                22303
            ],
            [
                22307,
                22318
            ],
            [
                22318,
                22355
            ],
            [
                22381,
                22382
            ],
            [
                22446,
                22547
            ],
            [
                22685,
                22709
            ],
            [
                22709,
                22754
            ],
            [
                22782,
                22802
            ],
            [
                22824,
                22844
            ],
            [
                22928,
                22945
            ],
            [
                22945,
                22965
            ],
            [
                22967,
                22982
            ],
            [
                22982,
                22992
            ],
            [
                22999,
                23024
            ],
            [
                23066,
                23120
            ],
            [
                23120,
                23178
            ],
            [
                23208,
                23211
            ],
            [
                23211,
                23230
            ],
            [
                23230,
                23241
            ],
            [
                23242,
                23248
            ]
        ],
        "row_chars": [
            [
                0,
                104
            ],
            [
                104,
                224
            ],
            [
                224,
                353
            ],
            [
                353,
                623
            ],
            [
                623,
                699
            ],
            [
                699,
                1079
            ],
            [
                1079,
                1428
            ],
            [
                1428,
                1639
            ],
            [
                1639,
                1666
            ],
            [
                1666,
                1704
            ],
            [
                1704,
                2024
            ],
            [
                2024,
                2697
            ],
            [
                2697,
                2788
            ],
            [
                2788,
                2827
            ],
            [
                2827,
                2881
            ],
            [
                2881,
                3124
            ],
            [
                3124,
                3220
            ],
            [
                3220,
                3467
            ],
            [
                3467,
                3713
            ],
            [
                3713,
                3916
            ],
            [
                3916,
                3995
            ],
            [
                3995,
                4147
            ],
            [
                4147,
                4386
            ],
            [
                4386,
                4531
            ],
            [
                4531,
                4790
            ],
            [
                4790,
                4830
            ],
            [
                4830,
                4926
            ],
            [
                4926,
                5231
            ],
            [
                5231,
                5391
            ],
            [
                5391,
                5531
            ],
            [
                5531,
                5682
            ],
            [
                5682,
                5882
            ],
            [
                5882,
                5942
            ],
            [
                5942,
                6047
            ],
            [
                6047,
                6114
            ],
            [
                6114,
                6299
            ],
            [
                6299,
                6441
            ],
            [
                6441,
                6519
            ],
            [
                6519,
                6615
            ],
            [
                6615,
                6928
            ],
            [
                6928,
                7004
            ],
            [
                7004,
                7039
            ],
            [
                7039,
                7136
            ],
            [
                7136,
                7406
            ],
            [
                7406,
                7909
            ],
            [
                7909,
                8138
            ],
            [
                8138,
                8389
            ],
            [
                8389,
                8577
            ],
            [
                8577,
                8681
            ],
            [
                8681,
                9530
            ],
            [
                9530,
                9581
            ],
            [
                9581,
                9627
            ],
            [
                9627,
                9649
            ],
            [
                9649,
                9679
            ],
            [
                9679,
                9716
            ],
            [
                9716,
                9721
            ],
            [
                9721,
                9783
            ],
            [
                9783,
                9828
            ],
            [
                9828,
                9892
            ],
            [
                9892,
                9915
            ],
            [
                9915,
                9954
            ],
            [
                9954,
                9968
            ],
            [
                9968,
                10007
            ],
            [
                10007,
                10024
            ],
            [
                10024,
                10177
            ],
            [
                10177,
                10198
            ],
            [
                10198,
                10208
            ],
            [
                10208,
                10217
            ],
            [
                10217,
                10233
            ],
            [
                10233,
                10334
            ],
            [
                10334,
                10355
            ],
            [
                10355,
                10421
            ],
            [
                10421,
                10452
            ],
            [
                10452,
                10501
            ],
            [
                10501,
                10619
            ],
            [
                10619,
                10641
            ],
            [
                10641,
                10654
            ],
            [
                10654,
                10697
            ],
            [
                10697,
                10812
            ],
            [
                10812,
                10854
            ],
            [
                10854,
                10891
            ],
            [
                10891,
                10928
            ],
            [
                10928,
                10993
            ],
            [
                10993,
                11052
            ],
            [
                11052,
                11158
            ],
            [
                11158,
                11239
            ],
            [
                11239,
                11264
            ],
            [
                11264,
                11274
            ],
            [
                11274,
                11284
            ],
            [
                11284,
                11350
            ],
            [
                11350,
                11406
            ],
            [
                11406,
                11449
            ],
            [
                11449,
                11460
            ],
            [
                11460,
                11661
            ],
            [
                11661,
                11691
            ],
            [
                11691,
                11713
            ],
            [
                11713,
                11818
            ],
            [
                11818,
                11879
            ],
            [
                11879,
                12063
            ],
            [
                12063,
                12110
            ],
            [
                12110,
                12241
            ],
            [
                12241,
                12268
            ],
            [
                12268,
                12320
            ],
            [
                12320,
                12329
            ],
            [
                12329,
                12366
            ],
            [
                12366,
                12399
            ],
            [
                12399,
                12433
            ],
            [
                12433,
                12444
            ],
            [
                12444,
                12799
            ],
            [
                12799,
                12817
            ],
            [
                12817,
                12936
            ],
            [
                12936,
                13036
            ],
            [
                13036,
                13166
            ],
            [
                13166,
                13263
            ],
            [
                13263,
                13371
            ],
            [
                13371,
                13525
            ],
            [
                13525,
                13555
            ],
            [
                13555,
                13625
            ],
            [
                13625,
                13727
            ],
            [
                13727,
                13832
            ],
            [
                13832,
                13967
            ],
            [
                13967,
                14283
            ],
            [
                14283,
                14487
            ],
            [
                14487,
                14566
            ],
            [
                14566,
                14761
            ],
            [
                14761,
                14992
            ],
            [
                14992,
                15070
            ],
            [
                15070,
                15157
            ],
            [
                15157,
                15270
            ],
            [
                15270,
                15295
            ],
            [
                15295,
                15378
            ],
            [
                15378,
                15389
            ],
            [
                15389,
                15405
            ],
            [
                15405,
                15419
            ],
            [
                15419,
                15511
            ],
            [
                15511,
                15582
            ],
            [
                15582,
                15680
            ],
            [
                15680,
                15696
            ],
            [
                15696,
                15734
            ],
            [
                15734,
                15772
            ],
            [
                15772,
                15818
            ],
            [
                15818,
                15826
            ],
            [
                15826,
                15857
            ],
            [
                15857,
                15926
            ],
            [
                15926,
                15958
            ],
            [
                15958,
                16022
            ],
            [
                16022,
                16086
            ],
            [
                16086,
                16138
            ],
            [
                16138,
                16237
            ],
            [
                16237,
                16351
            ],
            [
                16351,
                16452
            ],
            [
                16452,
                16810
            ],
            [
                16810,
                16834
            ],
            [
                16834,
                17017
            ],
            [
                17017,
                17140
            ],
            [
                17140,
                17295
            ],
            [
                17295,
                17361
            ],
            [
                17361,
                17367
            ],
            [
                17367,
                17401
            ],
            [
                17401,
                17426
            ],
            [
                17426,
                17459
            ],
            [
                17459,
                17514
            ],
            [
                17514,
                17538
            ],
            [
                17538,
                17563
            ],
            [
                17563,
                17653
            ],
            [
                17653,
                17702
            ],
            [
                17702,
                17919
            ],
            [
                17919,
                17999
            ],
            [
                17999,
                18084
            ],
            [
                18084,
                18203
            ],
            [
                18203,
                18219
            ],
            [
                18219,
                18354
            ],
            [
                18354,
                18647
            ],
            [
                18647,
                18734
            ],
            [
                18734,
                18773
            ],
            [
                18773,
                18901
            ],
            [
                18901,
                19032
            ],
            [
                19032,
                19145
            ],
            [
                19145,
                19392
            ],
            [
                19392,
                19565
            ],
            [
                19565,
                19635
            ],
            [
                19635,
                19673
            ],
            [
                19673,
                19817
            ],
            [
                19817,
                19987
            ],
            [
                19987,
                20023
            ],
            [
                20023,
                20135
            ],
            [
                20135,
                20324
            ],
            [
                20324,
                20674
            ],
            [
                20674,
                20859
            ],
            [
                20859,
                20930
            ],
            [
                20930,
                20994
            ],
            [
                20994,
                21288
            ],
            [
                21288,
                21469
            ],
            [
                21469,
                21625
            ],
            [
                21625,
                21672
            ],
            [
                21672,
                21731
            ],
            [
                21731,
                21822
            ],
            [
                21822,
                21842
            ],
            [
                21842,
                21928
            ],
            [
                21928,
                21954
            ],
            [
                21954,
                22041
            ],
            [
                22041,
                22159
            ],
            [
                22159,
                22277
            ],
            [
                22277,
                22318
            ],
            [
                22318,
                22383
            ],
            [
                22383,
                22419
            ],
            [
                22419,
                22426
            ],
            [
                22426,
                22446
            ],
            [
                22446,
                22709
            ],
            [
                22709,
                22844
            ],
            [
                22844,
                22890
            ],
            [
                22890,
                22927
            ],
            [
                22927,
                22945
            ],
            [
                22945,
                22982
            ],
            [
                22982,
                23024
            ],
            [
                23024,
                23066
            ],
            [
                23066,
                23120
            ],
            [
                23120,
                23211
            ],
            [
                23211,
                23230
            ],
            [
                23230,
                23248
            ]
        ]
    },
    "abridged": {
        "text": "While Esther sleeps, it is still wet weather down at the place in Lincolnshire. The rain is ever falling - drip, drip, drip - by day and night upon the broad stone-flagged terrace-pavement, the Ghost's Walk. The weather is so very bad there that no-one can imagine its ever being fine again. Sir Leicester is not here, but is in Paris with my Lady; and solitude, with dusky wings, sits brooding upon Chesney Wold.\nThe horses in the long stables may contemplate fine weather on occasions. The old roan, turning his large eye to the window near his hay-rack, may remember the fresh leaves of other times. The mastiff, dozing in his kennel in the court-yard, may think of the hot sunshine and may recall the house full of company, the coach-houses full of vehicles, the stables full of horses. The turkey in the poultry-yard may recall that summer morning when he got into the lane amongst the barley. But there is not much fancy otherwise stirring at Chesney Wold.\nIt has rained so hard that Mrs. Rouncewell, the old housekeeper at Chesney Wold, has several times taken off her spectacles and cleaned them to make certain that the drops were not upon the glasses. She is a fine old lady, handsome, stately, wonderfully neat and upright. Weather affects Mrs. Rouncewell little. She sits in her room on the ground floor, and the whole house reposes on her mind. She can open it on occasion and be busy and fluttered, but it is shut up now in a majestic sleep.\nMrs. Rouncewell has been here fifty years. Her progress in the family began in the time of the last Sir Leicester, starting as a maid in the still-room.\nThe present Sir Leicester Dedlock is an excellent master. He supposes all his servants to be utterly bereft of individual characters or opinions. If he were to make a discovery to the contrary, he would be simply stunned. But he has a great liking for Mrs. Rouncewell; he says she is a most respectable woman. He always shakes hands with her when he comes down to Chesney Wold and when he goes away; and if he were very ill, he would say, \"send Mrs. Rouncewell here!\" feeling his dignity safer with her than with anybody else.\nMrs. Rouncewell has known trouble. Her husband died many years ago: she has two sons, of whom the younger ran wild, and went for a soldier, and never came back. Even to this hour, Mrs. Rouncewell's calm hands lose their composure when she speaks of him, trembling as she says what a fine lad, what a gay, good-humoured, clever lad he was! Her second son would have been made steward at Chesney Wold in due season, but he took, when he was a schoolboy, to constructing steam-engines out of saucepans; a propensity which gave Mrs. Rouncewell great uneasiness. When he built a model of a power-loom, she mentioned it, with many tears, to the baronet.\n\"Mrs. Rouncewell,\" said Sir Leicester, \"You had better get him into some Works. The iron country farther north is, I suppose, the right direction for a boy with these tendencies.\" So farther north he went, grew up, established himself, and married: and Mrs. Rouncewell's grandson, who is out of his apprenticeship, and home from a journey in far countries, stands leaning against the chimney-piece this very day in Mrs. Rouncewell's room at Chesney Wold.\n\"Again, I am glad to see you, Watt!\" says Mrs. Rouncewell. \"You are a fine young fellow. You are like your poor uncle George. Ah!\" Her hands tremble, as usual, on this reference.\n\"They say I am like my father, grandmother.\"\n\"Like him, also, my dear.\" Mrs. Rouncewell folds her hands again. \"He is well and happy?\"\n\"Thriving, grandmother, in every way.\"\n\"I am thankful! So he has sent you into foreign countries and the like? Well, he knows best. There may be a world beyond Chesney Wold that I don't understand.\"\n\"Grandmother,\" says the young man, changing the subject, \"what a very pretty girl that was I found with you just now. You called her Rosa?\"\n\"Yes, child. She is daughter of a widow in the village. Maids are hard to teach, but she's an apt scholar and will do well. She shows visitors around very prettily. She lives with me here.\"\n\"I hope I have not driven her away?\"\n\"She supposes we have family affairs to speak about, I dare say. She is very modest - a fine quality in a young woman. And scarcer than it formerly was!\" Then Mrs. Rouncewell listens. \"Wheels!\" says she. \"What wheels on such a day as this, for gracious sake?\"\nThere is a tap at the door. A dark, shy, village beauty comes in - so fresh in her delicate bloom that the drops of rain on her hair look like the dew upon a flower.\n\"What company is this, Rosa?\" says Mrs. Rouncewell.\n\"It's two young men in a gig, ma'am, who want to see the house. I told them it was the wrong day and the wrong hour, but the young man who was driving begged me to bring this card to you.\"\n\"Read it, my dear Watt,\" says the housekeeper.\nRosa is so shy as she gives it to him that they drop it between them and almost knock their foreheads together as they pick it up.\n\"Mr. Guppy,\" the card says.\n\"Guppy!\" repeats Mrs. Rouncewell. \"I never heard of him!\"\n\"If you please, he told me that!\" says Rosa. \"But he said that he and the other young gentleman came from London only last night by the mail-coach, on business at the magistrates' meeting, and that as their business was soon over, and they had heard a great deal about Chesney Wold, they had come through the wet to see it. They are lawyers. He says he is not in Mr. Tulkinghorn's office, but he knows Mr. Tulkinghorn.\"\nNow, Mr. Tulkinghorn is, in a manner, part of the place, and besides, is supposed to have made Mrs. Rouncewell's will. The old lady relaxes, and consents to the visitors' admission. The grandson, being smitten by a sudden wish to see the house himself, proposes to join the party. The grandmother, pleased, accompanies him - though he is exceedingly unwilling to trouble her.\n\"Much obliged to you, ma'am!\" says Mr. Guppy, removing his wet coat in the hall. \"Us London lawyers don't often get out, and when we do, we like to make the most of it, you know.\"\nThe old housekeeper, with gracious severity, waves her hand towards the great staircase. Mr. Guppy and his friend follow Rosa; Mrs. Rouncewell and her grandson follow them.\nAs is usually the case with people who go over houses, Mr. Guppy and his friend straggle about in the wrong places, don't care for the right things, yawn when more rooms are opened, and are clearly tired out. In each chamber that they enter, Mrs. Rouncewell, as upright as the house itself, sits in a window-seat and listens with stately approval to Rosa's exposition. Her grandson is so attentive that Rosa is shyer than ever - and prettier. Thus they pass from room to room, viewing the pictured Dedlocks. It appears to Mr. Guppy and his friend that there is no end to these Dedlocks.\nEven the long drawing-room of Chesney Wold cannot revive Mr. Guppy's spirits. He droops on the threshold. But a portrait over the chimney-piece acts upon him like a charm. He stares at it with uncommon interest; he seems to be fixed and fascinated by it.\n\"Dear me!\" says he. \"Who's that?\"\n\"That is the portrait of the present Lady Dedlock,\" says Rosa. \"It is considered a perfect likeness, and the best work of the artist.\"\n\"I can't ever have seen her,\" says Mr. Guppy, in a kind of dismay. \"Yet I know her! Has the picture been reproduced, miss?\"\n\"No. Sir Leicester has always refused permission for it to be engraved.\"\n\"Well!\" says Mr. Guppy in a low voice. \"Very curious. I know that picture! So that's Lady Dedlock, is it! Dashed if I don't think I must have had a dream of that picture, you know!\"\nHe remains so absorbed by the portrait that he stands immovable before it, and then comes out of the room dazed, walking around the succeeding rooms with a confused stare, as if he were looking for Lady Dedlock again.\nHe sees her elegant rooms, which are the last shown, and he looks out of the windows onto the terrace.\nRosa says, \"The terrace below is much admired. It is called, from an old story in the family, the Ghost's Walk.\"\n\"What's the story, miss?\" asks Mr. Guppy.\n\"Pray tell us the story,\" says Watt.\n\"I don't know it, sir.\" Rosa is shyer than ever.\n\"It is almost forgotten,\" says the housekeeper, advancing. \"It has never been more than a family anecdote.\"\n\"You'll excuse my asking if it has anything to do with a picture, ma'am,\" observes Mr. Guppy, \"because the more I think of that picture the better I know it, without knowing how!\"\nThe story has nothing to do with a picture. Mr. Guppy retires with his friend, and presently is heard to drive away.\nIt is now dusk. Mrs. Rouncewell tells her two young hearers how the terrace came to have that ghostly name.\nShe seats herself in a large chair by the fast-darkening window and says:\n\"In the days of King Charles the First, Sir Morbury Dedlock was the owner of Chesney Wold. Sir Morbury was, of course, on the side of the King. But it is said that his Lady favoured the bad cause, and that she gave the King's enemies information. When any of his Majesty's supporters met here, it is said that my Lady was always nearer to the door of their council-room than they supposed. Do you hear a sound like a footstep passing along the terrace, Watt?\"\nRosa draws nearer to the housekeeper.\n\"I hear the rain-drip on the stones,\" replies the young man, \"and I hear a curious echo which is very like a halting step.\"\nThe housekeeper gravely nods and continues: \"Partly on account of this division between them, Sir Morbury and his Lady led a troubled life. She was a lady of a haughty temper. They were not well suited to each other, and they had no children to moderate between them. After her favourite brother was killed in the civil wars by Sir Morbury's kinsman, her feeling was so violent that she hated the Dedlocks. When the Dedlocks were about to ride out from Chesney Wold in the king's cause, she is supposed to have crept down to the stables and lamed their horses at dead of night; and the story is that once, at such an hour, her husband saw her gliding down the stairs and followed her into the stall where his own favourite horse stood. There he seized her by the wrist, and in a struggle or a fall, she was lamed and from that hour began to pine away.\"\nThe housekeeper has dropped her voice to a whisper.\n\"She had been a lady of a handsome figure. She never complained of the change, or of being in pain, but day by day she tried to walk upon the terrace, and went up and down with greater difficulty every day. At last, one afternoon her husband (to whom she had never spoken since that night), standing at the window, saw her drop upon the pavement. He hastened down to raise her, but she repulsed him, and looking at him coldly, said, 'I will die here where I have walked. And I will walk here, though I am in my grave. I will walk here until the pride of this house is humbled. And when calamity or disgrace is coming to it, let the Dedlocks listen for my step!'\"\nWatt looks at Rosa. Rosa looks down upon the ground, half frightened and half shy.\n\"There and then she died. And from those days,\" says Mrs. Rouncewell, \"the name has come down - the Ghost's Walk. If the tread is an echo, it is an echo that is only heard after dark, and is often unheard for a long while together. But it comes back from time to time; and so sure as there is sickness or death in the family, it will be heard then.\"\n\"And disgrace, grandmother-\" says Watt.\n\"Disgrace never comes to Chesney Wold. Whatever the sound is, it is a worrying sound,\" says Mrs. Rouncewell, getting up from her chair; \"and you cannot shut it out. Watt, there is a tall French clock behind you that has a loud beat and can play music. Set it a-going.\"\nWatt sets it a-going - music and all.\n\"Now, come here,\" says the housekeeper. \"I am not sure that it is dark enough yet, but listen! Can you hear the sound upon the terrace, through the music?\"\n\"I certainly can!\"\n\"So my Lady Dedlock says.\"",
        "paragraph_chars": [
            [
                0,
                414
            ],
            [
                414,
                963
            ],
            [
                963,
                1456
            ],
            [
                1456,
                1609
            ],
            [
                1609,
                2136
            ],
            [
                2136,
                2784
            ],
            [
                2784,
                3239
            ],
            [
                3239,
                3418
            ],
            [
                3418,
                3463
            ],
            [
                3463,
                3553
            ],
            [
                3553,
                3592
            ],
            [
                3592,
                3752
            ],
            [
                3752,
                3892
            ],
            [
                3892,
                4082
            ],
            [
                4082,
                4119
            ],
            [
                4119,
                4379
            ],
            [
                4379,
                4545
            ],
            [
                4545,
                4597
            ],
            [
                4597,
                4786
            ],
            [
                4786,
                4833
            ],
            [
                4833,
                4964
            ],
            [
                4964,
                4992
            ],
            [
                4992,
                5050
            ],
            [
                5050,
                5470
            ],
            [
                5470,
                5846
            ],
            [
                5846,
                6026
            ],
            [
                6026,
                6199
            ],
            [
                6199,
                6786
            ],
            [
                6786,
                7041
            ],
            [
                7041,
                7075
            ],
            [
                7075,
                7210
            ],
            [
                7210,
                7334
            ],
            [
                7334,
                7407
            ],
            [
                7407,
                7589
            ],
            [
                7589,
                7807
            ],
            [
                7807,
                7910
            ],
            [
                7910,
                8023
            ],
            [
                8023,
                8065
            ],
            [
                8065,
                8102
            ],
            [
                8102,
                8151
            ],
            [
                8151,
                8259
            ],
            [
                8259,
                8439
            ],
            [
                8439,
                8556
            ],
            [
                8556,
                8664
            ],
            [
                8664,
                8738
            ],
            [
                8738,
                9198
            ],
            [
                9198,
                9236
            ],
            [
                9236,
                9360
            ],
            [
                9360,
                10213
            ],
            [
                10213,
                10265
            ],
            [
                10265,
                10928
            ],
            [
                10928,
                11011
            ],
            [
                11011,
                11361
            ],
            [
                11361,
                11401
            ],
            [
                11401,
                11670
            ],
            [
                11670,
                11708
            ],
            [
                11708,
                11864
            ],
            [
                11864,
                11883
            ],
            [
                11883,
                11909
            ]
        ],
        "segment_chars": [
            [
                0,
                80
            ],
            [
                80,
                208
            ],
            [
                208,
                292
            ],
            [
                292,
                414
            ],
            [
                414,
                488
            ],
            [
                488,
                603
            ],
            [
                603,
                791
            ],
            [
                791,
                899
            ],
            [
                899,
                963
            ],
            [
                963,
                1162
            ],
            [
                1162,
                1235
            ],
            [
                1235,
                1275
            ],
            [
                1275,
                1358
            ],
            [
                1358,
                1456
            ],
            [
                1456,
                1499
            ],
            [
                1499,
                1609
            ],
            [
                1609,
                1667
            ],
            [
                1667,
                1755
            ],
            [
                1755,
                1831
            ],
            [
                1831,
                1919
            ],
            [
                1919,
                2077
            ],
            [
                2077,
                2136
            ],
            [
                2136,
                2171
            ],
            [
                2171,
                2297
            ],
            [
                2297,
                2475
            ],
            [
                2475,
                2694
            ],
            [
                2694,
                2784
            ],
            [
                2784,
                2864
            ],
            [
                2864,
                2964
            ],
            [
                2964,
                3239
            ],
            [
                3239,
                3276
            ],
            [
                3276,
                3298
            ],
            [
                3298,
                3328
            ],
            [
                3328,
                3365
            ],
            [
                3365,
                3370
            ],
            [
                3370,
                3418
            ],
            [
                3418,
                3463
            ],
            [
                3463,
                3490
            ],
            [
                3490,
                3529
            ],
            [
                3529,
                3553
            ],
            [
                3553,
                3592
            ],
            [
                3592,
                3608
            ],
            [
                3608,
                3664
            ],
            [
                3664,
                3685
            ],
            [
                3685,
                3752
            ],
            [
                3752,
                3870
            ],
            [
                3870,
                3892
            ],
            [
                3892,
                3905
            ],
            [
                3905,
                3948
            ],
            [
                3948,
                4016
            ],
            [
                4016,
                4057
            ],
            [
                4057,
                4082
            ],
            [
                4082,
                4119
            ],
            [
                4119,
                4184
            ],
            [
                4184,
                4238
            ],
            [
                4238,
                4273
            ],
            [
                4273,
                4303
            ],
            [
                4303,
                4313
            ],
            [
                4313,
                4323
            ],
            [
                4323,
                4379
            ],
            [
                4379,
                4407
            ],
            [
                4407,
                4545
            ],
            [
                4545,
                4575
            ],
            [
                4575,
                4597
            ],
            [
                4597,
                4661
            ],
            [
                4661,
                4786
            ],
            [
                4786,
                4833
            ],
            [
                4833,
                4964
            ],
            [
                4964,
                4992
            ],
            [
                4992,
                5001
            ],
            [
                5001,
                5026
            ],
            [
                5026,
                5050
            ],
            [
                5050,
                5084
            ],
            [
                5084,
                5095
            ],
            [
                5095,
                5374
            ],
            [
                5374,
                5392
            ],
            [
                5392,
                5470
            ],
            [
                5470,
                5589
            ],
            [
                5589,
                5652
            ],
            [
                5652,
                5751
            ],
            [
                5751,
                5846
            ],
            [
                5846,
                5876
            ],
            [
                5876,
                5927
            ],
            [
                5927,
                6026
            ],
            [
                6026,
                6115
            ],
            [
                6115,
                6199
            ],
            [
                6199,
                6408
            ],
            [
                6408,
                6568
            ],
            [
                6568,
                6642
            ],
            [
                6642,
                6707
            ],
            [
                6707,
                6786
            ],
            [
                6786,
                6864
            ],
            [
                6864,
                6892
            ],
            [
                6892,
                6958
            ],
            [
                6958,
                7041
            ],
            [
                7041,
                7052
            ],
            [
                7052,
                7061
            ],
            [
                7061,
                7075
            ],
            [
                7075,
                7138
            ],
            [
                7138,
                7210
            ],
            [
                7210,
                7277
            ],
            [
                7277,
                7294
            ],
            [
                7294,
                7334
            ],
            [
                7334,
                7339
            ],
            [
                7339,
                7407
            ],
            [
                7407,
                7415
            ],
            [
                7415,
                7446
            ],
            [
                7446,
                7461
            ],
            [
                7461,
                7482
            ],
            [
                7482,
                7513
            ],
            [
                7513,
                7589
            ],
            [
                7589,
                7807
            ],
            [
                7807,
                7910
            ],
            [
                7910,
                7957
            ],
            [
                7957,
                8023
            ],
            [
                8023,
                8049
            ],
            [
                8049,
                8065
            ],
            [
                8065,
                8102
            ],
            [
                8102,
                8126
            ],
            [
                8126,
                8151
            ],
            [
                8151,
                8210
            ],
            [
                8210,
                8259
            ],
            [
                8259,
                8439
            ],
            [
                8439,
                8483
            ],
            [
                8483,
                8556
            ],
            [
                8556,
                8572
            ],
            [
                8572,
                8664
            ],
            [
                8664,
                8738
            ],
            [
                8738,
                8829
            ],
            [
                8829,
                8882
            ],
            [
                8882,
                8985
            ],
            [
                8985,
                9128
            ],
            [
                9128,
                9198
            ],
            [
                9198,
                9236
            ],
            [
                9236,
                9360
            ],
            [
                9360,
                9500
            ],
            [
                9500,
                9536
            ],
            [
                9536,
                9628
            ],
            [
                9628,
                9767
            ],
            [
                9767,
                10096
            ],
            [
                10096,
                10213
            ],
            [
                10213,
                10265
            ],
            [
                10265,
                10308
            ],
            [
                10308,
                10472
            ],
            [
                10472,
                10612
            ],
            [
                10612,
                10736
            ],
            [
                10736,
                10783
            ],
            [
                10783,
                10842
            ],
            [
                10842,
                10928
            ],
            [
                10928,
                10948
            ],
            [
                10948,
                11011
            ],
            [
                11011,
                11037
            ],
            [
                11037,
                11125
            ],
            [
                11125,
                11243
            ],
            [
                11243,
                11361
            ],
            [
                11361,
                11401
            ],
            [
                11401,
                11440
            ],
            [
                11440,
                11566
            ],
            [
                11566,
                11653
            ],
            [
                11653,
                11670
            ],
            [
                11670,
                11708
            ],
            [
                11708,
                11748
            ],
            [
                11748,
                11803
            ],
            [
                11803,
                11864
            ],
            [
                11864,
                11883
            ],
            [
                11883,
                11909
            ]
        ],
        "overlap_chars": [
            [
                0,
                19
            ],
            [
                19,
                80
            ],
            [
                80,
                104
            ],
            [
                111,
                123
            ],
            [
                126,
                157
            ],
            [
                172,
                208
            ],
            [
                208,
                234
            ],
            [
                241,
                245
            ],
            [
                253,
                256
            ],
            [
                265,
                292
            ],
            [
                296,
                317
            ],
            [
                317,
                318
            ],
            [
                319,
                414
            ],
            [
                414,
                431
            ],
            [
                432,
                444
            ],
            [
                445,
                460
            ],
            [
                461,
                486
            ],
            [
                486,
                488
            ],
            [
                488,
                501
            ],
            [
                502,
                519
            ],
            [
                524,
                530
            ],
            [
                531,
                546
            ],
            [
                550,
                551
            ],
            [
                551,
                586
            ],
            [
                590,
                601
            ],
            [
                601,
                603
            ],
            [
                603,
                654
            ],
            [
                654,
                685
            ],
            [
                686,
                689
            ],
            [
                690,
                789
            ],
            [
                789,
                791
            ],
            [
                791,
                821
            ],
            [
                822,
                825
            ],
            [
                833,
                852
            ],
            [
                853,
                878
            ],
            [
                887,
                890
            ],
            [
                891,
                899
            ],
            [
                903,
                962
            ],
            [
                963,
                984
            ],
            [
                985,
                1162
            ],
            [
                1162,
                1221
            ],
            [
                1222,
                1225
            ],
            [
                1233,
                1235
            ],
            [
                1235,
                1275
            ],
            [
                1275,
                1295
            ],
            [
                1296,
                1316
            ],
            [
                1317,
                1358
            ],
            [
                1358,
                1434
            ],
            [
                1435,
                1456
            ],
            [
                1456,
                1471
            ],
            [
                1472,
                1475
            ],
            [
                1476,
                1499
            ],
            [
                1499,
                1569
            ],
            [
                1590,
                1609
            ],
            [
                1609,
                1620
            ],
            [
                1635,
                1638
            ],
            [
                1643,
                1667
            ],
            [
                1667,
                1686
            ],
            [
                1696,
                1741
            ],
            [
                1742,
                1753
            ],
            [
                1753,
                1755
            ],
            [
                1755,
                1829
            ],
            [
                1829,
                1831
            ],
            [
                1835,
                1911
            ],
            [
                1912,
                1919
            ],
            [
                1919,
                2033
            ],
            [
                2034,
                2046
            ],
            [
                2046,
                2049
            ],
            [
                2049,
                2077
            ],
            [
                2077,
                2096
            ],
            [
                2097,
                2136
            ],
            [
                2136,
                2171
            ],
            [
                2204,
                2211
            ],
            [
                2212,
                2297
            ],
            [
                2297,
                2389
            ],
            [
                2400,
                2411
            ],
            [
                2412,
                2475
            ],
            [
                2475,
                2505
            ],
            [
                2506,
                2518
            ],
            [
                2519,
                2534
            ],
            [
                2535,
                2634
            ],
            [
                2636,
                2637
            ],
            [
                2638,
                2648
            ],
            [
                2655,
                2694
            ],
            [
                2699,
                2701
            ],
            [
                2708,
                2736
            ],
            [
                2749,
                2770
            ],
            [
                2771,
                2783
            ],
            [
                2784,
                2824
            ],
            [
                2824,
                2864
            ],
            [
                2864,
                2913
            ],
            [
                2920,
                2964
            ],
            [
                2967,
                2974
            ],
            [
                2975,
                2989
            ],
            [
                2990,
                2997
            ],
            [
                2997,
                2998
            ],
            [
                2999,
                3031
            ],
            [
                3033,
                3036
            ],
            [
                3037,
                3068
            ],
            [
                3069,
                3071
            ],
            [
                3072,
                3139
            ],
            [
                3139,
                3239
            ],
            [
                3239,
                3240
            ],
            [
                3240,
                3273
            ],
            [
                3276,
                3298
            ],
            [
                3298,
                3328
            ],
            [
                3328,
                3365
            ],
            [
                3365,
                3370
            ],
            [
                3374,
                3379
            ],
            [
                3387,
                3418
            ],
            [
                3418,
                3463
            ],
            [
                3463,
                3487
            ],
            [
                3490,
                3529
            ],
            [
                3529,
                3540
            ],
            [
                3550,
                3553
            ],
            [
                3553,
                3592
            ],
            [
                3592,
                3606
            ],
            [
                3608,
                3613
            ],
            [
                3614,
                3664
            ],
            [
                3664,
                3685
            ],
            [
                3685,
                3749
            ],
            [
                3752,
                3870
            ],
            [
                3870,
                3892
            ],
            [
                3892,
                3905
            ],
            [
                3905,
                3948
            ],
            [
                3948,
                3957
            ],
            [
                3958,
                3972
            ],
            [
                3977,
                4016
            ],
            [
                4016,
                4025
            ],
            [
                4042,
                4046
            ],
            [
                4055,
                4057
            ],
            [
                4057,
                4074
            ],
            [
                4075,
                4082
            ],
            [
                4082,
                4119
            ],
            [
                4119,
                4184
            ],
            [
                4184,
                4202
            ],
            [
                4205,
                4238
            ],
            [
                4238,
                4249
            ],
            [
                4250,
                4272
            ],
            [
                4278,
                4302
            ],
            [
                4303,
                4313
            ],
            [
                4313,
                4323
            ],
            [
                4323,
                4379
            ],
            [
                4388,
                4407
            ],
            [
                4407,
                4413
            ],
            [
                4413,
                4443
            ],
            [
                4444,
                4445
            ],
            [
                4446,
                4461
            ],
            [
                4462,
                4499
            ],
            [
                4500,
                4543
            ],
            [
                4543,
                4545
            ],
            [
                4545,
                4575
            ],
            [
                4575,
                4597
            ],
            [
                4597,
                4659
            ],
            [
                4661,
                4662
            ],
            [
                4663,
                4747
            ],
            [
                4748,
                4786
            ],
            [
                4786,
                4833
            ],
            [
                4833,
                4963
            ],
            [
                4964,
                4974
            ],
            [
                4977,
                4985
            ],
            [
                4990,
                4992
            ],
            [
                4992,
                5001
            ],
            [
                5001,
                5024
            ],
            [
                5024,
                5025
            ],
            [
                5027,
                5050
            ],
            [
                5050,
                5084
            ],
            [
                5084,
                5095
            ],
            [
                5095,
                5190
            ],
            [
                5196,
                5237
            ],
            [
                5237,
                5312
            ],
            [
                5319,
                5331
            ],
            [
                5331,
                5374
            ],
            [
                5374,
                5392
            ],
            [
                5392,
                5445
            ],
            [
                5452,
                5467
            ],
            [
                5467,
                5469
            ],
            [
                5470,
                5512
            ],
            [
                5513,
                5589
            ],
            [
                5589,
                5610
            ],
            [
                5611,
                5614
            ],
            [
                5615,
                5630
            ],
            [
                5631,
                5639
            ],
            [
                5641,
                5650
            ],
            [
                5650,
                5652
            ],
            [
                5652,
                5664
            ],
            [
                5664,
                5751
            ],
            [
                5751,
                5767
            ],
            [
                5768,
                5775
            ],
            [
                5775,
                5792
            ],
            [
                5795,
                5801
            ],
            [
                5802,
                5846
            ],
            [
                5846,
                5876
            ],
            [
                5876,
                5891
            ],
            [
                5901,
                5908
            ],
            [
                5914,
                5927
            ],
            [
                5927,
                5961
            ],
            [
                5962,
                6026
            ],
            [
                6026,
                6051
            ],
            [
                6052,
                6069
            ],
            [
                6069,
                6115
            ],
            [
                6115,
                6197
            ],
            [
                6197,
                6199
            ],
            [
                6199,
                6278
            ],
            [
                6279,
                6296
            ],
            [
                6301,
                6313
            ],
            [
                6313,
                6347
            ],
            [
                6353,
                6380
            ],
            [
                6381,
                6396
            ],
            [
                6406,
                6408
            ],
            [
                6408,
                6415
            ],
            [
                6416,
                6457
            ],
            [
                6458,
                6489
            ],
            [
                6495,
                6511
            ],
            [
                6512,
                6568
            ],
            [
                6568,
                6596
            ],
            [
                6597,
                6625
            ],
            [
                6628,
                6642
            ],
            [
                6642,
                6656
            ],
            [
                6657,
                6675
            ],
            [
                6684,
                6705
            ],
            [
                6705,
                6707
            ],
            [
                6707,
                6720
            ],
            [
                6721,
                6738
            ],
            [
                6739,
                6769
            ],
            [
                6776,
                6784
            ],
            [
                6784,
                6786
            ],
            [
                6786,
                6864
            ],
            [
                6864,
                6890
            ],
            [
                6890,
                6892
            ],
            [
                6892,
                6929
            ],
            [
                6930,
                6958
            ],
            [
                6958,
                7041
            ],
            [
                7041,
                7052
            ],
            [
                7052,
                7056
            ],
            [
                7059,
                7061
            ],
            [
                7061,
                7075
            ],
            [
                7075,
                7076
            ],
            [
                7081,
                7124
            ],
            [
                7124,
                7136
            ],
            [
                7136,
                7138
            ],
            [
                7139,
                7200
            ],
            [
                7207,
                7210
            ],
            [
                7210,
                7211
            ],
            [
                7211,
                7216
            ],
            [
                7219,
                7237
            ],
            [
                7237,
                7255
            ],
            [
                7256,
                7275
            ],
            [
                7275,
                7277
            ],
            [
                7278,
                7294
            ],
            [
                7294,
                7314
            ],
            [
                7325,
                7334
            ],
            [
                7334,
                7335
            ],
            [
                7337,
                7339
            ],
            [
                7339,
                7382
            ],
            [
                7404,
                7407
            ],
            [
                7407,
                7415
            ],
            [
                7415,
                7446
            ],
            [
                7446,
                7447
            ],
            [
                7447,
                7459
            ],
            [
                7461,
                7482
            ],
            [
                7482,
                7511
            ],
            [
                7520,
                7589
            ],
            [
                7589,
                7591
            ],
            [
                7592,
                7662
            ],
            [
                7662,
                7663
            ],
            [
                7664,
                7667
            ],
            [
                7673,
                7694
            ],
            [
                7695,
                7700
            ],
            [
                7717,
                7782
            ],
            [
                7783,
                7807
            ],
            [
                7807,
                7818
            ],
            [
                7819,
                7826
            ],
            [
                7827,
                7859
            ],
            [
                7860,
                7891
            ],
            [
                7897,
                7900
            ],
            [
                7908,
                7909
            ],
            [
                7919,
                7920
            ],
            [
                7921,
                7957
            ],
            [
                7957,
                8023
            ],
            [
                8023,
                8046
            ],
            [
                8063,
                8065
            ],
            [
                8065,
                8100
            ],
            [
                8102,
                8126
            ],
            [
                8126,
                8151
            ],
            [
                8151,
                8152
            ],
            [
                8152,
                8210
            ],
            [
                8210,
                8259
            ],
            [
                8259,
                8283
            ],
            [
                8284,
                8361
            ],
            [
                8362,
                8436
            ],
            [
                8436,
                8439
            ],
            [
                8439,
                8481
            ],
            [
                8481,
                8483
            ],
            [
                8493,
                8516
            ],
            [
                8516,
                8555
            ],
            [
                8556,
                8572
            ],
            [
                8572,
                8587
            ],
            [
                8594,
                8615
            ],
            [
                8616,
                8664
            ],
            [
                8664,
                8731
            ],
            [
                8736,
                8737
            ],
            [
                8738,
                8745
            ],
            [
                8746,
                8750
            ],
            [
                8751,
                8776
            ],
            [
                8776,
                8777
            ],
            [
                8782,
                8829
            ],
            [
                8829,
                8840
            ],
            [
                8841,
                8845
            ],
            [
                8855,
                8875
            ],
            [
                8880,
                8882
            ],
            [
                8882,
                8885
            ],
            [
                8886,
                8901
            ],
            [
                8902,
                8910
            ],
            [
                8911,
                8933
            ],
            [
                8933,
                8952
            ],
            [
                8953,
                8956
            ],
            [
                8957,
                8961
            ],
            [
                8961,
                8971
            ],
            [
                8972,
                8985
            ],
            [
                8985,
                8996
            ],
            [
                8997,
                9010
            ],
            [
                9022,
                9128
            ],
            [
                9128,
                9198
            ],
            [
                9198,
                9236
            ],
            [
                9236,
                9323
            ],
            [
                9324,
                9360
            ],
            [
                9360,
                9453
            ],
            [
                9454,
                9500
            ],
            [
                9500,
                9536
            ],
            [
                9536,
                9575
            ],
            [
                9575,
                9628
            ],
            [
                9628,
                9655
            ],
            [
                9656,
                9684
            ],
            [
                9685,
                9701
            ],
            [
                9702,
                9709
            ],
            [
                9709,
                9710
            ],
            [
                9711,
                9756
            ],
            [
                9765,
                9767
            ],
            [
                9767,
                9870
            ],
            [
                9877,
                9881
            ],
            [
                9885,
                9896
            ],
            [
                9897,
                9919
            ],
            [
                9923,
                9936
            ],
            [
                9936,
                9964
            ],
            [
                9966,
                10096
            ],
            [
                10096,
                10150
            ],
            [
                10151,
                10157
            ],
            [
                10157,
                10172
            ],
            [
                10173,
                10213
            ],
            [
                10213,
                10255
            ],
            [
                10256,
                10265
            ],
            [
                10265,
                10306
            ],
            [
                10306,
                10308
            ],
            [
                10308,
                10342
            ],
            [
                10342,
                10343
            ],
            [
                10344,
                10419
            ],
            [
                10420,
                10436
            ],
            [
                10437,
                10472
            ],
            [
                10472,
                10529
            ],
            [
                10537,
                10571
            ],
            [
                10572,
                10612
            ],
            [
                10612,
                10663
            ],
            [
                10663,
                10683
            ],
            [
                10684,
                10736
            ],
            [
                10736,
                10783
            ],
            [
                10783,
                10842
            ],
            [
                10842,
                10862
            ],
            [
                10863,
                10928
            ],
            [
                10928,
                10948
            ],
            [
                10948,
                10952
            ],
            [
                10953,
                11011
            ],
            [
                11011,
                11037
            ],
            [
                11037,
                11104
            ],
            [
                11107,
                11125
            ],
            [
                11125,
                11243
            ],
            [
                11243,
                11361
            ],
            [
                11361,
                11387
            ],
            [
                11390,
                11401
            ],
            [
                11401,
                11438
            ],
            [
                11438,
                11439
            ],
            [
                11440,
                11541
            ],
            [
                11542,
                11566
            ],
            [
                11566,
                11611
            ],
            [
                11612,
                11632
            ],
            [
                11633,
                11653
            ],
            [
                11653,
                11670
            ],
            [
                11670,
                11690
            ],
            [
                11693,
                11708
            ],
            [
                11708,
                11718
            ],
            [
                11723,
                11748
            ],
            [
                11749,
                11803
            ],
            [
                11803,
                11861
            ],
            [
                11861,
                11864
            ],
            [
                11864,
                11883
            ],
            [
                11883,
                11894
            ],
            [
                11903,
                11909
            ]
        ],
        "row_chars": [
            [
                0,
                80
            ],
            [
                80,
                208
            ],
            [
                208,
                292
            ],
            [
                292,
                414
            ],
            [
                414,
                414
            ],
            [
                414,
                488
            ],
            [
                488,
                603
            ],
            [
                603,
                603
            ],
            [
                603,
                603
            ],
            [
                603,
                603
            ],
            [
                603,
                603
            ],
            [
                603,
                791
            ],
            [
                791,
                791
            ],
            [
                791,
                791
            ],
            [
                791,
                791
            ],
            [
                791,
                791
            ],
            [
                791,
                791
            ],
            [
                791,
                791
            ],
            [
                791,
                899
            ],
            [
                899,
                899
            ],
            [
                899,
                963
            ],
            [
                963,
                963
            ],
            [
                963,
                1162
            ],
            [
                1162,
                1162
            ],
            [
                1162,
                1235
            ],
            [
                1235,
                1275
            ],
            [
                1275,
                1275
            ],
            [
                1275,
                1358
            ],
            [
                1358,
                1456
            ],
            [
                1456,
                1499
            ],
            [
                1499,
                1499
            ],
            [
                1499,
                1499
            ],
            [
                1499,
                1499
            ],
            [
                1499,
                1609
            ],
            [
                1609,
                1667
            ],
            [
                1667,
                1755
            ],
            [
                1755,
                1831
            ],
            [
                1831,
                1831
            ],
            [
                1831,
                1919
            ],
            [
                1919,
                2077
            ],
            [
                2077,
                2136
            ],
            [
                2136,
                2171
            ],
            [
                2171,
                2297
            ],
            [
                2297,
                2475
            ],
            [
                2475,
                2694
            ],
            [
                2694,
                2694
            ],
            [
                2694,
                2784
            ],
            [
                2784,
                2864
            ],
            [
                2864,
                2964
            ],
            [
                2964,
                3239
            ],
            [
                3239,
                3276
            ],
            [
                3276,
                3276
            ],
            [
                3276,
                3298
            ],
            [
                3298,
                3328
            ],
            [
                3328,
                3365
            ],
            [
                3365,
                3370
            ],
            [
                3370,
                3418
            ],
            [
                3418,
                3463
            ],
            [
                3463,
                3490
            ],
            [
                3490,
                3490
            ],
            [
                3490,
                3529
            ],
            [
                3529,
                3553
            ],
            [
                3553,
                3592
            ],
            [
                3592,
                3608
            ],
            [
                3608,
                3608
            ],
            [
                3608,
                3608
            ],
            [
                3608,
                3608
            ],
            [
                3608,
                3608
            ],
            [
                3608,
                3608
            ],
            [
                3608,
                3664
            ],
            [
                3664,
                3685
            ],
            [
                3685,
                3752
            ],
            [
                3752,
                3752
            ],
            [
                3752,
                3752
            ],
            [
                3752,
                3870
            ],
            [
                3870,
                3892
            ],
            [
                3892,
                3905
            ],
            [
                3905,
                3948
            ],
            [
                3948,
                4016
            ],
            [
                4016,
                4057
            ],
            [
                4057,
                4082
            ],
            [
                4082,
                4119
            ],
            [
                4119,
                4184
            ],
            [
                4184,
                4238
            ],
            [
                4238,
                4273
            ],
            [
                4273,
                4273
            ],
            [
                4273,
                4303
            ],
            [
                4303,
                4313
            ],
            [
                4313,
                4323
            ],
            [
                4323,
                4323
            ],
            [
                4323,
                4379
            ],
            [
                4379,
                4407
            ],
            [
                4407,
                4407
            ],
            [
                4407,
                4545
            ],
            [
                4545,
                4575
            ],
            [
                4575,
                4597
            ],
            [
                4597,
                4661
            ],
            [
                4661,
                4661
            ],
            [
                4661,
                4786
            ],
            [
                4786,
                4833
            ],
            [
                4833,
                4964
            ],
            [
                4964,
                4964
            ],
            [
                4964,
                4992
            ],
            [
                4992,
                5001
            ],
            [
                5001,
                5026
            ],
            [
                5026,
                5050
            ],
            [
                5050,
                5084
            ],
            [
                5084,
                5095
            ],
            [
                5095,
                5374
            ],
            [
                5374,
                5392
            ],
            [
                5392,
                5470
            ],
            [
                5470,
                5470
            ],
            [
                5470,
                5589
            ],
            [
                5589,
                5652
            ],
            [
                5652,
                5751
            ],
            [
                5751,
                5846
            ],
            [
                5846,
                5876
            ],
            [
                5876,
                5927
            ],
            [
                5927,
                6026
            ],
            [
                6026,
                6115
            ],
            [
                6115,
                6199
            ],
            [
                6199,
                6408
            ],
            [
                6408,
                6568
            ],
            [
                6568,
                6642
            ],
            [
                6642,
                6707
            ],
            [
                6707,
                6786
            ],
            [
                6786,
                6864
            ],
            [
                6864,
                6892
            ],
            [
                6892,
                6958
            ],
            [
                6958,
                6958
            ],
            [
                6958,
                7041
            ],
            [
                7041,
                7052
            ],
            [
                7052,
                7061
            ],
            [
                7061,
                7075
            ],
            [
                7075,
                7138
            ],
            [
                7138,
                7210
            ],
            [
                7210,
                7277
            ],
            [
                7277,
                7294
            ],
            [
                7294,
                7334
            ],
            [
                7334,
                7339
            ],
            [
                7339,
                7407
            ],
            [
                7407,
                7415
            ],
            [
                7415,
                7446
            ],
            [
                7446,
                7482
            ],
            [
                7482,
                7513
            ],
            [
                7513,
                7513
            ],
            [
                7513,
                7513
            ],
            [
                7513,
                7513
            ],
            [
                7513,
                7513
            ],
            [
                7513,
                7589
            ],
            [
                7589,
                7589
            ],
            [
                7589,
                7807
            ],
            [
                7807,
                7807
            ],
            [
                7807,
                7910
            ],
            [
                7910,
                7910
            ],
            [
                7910,
                7957
            ],
            [
                7957,
                8023
            ],
            [
                8023,
                8023
            ],
            [
                8023,
                8023
            ],
            [
                8023,
                8049
            ],
            [
                8049,
                8049
            ],
            [
                8049,
                8102
            ],
            [
                8102,
                8126
            ],
            [
                8126,
                8151
            ],
            [
                8151,
                8210
            ],
            [
                8210,
                8259
            ],
            [
                8259,
                8439
            ],
            [
                8439,
                8483
            ],
            [
                8483,
                8483
            ],
            [
                8483,
                8556
            ],
            [
                8556,
                8572
            ],
            [
                8572,
                8664
            ],
            [
                8664,
                8829
            ],
            [
                8829,
                8829
            ],
            [
                8829,
                8829
            ],
            [
                8829,
                8829
            ],
            [
                8829,
                8829
            ],
            [
                8829,
                8882
            ],
            [
                8882,
                8985
            ],
            [
                8985,
                9128
            ],
            [
                9128,
                9198
            ],
            [
                9198,
                9236
            ],
            [
                9236,
                9360
            ],
            [
                9360,
                9500
            ],
            [
                9500,
                9536
            ],
            [
                9536,
                9628
            ],
            [
                9628,
                9767
            ],
            [
                9767,
                10096
            ],
            [
                10096,
                10213
            ],
            [
                10213,
                10265
            ],
            [
                10265,
                10308
            ],
            [
                10308,
                10472
            ],
            [
                10472,
                10612
            ],
            [
                10612,
                10736
            ],
            [
                10736,
                10783
            ],
            [
                10783,
                10842
            ],
            [
                10842,
                10928
            ],
            [
                10928,
                10948
            ],
            [
                10948,
                11011
            ],
            [
                11011,
                11037
            ],
            [
                11037,
                11125
            ],
            [
                11125,
                11243
            ],
            [
                11243,
                11361
            ],
            [
                11361,
                11401
            ],
            [
                11401,
                11440
            ],
            [
                11440,
                11440
            ],
            [
                11440,
                11440
            ],
            [
                11440,
                11440
            ],
            [
                11440,
                11566
            ],
            [
                11566,
                11653
            ],
            [
                11653,
                11653
            ],
            [
                11653,
                11653
            ],
            [
                11653,
                11670
            ],
            [
                11670,
                11708
            ],
            [
                11708,
                11748
            ],
            [
                11748,
                11748
            ],
            [
                11748,
                11803
            ],
            [
                11803,
                11864
            ],
            [
                11864,
                11883
            ],
            [
                11883,
                11909
            ]
        ]
    }
}