{
    "original": {
        "text": "I wish either my father or my mother, or indeed both of them, as they were in duty both equally bound to it, had minded what they were about when they begot me; had they duly consider'd how much depended upon what they were then doing; --that not only the production of a rational Being was concerned in it, but that possibly the happy formation and temperature of his body, perhaps his genius and the very cast of his mind; --and, for aught they knew to the contrary, even the fortunes of his whole house might take their turn from the humours and dispositions which were then uppermost; ----Had they duly weighed and considered all this, and proceeded accordingly, ----I am verily persuaded I should have made a quite different figure in the world from that in which the reader is likely to see me. --Believe me, good folks, this is not so inconsiderable a thing as many of you may think it; --you have all, I dare say, heard of the animal spirits, as how they are transfused from father to son, &c., &c. --and a great deal to that purpose: --Well, you may take my word, that nine parts in ten of a man's sense or his nonsense, his successes and miscarriages in this world depend upon their motions and activity, and the different tracts and trains you put them into, so that when they are once set a-going, whether right or wrong, 'tis not a halfpenny matter, --away they go cluttering like hey-go mad; and by treading the same steps over and over again, they presently make a road of it, as plain and as smooth as a garden-walk, which, when they are once used to, the Devil himself sometimes shall not be able to drive them off it.\n_Pray, my Dear_, quoth my mother, _have you not forgot to wind up the clock? ------Good G--!_ cried my father, making an exclamation, but taking care to moderate his voice at the same time, ----_Did ever woman, since the creation of the world, interrupt a man with such a silly question?_ Pray, what was your father saying? ------Nothing.",
        "paragraph_chars": [
            [
                0,
                1636
            ],
            [
                1636,
                1974
            ]
        ],
        "segment_chars": [
            [
                0,
                801
            ],
            [
                801,
                1636
            ],
            [
                1636,
                1713
            ],
            [
                1713,
                1960
            ],
            [
                1960,
                1974
            ]
        ],
        "overlap_chars": [
            [
                0,
                52
            ],
            [
                107,
                159
            ],
            [
                799,
                800
            ],
            [
                161,
                169
            ],
            [
                619,
                629
            ],
            [
                186,
                223
            ],
            [
                229,
                235
            ],
            [
                238,
                300
            ],
            [
                306,
                311
            ],
            [
                326,
                345
            ],
            [
                362,
                373
            ],
            [
                394,
                423
            ],
            [
                432,
                435
            ],
            [
                442,
                451
            ],
            [
                60,
                61
            ],
            [
                474,
                511
            ],
            [
                533,
                544
            ],
            [
                562,
                572
            ],
            [
                578,
                587
            ],
            [
                75,
                77
            ],
            [
                56,
                60
            ],
            [
                455,
                458
            ],
            [
                53,
                55
            ],
            [
                593,
                614
            ],
            [
                630,
                666
            ],
            [
                693,
                749
            ],
            [
                803,
                841
            ],
            [
                857,
                867
            ],
            [
                876,
                889
            ],
            [
                896,
                950
            ],
            [
                1009,
                1012
            ],
            [
                954,
                996
            ],
            [
                1161,
                1163
            ],
            [
                873,
                875
            ],
            [
                996,
                1006
            ],
            [
                1045,
                1147
            ],
            [
                1361,
                1362
            ],
            [
                1175,
                1186
            ],
            [
                1334,
                1335
            ],
            [
                1205,
                1232
            ],
            [
                1251,
                1333
            ],
            [
                1365,
                1450
            ],
            [
                1456,
                1462
            ],
            [
                1473,
                1484
            ],
            [
                1505,
                1538
            ],
            [
                1568,
                1585
            ],
            [
                1596,
                1636
            ],
            [
                1637,
                1650
            ],
            [
                1653,
                1669
            ],
            [
                1671,
                1711
            ],
            [
                1719,
                1725
            ],
            [
                1730,
                1746
            ],
            [
                1774,
                1788
            ],
            [
                1798,
                1807
            ],
            [
                1831,
                1922
            ],
            [
                1929,
                1958
            ],
            [
                1922,
                1923
            ],
            [
                1958,
                1960
            ],
            [
                1966,
                1974
            ]
        ],
        "row_chars": [
            [
                0,
                801
            ],
            [
                801,
                1636
            ],
            [
                1636,
                1713
            ],
            [
                1713,
                1960
            ],
            [
                1960,
                1974
            ]
        ]
    },
    "abridged": {
        "text": "I wish either my father or my mother, or indeed both, had minded what they were about when they begot me. Had they considered how much depended upon what they were doing; - that not only the production of a rational Being was concerned, but the happy formation of his body and the very cast of his mind - for all they knew, the fortunes of his whole house might depend on the humours which were uppermost in them at the time of conception - had they duly weighed all this, and proceeded accordingly, I should have made a quite different figure in the world.\n-Believe me, good folks, this is not so slight a thing as you may think.\nYou have all, I dare say, heard of the animal spirits, and how they are transfused from father to son in the act of procreation, &c., &c. -Well, you may take my word, that nine parts in ten of a man's sense or his nonsense, his successes and failures, depend upon those spirits' activity, and the different paths you put them into, so that when they are once set a-going, whether right or wrong, away they go cluttering like hey-go mad; and by treading the same steps over and over, they make a road as smooth as a garden-walk, which the Devil himself shall not be able to drive them off it.\n'Pray, my Dear,' quoth my mother, 'have you not forgot to wind up the clock?'\n'Good G__!' cried my father, taking care to keep his voice down. -'Did ever woman, since the creation of the world, interrupt a man with such a silly question?'\nPray, what was your father saying when she interrupted?\nSaying? -Nothing.",
        "paragraph_chars": [
            [
                0,
                558
            ],
            [
                558,
                631
            ],
            [
                631,
                1223
            ],
            [
                1223,
                1301
            ],
            [
                1301,
                1462
            ],
            [
                1462,
                1518
            ],
            [
                1518,
                1535
            ]
        ],
        "segment_chars": [
            [
                0,
                106
            ],
            [
                106,
                558
            ],
            [
                558,
                631
            ],
            [
                631,
                1223
            ],
            [
                1223,
                1301
            ],
            [
                1301,
                1313
            ],
            [
                1313,
                1366
            ],
            [
                1366,
                1462
            ],
            [
                1462,
                1518
            ],
            [
                1518,
                1526
            ],
            [
                1526,
                1535
            ]
        ],
        "overlap_chars": [
            [
                0,
                52
            ],
            [
                52,
                104
            ],
            [
                104,
                105
            ],
            [
                106,
                114
            ],
            [
                115,
                125
            ],
            [
                126,
                163
            ],
            [
                164,
                170
            ],
            [
                173,
                235
            ],
            [
                235,
                240
            ],
            [
                241,
                260
            ],
            [
                261,
                272
            ],
            [
                273,
                302
            ],
            [
                305,
                308
            ],
            [
                313,
                322
            ],
            [
                322,
                323
            ],
            [
                324,
                361
            ],
            [
                372,
                383
            ],
            [
                384,
                394
            ],
            [
                395,
                404
            ],
            [
                405,
                407
            ],
            [
                408,
                412
            ],
            [
                416,
                419
            ],
            [
                425,
                427
            ],
            [
                441,
                462
            ],
            [
                463,
                499
            ],
            [
                500,
                556
            ],
            [
                559,
                597
            ],
            [
                605,
                615
            ],
            [
                616,
                629
            ],
            [
                631,
                685
            ],
            [
                686,
                689
            ],
            [
                690,
                732
            ],
            [
                733,
                735
            ],
            [
                744,
                746
            ],
            [
                758,
                768
            ],
            [
                770,
                872
            ],
            [
                881,
                882
            ],
            [
                883,
                894
            ],
            [
                908,
                909
            ],
            [
                910,
                937
            ],
            [
                944,
                1026
            ],
            [
                1027,
                1112
            ],
            [
                1112,
                1118
            ],
            [
                1119,
                1130
            ],
            [
                1131,
                1164
            ],
            [
                1165,
                1182
            ],
            [
                1183,
                1223
            ],
            [
                1224,
                1237
            ],
            [
                1240,
                1256
            ],
            [
                1258,
                1298
            ],
            [
                1302,
                1308
            ],
            [
                1313,
                1329
            ],
            [
                1330,
                1344
            ],
            [
                1350,
                1359
            ],
            [
                1368,
                1459
            ],
            [
                1466,
                1495
            ],
            [
                1516,
                1517
            ],
            [
                1524,
                1526
            ],
            [
                1527,
                1535
            ]
        ],
        "row_chars": [
            [
                0,
                558
            ],
            [
                558,
                1223
            ],
            [
                1223,
                1301
            ],
            [
                1301,
                1526
            ],
            [
                1526,
                1535
            ]
        ]
    }
}