{
    "original": {
        "text": "Yorick was this parson's name, and, what is very remarkable in it (as appears from a most ancient account of the family, wrote upon strong vellum, and now in perfect preservation) it had been exactly so spelt for near, ----I was within an ace of saying nine hundred years; ----but I would not shake my credit in telling an improbable truth, however indisputable in itself; ----and therefore I shall content myself with only saying ----It had been exactly so spelt, without the least variation or transposition of a single letter, for I do not know how long; which is more than I would venture to say of one half of the best surnames in the kingdom; which, in a course of years, have generally undergone as many chops and changes as their owners. --Has this been owing to the pride, or to the shame of the respective proprietors? --In honest truth, I think sometimes to the one, and sometimes to the other, just as the temptation has wrought. But a villainous affair it is, and will one day so blend and confound us altogether, that no one shall be able to stand up and swear, \"That his own great grandfather was the man who did either this or that.\"\nThis evil had been sufficiently fenced against by the prudent care of the _Yorick's_ family, and their religious preservation of these records I quote, which do farther inform us, That the family was originally of _Danish_ extraction, and had been transplanted into _England_ as early as in the reign of _Horwendillus_, king of _Denmark_, in whose court, it seems, an ancestor of this Mr. _Yorick's_, and from whom he was lineally descended, held a considerable post to the day of his death. Of what nature this considerable post was, this record saith not; --It only adds, That, for near two centuries, it had been totally abolished, as altogether unnecessary, not only in that court, but in every other court of the Christian world.\nIt has often come into my head, that this post could be no other than that of the king's chief Jester; --and that _Hamlet's Yorick_, in our _Shakespeare_, many of whose plays, you know, are founded upon authenticated facts, was certainly the very man.\nI have not the time to look into _Saxo-Grammaticus's Danish_ history, to know the certainty of this; --but if you have leisure, and can easily get at the book, you may do it full as well yourself.\nI had just time, in my travels through _Denmark_ with Mr. _Noddy's_ eldest son, whom, in the year 1741, I accompanied as governor, riding along with him at a prodigious rate thro' most parts of _Europe_, and of which original journey performed by us two, a most delectable narrative will be given in the progress of this work; I had just time, I say, and that was all, to prove the truth of an observation made by a long sojourner in that country; ----namely, \"That nature was neither very lavish, nor was she very stingy in her gifts of genius and capacity to its inhabitants; --but, like a discreet parent, was moderately kind to them all; observing such an equal tenor in the distribution of her favours, as to bring them, in those points, pretty near to a level with each other; so that you will meet with few instances in that kingdom of refined parts; but a great deal of good plain household understanding amongst all ranks of people, of which everybody has a share;\" which is, I think, very right.\nWith us, you see, the case is quite different: --we are all ups and downs in this matter; --you are a great genius; --or 'tis fifty to one, Sir, you are a great dunce and a blockhead; --not that there is a total want of intermediate steps, --no, --we are not so irregular as that comes to; --but the two extremes are more common, and in a greater degree in this unsettled island, where nature, in her gifts and dispositions of this kind, is most whimsical and capricious; fortune herself not being more so in the bequest of her goods and chattels than she.\nThis is all that ever staggered my faith in regard to _Yorick's_ extraction, who, by what I can remember of him, and by all the accounts I could ever get of him, seemed not to have had one single drop of _Danish_ blood in his whole crasis; in nine hundred years, it might possibly have all run out: ----I will not philosophize one moment with you about it; for happen how it would, the fact was this: --That instead of that cold phlegm and exact regularity of sense and humours, you would have looked for, in one so extracted; --he was, on the contrary, as mercurial and sublimated a composition, --as heteroclite a creature in all his declensions; --with as much life and whim, and _gait de cur_ about him, as the kindliest climate could have engendered and put together. With all this sail, poor _Yorick_ carried not one ounce of ballast; he was utterly unpractised in the world; and, at the age of twenty-six, knew just about as well how to steer his course in it, as a romping, unsuspicious girl of thirteen: So that upon his first setting out, the brisk gale of his spirits, as you will imagine, ran him foul ten times in a day of somebody's tackling; and as the grave and more slow-paced were oftenest in his way, ----you may likewise imagine, 'twas with such he had generally the ill luck to get the most entangled. For aught I know there might be some mixture of unlucky wit at the bottom of such _Fracas_: ----For, to speak the truth, _Yorick_ had an invincible dislike and opposition in his nature to gravity; --not to gravity as such; --for where gravity was wanted, he would be the most grave or serious of mortal men for days and weeks together; --but he was an enemy to the affectation of it, and declared open war against it, only as it appeared a cloak for ignorance, or for folly: and then, whenever it fell in his way, however sheltered and protected, he seldom gave it much quarter.\nSometimes, in his wild way of talking, he would say that Gravity was an errant scoundrel, and he would add, --of the most dangerous kind too, --because a sly one; and that he verily believed, more honest, well-meaning people were bubbled out of their goods and money by it in one twelve-month, than by pocket-picking and shop-lifting in seven. In the naked temper which a merry heart discovered, he would say, there was no danger, --but to itself: --whereas the very essence of gravity was design, and consequently deceit; --'twas a taught trick to gain credit of the world for more sense and knowledge than a man was worth; and that, with all its pretensions, --it was no better, but often worse, than what a _French_ wit had long ago defined it, --_viz._ _A mysterious carriage of the body to cover the defects of the mind_; --which definition of gravity, _Yorick_, with great imprudence, would say, deserved to be wrote in letters of gold.\nBut, in plain truth, he was a man unhackneyed and unpractised in the world, and was altogether as indiscreet and foolish on every other subject of discourse where policy is wont to impress restraint. _Yorick_ had no impression but one, and that was what arose from the nature of the deed spoken of; which impression he would usually translate into plain _English_ without any periphrasis; --and too oft without much distinction of either person, time, or place; --so that when mention was made of a pitiful or an ungenerous proceeding----he never gave himself a moment's time to reflect who was the hero of the piece, ----what his station, ----or how far he had power to hurt him hereafter; ----but if it was a dirty action, --without more ado, --The man was a dirty fellow, --and so on. --And as his comments had usually the ill fate to be terminated either in a _bon mot_, or to be enlivened throughout with some drollery or humour of expression, it gave wings to _Yorick's_ indiscretion. In a word, tho' he never sought, yet, at the same time, as he seldom shunned occasions of saying what came uppermost, and without much ceremony; ----he had but too many temptations in life, of scattering his wit and his humour, --his gibes and his jests about him. ----They were not lost for want of gathering.\nWhat were the consequences, and what was _Yorick's_ catastrophe thereupon, you will read in the next chapter.",
        "paragraph_chars": [
            [
                0,
                1150
            ],
            [
                1150,
                1885
            ],
            [
                1885,
                2137
            ],
            [
                2137,
                2334
            ],
            [
                2334,
                3340
            ],
            [
                3340,
                3897
            ],
            [
                3897,
                5799
            ],
            [
                5799,
                6742
            ],
            [
                6742,
                8044
            ],
            [
                8044,
                8153
            ]
        ],
        "segment_chars": [
            [
                0,
                746
            ],
            [
                746,
                829
            ],
            [
                829,
                942
            ],
            [
                942,
                1150
            ],
            [
                1150,
                1642
            ],
            [
                1642,
                1885
            ],
            [
                1885,
                2137
            ],
            [
                2137,
                2334
            ],
            [
                2334,
                3340
            ],
            [
                3340,
                3897
            ],
            [
                3897,
                4670
            ],
            [
                4670,
                5220
            ],
            [
                5220,
                5799
            ],
            [
                5799,
                6143
            ],
            [
                6143,
                6742
            ],
            [
                6742,
                6942
            ],
            [
                6942,
                7530
            ],
            [
                7530,
                7733
            ],
            [
                7733,
                7998
            ],
            [
                7998,
                8044
            ],
            [
                8044,
                8153
            ]
        ],
        "overlap_chars": [
            [
                0,
                59
            ],
            [
                66,
                82
            ],
            [
                236,
                238
            ],
            [
                90,
                150
            ],
            [
                155,
                191
            ],
            [
                203,
                208
            ],
            [
                192,
                202
            ],
            [
                209,
                217
            ],
            [
                223,
                224
            ],
            [
                253,
                272
            ],
            [
                277,
                292
            ],
            [
                299,
                361
            ],
            [
                371,
                372
            ],
            [
                377,
                398
            ],
            [
                419,
                423
            ],
            [
                435,
                463
            ],
            [
                530,
                602
            ],
            [
                607,
                647
            ],
            [
                217,
                218
            ],
            [
                649,
                655
            ],
            [
                473,
                476
            ],
            [
                671,
                746
            ],
            [
                946,
                972
            ],
            [
                1027,
                1038
            ],
            [
                1056,
                1075
            ],
            [
                1077,
                1127
            ],
            [
                1135,
                1147
            ],
            [
                1150,
                1168
            ],
            [
                1182,
                1219
            ],
            [
                1225,
                1233
            ],
            [
                1235,
                1292
            ],
            [
                1300,
                1307
            ],
            [
                1311,
                1328
            ],
            [
                1330,
                1363
            ],
            [
                1365,
                1371
            ],
            [
                1373,
                1392
            ],
            [
                1617,
                1619
            ],
            [
                1417,
                1424
            ],
            [
                1438,
                1453
            ],
            [
                1455,
                1467
            ],
            [
                1468,
                1477
            ],
            [
                1479,
                1486
            ],
            [
                1487,
                1529
            ],
            [
                1535,
                1538
            ],
            [
                1540,
                1548
            ],
            [
                1592,
                1596
            ],
            [
                1612,
                1616
            ],
            [
                1640,
                1642
            ],
            [
                1642,
                1661
            ],
            [
                1675,
                1696
            ],
            [
                1703,
                1706
            ],
            [
                1710,
                1722
            ],
            [
                1724,
                1728
            ],
            [
                1730,
                1733
            ],
            [
                1739,
                1787
            ],
            [
                1799,
                1810
            ],
            [
                1840,
                1848
            ],
            [
                1855,
                1885
            ],
            [
                1885,
                1973
            ],
            [
                1980,
                1987
            ],
            [
                1990,
                1998
            ],
            [
                2000,
                2015
            ],
            [
                2016,
                2024
            ],
            [
                2026,
                2037
            ],
            [
                2038,
                2087
            ],
            [
                2102,
                2137
            ],
            [
                2137,
                2169
            ],
            [
                2174,
                2196
            ],
            [
                2198,
                2209
            ],
            [
                2229,
                2237
            ],
            [
                2240,
                2310
            ],
            [
                2316,
                2334
            ],
            [
                2351,
                2372
            ],
            [
                2374,
                2381
            ],
            [
                2383,
                2391
            ],
            [
                2398,
                2400
            ],
            [
                2402,
                2422
            ],
            [
                2432,
                2454
            ],
            [
                2463,
                2471
            ],
            [
                2478,
                2507
            ],
            [
                2529,
                2535
            ],
            [
                2536,
                2550
            ],
            [
                2560,
                2567
            ],
            [
                2589,
                2659
            ],
            [
                2765,
                2767
            ],
            [
                2334,
                2335
            ],
            [
                2712,
                2747
            ],
            [
                2336,
                2339
            ],
            [
                2750,
                2754
            ],
            [
                3006,
                3008
            ],
            [
                2659,
                2660
            ],
            [
                2349,
                2350
            ],
            [
                2512,
                2513
            ],
            [
                2795,
                2818
            ],
            [
                2824,
                2830
            ],
            [
                2849,
                2878
            ],
            [
                2892,
                2911
            ],
            [
                2914,
                2975
            ],
            [
                3029,
                3040
            ],
            [
                2755,
                2757
            ],
            [
                3042,
                3058
            ],
            [
                3077,
                3083
            ],
            [
                3094,
                3157
            ],
            [
                2525,
                2527
            ],
            [
                3158,
                3173
            ],
            [
                3190,
                3274
            ],
            [
                2780,
                2781
            ],
            [
                3309,
                3340
            ],
            [
                3340,
                3386
            ],
            [
                3389,
                3413
            ],
            [
                3428,
                3429
            ],
            [
                3432,
                3455
            ],
            [
                3458,
                3522
            ],
            [
                3526,
                3551
            ],
            [
                3557,
                3559
            ],
            [
                3573,
                3578
            ],
            [
                3414,
                3416
            ],
            [
                3522,
                3523
            ],
            [
                3632,
                3668
            ],
            [
                3694,
                3732
            ],
            [
                3778,
                3780
            ],
            [
                3786,
                3810
            ],
            [
                3734,
                3746
            ],
            [
                3895,
                3897
            ],
            [
                3897,
                3913
            ],
            [
                3929,
                3950
            ],
            [
                3952,
                3960
            ],
            [
                4254,
                4257
            ],
            [
                4059,
                4077
            ],
            [
                4082,
                4100
            ],
            [
                4110,
                4122
            ],
            [
                4135,
                4168
            ],
            [
                4178,
                4194
            ],
            [
                4668,
                4669
            ],
            [
                4305,
                4336
            ],
            [
                4357,
                4362
            ],
            [
                4376,
                4401
            ],
            [
                4403,
                4409
            ],
            [
                4002,
                4004
            ],
            [
                4102,
                4108
            ],
            [
                3962,
                3973
            ],
            [
                4426,
                4450
            ],
            [
                4454,
                4463
            ],
            [
                3977,
                3978
            ],
            [
                4548,
                4574
            ],
            [
                4010,
                4013
            ],
            [
                4605,
                4651
            ],
            [
                4670,
                4694
            ],
            [
                4696,
                4702
            ],
            [
                4704,
                4814
            ],
            [
                4826,
                4828
            ],
            [
                4820,
                4825
            ],
            [
                4861,
                4863
            ],
            [
                4865,
                4908
            ],
            [
                4910,
                4912
            ],
            [
                4946,
                5010
            ],
            [
                5030,
                5041
            ],
            [
                5011,
                5029
            ],
            [
                5052,
                5115
            ],
            [
                5145,
                5219
            ],
            [
                5321,
                5340
            ],
            [
                5342,
                5348
            ],
            [
                5350,
                5390
            ],
            [
                5405,
                5415
            ],
            [
                5419,
                5441
            ],
            [
                5319,
                5320
            ],
            [
                5445,
                5466
            ],
            [
                5473,
                5501
            ],
            [
                5265,
                5267
            ],
            [
                5523,
                5526
            ],
            [
                5558,
                5564
            ],
            [
                5581,
                5636
            ],
            [
                5646,
                5648
            ],
            [
                5565,
                5568
            ],
            [
                5658,
                5679
            ],
            [
                5502,
                5504
            ],
            [
                5688,
                5693
            ],
            [
                5797,
                5799
            ],
            [
                5799,
                5867
            ],
            [
                5951,
                5956
            ],
            [
                5889,
                5892
            ],
            [
                5921,
                5930
            ],
            [
                5878,
                5887
            ],
            [
                5960,
                5970
            ],
            [
                5991,
                6002
            ],
            [
                6017,
                6078
            ],
            [
                6091,
                6143
            ],
            [
                6195,
                6228
            ],
            [
                6143,
                6145
            ],
            [
                6245,
                6246
            ],
            [
                6257,
                6288
            ],
            [
                6314,
                6321
            ],
            [
                6324,
                6331
            ],
            [
                6339,
                6359
            ],
            [
                6373,
                6422
            ],
            [
                6169,
                6170
            ],
            [
                6518,
                6521
            ],
            [
                6648,
                6655
            ],
            [
                6557,
                6623
            ],
            [
                6163,
                6168
            ],
            [
                6193,
                6194
            ],
            [
                6658,
                6664
            ],
            [
                6690,
                6742
            ],
            [
                6742,
                6749
            ],
            [
                6756,
                6775
            ],
            [
                6792,
                6871
            ],
            [
                6878,
                6885
            ],
            [
                6940,
                6942
            ],
            [
                6943,
                6949
            ],
            [
                7061,
                7066
            ],
            [
                6976,
                6977
            ],
            [
                7106,
                7113
            ],
            [
                7173,
                7203
            ],
            [
                7206,
                7213
            ],
            [
                7219,
                7238
            ],
            [
                7252,
                7276
            ],
            [
                7380,
                7381
            ],
            [
                7280,
                7301
            ],
            [
                7313,
                7359
            ],
            [
                7364,
                7372
            ],
            [
                6987,
                6990
            ],
            [
                7485,
                7486
            ],
            [
                7386,
                7396
            ],
            [
                7489,
                7496
            ],
            [
                7400,
                7432
            ],
            [
                7437,
                7466
            ],
            [
                7058,
                7060
            ],
            [
                7007,
                7010
            ],
            [
                7501,
                7515
            ],
            [
                7519,
                7529
            ],
            [
                7536,
                7551
            ],
            [
                7556,
                7563
            ],
            [
                7626,
                7635
            ],
            [
                7647,
                7651
            ],
            [
                7669,
                7675
            ],
            [
                7689,
                7707
            ],
            [
                7709,
                7717
            ],
            [
                7719,
                7733
            ],
            [
                7749,
                7764
            ],
            [
                7810,
                7819
            ],
            [
                7742,
                7743
            ],
            [
                7882,
                7888
            ],
            [
                7893,
                7913
            ],
            [
                7923,
                7952
            ],
            [
                7981,
                7986
            ],
            [
                7996,
                7998
            ],
            [
                8002,
                8020
            ],
            [
                8042,
                8044
            ],
            [
                8044,
                8084
            ],
            [
                8086,
                8094
            ],
            [
                8096,
                8153
            ]
        ],
        "row_chars": [
            [
                0,
                746
            ],
            [
                746,
                829
            ],
            [
                829,
                942
            ],
            [
                942,
                1150
            ],
            [
                1150,
                1642
            ],
            [
                1642,
                1885
            ],
            [
                1885,
                2137
            ],
            [
                2137,
                2334
            ],
            [
                2334,
                3340
            ],
            [
                3340,
                3897
            ],
            [
                3897,
                4670
            ],
            [
                4670,
                5220
            ],
            [
                5220,
                5799
            ],
            [
                5799,
                6143
            ],
            [
                6143,
                6742
            ],
            [
                6742,
                6942
            ],
            [
                6942,
                7530
            ],
            [
                7530,
                7733
            ],
            [
                7733,
                7998
            ],
            [
                7998,
                8044
            ],
            [
                8044,
                8153
            ]
        ]
    },
    "abridged": {
        "text": "Yorick was this parson's name, and, what is very remarkable (as appears from an ancient account of the family, wrote upon strong vellum, and in perfect preservation) it had been spelt exactly so for near - I almost said nine hundred years; but I would not risk my credit in telling an improbable truth, however indisputable; - and therefore I shall only say - it had been exactly so spelt for I do not know how long; which is more than I would venture to say of half of the best surnames in the kingdom, which, through the years, have generally undergone as many chops and changes as their owners. A villainous affair it is, that no one can stand up and swear, 'That his own great grandfather was the man who did this or that.'\nThis evil had been fenced against by the prudent care of Yorick's family, and their religious preservation of these records, which farther inform us that the family was originally of Danish extraction, and had come to England in the reign of Horwendillus, king of Denmark, in whose court, it seems, an ancestor of Mr. Yorick's held an important post. Of what nature this post was, this record says not. It only adds that for two centuries, it had been totally abolished, as unnecessary in every court of the Christian world.\nIt has often come into my head, that this post could be no other than that of the king's Jester; and that Hamlet's Yorick, in our Shakespeare, many of whose plays, you know, are founded upon facts, was certainly the very man.\nI have not the time to look into Saxo-Grammaticus's Danish history, to be certain of this; but if you have leisure, and can easily get at the book, you may do it as well yourself.\nIn my travels through Denmark with Mr. Noddy's eldest son, whom, in 1741, I accompanied as tutor, riding with him at a prodigious rate through Europe, and of which journey a most delectable narrative will be given in the progress of this work - in my travels I proved the truth of an observation made by one who had stayed long in Denmark; namely, 'That nature was neither lavish not stingy in her gifts of genius to its inhabitants; but, like a discreet parent, was moderately kind to them all; distributing her favours so equally as to bring them pretty level with each other; so that you will meet with few instances of refinement in that kingdom; but a great deal of good plain household understanding amongst all ranks of people;' which is, I think, very right.\nWith us, you see, the case is quite different: - we are all ups and downs; you are a great genius; - or 'tis fifty to one, Sir, you are a great dunce and a blockhead. Not that there is a total lack of steps in between; - but the two extremes are more common in this unsettled island, where nature is whimsical and capricious in her gifts.\nThis is all that shook my faith in regard to Yorick's ancestry - for he seemed not to have one single drop of phlegmatic blood in his body; in nine hundred years, it might have all run out. Instead of that cold phlegm and sense you would have looked for in one of Danish extraction, he was, on the contrary, mercurial, with as much life and whim and gaiety as the kindliest climate could have engendered.\nWith all this sail, poor Yorick carried not one ounce of ballast; he was utterly unpractised in the world; and, at the age of twenty-six, knew as much about it as a romping, unsuspicious girl of thirteen. So the brisk gale of his spirits, as you will imagine, ran him foul of somebody ten times in a day; and as the grave and more slow-paced were oftenest in his way, 'twas with such he had generally the ill luck to get the most entangled.\nTo speak the truth, Yorick had an invincible dislike and opposition to gravity - not to gravity as such, for where gravity was needed, he would be the most grave of men - but he hated the affectation of it, and declared open war against it when it was a cloak for ignorance or folly.\nSometimes, in his wild way of talking, he would say that Gravity was a sly and dangerous scoundrel; and that more honest people were bubbled out of their goods and money by it in one year, than by pocket-picking and shop-lifting in seven. He would say, there was no danger in merriment: whereas the very essence of gravity was deceit; 'twas a trick to gain credit for more sense and knowledge than a man was worth. A French wit called gravity 'A mysterious carriage of the body to cover the defects of the mind'; which, Yorick would say, deserved to be wrote in letters of gold.\nBut, in truth, he was a man unpractised in the world, and was altogether as indiscreet and foolish on every subject. Yorick would express himself bluntly, without considering either person, time, or place; so that if mention was made of an ungenerous proceeding, he never gave himself time to reflect who was the hero of the piece, what his position was, or how far the man had power to hurt him hereafter; - but if it was a dirty action, he called the man a dirty fellow - and so on.\nAs his comments were usually enlivened with humour, it gave wings to Yorick's indiscretion. Although he never sought occasions for speaking out, he had too many temptations of scattering his wit and his jests. They were not lost on his audience.\nWhat were the consequences, and what was Yorick's catastrophe thereupon, you will read in the next chapter.",
        "paragraph_chars": [
            [
                0,
                728
            ],
            [
                728,
                1253
            ],
            [
                1253,
                1479
            ],
            [
                1479,
                1659
            ],
            [
                1659,
                2426
            ],
            [
                2426,
                2765
            ],
            [
                2765,
                3170
            ],
            [
                3170,
                3611
            ],
            [
                3611,
                3895
            ],
            [
                3895,
                4474
            ],
            [
                4474,
                4959
            ],
            [
                4959,
                5205
            ],
            [
                5205,
                5312
            ]
        ],
        "segment_chars": [
            [
                0,
                598
            ],
            [
                598,
                728
            ],
            [
                728,
                1079
            ],
            [
                1079,
                1131
            ],
            [
                1131,
                1253
            ],
            [
                1253,
                1479
            ],
            [
                1479,
                1659
            ],
            [
                1659,
                2426
            ],
            [
                2426,
                2593
            ],
            [
                2593,
                2765
            ],
            [
                2765,
                2955
            ],
            [
                2955,
                3170
            ],
            [
                3170,
                3375
            ],
            [
                3375,
                3611
            ],
            [
                3611,
                3895
            ],
            [
                3895,
                4134
            ],
            [
                4134,
                4310
            ],
            [
                4310,
                4474
            ],
            [
                4474,
                4591
            ],
            [
                4591,
                4959
            ],
            [
                4959,
                5051
            ],
            [
                5051,
                5169
            ],
            [
                5169,
                5205
            ],
            [
                5205,
                5312
            ]
        ],
        "overlap_chars": [
            [
                0,
                59
            ],
            [
                60,
                76
            ],
            [
                77,
                79
            ],
            [
                80,
                140
            ],
            [
                141,
                177
            ],
            [
                178,
                183
            ],
            [
                184,
                194
            ],
            [
                195,
                203
            ],
            [
                206,
                207
            ],
            [
                220,
                239
            ],
            [
                240,
                255
            ],
            [
                261,
                323
            ],
            [
                323,
                324
            ],
            [
                327,
                348
            ],
            [
                349,
                353
            ],
            [
                360,
                388
            ],
            [
                389,
                461
            ],
            [
                462,
                502
            ],
            [
                502,
                503
            ],
            [
                504,
                510
            ],
            [
                519,
                522
            ],
            [
                523,
                598
            ],
            [
                598,
                624
            ],
            [
                625,
                636
            ],
            [
                641,
                660
            ],
            [
                662,
                712
            ],
            [
                713,
                725
            ],
            [
                728,
                746
            ],
            [
                747,
                784
            ],
            [
                785,
                793
            ],
            [
                794,
                851
            ],
            [
                851,
                858
            ],
            [
                859,
                876
            ],
            [
                877,
                910
            ],
            [
                911,
                917
            ],
            [
                918,
                937
            ],
            [
                943,
                945
            ],
            [
                946,
                953
            ],
            [
                954,
                969
            ],
            [
                970,
                982
            ],
            [
                982,
                991
            ],
            [
                992,
                999
            ],
            [
                999,
                1041
            ],
            [
                1042,
                1045
            ],
            [
                1046,
                1054
            ],
            [
                1055,
                1059
            ],
            [
                1073,
                1077
            ],
            [
                1077,
                1079
            ],
            [
                1079,
                1098
            ],
            [
                1099,
                1120
            ],
            [
                1126,
                1129
            ],
            [
                1131,
                1143
            ],
            [
                1144,
                1148
            ],
            [
                1149,
                1152
            ],
            [
                1153,
                1201
            ],
            [
                1202,
                1213
            ],
            [
                1214,
                1222
            ],
            [
                1223,
                1253
            ],
            [
                1253,
                1341
            ],
            [
                1342,
                1349
            ],
            [
                1350,
                1358
            ],
            [
                1359,
                1374
            ],
            [
                1374,
                1382
            ],
            [
                1383,
                1394
            ],
            [
                1394,
                1443
            ],
            [
                1444,
                1479
            ],
            [
                1479,
                1511
            ],
            [
                1515,
                1537
            ],
            [
                1538,
                1549
            ],
            [
                1561,
                1569
            ],
            [
                1570,
                1640
            ],
            [
                1641,
                1659
            ],
            [
                1659,
                1680
            ],
            [
                1681,
                1688
            ],
            [
                1689,
                1697
            ],
            [
                1703,
                1705
            ],
            [
                1706,
                1726
            ],
            [
                1727,
                1749
            ],
            [
                1755,
                1763
            ],
            [
                1764,
                1793
            ],
            [
                1802,
                1808
            ],
            [
                1808,
                1822
            ],
            [
                1823,
                1830
            ],
            [
                1831,
                1901
            ],
            [
                1904,
                1906
            ],
            [
                1918,
                1919
            ],
            [
                1927,
                1962
            ],
            [
                1971,
                1974
            ],
            [
                1982,
                1986
            ],
            [
                1987,
                1989
            ],
            [
                1997,
                1998
            ],
            [
                2005,
                2006
            ],
            [
                2007,
                2008
            ],
            [
                2008,
                2031
            ],
            [
                2032,
                2038
            ],
            [
                2043,
                2072
            ],
            [
                2073,
                2092
            ],
            [
                2093,
                2154
            ],
            [
                2168,
                2179
            ],
            [
                2180,
                2182
            ],
            [
                2191,
                2207
            ],
            [
                2208,
                2214
            ],
            [
                2215,
                2278
            ],
            [
                2279,
                2281
            ],
            [
                2293,
                2308
            ],
            [
                2308,
                2392
            ],
            [
                2392,
                2393
            ],
            [
                2395,
                2426
            ],
            [
                2426,
                2472
            ],
            [
                2475,
                2499
            ],
            [
                2499,
                2500
            ],
            [
                2501,
                2524
            ],
            [
                2527,
                2591
            ],
            [
                2593,
                2618
            ],
            [
                2624,
                2626
            ],
            [
                2627,
                2632
            ],
            [
                2633,
                2635
            ],
            [
                2643,
                2644
            ],
            [
                2647,
                2683
            ],
            [
                2684,
                2722
            ],
            [
                2723,
                2725
            ],
            [
                2726,
                2750
            ],
            [
                2751,
                2763
            ],
            [
                2763,
                2765
            ],
            [
                2765,
                2781
            ],
            [
                2788,
                2809
            ],
            [
                2810,
                2818
            ],
            [
                2830,
                2833
            ],
            [
                2837,
                2855
            ],
            [
                2856,
                2874
            ],
            [
                2886,
                2898
            ],
            [
                2903,
                2936
            ],
            [
                2937,
                2953
            ],
            [
                2953,
                2954
            ],
            [
                2955,
                2986
            ],
            [
                2987,
                2992
            ],
            [
                2993,
                3018
            ],
            [
                3019,
                3025
            ],
            [
                3026,
                3028
            ],
            [
                3029,
                3035
            ],
            [
                3036,
                3047
            ],
            [
                3048,
                3072
            ],
            [
                3073,
                3082
            ],
            [
                3082,
                3083
            ],
            [
                3084,
                3110
            ],
            [
                3111,
                3114
            ],
            [
                3122,
                3168
            ],
            [
                3170,
                3194
            ],
            [
                3195,
                3201
            ],
            [
                3202,
                3312
            ],
            [
                3313,
                3315
            ],
            [
                3321,
                3326
            ],
            [
                3327,
                3329
            ],
            [
                3330,
                3373
            ],
            [
                3375,
                3377
            ],
            [
                3378,
                3442
            ],
            [
                3443,
                3454
            ],
            [
                3455,
                3473
            ],
            [
                3473,
                3536
            ],
            [
                3536,
                3610
            ],
            [
                3611,
                3630
            ],
            [
                3631,
                3637
            ],
            [
                3638,
                3678
            ],
            [
                3679,
                3689
            ],
            [
                3692,
                3714
            ],
            [
                3714,
                3715
            ],
            [
                3716,
                3737
            ],
            [
                3744,
                3772
            ],
            [
                3773,
                3775
            ],
            [
                3776,
                3779
            ],
            [
                3782,
                3788
            ],
            [
                3795,
                3850
            ],
            [
                3856,
                3858
            ],
            [
                3859,
                3862
            ],
            [
                3863,
                3884
            ],
            [
                3885,
                3887
            ],
            [
                3888,
                3893
            ],
            [
                3893,
                3895
            ],
            [
                3895,
                3963
            ],
            [
                3964,
                3969
            ],
            [
                3970,
                3973
            ],
            [
                3974,
                3983
            ],
            [
                3984,
                3993
            ],
            [
                3993,
                4003
            ],
            [
                4004,
                4015
            ],
            [
                4016,
                4077
            ],
            [
                4082,
                4134
            ],
            [
                4134,
                4167
            ],
            [
                4168,
                4170
            ],
            [
                4180,
                4181
            ],
            [
                4190,
                4221
            ],
            [
                4222,
                4229
            ],
            [
                4230,
                4237
            ],
            [
                4238,
                4258
            ],
            [
                4259,
                4308
            ],
            [
                4310,
                4311
            ],
            [
                4319,
                4322
            ],
            [
                4330,
                4337
            ],
            [
                4339,
                4405
            ],
            [
                4408,
                4413
            ],
            [
                4413,
                4414
            ],
            [
                4415,
                4421
            ],
            [
                4422,
                4474
            ],
            [
                4474,
                4481
            ],
            [
                4482,
                4501
            ],
            [
                4502,
                4581
            ],
            [
                4582,
                4589
            ],
            [
                4589,
                4591
            ],
            [
                4591,
                4597
            ],
            [
                4598,
                4603
            ],
            [
                4627,
                4628
            ],
            [
                4629,
                4636
            ],
            [
                4649,
                4679
            ],
            [
                4680,
                4687
            ],
            [
                4691,
                4710
            ],
            [
                4711,
                4735
            ],
            [
                4735,
                4736
            ],
            [
                4737,
                4758
            ],
            [
                4759,
                4805
            ],
            [
                4806,
                4814
            ],
            [
                4824,
                4827
            ],
            [
                4827,
                4828
            ],
            [
                4829,
                4839
            ],
            [
                4840,
                4847
            ],
            [
                4848,
                4880
            ],
            [
                4883,
                4912
            ],
            [
                4913,
                4915
            ],
            [
                4923,
                4926
            ],
            [
                4931,
                4945
            ],
            [
                4948,
                4958
            ],
            [
                4959,
                4974
            ],
            [
                4980,
                4987
            ],
            [
                4988,
                4997
            ],
            [
                4998,
                5002
            ],
            [
                5003,
                5009
            ],
            [
                5009,
                5027
            ],
            [
                5028,
                5036
            ],
            [
                5037,
                5051
            ],
            [
                5060,
                5075
            ],
            [
                5076,
                5085
            ],
            [
                5102,
                5103
            ],
            [
                5104,
                5110
            ],
            [
                5111,
                5131
            ],
            [
                5132,
                5161
            ],
            [
                5162,
                5167
            ],
            [
                5167,
                5169
            ],
            [
                5169,
                5187
            ],
            [
                5203,
                5205
            ],
            [
                5205,
                5245
            ],
            [
                5246,
                5254
            ],
            [
                5255,
                5312
            ]
        ],
        "row_chars": [
            [
                0,
                598
            ],
            [
                598,
                598
            ],
            [
                598,
                598
            ],
            [
                598,
                728
            ],
            [
                728,
                1079
            ],
            [
                1079,
                1253
            ],
            [
                1253,
                1479
            ],
            [
                1479,
                1659
            ],
            [
                1659,
                2426
            ],
            [
                2426,
                2765
            ],
            [
                2765,
                3170
            ],
            [
                3170,
                3611
            ],
            [
                3611,
                3895
            ],
            [
                3895,
                4134
            ],
            [
                4134,
                4474
            ],
            [
                4474,
                4591
            ],
            [
                4591,
                4959
            ],
            [
                4959,
                5051
            ],
            [
                5051,
                5169
            ],
            [
                5169,
                5205
            ],
            [
                5205,
                5312
            ]
        ]
    }
}