{
    "original": {
        "text": "When the misfortune of my NOSE fell so heavily upon my father's head; --the reader remembers that he walked instantly up stairs, and cast himself down upon his bed; and from hence, unless he has a great insight into human nature, he will be apt to expect a rotation of the same ascending and descending movements from him, upon his misfortune of my NAME; ----no.\nThe different weight, dear Sir----nay even the different package of two vexations of the same weight----makes a very wide difference in our manner of bearing and getting through with them. ----It is not half an hour ago, when (in the great hurry and precipitation of a poor devil's writing for daily bread) I threw a fair sheet, which I had just finished, and carefully wrote out, slap into the fire, instead of the foul one.\nInstantly I snatch'd off my wig, and threw it perpendicularly, with all imaginable violence, up to the top of the room--indeed I caught it as it fell----but there was an end of the matter; nor do I think anything else in _Nature_ would have given such immediate ease: She, dear Goddess, by an instantaneous impulse, in all _provoking cases_, determines us to a sally of this or that member--or else she thrusts us into this or that place or posture of body, we know not why ----But mark, madam, we live amongst riddles and mysteries----the most obvious things, which come in our way, have dark sides, which the quickest sight cannot penetrate into; and even the clearest and most exalted understandings amongst us find ourselves puzzled and at a loss in almost every cranny of nature's works: so that this, like a thousand other things, falls out for us in a way, which tho' we cannot reason upon it--yet we find the good of it, may it please your reverences and your worships----and that's enough for us.\nNow, my father could not lie down with this affliction for his life----nor could he carry it up stairs like the other--he walked composedly out with it to the fish-pond.\nHad my father leaned his head upon his hand, and reasoned an hour which way to have gone------reason, with all her force, could not have directed him to anything like it: there is something, Sir, in fish-ponds----but what it is, I leave to system-builders and fish-pond-diggers betwixt 'em to find out--but there is something, under the first disorderly transport of the humours, so unaccountably becalming in an orderly and a sober walk towards one of them, that I have often wondered that neither _Pythagoras_, nor _Plato_, nor _Solon_, nor _Lycurgus_, nor _Mahomet_, nor any one of your noted lawgivers, ever gave order about them.",
        "paragraph_chars": [
            [
                0,
                363
            ],
            [
                363,
                789
            ],
            [
                789,
                1795
            ],
            [
                1795,
                1965
            ],
            [
                1965,
                2599
            ]
        ],
        "segment_chars": [
            [
                0,
                363
            ],
            [
                363,
                552
            ],
            [
                552,
                789
            ],
            [
                789,
                1795
            ],
            [
                1795,
                1965
            ],
            [
                1965,
                2599
            ]
        ],
        "overlap_chars": [
            [
                0,
                61
            ],
            [
                72,
                107
            ],
            [
                127,
                145
            ],
            [
                151,
                168
            ],
            [
                174,
                179
            ],
            [
                233,
                237
            ],
            [
                248,
                254
            ],
            [
                269,
                277
            ],
            [
                303,
                353
            ],
            [
                359,
                363
            ],
            [
                363,
                393
            ],
            [
                397,
                400
            ],
            [
                401,
                419
            ],
            [
                428,
                463
            ],
            [
                467,
                520
            ],
            [
                546,
                552
            ],
            [
                566,
                583
            ],
            [
                590,
                592
            ],
            [
                603,
                608
            ],
            [
                690,
                691
            ],
            [
                670,
                684
            ],
            [
                692,
                717
            ],
            [
                645,
                652
            ],
            [
                739,
                789
            ],
            [
                789,
                800
            ],
            [
                810,
                834
            ],
            [
                852,
                860
            ],
            [
                882,
                891
            ],
            [
                916,
                938
            ],
            [
                942,
                976
            ],
            [
                985,
                986
            ],
            [
                982,
                984
            ],
            [
                987,
                1009
            ],
            [
                1011,
                1017
            ],
            [
                1019,
                1055
            ],
            [
                1057,
                1075
            ],
            [
                1105,
                1107
            ],
            [
                1123,
                1128
            ],
            [
                850,
                851
            ],
            [
                1192,
                1220
            ],
            [
                1230,
                1237
            ],
            [
                1245,
                1262
            ],
            [
                1267,
                1270
            ],
            [
                1284,
                1321
            ],
            [
                976,
                977
            ],
            [
                1664,
                1688
            ],
            [
                1690,
                1696
            ],
            [
                1714,
                1716
            ],
            [
                1769,
                1786
            ],
            [
                1793,
                1795
            ],
            [
                1795,
                1849
            ],
            [
                1866,
                1887
            ],
            [
                1898,
                1912
            ],
            [
                1914,
                1965
            ],
            [
                1965,
                2043
            ],
            [
                2065,
                2066
            ],
            [
                2059,
                2065
            ],
            [
                2093,
                2114
            ],
            [
                2136,
                2141
            ],
            [
                2134,
                2135
            ],
            [
                2268,
                2291
            ],
            [
                2156,
                2159
            ],
            [
                2343,
                2389
            ],
            [
                2392,
                2410
            ],
            [
                2390,
                2391
            ],
            [
                2225,
                2234
            ],
            [
                2422,
                2463
            ],
            [
                2465,
                2475
            ],
            [
                2476,
                2481
            ],
            [
                2483,
                2488
            ],
            [
                2489,
                2494
            ],
            [
                2496,
                2501
            ],
            [
                2502,
                2507
            ],
            [
                2509,
                2517
            ],
            [
                2518,
                2523
            ],
            [
                2528,
                2532
            ],
            [
                2533,
                2542
            ],
            [
                2547,
                2581
            ],
            [
                2588,
                2599
            ]
        ],
        "row_chars": [
            [
                0,
                363
            ],
            [
                363,
                552
            ],
            [
                552,
                789
            ],
            [
                789,
                1795
            ],
            [
                1795,
                1965
            ],
            [
                1965,
                2599
            ]
        ]
    },
    "abridged": {
        "text": "When the misfortune of my Nose fell so heavily upon my father - the reader remembers that he walked upstairs, and cast himself upon his bed; and hence will expect the same movements from him, upon his misfortune of my Name: - no.\nThe different weight, dear Sir - nay, even the different packaging of two vexations of the same weight - makes a very wide difference in our manner of bearing them. Only half an hour ago, in my hurry, I threw a fair page which I had just finished writing out, slap into the fire, instead of the foul one.\nInstantly I snatched off my wig, and threw it with all my force up to the ceiling - indeed I caught it as it fell - but there was an end of the matter. I do not think anything else in Nature would have given such immediate ease. She, dear Goddess, in provoking cases, thrusts us into this or that posture, we know not why - but we live amongst riddles and mysteries; though we cannot reason upon it - yet we benefit from it - and that's enough.\nNow, my father could not lie down with this affliction - nor could he carry it upstairs like the other. He walked composedly out with it to the fish-pond.\nHad my father leaned his head upon his hand, and reasoned an hour which way to go, reason would not have directed him there: but there is something, Sir, so unaccountably becalming in an orderly and sober walk towards a fish-pond, that I have often wondered that neither Pythagoras, nor Plato, nor Solon, nor Lycurgus, nor Mahomet, nor any of your noted lawgivers, ever gave orders about them.",
        "paragraph_chars": [
            [
                0,
                230
            ],
            [
                230,
                535
            ],
            [
                535,
                980
            ],
            [
                980,
                1135
            ],
            [
                1135,
                1528
            ]
        ],
        "segment_chars": [
            [
                0,
                230
            ],
            [
                230,
                395
            ],
            [
                395,
                535
            ],
            [
                535,
                687
            ],
            [
                687,
                764
            ],
            [
                764,
                980
            ],
            [
                980,
                1084
            ],
            [
                1084,
                1135
            ],
            [
                1135,
                1528
            ]
        ],
        "overlap_chars": [
            [
                0,
                61
            ],
            [
                64,
                99
            ],
            [
                108,
                126
            ],
            [
                127,
                144
            ],
            [
                145,
                150
            ],
            [
                151,
                155
            ],
            [
                156,
                162
            ],
            [
                163,
                171
            ],
            [
                172,
                222
            ],
            [
                226,
                230
            ],
            [
                230,
                260
            ],
            [
                263,
                266
            ],
            [
                268,
                286
            ],
            [
                297,
                332
            ],
            [
                335,
                388
            ],
            [
                389,
                395
            ],
            [
                400,
                417
            ],
            [
                418,
                420
            ],
            [
                424,
                429
            ],
            [
                429,
                430
            ],
            [
                431,
                445
            ],
            [
                451,
                476
            ],
            [
                477,
                484
            ],
            [
                485,
                535
            ],
            [
                535,
                546
            ],
            [
                556,
                580
            ],
            [
                581,
                589
            ],
            [
                599,
                608
            ],
            [
                626,
                648
            ],
            [
                651,
                685
            ],
            [
                687,
                688
            ],
            [
                689,
                691
            ],
            [
                696,
                718
            ],
            [
                719,
                725
            ],
            [
                726,
                762
            ],
            [
                764,
                782
            ],
            [
                783,
                785
            ],
            [
                796,
                801
            ],
            [
                801,
                802
            ],
            [
                803,
                831
            ],
            [
                832,
                839
            ],
            [
                839,
                856
            ],
            [
                859,
                862
            ],
            [
                863,
                900
            ],
            [
                900,
                901
            ],
            [
                909,
                933
            ],
            [
                936,
                942
            ],
            [
                956,
                958
            ],
            [
                961,
                978
            ],
            [
                978,
                980
            ],
            [
                980,
                1034
            ],
            [
                1037,
                1058
            ],
            [
                1068,
                1082
            ],
            [
                1084,
                1135
            ],
            [
                1135,
                1213
            ],
            [
                1216,
                1217
            ],
            [
                1218,
                1224
            ],
            [
                1231,
                1252
            ],
            [
                1253,
                1258
            ],
            [
                1258,
                1259
            ],
            [
                1260,
                1283
            ],
            [
                1284,
                1287
            ],
            [
                1287,
                1333
            ],
            [
                1334,
                1352
            ],
            [
                1353,
                1354
            ],
            [
                1355,
                1364
            ],
            [
                1364,
                1405
            ],
            [
                1406,
                1416
            ],
            [
                1416,
                1421
            ],
            [
                1422,
                1427
            ],
            [
                1427,
                1432
            ],
            [
                1433,
                1438
            ],
            [
                1438,
                1443
            ],
            [
                1444,
                1452
            ],
            [
                1452,
                1457
            ],
            [
                1461,
                1465
            ],
            [
                1465,
                1474
            ],
            [
                1475,
                1509
            ],
            [
                1517,
                1528
            ]
        ],
        "row_chars": [
            [
                0,
                230
            ],
            [
                230,
                395
            ],
            [
                395,
                535
            ],
            [
                535,
                980
            ],
            [
                980,
                1135
            ],
            [
                1135,
                1528
            ]
        ]
    }
}