{
    "original": {
        "text": "My father was returned from his walk to the fish-pond----and opened the parlour-door in the very height of the attack, just as my uncle _Toby_ was marching up the glacis----_Trim_ recovered his arms----never was my uncle _Toby_ caught in riding at such a desperate rate in his life! Alas! my uncle _Toby!_ had not a weightier matter called forth all the ready eloquence of my father--how hadst thou then and thy poor HOBBY-HORSE too been insulted!\nMy father hung up his hat with the same air he took it down; and after giving a slight look at the disorder of the room, he took hold of one of the chairs which had formed the corporal's breach, and placing it over-against my uncle _Toby_, he sat down in it, and as soon as the tea-things were taken away, and the door shut, he broke out in a lamentation as follows.\nMY FATHER'S LAMENTATION\nIt is in vain longer, said my father, addressing himself as much to _Ernulphus's_ curse, which was laid upon the corner of the chimney-piece----as to my uncle _Toby_ who sat under it----it is in vain longer, said my father, in the most querulous monotony imaginable, to struggle as I have done against this most uncomfortable of human persuasions ----I see it plainly, that either for my own sins, brother _Toby_, or the sins and follies of the _Shandy_ family, Heaven has thought fit to draw forth the heaviest of its artillery against me; and that the prosperity of my child is the point upon which the whole force of it is directed to play. ------Such a thing would batter the whole universe about our ears, brother _Shandy_, said my uncle _Toby_--if it was so --Unhappy _Tristram_: child of wrath! child of decrepitude! interruption! mistake! and discontent! What one misfortune or disaster in the book of embryotic evils, that could unmechanize thy frame, or entangle thy filaments! which has not fallen upon thy head, or ever thou camest into the world----what evils in thy passage into it! ------what evils since! ----produced into being, in the decline of thy father's days----when the powers of his imagination and of his body were waxing feeble----when radical heat and radical moisture, the elements which should have temper'd thine, were drying up; and nothing left to found thy stamina in, but negations--'tis pitiful------brother _Toby_, at the best, and called out for all the little helps that care and attention on both sides could give it. But how were we defeated! You know the event, brother _Toby_----'tis too melancholy a one to be repeated now----when the few animal spirits I was worth in the world, and with which memory, fancy, and quick parts should have been convey'd------were all dispersed, confused, confounded, scattered, and sent to the devil. ------\nHere then was the time to have put a stop to this persecution against him; ------and tried an experiment at least------whether calmness and serenity of mind in your sister, with a due attention, brother _Toby_, to her evacuations and repletions------and the rest of her non-naturals, might not, in a course of nine months gestation, have set all things to rights. ------My child was bereft of these! ------What a teazing life did she lead herself, and consequently her ftus too, with that nonsensical anxiety of hers about lying-in in town? I thought my sister submitted with the greatest patience, replied my uncle _Toby_ --------I never heard her utter one fretful word about it. ------She fumed inwardly, cried my father; and that, let me tell you, brother, was ten times worse for the child--and then! what battles did she fight with me, and what perpetual storms about the midwife. ------There she gave vent, said my uncle _Toby_. ------Vent! cried my father, looking up.\nBut what was all this, my dear _Toby_, to the injuries done us by my child's coming head foremost into the world, when all I wished, in this general wreck of his frame, was to have saved this little casket unbroke, unrifled.------\nWith all my precautions, how was my system turned topside-turvy in the womb with my child! his head exposed to the hand of violence, and a pressure of 470 pounds avoirdupois weight acting so perpendicularly upon its apex--that at this hour 'tis ninety _per Cent._ insurance, that the fine net-work of the intellectual web be not rent and torn to a thousand tatters.\n----Still we could have done. ----Fool, coxcomb, puppy----give him but a NOSE ----Cripple, Dwarf, Driveller, Goosecap------(shape him as you will) the door of fortune stands open--_O Licetus!_ _Licetus!_ had I been blest with a ftus five inches long and a half, like thee --Fate might have done her worst.\nStill, brother _Toby_, there was one cast of the dye left for our child after all--_O Tristram!_ _Tristram!_ _Tristram!_\nWe will send for Mr. _Yorick_, said my uncle _Toby_.\n----You may send for whom you will, replied my father.",
        "paragraph_chars": [
            [
                0,
                448
            ],
            [
                448,
                815
            ],
            [
                815,
                839
            ],
            [
                839,
                2723
            ],
            [
                2723,
                3700
            ],
            [
                3700,
                3931
            ],
            [
                3931,
                4297
            ],
            [
                4297,
                4603
            ],
            [
                4603,
                4724
            ],
            [
                4724,
                4777
            ],
            [
                4777,
                4831
            ]
        ],
        "segment_chars": [
            [
                0,
                283
            ],
            [
                283,
                289
            ],
            [
                289,
                448
            ],
            [
                448,
                815
            ],
            [
                815,
                839
            ],
            [
                839,
                1483
            ],
            [
                1483,
                1641
            ],
            [
                1641,
                1663
            ],
            [
                1663,
                1677
            ],
            [
                1677,
                1686
            ],
            [
                1686,
                1702
            ],
            [
                1702,
                1827
            ],
            [
                1827,
                1936
            ],
            [
                1936,
                1960
            ],
            [
                1960,
                2397
            ],
            [
                2397,
                2423
            ],
            [
                2423,
                2723
            ],
            [
                2723,
                3087
            ],
            [
                3087,
                3123
            ],
            [
                3123,
                3264
            ],
            [
                3264,
                3405
            ],
            [
                3405,
                3529
            ],
            [
                3529,
                3610
            ],
            [
                3610,
                3659
            ],
            [
                3659,
                3671
            ],
            [
                3671,
                3700
            ],
            [
                3700,
                3931
            ],
            [
                3931,
                4022
            ],
            [
                4022,
                4297
            ],
            [
                4297,
                4327
            ],
            [
                4327,
                4603
            ],
            [
                4603,
                4724
            ],
            [
                4724,
                4777
            ],
            [
                4777,
                4831
            ]
        ],
        "overlap_chars": [
            [
                0,
                9
            ],
            [
                14,
                53
            ],
            [
                117,
                118
            ],
            [
                57,
                84
            ],
            [
                119,
                135
            ],
            [
                143,
                169
            ],
            [
                202,
                207
            ],
            [
                270,
                281
            ],
            [
                208,
                220
            ],
            [
                228,
                234
            ],
            [
                238,
                269
            ],
            [
                281,
                283
            ],
            [
                283,
                289
            ],
            [
                289,
                297
            ],
            [
                303,
                304
            ],
            [
                306,
                345
            ],
            [
                373,
                382
            ],
            [
                360,
                369
            ],
            [
                384,
                387
            ],
            [
                408,
                428
            ],
            [
                399,
                403
            ],
            [
                433,
                448
            ],
            [
                448,
                473
            ],
            [
                705,
                710
            ],
            [
                513,
                518
            ],
            [
                540,
                576
            ],
            [
                585,
                646
            ],
            [
                691,
                705
            ],
            [
                711,
                802
            ],
            [
                813,
                815
            ],
            [
                815,
                839
            ],
            [
                839,
                852
            ],
            [
                861,
                876
            ],
            [
                1106,
                1117
            ],
            [
                853,
                859
            ],
            [
                1133,
                1164
            ],
            [
                1481,
                1482
            ],
            [
                1190,
                1195
            ],
            [
                1199,
                1244
            ],
            [
                904,
                906
            ],
            [
                1251,
                1255
            ],
            [
                1256,
                1283
            ],
            [
                1285,
                1291
            ],
            [
                1293,
                1311
            ],
            [
                1354,
                1357
            ],
            [
                1342,
                1350
            ],
            [
                1358,
                1383
            ],
            [
                1450,
                1455
            ],
            [
                1462,
                1473
            ],
            [
                1389,
                1415
            ],
            [
                1494,
                1518
            ],
            [
                1525,
                1557
            ],
            [
                1559,
                1565
            ],
            [
                1568,
                1581
            ],
            [
                1566,
                1567
            ],
            [
                1590,
                1602
            ],
            [
                1605,
                1612
            ],
            [
                1619,
                1622
            ],
            [
                1623,
                1641
            ],
            [
                1677,
                1686
            ],
            [
                1686,
                1702
            ],
            [
                1702,
                1706
            ],
            [
                1711,
                1721
            ],
            [
                1734,
                1748
            ],
            [
                1759,
                1765
            ],
            [
                1833,
                1862
            ],
            [
                1866,
                1870
            ],
            [
                1953,
                1958
            ],
            [
                1871,
                1897
            ],
            [
                1983,
                2020
            ],
            [
                2257,
                2269
            ],
            [
                1798,
                1799
            ],
            [
                2275,
                2282
            ],
            [
                2217,
                2219
            ],
            [
                2395,
                2397
            ],
            [
                2401,
                2423
            ],
            [
                2423,
                2441
            ],
            [
                2461,
                2505
            ],
            [
                2509,
                2538
            ],
            [
                2441,
                2442
            ],
            [
                2567,
                2585
            ],
            [
                2591,
                2602
            ],
            [
                2609,
                2625
            ],
            [
                2640,
                2668
            ],
            [
                2691,
                2715
            ],
            [
                2723,
                2727
            ],
            [
                2733,
                2753
            ],
            [
                2808,
                2827
            ],
            [
                2996,
                2997
            ],
            [
                2842,
                2849
            ],
            [
                2863,
                2882
            ],
            [
                2894,
                2925
            ],
            [
                2765,
                2767
            ],
            [
                2932,
                2967
            ],
            [
                3005,
                3017
            ],
            [
                3033,
                3087
            ],
            [
                3093,
                3123
            ],
            [
                3129,
                3191
            ],
            [
                3197,
                3231
            ],
            [
                3240,
                3262
            ],
            [
                3264,
                3283
            ],
            [
                3284,
                3320
            ],
            [
                3322,
                3338
            ],
            [
                3403,
                3404
            ],
            [
                3354,
                3403
            ],
            [
                3415,
                3429
            ],
            [
                3431,
                3447
            ],
            [
                3448,
                3474
            ],
            [
                3484,
                3517
            ],
            [
                3519,
                3529
            ],
            [
                3529,
                3563
            ],
            [
                3591,
                3608
            ],
            [
                3622,
                3635
            ],
            [
                3637,
                3650
            ],
            [
                3671,
                3686
            ],
            [
                3698,
                3699
            ],
            [
                3700,
                3730
            ],
            [
                3737,
                3759
            ],
            [
                3763,
                3831
            ],
            [
                3869,
                3913
            ],
            [
                3923,
                3924
            ],
            [
                3931,
                3955
            ],
            [
                3964,
                3973
            ],
            [
                3960,
                3963
            ],
            [
                3974,
                4006
            ],
            [
                4020,
                4022
            ],
            [
                4022,
                4104
            ],
            [
                4112,
                4121
            ],
            [
                4138,
                4151
            ],
            [
                4171,
                4182
            ],
            [
                4184,
                4192
            ],
            [
                4206,
                4252
            ],
            [
                4269,
                4297
            ],
            [
                4307,
                4325
            ],
            [
                4325,
                4327
            ],
            [
                4523,
                4524
            ],
            [
                4335,
                4336
            ],
            [
                4551,
                4552
            ],
            [
                4384,
                4386
            ],
            [
                4355,
                4374
            ],
            [
                4547,
                4550
            ],
            [
                4444,
                4475
            ],
            [
                4587,
                4602
            ],
            [
                4603,
                4617
            ],
            [
                4624,
                4651
            ],
            [
                4656,
                4674
            ],
            [
                4687,
                4698
            ],
            [
                4706,
                4710
            ],
            [
                4718,
                4721
            ],
            [
                4724,
                4744
            ],
            [
                4746,
                4752
            ],
            [
                4755,
                4768
            ],
            [
                4781,
                4811
            ],
            [
                4813,
                4831
            ]
        ],
        "row_chars": [
            [
                0,
                283
            ],
            [
                283,
                289
            ],
            [
                289,
                448
            ],
            [
                448,
                815
            ],
            [
                815,
                839
            ],
            [
                839,
                1483
            ],
            [
                1483,
                1641
            ],
            [
                1641,
                1663
            ],
            [
                1663,
                1677
            ],
            [
                1677,
                1686
            ],
            [
                1686,
                1702
            ],
            [
                1702,
                2397
            ],
            [
                2397,
                2423
            ],
            [
                2423,
                2723
            ],
            [
                2723,
                3087
            ],
            [
                3087,
                3123
            ],
            [
                3123,
                3264
            ],
            [
                3264,
                3405
            ],
            [
                3405,
                3529
            ],
            [
                3529,
                3610
            ],
            [
                3610,
                3659
            ],
            [
                3659,
                3671
            ],
            [
                3671,
                3700
            ],
            [
                3700,
                3931
            ],
            [
                3931,
                4022
            ],
            [
                4022,
                4297
            ],
            [
                4297,
                4327
            ],
            [
                4327,
                4603
            ],
            [
                4603,
                4724
            ],
            [
                4724,
                4777
            ],
            [
                4777,
                4831
            ]
        ]
    },
    "abridged": {
        "text": "My father returned from his walk to the fish-pond, and opened the parlour-door just as my uncle Toby was marching up the glacis. Never in his life was my uncle Toby caught riding at such a desperate rate! Alas! my uncle Toby! had not a weightier matter called forth my father's eloquence - how would thy poor Hobby-Horse then have been insulted!\nMy father hung up his hat, and after glancing at the disorder of the room, he took one of the chairs which had formed the corporal's breach, and sat down in it. As soon as the tea-things were taken away, and the door shut, he broke out in a lamentation.\nMY FATHER'S LAMENTATION\n'It is in vain,' said my father, 'to struggle any longer against this most uncomfortable idea. I see plainly, that either for my own sins, brother Toby, or for the sins and follies of the Shandy family, Heaven has arrayed its heaviest artillery against me; and its force is directed against the prosperity of my child.'\n'Such a thing would batter the universe about our ears, brother Shandy,' said my uncle Toby, 'if it was so.'\n'Unhappy Tristram: child of wrath! mistake! and discontent! What misfortune in the book of embryonic evils, has not fallen upon thy head, ever since thou camest into the world, in the decline of thy father's days - 'tis pitiful, brother Toby. How were we defeated! You know the event - 'tis too melancholy a one to be repeated now - when the few animal spirits I had, with which memory, imagination, and quick wits should have been conveyed to my son - were all dispersed, confused, and sent to the devil.\n'Here was the time to have tried an experiment - whether serenity of mind in my wife, with a due attention, brother Toby, to her evacuations and repletions, might not, during nine months gestation, have set all things to rights. My child was bereft of these! What a teazing life did she lead herself, and consequently her foetus too, with that nonsensical anxiety about lying-in in town?'\n'I thought my sister in law submitted with the greatest patience,' replied my uncle Toby. 'I never heard her utter one fretful word about it.'\n'She fumed inwardly,' cried my father; 'and that, let me tell you, was ten times worse for the child. - And then! what battles did she fight with me about the midwife!'\n'There she gave vent,' said my uncle Toby.\n'Vent!' cried my father. 'But what was all this, my dear Toby, to the injuries done by my child's coming head foremost into the world, when all I wished was to have saved this little casket unbroke. - With all my precautions, my system was turned topside-turvy in the womb! his head exposed to the hand of violence, and a pressure of 470 pounds avoirdupois acting so upon its apex - 'tis ninety per cent likely that the fine net-work of the intellectual web was torn to a thousand tatters.\n'Still we could have done,' he went on. 'Be he a fool, a cripple - give him but a Nose and the door of fortune stands open. There Fate has done her worst. Yet still, brother Toby, there was one cast of the dice left for our child. O Tristram! Tristram! Tristram!'\n'We will send for Mr. Yorick,' said my uncle Toby.\n'You may send for whom you will,' replied my father.",
        "paragraph_chars": [
            [
                0,
                346
            ],
            [
                346,
                600
            ],
            [
                600,
                624
            ],
            [
                624,
                944
            ],
            [
                944,
                1053
            ],
            [
                1053,
                1559
            ],
            [
                1559,
                1948
            ],
            [
                1948,
                2091
            ],
            [
                2091,
                2260
            ],
            [
                2260,
                2303
            ],
            [
                2303,
                2793
            ],
            [
                2793,
                3057
            ],
            [
                3057,
                3108
            ],
            [
                3108,
                3160
            ]
        ],
        "segment_chars": [
            [
                0,
                129
            ],
            [
                129,
                205
            ],
            [
                205,
                211
            ],
            [
                211,
                226
            ],
            [
                226,
                346
            ],
            [
                346,
                507
            ],
            [
                507,
                600
            ],
            [
                600,
                624
            ],
            [
                624,
                719
            ],
            [
                719,
                944
            ],
            [
                944,
                1053
            ],
            [
                1053,
                1088
            ],
            [
                1088,
                1097
            ],
            [
                1097,
                1113
            ],
            [
                1113,
                1296
            ],
            [
                1296,
                1318
            ],
            [
                1318,
                1559
            ],
            [
                1559,
                1788
            ],
            [
                1788,
                1818
            ],
            [
                1818,
                1948
            ],
            [
                1948,
                2038
            ],
            [
                2038,
                2091
            ],
            [
                2091,
                2193
            ],
            [
                2193,
                2205
            ],
            [
                2205,
                2260
            ],
            [
                2260,
                2303
            ],
            [
                2303,
                2311
            ],
            [
                2311,
                2328
            ],
            [
                2328,
                2502
            ],
            [
                2502,
                2577
            ],
            [
                2577,
                2793
            ],
            [
                2793,
                2833
            ],
            [
                2833,
                2917
            ],
            [
                2917,
                2948
            ],
            [
                2948,
                3024
            ],
            [
                3024,
                3036
            ],
            [
                3036,
                3046
            ],
            [
                3046,
                3057
            ],
            [
                3057,
                3108
            ],
            [
                3108,
                3160
            ]
        ],
        "overlap_chars": [
            [
                0,
                9
            ],
            [
                10,
                49
            ],
            [
                49,
                50
            ],
            [
                51,
                78
            ],
            [
                79,
                95
            ],
            [
                101,
                127
            ],
            [
                129,
                134
            ],
            [
                135,
                146
            ],
            [
                147,
                159
            ],
            [
                165,
                171
            ],
            [
                172,
                203
            ],
            [
                203,
                205
            ],
            [
                205,
                211
            ],
            [
                211,
                219
            ],
            [
                224,
                225
            ],
            [
                226,
                265
            ],
            [
                266,
                275
            ],
            [
                278,
                287
            ],
            [
                290,
                293
            ],
            [
                300,
                320
            ],
            [
                321,
                325
            ],
            [
                331,
                346
            ],
            [
                346,
                371
            ],
            [
                371,
                376
            ],
            [
                377,
                382
            ],
            [
                392,
                428
            ],
            [
                429,
                490
            ],
            [
                491,
                505
            ],
            [
                507,
                598
            ],
            [
                598,
                600
            ],
            [
                600,
                624
            ],
            [
                625,
                638
            ],
            [
                641,
                656
            ],
            [
                658,
                669
            ],
            [
                674,
                680
            ],
            [
                681,
                712
            ],
            [
                717,
                718
            ],
            [
                719,
                724
            ],
            [
                725,
                770
            ],
            [
                771,
                773
            ],
            [
                775,
                779
            ],
            [
                784,
                811
            ],
            [
                812,
                818
            ],
            [
                819,
                837
            ],
            [
                846,
                849
            ],
            [
                850,
                858
            ],
            [
                859,
                884
            ],
            [
                889,
                894
            ],
            [
                895,
                906
            ],
            [
                915,
                941
            ],
            [
                950,
                974
            ],
            [
                975,
                1007
            ],
            [
                1008,
                1014
            ],
            [
                1017,
                1030
            ],
            [
                1035,
                1036
            ],
            [
                1038,
                1050
            ],
            [
                1054,
                1061
            ],
            [
                1067,
                1070
            ],
            [
                1070,
                1088
            ],
            [
                1088,
                1097
            ],
            [
                1097,
                1113
            ],
            [
                1113,
                1117
            ],
            [
                1118,
                1128
            ],
            [
                1129,
                1143
            ],
            [
                1154,
                1160
            ],
            [
                1161,
                1190
            ],
            [
                1191,
                1195
            ],
            [
                1196,
                1201
            ],
            [
                1202,
                1228
            ],
            [
                1228,
                1265
            ],
            [
                1268,
                1280
            ],
            [
                1280,
                1281
            ],
            [
                1282,
                1289
            ],
            [
                1290,
                1292
            ],
            [
                1294,
                1296
            ],
            [
                1296,
                1318
            ],
            [
                1318,
                1336
            ],
            [
                1339,
                1383
            ],
            [
                1386,
                1415
            ],
            [
                1419,
                1420
            ],
            [
                1421,
                1439
            ],
            [
                1451,
                1462
            ],
            [
                1468,
                1484
            ],
            [
                1506,
                1534
            ],
            [
                1534,
                1558
            ],
            [
                1560,
                1564
            ],
            [
                1565,
                1585
            ],
            [
                1586,
                1605
            ],
            [
                1606,
                1607
            ],
            [
                1608,
                1615
            ],
            [
                1616,
                1635
            ],
            [
                1643,
                1674
            ],
            [
                1675,
                1677
            ],
            [
                1679,
                1714
            ],
            [
                1714,
                1726
            ],
            [
                1734,
                1788
            ],
            [
                1788,
                1818
            ],
            [
                1818,
                1880
            ],
            [
                1888,
                1922
            ],
            [
                1923,
                1945
            ],
            [
                1949,
                1968
            ],
            [
                1976,
                2012
            ],
            [
                2015,
                2031
            ],
            [
                2036,
                2037
            ],
            [
                2039,
                2088
            ],
            [
                2096,
                2110
            ],
            [
                2113,
                2129
            ],
            [
                2131,
                2157
            ],
            [
                2158,
                2191
            ],
            [
                2195,
                2205
            ],
            [
                2205,
                2239
            ],
            [
                2240,
                2257
            ],
            [
                2267,
                2280
            ],
            [
                2283,
                2296
            ],
            [
                2311,
                2326
            ],
            [
                2326,
                2327
            ],
            [
                2329,
                2359
            ],
            [
                2364,
                2386
            ],
            [
                2387,
                2455
            ],
            [
                2456,
                2500
            ],
            [
                2500,
                2501
            ],
            [
                2504,
                2528
            ],
            [
                2529,
                2538
            ],
            [
                2539,
                2542
            ],
            [
                2543,
                2575
            ],
            [
                2575,
                2577
            ],
            [
                2577,
                2659
            ],
            [
                2660,
                2669
            ],
            [
                2670,
                2683
            ],
            [
                2686,
                2697
            ],
            [
                2698,
                2706
            ],
            [
                2714,
                2760
            ],
            [
                2765,
                2793
            ],
            [
                2800,
                2818
            ],
            [
                2831,
                2833
            ],
            [
                2840,
                2841
            ],
            [
                2846,
                2847
            ],
            [
                2848,
                2849
            ],
            [
                2855,
                2857
            ],
            [
                2860,
                2879
            ],
            [
                2880,
                2883
            ],
            [
                2884,
                2915
            ],
            [
                2932,
                2947
            ],
            [
                2952,
                2966
            ],
            [
                2971,
                2998
            ],
            [
                3004,
                3022
            ],
            [
                3024,
                3035
            ],
            [
                3041,
                3045
            ],
            [
                3051,
                3054
            ],
            [
                3058,
                3078
            ],
            [
                3079,
                3085
            ],
            [
                3088,
                3101
            ],
            [
                3109,
                3139
            ],
            [
                3142,
                3160
            ]
        ],
        "row_chars": [
            [
                0,
                205
            ],
            [
                205,
                211
            ],
            [
                211,
                346
            ],
            [
                346,
                600
            ],
            [
                600,
                624
            ],
            [
                624,
                944
            ],
            [
                944,
                1088
            ],
            [
                1088,
                1088
            ],
            [
                1088,
                1088
            ],
            [
                1088,
                1097
            ],
            [
                1097,
                1113
            ],
            [
                1113,
                1296
            ],
            [
                1296,
                1318
            ],
            [
                1318,
                1559
            ],
            [
                1559,
                1788
            ],
            [
                1788,
                1818
            ],
            [
                1818,
                1948
            ],
            [
                1948,
                2091
            ],
            [
                2091,
                2205
            ],
            [
                2205,
                2260
            ],
            [
                2260,
                2303
            ],
            [
                2303,
                2311
            ],
            [
                2311,
                2328
            ],
            [
                2328,
                2502
            ],
            [
                2502,
                2577
            ],
            [
                2577,
                2793
            ],
            [
                2793,
                2833
            ],
            [
                2833,
                2948
            ],
            [
                2948,
                3057
            ],
            [
                3057,
                3108
            ],
            [
                3108,
                3160
            ]
        ]
    }
}