{
    "original": {
        "text": "Zounds! ------------------------------------------------------------- -------------------------------------------------------------------- ------------Z------ds! cried _Phutatorius_, partly to himself----and yet high enough to be heard--and what seemed odd, 'twas uttered in a construction of look, and in a tone of voice, somewhat between that of a man in amazement and one in bodily pain.\nOne or two who had very nice ears, and could distinguish the expression and mixture of the two tones as plainly as a _third_ or a _fifth_, or any other chord in musick--were the most puzzled and perplexed with it--the concord was good in itself--but then 'twas quite out of the key, and no way applicable to the subject started; ----so that with all their knowledge, they could not tell what in the world to make of it.\nOthers who knew nothing of musical expression, and merely lent their ears to the plain import of the _word_, imagined that _Phutatorius_, who was somewhat of a cholerick spirit, was just going to snatch the cudgels out of _Didius's_ hands, in order to bemaul _Yorick_ to some purpose--and that the desperate monosyllable Z------ds was the exordium to an oration, which, as they judged from the sample, presaged but a rough kind of handling of him; so that my uncle _Toby's_ good-nature felt a pang for what _Yorick_ was about to undergo. But seeing _Phutatorius_ stop short, without any attempt or desire to go on--a third party began to suppose, that it was no more than an involuntary respiration, casually forming itself into the shape of a twelve-penny oath--without the sin or substance of one.\nOthers, and especially one or two who sat next him, looked upon it on the contrary as a real and substantial oath, propensly formed against _Yorick_, to whom he was known to bear no good liking--which said oath, as my father philosophized upon it, actually lay fretting and fuming at that very time in the upper regions of _Phutatorius's_ purtenance; and so was naturally, and according to the due course of things, first squeezed out by the sudden influx of blood which was driven into the right ventricle of _Phutatorius's_ heart, by the stroke of surprize which so strange a theory of preaching had excited.\nHow finely we argue upon mistaken facts!\nThere was not a soul busied in all these various reasonings upon the monosyllable which _Phutatorius_ uttered----who did not take this for granted, proceeding upon it as from an axiom, namely, that _Phutatorius's_ mind was intent upon the subject of debate which was arising between _Didius_ and _Yorick_; and indeed as he looked first towards the one and then towards the other, with the air of a man listening to what was going forwards--who would not have thought the same? But the truth was, that _Phutatorius_ knew not one word or one syllable of what was passing--but his whole thoughts and attention were taken up with a transaction which was going forwards at that very instant within the precincts of his own _Galligaskins_, and in a part of them, where of all others he stood most interested to watch accidents: So that notwithstanding he looked with all the attention in the world, and had gradually skrewed up every nerve and muscle in his face, to the utmost pitch the instrument would bear, in order, as it was thought, to give a sharp reply to _Yorick_, who sat over-against him----yet, I say, was _Yorick_ never once in any one domicile of _Phutatorius's_ brain----but the true cause of his exclamation lay at least a yard below.\nThis I will endeavour to explain to you with all imaginable decency.\nYou must be informed then, that _Gastripheres_, who had taken a turn into the kitchen a little before dinner, to see how things went on--observing a wicker-basket of fine chesnuts standing upon the dresser, had ordered that a hundred or two of them might be roasted and sent in, as soon as dinner was over---- _Gastripheres_ inforcing his orders about them, that _Didius_, but _Phutatorius_ especially, were particularly fond of 'em.\nAbout two minutes before the time that my uncle _Toby_ interrupted _Yorick's_ harangue--_Gastripheres's_ chesnuts were brought in--and as _Phutatorius's_ fondness for 'em was uppermost in the waiter's head, he laid them directly before _Phutatorius_, wrapt up hot in a clean damask napkin.\nNow whether it was physically impossible, with half a dozen hands all thrust into the napkin at a time--but that some one chesnut, of more life and rotundity than the rest, must be put in motion--it so fell out, however, that one was actually sent rolling off the table; and as _Phutatorius_ sat straddling under----it fell perpendicularly into that particular aperture of _Phutatorius's_ breeches, for which, to the shame and indelicacy of our language be it spoke, there is no chaste word throughout all _Johnson's_ dictionary----let it suffice to say----it was that particular aperture which, in all good societies, the laws of decorum do strictly require, like the temple of _Janus_ (in peace at least) to be universally shut up.\nThe neglect of this punctilio in _Phutatorius_ (which by the bye should be a warning to all mankind) had opened a door to this accident.----\nAccident I call it, in compliance to a received mode of speaking------but in no opposition to the opinion either of _Acrites_ or _Mythogeras_ in this matter; I know they were both prepossessed and fully persuaded of it--and are so to this hour, That there was nothing of accident in the whole event----but that the chesnut's taking that particular course and in a manner of its own accord--and then falling with all its heat directly into that one particular place, and no other----was a real judgment upon _Phutatorius_, for that filthy and obscene treatise _de Concubinis retinendis_, which _Phutatorius_ had published about twenty years ago----and was that identical week going to give the world a second edition of.\nIt is not my business to dip my pen in this controversy----much undoubtedly may be wrote on both sides of the question--all that concerns me as an historian, is to represent the matter of fact, and render it credible to the reader, that the hiatus in _Phutatorius's_ breeches was sufficiently wide to receive the chesnut; ----and that the chesnut, somehow or other, did fall perpendicularly and piping hot into it, without _Phutatorius's_ perceiving it, or any one else at that time.\nThe genial warmth which the chesnut imparted, was not undelectable for the first twenty or five-and-twenty seconds----and did no more than gently solicit _Phutatorius's_ attention towards the part: ------But the heat gradually increasing, and in a few seconds more getting beyond the point of all sober pleasure, and then advancing with all speed into the regions of pain, the soul of _Phutatorius_, together with all his ideas, his thoughts, his attention, his imagination, judgment, resolution, deliberation, ratiocination, memory, fancy, with ten battalions of animal spirits, all tumultuously crowded down, through different defiles and circuits, to the place of danger, leaving all his upper regions, as you may imagine, as empty as my purse.\nWith the best intelligence which all these messengers could bring him back, _Phutatorius_ was not able to dive into the secret of what was going forwards below, nor could he make any kind of conjecture, what the devil was the matter with it: However, as he knew not what the true cause might turn out, he deemed it most prudent, in the situation he was in at present, to bear it, if possible, like a Stoick; which, with the help of some wry faces and compursions of the mouth, he had certainly accomplished, had his imagination continued neuter; ----but the sallies of the imagination are ungovernable in things of this kind--a thought instantly darted into his mind, that tho' the anguish had the sensation of glowing heat--it might, notwithstanding that, be a bite as well as a burn; and if so, that possibly a _Newt_ or an _Asker_, or some such detested reptile, had crept up, and was fastening his teeth----the horrid idea of which, with a fresh glow of pain arising that instant from the chesnut, seized _Phutatorius_ with a sudden panick, and in the first terrifying disorder of the passion, it threw him, as it has done the best generals upon earth, quite off his guard: ----the effect of which was this, that he leapt incontinently up, uttering as he rose that interjection of surprise so much descanted upon, with the aposiopestic break after it, marked thus, Z------ds--which, though not strictly canonical, was still as little as any man could have said upon the occasion; ------and which, by the bye, whether canonical or not, _Phutatorius_ could no more help than he could the cause of it.\nThough this has taken up some time in the narrative, it took up little more time in the transaction, than just to allow for _Phutatorius_ to draw forth the chesnut, and throw it down with violence upon the floor--and for _Yorick_ to rise from his chair, and pick the chesnut up.\nIt is curious to observe the triumph of slight incidents over the mind: ----What incredible weight they have in forming and governing our opinions, both of men and things----that trifles, light as air, shall waft a belief into the soul, and plant it so immoveably within it----that _Euclid's_ demonstrations, could they be brought to batter it in breach, should not all have power to overthrow it.\n_Yorick_, I said, picked up the chesnut which _Phutatorius's_ wrath had flung down----the action was trifling ----I am ashamed to account for it--he did it, for no reason, but that he thought the chesnut not a jot worse for the adventure--and that he held a good chesnut worth stooping for. ------But this incident, trifling as it was, wrought differently in _Phutatorius's_ head: He considered this act of _Yorick's_ in getting off his chair and picking up the chesnut, as a plain acknowledgment in him, that the chesnut was originally his--and in course, that it must have been the owner of the chesnut, and no one else, who could have played him such a prank with it: What greatly confirmed him in this opinion, was this, that the table being parallelogramical and very narrow, it afforded a fair opportunity for _Yorick_, who sat directly over against _Phutatorius_, of slipping the chesnut in----and consequently that he did it. The look of something more than suspicion, which _Phutatorius_ cast full upon _Yorick_ as these thoughts arose, too evidently spoke his opinion----and as _Phutatorius_ was naturally supposed to know more of the matter than any person besides, his opinion at once became the general one; ----and for a reason very different from any which have been yet given----in a little time it was put out of all manner of dispute.\nWhen great or unexpected events fall out upon the stage of this sublunary world----the mind of man, which is an inquisitive kind of substance, naturally takes a flight behind the scenes to see what is the cause and first spring of them. --The search was not long in this instance.\nIt was well known that _Yorick_ had never a good opinion of the treatise which _Phutatorius_ had wrote _de Concubinis retinendis_, as a thing which he feared had done hurt in the world----and 'twas easily found out, that there was a mystical meaning in _Yorick's_ prank--and that his chucking the chesnut hot into _Phutatorius's_ ***----*****, was a sarcastical fling at his book--the doctrines of which, they said, had enflamed many an honest man in the same place.\nThis conceit awaken'd _Somnolentus_----made _Agelastes_ smile----and if you can recollect the precise look and air of a man's face intent in finding out a riddle------it threw _Gastripheres's_ into that form--and in short was thought by many to be a master-stroke of arch-wit.\nThis, as the reader has seen from one end to the other, was as groundless as the dreams of philosophy: _Yorick_, no doubt, as _Shakespeare_ said of his ancestor------ \"_was a man of jest_,\" but it was temper'd with something which withheld him from that, and many other ungracious pranks, of which he as undeservedly bore the blame; --but it was his misfortune all his life long to bear the imputation of saying and doing a thousand things, of which (unless my esteem blinds me) his nature was incapable. All I blame him for----or rather, all I blame and alternately like him for, was that singularity of his temper, which would never suffer him to take pains to set a story right with the world, however in his power. In every ill usage of that sort, he acted precisely as in the affair of his lean horse----he could have explained it to his honour, but his spirit was above it; and besides, he ever looked upon the inventor, the propagator and believer of an illiberal report alike so injurious to him--he could not stoop to tell his story to them--and so trusted to time and truth to do it for him.\nThis heroic cast produced him inconveniences in many respects--in the present it was followed by the fixed resentment of _Phutatorius_, who, as _Yorick_ had just made an end of his chesnut, rose up from his chair a second time, to let him know it--which indeed he did with a smile; saying only--that he would endeavour not to forget the obligation.\nBut you must mark and carefully separate and distinguish these two things in your mind.\n----The smile was for the company.\n----The threat was for _Yorick_.",
        "paragraph_chars": [
            [
                0,
                391
            ],
            [
                391,
                811
            ],
            [
                811,
                1611
            ],
            [
                1611,
                2222
            ],
            [
                2222,
                2263
            ],
            [
                2263,
                3509
            ],
            [
                3509,
                3578
            ],
            [
                3578,
                4012
            ],
            [
                4012,
                4302
            ],
            [
                4302,
                5036
            ],
            [
                5036,
                5177
            ],
            [
                5177,
                5897
            ],
            [
                5897,
                6381
            ],
            [
                6381,
                7129
            ],
            [
                7129,
                8732
            ],
            [
                8732,
                9011
            ],
            [
                9011,
                9409
            ],
            [
                9409,
                10762
            ],
            [
                10762,
                11043
            ],
            [
                11043,
                11510
            ],
            [
                11510,
                11787
            ],
            [
                11787,
                12889
            ],
            [
                12889,
                13238
            ],
            [
                13238,
                13326
            ],
            [
                13326,
                13361
            ],
            [
                13361,
                13393
            ]
        ],
        "segment_chars": [
            [
                0,
                8
            ],
            [
                8,
                162
            ],
            [
                162,
                391
            ],
            [
                391,
                811
            ],
            [
                811,
                1349
            ],
            [
                1349,
                1611
            ],
            [
                1611,
                2222
            ],
            [
                2222,
                2263
            ],
            [
                2263,
                2740
            ],
            [
                2740,
                3509
            ],
            [
                3509,
                3578
            ],
            [
                3578,
                4012
            ],
            [
                4012,
                4302
            ],
            [
                4302,
                5036
            ],
            [
                5036,
                5177
            ],
            [
                5177,
                5897
            ],
            [
                5897,
                6381
            ],
            [
                6381,
                7129
            ],
            [
                7129,
                8732
            ],
            [
                8732,
                9011
            ],
            [
                9011,
                9409
            ],
            [
                9409,
                9700
            ],
            [
                9700,
                10343
            ],
            [
                10343,
                10762
            ],
            [
                10762,
                10999
            ],
            [
                10999,
                11043
            ],
            [
                11043,
                11510
            ],
            [
                11510,
                11787
            ],
            [
                11787,
                12292
            ],
            [
                12292,
                12506
            ],
            [
                12506,
                12889
            ],
            [
                12889,
                13238
            ],
            [
                13238,
                13326
            ],
            [
                13326,
                13361
            ],
            [
                13361,
                13393
            ]
        ],
        "overlap_chars": [
            [
                0,
                8
            ],
            [
                139,
                151
            ],
            [
                151,
                152
            ],
            [
                158,
                160
            ],
            [
                162,
                167
            ],
            [
                169,
                180
            ],
            [
                181,
                200
            ],
            [
                256,
                257
            ],
            [
                208,
                235
            ],
            [
                297,
                298
            ],
            [
                303,
                312
            ],
            [
                332,
                339
            ],
            [
                357,
                370
            ],
            [
                378,
                391
            ],
            [
                391,
                401
            ],
            [
                430,
                451
            ],
            [
                467,
                507
            ],
            [
                522,
                527
            ],
            [
                543,
                551
            ],
            [
                637,
                640
            ],
            [
                758,
                811
            ],
            [
                811,
                817
            ],
            [
                920,
                933
            ],
            [
                935,
                946
            ],
            [
                947,
                956
            ],
            [
                1289,
                1290
            ],
            [
                856,
                857
            ],
            [
                1327,
                1339
            ],
            [
                1014,
                1025
            ],
            [
                1196,
                1200
            ],
            [
                1034,
                1040
            ],
            [
                858,
                861
            ],
            [
                1071,
                1077
            ],
            [
                1096,
                1149
            ],
            [
                885,
                887
            ],
            [
                969,
                970
            ],
            [
                1347,
                1349
            ],
            [
                1349,
                1359
            ],
            [
                1361,
                1372
            ],
            [
                1374,
                1385
            ],
            [
                1458,
                1497
            ],
            [
                1509,
                1539
            ],
            [
                1568,
                1572
            ],
            [
                1561,
                1562
            ],
            [
                1574,
                1589
            ],
            [
                1603,
                1611
            ],
            [
                1645,
                1657
            ],
            [
                1761,
                1763
            ],
            [
                1658,
                1661
            ],
            [
                1663,
                1677
            ],
            [
                1617,
                1618
            ],
            [
                1678,
                1693
            ],
            [
                1661,
                1662
            ],
            [
                1694,
                1703
            ],
            [
                1720,
                1724
            ],
            [
                1743,
                1750
            ],
            [
                1752,
                1758
            ],
            [
                1724,
                1725
            ],
            [
                1764,
                1784
            ],
            [
                1817,
                1821
            ],
            [
                2033,
                2052
            ],
            [
                2170,
                2212
            ],
            [
                2220,
                2222
            ],
            [
                2222,
                2263
            ],
            [
                2263,
                2268
            ],
            [
                2456,
                2460
            ],
            [
                2462,
                2475
            ],
            [
                2477,
                2501
            ],
            [
                2513,
                2519
            ],
            [
                2538,
                2545
            ],
            [
                2547,
                2553
            ],
            [
                2555,
                2558
            ],
            [
                2560,
                2566
            ],
            [
                2567,
                2579
            ],
            [
                2583,
                2623
            ],
            [
                2632,
                2674
            ],
            [
                2740,
                2763
            ],
            [
                2765,
                2776
            ],
            [
                2778,
                2795
            ],
            [
                2812,
                2831
            ],
            [
                3344,
                3345
            ],
            [
                2837,
                2840
            ],
            [
                2847,
                2855
            ],
            [
                2870,
                2888
            ],
            [
                2903,
                2912
            ],
            [
                2928,
                2955
            ],
            [
                2973,
                2980
            ],
            [
                2995,
                3018
            ],
            [
                3020,
                3025
            ],
            [
                3040,
                3042
            ],
            [
                3284,
                3287
            ],
            [
                3049,
                3064
            ],
            [
                3085,
                3087
            ],
            [
                3109,
                3163
            ],
            [
                3182,
                3190
            ],
            [
                3201,
                3220
            ],
            [
                3360,
                3363
            ],
            [
                3448,
                3485
            ],
            [
                3495,
                3509
            ],
            [
                3509,
                3520
            ],
            [
                3531,
                3541
            ],
            [
                3549,
                3553
            ],
            [
                3569,
                3578
            ],
            [
                3611,
                3623
            ],
            [
                3624,
                3633
            ],
            [
                3647,
                3663
            ],
            [
                3673,
                3713
            ],
            [
                3725,
                3748
            ],
            [
                3753,
                3811
            ],
            [
                3819,
                3855
            ],
            [
                3868,
                3874
            ],
            [
                3603,
                3604
            ],
            [
                3942,
                3948
            ],
            [
                3855,
                3856
            ],
            [
                3956,
                3967
            ],
            [
                3969,
                3985
            ],
            [
                3999,
                4012
            ],
            [
                4037,
                4040
            ],
            [
                4121,
                4141
            ],
            [
                4143,
                4149
            ],
            [
                4151,
                4164
            ],
            [
                4166,
                4247
            ],
            [
                4249,
                4260
            ],
            [
                4261,
                4262
            ],
            [
                4269,
                4302
            ],
            [
                4302,
                4305
            ],
            [
                4342,
                4343
            ],
            [
                4420,
                4423
            ],
            [
                4428,
                4479
            ],
            [
                4483,
                4496
            ],
            [
                4314,
                4320
            ],
            [
                4545,
                4579
            ],
            [
                4581,
                4592
            ],
            [
                4594,
                4604
            ],
            [
                4609,
                4614
            ],
            [
                4618,
                4625
            ],
            [
                4642,
                4662
            ],
            [
                4672,
                4674
            ],
            [
                4676,
                4689
            ],
            [
                4691,
                4710
            ],
            [
                4769,
                4792
            ],
            [
                4990,
                4992
            ],
            [
                4809,
                4818
            ],
            [
                4820,
                4830
            ],
            [
                4834,
                4855
            ],
            [
                4859,
                4870
            ],
            [
                4891,
                4940
            ],
            [
                4944,
                4960
            ],
            [
                5009,
                5014
            ],
            [
                5027,
                5036
            ],
            [
                5070,
                5081
            ],
            [
                5040,
                5055
            ],
            [
                5137,
                5172
            ],
            [
                5186,
                5195
            ],
            [
                5333,
                5334
            ],
            [
                5247,
                5250
            ],
            [
                5294,
                5301
            ],
            [
                5370,
                5373
            ],
            [
                5311,
                5317
            ],
            [
                5347,
                5356
            ],
            [
                5422,
                5436
            ],
            [
                5254,
                5256
            ],
            [
                5448,
                5459
            ],
            [
                5393,
                5395
            ],
            [
                5479,
                5491
            ],
            [
                5496,
                5501
            ],
            [
                5576,
                5583
            ],
            [
                5602,
                5620
            ],
            [
                5625,
                5641
            ],
            [
                5659,
                5664
            ],
            [
                5670,
                5683
            ],
            [
                5685,
                5696
            ],
            [
                5697,
                5702
            ],
            [
                5708,
                5714
            ],
            [
                5727,
                5735
            ],
            [
                5737,
                5761
            ],
            [
                5762,
                5769
            ],
            [
                5784,
                5816
            ],
            [
                5195,
                5196
            ],
            [
                5824,
                5836
            ],
            [
                5847,
                5897
            ],
            [
                5897,
                5952
            ],
            [
                6017,
                6037
            ],
            [
                6055,
                6057
            ],
            [
                6003,
                6006
            ],
            [
                6085,
                6089
            ],
            [
                6129,
                6137
            ],
            [
                6145,
                6147
            ],
            [
                6149,
                6162
            ],
            [
                6164,
                6176
            ],
            [
                6190,
                6194
            ],
            [
                6195,
                6209
            ],
            [
                6214,
                6218
            ],
            [
                6245,
                6261
            ],
            [
                6292,
                6319
            ],
            [
                6379,
                6381
            ],
            [
                6381,
                6398
            ],
            [
                6671,
                6673
            ],
            [
                6405,
                6408
            ],
            [
                6413,
                6416
            ],
            [
                6427,
                6434
            ],
            [
                6448,
                6468
            ],
            [
                6488,
                6495
            ],
            [
                6469,
                6471
            ],
            [
                6476,
                6477
            ],
            [
                6499,
                6526
            ],
            [
                6536,
                6549
            ],
            [
                6551,
                6560
            ],
            [
                6569,
                6577
            ],
            [
                6585,
                6597
            ],
            [
                6608,
                6618
            ],
            [
                6722,
                6727
            ],
            [
                6728,
                6765
            ],
            [
                6767,
                6778
            ],
            [
                6779,
                6794
            ],
            [
                6810,
                6823
            ],
            [
                6828,
                6837
            ],
            [
                6477,
                6480
            ],
            [
                6856,
                6864
            ],
            [
                6959,
                6990
            ],
            [
                7032,
                7063
            ],
            [
                7068,
                7085
            ],
            [
                7107,
                7129
            ],
            [
                7206,
                7217
            ],
            [
                7637,
                7640
            ],
            [
                8688,
                8690
            ],
            [
                7256,
                7273
            ],
            [
                7283,
                7311
            ],
            [
                7332,
                7361
            ],
            [
                7371,
                7378
            ],
            [
                7429,
                7484
            ],
            [
                7495,
                7532
            ],
            [
                7535,
                7575
            ],
            [
                7604,
                7635
            ],
            [
                8730,
                8732
            ],
            [
                7679,
                7682
            ],
            [
                7134,
                7137
            ],
            [
                7757,
                7764
            ],
            [
                7775,
                7801
            ],
            [
                8516,
                8522
            ],
            [
                7807,
                7818
            ],
            [
                7848,
                7852
            ],
            [
                8225,
                8229
            ],
            [
                7415,
                7420
            ],
            [
                7380,
                7382
            ],
            [
                7886,
                7895
            ],
            [
                7904,
                7918
            ],
            [
                7926,
                7939
            ],
            [
                7967,
                7971
            ],
            [
                7977,
                7993
            ],
            [
                7995,
                8026
            ],
            [
                8031,
                8036
            ],
            [
                7731,
                7733
            ],
            [
                7195,
                7198
            ],
            [
                7755,
                7756
            ],
            [
                8044,
                8055
            ],
            [
                7156,
                7161
            ],
            [
                8131,
                8137
            ],
            [
                8139,
                8150
            ],
            [
                8152,
                8165
            ],
            [
                8172,
                8177
            ],
            [
                8230,
                8239
            ],
            [
                8286,
                8305
            ],
            [
                8311,
                8321
            ],
            [
                7219,
                7222
            ],
            [
                8341,
                8354
            ],
            [
                8369,
                8381
            ],
            [
                7880,
                7884
            ],
            [
                8498,
                8507
            ],
            [
                8325,
                8334
            ],
            [
                7245,
                7248
            ],
            [
                8570,
                8611
            ],
            [
                8873,
                8877
            ],
            [
                8878,
                8887
            ],
            [
                8892,
                8896
            ],
            [
                8907,
                8914
            ],
            [
                8929,
                8943
            ],
            [
                8897,
                8900
            ],
            [
                8954,
                8960
            ],
            [
                8785,
                8787
            ],
            [
                9007,
                9011
            ],
            [
                9011,
                9082
            ],
            [
                9087,
                9130
            ],
            [
                9145,
                9158
            ],
            [
                9261,
                9263
            ],
            [
                9185,
                9212
            ],
            [
                9219,
                9260
            ],
            [
                9264,
                9281
            ],
            [
                9407,
                9409
            ],
            [
                9410,
                9416
            ],
            [
                9417,
                9418
            ],
            [
                9419,
                9440
            ],
            [
                9445,
                9448
            ],
            [
                9495,
                9518
            ],
            [
                9555,
                9589
            ],
            [
                9665,
                9671
            ],
            [
                9609,
                9612
            ],
            [
                9680,
                9699
            ],
            [
                9706,
                9744
            ],
            [
                9753,
                9767
            ],
            [
                9769,
                9782
            ],
            [
                9784,
                9788
            ],
            [
                9790,
                9803
            ],
            [
                9817,
                9825
            ],
            [
                9809,
                9812
            ],
            [
                9880,
                9905
            ],
            [
                9914,
                9922
            ],
            [
                9927,
                9949
            ],
            [
                9852,
                9855
            ],
            [
                9966,
                9988
            ],
            [
                10226,
                10232
            ],
            [
                10032,
                10035
            ],
            [
                10047,
                10057
            ],
            [
                10063,
                10070
            ],
            [
                10139,
                10154
            ],
            [
                10177,
                10192
            ],
            [
                10233,
                10242
            ],
            [
                9909,
                9913
            ],
            [
                9867,
                9870
            ],
            [
                10209,
                10220
            ],
            [
                10280,
                10295
            ],
            [
                10300,
                10306
            ],
            [
                10310,
                10326
            ],
            [
                10266,
                10277
            ],
            [
                10332,
                10342
            ],
            [
                10343,
                10354
            ],
            [
                10375,
                10384
            ],
            [
                10386,
                10391
            ],
            [
                10393,
                10404
            ],
            [
                10422,
                10428
            ],
            [
                10469,
                10486
            ],
            [
                10490,
                10496
            ],
            [
                10498,
                10509
            ],
            [
                10511,
                10569
            ],
            [
                10570,
                10576
            ],
            [
                10584,
                10628
            ],
            [
                10760,
                10762
            ],
            [
                10973,
                10976
            ],
            [
                10905,
                10914
            ],
            [
                10860,
                10861
            ],
            [
                10963,
                10972
            ],
            [
                10818,
                10825
            ],
            [
                10997,
                10999
            ],
            [
                11001,
                11024
            ],
            [
                11041,
                11043
            ],
            [
                11043,
                11065
            ],
            [
                11067,
                11073
            ],
            [
                11075,
                11102
            ],
            [
                11358,
                11371
            ],
            [
                11107,
                11115
            ],
            [
                11172,
                11173
            ],
            [
                11147,
                11171
            ],
            [
                11231,
                11240
            ],
            [
                11259,
                11295
            ],
            [
                11297,
                11305
            ],
            [
                11307,
                11312
            ],
            [
                11257,
                11258
            ],
            [
                11314,
                11339
            ],
            [
                11348,
                11351
            ],
            [
                11344,
                11347
            ],
            [
                11352,
                11356
            ],
            [
                11123,
                11134
            ],
            [
                11387,
                11422
            ],
            [
                11424,
                11446
            ],
            [
                11459,
                11510
            ],
            [
                11510,
                11514
            ],
            [
                11732,
                11787
            ],
            [
                11787,
                11815
            ],
            [
                11841,
                11846
            ],
            [
                11850,
                11860
            ],
            [
                11888,
                11889
            ],
            [
                11891,
                11897
            ],
            [
                11956,
                11959
            ],
            [
                11960,
                11973
            ],
            [
                12266,
                12276
            ],
            [
                12018,
                12056
            ],
            [
                12068,
                12087
            ],
            [
                12091,
                12118
            ],
            [
                12126,
                12160
            ],
            [
                12166,
                12177
            ],
            [
                11875,
                11877
            ],
            [
                12209,
                12236
            ],
            [
                12277,
                12292
            ],
            [
                12292,
                12311
            ],
            [
                12338,
                12341
            ],
            [
                12354,
                12366
            ],
            [
                12368,
                12376
            ],
            [
                12410,
                12421
            ],
            [
                12450,
                12483
            ],
            [
                12504,
                12506
            ],
            [
                12506,
                12592
            ],
            [
                12596,
                12641
            ],
            [
                12680,
                12682
            ],
            [
                12801,
                12831
            ],
            [
                12792,
                12794
            ],
            [
                12845,
                12889
            ],
            [
                12889,
                12905
            ],
            [
                13063,
                13065
            ],
            [
                12919,
                12927
            ],
            [
                12915,
                12918
            ],
            [
                12967,
                13009
            ],
            [
                13011,
                13022
            ],
            [
                13023,
                13028
            ],
            [
                13079,
                13101
            ],
            [
                13157,
                13177
            ],
            [
                13184,
                13197
            ],
            [
                13208,
                13211
            ],
            [
                13215,
                13238
            ],
            [
                13330,
                13361
            ],
            [
                13365,
                13383
            ],
            [
                13385,
                13391
            ]
        ],
        "row_chars": [
            [
                0,
                8
            ],
            [
                8,
                162
            ],
            [
                162,
                391
            ],
            [
                391,
                811
            ],
            [
                811,
                1349
            ],
            [
                1349,
                1611
            ],
            [
                1611,
                2222
            ],
            [
                2222,
                2263
            ],
            [
                2263,
                2740
            ],
            [
                2740,
                3509
            ],
            [
                3509,
                3578
            ],
            [
                3578,
                4012
            ],
            [
                4012,
                4302
            ],
            [
                4302,
                5036
            ],
            [
                5036,
                5177
            ],
            [
                5177,
                5897
            ],
            [
                5897,
                6381
            ],
            [
                6381,
                7129
            ],
            [
                7129,
                8732
            ],
            [
                8732,
                9011
            ],
            [
                9011,
                9409
            ],
            [
                9409,
                9700
            ],
            [
                9700,
                10343
            ],
            [
                10343,
                10762
            ],
            [
                10762,
                10999
            ],
            [
                10999,
                11043
            ],
            [
                11043,
                11510
            ],
            [
                11510,
                11787
            ],
            [
                11787,
                12292
            ],
            [
                12292,
                12506
            ],
            [
                12506,
                12889
            ],
            [
                12889,
                13238
            ],
            [
                13238,
                13326
            ],
            [
                13326,
                13361
            ],
            [
                13361,
                13393
            ]
        ]
    },
    "abridged": {
        "text": "'Zounds! --------- --------- ------------ -------- ---------- ------------ --------- Z-----ds!' cried Phutatorius, partly to himself, yet high enough to be heard, in a tone between amazement and bodily pain.\nOne or two could distinguish the mixture of the two tones as plainly as a fifth chord in music - but they could not tell what in the world to make of it.\nOthers imagined that Phutatorius, who was short-tempered, was about to take the cudgels from Didius and attack Yorick - and that the desperate monosyllable Z------ds was the introduction to a forceful speech. But seeing Phutatorius stop short, they then supposed that it was no more than an involuntary breath, casually forming itself into an oath - without the sin of one.\nThose who sat next to him looked upon it, on the contrary, as a real oath against Yorick, whom he was known to not like - this oath being squeezed out by the surprise which so strange a theory of preaching had given him.\nHow finely we argue upon mistaken facts!\nEverybody there assumed that Phutatorius's mind was intent upon the debate between Didius and Yorick; and indeed he looked first towards the one and then the other, with the air of a man listening.\nBut the truth was, that Phutatorius knew not one word of what was passing - his thoughts were taken up with something which was happening at that very instant within his own breeches, and in a part of them where he was most interested. So although he looked with all the attention in the world, and had screwed up every muscle in his face, - yet the true cause of his exclamation lay a yard below.\nThis I will try to explain with decency.\nGastripheres, who had wandered into the kitchen before dinner, to see how things went on - observing a wicker-basket of fine chestnuts standing upon the dresser, had ordered that a hundred of them might be roasted and sent in after dinner, because Didius, and Phutatorius especially, were fond of 'em.\nThe chestnuts were brought in - and as Phutatorius's fondness for 'em was uppermost in the waiter's head, he laid them directly before Phutatorius, wrapped up hot in a clean damask napkin.\nNow, one chestnut, of more life and rotundity than the rest, must have been put in motion - it was sent rolling off the table; and as Phutatorius sat straddled under - it fell straight into that particular opening of Phutatorius's breeches, for which there is no chaste word in Johnson's dictionary. Let it suffice to say - it was that opening which, in all good societies, the laws of decorum strictly require to be shut up.\nPhutatorius's neglect of this rule had opened a door to this accident.\n- Accident I call it; but Acrites and Mythogeras were both sure that there was no accident in it - but that the hot chestnut's falling directly into that particular place was a judgment upon Phutatorius, for his filthy treatise de Concubinis retinendis, which he had published about twenty years earlier, and was that week going to give the world a second edition of.\nIt is not my business to dip my pen in this controversy - all that concerns me is the fact that the gap in Phutatorius's breeches was wide enough to receive the chestnut; which somehow or other fell piping hot into it, without anyone noticing.\nThe genial warmth of the chestnut was not unpleasant for the first twenty seconds or so - and did no more than gently call Phutatorius's attention to the part.\nBut the heat increasing speedily into the regions of pain, the soul of Phutatorius, together with his thoughts, attention and judgment, all tumultuously crowded down to the place of danger, leaving his upper regions as empty as my purse.\nPhutatorius had no idea of what was going on below, nor could he make any guess what the devil was the matter. However, he deemed it most prudent, in the situation he was in, to bear it, if possible, like a Stoic; which, with the help of some wry faces, he had certainly accomplished.\nBut then the thought darted into his mind, that though the anguish felt like heat, it might just as likely be a bite as a burn; and that possibly some detested reptile had crept up, and was fastening its teeth in him - a horrid idea which seized Phutatorius with a sudden panic, and threw him quite off his guard.\nThe effect was that he leapt up, uttering that Z------ds - which was the least any man could have said upon the occasion.\nDrawing forth the chestnut, he threw it down violently upon the floor - and Yorick picked it up.\nIt is curious to observe the triumph of slight incidents over the mind: - what incredible weight they have in forming our opinions, - so that trifles, light as air, waft a belief into the soul, and plant it immoveably within.\nYorick, as I said, picked up the chestnut - the action was trifling - he did it, for no reason, but that a good chestnut was worth stooping for.\nBut this incident, trifling as it was, worked differently in Phutatorius's head. He considered Yorick's act as a plain acknowledgment that the chestnut was originally his - and that it must have been Yorick who had played him a prank. The table being very narrow, it gave Yorick, who sat opposite him, the opportunity of slipping the chestnut in - and consequently Phutatorius assumed he did it.\nThe look of suspicion which Phutatorius gave Yorick spoke his opinion - and as Phutatorius was naturally supposed to know more of the matter than any other person, his opinion at once became the general one.\nAnd naturally, men looked for the cause of this. - The search was not long.\nIt was well known that Yorick had never a good opinion of Phutatorius's treatise, de Concubinis retinendis - and 'twas decided that there was a mystical meaning in Yorick's prank, and that his chucking the hot chestnut into Phutatorius's breeches was a sarcastical fling at his book - the doctrines of which had enflamed many an honest man in the same place.\nThis idea was thought by many to be a master-stroke of arch-wit.\nThis, as the reader has seen, was groundless: though Yorick was 'a man of jest,' his nature withheld him from that, and many other pranks, of which he undeservedly bore the blame. It was his misfortune all his life to bear the blame of a thousand things, of which he was incapable. All I blame him for - and also like him for - was that he would never set a story right with the world, even if he could. In every ill usage of that sort, he acted precisely as in the affair of his lean horse - he could have explained it to his honour, but he would not stoop to tell his story to those who believed ungenerous reports. He trusted to time and truth to do it for him.\nThis heroic cast of mind often inconvenienced him; here it was followed by the fixed resentment of Phutatorius, who rose up from his chair with a smile; saying that he would not forget the obligation.\n- The smile was for the company.\n- The threat was for Yorick.",
        "paragraph_chars": [
            [
                0,
                208
            ],
            [
                208,
                362
            ],
            [
                362,
                736
            ],
            [
                736,
                957
            ],
            [
                957,
                998
            ],
            [
                998,
                1196
            ],
            [
                1196,
                1594
            ],
            [
                1594,
                1635
            ],
            [
                1635,
                1937
            ],
            [
                1937,
                2126
            ],
            [
                2126,
                2552
            ],
            [
                2552,
                2623
            ],
            [
                2623,
                2991
            ],
            [
                2991,
                3235
            ],
            [
                3235,
                3395
            ],
            [
                3395,
                3633
            ],
            [
                3633,
                3918
            ],
            [
                3918,
                4232
            ],
            [
                4232,
                4354
            ],
            [
                4354,
                4451
            ],
            [
                4451,
                4677
            ],
            [
                4677,
                4822
            ],
            [
                4822,
                5218
            ],
            [
                5218,
                5426
            ],
            [
                5426,
                5502
            ],
            [
                5502,
                5861
            ],
            [
                5861,
                5926
            ],
            [
                5926,
                6591
            ],
            [
                6591,
                6792
            ],
            [
                6792,
                6825
            ],
            [
                6825,
                6853
            ]
        ],
        "segment_chars": [
            [
                0,
                9
            ],
            [
                9,
                96
            ],
            [
                96,
                208
            ],
            [
                208,
                362
            ],
            [
                362,
                571
            ],
            [
                571,
                736
            ],
            [
                736,
                957
            ],
            [
                957,
                998
            ],
            [
                998,
                1196
            ],
            [
                1196,
                1432
            ],
            [
                1432,
                1594
            ],
            [
                1594,
                1635
            ],
            [
                1635,
                1937
            ],
            [
                1937,
                2126
            ],
            [
                2126,
                2426
            ],
            [
                2426,
                2552
            ],
            [
                2552,
                2623
            ],
            [
                2623,
                2991
            ],
            [
                2991,
                3235
            ],
            [
                3235,
                3395
            ],
            [
                3395,
                3633
            ],
            [
                3633,
                3744
            ],
            [
                3744,
                3918
            ],
            [
                3918,
                4232
            ],
            [
                4232,
                4354
            ],
            [
                4354,
                4451
            ],
            [
                4451,
                4677
            ],
            [
                4677,
                4822
            ],
            [
                4822,
                4903
            ],
            [
                4903,
                5057
            ],
            [
                5057,
                5218
            ],
            [
                5218,
                5426
            ],
            [
                5426,
                5475
            ],
            [
                5475,
                5502
            ],
            [
                5502,
                5861
            ],
            [
                5861,
                5926
            ],
            [
                5926,
                6106
            ],
            [
                6106,
                6208
            ],
            [
                6208,
                6330
            ],
            [
                6330,
                6544
            ],
            [
                6544,
                6591
            ],
            [
                6591,
                6792
            ],
            [
                6792,
                6825
            ],
            [
                6825,
                6853
            ]
        ],
        "overlap_chars": [
            [
                1,
                9
            ],
            [
                29,
                41
            ],
            [
                85,
                86
            ],
            [
                91,
                93
            ],
            [
                96,
                101
            ],
            [
                102,
                113
            ],
            [
                113,
                132
            ],
            [
                132,
                133
            ],
            [
                134,
                161
            ],
            [
                161,
                162
            ],
            [
                163,
                172
            ],
            [
                173,
                180
            ],
            [
                181,
                194
            ],
            [
                195,
                208
            ],
            [
                208,
                218
            ],
            [
                219,
                240
            ],
            [
                241,
                281
            ],
            [
                282,
                287
            ],
            [
                288,
                296
            ],
            [
                305,
                308
            ],
            [
                309,
                362
            ],
            [
                362,
                368
            ],
            [
                369,
                382
            ],
            [
                383,
                394
            ],
            [
                394,
                403
            ],
            [
                409,
                410
            ],
            [
                418,
                419
            ],
            [
                420,
                432
            ],
            [
                438,
                449
            ],
            [
                450,
                454
            ],
            [
                455,
                461
            ],
            [
                462,
                465
            ],
            [
                473,
                479
            ],
            [
                482,
                535
            ],
            [
                549,
                551
            ],
            [
                552,
                553
            ],
            [
                569,
                571
            ],
            [
                571,
                581
            ],
            [
                582,
                593
            ],
            [
                594,
                605
            ],
            [
                625,
                664
            ],
            [
                671,
                701
            ],
            [
                705,
                709
            ],
            [
                710,
                711
            ],
            [
                712,
                727
            ],
            [
                728,
                736
            ],
            [
                742,
                754
            ],
            [
                755,
                757
            ],
            [
                758,
                761
            ],
            [
                762,
                776
            ],
            [
                776,
                777
            ],
            [
                778,
                793
            ],
            [
                793,
                794
            ],
            [
                795,
                804
            ],
            [
                805,
                809
            ],
            [
                810,
                817
            ],
            [
                818,
                824
            ],
            [
                824,
                825
            ],
            [
                826,
                846
            ],
            [
                863,
                867
            ],
            [
                874,
                893
            ],
            [
                903,
                945
            ],
            [
                955,
                957
            ],
            [
                957,
                998
            ],
            [
                1008,
                1013
            ],
            [
                1022,
                1026
            ],
            [
                1027,
                1040
            ],
            [
                1041,
                1065
            ],
            [
                1066,
                1072
            ],
            [
                1073,
                1080
            ],
            [
                1081,
                1087
            ],
            [
                1088,
                1091
            ],
            [
                1092,
                1098
            ],
            [
                1098,
                1110
            ],
            [
                1111,
                1151
            ],
            [
                1152,
                1194
            ],
            [
                1196,
                1219
            ],
            [
                1220,
                1231
            ],
            [
                1232,
                1249
            ],
            [
                1250,
                1269
            ],
            [
                1270,
                1271
            ],
            [
                1272,
                1275
            ],
            [
                1276,
                1284
            ],
            [
                1285,
                1303
            ],
            [
                1314,
                1323
            ],
            [
                1334,
                1361
            ],
            [
                1362,
                1369
            ],
            [
                1378,
                1401
            ],
            [
                1402,
                1407
            ],
            [
                1408,
                1410
            ],
            [
                1411,
                1414
            ],
            [
                1415,
                1430
            ],
            [
                1432,
                1434
            ],
            [
                1444,
                1498
            ],
            [
                1507,
                1515
            ],
            [
                1516,
                1535
            ],
            [
                1538,
                1541
            ],
            [
                1542,
                1579
            ],
            [
                1580,
                1594
            ],
            [
                1594,
                1605
            ],
            [
                1610,
                1620
            ],
            [
                1621,
                1625
            ],
            [
                1626,
                1635
            ],
            [
                1635,
                1647
            ],
            [
                1647,
                1656
            ],
            [
                1666,
                1682
            ],
            [
                1683,
                1723
            ],
            [
                1736,
                1759
            ],
            [
                1765,
                1823
            ],
            [
                1824,
                1860
            ],
            [
                1867,
                1873
            ],
            [
                1873,
                1874
            ],
            [
                1883,
                1889
            ],
            [
                1889,
                1890
            ],
            [
                1895,
                1906
            ],
            [
                1907,
                1923
            ],
            [
                1924,
                1937
            ],
            [
                1937,
                1940
            ],
            [
                1946,
                1966
            ],
            [
                1969,
                1975
            ],
            [
                1976,
                1989
            ],
            [
                1990,
                2071
            ],
            [
                2072,
                2083
            ],
            [
                2083,
                2084
            ],
            [
                2093,
                2126
            ],
            [
                2126,
                2129
            ],
            [
                2129,
                2130
            ],
            [
                2131,
                2134
            ],
            [
                2140,
                2191
            ],
            [
                2202,
                2215
            ],
            [
                2218,
                2224
            ],
            [
                2225,
                2259
            ],
            [
                2260,
                2271
            ],
            [
                2272,
                2282
            ],
            [
                2286,
                2291
            ],
            [
                2294,
                2301
            ],
            [
                2311,
                2331
            ],
            [
                2340,
                2342
            ],
            [
                2343,
                2356
            ],
            [
                2357,
                2376
            ],
            [
                2377,
                2400
            ],
            [
                2401,
                2403
            ],
            [
                2404,
                2413
            ],
            [
                2414,
                2424
            ],
            [
                2426,
                2447
            ],
            [
                2450,
                2461
            ],
            [
                2470,
                2519
            ],
            [
                2520,
                2536
            ],
            [
                2537,
                2542
            ],
            [
                2543,
                2552
            ],
            [
                2552,
                2563
            ],
            [
                2566,
                2581
            ],
            [
                2587,
                2622
            ],
            [
                2634,
                2643
            ],
            [
                2643,
                2644
            ],
            [
                2645,
                2648
            ],
            [
                2649,
                2656
            ],
            [
                2657,
                2660
            ],
            [
                2665,
                2671
            ],
            [
                2672,
                2681
            ],
            [
                2687,
                2701
            ],
            [
                2702,
                2704
            ],
            [
                2705,
                2716
            ],
            [
                2717,
                2719
            ],
            [
                2722,
                2734
            ],
            [
                2744,
                2749
            ],
            [
                2750,
                2757
            ],
            [
                2758,
                2776
            ],
            [
                2777,
                2793
            ],
            [
                2794,
                2799
            ],
            [
                2800,
                2813
            ],
            [
                2814,
                2825
            ],
            [
                2825,
                2830
            ],
            [
                2835,
                2841
            ],
            [
                2842,
                2850
            ],
            [
                2851,
                2875
            ],
            [
                2875,
                2882
            ],
            [
                2886,
                2918
            ],
            [
                2926,
                2927
            ],
            [
                2928,
                2940
            ],
            [
                2941,
                2991
            ],
            [
                2991,
                3046
            ],
            [
                3049,
                3069
            ],
            [
                3070,
                3072
            ],
            [
                3073,
                3076
            ],
            [
                3077,
                3081
            ],
            [
                3082,
                3090
            ],
            [
                3095,
                3097
            ],
            [
                3098,
                3111
            ],
            [
                3112,
                3124
            ],
            [
                3125,
                3129
            ],
            [
                3137,
                3151
            ],
            [
                3157,
                3161
            ],
            [
                3168,
                3184
            ],
            [
                3190,
                3217
            ],
            [
                3233,
                3235
            ],
            [
                3235,
                3252
            ],
            [
                3253,
                3255
            ],
            [
                3256,
                3259
            ],
            [
                3265,
                3268
            ],
            [
                3269,
                3276
            ],
            [
                3288,
                3308
            ],
            [
                3309,
                3316
            ],
            [
                3317,
                3319
            ],
            [
                3323,
                3324
            ],
            [
                3325,
                3352
            ],
            [
                3358,
                3371
            ],
            [
                3372,
                3381
            ],
            [
                3385,
                3393
            ],
            [
                3395,
                3407
            ],
            [
                3408,
                3418
            ],
            [
                3419,
                3424
            ],
            [
                3428,
                3465
            ],
            [
                3466,
                3477
            ],
            [
                3477,
                3492
            ],
            [
                3493,
                3506
            ],
            [
                3507,
                3516
            ],
            [
                3517,
                3520
            ],
            [
                3521,
                3529
            ],
            [
                3529,
                3560
            ],
            [
                3561,
                3592
            ],
            [
                3593,
                3610
            ],
            [
                3611,
                3633
            ],
            [
                3633,
                3644
            ],
            [
                3645,
                3648
            ],
            [
                3649,
                3651
            ],
            [
                3657,
                3674
            ],
            [
                3678,
                3706
            ],
            [
                3713,
                3742
            ],
            [
                3744,
                3751
            ],
            [
                3751,
                3806
            ],
            [
                3806,
                3843
            ],
            [
                3845,
                3885
            ],
            [
                3885,
                3916
            ],
            [
                3916,
                3918
            ],
            [
                3918,
                3921
            ],
            [
                3927,
                3930
            ],
            [
                3931,
                3938
            ],
            [
                3939,
                3965
            ],
            [
                3966,
                3972
            ],
            [
                3973,
                3984
            ],
            [
                3995,
                3999
            ],
            [
                3999,
                4003
            ],
            [
                4004,
                4009
            ],
            [
                4015,
                4017
            ],
            [
                4025,
                4034
            ],
            [
                4035,
                4049
            ],
            [
                4050,
                4063
            ],
            [
                4064,
                4068
            ],
            [
                4069,
                4085
            ],
            [
                4086,
                4117
            ],
            [
                4122,
                4127
            ],
            [
                4128,
                4130
            ],
            [
                4131,
                4134
            ],
            [
                4137,
                4138
            ],
            [
                4139,
                4150
            ],
            [
                4151,
                4156
            ],
            [
                4157,
                4163
            ],
            [
                4164,
                4175
            ],
            [
                4176,
                4189
            ],
            [
                4195,
                4200
            ],
            [
                4201,
                4210
            ],
            [
                4211,
                4230
            ],
            [
                4232,
                4242
            ],
            [
                4243,
                4246
            ],
            [
                4247,
                4260
            ],
            [
                4261,
                4273
            ],
            [
                4274,
                4278
            ],
            [
                4279,
                4288
            ],
            [
                4291,
                4300
            ],
            [
                4301,
                4304
            ],
            [
                4311,
                4352
            ],
            [
                4354,
                4358
            ],
            [
                4362,
                4371
            ],
            [
                4377,
                4381
            ],
            [
                4391,
                4398
            ],
            [
                4409,
                4423
            ],
            [
                4426,
                4429
            ],
            [
                4430,
                4436
            ],
            [
                4444,
                4446
            ],
            [
                4447,
                4451
            ],
            [
                4451,
                4522
            ],
            [
                4525,
                4568
            ],
            [
                4569,
                4582
            ],
            [
                4585,
                4587
            ],
            [
                4588,
                4615
            ],
            [
                4616,
                4657
            ],
            [
                4658,
                4675
            ],
            [
                4675,
                4677
            ],
            [
                4677,
                4683
            ],
            [
                4683,
                4684
            ],
            [
                4688,
                4709
            ],
            [
                4715,
                4718
            ],
            [
                4721,
                4744
            ],
            [
                4747,
                4781
            ],
            [
                4782,
                4788
            ],
            [
                4794,
                4797
            ],
            [
                4802,
                4821
            ],
            [
                4822,
                4860
            ],
            [
                4868,
                4882
            ],
            [
                4883,
                4896
            ],
            [
                4897,
                4901
            ],
            [
                4903,
                4916
            ],
            [
                4917,
                4925
            ],
            [
                4926,
                4929
            ],
            [
                4930,
                4955
            ],
            [
                4956,
                4964
            ],
            [
                4970,
                4992
            ],
            [
                4995,
                4998
            ],
            [
                4999,
                5021
            ],
            [
                5022,
                5028
            ],
            [
                5029,
                5032
            ],
            [
                5037,
                5047
            ],
            [
                5048,
                5055
            ],
            [
                5057,
                5072
            ],
            [
                5073,
                5088
            ],
            [
                5100,
                5109
            ],
            [
                5119,
                5123
            ],
            [
                5124,
                5127
            ],
            [
                5128,
                5139
            ],
            [
                5140,
                5155
            ],
            [
                5161,
                5167
            ],
            [
                5170,
                5186
            ],
            [
                5187,
                5198
            ],
            [
                5207,
                5217
            ],
            [
                5218,
                5229
            ],
            [
                5230,
                5239
            ],
            [
                5240,
                5245
            ],
            [
                5246,
                5257
            ],
            [
                5263,
                5269
            ],
            [
                5270,
                5287
            ],
            [
                5290,
                5296
            ],
            [
                5297,
                5308
            ],
            [
                5309,
                5367
            ],
            [
                5374,
                5380
            ],
            [
                5380,
                5424
            ],
            [
                5424,
                5426
            ],
            [
                5426,
                5429
            ],
            [
                5430,
                5439
            ],
            [
                5439,
                5440
            ],
            [
                5456,
                5465
            ],
            [
                5466,
                5473
            ],
            [
                5473,
                5475
            ],
            [
                5477,
                5500
            ],
            [
                5500,
                5502
            ],
            [
                5502,
                5524
            ],
            [
                5525,
                5531
            ],
            [
                5532,
                5559
            ],
            [
                5560,
                5573
            ],
            [
                5574,
                5582
            ],
            [
                5582,
                5583
            ],
            [
                5584,
                5608
            ],
            [
                5611,
                5620
            ],
            [
                5629,
                5665
            ],
            [
                5666,
                5674
            ],
            [
                5675,
                5680
            ],
            [
                5680,
                5681
            ],
            [
                5682,
                5707
            ],
            [
                5708,
                5711
            ],
            [
                5717,
                5720
            ],
            [
                5721,
                5725
            ],
            [
                5726,
                5737
            ],
            [
                5749,
                5784
            ],
            [
                5787,
                5809
            ],
            [
                5810,
                5861
            ],
            [
                5861,
                5865
            ],
            [
                5871,
                5926
            ],
            [
                5926,
                5954
            ],
            [
                5954,
                5959
            ],
            [
                5960,
                5970
            ],
            [
                5970,
                5971
            ],
            [
                5979,
                5985
            ],
            [
                5986,
                5989
            ],
            [
                5991,
                6004
            ],
            [
                6007,
                6017
            ],
            [
                6018,
                6056
            ],
            [
                6057,
                6076
            ],
            [
                6077,
                6104
            ],
            [
                6106,
                6140
            ],
            [
                6141,
                6152
            ],
            [
                6159,
                6161
            ],
            [
                6162,
                6189
            ],
            [
                6193,
                6208
            ],
            [
                6208,
                6227
            ],
            [
                6230,
                6233
            ],
            [
                6239,
                6251
            ],
            [
                6254,
                6262
            ],
            [
                6266,
                6277
            ],
            [
                6278,
                6311
            ],
            [
                6328,
                6330
            ],
            [
                6330,
                6416
            ],
            [
                6419,
                6464
            ],
            [
                6465,
                6467
            ],
            [
                6474,
                6504
            ],
            [
                6544,
                6546
            ],
            [
                6547,
                6591
            ],
            [
                6591,
                6607
            ],
            [
                6608,
                6610
            ],
            [
                6622,
                6630
            ],
            [
                6637,
                6640
            ],
            [
                6647,
                6689
            ],
            [
                6690,
                6701
            ],
            [
                6701,
                6706
            ],
            [
                6707,
                6729
            ],
            [
                6730,
                6750
            ],
            [
                6751,
                6764
            ],
            [
                6765,
                6768
            ],
            [
                6769,
                6792
            ],
            [
                6794,
                6825
            ],
            [
                6827,
                6845
            ],
            [
                6846,
                6852
            ]
        ],
        "row_chars": [
            [
                0,
                9
            ],
            [
                9,
                96
            ],
            [
                96,
                208
            ],
            [
                208,
                362
            ],
            [
                362,
                571
            ],
            [
                571,
                736
            ],
            [
                736,
                957
            ],
            [
                957,
                998
            ],
            [
                998,
                1196
            ],
            [
                1196,
                1594
            ],
            [
                1594,
                1635
            ],
            [
                1635,
                1937
            ],
            [
                1937,
                2126
            ],
            [
                2126,
                2552
            ],
            [
                2552,
                2623
            ],
            [
                2623,
                2991
            ],
            [
                2991,
                3235
            ],
            [
                3235,
                3633
            ],
            [
                3633,
                4354
            ],
            [
                4354,
                4451
            ],
            [
                4451,
                4677
            ],
            [
                4677,
                4822
            ],
            [
                4822,
                5218
            ],
            [
                5218,
                5426
            ],
            [
                5426,
                5475
            ],
            [
                5475,
                5502
            ],
            [
                5502,
                5861
            ],
            [
                5861,
                5926
            ],
            [
                5926,
                6208
            ],
            [
                6208,
                6330
            ],
            [
                6330,
                6591
            ],
            [
                6591,
                6792
            ],
            [
                6792,
                6792
            ],
            [
                6792,
                6825
            ],
            [
                6825,
                6853
            ]
        ]
    }
}