{
    "original": {
        "text": "--Now, quoth _Didius_, rising up, and laying his right hand with his fingers spread upon his breast----had such a blunder about a christian-name happened before the Reformation ------[It happened the day before yesterday, quoth my uncle _Toby_ to himself] and when baptism was administer'd in _Latin_ --['Twas all in _English_, said my uncle]------ many things might have coincided with it, and upon the authority of sundry decreed cases, to have pronounced the baptism null, with a power of giving the child a new name --Had a priest, for instance, which was no uncommon thing, through ignorance of the _Latin_ tongue, baptized a child of Tom-o'Stiles, _in nomine patri & filia & spiritum sanctos_--the baptism was held null. ----I beg your pardon, replied _Kysarcius_----in that case, as the mistake was only the _terminations_, the baptism was valid----and to have rendered it null, the blunder of the priest should have fallen upon the first syllable of each noun------and not, as in your case, upon the last.\nMy father delighted in subtleties of this kind, and listen'd with infinite attention.\n_Gastripheres_, for example, continued _Kysarcius_, baptizes a child of _John Stradling's_ in _Gomine_ gatris, &c., &c., instead of _in Nomine_ patris, &c. ----Is this a baptism? No--say the ablest canonists; in as much as the radix of each word is hereby torn up, and the sense and meaning of them removed and changed quite to another object; for _Gomine_ does not signify a name, nor _gatris_ a father. --What do they signify? said my uncle _Toby_. --Nothing at all------quoth _Yorick_. ----Ergo, such a baptism is null, said _Kysarcius_.----\nIn course, answered _Yorick_, in a tone two parts jest and one part earnest.----\nBut in the case cited, continued _Kysarcius_, where _patri_ is put for _patris_, _filia_ for _filii_, and so on----as it is a fault only in the declension, and the roots of the words continue untouch'd, the inflections of their branches either this way or that, does not in any sort hinder the baptism, inasmuch as the same sense continues in the words as before. ----But then, said _Didius_, the intention of the priest's pronouncing them grammatically must have been proved to have gone along with it. ------------Right, answered _Kysarcius_; and of this, brother _Didius_, we have an instance in a decree of the decretals of Pope _Leo_ the IIId. ----But my brother's child, cried my uncle _Toby_, has nothing to do with the Pope------'tis the plain child of a Protestant gentleman, christen'd _Tristram_ against the wills and wishes both of his father and mother, and all who are a-kin to it.----\nIf the wills and wishes, said _Kysarcius_, interrupting my uncle _Toby_, of those only who stand related to Mr. _Shandy's_ child, were to have weight in this matter, Mrs. _Shandy_, of all people, has the least to do in it. ----My uncle _Toby_ lay'd down his pipe, and my father drew his chair still closer to the table, to hear the conclusion of so strange an introduction.\n----It has not only been a question, Captain _Shandy_, amongst the[4.10] best lawyers and civilians in this land, continued _Kysarcius_, \"_Whether the mother be of kin to her child_,\" --but, after much dispassionate enquiry and jactitation of the arguments on all sides--it has been abjudged for the negative--namely, \"_That the mother is not of kin to her child_.\"[4.11] My father instantly clapp'd his hand upon my uncle _Toby's_ mouth, under colour of whispering in his ear; --the truth was, he was alarmed for _Lillabullero_--and having a great desire to hear more of so curious an argument--he begg'd my uncle _Toby_, for Heaven's sake, not to disappoint him in it. --My uncle _Toby_ gave a nod--resumed his pipe, and contenting himself with whistling _Lillabullero_ inwardly----_Kysarcius_, _Didius_, and _Triptolemus_ went on with the discourse as follows.\nThis determination, continued _Kysarcius_, how contrary soever it may seem to run to the stream of vulgar ideas, yet had reason strongly on its side; and has been put out of all manner of dispute from the famous case, known commonly by the name of the Duke of _Suffolk's_ case. ------It is cited in _Brook_, said _Triptolemus_ ------And taken notice of by Lord _Coke_, added _Didius_. --And you may find it in _Swinburn_ on Testaments, said _Kysarcius_.\nThe case, Mr. _Shandy_, was this.\nIn the reign of _Edward_ the Sixth, _Charles_ duke of _Suffolk_ having issue a son by one venter, and a daughter by another venter, made his last will, wherein he devised goods to his son, and died; after whose death the son died also----but without will, without wife, and without child--his mother and his sister by the father's side (for she was born of the former venter) then living. The mother took the administration of her son's goods, according to the statute of the 21st of _Harry_ the Eighth, whereby it is enacted, That in case any person die intestate the administration of his goods shall be committed to the next of kin.\nThe administration being thus (surreptitiously) granted to the mother, the sister by the father's side commenced a suit before the Ecclesiastical Judge, alledging, 1st, That she herself was next of kin; and 2dly, That the mother was not of kin at all to the party deceased; and therefore prayed the court, that the administration granted to the mother might be revoked, and be committed unto her, as next of kin to the deceased, by force of the said statute.\nHereupon, as it was a great cause, and much depending upon its issue--and many causes of great property likely to be decided in times to come, by the precedent to be then made----the most learned, as well in the laws of this realm, as in the civil law, were consulted together, whether the mother was of kin to her son, or no. --Whereunto not only the temporal lawyers----but the church lawyers--the juris-consulti--the juris-prudentes--the civilians--the advocates--the commissaries--the judges of the consistory and prerogative courts of _Canterbury_ and _York_, with the master of the faculties, were all unanimously of opinion, That the mother was not of[4.12] kin to her child.----\nAnd what said the duchess of _Suffolk_ to it? said my uncle _Toby_.\nThe unexpectedness of my uncle _Toby's_ question, confounded _Kysarcius_ more than the ablest advocate ----He stopp'd a full minute, looking in my uncle _Toby's_ face without replying----and in that single minute _Triptolemus_ put by him, and took the lead as follows.\n'Tis a ground and principle in the law, said _Triptolemus_, that things do not ascend, but descend in it; and I make no doubt 'tis for this cause, that however true it is, that the child may be of the blood and seed of its parents----that the parents, nevertheless, are not of the blood and seed of it; inasmuch as the parents are not begot by the child, but the child by the parents --For so they write, _Liberi sunt de sanguine patris & matris, sed pater & mater non sunt de sanguine liberorum_.\n----But this, _Triptolemus_, cried _Didius_, proves too much--for from this authority cited it would follow, not only what indeed is granted on all sides, that the mother is not of kin to her child--but the father likewise. ----It is held, said _Triptolemus_, the better opinion; because the father, the mother, and the child, though they be three persons, yet are they but (_una caro_[4.13]) one flesh; and consequently no degree of kindred----or any method of acquiring one _in nature_. ----There you push the argument again too far, cried _Didius_----for there is no prohibition _in nature_, though there is in the Levitical law----but that a man may beget a child upon his grandmother----in which case, supposing the issue a daughter, she would stand in relation both of ----But who ever thought, cried _Kysarcius_, of lying with his grandmother? ------The young gentleman, replied _Yorick_, whom _Selden_ speaks of----who not only thought of it, but justified his intention to his father by the argument drawn from the law of retaliation. --\"You lay, Sir, with my mother,\" said the lad-- \"why may not I lie with yours?\" ----'Tis the _Argumentum commune_, added _Yorick_. ----'Tis as good, replied _Eugenius_, taking down his hat, as they deserve.\nThe company broke up.\n[Footnote 4.10: Vide Swinburn on Testaments, Part 7, 8.]\n[Footnote 4.11: Vide Brook, Abridg. Tit. Administr. N. 47.]\n[Footnote 4.12: Mater non numeratur inter consanguineos, Bald. in ult. C. de Verb. signific.]\n[Footnote 4.13: Vide Brook, Abridg. tit. Administr. N. 47.]",
        "paragraph_chars": [
            [
                0,
                1014
            ],
            [
                1014,
                1100
            ],
            [
                1100,
                1645
            ],
            [
                1645,
                1726
            ],
            [
                1726,
                2626
            ],
            [
                2626,
                3000
            ],
            [
                3000,
                3864
            ],
            [
                3864,
                4318
            ],
            [
                4318,
                4352
            ],
            [
                4352,
                4988
            ],
            [
                4988,
                5447
            ],
            [
                5447,
                6134
            ],
            [
                6134,
                6202
            ],
            [
                6202,
                6471
            ],
            [
                6471,
                6969
            ],
            [
                6969,
                8221
            ],
            [
                8221,
                8243
            ],
            [
                8243,
                8300
            ],
            [
                8300,
                8360
            ],
            [
                8360,
                8454
            ],
            [
                8454,
                8513
            ]
        ],
        "segment_chars": [
            [
                0,
                727
            ],
            [
                727,
                1014
            ],
            [
                1014,
                1100
            ],
            [
                1100,
                1279
            ],
            [
                1279,
                1505
            ],
            [
                1505,
                1529
            ],
            [
                1529,
                1551
            ],
            [
                1551,
                1589
            ],
            [
                1589,
                1645
            ],
            [
                1645,
                1726
            ],
            [
                1726,
                2090
            ],
            [
                2090,
                2230
            ],
            [
                2230,
                2375
            ],
            [
                2375,
                2626
            ],
            [
                2626,
                2849
            ],
            [
                2849,
                3000
            ],
            [
                3000,
                3364
            ],
            [
                3364,
                3671
            ],
            [
                3671,
                3864
            ],
            [
                3864,
                4142
            ],
            [
                4142,
                4249
            ],
            [
                4249,
                4318
            ],
            [
                4318,
                4352
            ],
            [
                4352,
                4741
            ],
            [
                4741,
                4988
            ],
            [
                4988,
                5447
            ],
            [
                5447,
                5774
            ],
            [
                5774,
                6134
            ],
            [
                6134,
                6180
            ],
            [
                6180,
                6202
            ],
            [
                6202,
                6471
            ],
            [
                6471,
                6969
            ],
            [
                6969,
                7193
            ],
            [
                7193,
                7458
            ],
            [
                7458,
                7820
            ],
            [
                7820,
                8013
            ],
            [
                8013,
                8094
            ],
            [
                8094,
                8145
            ],
            [
                8145,
                8221
            ],
            [
                8221,
                8243
            ],
            [
                8243,
                8300
            ],
            [
                8300,
                8336
            ],
            [
                8336,
                8341
            ],
            [
                8341,
                8352
            ],
            [
                8352,
                8360
            ],
            [
                8360,
                8423
            ],
            [
                8423,
                8431
            ],
            [
                8431,
                8443
            ],
            [
                8443,
                8454
            ],
            [
                8454,
                8490
            ],
            [
                8490,
                8495
            ],
            [
                8495,
                8506
            ],
            [
                8506,
                8513
            ]
        ],
        "overlap_chars": [
            [
                2,
                5
            ],
            [
                7,
                12
            ],
            [
                14,
                20
            ],
            [
                21,
                33
            ],
            [
                107,
                139
            ],
            [
                140,
                144
            ],
            [
                103,
                106
            ],
            [
                145,
                176
            ],
            [
                5,
                6
            ],
            [
                260,
                276
            ],
            [
                290,
                292
            ],
            [
                314,
                316
            ],
            [
                220,
                221
            ],
            [
                139,
                140
            ],
            [
                349,
                371
            ],
            [
                550,
                555
            ],
            [
                404,
                413
            ],
            [
                244,
                246
            ],
            [
                458,
                519
            ],
            [
                725,
                726
            ],
            [
                522,
                549
            ],
            [
                579,
                603
            ],
            [
                612,
                636
            ],
            [
                655,
                670
            ],
            [
                673,
                678
            ],
            [
                681,
                697
            ],
            [
                643,
                644
            ],
            [
                700,
                725
            ],
            [
                731,
                748
            ],
            [
                750,
                757
            ],
            [
                759,
                768
            ],
            [
                748,
                749
            ],
            [
                773,
                814
            ],
            [
                829,
                852
            ],
            [
                1012,
                1013
            ],
            [
                860,
                889
            ],
            [
                905,
                923
            ],
            [
                890,
                892
            ],
            [
                936,
                967
            ],
            [
                980,
                981
            ],
            [
                973,
                980
            ],
            [
                1004,
                1012
            ],
            [
                1014,
                1065
            ],
            [
                1075,
                1079
            ],
            [
                1089,
                1100
            ],
            [
                1105,
                1113
            ],
            [
                1114,
                1127
            ],
            [
                1129,
                1138
            ],
            [
                1140,
                1149
            ],
            [
                1127,
                1128
            ],
            [
                1156,
                1171
            ],
            [
                1173,
                1189
            ],
            [
                1191,
                1193
            ],
            [
                1101,
                1102
            ],
            [
                1198,
                1201
            ],
            [
                1203,
                1210
            ],
            [
                1221,
                1231
            ],
            [
                1233,
                1242
            ],
            [
                1244,
                1250
            ],
            [
                1260,
                1279
            ],
            [
                1279,
                1281
            ],
            [
                1444,
                1447
            ],
            [
                1287,
                1290
            ],
            [
                1333,
                1348
            ],
            [
                1356,
                1368
            ],
            [
                1307,
                1308
            ],
            [
                1480,
                1481
            ],
            [
                1614,
                1621
            ],
            [
                1648,
                1654
            ],
            [
                1656,
                1664
            ],
            [
                1666,
                1672
            ],
            [
                1673,
                1684
            ],
            [
                1695,
                1703
            ],
            [
                1708,
                1721
            ],
            [
                1726,
                1747
            ],
            [
                1749,
                1758
            ],
            [
                1760,
                1769
            ],
            [
                1747,
                1748
            ],
            [
                1793,
                1796
            ],
            [
                1798,
                1804
            ],
            [
                1826,
                1837
            ],
            [
                1841,
                1908
            ],
            [
                1948,
                1953
            ],
            [
                1909,
                1917
            ],
            [
                1770,
                1771
            ],
            [
                1988,
                1996
            ],
            [
                2009,
                2027
            ],
            [
                2088,
                2090
            ],
            [
                2302,
                2336
            ],
            [
                2354,
                2358
            ],
            [
                2360,
                2363
            ],
            [
                2337,
                2340
            ],
            [
                2463,
                2464
            ],
            [
                2379,
                2401
            ],
            [
                2426,
                2457
            ],
            [
                2403,
                2417
            ],
            [
                2615,
                2617
            ],
            [
                2464,
                2471
            ],
            [
                2478,
                2517
            ],
            [
                2528,
                2531
            ],
            [
                2533,
                2544
            ],
            [
                2555,
                2561
            ],
            [
                2567,
                2600
            ],
            [
                2611,
                2614
            ],
            [
                2626,
                2632
            ],
            [
                2643,
                2649
            ],
            [
                2699,
                2701
            ],
            [
                2708,
                2712
            ],
            [
                2734,
                2737
            ],
            [
                2739,
                2747
            ],
            [
                2756,
                2790
            ],
            [
                2651,
                2655
            ],
            [
                2657,
                2666
            ],
            [
                2649,
                2650
            ],
            [
                2792,
                2796
            ],
            [
                2798,
                2804
            ],
            [
                2805,
                2835
            ],
            [
                2853,
                2861
            ],
            [
                2875,
                2918
            ],
            [
                2925,
                2953
            ],
            [
                2998,
                3000
            ],
            [
                3004,
                3010
            ],
            [
                3020,
                3044
            ],
            [
                3046,
                3052
            ],
            [
                3053,
                3066
            ],
            [
                3073,
                3085
            ],
            [
                3100,
                3112
            ],
            [
                3114,
                3123
            ],
            [
                3125,
                3134
            ],
            [
                3112,
                3113
            ],
            [
                3139,
                3180
            ],
            [
                3186,
                3201
            ],
            [
                3216,
                3223
            ],
            [
                3260,
                3263
            ],
            [
                3243,
                3256
            ],
            [
                3271,
                3282
            ],
            [
                3292,
                3308
            ],
            [
                3135,
                3136
            ],
            [
                3320,
                3362
            ],
            [
                3372,
                3394
            ],
            [
                3400,
                3422
            ],
            [
                3646,
                3648
            ],
            [
                3428,
                3430
            ],
            [
                3432,
                3444
            ],
            [
                3452,
                3477
            ],
            [
                3480,
                3513
            ],
            [
                3515,
                3527
            ],
            [
                3621,
                3626
            ],
            [
                3596,
                3598
            ],
            [
                3541,
                3594
            ],
            [
                3669,
                3671
            ],
            [
                3673,
                3681
            ],
            [
                3709,
                3756
            ],
            [
                3758,
                3770
            ],
            [
                3772,
                3780
            ],
            [
                3862,
                3864
            ],
            [
                3884,
                3893
            ],
            [
                3895,
                3904
            ],
            [
                3882,
                3883
            ],
            [
                3907,
                3910
            ],
            [
                3922,
                3926
            ],
            [
                3911,
                3919
            ],
            [
                3927,
                3948
            ],
            [
                3963,
                4030
            ],
            [
                4052,
                4059
            ],
            [
                4097,
                4099
            ],
            [
                4065,
                4080
            ],
            [
                4109,
                4123
            ],
            [
                4125,
                4132
            ],
            [
                4140,
                4142
            ],
            [
                4318,
                4331
            ],
            [
                4333,
                4339
            ],
            [
                4340,
                4352
            ],
            [
                4352,
                4367
            ],
            [
                4369,
                4375
            ],
            [
                4377,
                4387
            ],
            [
                4389,
                4396
            ],
            [
                4398,
                4405
            ],
            [
                4407,
                4414
            ],
            [
                4620,
                4621
            ],
            [
                4416,
                4422
            ],
            [
                4429,
                4441
            ],
            [
                4448,
                4475
            ],
            [
                4482,
                4514
            ],
            [
                4523,
                4549
            ],
            [
                4739,
                4740
            ],
            [
                4551,
                4556
            ],
            [
                4563,
                4586
            ],
            [
                4590,
                4601
            ],
            [
                4602,
                4620
            ],
            [
                4634,
                4639
            ],
            [
                4641,
                4687
            ],
            [
                4728,
                4739
            ],
            [
                4877,
                4878
            ],
            [
                4741,
                4812
            ],
            [
                4828,
                4832
            ],
            [
                4813,
                4823
            ],
            [
                4844,
                4863
            ],
            [
                4892,
                4902
            ],
            [
                4903,
                4988
            ],
            [
                4992,
                5017
            ],
            [
                5036,
                5069
            ],
            [
                5101,
                5140
            ],
            [
                5150,
                5151
            ],
            [
                5155,
                5194
            ],
            [
                5199,
                5245
            ],
            [
                5252,
                5260
            ],
            [
                5260,
                5275
            ],
            [
                5276,
                5292
            ],
            [
                5294,
                5317
            ],
            [
                5426,
                5432
            ],
            [
                5340,
                5356
            ],
            [
                5329,
                5339
            ],
            [
                5358,
                5361
            ],
            [
                5326,
                5328
            ],
            [
                5380,
                5383
            ],
            [
                5445,
                5447
            ],
            [
                5457,
                5481
            ],
            [
                5486,
                5509
            ],
            [
                5455,
                5456
            ],
            [
                5626,
                5642
            ],
            [
                5700,
                5714
            ],
            [
                5644,
                5646
            ],
            [
                5558,
                5560
            ],
            [
                5725,
                5774
            ],
            [
                6051,
                6054
            ],
            [
                5795,
                5798
            ],
            [
                5808,
                5815
            ],
            [
                5961,
                5964
            ],
            [
                5936,
                5942
            ],
            [
                6046,
                6050
            ],
            [
                6055,
                6069
            ],
            [
                5823,
                5826
            ],
            [
                6070,
                6105
            ],
            [
                6112,
                6128
            ],
            [
                6134,
                6162
            ],
            [
                6164,
                6171
            ],
            [
                6173,
                6178
            ],
            [
                6180,
                6193
            ],
            [
                6202,
                6232
            ],
            [
                6238,
                6240
            ],
            [
                6242,
                6250
            ],
            [
                6252,
                6262
            ],
            [
                6264,
                6273
            ],
            [
                6309,
                6311
            ],
            [
                6439,
                6444
            ],
            [
                6421,
                6427
            ],
            [
                6445,
                6449
            ],
            [
                6469,
                6471
            ],
            [
                6598,
                6601
            ],
            [
                6476,
                6477
            ],
            [
                6489,
                6509
            ],
            [
                6511,
                6515
            ],
            [
                6522,
                6528
            ],
            [
                6509,
                6510
            ],
            [
                6597,
                6598
            ],
            [
                6531,
                6576
            ],
            [
                6861,
                6863
            ],
            [
                6618,
                6657
            ],
            [
                6473,
                6475
            ],
            [
                6665,
                6701
            ],
            [
                6710,
                6769
            ],
            [
                6830,
                6839
            ],
            [
                6772,
                6773
            ],
            [
                6602,
                6605
            ],
            [
                6864,
                6868
            ],
            [
                6798,
                6824
            ],
            [
                6973,
                6976
            ],
            [
                6989,
                6995
            ],
            [
                6998,
                7003
            ],
            [
                7005,
                7011
            ],
            [
                6981,
                6982
            ],
            [
                7035,
                7044
            ],
            [
                7061,
                7086
            ],
            [
                7124,
                7166
            ],
            [
                7168,
                7191
            ],
            [
                7197,
                7207
            ],
            [
                7209,
                7213
            ],
            [
                7220,
                7226
            ],
            [
                7207,
                7208
            ],
            [
                7257,
                7342
            ],
            [
                7362,
                7410
            ],
            [
                7468,
                7503
            ],
            [
                7505,
                7510
            ],
            [
                7512,
                7518
            ],
            [
                7503,
                7504
            ],
            [
                7523,
                7550
            ],
            [
                7552,
                7561
            ],
            [
                7564,
                7586
            ],
            [
                7613,
                7618
            ],
            [
                7623,
                7625
            ],
            [
                7629,
                7657
            ],
            [
                7661,
                7743
            ],
            [
                7748,
                7768
            ],
            [
                7770,
                7775
            ],
            [
                7777,
                7786
            ],
            [
                7562,
                7563
            ],
            [
                7789,
                7818
            ],
            [
                7830,
                7845
            ],
            [
                7847,
                7854
            ],
            [
                7856,
                7862
            ],
            [
                7845,
                7846
            ],
            [
                7896,
                7968
            ],
            [
                7993,
                8013
            ],
            [
                8015,
                8059
            ],
            [
                8062,
                8094
            ],
            [
                8103,
                8106
            ],
            [
                8108,
                8126
            ],
            [
                8150,
                8161
            ],
            [
                8163,
                8170
            ],
            [
                8172,
                8180
            ],
            [
                8161,
                8162
            ],
            [
                8149,
                8150
            ],
            [
                8204,
                8219
            ],
            [
                8221,
                8242
            ]
        ],
        "row_chars": [
            [
                0,
                727
            ],
            [
                727,
                1014
            ],
            [
                1014,
                1100
            ],
            [
                1100,
                1279
            ],
            [
                1279,
                1645
            ],
            [
                1645,
                1726
            ],
            [
                1726,
                2090
            ],
            [
                2090,
                2230
            ],
            [
                2230,
                2375
            ],
            [
                2375,
                2626
            ],
            [
                2626,
                2849
            ],
            [
                2849,
                3000
            ],
            [
                3000,
                3364
            ],
            [
                3364,
                3671
            ],
            [
                3671,
                3864
            ],
            [
                3864,
                4142
            ],
            [
                4142,
                4249
            ],
            [
                4249,
                4318
            ],
            [
                4318,
                4352
            ],
            [
                4352,
                4988
            ],
            [
                4988,
                5447
            ],
            [
                5447,
                5774
            ],
            [
                5774,
                6134
            ],
            [
                6134,
                6180
            ],
            [
                6180,
                6202
            ],
            [
                6202,
                6471
            ],
            [
                6471,
                6969
            ],
            [
                6969,
                7193
            ],
            [
                7193,
                7458
            ],
            [
                7458,
                7820
            ],
            [
                7820,
                8013
            ],
            [
                8013,
                8094
            ],
            [
                8094,
                8145
            ],
            [
                8145,
                8221
            ],
            [
                8221,
                8243
            ],
            [
                8243,
                8300
            ],
            [
                8300,
                8336
            ],
            [
                8336,
                8341
            ],
            [
                8341,
                8352
            ],
            [
                8352,
                8360
            ],
            [
                8360,
                8423
            ],
            [
                8423,
                8431
            ],
            [
                8431,
                8443
            ],
            [
                8443,
                8454
            ],
            [
                8454,
                8490
            ],
            [
                8490,
                8495
            ],
            [
                8495,
                8506
            ],
            [
                8506,
                8513
            ]
        ]
    },
    "abridged": {
        "text": "'Now,' quoth Didius, rising up, 'if such a blunder about a Christian name had happened before the Reformation, when baptism was administered in Latin, - many things might have occurred which would allow an authority to pronounce the baptism null, with a power of giving the child a new name. Had a priest, for instance, through ignorance of the Latin tongue, baptized a child in nomine patriae et filia et spiritum sanctos - the baptism was held null.'\n'I beg your pardon,' replied Kysarcius, 'in that case, as the mistake was only the word-endings, the baptism was valid. To have rendered it null, the priest should have blundered on the first syllable of each noun, and not the last.'\nMy father delighted in subtleties of this kind, and listened with great attention.\n'If Gastripheres, for example,' continued Kysarcius, 'baptizes a child of John Stradling's in gomine gatris, instead of in nomine patris - is this a baptism? No: for the root of each word is torn up, and it becomes meaningless; therefore, it is null.'\n'Of course,' answered Yorick, in a tone part jest and part earnest.\n'But in the case cited,' continued Kysarcius, 'with patriae for patris, and so on - as it is a fault only in the declension, and the roots of the words and their meaning continue untouched, it does not hinder the baptism. We have an instance in a decree of Pope Leo the Third-'\n'But my brother's child has nothing to do with the Pope,' cried my uncle Toby; ''tis the child of a Protestant gentleman, christened Tristram against the wishes of his father and mother, and all his kin.'\n'If the wishes of only Mr. Shandy's family were to have weight in this matter,' said Kysarcius, 'Mrs. Shandy, of all people, has the least.'\nMy uncle Toby laid down his pipe, and my father drew his chair closer to the table, to hear more.\n'It has been a question, Captain Shandy, amongst the best lawyers in this land,' continued Kysarcius, '\"whether the mother be of kin to her child;\" but, after much enquiry into all the arguments - it has been judged for the negative: namely, \"That the mother is not of kin to her child.\"'\nMy father instantly clapped his hand upon my uncle Toby's mouth, under the pretence of whispering in his ear; the truth was, he was alarmed for Lillabullero, for he had a great desire to hear more of so curious an argument. My uncle Toby resumed his pipe, and contenting himself with whistling Lillabullero inwardly.\n'This decision,' continued Kysarcius, 'however contrary it may seem to run to vulgar ideas, yet had reason strongly on its side; and has been put beyond dispute by the famous case of the Duke of Suffolk. The case, Mr. Shandy, was this.\n'In the reign of Edward the Sixth, Charles duke of Suffolk, having a son by one mother, and a daughter by another, made his last will, wherein he left his goods to his son, and died. After his death the son died also - but without a will, without wife or child. Since his mother and his sister by the father's side were then living, the mother took the administration of her son's goods, according to the 21st statute of Harry the Eighth, whereby if any person should die intestate the administration of his goods shall be committed to the next of kin.\n'The administration being thus granted to the mother, the sister began a suit before the Ecclesiastical Judge, alleging, first, that she herself was next of kin; and second, that the mother was not of kin at all to the deceased son; and therefore she prayed the court that the administration of the estate might be revoked from the mother and given to her.\n'As it was a great cause, with much depending upon its result, the most learned lawyers were consulted as to whether the mother was of kin to her son, or no. All the lawyers and judges were unanimously of the opinion, that the mother was not of kin to her child.'\n'And what said the duchess of Suffolk to it?' said my uncle Toby.\nThe unexpectedness of my uncle's question confounded Kysarcius. He paused, and Triptolemus took over.\n''Tis a principle in the law,' said Triptolemus, 'that things do not ascend, but descend in it; so that however true it is, that the child is of the blood and seed of its parents - the parents, nevertheless, are not of the blood and seed of the child; for they are not begot by the child.'\n'But Triptolemus,' cried Didius, 'from this it would follow, not only that the mother is not of kin to her child - but the father likewise.'\n'It is held,' said Triptolemus, 'that the father, the mother, and the child, though they be three persons, yet are they but one flesh; and consequently no degree of kindred.'\n'There you push the argument again too far,' cried Didius, 'for there is no prohibition in nature - though there is in the Bible - to prevent a man from begetting a child upon his grandmother - in which case, supposing the issue a daughter, she would stand in relation both of-'\n'But who ever thought,' cried Kysarcius, 'of lying with his grandmother?'\n'A young gentleman in one case,' replied Yorick, 'not only thought of it, but justified his intention to his father by the law of retaliation. \"You lay, Sir, with my mother,\" said the lad; \"why may not I lie with yours?\" 'Tis the Argumentum commune - the argument of the common public.'\n''Tis as good,' replied Eugenius, 'as they deserve.'\nThe company broke up.",
        "paragraph_chars": [
            [
                0,
                453
            ],
            [
                453,
                687
            ],
            [
                687,
                770
            ],
            [
                770,
                1022
            ],
            [
                1022,
                1090
            ],
            [
                1090,
                1368
            ],
            [
                1368,
                1573
            ],
            [
                1573,
                1714
            ],
            [
                1714,
                1812
            ],
            [
                1812,
                2101
            ],
            [
                2101,
                2418
            ],
            [
                2418,
                2654
            ],
            [
                2654,
                3207
            ],
            [
                3207,
                3564
            ],
            [
                3564,
                3828
            ],
            [
                3828,
                3894
            ],
            [
                3894,
                3996
            ],
            [
                3996,
                4286
            ],
            [
                4286,
                4427
            ],
            [
                4427,
                4602
            ],
            [
                4602,
                4881
            ],
            [
                4881,
                4955
            ],
            [
                4955,
                5242
            ],
            [
                5242,
                5295
            ],
            [
                5295,
                5316
            ]
        ],
        "segment_chars": [
            [
                0,
                292
            ],
            [
                292,
                453
            ],
            [
                453,
                573
            ],
            [
                573,
                687
            ],
            [
                687,
                770
            ],
            [
                770,
                928
            ],
            [
                928,
                1022
            ],
            [
                1022,
                1090
            ],
            [
                1090,
                1312
            ],
            [
                1312,
                1368
            ],
            [
                1368,
                1573
            ],
            [
                1573,
                1675
            ],
            [
                1675,
                1714
            ],
            [
                1714,
                1812
            ],
            [
                1812,
                2101
            ],
            [
                2101,
                2325
            ],
            [
                2325,
                2418
            ],
            [
                2418,
                2622
            ],
            [
                2622,
                2654
            ],
            [
                2654,
                2837
            ],
            [
                2837,
                2916
            ],
            [
                2916,
                3207
            ],
            [
                3207,
                3564
            ],
            [
                3564,
                3722
            ],
            [
                3722,
                3828
            ],
            [
                3828,
                3874
            ],
            [
                3874,
                3894
            ],
            [
                3894,
                3958
            ],
            [
                3958,
                3996
            ],
            [
                3996,
                4286
            ],
            [
                4286,
                4427
            ],
            [
                4427,
                4602
            ],
            [
                4602,
                4881
            ],
            [
                4881,
                4955
            ],
            [
                4955,
                5098
            ],
            [
                5098,
                5176
            ],
            [
                5176,
                5242
            ],
            [
                5242,
                5295
            ],
            [
                5295,
                5316
            ]
        ],
        "overlap_chars": [
            [
                1,
                4
            ],
            [
                7,
                12
            ],
            [
                13,
                19
            ],
            [
                19,
                31
            ],
            [
                36,
                68
            ],
            [
                69,
                73
            ],
            [
                74,
                77
            ],
            [
                78,
                109
            ],
            [
                109,
                110
            ],
            [
                111,
                127
            ],
            [
                141,
                143
            ],
            [
                147,
                149
            ],
            [
                149,
                150
            ],
            [
                151,
                152
            ],
            [
                153,
                175
            ],
            [
                185,
                190
            ],
            [
                206,
                215
            ],
            [
                216,
                218
            ],
            [
                229,
                290
            ],
            [
                290,
                291
            ],
            [
                292,
                319
            ],
            [
                320,
                344
            ],
            [
                351,
                375
            ],
            [
                376,
                391
            ],
            [
                397,
                402
            ],
            [
                406,
                422
            ],
            [
                423,
                424
            ],
            [
                425,
                450
            ],
            [
                454,
                471
            ],
            [
                474,
                481
            ],
            [
                482,
                491
            ],
            [
                491,
                492
            ],
            [
                494,
                535
            ],
            [
                548,
                571
            ],
            [
                571,
                572
            ],
            [
                573,
                602
            ],
            [
                603,
                621
            ],
            [
                622,
                624
            ],
            [
                635,
                666
            ],
            [
                666,
                667
            ],
            [
                668,
                675
            ],
            [
                676,
                684
            ],
            [
                687,
                738
            ],
            [
                748,
                752
            ],
            [
                759,
                770
            ],
            [
                778,
                786
            ],
            [
                786,
                799
            ],
            [
                802,
                811
            ],
            [
                812,
                821
            ],
            [
                821,
                822
            ],
            [
                828,
                843
            ],
            [
                844,
                860
            ],
            [
                861,
                863
            ],
            [
                864,
                865
            ],
            [
                867,
                870
            ],
            [
                871,
                878
            ],
            [
                879,
                889
            ],
            [
                890,
                899
            ],
            [
                900,
                906
            ],
            [
                909,
                928
            ],
            [
                928,
                930
            ],
            [
                932,
                935
            ],
            [
                936,
                939
            ],
            [
                945,
                960
            ],
            [
                961,
                973
            ],
            [
                996,
                997
            ],
            [
                1007,
                1008
            ],
            [
                1012,
                1019
            ],
            [
                1026,
                1032
            ],
            [
                1035,
                1043
            ],
            [
                1044,
                1050
            ],
            [
                1050,
                1061
            ],
            [
                1067,
                1075
            ],
            [
                1076,
                1089
            ],
            [
                1091,
                1112
            ],
            [
                1115,
                1124
            ],
            [
                1125,
                1134
            ],
            [
                1134,
                1135
            ],
            [
                1150,
                1153
            ],
            [
                1154,
                1160
            ],
            [
                1160,
                1171
            ],
            [
                1174,
                1241
            ],
            [
                1246,
                1251
            ],
            [
                1260,
                1268
            ],
            [
                1278,
                1279
            ],
            [
                1283,
                1291
            ],
            [
                1292,
                1310
            ],
            [
                1310,
                1312
            ],
            [
                1312,
                1346
            ],
            [
                1347,
                1351
            ],
            [
                1352,
                1355
            ],
            [
                1356,
                1359
            ],
            [
                1368,
                1369
            ],
            [
                1369,
                1391
            ],
            [
                1392,
                1423
            ],
            [
                1426,
                1440
            ],
            [
                1441,
                1443
            ],
            [
                1449,
                1456
            ],
            [
                1457,
                1496
            ],
            [
                1506,
                1509
            ],
            [
                1510,
                1521
            ],
            [
                1522,
                1528
            ],
            [
                1529,
                1562
            ],
            [
                1567,
                1570
            ],
            [
                1574,
                1580
            ],
            [
                1581,
                1587
            ],
            [
                1588,
                1590
            ],
            [
                1591,
                1595
            ],
            [
                1596,
                1599
            ],
            [
                1600,
                1608
            ],
            [
                1616,
                1650
            ],
            [
                1653,
                1657
            ],
            [
                1658,
                1667
            ],
            [
                1667,
                1668
            ],
            [
                1670,
                1674
            ],
            [
                1675,
                1681
            ],
            [
                1681,
                1711
            ],
            [
                1714,
                1722
            ],
            [
                1733,
                1776
            ],
            [
                1777,
                1805
            ],
            [
                1810,
                1812
            ],
            [
                1813,
                1819
            ],
            [
                1820,
                1844
            ],
            [
                1845,
                1851
            ],
            [
                1851,
                1864
            ],
            [
                1865,
                1877
            ],
            [
                1878,
                1890
            ],
            [
                1893,
                1902
            ],
            [
                1903,
                1912
            ],
            [
                1912,
                1913
            ],
            [
                1916,
                1957
            ],
            [
                1960,
                1975
            ],
            [
                1976,
                1983
            ],
            [
                1989,
                1992
            ],
            [
                1993,
                2006
            ],
            [
                2009,
                2020
            ],
            [
                2028,
                2044
            ],
            [
                2052,
                2053
            ],
            [
                2055,
                2097
            ],
            [
                2101,
                2123
            ],
            [
                2129,
                2151
            ],
            [
                2152,
                2154
            ],
            [
                2156,
                2158
            ],
            [
                2159,
                2171
            ],
            [
                2185,
                2210
            ],
            [
                2211,
                2244
            ],
            [
                2245,
                2257
            ],
            [
                2257,
                2262
            ],
            [
                2263,
                2265
            ],
            [
                2270,
                2323
            ],
            [
                2323,
                2325
            ],
            [
                2325,
                2333
            ],
            [
                2347,
                2394
            ],
            [
                2395,
                2407
            ],
            [
                2408,
                2416
            ],
            [
                2416,
                2418
            ],
            [
                2435,
                2444
            ],
            [
                2445,
                2454
            ],
            [
                2454,
                2455
            ],
            [
                2457,
                2460
            ],
            [
                2460,
                2464
            ],
            [
                2465,
                2473
            ],
            [
                2474,
                2495
            ],
            [
                2496,
                2563
            ],
            [
                2571,
                2578
            ],
            [
                2579,
                2581
            ],
            [
                2582,
                2597
            ],
            [
                2598,
                2612
            ],
            [
                2613,
                2620
            ],
            [
                2620,
                2622
            ],
            [
                2622,
                2635
            ],
            [
                2636,
                2642
            ],
            [
                2642,
                2654
            ],
            [
                2655,
                2670
            ],
            [
                2671,
                2677
            ],
            [
                2678,
                2688
            ],
            [
                2689,
                2696
            ],
            [
                2697,
                2704
            ],
            [
                2705,
                2712
            ],
            [
                2712,
                2713
            ],
            [
                2714,
                2720
            ],
            [
                2721,
                2733
            ],
            [
                2740,
                2767
            ],
            [
                2767,
                2799
            ],
            [
                2809,
                2835
            ],
            [
                2835,
                2836
            ],
            [
                2837,
                2842
            ],
            [
                2847,
                2870
            ],
            [
                2873,
                2884
            ],
            [
                2887,
                2905
            ],
            [
                2909,
                2914
            ],
            [
                2922,
                2968
            ],
            [
                2974,
                2985
            ],
            [
                2985,
                2986
            ],
            [
                2987,
                3058
            ],
            [
                3059,
                3063
            ],
            [
                3064,
                3074
            ],
            [
                3081,
                3100
            ],
            [
                3104,
                3114
            ],
            [
                3122,
                3207
            ],
            [
                3212,
                3237
            ],
            [
                3238,
                3271
            ],
            [
                3278,
                3317
            ],
            [
                3326,
                3327
            ],
            [
                3333,
                3372
            ],
            [
                3379,
                3425
            ],
            [
                3426,
                3434
            ],
            [
                3438,
                3453
            ],
            [
                3458,
                3474
            ],
            [
                3475,
                3498
            ],
            [
                3499,
                3505
            ],
            [
                3513,
                3529
            ],
            [
                3535,
                3545
            ],
            [
                3546,
                3549
            ],
            [
                3556,
                3558
            ],
            [
                3559,
                3562
            ],
            [
                3562,
                3564
            ],
            [
                3565,
                3589
            ],
            [
                3595,
                3618
            ],
            [
                3625,
                3626
            ],
            [
                3627,
                3643
            ],
            [
                3652,
                3666
            ],
            [
                3667,
                3669
            ],
            [
                3670,
                3672
            ],
            [
                3673,
                3722
            ],
            [
                3722,
                3725
            ],
            [
                3726,
                3729
            ],
            [
                3730,
                3737
            ],
            [
                3738,
                3741
            ],
            [
                3742,
                3748
            ],
            [
                3749,
                3753
            ],
            [
                3754,
                3768
            ],
            [
                3769,
                3772
            ],
            [
                3773,
                3808
            ],
            [
                3809,
                3825
            ],
            [
                3829,
                3857
            ],
            [
                3858,
                3865
            ],
            [
                3866,
                3871
            ],
            [
                3874,
                3887
            ],
            [
                3894,
                3924
            ],
            [
                3924,
                3926
            ],
            [
                3927,
                3935
            ],
            [
                3936,
                3946
            ],
            [
                3947,
                3956
            ],
            [
                3958,
                3960
            ],
            [
                3967,
                3972
            ],
            [
                3978,
                3984
            ],
            [
                3985,
                3989
            ],
            [
                3994,
                3996
            ],
            [
                3998,
                4001
            ],
            [
                4002,
                4003
            ],
            [
                4004,
                4024
            ],
            [
                4027,
                4031
            ],
            [
                4037,
                4043
            ],
            [
                4043,
                4044
            ],
            [
                4045,
                4046
            ],
            [
                4046,
                4091
            ],
            [
                4092,
                4094
            ],
            [
                4095,
                4134
            ],
            [
                4135,
                4137
            ],
            [
                4138,
                4174
            ],
            [
                4177,
                4236
            ],
            [
                4237,
                4246
            ],
            [
                4246,
                4247
            ],
            [
                4248,
                4251
            ],
            [
                4252,
                4256
            ],
            [
                4257,
                4283
            ],
            [
                4287,
                4290
            ],
            [
                4296,
                4302
            ],
            [
                4305,
                4310
            ],
            [
                4311,
                4317
            ],
            [
                4317,
                4318
            ],
            [
                4320,
                4329
            ],
            [
                4330,
                4355
            ],
            [
                4356,
                4398
            ],
            [
                4401,
                4424
            ],
            [
                4428,
                4438
            ],
            [
                4441,
                4445
            ],
            [
                4451,
                4457
            ],
            [
                4457,
                4458
            ],
            [
                4465,
                4550
            ],
            [
                4551,
                4599
            ],
            [
                4609,
                4644
            ],
            [
                4647,
                4652
            ],
            [
                4653,
                4659
            ],
            [
                4659,
                4660
            ],
            [
                4662,
                4689
            ],
            [
                4690,
                4699
            ],
            [
                4702,
                4724
            ],
            [
                4744,
                4749
            ],
            [
                4755,
                4757
            ],
            [
                4765,
                4793
            ],
            [
                4796,
                4878
            ],
            [
                4882,
                4902
            ],
            [
                4905,
                4910
            ],
            [
                4911,
                4920
            ],
            [
                4920,
                4921
            ],
            [
                4923,
                4952
            ],
            [
                4958,
                4973
            ],
            [
                4988,
                4995
            ],
            [
                4996,
                5002
            ],
            [
                5002,
                5003
            ],
            [
                5005,
                5077
            ],
            [
                5078,
                5098
            ],
            [
                5098,
                5142
            ],
            [
                5144,
                5176
            ],
            [
                5181,
                5184
            ],
            [
                5185,
                5203
            ],
            [
                5244,
                5255
            ],
            [
                5258,
                5265
            ],
            [
                5266,
                5274
            ],
            [
                5274,
                5275
            ],
            [
                5276,
                5277
            ],
            [
                5277,
                5292
            ],
            [
                5295,
                5316
            ]
        ],
        "row_chars": [
            [
                0,
                453
            ],
            [
                453,
                687
            ],
            [
                687,
                770
            ],
            [
                770,
                928
            ],
            [
                928,
                1022
            ],
            [
                1022,
                1090
            ],
            [
                1090,
                1312
            ],
            [
                1312,
                1312
            ],
            [
                1312,
                1368
            ],
            [
                1368,
                1573
            ],
            [
                1573,
                1714
            ],
            [
                1714,
                1812
            ],
            [
                1812,
                2101
            ],
            [
                2101,
                2325
            ],
            [
                2325,
                2418
            ],
            [
                2418,
                2622
            ],
            [
                2622,
                2622
            ],
            [
                2622,
                2622
            ],
            [
                2622,
                2654
            ],
            [
                2654,
                3207
            ],
            [
                3207,
                3564
            ],
            [
                3564,
                3722
            ],
            [
                3722,
                3828
            ],
            [
                3828,
                3874
            ],
            [
                3874,
                3894
            ],
            [
                3894,
                3996
            ],
            [
                3996,
                4286
            ],
            [
                4286,
                4427
            ],
            [
                4427,
                4602
            ],
            [
                4602,
                4955
            ],
            [
                4955,
                5098
            ],
            [
                5098,
                5176
            ],
            [
                5176,
                5242
            ],
            [
                5242,
                5295
            ],
            [
                5295,
                5316
            ],
            [
                5316,
                5316
            ],
            [
                5316,
                5316
            ],
            [
                5316,
                5316
            ],
            [
                5316,
                5316
            ],
            [
                5316,
                5316
            ],
            [
                5316,
                5316
            ],
            [
                5316,
                5316
            ],
            [
                5316,
                5316
            ],
            [
                5316,
                5316
            ],
            [
                5316,
                5316
            ],
            [
                5316,
                5316
            ],
            [
                5316,
                5316
            ],
            [
                5316,
                5316
            ]
        ]
    }
}