{
    "original": {
        "text": "Though my father was hugely tickled with the subtleties of these learned discourses------'twas still but like the anointing of a broken bone ------The moment he got home, the weight of his afflictions returned upon him but so much the heavier, as is ever the case when the staff we lean on slips from under us. --He became pensive--walked frequently forth to the fish-pond--let down one loop of his hat----sigh'd often----forbore to snap--and, as the hasty sparks of temper, which occasion snapping, so much assist perspiration and digestion, as _Hippocrates_ tells us--he had certainly fallen ill with the extinction of them, had not his thoughts been critically drawn off, and his health rescued by a fresh train of disquietudes left him, with a legacy of a thousand pounds, by my aunt _Dinah_.\nMy father had scarce read the letter, when taking the thing by the right end, he instantly began to plague and puzzle his head how to lay it out mostly to the honour of his family. --A hundred-and-fifty odd projects took possession of his brains by turns--he would do this, and that, and t'other --He would go to _Rome_----he would go to law----he would buy stock----he would buy _John Hobson's_ farm--he would new fore-front his house, and add a new wing to make it even ----There was a fine water-mill on this side, and he would build a wind-mill on the other side of the river in full view to answer it --But above all things in the world, he would inclose the great _Ox-moor_, and send out my brother _Bobby_ immediately upon his travels.\nBut as the sum was _finite_, and consequently could not do everything----and in truth very few of these to any purpose--of all the projects which offered themselves upon this occasion, the two last seemed to make the deepest impression; and he would infallibly have determined upon both at once, but for the small inconvenience hinted at above, which absolutely put him under a necessity of deciding in favour either of the one or the other.\nThis was not altogether so easy to be done; for though 'tis certain my father had long before set his heart upon this necessary part of my brother's education, and like a prudent man had actually determined to carry it into execution, with the first money that returned from the second creation of actions in the _Missisippi_-scheme, in which he was an adventurer----yet the _Ox-moor_, which was a fine, large, whinny, undrained, unimproved common, belonging to the _Shandy_-estate, had almost as old a claim upon him: he had long and affectionately set his heart upon turning it likewise to some account.\nBut having never hitherto been pressed with such a conjuncture of things, as made it necessary to settle either the priority or justice of their claims----like a wise man he had refrained entering into any nice or critical examination about them: so that upon the dismission of every other project at this crisis------the two old projects, the OX-MOOR and my BROTHER, divided him again; and so equal a match were they for each other, as to become the occasion of no small contest in the old gentleman's mind--which of the two should be set o'going first.\n----People may laugh as they will--but the case was this.\nIt had ever been the custom of the family, and by length of time was almost become a matter of common right, that the eldest son of it should have free ingress, egress, and regress into foreign parts before marriage--not only for the sake of bettering his own private parts, by the benefit of exercise and change of so much air--but simply for the mere delectation of his fancy, by the feather put into his cap, of having been abroad--_tantum valet_, my father would say, _quantum sonat_.\nNow as this was a reasonable, and in course a most christian indulgence----to deprive him of it, without why or wherefore----and thereby make an example of him, as the first _Shandy_ unwhirl'd about _Europe_ in a post-chaise, and only because he was a heavy lad----would be using him ten times worse than a Turk.\nOn the other hand, the case of the _Ox-moor_ was full as hard.\nExclusive of the original purchase-money, which was eight hundred pounds----it had cost the family eight hundred pounds more in a law-suit about fifteen years before--besides the Lord knows what trouble and vexation.\nIt had been moreover in possession of the _Shandy_-family ever since the middle of the last century; and though it lay full in view before the house, bounded on one extremity by the water-mill, and on the other by the projected wind-mill, spoken of above--and for all these reasons seemed to have the fairest title of any part of the estate to the care and protection of the family--yet by an unaccountable fatality, common to men, as well as the ground they tread on----it had all along most shamefully been overlook'd; and to speak the truth of it, had suffered so much by it, that it would have made any man's heart have bled (_Obadiah_ said) who understood the value of the land, to have rode over it, and only seen the condition it was in.\nHowever, as neither the purchasing this tract of ground----nor indeed the placing of it where it lay, were either of them, properly speaking, of my father's doing----he had never thought himself any way concerned in the affair------till the fifteen years before, when the breaking out of that cursed law-suit mentioned above (and which had arose about its boundaries)------which being altogether my father's own act and deed, it naturally awakened every other argument in its favour, and upon summing them all up together, he saw, not merely in interest, but in honour, he was bound to do something for it----and that now or never was the time.\nI think there must certainly have been a mixture of ill-luck in it, that the reasons on both sides should happen to be so equally balanced by each other; for though my father weigh'd them in all humours and conditions------spent many an anxious hour in the most profound and abstracted meditation upon what was best to be done--reading books of farming one day------books of travels another----laying aside all passion whatever--viewing the arguments on both sides in all their lights and circumstances--communing every day with my uncle _Toby_--arguing with _Yorick_, and talking over the whole affair of the _Ox-moor_ with _Obadiah_------yet nothing in all that time appeared so strongly in behalf of the one, which was not either strictly applicable to the other, or at least so far counterbalanced by some consideration of equal weight, as to keep the scales even.\nFor to be sure, with proper helps, and in the hands of some people, tho' the _Ox-moor_ would undoubtedly have made a different appearance in the world from what it did, or ever could do in the condition it lay----yet every tittle of this was true, with regard to my brother _Bobby_----let _Obadiah_ say what he would.------\nIn point of interest----the contest, I own, at first sight, did not appear so undecisive betwixt them; for whenever my father took pen and ink in hand, and set about calculating the simple expence of paring and burning, and fencing in the _Ox-moor_ &c. &c. --with the certain profit it would bring him in return----the latter turned out so prodigiously in his way of working the account, that you would have sworn the _Ox-moor_ would have carried all before it. For it was plain he should reap a hundred lasts of rape, at twenty pounds a last, the very first year----besides an excellent crop of wheat the year following----and the year after that, to speak within bounds, a hundred----but in all likelihood, a hundred and fifty------if not two hundred quarters of pease and beans----besides potatoes without end. ----But then, to think he was all this while breeding up my brother, like a hog to eat them----knocked all on the head again, and generally left the old gentleman in such a state of suspence----that, as he often declared to my uncle _Toby_----he knew no more than his heels what to do.\nNo body, but he who has felt it, can conceive what a plaguing thing it is to have a man's mind torn asunder by two projects of equal strength, both obstinately pulling in a contrary direction at the same time: for to say nothing of the havock, which by a certain consequence is unavoidably made by it all over the finer system of the nerves, which you know convey the animal spirits and more subtle juices from the heart to the head, and so on----it is not to be told in what a degree such a wayward kind of friction works upon the more gross and solid parts, wasting the fat and impairing the strength of a man every time as it goes backwards and forwards.\nMy father had certainly sunk under this evil, as certainly as he had done under that of my CHRISTIAN NAME----had he not been rescued out of it, as he was out of that, by a fresh evil------the misfortune of my brother _Bobby's_ death.\nWhat is the life of man! Is it not to shift from side to side? ------from sorrow to sorrow? ------to button up one cause of vexation------and unbutton another?",
        "paragraph_chars": [
            [
                0,
                797
            ],
            [
                797,
                1540
            ],
            [
                1540,
                1982
            ],
            [
                1982,
                2588
            ],
            [
                2588,
                3143
            ],
            [
                3143,
                3201
            ],
            [
                3201,
                3690
            ],
            [
                3690,
                4003
            ],
            [
                4003,
                4066
            ],
            [
                4066,
                4283
            ],
            [
                4283,
                5028
            ],
            [
                5028,
                5673
            ],
            [
                5673,
                6542
            ],
            [
                6542,
                6866
            ],
            [
                6866,
                7966
            ],
            [
                7966,
                8624
            ],
            [
                8624,
                8858
            ],
            [
                8858,
                9017
            ]
        ],
        "segment_chars": [
            [
                0,
                311
            ],
            [
                311,
                797
            ],
            [
                797,
                978
            ],
            [
                978,
                1540
            ],
            [
                1540,
                1982
            ],
            [
                1982,
                2588
            ],
            [
                2588,
                3143
            ],
            [
                3143,
                3201
            ],
            [
                3201,
                3690
            ],
            [
                3690,
                4003
            ],
            [
                4003,
                4066
            ],
            [
                4066,
                4283
            ],
            [
                4283,
                5028
            ],
            [
                5028,
                5673
            ],
            [
                5673,
                6542
            ],
            [
                6542,
                6866
            ],
            [
                6866,
                7328
            ],
            [
                7328,
                7680
            ],
            [
                7680,
                7966
            ],
            [
                7966,
                8624
            ],
            [
                8624,
                8858
            ],
            [
                8858,
                8883
            ],
            [
                8883,
                8921
            ],
            [
                8921,
                8950
            ],
            [
                8950,
                9017
            ]
        ],
        "overlap_chars": [
            [
                0,
                58
            ],
            [
                65,
                72
            ],
            [
                89,
                100
            ],
            [
                105,
                109
            ],
            [
                287,
                289
            ],
            [
                127,
                140
            ],
            [
                264,
                268
            ],
            [
                158,
                170
            ],
            [
                185,
                200
            ],
            [
                210,
                218
            ],
            [
                223,
                242
            ],
            [
                309,
                311
            ],
            [
                313,
                330
            ],
            [
                339,
                349
            ],
            [
                356,
                372
            ],
            [
                413,
                418
            ],
            [
                439,
                442
            ],
            [
                577,
                597
            ],
            [
                625,
                652
            ],
            [
                698,
                717
            ],
            [
                731,
                787
            ],
            [
                789,
                794
            ],
            [
                797,
                839
            ],
            [
                875,
                896
            ],
            [
                908,
                930
            ],
            [
                847,
                850
            ],
            [
                949,
                978
            ],
            [
                980,
                1031
            ],
            [
                1043,
                1051
            ],
            [
                1216,
                1217
            ],
            [
                1095,
                1109
            ],
            [
                1120,
                1138
            ],
            [
                1142,
                1160
            ],
            [
                1164,
                1176
            ],
            [
                1178,
                1191
            ],
            [
                1193,
                1197
            ],
            [
                1053,
                1061
            ],
            [
                1208,
                1211
            ],
            [
                1217,
                1222
            ],
            [
                1223,
                1268
            ],
            [
                1273,
                1402
            ],
            [
                1405,
                1448
            ],
            [
                1453,
                1466
            ],
            [
                1468,
                1475
            ],
            [
                1476,
                1501
            ],
            [
                1503,
                1508
            ],
            [
                1510,
                1540
            ],
            [
                1544,
                1558
            ],
            [
                1567,
                1572
            ],
            [
                1586,
                1609
            ],
            [
                1834,
                1835
            ],
            [
                1660,
                1666
            ],
            [
                1638,
                1643
            ],
            [
                1671,
                1679
            ],
            [
                1723,
                1737
            ],
            [
                1753,
                1789
            ],
            [
                1801,
                1805
            ],
            [
                1822,
                1826
            ],
            [
                1883,
                1884
            ],
            [
                1540,
                1543
            ],
            [
                1644,
                1646
            ],
            [
                1940,
                1949
            ],
            [
                1635,
                1637
            ],
            [
                1950,
                1956
            ],
            [
                1964,
                1982
            ],
            [
                1982,
                1994
            ],
            [
                2006,
                2013
            ],
            [
                2024,
                2036
            ],
            [
                2050,
                2145
            ],
            [
                2165,
                2168
            ],
            [
                2178,
                2200
            ],
            [
                2217,
                2256
            ],
            [
                2536,
                2539
            ],
            [
                2288,
                2294
            ],
            [
                2296,
                2300
            ],
            [
                2302,
                2306
            ],
            [
                2308,
                2314
            ],
            [
                2349,
                2356
            ],
            [
                2358,
                2365
            ],
            [
                2366,
                2392
            ],
            [
                2399,
                2410
            ],
            [
                2423,
                2447
            ],
            [
                2449,
                2455
            ],
            [
                2457,
                2512
            ],
            [
                2014,
                2016
            ],
            [
                2559,
                2561
            ],
            [
                2571,
                2588
            ],
            [
                2592,
                2604
            ],
            [
                2762,
                2765
            ],
            [
                2683,
                2685
            ],
            [
                2906,
                2913
            ],
            [
                2660,
                2661
            ],
            [
                2759,
                2761
            ],
            [
                2838,
                2842
            ],
            [
                2670,
                2672
            ],
            [
                2979,
                2995
            ],
            [
                2928,
                2955
            ],
            [
                3022,
                3027
            ],
            [
                3051,
                3095
            ],
            [
                3141,
                3143
            ],
            [
                3147,
                3163
            ],
            [
                3178,
                3201
            ],
            [
                3201,
                3207
            ],
            [
                3213,
                3221
            ],
            [
                3236,
                3242
            ],
            [
                3222,
                3228
            ],
            [
                3310,
                3329
            ],
            [
                3336,
                3342
            ],
            [
                3348,
                3352
            ],
            [
                3382,
                3416
            ],
            [
                3418,
                3426
            ],
            [
                3483,
                3490
            ],
            [
                3232,
                3235
            ],
            [
                3494,
                3516
            ],
            [
                3525,
                3528
            ],
            [
                3530,
                3533
            ],
            [
                3427,
                3434
            ],
            [
                3554,
                3611
            ],
            [
                3613,
                3634
            ],
            [
                3690,
                3718
            ],
            [
                3751,
                3761
            ],
            [
                3765,
                3811
            ],
            [
                3815,
                3831
            ],
            [
                3846,
                3849
            ],
            [
                3854,
                3863
            ],
            [
                3865,
                3871
            ],
            [
                3873,
                3877
            ],
            [
                3883,
                3888
            ],
            [
                3890,
                3896
            ],
            [
                3898,
                3914
            ],
            [
                3955,
                4003
            ],
            [
                4003,
                4037
            ],
            [
                4039,
                4046
            ],
            [
                4048,
                4051
            ],
            [
                4057,
                4066
            ],
            [
                4079,
                4082
            ],
            [
                4092,
                4138
            ],
            [
                4142,
                4231
            ],
            [
                4241,
                4283
            ],
            [
                4283,
                4294
            ],
            [
                4304,
                4324
            ],
            [
                4326,
                4332
            ],
            [
                4334,
                4447
            ],
            [
                4458,
                4520
            ],
            [
                4522,
                4537
            ],
            [
                4666,
                4669
            ],
            [
                4520,
                4521
            ],
            [
                4676,
                4685
            ],
            [
                4698,
                4699
            ],
            [
                4754,
                4760
            ],
            [
                4787,
                4791
            ],
            [
                4771,
                4786
            ],
            [
                4808,
                4826
            ],
            [
                4713,
                4714
            ],
            [
                4830,
                4832
            ],
            [
                4834,
                4854
            ],
            [
                4862,
                4901
            ],
            [
                4914,
                4921
            ],
            [
                4923,
                4992
            ],
            [
                4998,
                5028
            ],
            [
                5028,
                5047
            ],
            [
                5087,
                5090
            ],
            [
                5130,
                5134
            ],
            [
                5170,
                5190
            ],
            [
                5128,
                5129
            ],
            [
                5194,
                5206
            ],
            [
                5231,
                5240
            ],
            [
                5215,
                5222
            ],
            [
                5113,
                5115
            ],
            [
                5269,
                5299
            ],
            [
                5313,
                5354
            ],
            [
                5358,
                5394
            ],
            [
                5407,
                5443
            ],
            [
                5149,
                5150
            ],
            [
                5457,
                5481
            ],
            [
                5488,
                5511
            ],
            [
                5551,
                5553
            ],
            [
                5590,
                5596
            ],
            [
                5605,
                5633
            ],
            [
                5637,
                5673
            ],
            [
                5673,
                5680
            ],
            [
                5737,
                5739
            ],
            [
                5980,
                5983
            ],
            [
                5725,
                5733
            ],
            [
                5741,
                5771
            ],
            [
                5792,
                5811
            ],
            [
                5825,
                5847
            ],
            [
                5856,
                5860
            ],
            [
                6001,
                6033
            ],
            [
                6039,
                6063
            ],
            [
                6197,
                6210
            ],
            [
                5876,
                5879
            ],
            [
                6233,
                6239
            ],
            [
                6240,
                6262
            ],
            [
                6269,
                6282
            ],
            [
                6284,
                6291
            ],
            [
                6227,
                6231
            ],
            [
                6299,
                6306
            ],
            [
                6313,
                6324
            ],
            [
                6342,
                6398
            ],
            [
                6459,
                6512
            ],
            [
                5923,
                5929
            ],
            [
                5820,
                5825
            ],
            [
                6540,
                6542
            ],
            [
                6542,
                6545
            ],
            [
                6608,
                6609
            ],
            [
                6546,
                6562
            ],
            [
                6584,
                6587
            ],
            [
                6563,
                6576
            ],
            [
                6615,
                6618
            ],
            [
                6620,
                6627
            ],
            [
                6629,
                6679
            ],
            [
                6693,
                6709
            ],
            [
                6755,
                6758
            ],
            [
                6775,
                6783
            ],
            [
                6784,
                6788
            ],
            [
                6790,
                6815
            ],
            [
                6817,
                6822
            ],
            [
                6858,
                6859
            ],
            [
                6890,
                6943
            ],
            [
                6969,
                6991
            ],
            [
                7044,
                7054
            ],
            [
                6875,
                6877
            ],
            [
                7077,
                7084
            ],
            [
                7086,
                7104
            ],
            [
                7106,
                7113
            ],
            [
                7016,
                7017
            ],
            [
                7130,
                7133
            ],
            [
                7142,
                7167
            ],
            [
                7181,
                7225
            ],
            [
                7252,
                7273
            ],
            [
                7241,
                7244
            ],
            [
                7285,
                7292
            ],
            [
                7294,
                7328
            ],
            [
                7328,
                7344
            ],
            [
                7454,
                7461
            ],
            [
                7379,
                7383
            ],
            [
                7348,
                7354
            ],
            [
                7395,
                7401
            ],
            [
                7410,
                7429
            ],
            [
                7441,
                7453
            ],
            [
                7462,
                7467
            ],
            [
                7468,
                7486
            ],
            [
                7490,
                7514
            ],
            [
                7360,
                7369
            ],
            [
                7383,
                7384
            ],
            [
                7600,
                7630
            ],
            [
                7637,
                7646
            ],
            [
                7658,
                7679
            ],
            [
                7684,
                7747
            ],
            [
                7749,
                7771
            ],
            [
                7747,
                7748
            ],
            [
                7783,
                7809
            ],
            [
                7820,
                7850
            ],
            [
                7874,
                7878
            ],
            [
                7923,
                7966
            ],
            [
                7999,
                8136
            ],
            [
                8139,
                8147
            ],
            [
                8174,
                8201
            ],
            [
                8256,
                8260
            ],
            [
                8407,
                8409
            ],
            [
                8296,
                8307
            ],
            [
                8451,
                8465
            ],
            [
                8474,
                8488
            ],
            [
                8387,
                8389
            ],
            [
                8137,
                8138
            ],
            [
                8444,
                8450
            ],
            [
                8489,
                8525
            ],
            [
                8546,
                8588
            ],
            [
                8592,
                8624
            ],
            [
                8624,
                8633
            ],
            [
                8638,
                8647
            ],
            [
                8648,
                8669
            ],
            [
                8683,
                8729
            ],
            [
                8733,
                8766
            ],
            [
                8791,
                8806
            ],
            [
                8812,
                8840
            ],
            [
                8842,
                8849
            ],
            [
                8851,
                8858
            ],
            [
                8858,
                8883
            ],
            [
                8883,
                8906
            ],
            [
                8932,
                8950
            ],
            [
                8956,
                8990
            ],
            [
                8996,
                9017
            ]
        ],
        "row_chars": [
            [
                0,
                311
            ],
            [
                311,
                797
            ],
            [
                797,
                978
            ],
            [
                978,
                1540
            ],
            [
                1540,
                1982
            ],
            [
                1982,
                2588
            ],
            [
                2588,
                3143
            ],
            [
                3143,
                3201
            ],
            [
                3201,
                3690
            ],
            [
                3690,
                4003
            ],
            [
                4003,
                4066
            ],
            [
                4066,
                4283
            ],
            [
                4283,
                5028
            ],
            [
                5028,
                5673
            ],
            [
                5673,
                6542
            ],
            [
                6542,
                6866
            ],
            [
                6866,
                7328
            ],
            [
                7328,
                7680
            ],
            [
                7680,
                7966
            ],
            [
                7966,
                8624
            ],
            [
                8624,
                8858
            ],
            [
                8858,
                8883
            ],
            [
                8883,
                8950
            ],
            [
                8950,
                9017
            ]
        ]
    },
    "abridged": {
        "text": "Though my father was hugely tickled with the subtleties of this learned discourse - 'twas still like putting ointment on a broken bone.\nWhen he got home, his afflictions weighed upon him so much the heavier. He became pensive - walked frequently to the fish-pond - sighed often - and would have certainly fallen ill, had not his thoughts been distracted by a fresh train of worries left him, with a legacy of a thousand pounds, by my aunt Dinah.\nMy father had scarce read the letter, when he instantly began to puzzle his head how to use the money to the honour of his family. A hundred-and-fifty odd projects took possession of him by turns - he would go to Rome - he would go to law - he would buy stock - he would buy John Hobson's farm - he would build a new front to his house, and add a new wing to make it even. - There was a fine water-mill on this side, and he would build a wind-mill on the other side of the river in full view to answer it.\n- But above all things in the world, he would enclose the great Ox-moor, and send out my brother Bobby immediately upon his travels.\nAs the sum was finite, and could not do everything, of all these projects, the two last made the deepest impression; and he would have done both, could he have afforded it: but he needed to decide in favour of either one or the other.\nThis was not so easy; for though my father had long before set his heart upon this necessary part of my brother's education, and had determined to carry it out with the first money that returned from his investments in the Mississippi-scheme - yet the Ox-moor, which was a fine, large, gorse-covered, undrained common, belonging to the Shandy-estate, had almost as old a claim upon him: he had long wished to turn it to some account.\nHaving never had to decide between the two before, he now found that it was so equal a match between the Ox-moor and my Brother, as to cause no small contest in the old gentleman's mind.\nPeople may laugh - but the case was this.\nIt had always been the family's custom that the eldest son should be free to travel into foreign parts before marriage - not only to benefit bodily from the exercise and change of air - but also for the delectation of his fancy, by the feather put into his cap of having been abroad.\nNow as this was a reasonable indulgence - to deprive him of it, without why or wherefore - and thereby make him the first Shandy unwhirled about Europe in a post-chaise - would be using him ten times worse than a Turk.\nOn the other hand, the case of the Ox-moor was just as hard.\nAs well as the purchase-money, which was eight hundred pounds, it had cost the family eight hundred pounds more in a law-suit about fifteen years before - besides the Lord knows what trouble and vexation.\nIt had been in possession of the Shandy-family ever since the middle of the last century; and though it lay full in view before the house, bounded on one side by the water-mill, and on the other by the projected wind-mill spoken of above - yet, unaccountably, it had always been most shamefully overlooked. To speak the truth, it had suffered so much that it would have made any man's heart bleed (Obadiah said) who understood the value of the land, to have rode over it, and seen the condition it was in.\nHowever, as neither its purchase nor its position were of my father's doing, he had never concerned himself with it - till fifteen years before, when the fighting of that cursed law-suit mentioned above (which had arose about its boundaries), being altogether my father's own act, naturally awakened every argument in its favour, so that he felt honour-bound to do something for it - and that now or never was the time.\nI think it was ill-luck that the reasons on both sides were so equally balanced; for though my father weighed them anxiously - reading books of farming one day - books of travels another - arguing with my uncle and Yorick, and talking over the affair of the Ox-moor with Obadiah - yet nothing appeared so strongly in behalf of the one, which was not counterbalanced by some consideration of equal weight in the other.\nFor, to be sure, with the proper helps, the Ox-moor would undoubtedly have made a different appearance from what it did - yet this was also true with regard to my brother Bobby.\nThe contest, I own, at first sight, did not appear so close: for whenever my father calculated the simple expense of burning and fencing in the Ox-moor, compared to the profit it would bring him - the latter turned out so prodigiously in his favour, that you would have thought the Ox-moor would have carried all before it. For it was plain his crop of rape should make two thousand pounds the very first year - besides an excellent wheat harvest the year following - and the year after that, a hundred, if not two hundred quarters of peas and beans - besides potatoes without end.\nBut then, to think he was all this while breeding up my brother like a hog to eat them, knocked all on the head again, and left the old gentleman in such suspense that he knew no more than his heels what to do.\nNobody can conceive what a plaguing thing it is to have a man's mind torn asunder by two projects of equal strength, both obstinately pulling in contrary directions: for to say nothing of the havoc made on the nerves, such a wayward friction works to a dreadful degree upon the more gross and solid parts, impairing the strength of a man every time it goes backwards and forwards.\nMy father would certainly have sunk under this evil, as he had done under that of my christian name - had he not been rescued out of it by a fresh evil - the misfortune of my brother Bobby's death.\nWhat is the life of man! Is it not to shift from sorrow to sorrow? - to button up one cause of vexation - and unbutton another?",
        "paragraph_chars": [
            [
                0,
                136
            ],
            [
                136,
                446
            ],
            [
                446,
                952
            ],
            [
                952,
                1085
            ],
            [
                1085,
                1320
            ],
            [
                1320,
                1754
            ],
            [
                1754,
                1941
            ],
            [
                1941,
                1983
            ],
            [
                1983,
                2267
            ],
            [
                2267,
                2486
            ],
            [
                2486,
                2547
            ],
            [
                2547,
                2752
            ],
            [
                2752,
                3258
            ],
            [
                3258,
                3678
            ],
            [
                3678,
                4096
            ],
            [
                4096,
                4274
            ],
            [
                4274,
                4856
            ],
            [
                4856,
                5067
            ],
            [
                5067,
                5448
            ],
            [
                5448,
                5646
            ],
            [
                5646,
                5773
            ]
        ],
        "segment_chars": [
            [
                0,
                136
            ],
            [
                136,
                208
            ],
            [
                208,
                446
            ],
            [
                446,
                577
            ],
            [
                577,
                819
            ],
            [
                819,
                952
            ],
            [
                952,
                1085
            ],
            [
                1085,
                1320
            ],
            [
                1320,
                1754
            ],
            [
                1754,
                1941
            ],
            [
                1941,
                1983
            ],
            [
                1983,
                2267
            ],
            [
                2267,
                2486
            ],
            [
                2486,
                2547
            ],
            [
                2547,
                2752
            ],
            [
                2752,
                3059
            ],
            [
                3059,
                3258
            ],
            [
                3258,
                3678
            ],
            [
                3678,
                4096
            ],
            [
                4096,
                4274
            ],
            [
                4274,
                4598
            ],
            [
                4598,
                4856
            ],
            [
                4856,
                5067
            ],
            [
                5067,
                5448
            ],
            [
                5448,
                5646
            ],
            [
                5646,
                5671
            ],
            [
                5671,
                5713
            ],
            [
                5713,
                5773
            ]
        ],
        "overlap_chars": [
            [
                0,
                58
            ],
            [
                64,
                71
            ],
            [
                84,
                95
            ],
            [
                96,
                100
            ],
            [
                118,
                120
            ],
            [
                121,
                134
            ],
            [
                136,
                140
            ],
            [
                141,
                153
            ],
            [
                154,
                169
            ],
            [
                178,
                186
            ],
            [
                187,
                206
            ],
            [
                206,
                208
            ],
            [
                208,
                225
            ],
            [
                235,
                245
            ],
            [
                246,
                262
            ],
            [
                272,
                277
            ],
            [
                280,
                283
            ],
            [
                295,
                315
            ],
            [
                315,
                342
            ],
            [
                354,
                373
            ],
            [
                382,
                438
            ],
            [
                439,
                444
            ],
            [
                446,
                488
            ],
            [
                489,
                510
            ],
            [
                511,
                533
            ],
            [
                538,
                541
            ],
            [
                548,
                577
            ],
            [
                577,
                628
            ],
            [
                633,
                641
            ],
            [
                642,
                643
            ],
            [
                644,
                658
            ],
            [
                666,
                684
            ],
            [
                687,
                705
            ],
            [
                708,
                720
            ],
            [
                721,
                734
            ],
            [
                735,
                739
            ],
            [
                742,
                750
            ],
            [
                759,
                762
            ],
            [
                763,
                768
            ],
            [
                772,
                817
            ],
            [
                821,
                950
            ],
            [
                954,
                997
            ],
            [
                1002,
                1015
            ],
            [
                1016,
                1023
            ],
            [
                1023,
                1048
            ],
            [
                1049,
                1054
            ],
            [
                1055,
                1085
            ],
            [
                1085,
                1099
            ],
            [
                1106,
                1111
            ],
            [
                1112,
                1135
            ],
            [
                1135,
                1136
            ],
            [
                1137,
                1143
            ],
            [
                1144,
                1149
            ],
            [
                1150,
                1158
            ],
            [
                1158,
                1172
            ],
            [
                1178,
                1214
            ],
            [
                1215,
                1219
            ],
            [
                1225,
                1229
            ],
            [
                1229,
                1230
            ],
            [
                1258,
                1261
            ],
            [
                1272,
                1274
            ],
            [
                1282,
                1291
            ],
            [
                1292,
                1294
            ],
            [
                1295,
                1301
            ],
            [
                1302,
                1320
            ],
            [
                1320,
                1332
            ],
            [
                1333,
                1340
            ],
            [
                1340,
                1352
            ],
            [
                1353,
                1448
            ],
            [
                1449,
                1452
            ],
            [
                1453,
                1475
            ],
            [
                1480,
                1519
            ],
            [
                1520,
                1523
            ],
            [
                1536,
                1542
            ],
            [
                1543,
                1547
            ],
            [
                1550,
                1554
            ],
            [
                1555,
                1561
            ],
            [
                1564,
                1571
            ],
            [
                1572,
                1579
            ],
            [
                1579,
                1605
            ],
            [
                1619,
                1630
            ],
            [
                1631,
                1655
            ],
            [
                1656,
                1662
            ],
            [
                1663,
                1718
            ],
            [
                1726,
                1728
            ],
            [
                1734,
                1736
            ],
            [
                1737,
                1754
            ],
            [
                1754,
                1766
            ],
            [
                1767,
                1770
            ],
            [
                1771,
                1773
            ],
            [
                1789,
                1796
            ],
            [
                1803,
                1804
            ],
            [
                1805,
                1807
            ],
            [
                1818,
                1822
            ],
            [
                1823,
                1825
            ],
            [
                1830,
                1846
            ],
            [
                1855,
                1882
            ],
            [
                1883,
                1888
            ],
            [
                1895,
                1939
            ],
            [
                1939,
                1941
            ],
            [
                1941,
                1957
            ],
            [
                1960,
                1983
            ],
            [
                1983,
                1989
            ],
            [
                1997,
                2005
            ],
            [
                2006,
                2012
            ],
            [
                2015,
                2021
            ],
            [
                2022,
                2041
            ],
            [
                2042,
                2048
            ],
            [
                2052,
                2056
            ],
            [
                2067,
                2101
            ],
            [
                2104,
                2112
            ],
            [
                2116,
                2123
            ],
            [
                2136,
                2139
            ],
            [
                2140,
                2162
            ],
            [
                2163,
                2166
            ],
            [
                2169,
                2172
            ],
            [
                2178,
                2185
            ],
            [
                2186,
                2243
            ],
            [
                2244,
                2265
            ],
            [
                2267,
                2295
            ],
            [
                2296,
                2306
            ],
            [
                2309,
                2355
            ],
            [
                2358,
                2374
            ],
            [
                2375,
                2378
            ],
            [
                2379,
                2388
            ],
            [
                2389,
                2395
            ],
            [
                2396,
                2400
            ],
            [
                2406,
                2411
            ],
            [
                2412,
                2418
            ],
            [
                2419,
                2435
            ],
            [
                2438,
                2486
            ],
            [
                2486,
                2520
            ],
            [
                2521,
                2528
            ],
            [
                2529,
                2532
            ],
            [
                2538,
                2547
            ],
            [
                2558,
                2561
            ],
            [
                2562,
                2608
            ],
            [
                2610,
                2699
            ],
            [
                2710,
                2752
            ],
            [
                2752,
                2763
            ],
            [
                2764,
                2784
            ],
            [
                2785,
                2791
            ],
            [
                2792,
                2905
            ],
            [
                2911,
                2973
            ],
            [
                2974,
                2989
            ],
            [
                2992,
                2995
            ],
            [
                2995,
                2996
            ],
            [
                2997,
                3006
            ],
            [
                3010,
                3011
            ],
            [
                3012,
                3018
            ],
            [
                3026,
                3030
            ],
            [
                3031,
                3046
            ],
            [
                3059,
                3077
            ],
            [
                3077,
                3078
            ],
            [
                3079,
                3081
            ],
            [
                3082,
                3102
            ],
            [
                3103,
                3142
            ],
            [
                3150,
                3157
            ],
            [
                3158,
                3227
            ],
            [
                3228,
                3258
            ],
            [
                3258,
                3277
            ],
            [
                3291,
                3294
            ],
            [
                3308,
                3312
            ],
            [
                3313,
                3333
            ],
            [
                3333,
                3334
            ],
            [
                3335,
                3347
            ],
            [
                3348,
                3357
            ],
            [
                3358,
                3365
            ],
            [
                3371,
                3373
            ],
            [
                3381,
                3411
            ],
            [
                3421,
                3462
            ],
            [
                3462,
                3498
            ],
            [
                3501,
                3537
            ],
            [
                3537,
                3538
            ],
            [
                3539,
                3563
            ],
            [
                3564,
                3587
            ],
            [
                3596,
                3598
            ],
            [
                3604,
                3610
            ],
            [
                3611,
                3639
            ],
            [
                3642,
                3678
            ],
            [
                3678,
                3685
            ],
            [
                3686,
                3688
            ],
            [
                3689,
                3692
            ],
            [
                3693,
                3701
            ],
            [
                3702,
                3732
            ],
            [
                3738,
                3757
            ],
            [
                3757,
                3779
            ],
            [
                3788,
                3792
            ],
            [
                3805,
                3837
            ],
            [
                3840,
                3864
            ],
            [
                3875,
                3888
            ],
            [
                3889,
                3892
            ],
            [
                3893,
                3899
            ],
            [
                3899,
                3921
            ],
            [
                3922,
                3935
            ],
            [
                3936,
                3943
            ],
            [
                3944,
                3948
            ],
            [
                3949,
                3956
            ],
            [
                3959,
                3970
            ],
            [
                3971,
                4027
            ],
            [
                4028,
                4081
            ],
            [
                4082,
                4088
            ],
            [
                4089,
                4094
            ],
            [
                4094,
                4096
            ],
            [
                4096,
                4099
            ],
            [
                4099,
                4100
            ],
            [
                4101,
                4117
            ],
            [
                4118,
                4121
            ],
            [
                4122,
                4135
            ],
            [
                4136,
                4139
            ],
            [
                4140,
                4147
            ],
            [
                4148,
                4198
            ],
            [
                4199,
                4215
            ],
            [
                4218,
                4221
            ],
            [
                4222,
                4230
            ],
            [
                4236,
                4240
            ],
            [
                4241,
                4266
            ],
            [
                4267,
                4272
            ],
            [
                4272,
                4273
            ],
            [
                4274,
                4327
            ],
            [
                4335,
                4357
            ],
            [
                4369,
                4379
            ],
            [
                4388,
                4390
            ],
            [
                4391,
                4398
            ],
            [
                4399,
                4417
            ],
            [
                4418,
                4425
            ],
            [
                4425,
                4426
            ],
            [
                4439,
                4442
            ],
            [
                4443,
                4468
            ],
            [
                4471,
                4515
            ],
            [
                4522,
                4543
            ],
            [
                4552,
                4555
            ],
            [
                4556,
                4563
            ],
            [
                4564,
                4598
            ],
            [
                4598,
                4614
            ],
            [
                4619,
                4626
            ],
            [
                4627,
                4631
            ],
            [
                4632,
                4638
            ],
            [
                4657,
                4663
            ],
            [
                4664,
                4683
            ],
            [
                4694,
                4706
            ],
            [
                4707,
                4712
            ],
            [
                4721,
                4739
            ],
            [
                4742,
                4766
            ],
            [
                4767,
                4776
            ],
            [
                4776,
                4777
            ],
            [
                4778,
                4808
            ],
            [
                4814,
                4823
            ],
            [
                4834,
                4855
            ],
            [
                4856,
                4919
            ],
            [
                4920,
                4942
            ],
            [
                4942,
                4943
            ],
            [
                4952,
                4978
            ],
            [
                4979,
                5009
            ],
            [
                5019,
                5023
            ],
            [
                5024,
                5067
            ],
            [
                5074,
                5211
            ],
            [
                5212,
                5220
            ],
            [
                5231,
                5258
            ],
            [
                5265,
                5269
            ],
            [
                5270,
                5272
            ],
            [
                5273,
                5284
            ],
            [
                5285,
                5299
            ],
            [
                5300,
                5314
            ],
            [
                5315,
                5317
            ],
            [
                5318,
                5319
            ],
            [
                5329,
                5335
            ],
            [
                5336,
                5372
            ],
            [
                5373,
                5415
            ],
            [
                5416,
                5448
            ],
            [
                5448,
                5457
            ],
            [
                5464,
                5473
            ],
            [
                5479,
                5500
            ],
            [
                5501,
                5547
            ],
            [
                5550,
                5583
            ],
            [
                5584,
                5599
            ],
            [
                5602,
                5630
            ],
            [
                5631,
                5638
            ],
            [
                5639,
                5646
            ],
            [
                5646,
                5671
            ],
            [
                5671,
                5694
            ],
            [
                5695,
                5713
            ],
            [
                5715,
                5749
            ],
            [
                5752,
                5773
            ]
        ],
        "row_chars": [
            [
                0,
                208
            ],
            [
                208,
                446
            ],
            [
                446,
                577
            ],
            [
                577,
                1085
            ],
            [
                1085,
                1320
            ],
            [
                1320,
                1754
            ],
            [
                1754,
                1941
            ],
            [
                1941,
                1983
            ],
            [
                1983,
                2267
            ],
            [
                2267,
                2486
            ],
            [
                2486,
                2547
            ],
            [
                2547,
                2752
            ],
            [
                2752,
                3258
            ],
            [
                3258,
                3678
            ],
            [
                3678,
                4096
            ],
            [
                4096,
                4274
            ],
            [
                4274,
                4598
            ],
            [
                4598,
                4856
            ],
            [
                4856,
                5067
            ],
            [
                5067,
                5448
            ],
            [
                5448,
                5646
            ],
            [
                5646,
                5671
            ],
            [
                5671,
                5713
            ],
            [
                5713,
                5773
            ]
        ]
    }
}