{
    "original": {
        "text": "From this moment I am to be considered as heir-apparent to the _Shandy_ family----and it is from this point properly, that the story of my LIFE and my OPINIONS sets out. With all my hurry and precipitation, I have but been clearing the ground to raise the building----and such a building do I foresee it will turn out, as never was planned, and as never was executed since _Adam_. In less than five minutes I shall have thrown my pen into the fire, and the little drop of thick ink which is left remaining at the bottom of my ink-horn, after it --I have but half a score things to do in the time ----I have a thing to name----a thing to lament----a thing to hope----a thing to promise, and a thing to threaten --I have a thing to suppose--a thing to declare----a thing to conceal----a thing to choose, and a thing to pray for ------This chapter, therefore, I _name_ the chapter of THINGS------and my next chapter to it, that is, the first chapter of my next volume, if I live, shall be my chapter upon WHISKERS, in order to keep up some sort of connection in my works.\nThe thing I lament is, that things have crowded in so thick upon me, that I have not been able to get into that part of my work, towards which I have all the way looked forwards, with so much earnest desire; and that is the Campaigns, but especially the amours of my uncle _Toby_, the events of which are of so singular a nature, and so Cervantick a cast, that if I can so manage it, as to convey but the same impressions to every other brain, which the occurrences themselves excite in my own --I will answer for it the book shall make its way in the world, much better than its master has done before it. ----Oh _Tristram!_ _Tristram!_ can this but be once brought about----the credit, which will attend thee as an author, shall counterbalance the many evils which have befallen thee as a man----thou wilt feast upon the one----when thou hast lost all sense and remembrance of the other!----\nNo wonder I itch so much as I do, to get at these amours --They are the choicest morsel of my whole story! and when I do get at 'em----assure yourselves, good folks--(nor do I value whose squeamish stomach takes offence at it) I shall not be at all nice in the choice of my words! ----and that's the thing I have to _declare_. ------I shall never get all through in five minutes, that I fear----and the thing I _hope_ is, that your worships and reverences are not offended--if you are, depend upon't I'll give you something, my good gentry, next year to be offended at----that's my dear _Jenny's_ way--but who my _Jenny_ is--and which is the right and which the wrong end of a woman, is the thing to be _concealed_--it shall be told you in the next chapter but one to my chapter of Button-holes----and not one chapter before.\nAnd now that you have just got to the end of these[4.14] four volumes----the thing I have to _ask_ is, how you feel your heads? my own akes dismally! ------as for your healths, I know, they are much better. --True _Shandeism_, think what you will against it, opens the heart and lungs, and like all those affections which partake of its nature, it forces the blood and other vital fluids of the body to run freely through its channels, makes the wheel of life run long and chearfully round.\nWas I left, like _Sancho Panca_, to choose my kingdom, it should not be maritime--or a kingdom of blacks to make a penny of; --no, it should be a kingdom of hearty laughing subjects: And as the bilious and more saturnine passions, by creating disorders in the blood and humours, have as bad an influence, I see, upon the body politick as body natural----and as nothing but a habit of virtue can fully govern those passions, and subject them to reason ------I should add to my prayer--that God would give my subjects grace to be as WISE as they were MERRY; and then should I be the happiest monarch, and they the happiest people under heaven.\nAnd so, with this moral for the present, may it please your worships and your reverences, I take my leave of you till this time twelve-month, when, (unless this vile cough kills me in the meantime) I'll have another pluck at your beards, and lay open a story to the world you little dream of.\n[Footnote 4.14: According to the original Editions.]\nTHE LIFE AND OPINIONS OF TRISTRAM SHANDY GENTLEMAN\nDixero si quid fort jocosius, hoc mihi juris Cum venia dabis. ---- HOR.\n--Si quis calumnietur levius esse quam decet theologum, aut mordacius quam deceat Christianum--non Ego, sed Democritus dixit. -- ERASMUS.\nSi quis Clericus, aut Monachus, verba joculatoria, risum moventia, sciebat, anathema esto. -- SECOND COUNCIL OF CARTHAGE.\nTO THE RIGHT HONOURABLE\nJOHN,\nLORD VISCOUNT SPENCER\nMY LORD,\nI humbly beg leave to offer you these two Volumes;[D.1] they are the best my talents, with such bad health as I have, could produce: --had Providence granted me a larger stock of either, they had been a much more proper present to your Lordship.\nI beg your Lordship will forgive me, if, at the same time I dedicate this work to you, I join Lady SPENCER, in the liberty I take of inscribing the story of _Le Fever_ to her name; for which I have no other motive, which my heart has informed me of, but that the story is a humane one.\nI am,\nMY LORD,\nYour Lordship's most devoted and most humble Servant,\nLAUR. STERNE.\n[Footnote D.1: Volumes V. and VI. in the first Edition.]",
        "paragraph_chars": [
            [
                0,
                1069
            ],
            [
                1069,
                1963
            ],
            [
                1963,
                2789
            ],
            [
                2789,
                3280
            ],
            [
                3280,
                3922
            ],
            [
                3922,
                4215
            ],
            [
                4215,
                4268
            ],
            [
                4268,
                4319
            ],
            [
                4319,
                4391
            ],
            [
                4391,
                4529
            ],
            [
                4529,
                4651
            ],
            [
                4651,
                4675
            ],
            [
                4675,
                4681
            ],
            [
                4681,
                4703
            ],
            [
                4703,
                4712
            ],
            [
                4712,
                4958
            ],
            [
                4958,
                5244
            ],
            [
                5244,
                5250
            ],
            [
                5250,
                5259
            ],
            [
                5259,
                5313
            ],
            [
                5313,
                5327
            ],
            [
                5327,
                5383
            ]
        ],
        "segment_chars": [
            [
                0,
                170
            ],
            [
                170,
                381
            ],
            [
                381,
                1069
            ],
            [
                1069,
                1676
            ],
            [
                1676,
                1963
            ],
            [
                1963,
                2070
            ],
            [
                2070,
                2244
            ],
            [
                2244,
                2290
            ],
            [
                2290,
                2789
            ],
            [
                2789,
                2917
            ],
            [
                2917,
                2939
            ],
            [
                2939,
                2996
            ],
            [
                2996,
                3280
            ],
            [
                3280,
                3922
            ],
            [
                3922,
                4215
            ],
            [
                4215,
                4268
            ],
            [
                4268,
                4319
            ],
            [
                4319,
                4381
            ],
            [
                4381,
                4391
            ],
            [
                4391,
                4517
            ],
            [
                4517,
                4529
            ],
            [
                4529,
                4620
            ],
            [
                4620,
                4651
            ],
            [
                4651,
                4675
            ],
            [
                4675,
                4681
            ],
            [
                4681,
                4703
            ],
            [
                4703,
                4712
            ],
            [
                4712,
                4958
            ],
            [
                4958,
                5244
            ],
            [
                5244,
                5250
            ],
            [
                5250,
                5259
            ],
            [
                5259,
                5313
            ],
            [
                5313,
                5319
            ],
            [
                5319,
                5327
            ],
            [
                5327,
                5361
            ],
            [
                5361,
                5383
            ]
        ],
        "overlap_chars": [
            [
                0,
                62
            ],
            [
                64,
                70
            ],
            [
                72,
                78
            ],
            [
                82,
                116
            ],
            [
                118,
                159
            ],
            [
                168,
                170
            ],
            [
                170,
                187
            ],
            [
                205,
                213
            ],
            [
                218,
                264
            ],
            [
                268,
                339
            ],
            [
                188,
                191
            ],
            [
                358,
                372
            ],
            [
                381,
                383
            ],
            [
                394,
                452
            ],
            [
                523,
                525
            ],
            [
                464,
                471
            ],
            [
                478,
                481
            ],
            [
                542,
                544
            ],
            [
                547,
                553
            ],
            [
                571,
                586
            ],
            [
                591,
                595
            ],
            [
                529,
                530
            ],
            [
                600,
                622
            ],
            [
                626,
                643
            ],
            [
                647,
                662
            ],
            [
                666,
                709
            ],
            [
                712,
                737
            ],
            [
                739,
                757
            ],
            [
                761,
                779
            ],
            [
                783,
                825
            ],
            [
                1067,
                1069
            ],
            [
                832,
                858
            ],
            [
                860,
                864
            ],
            [
                866,
                887
            ],
            [
                893,
                912
            ],
            [
                918,
                965
            ],
            [
                977,
                1010
            ],
            [
                1069,
                1218
            ],
            [
                1231,
                1246
            ],
            [
                1248,
                1252
            ],
            [
                1261,
                1341
            ],
            [
                1348,
                1388
            ],
            [
                1399,
                1402
            ],
            [
                1406,
                1418
            ],
            [
                1391,
                1397
            ],
            [
                1423,
                1438
            ],
            [
                1442,
                1448
            ],
            [
                1456,
                1465
            ],
            [
                1470,
                1518
            ],
            [
                1546,
                1555
            ],
            [
                1556,
                1558
            ],
            [
                1590,
                1626
            ],
            [
                1628,
                1644
            ],
            [
                1565,
                1566
            ],
            [
                1660,
                1664
            ],
            [
                1674,
                1675
            ],
            [
                1680,
                1682
            ],
            [
                1689,
                1693
            ],
            [
                1701,
                1705
            ],
            [
                1707,
                1722
            ],
            [
                1728,
                1741
            ],
            [
                1749,
                1755
            ],
            [
                1780,
                1792
            ],
            [
                1794,
                1863
            ],
            [
                1957,
                1958
            ],
            [
                1963,
                1987
            ],
            [
                1997,
                2019
            ],
            [
                2022,
                2070
            ],
            [
                2070,
                2094
            ],
            [
                2105,
                2127
            ],
            [
                2190,
                2204
            ],
            [
                2217,
                2219
            ],
            [
                2234,
                2236
            ],
            [
                2224,
                2233
            ],
            [
                2237,
                2244
            ],
            [
                2252,
                2278
            ],
            [
                2296,
                2313
            ],
            [
                2318,
                2325
            ],
            [
                2314,
                2317
            ],
            [
                2326,
                2342
            ],
            [
                2348,
                2354
            ],
            [
                2358,
                2373
            ],
            [
                2381,
                2403
            ],
            [
                2419,
                2435
            ],
            [
                2437,
                2460
            ],
            [
                2486,
                2487
            ],
            [
                2463,
                2486
            ],
            [
                2504,
                2531
            ],
            [
                2535,
                2549
            ],
            [
                2551,
                2558
            ],
            [
                2560,
                2563
            ],
            [
                2565,
                2575
            ],
            [
                2577,
                2582
            ],
            [
                2584,
                2586
            ],
            [
                2502,
                2503
            ],
            [
                2588,
                2614
            ],
            [
                2621,
                2665
            ],
            [
                2679,
                2727
            ],
            [
                2731,
                2757
            ],
            [
                2761,
                2789
            ],
            [
                2789,
                2810
            ],
            [
                2816,
                2839
            ],
            [
                2846,
                2858
            ],
            [
                2862,
                2881
            ],
            [
                2883,
                2886
            ],
            [
                2888,
                2895
            ],
            [
                2905,
                2915
            ],
            [
                2900,
                2904
            ],
            [
                2915,
                2917
            ],
            [
                2917,
                2923
            ],
            [
                2929,
                2939
            ],
            [
                2945,
                2972
            ],
            [
                2974,
                2982
            ],
            [
                2988,
                2996
            ],
            [
                2998,
                3002
            ],
            [
                3004,
                3013
            ],
            [
                3048,
                3078
            ],
            [
                3137,
                3153
            ],
            [
                3189,
                3224
            ],
            [
                3231,
                3261
            ],
            [
                3267,
                3280
            ],
            [
                3284,
                3285
            ],
            [
                3280,
                3283
            ],
            [
                3290,
                3296
            ],
            [
                3298,
                3304
            ],
            [
                3311,
                3333
            ],
            [
                3409,
                3461
            ],
            [
                3463,
                3481
            ],
            [
                3501,
                3545
            ],
            [
                3557,
                3583
            ],
            [
                3592,
                3605
            ],
            [
                3615,
                3617
            ],
            [
                3618,
                3630
            ],
            [
                3634,
                3702
            ],
            [
                3585,
                3586
            ],
            [
                3746,
                3762
            ],
            [
                3764,
                3778
            ],
            [
                3388,
                3392
            ],
            [
                3784,
                3795
            ],
            [
                3808,
                3922
            ],
            [
                3922,
                3945
            ],
            [
                4010,
                4030
            ],
            [
                3977,
                3990
            ],
            [
                4035,
                4124
            ],
            [
                4164,
                4172
            ],
            [
                4181,
                4193
            ],
            [
                4173,
                4180
            ],
            [
                4194,
                4214
            ]
        ],
        "row_chars": [
            [
                0,
                170
            ],
            [
                170,
                381
            ],
            [
                381,
                1069
            ],
            [
                1069,
                1676
            ],
            [
                1676,
                1963
            ],
            [
                1963,
                2070
            ],
            [
                2070,
                2244
            ],
            [
                2244,
                2290
            ],
            [
                2290,
                2789
            ],
            [
                2789,
                2917
            ],
            [
                2917,
                2939
            ],
            [
                2939,
                2996
            ],
            [
                2996,
                3280
            ],
            [
                3280,
                3922
            ],
            [
                3922,
                4215
            ],
            [
                4215,
                4268
            ],
            [
                4268,
                4319
            ],
            [
                4319,
                4381
            ],
            [
                4381,
                4391
            ],
            [
                4391,
                4517
            ],
            [
                4517,
                4529
            ],
            [
                4529,
                4620
            ],
            [
                4620,
                4651
            ],
            [
                4651,
                4675
            ],
            [
                4675,
                4681
            ],
            [
                4681,
                4703
            ],
            [
                4703,
                4712
            ],
            [
                4712,
                4958
            ],
            [
                4958,
                5244
            ],
            [
                5244,
                5250
            ],
            [
                5250,
                5259
            ],
            [
                5259,
                5313
            ],
            [
                5313,
                5319
            ],
            [
                5319,
                5327
            ],
            [
                5327,
                5361
            ],
            [
                5361,
                5383
            ]
        ]
    },
    "abridged": {
        "text": "From this moment I am to be considered as heir-apparent to the Shandy family - and it is from this point properly that the story of my Life and my Opinions begins. With all my hurry, I have merely been clearing the ground to raise the building - and such a building do I foresee it will turn out, as never was planned and executed since Adam.\nIn five minutes I shall have thrown my pen into the fire, and my last drop of ink with it. I have ten things to do in that time - I have a thing to name - a thing to lament - a thing to hope - a thing to promise, and a thing to threaten - I have a thing to suppose - a thing to declare - a thing to conceal - a thing to choose, and a thing to pray for.\nThis chapter, therefore, I name the chapter of Things - and my next chapter, that is, the first chapter of my next volume, shall be my chapter upon Whiskers.\nThe thing I lament is, that things have crowded in so thick upon me, that I have not been able to get into that part of my work, towards which I have always looked forwards with earnest desire; and that is the Campaigns, but especially the amours of my uncle Toby, the events of which are of so singular and Cervantick a nature, that if I can manage to convey the same impressions to every other brain, which they excite in mine - my book shall make its way in the world much better than I have done.\nOh Tristram! Tristram! can this but be brought about - thy credit as an author shall counterbalance the many evils which have befallen thee as a man!\nNo wonder I itch so much to get at these amours. - They are the choicest morsel of my whole story! and when I do get at 'em - assure yourselves, good folks, I shall not be dainty in my choice of words! - that's the thing I have to declare.\nI shall never get through them all in five minutes, I fear - and the thing I hope is, that your worships are not offended - if you are, depend upon it, I'll give you something next year to be offended at - that's my dear Jenny's way - but who my Jenny is, and which is the right and the wrong end of a woman, is the thing to be concealed - it shall be told you in the next chapter but one after my chapter of Button-holes - and not one chapter before.\nAnd now that you have got to the end of these four volumes - the thing I have to ask is, how do your heads feel? My own aches dismally! As for your healths, I know they are better. True Shandeism opens the heart and lungs, and forces the blood to run freely through its channels, making the wheel of life run long and cheerfully round.\nIf I was allowed, like Sancho Panza, to choose my kingdom, it should be a kingdom of hearty laughing subjects. And as the bilious passions, by creating disorders in the blood, have as bad an influence upon the body politic as the body natural - and as nothing but a habit of virtue can fully govern those passions - I would add to my prayer that God would make my subjects as Wise as they were Merry; and then should I be the happiest monarch, and they the happiest people under heaven.\nAnd so, with this moral, I take my leave of your worships till this time twelve-month, when, (unless this vile cough kills me in the meantime) I'll lay open to the world a story you little dream of.",
        "paragraph_chars": [
            [
                0,
                343
            ],
            [
                343,
                696
            ],
            [
                696,
                854
            ],
            [
                854,
                1355
            ],
            [
                1355,
                1505
            ],
            [
                1505,
                1745
            ],
            [
                1745,
                2197
            ],
            [
                2197,
                2533
            ],
            [
                2533,
                3020
            ],
            [
                3020,
                3218
            ]
        ],
        "segment_chars": [
            [
                0,
                164
            ],
            [
                164,
                343
            ],
            [
                343,
                434
            ],
            [
                434,
                696
            ],
            [
                696,
                854
            ],
            [
                854,
                1355
            ],
            [
                1355,
                1368
            ],
            [
                1368,
                1378
            ],
            [
                1378,
                1505
            ],
            [
                1505,
                1554
            ],
            [
                1554,
                1604
            ],
            [
                1604,
                1707
            ],
            [
                1707,
                1745
            ],
            [
                1745,
                2197
            ],
            [
                2197,
                2310
            ],
            [
                2310,
                2333
            ],
            [
                2333,
                2378
            ],
            [
                2378,
                2533
            ],
            [
                2533,
                2644
            ],
            [
                2644,
                3020
            ],
            [
                3020,
                3218
            ]
        ],
        "overlap_chars": [
            [
                0,
                62
            ],
            [
                63,
                69
            ],
            [
                70,
                76
            ],
            [
                79,
                113
            ],
            [
                114,
                155
            ],
            [
                162,
                164
            ],
            [
                164,
                181
            ],
            [
                181,
                189
            ],
            [
                197,
                243
            ],
            [
                246,
                317
            ],
            [
                318,
                321
            ],
            [
                322,
                336
            ],
            [
                343,
                345
            ],
            [
                346,
                404
            ],
            [
                405,
                407
            ],
            [
                413,
                420
            ],
            [
                421,
                424
            ],
            [
                430,
                432
            ],
            [
                434,
                440
            ],
            [
                445,
                460
            ],
            [
                466,
                470
            ],
            [
                471,
                472
            ],
            [
                473,
                495
            ],
            [
                498,
                515
            ],
            [
                518,
                533
            ],
            [
                536,
                579
            ],
            [
                582,
                607
            ],
            [
                610,
                628
            ],
            [
                631,
                649
            ],
            [
                652,
                694
            ],
            [
                694,
                696
            ],
            [
                696,
                722
            ],
            [
                723,
                727
            ],
            [
                728,
                749
            ],
            [
                752,
                771
            ],
            [
                771,
                818
            ],
            [
                819,
                852
            ],
            [
                854,
                1003
            ],
            [
                1011,
                1026
            ],
            [
                1027,
                1031
            ],
            [
                1032,
                1112
            ],
            [
                1117,
                1157
            ],
            [
                1158,
                1161
            ],
            [
                1162,
                1174
            ],
            [
                1175,
                1181
            ],
            [
                1181,
                1196
            ],
            [
                1197,
                1203
            ],
            [
                1204,
                1213
            ],
            [
                1214,
                1262
            ],
            [
                1268,
                1277
            ],
            [
                1285,
                1287
            ],
            [
                1288,
                1324
            ],
            [
                1325,
                1341
            ],
            [
                1342,
                1343
            ],
            [
                1349,
                1353
            ],
            [
                1353,
                1354
            ],
            [
                1355,
                1357
            ],
            [
                1363,
                1367
            ],
            [
                1373,
                1377
            ],
            [
                1378,
                1393
            ],
            [
                1394,
                1407
            ],
            [
                1414,
                1420
            ],
            [
                1421,
                1433
            ],
            [
                1434,
                1503
            ],
            [
                1503,
                1504
            ],
            [
                1505,
                1529
            ],
            [
                1530,
                1552
            ],
            [
                1556,
                1604
            ],
            [
                1604,
                1628
            ],
            [
                1638,
                1660
            ],
            [
                1662,
                1676
            ],
            [
                1684,
                1686
            ],
            [
                1687,
                1689
            ],
            [
                1690,
                1699
            ],
            [
                1700,
                1707
            ],
            [
                1709,
                1735
            ],
            [
                1745,
                1762
            ],
            [
                1763,
                1770
            ],
            [
                1776,
                1779
            ],
            [
                1780,
                1796
            ],
            [
                1797,
                1803
            ],
            [
                1806,
                1821
            ],
            [
                1827,
                1849
            ],
            [
                1850,
                1866
            ],
            [
                1869,
                1892
            ],
            [
                1895,
                1896
            ],
            [
                1897,
                1920
            ],
            [
                1921,
                1948
            ],
            [
                1951,
                1965
            ],
            [
                1966,
                1973
            ],
            [
                1974,
                1977
            ],
            [
                1980,
                1990
            ],
            [
                1991,
                1996
            ],
            [
                1997,
                1999
            ],
            [
                1999,
                2000
            ],
            [
                2001,
                2027
            ],
            [
                2028,
                2072
            ],
            [
                2085,
                2133
            ],
            [
                2140,
                2166
            ],
            [
                2169,
                2197
            ],
            [
                2197,
                2218
            ],
            [
                2219,
                2242
            ],
            [
                2243,
                2255
            ],
            [
                2258,
                2277
            ],
            [
                2278,
                2281
            ],
            [
                2282,
                2289
            ],
            [
                2293,
                2303
            ],
            [
                2304,
                2308
            ],
            [
                2308,
                2310
            ],
            [
                2310,
                2316
            ],
            [
                2323,
                2333
            ],
            [
                2333,
                2360
            ],
            [
                2361,
                2369
            ],
            [
                2370,
                2378
            ],
            [
                2378,
                2382
            ],
            [
                2383,
                2392
            ],
            [
                2393,
                2423
            ],
            [
                2424,
                2440
            ],
            [
                2441,
                2476
            ],
            [
                2484,
                2514
            ],
            [
                2520,
                2533
            ],
            [
                2536,
                2537
            ],
            [
                2538,
                2541
            ],
            [
                2549,
                2555
            ],
            [
                2556,
                2562
            ],
            [
                2568,
                2590
            ],
            [
                2590,
                2642
            ],
            [
                2644,
                2662
            ],
            [
                2663,
                2707
            ],
            [
                2707,
                2733
            ],
            [
                2734,
                2747
            ],
            [
                2756,
                2758
            ],
            [
                2763,
                2775
            ],
            [
                2778,
                2846
            ],
            [
                2849,
                2850
            ],
            [
                2857,
                2873
            ],
            [
                2874,
                2888
            ],
            [
                2889,
                2893
            ],
            [
                2894,
                2905
            ],
            [
                2906,
                3020
            ],
            [
                3020,
                3043
            ],
            [
                3043,
                3063
            ],
            [
                3064,
                3077
            ],
            [
                3078,
                3167
            ],
            [
                3168,
                3176
            ],
            [
                3177,
                3189
            ],
            [
                3190,
                3197
            ],
            [
                3198,
                3218
            ]
        ],
        "row_chars": [
            [
                0,
                164
            ],
            [
                164,
                343
            ],
            [
                343,
                854
            ],
            [
                854,
                1355
            ],
            [
                1355,
                1505
            ],
            [
                1505,
                1604
            ],
            [
                1604,
                1707
            ],
            [
                1707,
                1745
            ],
            [
                1745,
                2197
            ],
            [
                2197,
                2310
            ],
            [
                2310,
                2333
            ],
            [
                2333,
                2378
            ],
            [
                2378,
                2533
            ],
            [
                2533,
                3020
            ],
            [
                3020,
                3218
            ],
            [
                3218,
                3218
            ],
            [
                3218,
                3218
            ],
            [
                3218,
                3218
            ],
            [
                3218,
                3218
            ],
            [
                3218,
                3218
            ],
            [
                3218,
                3218
            ],
            [
                3218,
                3218
            ],
            [
                3218,
                3218
            ],
            [
                3218,
                3218
            ],
            [
                3218,
                3218
            ],
            [
                3218,
                3218
            ],
            [
                3218,
                3218
            ],
            [
                3218,
                3218
            ],
            [
                3218,
                3218
            ],
            [
                3218,
                3218
            ],
            [
                3218,
                3218
            ],
            [
                3218,
                3218
            ],
            [
                3218,
                3218
            ],
            [
                3218,
                3218
            ],
            [
                3218,
                3218
            ],
            [
                3218,
                3218
            ]
        ]
    }
}