{
    "original": {
        "text": "I am a _Turk_ if I had not as much forgot my mother, as if Nature had plaistered me up, and set me down naked upon the banks of the river _Nile_, without one. ----Your most obedient servant, Madam --I've cost you a great deal of trouble, --I wish it may answer; --but you have left a crack in my back, --and here's a great piece fallen off here before, --and what must I do with this foot? ----I shall never reach _England_ with it.\nFor my own part, I never wonder at any thing; --and so often has my judgment deceived me in my life, that I always suspect it, right or wrong, --at least I am seldom hot upon cold subjects. For all this, I reverence truth as much as any body; and when it has slipped us, if a man will but take me by the hand, and go quietly and search for it, as for a thing we have both lost, and can neither of us do well without, --I'll go to the world's end with him: ----But I hate disputes, --and therefore (bating religious points, or such as touch society) I would almost subscribe to any thing which does not choak me in the first passage, rather than be drawn into one. ----But I cannot bear suffocation, ----and bad smells worst of all. ----For which reasons, I resolved from the beginning, That if ever the army of martyrs was to be augmented, --or a new one raised, --I would have no hand in it, one way or t'other.",
        "paragraph_chars": [
            [
                0,
                433
            ],
            [
                433,
                1345
            ]
        ],
        "segment_chars": [
            [
                0,
                159
            ],
            [
                159,
                390
            ],
            [
                390,
                433
            ],
            [
                433,
                623
            ],
            [
                623,
                1097
            ],
            [
                1097,
                1165
            ],
            [
                1165,
                1345
            ]
        ],
        "overlap_chars": [
            [
                0,
                6
            ],
            [
                8,
                12
            ],
            [
                14,
                26
            ],
            [
                35,
                51
            ],
            [
                450,
                451
            ],
            [
                458,
                467
            ],
            [
                477,
                478
            ],
            [
                485,
                521
            ],
            [
                532,
                574
            ],
            [
                621,
                622
            ],
            [
                623,
                638
            ],
            [
                649,
                665
            ],
            [
                674,
                699
            ],
            [
                700,
                757
            ],
            [
                1007,
                1009
            ],
            [
                762,
                810
            ],
            [
                852,
                887
            ],
            [
                893,
                913
            ],
            [
                916,
                931
            ],
            [
                938,
                958
            ],
            [
                973,
                996
            ],
            [
                1026,
                1034
            ],
            [
                1041,
                1043
            ],
            [
                1064,
                1096
            ],
            [
                1105,
                1130
            ],
            [
                1136,
                1165
            ],
            [
                1169,
                1189
            ],
            [
                1190,
                1198
            ],
            [
                1219,
                1261
            ],
            [
                1217,
                1218
            ],
            [
                1298,
                1345
            ]
        ],
        "row_chars": [
            [
                0,
                159
            ],
            [
                159,
                390
            ],
            [
                390,
                433
            ],
            [
                433,
                623
            ],
            [
                623,
                1097
            ],
            [
                1097,
                1165
            ],
            [
                1165,
                1345
            ]
        ]
    },
    "abridged": {
        "text": "I am a Turk if I had not forgot my mother! I don't wonder at it; so often has my judgment deceived me, that I always suspect it, right or wrong.\nFor all this, I respect truth as much as anybody; and when it has slipped away from us, if a man will but take me by the hand, and go quietly to search for it, as for a thing we have both lost, I'll go to the world's end with him.\nBut I hate disputes, and therefore (apart from religious points, or those concerning society) I would almost agree to anything that does not choke me, rather than be drawn into one.\nYet I cannot bear suffocation - and bad smells worst of all. For which reasons, I have resolved that if ever the army of martyrs was to be increased, I would have no hand in it, one way or t'other.",
        "paragraph_chars": [
            [
                0,
                145
            ],
            [
                145,
                376
            ],
            [
                376,
                558
            ],
            [
                558,
                755
            ]
        ],
        "segment_chars": [
            [
                0,
                43
            ],
            [
                43,
                145
            ],
            [
                145,
                376
            ],
            [
                376,
                558
            ],
            [
                558,
                619
            ],
            [
                619,
                755
            ]
        ],
        "overlap_chars": [
            [
                0,
                6
            ],
            [
                7,
                11
            ],
            [
                12,
                24
            ],
            [
                25,
                41
            ],
            [
                43,
                44
            ],
            [
                51,
                60
            ],
            [
                63,
                64
            ],
            [
                65,
                101
            ],
            [
                101,
                143
            ],
            [
                143,
                144
            ],
            [
                145,
                160
            ],
            [
                169,
                185
            ],
            [
                193,
                218
            ],
            [
                229,
                286
            ],
            [
                287,
                289
            ],
            [
                290,
                338
            ],
            [
                339,
                374
            ],
            [
                376,
                396
            ],
            [
                397,
                412
            ],
            [
                423,
                443
            ],
            [
                461,
                484
            ],
            [
                508,
                516
            ],
            [
                523,
                525
            ],
            [
                525,
                557
            ],
            [
                562,
                587
            ],
            [
                590,
                619
            ],
            [
                619,
                639
            ],
            [
                645,
                653
            ],
            [
                654,
                696
            ],
            [
                706,
                707
            ],
            [
                708,
                755
            ]
        ],
        "row_chars": [
            [
                0,
                43
            ],
            [
                43,
                43
            ],
            [
                43,
                43
            ],
            [
                43,
                145
            ],
            [
                145,
                558
            ],
            [
                558,
                619
            ],
            [
                619,
                755
            ]
        ]
    }
}