{
    "original": {
        "text": "The article in my mother's marriage-settlement, which I told the reader I was at the pains to search for, and which, now that I have found it, I think proper to lay before him, --is so much more fully express'd in the deed itself, than ever I can pretend to do it, that it would be barbarity to take it out of the lawyer's hand: --It is as follows.\n\"#And this Indenture further witnesseth#, That the said _Walter Shandy_, merchant, in consideration of the said intended marriage to be had, and, by God's blessing, to be well and truly solemnised and consummated between the said _Walter Shandy_ and _Elizabeth Mollineux_ aforesaid, and divers other good and valuable causes and considerations him thereunto specially moving, --doth grant, covenant, condescend, consent, conclude, bargain, and fully agree to and with _John Dixon_, and _James Turner_, Esqrs. the above-named Trustees, _&c. &c._--#to Wit#, --That in case it should hereafter so fall out, chance, happen, or otherwise come to pass, --That the said _Walter Shandy_, merchant, shall have left off business before the time or times, that the said _Elizabeth Mollineux_ shall, according to the course of nature, or otherwise, have left off bearing and bringing forth children; --and that, in consequence of the said _Walter Shandy_ having so left off business, he shall in despight, and against the free-will, consent, and good-liking of the said _Elizabeth Mollineux_, --make a departure from the city of _London_, in order to retire to, and dwell upon, his estate at _Shandy Hall_, in the county of ----, or at any other country-seat, castle, hall, mansion-house, messuage or grainge-house, now purchased, or hereafter to be purchased, or upon any part or parcel thereof: --That then, and as often as the said _Elizabeth Mollineux_ shall happen to be enceint with child or children severally and lawfully begot, or to be begotten, upon the body of the said _Elizabeth Mollineux_, during her said coverture, --he the said _Walter Shandy_ shall, at his own proper cost and charges, and out of his own proper monies, upon good and reasonable notice, which is hereby agreed to be within six weeks of her the said _Elizabeth Mollineux's_ full reckoning, or time of supposed and computed delivery, --pay, or cause to be paid, the sum of one hundred and twenty pounds of good and lawful money, to _John Dixon_, and _James Turner_, Esqrs. or assigns, --upon TRUST and confidence, and for and unto the use and uses, intent, end, and purpose following: --#That is to say#, --That the said sum of one hundred and twenty pounds shall be paid into the hands of the said _Elizabeth Mollineux_, or to be otherwise applied by them the said Trustees, for the well and truly hiring of one coach, with able and sufficient horses, to carry and convey the body of the said _Elizabeth Mollineux_, and the child or children which she shall be then and there enceint and pregnant with, --unto the city of _London_; and for the further paying and defraying of all other incidental costs, charges, and expences whatsoever, --in and about, and for, and relating to, her said intended delivery and lying-in, in the said city or suburbs thereof. And that the said _Elizabeth Mollineux_ shall and may, from time to time, and at all such time and times as are here covenanted and agreed upon, --peaceably and quietly hire the said coach and horses, and have free ingress, egress, and regress throughout her journey, in and from the said coach, according to the tenor, true intent, and meaning of these presents, without any let, suit, trouble, disturbance, molestation, discharge, hindrance, forfeiture, eviction, vexation, interruption, or incumbrance whatsoever. --And that it shall moreover be lawful to and for the said _Elizabeth Mollineux_, from time to time, and as oft or often as she shall well and truly be advanced in her said pregnancy, to the time heretofore stipulated and agreed upon, --to live and reside in such place or places, and in such family or families, and with such relations, friends, and other persons within the said city of _London_, as she at her own will and pleasure, notwithstanding her present coverture, and as if she was a _femme sole_ and unmarried, --shall think fit. --#And this Indenture further Witnesseth#, That for the more effectually carrying of the said covenant into execution, the said _Walter Shandy_, merchant, doth hereby grant, bargain, sell, release, and confirm unto the said _John Dixon_, and _James Turner_, Esqrs. their heirs, executors, and assigns, in their actual possession now being, by virtue of an indenture of bargain and sale for a year to them the said _John Dickson_, and _James Turner_, Esqrs. by him the said _Walter Shandy_, merchant, thereof made; which said bargain and sale for a year, bears date the day next before the date of these presents, and by force and virtue of the statute for transferring of uses into possession, --#All# that the manor and lordship of _Shandy_, in the county of ----, with all the rights, members, and appurtenances thereof; and all and every the messuages, houses, buildings, barns, stables, orchards, gardens, backsides, tofts, crofts, garths, cottages, lands, meadows, feedings, pastures, marshes, commons, woods, underwoods, drains, fisheries, waters, and water-courses; --together with all rents, reversions, services, annuities, fee-farms, knights fees, views of frankpledge, escheats, reliefs, mines, quarries, goods and chattels of felons and fugitives, felons of themselves, and put in exigent, deodands, free warrens, and all other royalties and seigniories, rights and jurisdictions, privileges and hereditaments whatsoever. ----#And also# the advowson, donation, presentation, and free disposition of the rectory or parsonage of _Shandy_ aforesaid, and all and every the tenths, tythes, glebe-lands.\" ----In three words, ----\"My mother was to lay in, (if she chose it) in _London_.\"\nBut in order to put a stop to the practice of any unfair play on the part of my mother, which a marriage-article of this nature too manifestly opened a door to, and which indeed had never been thought of at all, but for my uncle _Toby Shandy_; --a clause was added in security of my father, which was this: --\"That in case my mother hereafter should, at any time, put my father to the trouble and expence of a _London_ journey, upon false cries and tokens; ----that for every such instance, she should forfeit all the right and title which the covenant gave her to the next turn; ----but to no more, --and so on, _toties quoties_, in as effectual a manner, as if such a covenant betwixt them had not been made.\" --This, by the way, was no more than what was reasonable; --and yet, as reasonable as it was, I have ever thought it hard that the whole weight of the article should have fallen entirely, as it did, upon myself.\nBut I was begot and born to misfortunes: --for my poor mother, whether it was wind or water--or a compound of both, --or neither; --or whether it was simply the mere swell of imagination and fancy in her; --or how far a strong wish and desire to have it so, might mislead her judgment: --in short, whether she was deceived or deceiving in this matter, it no way becomes me to decide. The fact was this, That in the latter end of _September_ 1717, which was the year before I was born, my mother having carried my father up to town much against the grain, --he peremptorily insisted upon the clause; --so that I was doom'd, by marriage-articles, to have my nose squeez'd as flat to my face, as if the destinies had actually spun me without one.\nHow this event came about, --and what a train of vexatious disappointments, in one stage or other of my life, have pursued me from the mere loss, or rather compression, of this one single member, --shall be laid before the reader all in due time.",
        "paragraph_chars": [
            [
                0,
                349
            ],
            [
                349,
                5931
            ],
            [
                5931,
                6855
            ],
            [
                6855,
                7599
            ],
            [
                7599,
                7845
            ]
        ],
        "segment_chars": [
            [
                0,
                349
            ],
            [
                349,
                858
            ],
            [
                858,
                889
            ],
            [
                889,
                2393
            ],
            [
                2393,
                3179
            ],
            [
                3179,
                3696
            ],
            [
                3696,
                4238
            ],
            [
                4238,
                4503
            ],
            [
                4503,
                4695
            ],
            [
                4695,
                5672
            ],
            [
                5672,
                5849
            ],
            [
                5849,
                5931
            ],
            [
                5931,
                6643
            ],
            [
                6643,
                6855
            ],
            [
                6855,
                7239
            ],
            [
                7239,
                7599
            ],
            [
                7599,
                7845
            ]
        ],
        "overlap_chars": [
            [
                0,
                80
            ],
            [
                85,
                105
            ],
            [
                179,
                200
            ],
            [
                231,
                235
            ],
            [
                126,
                127
            ],
            [
                258,
                294
            ],
            [
                139,
                141
            ],
            [
                331,
                349
            ],
            [
                351,
                388
            ],
            [
                389,
                404
            ],
            [
                406,
                419
            ],
            [
                420,
                493
            ],
            [
                514,
                578
            ],
            [
                580,
                593
            ],
            [
                595,
                598
            ],
            [
                600,
                619
            ],
            [
                621,
                631
            ],
            [
                727,
                816
            ],
            [
                818,
                828
            ],
            [
                829,
                834
            ],
            [
                836,
                848
            ],
            [
                849,
                858
            ],
            [
                858,
                882
            ],
            [
                887,
                889
            ],
            [
                1387,
                1388
            ],
            [
                896,
                902
            ],
            [
                903,
                904
            ],
            [
                907,
                995
            ],
            [
                998,
                1011
            ],
            [
                1013,
                1026
            ],
            [
                1027,
                1083
            ],
            [
                1094,
                1107
            ],
            [
                1109,
                1128
            ],
            [
                1130,
                1170
            ],
            [
                1184,
                1236
            ],
            [
                1239,
                1275
            ],
            [
                1277,
                1290
            ],
            [
                1292,
                1332
            ],
            [
                1343,
                1382
            ],
            [
                1395,
                1406
            ],
            [
                1408,
                1427
            ],
            [
                1092,
                1093
            ],
            [
                1432,
                1465
            ],
            [
                1467,
                1473
            ],
            [
                1474,
                1528
            ],
            [
                1530,
                1541
            ],
            [
                1565,
                1618
            ],
            [
                1084,
                1086
            ],
            [
                1645,
                1733
            ],
            [
                1736,
                1771
            ],
            [
                1773,
                1792
            ],
            [
                1794,
                1820
            ],
            [
                1172,
                1174
            ],
            [
                2909,
                2917
            ],
            [
                1821,
                1843
            ],
            [
                1858,
                1918
            ],
            [
                1920,
                1939
            ],
            [
                1940,
                1957
            ],
            [
                1170,
                1171
            ],
            [
                1971,
                1982
            ],
            [
                1984,
                1997
            ],
            [
                1999,
                2040
            ],
            [
                2074,
                2157
            ],
            [
                2162,
                2170
            ],
            [
                2172,
                2193
            ],
            [
                2195,
                2230
            ],
            [
                2244,
                2253
            ],
            [
                1618,
                1619
            ],
            [
                2256,
                2322
            ],
            [
                2438,
                2504
            ],
            [
                2508,
                2522
            ],
            [
                1341,
                1342
            ],
            [
                2527,
                2618
            ],
            [
                2620,
                2639
            ],
            [
                2694,
                2739
            ],
            [
                2773,
                2813
            ],
            [
                2815,
                2834
            ],
            [
                2835,
                2862
            ],
            [
                2740,
                2744
            ],
            [
                2863,
                2878
            ],
            [
                2882,
                2886
            ],
            [
                2648,
                2650
            ],
            [
                1428,
                1429
            ],
            [
                2931,
                2942
            ],
            [
                2944,
                2950
            ],
            [
                2951,
                3037
            ],
            [
                1542,
                1543
            ],
            [
                3061,
                3082
            ],
            [
                3084,
                3179
            ],
            [
                3179,
                3196
            ],
            [
                3198,
                3217
            ],
            [
                3219,
                3232
            ],
            [
                3348,
                3473
            ],
            [
                3541,
                3696
            ],
            [
                3698,
                3734
            ],
            [
                3742,
                3754
            ],
            [
                3756,
                3775
            ],
            [
                3776,
                3777
            ],
            [
                3820,
                3882
            ],
            [
                3936,
                3975
            ],
            [
                4007,
                4084
            ],
            [
                4086,
                4092
            ],
            [
                4093,
                4130
            ],
            [
                4221,
                4236
            ],
            [
                5853,
                5868
            ],
            [
                5874,
                5912
            ],
            [
                5915,
                5919
            ],
            [
                5921,
                5927
            ],
            [
                5931,
                5960
            ],
            [
                5977,
                5995
            ],
            [
                6008,
                6017
            ],
            [
                6000,
                6004
            ],
            [
                6017,
                6058
            ],
            [
                6074,
                6090
            ],
            [
                6092,
                6108
            ],
            [
                6627,
                6630
            ],
            [
                6119,
                6134
            ],
            [
                6141,
                6159
            ],
            [
                6493,
                6495
            ],
            [
                6166,
                6172
            ],
            [
                5961,
                5964
            ],
            [
                6179,
                6195
            ],
            [
                6236,
                6237
            ],
            [
                6246,
                6263
            ],
            [
                6274,
                6327
            ],
            [
                6336,
                6340
            ],
            [
                6342,
                6348
            ],
            [
                6350,
                6387
            ],
            [
                6397,
                6448
            ],
            [
                6465,
                6492
            ],
            [
                6540,
                6542
            ],
            [
                6496,
                6504
            ],
            [
                6594,
                6598
            ],
            [
                6645,
                6649
            ],
            [
                6663,
                6666
            ],
            [
                6689,
                6700
            ],
            [
                6703,
                6711
            ],
            [
                6737,
                6743
            ],
            [
                6749,
                6855
            ],
            [
                6855,
                6864
            ],
            [
                6875,
                6895
            ],
            [
                6898,
                6946
            ],
            [
                6969,
                6970
            ],
            [
                6948,
                6950
            ],
            [
                7005,
                7015
            ],
            [
                7021,
                7041
            ],
            [
                7052,
                7059
            ],
            [
                7062,
                7081
            ],
            [
                7091,
                7100
            ],
            [
                7113,
                7140
            ],
            [
                7143,
                7206
            ],
            [
                7225,
                7238
            ],
            [
                7239,
                7256
            ],
            [
                7258,
                7265
            ],
            [
                7285,
                7294
            ],
            [
                7296,
                7301
            ],
            [
                7312,
                7349
            ],
            [
                7357,
                7408
            ],
            [
                7256,
                7257
            ],
            [
                7412,
                7414
            ],
            [
                7428,
                7445
            ],
            [
                7446,
                7453
            ],
            [
                7456,
                7469
            ],
            [
                7476,
                7515
            ],
            [
                7528,
                7543
            ],
            [
                7597,
                7599
            ],
            [
                7599,
                7625
            ],
            [
                7628,
                7647
            ],
            [
                7658,
                7673
            ],
            [
                7714,
                7724
            ],
            [
                7700,
                7707
            ],
            [
                7725,
                7733
            ],
            [
                7755,
                7766
            ],
            [
                7768,
                7775
            ],
            [
                7780,
                7794
            ],
            [
                7797,
                7845
            ]
        ],
        "row_chars": [
            [
                0,
                349
            ],
            [
                349,
                858
            ],
            [
                858,
                889
            ],
            [
                889,
                3179
            ],
            [
                3179,
                3696
            ],
            [
                3696,
                4238
            ],
            [
                4238,
                4503
            ],
            [
                4503,
                4695
            ],
            [
                4695,
                5672
            ],
            [
                5672,
                5849
            ],
            [
                5849,
                5931
            ],
            [
                5931,
                6643
            ],
            [
                6643,
                6855
            ],
            [
                6855,
                7239
            ],
            [
                7239,
                7599
            ],
            [
                7599,
                7845
            ]
        ]
    },
    "abridged": {
        "text": "The article in my mother's marriage-settlement, which I told the reader I was at pains to search for, is so much more fully expressed than I could do it, that it would be barbarity to paraphrase it. - It is as follows.\n'And this Indenture further witnesseth, That the said Walter Shandy, merchant, in consideration of the said intended marriage to be had, and to be well and truly solemnised and consummated between the said Walter Shandy and Elizabeth Mollineux aforesaid, doth grant, covenant, condescend, consent, conclude, bargain, and fully agree to and with John Dixon, and James Turner, Esqrs. the above-named Trustees. - To Wit, That in case it should hereafter so fall out, chance, happen, or otherwise come to pass, That the said Walter Shandy, merchant, shall have left off business before the time that the said Elizabeth Mollineux shall, according to the course of nature, have left off bearing and bringing forth children; and that, in consequence of the said Walter Shandy having so left off business, he shall in despite and against the free-will, consent, and agreement of the said Elizabeth Mollineux, make a departure from the city of London, in order to retire to, and dwell upon, his estate at Shandy Hall, or at any other country-seat, castle, hall, mansion or grange-house, now purchased, or hereafter to be purchased, or upon any part or parcel thereof: That then, and as often as the said Elizabeth Mollineux shall happen to be enceint or pregnant with child or children lawfully begot, or to be begotten, upon the body of the said Elizabeth Mollineux, during her said pregnancy, he the said Walter Shandy shall, at his own proper cost and charges, upon good and reasonable notice, which is hereby agreed to be within six weeks of the said Elizabeth Mollineux's full reckoning, or time of supposed delivery, - pay, or cause to be paid, the sum of one hundred and twenty pounds for and unto the use and uses, intent, end, and purpose following: That is to say, That the said sum of one hundred and twenty pounds shall be paid into the hands of the said Elizabeth Mollineux, for the well and truly hiring of one coach, to carry and convey the body of the said Elizabeth Mollineux, and the child or children with which she shall then be pregnant, unto the city of London; and for the further paying and defraying of all other incidental costs, charges, and expenses, in and about, and for and relating to, her said intended delivery and lying-in, in the said city or suburbs thereof. And that the said Elizabeth Mollineux shall and may hire the said coach and horses, and have free ingress, egress, and regress throughout her journey, in and from the said coach, without any let, suit, trouble, disturbance, molestation, discharge, hindrance, forfeiture, eviction, vexation, interruption, or incumbrance whatsoever. And that it shall moreover be lawful for the said Elizabeth Mollineux, when she shall well and truly be advanced in her said pregnancy, to live and reside in such place or places, and with such relations, friends, and other persons within the said city of London, as she at her own will and pleasure shall think fit.'\nIn three words, 'My mother was to lay in, (if she chose) in London.'\nBut in order to put a stop to any unfair play on my mother's part, which a marriage-article of this nature opened a door to - and which indeed would not have been thought of, but for my uncle Toby Shandy - the following clause was added:\n'That in case my mother should, at any time, put my father to the trouble and expense of a London journey, upon false cries and tokens; - for every such instance, she should forfeit all the rights which the covenant gave her on the next such occasion.'\nThis was only reasonable; - and yet, I have always thought it hard that the whole weight of the article should have fallen entirely, as it did, upon myself.\nBut I was born to misfortunes: for my poor mother, whether it was wind or water, or simply the swell of imagination in her; - or how far a strong desire to be with child might mislead her judgment: - in short, whether she was deceived or deceiving in this matter, is not for me to decide.\nThe fact was this: that in late September 1717, the year before I was born, my mother carried my father up to town much against the grain: when no child appeared, he insisted upon the extra clause; so that I was doomed, by marriage-articles, to have my nose squeezed flat to my face.\nHow this event came about, and what a train of disappointments has pursued me through my life from the compression of this single member, - shall be laid before the reader all in due time.",
        "paragraph_chars": [
            [
                0,
                219
            ],
            [
                219,
                3156
            ],
            [
                3156,
                3225
            ],
            [
                3225,
                3463
            ],
            [
                3463,
                3716
            ],
            [
                3716,
                3873
            ],
            [
                3873,
                4162
            ],
            [
                4162,
                4446
            ],
            [
                4446,
                4634
            ]
        ],
        "segment_chars": [
            [
                0,
                199
            ],
            [
                199,
                219
            ],
            [
                219,
                601
            ],
            [
                601,
                627
            ],
            [
                627,
                2506
            ],
            [
                2506,
                2838
            ],
            [
                2838,
                3156
            ],
            [
                3156,
                3225
            ],
            [
                3225,
                3463
            ],
            [
                3463,
                3716
            ],
            [
                3716,
                3873
            ],
            [
                3873,
                4162
            ],
            [
                4162,
                4446
            ],
            [
                4446,
                4634
            ]
        ],
        "overlap_chars": [
            [
                0,
                80
            ],
            [
                81,
                101
            ],
            [
                102,
                123
            ],
            [
                134,
                138
            ],
            [
                139,
                140
            ],
            [
                147,
                183
            ],
            [
                195,
                197
            ],
            [
                201,
                219
            ],
            [
                220,
                257
            ],
            [
                257,
                272
            ],
            [
                273,
                286
            ],
            [
                286,
                359
            ],
            [
                360,
                424
            ],
            [
                425,
                438
            ],
            [
                439,
                442
            ],
            [
                443,
                462
            ],
            [
                463,
                473
            ],
            [
                474,
                563
            ],
            [
                564,
                574
            ],
            [
                574,
                579
            ],
            [
                580,
                592
            ],
            [
                592,
                601
            ],
            [
                601,
                625
            ],
            [
                625,
                627
            ],
            [
                627,
                628
            ],
            [
                629,
                635
            ],
            [
                635,
                636
            ],
            [
                637,
                725
            ],
            [
                726,
                739
            ],
            [
                740,
                753
            ],
            [
                753,
                809
            ],
            [
                810,
                823
            ],
            [
                824,
                843
            ],
            [
                844,
                884
            ],
            [
                884,
                936
            ],
            [
                937,
                973
            ],
            [
                974,
                987
            ],
            [
                988,
                1028
            ],
            [
                1037,
                1076
            ],
            [
                1087,
                1098
            ],
            [
                1099,
                1118
            ],
            [
                1118,
                1119
            ],
            [
                1120,
                1153
            ],
            [
                1154,
                1160
            ],
            [
                1160,
                1214
            ],
            [
                1215,
                1226
            ],
            [
                1226,
                1279
            ],
            [
                1280,
                1282
            ],
            [
                1289,
                1377
            ],
            [
                1378,
                1413
            ],
            [
                1414,
                1433
            ],
            [
                1434,
                1460
            ],
            [
                1461,
                1463
            ],
            [
                1464,
                1472
            ],
            [
                1473,
                1495
            ],
            [
                1496,
                1556
            ],
            [
                1557,
                1576
            ],
            [
                1576,
                1593
            ],
            [
                1603,
                1604
            ],
            [
                1605,
                1616
            ],
            [
                1617,
                1630
            ],
            [
                1631,
                1672
            ],
            [
                1672,
                1755
            ],
            [
                1756,
                1764
            ],
            [
                1765,
                1786
            ],
            [
                1787,
                1822
            ],
            [
                1823,
                1832
            ],
            [
                1833,
                1834
            ],
            [
                1835,
                1901
            ],
            [
                1902,
                1968
            ],
            [
                1969,
                1983
            ],
            [
                1983,
                1984
            ],
            [
                1985,
                2076
            ],
            [
                2077,
                2096
            ],
            [
                2096,
                2141
            ],
            [
                2142,
                2182
            ],
            [
                2183,
                2202
            ],
            [
                2202,
                2229
            ],
            [
                2230,
                2234
            ],
            [
                2235,
                2250
            ],
            [
                2251,
                2255
            ],
            [
                2256,
                2258
            ],
            [
                2267,
                2268
            ],
            [
                2274,
                2285
            ],
            [
                2286,
                2292
            ],
            [
                2292,
                2378
            ],
            [
                2387,
                2388
            ],
            [
                2389,
                2410
            ],
            [
                2411,
                2506
            ],
            [
                2506,
                2523
            ],
            [
                2524,
                2543
            ],
            [
                2544,
                2557
            ],
            [
                2558,
                2683
            ],
            [
                2683,
                2838
            ],
            [
                2838,
                2874
            ],
            [
                2875,
                2887
            ],
            [
                2888,
                2907
            ],
            [
                2907,
                2908
            ],
            [
                2914,
                2976
            ],
            [
                2977,
                3016
            ],
            [
                3016,
                3093
            ],
            [
                3094,
                3100
            ],
            [
                3100,
                3137
            ],
            [
                3138,
                3153
            ],
            [
                3156,
                3171
            ],
            [
                3173,
                3211
            ],
            [
                3211,
                3215
            ],
            [
                3216,
                3222
            ],
            [
                3225,
                3254
            ],
            [
                3255,
                3273
            ],
            [
                3274,
                3283
            ],
            [
                3286,
                3290
            ],
            [
                3290,
                3331
            ],
            [
                3332,
                3348
            ],
            [
                3351,
                3367
            ],
            [
                3374,
                3377
            ],
            [
                3383,
                3398
            ],
            [
                3398,
                3416
            ],
            [
                3417,
                3419
            ],
            [
                3422,
                3428
            ],
            [
                3431,
                3434
            ],
            [
                3445,
                3461
            ],
            [
                3461,
                3462
            ],
            [
                3469,
                3486
            ],
            [
                3487,
                3540
            ],
            [
                3549,
                3553
            ],
            [
                3554,
                3560
            ],
            [
                3561,
                3598
            ],
            [
                3601,
                3652
            ],
            [
                3660,
                3687
            ],
            [
                3688,
                3690
            ],
            [
                3691,
                3699
            ],
            [
                3700,
                3704
            ],
            [
                3716,
                3720
            ],
            [
                3721,
                3724
            ],
            [
                3730,
                3741
            ],
            [
                3744,
                3752
            ],
            [
                3753,
                3759
            ],
            [
                3767,
                3873
            ],
            [
                3873,
                3882
            ],
            [
                3883,
                3903
            ],
            [
                3904,
                3952
            ],
            [
                3952,
                3953
            ],
            [
                3954,
                3956
            ],
            [
                3957,
                3967
            ],
            [
                3968,
                3988
            ],
            [
                3989,
                3996
            ],
            [
                3999,
                4018
            ],
            [
                4019,
                4028
            ],
            [
                4043,
                4070
            ],
            [
                4073,
                4136
            ],
            [
                4148,
                4161
            ],
            [
                4162,
                4179
            ],
            [
                4181,
                4188
            ],
            [
                4194,
                4203
            ],
            [
                4204,
                4209
            ],
            [
                4210,
                4247
            ],
            [
                4248,
                4299
            ],
            [
                4323,
                4324
            ],
            [
                4325,
                4327
            ],
            [
                4328,
                4345
            ],
            [
                4352,
                4359
            ],
            [
                4360,
                4373
            ],
            [
                4380,
                4419
            ],
            [
                4429,
                4444
            ],
            [
                4444,
                4446
            ],
            [
                4446,
                4472
            ],
            [
                4473,
                4492
            ],
            [
                4493,
                4508
            ],
            [
                4513,
                4523
            ],
            [
                4532,
                4539
            ],
            [
                4540,
                4548
            ],
            [
                4549,
                4560
            ],
            [
                4561,
                4568
            ],
            [
                4569,
                4583
            ],
            [
                4586,
                4634
            ]
        ],
        "row_chars": [
            [
                0,
                219
            ],
            [
                219,
                601
            ],
            [
                601,
                627
            ],
            [
                627,
                2506
            ],
            [
                2506,
                2838
            ],
            [
                2838,
                3156
            ],
            [
                3156,
                3156
            ],
            [
                3156,
                3156
            ],
            [
                3156,
                3156
            ],
            [
                3156,
                3156
            ],
            [
                3156,
                3225
            ],
            [
                3225,
                3716
            ],
            [
                3716,
                3873
            ],
            [
                3873,
                4162
            ],
            [
                4162,
                4446
            ],
            [
                4446,
                4634
            ]
        ]
    }
}