{
    "original": {
        "text": "The first thirty pages, said my father, turning over the leaves, --are a little dry; and as they are not closely connected with the subject, ----for the present we'll pass them by: 'tis a prefatory introduction, continued my father, or an introductory preface (for I am not determined which name to give it) upon political or civil government; the foundation of which being laid in the first conjunction betwixt male and female, for procreation of the species ----I was insensibly led into it. ----'Twas natural, said _Yorick_.\nThe original of society, continued my father, I'm satisfied is, what _Politian_ tells us, _i.e._, merely conjugal; and nothing more than the getting together of one man and one woman; --to which, (according to _Hesiod_) the philosopher adds a servant: ----but supposing in the first beginning there were no men servants born----he lays the foundation of it, in a man, --a woman--and a bull. ----I believe 'tis an ox, quoth _Yorick_, quoting the passage ( , , ' ). ----A bull must have given more trouble than his head was worth. ----But there is a better reason still, said my father (dipping his pen into his ink); for the ox being the most patient of animals, and the most useful withal in tilling the ground for their nourishment, --was the properest instrument, and emblem too, for the new joined couple, that the creation could have associated with them. --And there is a stronger reason, added my uncle _Toby_, than them all for the ox. --My father had not power to take his pen out of his ink-horn, till he had heard my uncle _Toby's_ reason. --For when the ground was tilled, said my uncle _Toby_, and made worth inclosing, then they began to secure it by walls and ditches, which was the origin of fortification. ----True, true, dear _Toby_, cried my father, striking out the bull, and putting the ox in his place.\nMy father gave _Trim_ a nod, to snuff the candle, and resumed his discourse.\n----I enter upon this speculation, said my father carelessly, and half shutting the book, as he went on, merely to shew the foundation of the natural relation between a father and his child; the right and jurisdiction over whom he acquires these several ways--\n1st, by marriage.\n2d, by adoption.\n3d, by legitimation.\nAnd 4th, by procreation; all which I consider in their order.\nI lay a slight stress upon one of them, replied _Yorick_----the act, especially where it ends there, in my opinion lays as little obligation upon the child, as it conveys power to the father. --You are wrong, --said my father argutely, and for this plain reason * * * * * * * * * * * * * * * * * * * * * * * * * * --I own, added my father, that the offspring, upon this account, is not so under the power and jurisdiction of the mother. --But the reason, replied _Yorick_, equally holds good for her. ----She is under authority herself, said my father: --and besides, continued my father, nodding his head, and laying his finger upon the side of his nose, as he assigned his reason, --_she is not the principal agent, _Yorick_._ --In what, quoth my uncle _Toby?_ stopping his pipe. --Though by all means, added my father (not attending to my uncle _Toby_) \"_The son ought to pay her respect_,\" as you may read, _Yorick_, at large in the first book of the Institutes of _Justinian_, at the eleventh title and the tenth section, --I can read it as well, replied _Yorick_, in the Catechism.",
        "paragraph_chars": [
            [
                0,
                528
            ],
            [
                528,
                1852
            ],
            [
                1852,
                1929
            ],
            [
                1929,
                2190
            ],
            [
                2190,
                2208
            ],
            [
                2208,
                2225
            ],
            [
                2225,
                2246
            ],
            [
                2246,
                2308
            ],
            [
                2308,
                3395
            ]
        ],
        "segment_chars": [
            [
                0,
                494
            ],
            [
                494,
                528
            ],
            [
                528,
                919
            ],
            [
                919,
                992
            ],
            [
                992,
                1057
            ],
            [
                1057,
                1388
            ],
            [
                1388,
                1471
            ],
            [
                1471,
                1578
            ],
            [
                1578,
                1750
            ],
            [
                1750,
                1852
            ],
            [
                1852,
                1929
            ],
            [
                1929,
                2190
            ],
            [
                2190,
                2208
            ],
            [
                2208,
                2225
            ],
            [
                2225,
                2246
            ],
            [
                2246,
                2308
            ],
            [
                2308,
                2500
            ],
            [
                2500,
                2745
            ],
            [
                2745,
                2809
            ],
            [
                2809,
                3090
            ],
            [
                3090,
                3395
            ]
        ],
        "overlap_chars": [
            [
                4,
                22
            ],
            [
                24,
                64
            ],
            [
                67,
                140
            ],
            [
                161,
                179
            ],
            [
                492,
                493
            ],
            [
                181,
                210
            ],
            [
                231,
                273
            ],
            [
                285,
                290
            ],
            [
                296,
                298
            ],
            [
                304,
                322
            ],
            [
                332,
                367
            ],
            [
                374,
                459
            ],
            [
                464,
                492
            ],
            [
                499,
                511
            ],
            [
                513,
                517
            ],
            [
                519,
                525
            ],
            [
                541,
                551
            ],
            [
                553,
                573
            ],
            [
                588,
                590
            ],
            [
                633,
                711
            ],
            [
                714,
                722
            ],
            [
                739,
                745
            ],
            [
                764,
                779
            ],
            [
                784,
                804
            ],
            [
                811,
                852
            ],
            [
                856,
                881
            ],
            [
                886,
                895
            ],
            [
                898,
                905
            ],
            [
                907,
                917
            ],
            [
                987,
                988
            ],
            [
                923,
                943
            ],
            [
                945,
                950
            ],
            [
                952,
                958
            ],
            [
                959,
                980
            ],
            [
                996,
                1036
            ],
            [
                1046,
                1055
            ],
            [
                1061,
                1089
            ],
            [
                1097,
                1143
            ],
            [
                1144,
                1147
            ],
            [
                1148,
                1154
            ],
            [
                1161,
                1177
            ],
            [
                1190,
                1193
            ],
            [
                1203,
                1209
            ],
            [
                1178,
                1189
            ],
            [
                1194,
                1197
            ],
            [
                1298,
                1304
            ],
            [
                1310,
                1335
            ],
            [
                1390,
                1420
            ],
            [
                1459,
                1469
            ],
            [
                1422,
                1436
            ],
            [
                1469,
                1471
            ],
            [
                1580,
                1610
            ],
            [
                1658,
                1748
            ],
            [
                1758,
                1770
            ],
            [
                1779,
                1808
            ],
            [
                1813,
                1830
            ],
            [
                1835,
                1852
            ],
            [
                1862,
                1866
            ],
            [
                1874,
                1879
            ],
            [
                1881,
                1913
            ],
            [
                1927,
                1929
            ],
            [
                1933,
                1962
            ],
            [
                1964,
                1968
            ],
            [
                2022,
                2024
            ],
            [
                1979,
                1990
            ],
            [
                1995,
                2018
            ],
            [
                2041,
                2043
            ],
            [
                2049,
                2119
            ],
            [
                2157,
                2174
            ],
            [
                2147,
                2151
            ],
            [
                2175,
                2187
            ],
            [
                2190,
                2208
            ],
            [
                2208,
                2209
            ],
            [
                2210,
                2225
            ],
            [
                2225,
                2226
            ],
            [
                2227,
                2246
            ],
            [
                2246,
                2274
            ],
            [
                2275,
                2306
            ],
            [
                2308,
                2309
            ],
            [
                2310,
                2313
            ],
            [
                2323,
                2329
            ],
            [
                2335,
                2346
            ],
            [
                2348,
                2355
            ],
            [
                2357,
                2363
            ],
            [
                2368,
                2375
            ],
            [
                2375,
                2387
            ],
            [
                2394,
                2498
            ],
            [
                2502,
                2515
            ],
            [
                2519,
                2533
            ],
            [
                2515,
                2516
            ],
            [
                2544,
                2569
            ],
            [
                2570,
                2609
            ],
            [
                2624,
                2629
            ],
            [
                2631,
                2647
            ],
            [
                2648,
                2693
            ],
            [
                2697,
                2712
            ],
            [
                2730,
                2743
            ],
            [
                2747,
                2761
            ],
            [
                2789,
                2794
            ],
            [
                2781,
                2788
            ],
            [
                2795,
                2807
            ],
            [
                2763,
                2770
            ],
            [
                2772,
                2778
            ],
            [
                2807,
                2808
            ],
            [
                2967,
                2969
            ],
            [
                2817,
                2825
            ],
            [
                2826,
                2843
            ],
            [
                2845,
                2860
            ],
            [
                2863,
                2875
            ],
            [
                2994,
                3024
            ],
            [
                3039,
                3046
            ],
            [
                3054,
                3062
            ],
            [
                3088,
                3089
            ],
            [
                3099,
                3111
            ],
            [
                3113,
                3155
            ],
            [
                3166,
                3198
            ],
            [
                3199,
                3218
            ],
            [
                3220,
                3226
            ],
            [
                3111,
                3112
            ],
            [
                3238,
                3276
            ],
            [
                3278,
                3287
            ],
            [
                3288,
                3333
            ],
            [
                3337,
                3350
            ],
            [
                3351,
                3358
            ],
            [
                3360,
                3367
            ],
            [
                3369,
                3375
            ],
            [
                3227,
                3228
            ],
            [
                3378,
                3394
            ]
        ],
        "row_chars": [
            [
                0,
                494
            ],
            [
                494,
                528
            ],
            [
                528,
                919
            ],
            [
                919,
                992
            ],
            [
                992,
                1057
            ],
            [
                1057,
                1388
            ],
            [
                1388,
                1471
            ],
            [
                1471,
                1578
            ],
            [
                1578,
                1750
            ],
            [
                1750,
                1852
            ],
            [
                1852,
                1929
            ],
            [
                1929,
                2190
            ],
            [
                2190,
                2208
            ],
            [
                2208,
                2225
            ],
            [
                2225,
                2246
            ],
            [
                2246,
                2308
            ],
            [
                2308,
                2500
            ],
            [
                2500,
                2745
            ],
            [
                2745,
                2809
            ],
            [
                2809,
                3090
            ],
            [
                3090,
                3395
            ]
        ]
    },
    "abridged": {
        "text": "'The first thirty pages,' said my father, turning over the leaves, 'are a little dry; and as they are not closely connected with the subject, we'll pass them by. 'Tis a prefatory introduction, or an introductory preface (for I am not sure which to call it) upon political government; the foundation of which is laid in the first conjunction betwixt male and female, for procreation of the species - I was insensibly led into it.'\n''Twas natural,' said Yorick.\n'The origin of society,' continued my father, 'is conjugal; and nothing more than the getting together of one man and one woman; to which Hesiod adds a servant: but supposing in the beginning there were no men servants born - he lays the foundation of society in a man, a woman and a bull.'\n'I believe 'tis an ox,' quoth Yorick, quoting the passage in Greek. 'A bull must have given more trouble than he was worth.'\n'But there is a better reason,' said my father (dipping his pen into his ink); 'for since the ox is the most patient and useful of animals, 'twas the best emblem for the new joined couple.'\n'And there is a stronger reason still for the ox,' added my uncle Toby. 'For when the ground was tilled by the ox, then they began to secure it by walls and ditches, which was the origin of fortification.'\n'True, true, dear Toby,' cried my father, striking out bull, and putting ox in his place.\nHe gave Trim a nod to snuff the candle, and resumed.\n'I enter upon this speculation,' said he carelessly, half shutting the book, 'merely to show the foundation of the natural relation between a father and his child; he acquires these rights over him in several ways-\n'1st, by marriage.\n'2nd, by adoption.\n'3rd, by legitimation.\n'And 4th, by procreation; all of which I consider in their order.'\n'I would lay some stress on one of them,' replied Yorick: 'the act of procreation, especially when it ends there, in my opinion lays as little obligation upon the child, as it conveys power to the father.'\n'You are wrong,' said my father, 'and for this plain reason: * * * * * * * * * * * * * * * * * * * * - I own,' added my father, 'that the offspring, upon this account, is not under the power of the mother.'\n'But the reason holds equally good for her,' replied Yorick.\n'She is under another's authority herself,' said my father: 'and besides, she is not the principal agent.'\n'In what?' asked my uncle Toby.\n'Though by all means,' added my father (not attending to my uncle Toby), '\"The son ought to pay her respect,\" as you may read, Yorick, in the first book of the Institutes of Justinian, at the eleventh title and the tenth section.'\n'I can read it just as well,' replied Yorick, 'in the Catechism.'",
        "paragraph_chars": [
            [
                0,
                430
            ],
            [
                430,
                460
            ],
            [
                460,
                751
            ],
            [
                751,
                876
            ],
            [
                876,
                1066
            ],
            [
                1066,
                1272
            ],
            [
                1272,
                1362
            ],
            [
                1362,
                1415
            ],
            [
                1415,
                1630
            ],
            [
                1630,
                1649
            ],
            [
                1649,
                1668
            ],
            [
                1668,
                1691
            ],
            [
                1691,
                1758
            ],
            [
                1758,
                1964
            ],
            [
                1964,
                2171
            ],
            [
                2171,
                2232
            ],
            [
                2232,
                2339
            ],
            [
                2339,
                2371
            ],
            [
                2371,
                2602
            ],
            [
                2602,
                2667
            ]
        ],
        "segment_chars": [
            [
                0,
                162
            ],
            [
                162,
                430
            ],
            [
                430,
                460
            ],
            [
                460,
                751
            ],
            [
                751,
                819
            ],
            [
                819,
                876
            ],
            [
                876,
                1066
            ],
            [
                1066,
                1138
            ],
            [
                1138,
                1272
            ],
            [
                1272,
                1362
            ],
            [
                1362,
                1415
            ],
            [
                1415,
                1630
            ],
            [
                1630,
                1649
            ],
            [
                1649,
                1668
            ],
            [
                1668,
                1691
            ],
            [
                1691,
                1758
            ],
            [
                1758,
                1964
            ],
            [
                1964,
                2171
            ],
            [
                2171,
                2232
            ],
            [
                2232,
                2339
            ],
            [
                2339,
                2350
            ],
            [
                2350,
                2371
            ],
            [
                2371,
                2602
            ],
            [
                2602,
                2667
            ]
        ],
        "overlap_chars": [
            [
                5,
                23
            ],
            [
                26,
                66
            ],
            [
                68,
                141
            ],
            [
                142,
                160
            ],
            [
                160,
                161
            ],
            [
                162,
                191
            ],
            [
                191,
                233
            ],
            [
                239,
                244
            ],
            [
                245,
                247
            ],
            [
                253,
                271
            ],
            [
                272,
                307
            ],
            [
                311,
                396
            ],
            [
                399,
                427
            ],
            [
                432,
                444
            ],
            [
                447,
                451
            ],
            [
                452,
                458
            ],
            [
                472,
                482
            ],
            [
                485,
                505
            ],
            [
                507,
                509
            ],
            [
                510,
                588
            ],
            [
                589,
                597
            ],
            [
                598,
                604
            ],
            [
                605,
                620
            ],
            [
                621,
                641
            ],
            [
                642,
                683
            ],
            [
                686,
                711
            ],
            [
                720,
                729
            ],
            [
                730,
                737
            ],
            [
                738,
                748
            ],
            [
                751,
                752
            ],
            [
                752,
                772
            ],
            [
                775,
                780
            ],
            [
                781,
                787
            ],
            [
                787,
                808
            ],
            [
                820,
                860
            ],
            [
                864,
                873
            ],
            [
                877,
                905
            ],
            [
                908,
                954
            ],
            [
                956,
                959
            ],
            [
                966,
                972
            ],
            [
                976,
                992
            ],
            [
                993,
                996
            ],
            [
                997,
                1003
            ],
            [
                1004,
                1015
            ],
            [
                1022,
                1025
            ],
            [
                1031,
                1037
            ],
            [
                1038,
                1063
            ],
            [
                1067,
                1097
            ],
            [
                1104,
                1114
            ],
            [
                1117,
                1131
            ],
            [
                1136,
                1138
            ],
            [
                1139,
                1169
            ],
            [
                1179,
                1269
            ],
            [
                1277,
                1289
            ],
            [
                1297,
                1326
            ],
            [
                1327,
                1344
            ],
            [
                1345,
                1362
            ],
            [
                1365,
                1369
            ],
            [
                1375,
                1380
            ],
            [
                1381,
                1413
            ],
            [
                1413,
                1415
            ],
            [
                1416,
                1445
            ],
            [
                1448,
                1452
            ],
            [
                1453,
                1455
            ],
            [
                1456,
                1467
            ],
            [
                1468,
                1491
            ],
            [
                1500,
                1502
            ],
            [
                1508,
                1578
            ],
            [
                1579,
                1596
            ],
            [
                1604,
                1608
            ],
            [
                1616,
                1628
            ],
            [
                1631,
                1649
            ],
            [
                1650,
                1651
            ],
            [
                1653,
                1668
            ],
            [
                1669,
                1670
            ],
            [
                1672,
                1691
            ],
            [
                1692,
                1720
            ],
            [
                1724,
                1755
            ],
            [
                1759,
                1760
            ],
            [
                1767,
                1770
            ],
            [
                1776,
                1782
            ],
            [
                1786,
                1797
            ],
            [
                1800,
                1807
            ],
            [
                1808,
                1814
            ],
            [
                1817,
                1824
            ],
            [
                1839,
                1851
            ],
            [
                1857,
                1961
            ],
            [
                1965,
                1978
            ],
            [
                1981,
                1995
            ],
            [
                1995,
                1996
            ],
            [
                1998,
                2023
            ],
            [
                2025,
                2064
            ],
            [
                2067,
                2072
            ],
            [
                2075,
                2091
            ],
            [
                2093,
                2138
            ],
            [
                2139,
                2154
            ],
            [
                2155,
                2168
            ],
            [
                2172,
                2186
            ],
            [
                2187,
                2192
            ],
            [
                2193,
                2200
            ],
            [
                2201,
                2213
            ],
            [
                2216,
                2223
            ],
            [
                2224,
                2230
            ],
            [
                2230,
                2231
            ],
            [
                2234,
                2236
            ],
            [
                2237,
                2245
            ],
            [
                2256,
                2273
            ],
            [
                2276,
                2291
            ],
            [
                2293,
                2305
            ],
            [
                2306,
                2336
            ],
            [
                2340,
                2347
            ],
            [
                2356,
                2364
            ],
            [
                2369,
                2370
            ],
            [
                2379,
                2391
            ],
            [
                2394,
                2436
            ],
            [
                2446,
                2478
            ],
            [
                2478,
                2497
            ],
            [
                2498,
                2504
            ],
            [
                2504,
                2505
            ],
            [
                2506,
                2544
            ],
            [
                2545,
                2554
            ],
            [
                2554,
                2599
            ],
            [
                2603,
                2616
            ],
            [
                2622,
                2629
            ],
            [
                2632,
                2639
            ],
            [
                2640,
                2646
            ],
            [
                2646,
                2647
            ],
            [
                2649,
                2665
            ]
        ],
        "row_chars": [
            [
                0,
                430
            ],
            [
                430,
                460
            ],
            [
                460,
                751
            ],
            [
                751,
                819
            ],
            [
                819,
                876
            ],
            [
                876,
                1066
            ],
            [
                1066,
                1138
            ],
            [
                1138,
                1138
            ],
            [
                1138,
                1272
            ],
            [
                1272,
                1362
            ],
            [
                1362,
                1415
            ],
            [
                1415,
                1630
            ],
            [
                1630,
                1649
            ],
            [
                1649,
                1668
            ],
            [
                1668,
                1691
            ],
            [
                1691,
                1758
            ],
            [
                1758,
                1964
            ],
            [
                1964,
                2171
            ],
            [
                2171,
                2232
            ],
            [
                2232,
                2371
            ],
            [
                2371,
                2667
            ]
        ]
    }
}