{
    "original": {
        "text": "The whole secret of health, said my father, beginning the sentence again, depending evidently upon the due contention betwixt the radical heat and radical moisture within us; --the least imaginable skill had been sufficient to have maintained it, had not the schoolmen confounded the talk, merely (as _Van Helmont_, the famous chymist, has proved) by all along mistaking the radical moisture for the tallow and fat of animal bodies.\nNow the radical moisture is not the tallow or fat of animals, but an oily and balsamous substance; for the fat and tallow, as also the phlegm or watery parts, are cold; whereas the oily and balsamous parts are of a lively heat and spirit, which accounts for the observation of _Aristotle_, \"_Quod omne animal post coitum est _triste_._\"\nNow it is certain, that the radical heat lives in the radical moisture, but whether _vice vers_, is a doubt: however, when the one decays, the other decays also; and then is produced, either an unnatural heat, which causes an unnatural dryness----or an unnatural moisture, which causes dropsies. ----So that if a child, as he grows up, can but be taught to avoid running into fire or water, as either of 'em threaten his destruction, ----'twill be all that is needful to be done upon that head.----",
        "paragraph_chars": [
            [
                0,
                433
            ],
            [
                433,
                770
            ],
            [
                770,
                1268
            ]
        ],
        "segment_chars": [
            [
                0,
                433
            ],
            [
                433,
                770
            ],
            [
                770,
                1066
            ],
            [
                1066,
                1268
            ]
        ],
        "overlap_chars": [
            [
                4,
                26
            ],
            [
                28,
                73
            ],
            [
                94,
                102
            ],
            [
                107,
                174
            ],
            [
                198,
                203
            ],
            [
                224,
                226
            ],
            [
                243,
                246
            ],
            [
                255,
                268
            ],
            [
                247,
                254
            ],
            [
                297,
                300
            ],
            [
                302,
                313
            ],
            [
                314,
                326
            ],
            [
                334,
                350
            ],
            [
                361,
                399
            ],
            [
                411,
                433
            ],
            [
                433,
                468
            ],
            [
                479,
                543
            ],
            [
                596,
                709
            ],
            [
                711,
                720
            ],
            [
                554,
                555
            ],
            [
                768,
                769
            ],
            [
                725,
                757
            ],
            [
                770,
                787
            ],
            [
                789,
                853
            ],
            [
                855,
                859
            ],
            [
                865,
                877
            ],
            [
                879,
                931
            ],
            [
                954,
                978
            ],
            [
                932,
                935
            ],
            [
                1006,
                1013
            ],
            [
                1017,
                1042
            ],
            [
                1056,
                1066
            ],
            [
                1070,
                1109
            ],
            [
                1114,
                1203
            ],
            [
                1208,
                1226
            ],
            [
                1238,
                1248
            ],
            [
                1254,
                1258
            ]
        ],
        "row_chars": [
            [
                0,
                433
            ],
            [
                433,
                770
            ],
            [
                770,
                1066
            ],
            [
                1066,
                1268
            ]
        ]
    },
    "abridged": {
        "text": "'The whole secret of health,' said my father, beginning the sentence again, 'depends upon the contention betwixt the radical heat and radical moisture within us; hardly any skill would be needed to maintain it, if only the schoolmen had not confused matters (as Van Helmont, the famous chemist, has proved) by mistaking the radical moisture for the fat of animal bodies.\n'Now the radical moisture is not the fat of animals, but an oily and balsamous substance; for the fat is cold; whereas the oily and balsamous parts are of a lively heat and spirit, which accounts for the observation of Aristotle, \"Quod omne animal post coitum est triste.\"\n'Now it is certain that the radical heat lives in the radical moisture, but whether vice versa, is a doubt. However, when the one decays, the other decays also; causing either an unnatural heat and dryness - or an unnatural moisture, leading to dropsies. So that if a child, as he grows up, can be taught to avoid running into fire or water, as either of 'em threaten his destruction, 'twill be all that needs to be done on that account.'",
        "paragraph_chars": [
            [
                0,
                371
            ],
            [
                371,
                644
            ],
            [
                644,
                1082
            ]
        ],
        "segment_chars": [
            [
                0,
                371
            ],
            [
                371,
                644
            ],
            [
                644,
                752
            ],
            [
                752,
                899
            ],
            [
                899,
                1082
            ]
        ],
        "overlap_chars": [
            [
                5,
                27
            ],
            [
                30,
                75
            ],
            [
                85,
                93
            ],
            [
                94,
                161
            ],
            [
                173,
                178
            ],
            [
                195,
                197
            ],
            [
                207,
                210
            ],
            [
                219,
                232
            ],
            [
                233,
                240
            ],
            [
                258,
                261
            ],
            [
                262,
                273
            ],
            [
                273,
                285
            ],
            [
                293,
                309
            ],
            [
                310,
                348
            ],
            [
                349,
                371
            ],
            [
                372,
                407
            ],
            [
                408,
                472
            ],
            [
                476,
                589
            ],
            [
                590,
                599
            ],
            [
                599,
                600
            ],
            [
                601,
                602
            ],
            [
                602,
                634
            ],
            [
                645,
                662
            ],
            [
                663,
                727
            ],
            [
                728,
                732
            ],
            [
                738,
                750
            ],
            [
                752,
                804
            ],
            [
                813,
                837
            ],
            [
                838,
                841
            ],
            [
                842,
                849
            ],
            [
                852,
                877
            ],
            [
                889,
                899
            ],
            [
                899,
                938
            ],
            [
                939,
                1028
            ],
            [
                1029,
                1047
            ],
            [
                1054,
                1064
            ],
            [
                1068,
                1072
            ]
        ],
        "row_chars": [
            [
                0,
                371
            ],
            [
                371,
                644
            ],
            [
                644,
                899
            ],
            [
                899,
                1082
            ]
        ]
    }
}