{
    "original": {
        "text": "Though my father travelled homewards, as I told you, in none of the best of moods, --pshawing and pishing all the way down, --yet he had the complaisance to keep the worst part of the story still to himself; --which was the resolution he had taken of doing himself the justice, which my uncle _Toby's_ clause in the marriage-settlement empowered him; nor was it till the very night in which I was begot, which was thirteen months after, that she had the least intimation of his design: when my father, happening, as you remember, to be a little chagrin'd and out of temper, ----took occasion as they lay chatting gravely in bed afterwards, talking over what was to come, ----to let her know that she must accommodate herself as well as she could to the bargain made between them in their marriage-deeds; which was to lye-in of her next child in the country, to balance the last year's journey.\nMy father was a gentleman of many virtues, --but he had a strong spice of that in his temper, which might, or might not, add to the number. --'Tis known by the name of perseverance in a good cause, --and of obstinacy in a bad one: Of this my mother had so much knowledge, that she knew 'twas to no purpose to make any remonstrance, --so she e'en resolved to sit down quietly, and make the most of it.",
        "paragraph_chars": [
            [
                0,
                894
            ],
            [
                894,
                1294
            ]
        ],
        "segment_chars": [
            [
                0,
                894
            ],
            [
                894,
                1034
            ],
            [
                1034,
                1294
            ]
        ],
        "overlap_chars": [
            [
                0,
                82
            ],
            [
                90,
                123
            ],
            [
                126,
                132
            ],
            [
                162,
                189
            ],
            [
                196,
                206
            ],
            [
                210,
                219
            ],
            [
                224,
                234
            ],
            [
                154,
                156
            ],
            [
                662,
                664
            ],
            [
                284,
                292
            ],
            [
                814,
                816
            ],
            [
                298,
                300
            ],
            [
                302,
                335
            ],
            [
                359,
                361
            ],
            [
                355,
                358
            ],
            [
                367,
                459
            ],
            [
                471,
                477
            ],
            [
                484,
                544
            ],
            [
                555,
                573
            ],
            [
                583,
                639
            ],
            [
                675,
                704
            ],
            [
                157,
                161
            ],
            [
                746,
                802
            ],
            [
                276,
                277
            ],
            [
                820,
                823
            ],
            [
                827,
                841
            ],
            [
                856,
                868
            ],
            [
                873,
                894
            ],
            [
                894,
                936
            ],
            [
                939,
                964
            ],
            [
                973,
                979
            ],
            [
                988,
                999
            ],
            [
                1022,
                1025
            ],
            [
                965,
                967
            ],
            [
                999,
                1003
            ],
            [
                1032,
                1034
            ],
            [
                1133,
                1142
            ],
            [
                1128,
                1132
            ],
            [
                1090,
                1091
            ],
            [
                1171,
                1185
            ],
            [
                1189,
                1191
            ],
            [
                1212,
                1220
            ],
            [
                1228,
                1234
            ],
            [
                1240,
                1294
            ]
        ],
        "row_chars": [
            [
                0,
                894
            ],
            [
                894,
                1034
            ],
            [
                1034,
                1294
            ]
        ]
    },
    "abridged": {
        "text": "Though my father travelled homewards, as I told you, in none of the best of moods, pshawing and pishing all the way down, yet he kept the worst part of the story to himself: which was his resolution to hold my mother to my uncle Toby's clause in the marriage-settlement. It was not until the very night in which I was begot, which was thirteen months after, that she had the least idea of his intention: when my father, happening, as you remember, to be a little annoyed and out of temper, took occasion as they lay chatting gravely in bed afterwards, to let her know that she must keep to the bargain made between them in their marriage-deeds, and lie-in with her next child at home, to balance last year's journey.\nMy father was a gentleman of many virtues, but he had a strong spice in his nature which might be called either the virtue of perseverance, or the vice of obstinacy. Because my mother knew this, she knew 'twas no use remonstrating; so she resolved to sit down quietly, and make the most of it.",
        "paragraph_chars": [
            [
                0,
                717
            ],
            [
                717,
                1010
            ]
        ],
        "segment_chars": [
            [
                0,
                271
            ],
            [
                271,
                717
            ],
            [
                717,
                883
            ],
            [
                883,
                1010
            ]
        ],
        "overlap_chars": [
            [
                0,
                82
            ],
            [
                88,
                121
            ],
            [
                122,
                128
            ],
            [
                134,
                161
            ],
            [
                162,
                172
            ],
            [
                174,
                183
            ],
            [
                188,
                198
            ],
            [
                199,
                201
            ],
            [
                217,
                219
            ],
            [
                220,
                228
            ],
            [
                229,
                231
            ],
            [
                233,
                235
            ],
            [
                236,
                269
            ],
            [
                271,
                273
            ],
            [
                274,
                277
            ],
            [
                288,
                380
            ],
            [
                386,
                392
            ],
            [
                402,
                462
            ],
            [
                471,
                489
            ],
            [
                495,
                551
            ],
            [
                552,
                581
            ],
            [
                582,
                586
            ],
            [
                587,
                643
            ],
            [
                643,
                644
            ],
            [
                652,
                655
            ],
            [
                661,
                675
            ],
            [
                683,
                695
            ],
            [
                696,
                717
            ],
            [
                717,
                759
            ],
            [
                760,
                785
            ],
            [
                786,
                792
            ],
            [
                800,
                811
            ],
            [
                829,
                832
            ],
            [
                840,
                842
            ],
            [
                855,
                859
            ],
            [
                881,
                883
            ],
            [
                891,
                900
            ],
            [
                906,
                910
            ],
            [
                910,
                911
            ],
            [
                912,
                926
            ],
            [
                927,
                929
            ],
            [
                934,
                942
            ],
            [
                949,
                955
            ],
            [
                956,
                1010
            ]
        ],
        "row_chars": [
            [
                0,
                717
            ],
            [
                717,
                883
            ],
            [
                883,
                1010
            ]
        ]
    }
}