{
    "original": {
        "text": "When my father had danced his white bear backwards and forwards through half a dozen pages, he closed the book for good an' all, --and in a kind of triumph redelivered it into _Trim's_ hand, with a nod to lay it upon the 'scrutoire, where he found it. ----_Tristram_, said he, shall be made to conjugate every word in the dictionary, backwards and forwards the same way; ----every word, _Yorick_, by this means, you see, is converted into a thesis or an hypothesis; --every thesis and hypothesis have an offspring of propositions; --and each proposition has its own consequences and conclusions; every one of which leads the mind on again, into fresh tracks of enquiries and doubtings. ----The force of this engine, added my father, is incredible in opening a child's head. ----'Tis enough, brother _Shandy_, cried my uncle _Toby_, to burst it into a thousand splinters.----\nI presume, said _Yorick_, smiling, --it must be owing to this, ----(for let logicians say what they will, it is not to be accounted for sufficiently from the bare use of the ten predicaments) ----That the famous _Vincent Quirino_, amongst the many other astonishing feats of his childhood, of which the Cardinal _Bembo_ has given the world so exact a story, --should be able to paste up in the public schools at _Rome_, so early as in the eighth year of his age, no less than four thousand five hundred and fifty different theses, upon the most abstruse points of the most abstruse theology; --and to defend and maintain them in such sort, as to cramp and dumbfound his opponents. ----What is that, cried my father, to what is told us of _Alphonsus Tostatus_, who, almost in his nurse's arms, learned all the sciences and liberal arts without being taught any one of them? ----What shall we say of the great _Piereskius?_ --That's the very man, cried my uncle _Toby_, I once told you of, brother _Shandy_, who walked a matter of five hundred miles, reckoning from _Paris_ to _Shevling_, and from _Shevling_ back again, merely to see _Stevinus's_ flying chariot. ----He was a very great man! added my uncle _Toby_ (meaning _Stevinus_) --He was so, brother _Toby_, said my father (meaning _Piereskius_)----and had multiplied his ideas so fast, and increased his knowledge to such a prodigious stock, that, if we may give credit to an anecdote concerning him, which we cannot withhold here, without shaking the authority of all anecdotes whatever--at seven years of age, his father committed entirely to his care the education of his younger brother, a boy of five years old, --with the sole management of all his concerns. --Was the father as wise as the son? quoth my uncle _Toby_: --I should think not, said _Yorick_: --But what are these, continued my father--(breaking out in a kind of enthusiasm)--what are these, to those prodigies of childhood in _Grotius_, _Scioppius_, _Heinsius_, _Politian_, _Pascal_, _Joseph Scaliger_, _Ferdinand de Cordou_, and others--some of which left off their _substantial forms_ at nine years old, or sooner, and went on reasoning without them; --others went through their classics at seven; --wrote tragedies at eight; --_Ferdinand de Cordou_ was so wise at nine, --'twas thought the Devil was in him; --and at _Venice_ gave such proofs of his knowledge and goodness, that the monks imagined he was _Antichrist_, or nothing. ----Others were masters of fourteen languages at ten, --finished the course of their rhetoric, poetry, logic, and ethics, at eleven, --put forth their commentaries upon _Servius_ and _Martianus Capella_ at twelve, --and at thirteen received their degrees in philosophy, laws, and divinity: ----But you forget the great _Lipsius_, quoth _Yorick_, who composed a work[6.2] the day he was born: ----They should have wiped it up, said my uncle _Toby_, and said no more about it.\n[Footnote 6.2: Nous aurions quelque intert, says _Baillet_, de montrer qu'il n'a rien de ridicule s'il toit veritable, au moins dans le sens nigmatique que _Nicius Erythrus_ a tch de lui donner. Cet auteur dit que pour comprendre comme _Lipse_, il a p composer un ouvrage le premier jour de sa vie, il faut s'imaginer, que ce premier jour n'est pas celui de sa naissance charnelle, mais celui au quel il a commenc d'user de la raison; il veut que 'ait t l'ge de _neuf_ ans; et il nous veut persuader que ce fut en cet ge, que _Lipse_ fit un pome. ----Le tour est ingnieux, &c. &c.]",
        "paragraph_chars": [
            [
                0,
                875
            ],
            [
                875,
                3810
            ],
            [
                3810,
                4391
            ]
        ],
        "segment_chars": [
            [
                0,
                252
            ],
            [
                252,
                686
            ],
            [
                686,
                774
            ],
            [
                774,
                875
            ],
            [
                875,
                1556
            ],
            [
                1556,
                1748
            ],
            [
                1748,
                2037
            ],
            [
                2037,
                2066
            ],
            [
                2066,
                2596
            ],
            [
                2596,
                2633
            ],
            [
                2633,
                3335
            ],
            [
                3335,
                3810
            ],
            [
                3810,
                4005
            ],
            [
                4005,
                4357
            ],
            [
                4357,
                4391
            ]
        ],
        "overlap_chars": [
            [
                0,
                110
            ],
            [
                127,
                128
            ],
            [
                131,
                134
            ],
            [
                168,
                170
            ],
            [
                148,
                155
            ],
            [
                202,
                204
            ],
            [
                250,
                251
            ],
            [
                258,
                265
            ],
            [
                268,
                276
            ],
            [
                277,
                356
            ],
            [
                397,
                420
            ],
            [
                388,
                394
            ],
            [
                266,
                267
            ],
            [
                375,
                385
            ],
            [
                421,
                450
            ],
            [
                369,
                370
            ],
            [
                533,
                553
            ],
            [
                615,
                632
            ],
            [
                640,
                650
            ],
            [
                661,
                670
            ],
            [
                684,
                686
            ],
            [
                690,
                714
            ],
            [
                733,
                772
            ],
            [
                779,
                798
            ],
            [
                800,
                806
            ],
            [
                809,
                823
            ],
            [
                807,
                808
            ],
            [
                778,
                779
            ],
            [
                832,
                869
            ],
            [
                875,
                884
            ],
            [
                886,
                890
            ],
            [
                892,
                898
            ],
            [
                899,
                909
            ],
            [
                912,
                936
            ],
            [
                1071,
                1086
            ],
            [
                1096,
                1103
            ],
            [
                1245,
                1249
            ],
            [
                884,
                885
            ],
            [
                1307,
                1309
            ],
            [
                1150,
                1153
            ],
            [
                1314,
                1325
            ],
            [
                936,
                937
            ],
            [
                1250,
                1286
            ],
            [
                1338,
                1377
            ],
            [
                1388,
                1419
            ],
            [
                1429,
                1438
            ],
            [
                1457,
                1466
            ],
            [
                1469,
                1482
            ],
            [
                1496,
                1500
            ],
            [
                991,
                993
            ],
            [
                1531,
                1554
            ],
            [
                1560,
                1572
            ],
            [
                1574,
                1590
            ],
            [
                1591,
                1593
            ],
            [
                1618,
                1632
            ],
            [
                1633,
                1696
            ],
            [
                1705,
                1748
            ],
            [
                1962,
                1965
            ],
            [
                1752,
                1782
            ],
            [
                1784,
                1794
            ],
            [
                1803,
                1818
            ],
            [
                1820,
                1834
            ],
            [
                1947,
                1949
            ],
            [
                1818,
                1819
            ],
            [
                1881,
                1891
            ],
            [
                1904,
                1922
            ],
            [
                1934,
                1938
            ],
            [
                1940,
                1945
            ],
            [
                1951,
                1959
            ],
            [
                1982,
                2007
            ],
            [
                2009,
                2019
            ],
            [
                2021,
                2037
            ],
            [
                2041,
                2064
            ],
            [
                2066,
                2080
            ],
            [
                2088,
                2096
            ],
            [
                2098,
                2106
            ],
            [
                2111,
                2117
            ],
            [
                2138,
                2161
            ],
            [
                2163,
                2173
            ],
            [
                2217,
                2244
            ],
            [
                2118,
                2120
            ],
            [
                2271,
                2277
            ],
            [
                2423,
                2536
            ],
            [
                2598,
                2631
            ],
            [
                2633,
                2647
            ],
            [
                3176,
                3177
            ],
            [
                2658,
                2676
            ],
            [
                2678,
                2682
            ],
            [
                2684,
                2690
            ],
            [
                2695,
                2713
            ],
            [
                2715,
                2734
            ],
            [
                2676,
                2677
            ],
            [
                2750,
                2754
            ],
            [
                2760,
                2773
            ],
            [
                2713,
                2714
            ],
            [
                2792,
                2823
            ],
            [
                2790,
                2791
            ],
            [
                2649,
                2650
            ],
            [
                2832,
                2835
            ],
            [
                2836,
                2837
            ],
            [
                2839,
                2848
            ],
            [
                2849,
                2850
            ],
            [
                2852,
                2860
            ],
            [
                2861,
                2862
            ],
            [
                2876,
                2882
            ],
            [
                2873,
                2874
            ],
            [
                2905,
                2924
            ],
            [
                2925,
                2937
            ],
            [
                2939,
                2943
            ],
            [
                3063,
                3100
            ],
            [
                3103,
                3128
            ],
            [
                3132,
                3151
            ],
            [
                3153,
                3173
            ],
            [
                3018,
                3021
            ],
            [
                3230,
                3308
            ],
            [
                3310,
                3320
            ],
            [
                3333,
                3335
            ],
            [
                3346,
                3388
            ],
            [
                3391,
                3399
            ],
            [
                3420,
                3467
            ],
            [
                3486,
                3503
            ],
            [
                3505,
                3512
            ],
            [
                3538,
                3548
            ],
            [
                3551,
                3589
            ],
            [
                3629,
                3653
            ],
            [
                3659,
                3662
            ],
            [
                3665,
                3670
            ],
            [
                3672,
                3678
            ],
            [
                3603,
                3604
            ],
            [
                3681,
                3700
            ],
            [
                3706,
                3725
            ],
            [
                3736,
                3759
            ],
            [
                3761,
                3774
            ],
            [
                3609,
                3610
            ],
            [
                3783,
                3808
            ],
            [
                3852,
                3853
            ],
            [
                3864,
                3867
            ],
            [
                3854,
                3858
            ],
            [
                3913,
                3915
            ],
            [
                3970,
                3973
            ],
            [
                3889,
                3890
            ],
            [
                3868,
                3869
            ],
            [
                3927,
                3928
            ],
            [
                4053,
                4054
            ],
            [
                4243,
                4244
            ],
            [
                4282,
                4283
            ],
            [
                3915,
                3917
            ],
            [
                3984,
                3985
            ],
            [
                3821,
                3822
            ]
        ],
        "row_chars": [
            [
                0,
                252
            ],
            [
                252,
                686
            ],
            [
                686,
                774
            ],
            [
                774,
                875
            ],
            [
                875,
                1556
            ],
            [
                1556,
                1748
            ],
            [
                1748,
                2037
            ],
            [
                2037,
                2066
            ],
            [
                2066,
                2596
            ],
            [
                2596,
                2633
            ],
            [
                2633,
                3335
            ],
            [
                3335,
                3810
            ],
            [
                3810,
                4391
            ]
        ]
    },
    "abridged": {
        "text": "When my father had danced his white bear backwards and forwards through half a dozen pages, he closed the book, and handed it triumphantly to Trim.\n'Tristram,' said he, 'shall be made to conjugate every word in the dictionary, backwards and forwards. By this means, you see, Yorick, every word is converted into a thesis or proposition; and each proposition leads the mind on into fresh enquiries. The force of this engine is incredible in opening a child's head.'\n''Tis enough, brother Shandy,' cried my uncle Toby, 'to burst it into a thousand splinters.'\n'I presume,' said Yorick, smiling, 'it must be owing to this that the famous Vincent Quirino was able, in his eighth year, to paste up in the public schools at Rome no less than four thousand five hundred different theses, upon the most obscure points of theology; and to defend them well enough to dumbfound his opponents.'\n'What is that,' cried my father, 'to Alphonsus Tostatus, who, almost in his nurse's arms, learned all the sciences and arts without being taught any one of them? - And what shall we say of the great Piereskius?'\n'That's the very man,' cried my uncle Toby, 'who walked five hundred miles from Paris to Shevling and back again, merely to see Stevinus's flying chariot. - He was a very great man!' added my uncle (meaning Stevinus).\n'He was,' said my father (meaning Piereskius); 'and increased his knowledge so greatly, that it is said that when he was seven years of age, his father committed entirely to his care the education of his younger brother, a boy of five.'\n'Was the father as wise as the son?' quoth my uncle Toby.\n'I should think not,' said Yorick.\n'But what are these,' continued my father, in a fit of enthusiasm, 'to those prodigies of childhood, Grotius, Scioppius, Heinsius, Pascal, Ferdinand de Cordou, and others? Some went through their classics at seven; others wrote tragedies at eight; Ferdinand de Cordou was so wise at nine, and gave such proofs of his knowledge and goodness, that the monks imagined he was Antichrist. - Others were masters of fourteen languages at ten, finished studying rhetoric, poetry, logic, and ethics, at eleven, wrote commentaries upon Servius at twelve, and at thirteen received their degrees.'\n'But you forget the great Lipsius,' quoth Yorick, 'who composed a work* the day he was born.'\n'They should have wiped it up,' said my uncle Toby, 'and said no more about it.'\n* However, Baillet says that to understand how Lipsius composed a book on the first day of his life, one must imagine, that this first day is not that of his birth, but that on which he began to use reason; this would have been at the age of nine years; and we are persuaded that it was at this age that Lipsius composed a poem.",
        "paragraph_chars": [
            [
                0,
                148
            ],
            [
                148,
                465
            ],
            [
                465,
                558
            ],
            [
                558,
                883
            ],
            [
                883,
                1095
            ],
            [
                1095,
                1313
            ],
            [
                1313,
                1550
            ],
            [
                1550,
                1608
            ],
            [
                1608,
                1643
            ],
            [
                1643,
                2229
            ],
            [
                2229,
                2323
            ],
            [
                2323,
                2404
            ],
            [
                2404,
                2732
            ]
        ],
        "segment_chars": [
            [
                0,
                148
            ],
            [
                148,
                251
            ],
            [
                251,
                398
            ],
            [
                398,
                465
            ],
            [
                465,
                558
            ],
            [
                558,
                883
            ],
            [
                883,
                1045
            ],
            [
                1045,
                1095
            ],
            [
                1095,
                1250
            ],
            [
                1250,
                1278
            ],
            [
                1278,
                1313
            ],
            [
                1313,
                1550
            ],
            [
                1550,
                1587
            ],
            [
                1587,
                1608
            ],
            [
                1608,
                1643
            ],
            [
                1643,
                1815
            ],
            [
                1815,
                2027
            ],
            [
                2027,
                2229
            ],
            [
                2229,
                2323
            ],
            [
                2323,
                2404
            ],
            [
                2404,
                2732
            ]
        ],
        "overlap_chars": [
            [
                0,
                110
            ],
            [
                110,
                111
            ],
            [
                112,
                115
            ],
            [
                123,
                125
            ],
            [
                126,
                133
            ],
            [
                139,
                141
            ],
            [
                146,
                147
            ],
            [
                150,
                157
            ],
            [
                160,
                168
            ],
            [
                170,
                249
            ],
            [
                251,
                274
            ],
            [
                275,
                281
            ],
            [
                281,
                282
            ],
            [
                283,
                293
            ],
            [
                294,
                323
            ],
            [
                335,
                336
            ],
            [
                337,
                357
            ],
            [
                358,
                375
            ],
            [
                376,
                386
            ],
            [
                387,
                396
            ],
            [
                396,
                398
            ],
            [
                398,
                422
            ],
            [
                423,
                462
            ],
            [
                467,
                486
            ],
            [
                487,
                493
            ],
            [
                496,
                510
            ],
            [
                515,
                516
            ],
            [
                517,
                518
            ],
            [
                518,
                555
            ],
            [
                559,
                568
            ],
            [
                571,
                575
            ],
            [
                576,
                582
            ],
            [
                582,
                592
            ],
            [
                594,
                618
            ],
            [
                619,
                634
            ],
            [
                643,
                650
            ],
            [
                655,
                659
            ],
            [
                659,
                660
            ],
            [
                661,
                663
            ],
            [
                664,
                667
            ],
            [
                668,
                679
            ],
            [
                679,
                680
            ],
            [
                681,
                717
            ],
            [
                723,
                762
            ],
            [
                763,
                794
            ],
            [
                803,
                812
            ],
            [
                813,
                822
            ],
            [
                823,
                836
            ],
            [
                837,
                841
            ],
            [
                854,
                856
            ],
            [
                857,
                880
            ],
            [
                884,
                896
            ],
            [
                899,
                915
            ],
            [
                917,
                919
            ],
            [
                924,
                938
            ],
            [
                938,
                1001
            ],
            [
                1002,
                1045
            ],
            [
                1047,
                1050
            ],
            [
                1051,
                1081
            ],
            [
                1082,
                1092
            ],
            [
                1100,
                1115
            ],
            [
                1118,
                1132
            ],
            [
                1133,
                1135
            ],
            [
                1137,
                1138
            ],
            [
                1140,
                1150
            ],
            [
                1151,
                1169
            ],
            [
                1170,
                1174
            ],
            [
                1175,
                1180
            ],
            [
                1184,
                1192
            ],
            [
                1197,
                1222
            ],
            [
                1223,
                1233
            ],
            [
                1234,
                1250
            ],
            [
                1252,
                1275
            ],
            [
                1278,
                1292
            ],
            [
                1293,
                1301
            ],
            [
                1302,
                1310
            ],
            [
                1314,
                1320
            ],
            [
                1323,
                1346
            ],
            [
                1347,
                1357
            ],
            [
                1361,
                1388
            ],
            [
                1389,
                1391
            ],
            [
                1399,
                1405
            ],
            [
                1434,
                1547
            ],
            [
                1551,
                1584
            ],
            [
                1587,
                1601
            ],
            [
                1608,
                1609
            ],
            [
                1609,
                1627
            ],
            [
                1630,
                1634
            ],
            [
                1635,
                1641
            ],
            [
                1644,
                1662
            ],
            [
                1665,
                1684
            ],
            [
                1684,
                1685
            ],
            [
                1686,
                1690
            ],
            [
                1695,
                1708
            ],
            [
                1708,
                1709
            ],
            [
                1711,
                1742
            ],
            [
                1742,
                1743
            ],
            [
                1747,
                1748
            ],
            [
                1748,
                1751
            ],
            [
                1751,
                1752
            ],
            [
                1753,
                1762
            ],
            [
                1762,
                1763
            ],
            [
                1764,
                1772
            ],
            [
                1772,
                1773
            ],
            [
                1774,
                1780
            ],
            [
                1780,
                1781
            ],
            [
                1782,
                1801
            ],
            [
                1801,
                1813
            ],
            [
                1815,
                1819
            ],
            [
                1820,
                1857
            ],
            [
                1865,
                1890
            ],
            [
                1891,
                1910
            ],
            [
                1911,
                1931
            ],
            [
                1932,
                1935
            ],
            [
                1936,
                2014
            ],
            [
                2015,
                2025
            ],
            [
                2025,
                2027
            ],
            [
                2036,
                2078
            ],
            [
                2079,
                2087
            ],
            [
                2097,
                2144
            ],
            [
                2151,
                2168
            ],
            [
                2169,
                2176
            ],
            [
                2177,
                2187
            ],
            [
                2188,
                2226
            ],
            [
                2230,
                2254
            ],
            [
                2259,
                2262
            ],
            [
                2265,
                2270
            ],
            [
                2271,
                2277
            ],
            [
                2277,
                2278
            ],
            [
                2280,
                2299
            ],
            [
                2301,
                2320
            ],
            [
                2329,
                2352
            ],
            [
                2355,
                2368
            ],
            [
                2373,
                2374
            ],
            [
                2376,
                2401
            ],
            [
                2413,
                2414
            ],
            [
                2419,
                2422
            ],
            [
                2423,
                2427
            ],
            [
                2433,
                2435
            ],
            [
                2455,
                2458
            ],
            [
                2468,
                2469
            ],
            [
                2503,
                2504
            ],
            [
                2521,
                2522
            ],
            [
                2567,
                2568
            ],
            [
                2609,
                2610
            ],
            [
                2656,
                2657
            ],
            [
                2684,
                2686
            ],
            [
                2725,
                2726
            ],
            [
                2731,
                2732
            ]
        ],
        "row_chars": [
            [
                0,
                148
            ],
            [
                148,
                398
            ],
            [
                398,
                465
            ],
            [
                465,
                558
            ],
            [
                558,
                883
            ],
            [
                883,
                1045
            ],
            [
                1045,
                1250
            ],
            [
                1250,
                1278
            ],
            [
                1278,
                1550
            ],
            [
                1550,
                1587
            ],
            [
                1587,
                2027
            ],
            [
                2027,
                2404
            ],
            [
                2404,
                2732
            ]
        ]
    }
}