{
    "original": {
        "text": "There are a thousand resolutions, Sir, both in church and state, as well as in matters, Madam, of a more private concern; --which though they have carried all the appearance in the world of being taken, and entered upon in a hasty, hare-brained, and unadvised manner, were, notwithstanding this (and could you or I have got into the cabinet, or stood behind the curtain, we should have found it was so), weighed, poized, and perpended----argued upon--canvassed through----entered into, and examined on all sides with so much coolness, that the GODDESS of COOLNESS herself (I do not take upon me to prove her existence) could neither have wished it, or done it better.\nOf the number of these was my father's resolution of putting me into breeches; which, though determined at once, --in a kind of huff, and a defiance of all mankind, had, nevertheless, been _pro'd_ and _conn'd_, and judicially talked over betwixt him and my mother about a month before, in two several _beds of justice_, which my father had held for that purpose. I shall explain the nature of these beds of justice in my next chapter; and in the chapter following that, you shall step with me, Madam, behind the curtain, only to hear in what kind of manner my father and my mother debated between themselves, this affair of the breeches, --from which you may form an idea, how they debated all lesser matters.",
        "paragraph_chars": [
            [
                0,
                668
            ],
            [
                668,
                1377
            ]
        ],
        "segment_chars": [
            [
                0,
                668
            ],
            [
                668,
                1031
            ],
            [
                1031,
                1377
            ]
        ],
        "overlap_chars": [
            [
                0,
                78
            ],
            [
                105,
                112
            ],
            [
                86,
                87
            ],
            [
                124,
                129
            ],
            [
                93,
                94
            ],
            [
                130,
                146
            ],
            [
                159,
                173
            ],
            [
                187,
                201
            ],
            [
                220,
                244
            ],
            [
                260,
                273
            ],
            [
                201,
                202
            ],
            [
                404,
                411
            ],
            [
                207,
                214
            ],
            [
                480,
                571
            ],
            [
                300,
                305
            ],
            [
                578,
                581
            ],
            [
                315,
                319
            ],
            [
                652,
                668
            ],
            [
                682,
                760
            ],
            [
                783,
                787
            ],
            [
                796,
                856
            ],
            [
                883,
                960
            ],
            [
                975,
                985
            ],
            [
                986,
                1007
            ],
            [
                1013,
                1030
            ],
            [
                1031,
                1188
            ],
            [
                1194,
                1201
            ],
            [
                1225,
                1256
            ],
            [
                1277,
                1304
            ],
            [
                1308,
                1339
            ],
            [
                1215,
                1217
            ],
            [
                1341,
                1377
            ]
        ],
        "row_chars": [
            [
                0,
                668
            ],
            [
                668,
                1031
            ],
            [
                1031,
                1377
            ]
        ]
    },
    "abridged": {
        "text": "There are a thousand resolutions, Sir, both in church and state, as well as in private concerns, which, though they have the appearance of being taken in a hasty, hare-brained manner, were, however, weighed - argued about - entered into, and examined on all sides with so much coolness, that the Goddess of Coolness herself could not have done it better.\nOne of these was my father's resolution of putting me into breeches; which, though decided in a huff, and a defiance of all mankind, had, nevertheless, been judicially talked over betwixt him and my mother about a month before, in two different beds of justice, which my father had for that purpose.\nI shall explain the nature of these beds of justice in my next chapter; and in the chapter following that, you shall step with me, Madam, behind the curtain, to hear how my father and my mother debated this affair of the breeches - from which you may form an idea of how they debated all lesser matters.",
        "paragraph_chars": [
            [
                0,
                355
            ],
            [
                355,
                655
            ],
            [
                655,
                958
            ]
        ],
        "segment_chars": [
            [
                0,
                355
            ],
            [
                355,
                655
            ],
            [
                655,
                958
            ]
        ],
        "overlap_chars": [
            [
                0,
                78
            ],
            [
                79,
                86
            ],
            [
                95,
                96
            ],
            [
                97,
                102
            ],
            [
                102,
                103
            ],
            [
                104,
                120
            ],
            [
                121,
                135
            ],
            [
                136,
                150
            ],
            [
                151,
                175
            ],
            [
                176,
                189
            ],
            [
                197,
                198
            ],
            [
                199,
                206
            ],
            [
                224,
                231
            ],
            [
                232,
                323
            ],
            [
                324,
                329
            ],
            [
                330,
                333
            ],
            [
                334,
                338
            ],
            [
                339,
                355
            ],
            [
                359,
                437
            ],
            [
                446,
                450
            ],
            [
                451,
                511
            ],
            [
                512,
                589
            ],
            [
                605,
                615
            ],
            [
                615,
                636
            ],
            [
                637,
                654
            ],
            [
                655,
                812
            ],
            [
                813,
                820
            ],
            [
                825,
                856
            ],
            [
                857,
                884
            ],
            [
                887,
                918
            ],
            [
                919,
                921
            ],
            [
                922,
                958
            ]
        ],
        "row_chars": [
            [
                0,
                355
            ],
            [
                355,
                655
            ],
            [
                655,
                958
            ]
        ]
    }
}