{
    "original": {
        "text": "The ancient _Goths_ of _Germany_, who (the learned _Cluverius_ is positive) were first seated in the country between the _Vistula_ and the _Oder_, and who afterwards incorporated the _Herculi_, the _Bugians_, and some other _Vandallick_ clans to 'em--had all of them a wise custom of debating everything of importance to their state, twice; that is, --once drunk, and once sober: ----Drunk, --that their councils might not want vigour; ----and sober--that they might not want discretion.\nNow my father being entirely a water-drinker, --was a long time gravelled almost to death, in turning this as much to his advantage, as he did every other thing which the ancients did or said; and it was not till the seventh year of his marriage, after a thousand fruitless experiments and devices, that he hit upon an expedient which answered the purpose; ----and that was, when any difficult and momentous point was to be settled in the family, which required great sobriety, and great spirit too, in its determination, ----he fixed and set apart the first _Sunday_ night in the month, and the _Saturday_ night which immediately preceded it, to argue it over, in bed, with my mother: By which contrivance, if you consider, Sir, with yourself, * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *\nThese my father, humorously enough, called his _beds of justice_; ----for from the two different counsels taken in these two different humours, a middle one was generally found out which touched the point of wisdom as well, as if he had got drunk and sober a hundred times.\nIt must not be made a secret of to the world, that this answers full as well in literary discussions, as either in military or conjugal; but it is not every author that can try the experiment as the _Goths_ and _Vandals_ did it----or, if he can, may it be always for his body's health; and to do it, as my father did it, --am I sure it would be always for his soul's.\nMy way is this:----\nIn all nice and ticklish discussions--(of which, heaven knows, there are but too many in my book), --where I find I cannot take a step without the danger of having either their worships or their reverences upon my back ----I write one-half _full_, --and t'other _fasting_; ----or write it all full, --and correct it fasting: ----or write it fasting, --and correct it full, for they all come to the same thing: ----So that with a less variation from my father's plan, than my father's from the _Gothick_ ----I feel myself upon a par with him in his first bed of justice, --and no way inferior to him in his second. ----These different and almost irreconcileable effects, flow uniformly from the wise and wonderful mechanism of nature, --of which, --be her's the honour. ----All that we can do, is to turn and work the machine to the improvement and better manufactory of the arts and sciences.----\nNow, when I write full, --I write as if I was never to write fasting again as long as I live; ----that is, I write free from the cares as well as the terrors of the world. ----I count not the number of my scars, --nor does my fancy go forth into dark entries and bye-corners to antedate my stabs. ----In a word, my pen takes its course; and I write on as much from the fulness of my heart, as my stomach.----\nBut when, an' please your honours, I indite fasting, 'tis a different history. ----I pay the world all possible attention and respect, --and have as great a share (whilst it lasts) of that under-strapping virtue of discretion as the best of you. ----So that betwixt both, I write a careless kind of a civil, nonsensical, good-humoured _Shandean_ book, which will do all your hearts good------\n----And all your heads too, --provided you understand it.",
        "paragraph_chars": [
            [
                0,
                488
            ],
            [
                488,
                1301
            ],
            [
                1301,
                1575
            ],
            [
                1575,
                1943
            ],
            [
                1943,
                1963
            ],
            [
                1963,
                2860
            ],
            [
                2860,
                3269
            ],
            [
                3269,
                3662
            ],
            [
                3662,
                3719
            ]
        ],
        "segment_chars": [
            [
                0,
                488
            ],
            [
                488,
                1301
            ],
            [
                1301,
                1575
            ],
            [
                1575,
                1943
            ],
            [
                1943,
                1963
            ],
            [
                1963,
                2577
            ],
            [
                2577,
                2732
            ],
            [
                2732,
                2860
            ],
            [
                2860,
                3032
            ],
            [
                3032,
                3157
            ],
            [
                3157,
                3269
            ],
            [
                3269,
                3348
            ],
            [
                3348,
                3515
            ],
            [
                3515,
                3662
            ],
            [
                3662,
                3719
            ]
        ],
        "overlap_chars": [
            [
                0,
                11
            ],
            [
                13,
                18
            ],
            [
                20,
                22
            ],
            [
                32,
                50
            ],
            [
                52,
                61
            ],
            [
                74,
                86
            ],
            [
                109,
                120
            ],
            [
                122,
                129
            ],
            [
                131,
                138
            ],
            [
                145,
                146
            ],
            [
                251,
                254
            ],
            [
                267,
                317
            ],
            [
                334,
                349
            ],
            [
                352,
                378
            ],
            [
                192,
                193
            ],
            [
                393,
                418
            ],
            [
                428,
                435
            ],
            [
                440,
                449
            ],
            [
                207,
                208
            ],
            [
                451,
                466
            ],
            [
                476,
                488
            ],
            [
                488,
                533
            ],
            [
                536,
                539
            ],
            [
                540,
                551
            ],
            [
                569,
                571
            ],
            [
                590,
                594
            ],
            [
                603,
                773
            ],
            [
                785,
                803
            ],
            [
                817,
                843
            ],
            [
                853,
                919
            ],
            [
                933,
                986
            ],
            [
                1014,
                1046
            ],
            [
                1052,
                1054
            ],
            [
                1056,
                1083
            ],
            [
                1085,
                1093
            ],
            [
                1095,
                1100
            ],
            [
                1107,
                1118
            ],
            [
                1128,
                1148
            ],
            [
                1150,
                1172
            ],
            [
                1174,
                1176
            ],
            [
                1183,
                1217
            ],
            [
                923,
                926
            ],
            [
                579,
                581
            ],
            [
                1231,
                1282
            ],
            [
                1301,
                1347
            ],
            [
                1349,
                1364
            ],
            [
                1371,
                1435
            ],
            [
                1443,
                1477
            ],
            [
                1482,
                1487
            ],
            [
                1516,
                1518
            ],
            [
                1509,
                1515
            ],
            [
                1525,
                1574
            ],
            [
                1626,
                1630
            ],
            [
                1631,
                1679
            ],
            [
                1687,
                1689
            ],
            [
                1702,
                1773
            ],
            [
                1775,
                1780
            ],
            [
                1796,
                1802
            ],
            [
                1941,
                1942
            ],
            [
                1943,
                1958
            ],
            [
                1963,
                1965
            ],
            [
                1975,
                1999
            ],
            [
                2001,
                2035
            ],
            [
                1966,
                1969
            ],
            [
                2040,
                2059
            ],
            [
                2064,
                2126
            ],
            [
                2169,
                2181
            ],
            [
                2186,
                2202
            ],
            [
                2204,
                2208
            ],
            [
                2209,
                2210
            ],
            [
                2213,
                2224
            ],
            [
                2234,
                2235
            ],
            [
                2240,
                2261
            ],
            [
                2264,
                2286
            ],
            [
                2311,
                2312
            ],
            [
                2149,
                2151
            ],
            [
                2334,
                2344
            ],
            [
                2349,
                2371
            ],
            [
                2377,
                2379
            ],
            [
                2470,
                2499
            ],
            [
                2412,
                2421
            ],
            [
                2504,
                2532
            ],
            [
                2535,
                2576
            ],
            [
                2860,
                2883
            ],
            [
                2967,
                2994
            ],
            [
                3010,
                3032
            ],
            [
                3036,
                3047
            ],
            [
                3062,
                3070
            ],
            [
                3074,
                3110
            ],
            [
                3155,
                3157
            ],
            [
                3161,
                3171
            ],
            [
                3201,
                3208
            ],
            [
                3212,
                3228
            ],
            [
                3232,
                3264
            ],
            [
                3269,
                3277
            ],
            [
                3304,
                3305
            ],
            [
                3313,
                3338
            ],
            [
                3346,
                3348
            ],
            [
                3352,
                3402
            ],
            [
                3463,
                3464
            ],
            [
                3519,
                3603
            ],
            [
                3605,
                3613
            ],
            [
                3615,
                3655
            ],
            [
                3666,
                3669
            ],
            [
                3674,
                3689
            ],
            [
                3692,
                3719
            ]
        ],
        "row_chars": [
            [
                0,
                488
            ],
            [
                488,
                1301
            ],
            [
                1301,
                1575
            ],
            [
                1575,
                1943
            ],
            [
                1943,
                1963
            ],
            [
                1963,
                2577
            ],
            [
                2577,
                2732
            ],
            [
                2732,
                2860
            ],
            [
                2860,
                3032
            ],
            [
                3032,
                3157
            ],
            [
                3157,
                3269
            ],
            [
                3269,
                3348
            ],
            [
                3348,
                3662
            ],
            [
                3662,
                3719
            ]
        ]
    },
    "abridged": {
        "text": "The ancient Goths of Germany, who (the learned Cluverius says) were first settled between the Vistula and the Oder, had a wise custom of debating everything of importance twice; that is, once drunk, and once sober. - Drunk, so that their councils might have vigour; - and sober, so that they might have discretion.\nNow my father being entirely a water-drinker, was for a long time perplexed how to turn this to his advantage, as he did every other thing which the ancients did or said; and it was not till the seventh year of his marriage, after a thousand fruitless experiments, that he hit upon a method which answered the purpose.\nThat was, when any difficult and momentous point was to be settled, which required great sobriety, and great spirit too - he fixed and set apart the first Sunday night in the month, and the Saturday night immediately before it, to argue it over in bed, with my mother. By this contrivance, if you consider, Sir, the significance of these days in my first volume, * * * * * * * * * * * * * * * * * * * * * * * * *\nThese my father, humorously enough, called his 'beds of justice'; for from the two different counsels taken in these two different moods, a middle one was generally found which was as near wisdom as if he had got drunk and sober a hundred times. This method answers full as well in literary discussions, as in conjugal; but it is not every author that can try the experiment as the Goths did it. My way is this:\nIn delicate and ticklish discussions (of which, heaven knows, there are all too many in my book) - where I find I cannot take a step without the danger of having someone upon my back - I write one-half full, and t'other half hungry; or write it all full, and correct it fasting, or vice versa, for they come to the same thing. So I feel myself upon a par with my father in his first bed of justice, and no way inferior to him in his second.\nNow, when I write full, I write free from the cares and terrors of the world. I count not my scars; nor does my fancy go forth into dark corners. In a word, I write as much from the fullness of my heart, as my stomach.\nBut when I am fasting, 'tis a different story. I pay the world all possible attention and respect - so that betwixt both, I write a careless kind of a civil, nonsensical, good-humoured Shandean book, which will do all your hearts good-\n- And your heads too, provided you understand it.",
        "paragraph_chars": [
            [
                0,
                315
            ],
            [
                315,
                634
            ],
            [
                634,
                1047
            ],
            [
                1047,
                1459
            ],
            [
                1459,
                1900
            ],
            [
                1900,
                2119
            ],
            [
                2119,
                2355
            ],
            [
                2355,
                2404
            ]
        ],
        "segment_chars": [
            [
                0,
                215
            ],
            [
                215,
                315
            ],
            [
                315,
                634
            ],
            [
                634,
                903
            ],
            [
                903,
                1047
            ],
            [
                1047,
                1293
            ],
            [
                1293,
                1443
            ],
            [
                1443,
                1459
            ],
            [
                1459,
                1786
            ],
            [
                1786,
                1900
            ],
            [
                1900,
                1978
            ],
            [
                1978,
                2046
            ],
            [
                2046,
                2119
            ],
            [
                2119,
                2166
            ],
            [
                2166,
                2355
            ],
            [
                2355,
                2404
            ]
        ],
        "overlap_chars": [
            [
                0,
                11
            ],
            [
                12,
                17
            ],
            [
                18,
                20
            ],
            [
                28,
                46
            ],
            [
                47,
                56
            ],
            [
                61,
                73
            ],
            [
                82,
                93
            ],
            [
                94,
                101
            ],
            [
                102,
                109
            ],
            [
                114,
                115
            ],
            [
                116,
                119
            ],
            [
                120,
                170
            ],
            [
                171,
                186
            ],
            [
                187,
                213
            ],
            [
                222,
                223
            ],
            [
                227,
                252
            ],
            [
                258,
                265
            ],
            [
                268,
                277
            ],
            [
                277,
                278
            ],
            [
                282,
                297
            ],
            [
                303,
                315
            ],
            [
                315,
                360
            ],
            [
                361,
                364
            ],
            [
                369,
                380
            ],
            [
                395,
                397
            ],
            [
                403,
                407
            ],
            [
                408,
                578
            ],
            [
                578,
                596
            ],
            [
                606,
                632
            ],
            [
                634,
                700
            ],
            [
                700,
                753
            ],
            [
                756,
                788
            ],
            [
                793,
                795
            ],
            [
                796,
                823
            ],
            [
                824,
                832
            ],
            [
                833,
                838
            ],
            [
                839,
                850
            ],
            [
                858,
                878
            ],
            [
                879,
                901
            ],
            [
                903,
                905
            ],
            [
                911,
                945
            ],
            [
                946,
                949
            ],
            [
                977,
                979
            ],
            [
                995,
                1046
            ],
            [
                1047,
                1093
            ],
            [
                1095,
                1110
            ],
            [
                1113,
                1177
            ],
            [
                1183,
                1217
            ],
            [
                1218,
                1223
            ],
            [
                1228,
                1230
            ],
            [
                1236,
                1242
            ],
            [
                1243,
                1292
            ],
            [
                1293,
                1297
            ],
            [
                1305,
                1353
            ],
            [
                1354,
                1356
            ],
            [
                1357,
                1428
            ],
            [
                1429,
                1434
            ],
            [
                1435,
                1441
            ],
            [
                1441,
                1442
            ],
            [
                1443,
                1458
            ],
            [
                1459,
                1461
            ],
            [
                1471,
                1495
            ],
            [
                1496,
                1530
            ],
            [
                1531,
                1534
            ],
            [
                1535,
                1554
            ],
            [
                1558,
                1620
            ],
            [
                1629,
                1641
            ],
            [
                1644,
                1660
            ],
            [
                1661,
                1665
            ],
            [
                1665,
                1666
            ],
            [
                1667,
                1678
            ],
            [
                1690,
                1691
            ],
            [
                1692,
                1713
            ],
            [
                1714,
                1736
            ],
            [
                1736,
                1737
            ],
            [
                1738,
                1740
            ],
            [
                1751,
                1761
            ],
            [
                1762,
                1784
            ],
            [
                1786,
                1788
            ],
            [
                1789,
                1818
            ],
            [
                1819,
                1828
            ],
            [
                1829,
                1857
            ],
            [
                1858,
                1899
            ],
            [
                1900,
                1923
            ],
            [
                1924,
                1951
            ],
            [
                1956,
                1978
            ],
            [
                1978,
                1989
            ],
            [
                1990,
                1998
            ],
            [
                2000,
                2036
            ],
            [
                2044,
                2046
            ],
            [
                2046,
                2056
            ],
            [
                2057,
                2064
            ],
            [
                2065,
                2081
            ],
            [
                2086,
                2118
            ],
            [
                2119,
                2127
            ],
            [
                2128,
                2129
            ],
            [
                2133,
                2158
            ],
            [
                2164,
                2166
            ],
            [
                2166,
                2216
            ],
            [
                2217,
                2218
            ],
            [
                2219,
                2303
            ],
            [
                2304,
                2312
            ],
            [
                2313,
                2353
            ],
            [
                2357,
                2360
            ],
            [
                2361,
                2376
            ],
            [
                2377,
                2404
            ]
        ],
        "row_chars": [
            [
                0,
                315
            ],
            [
                315,
                1047
            ],
            [
                1047,
                1293
            ],
            [
                1293,
                1443
            ],
            [
                1443,
                1459
            ],
            [
                1459,
                1900
            ],
            [
                1900,
                1900
            ],
            [
                1900,
                1900
            ],
            [
                1900,
                1978
            ],
            [
                1978,
                2046
            ],
            [
                2046,
                2119
            ],
            [
                2119,
                2166
            ],
            [
                2166,
                2355
            ],
            [
                2355,
                2404
            ]
        ]
    }
}