{
    "original": {
        "text": "When the town, with its works, was finished, my uncle _Toby_ and the corporal began to run their first parallel----not at random, or any how----but from the same points and distances the allies had begun to run theirs; and regulating their approaches and attacks, by the accounts my uncle _Toby_ received from the daily papers, --they went on, during the whole siege, step by step with the allies.\nWhen the duke of _Marlborough_ made a lodgment, ----my uncle _Toby_ made a lodgment too, ----And when the face of a bastion was battered down, or a defence ruined, --the corporal took his mattock and did as much, --and so on; ----gaining ground, and making themselves masters of the works one after another, till the town fell into their hands.\nTo one who took pleasure in the happy state of others, --there could not have been a greater sight in the world, than, on a post-morning, in which a practicable breach had been made by the duke of _Marlborough_, in the main body of the place, --to have stood behind the horn-beam hedge, and observed the spirit with which my uncle _Toby_, with _Trim_ behind him, sallied forth; ----the one with the _Gazette_ in his hand, --the other with a spade on his shoulder to execute the contents. ----What an honest triumph in my uncle _Toby's_ looks as he marched up to the ramparts! What intense pleasure swimming in his eye as he stood over the corporal, reading the paragraph ten times over to him, as he was at work, lest, peradventure, he should make the breach an inch too wide, --or leave it an inch too narrow. ----But when the _chamade_ was beat, and the corporal helped my uncle up it, and followed with the colours in his hand, to fix them upon the ramparts --Heaven! Earth! Sea! ----but what avails apostrophes? ----with all your elements, wet or dry, ye never compounded so intoxicating a draught.\nIn this track of happiness for many years, without one interruption to it, except now and then when the wind continued to blow due west for a week or ten days together, which detained the _Flanders_ mail, and kept them so long in torture, --but still 'twas the torture of the happy ----In this track, I say, did my uncle _Toby_ and _Trim_ move for many years, every year of which, and sometimes every month, from the invention of either the one or the other of them, adding some new conceit or quirk of improvement to their operations, which always opened fresh springs of delight in carrying them on.\nThe first year's campaign was carried on from beginning to end, in the plain and simple method I've related.\nIn the second year, in which my uncle _Toby_ took _Liege_ and _Ruremond_, he thought he might afford the expence of four handsome draw-bridges, of two of which I have given an exact description in the former part of my work.\nAt the latter end of the same year he added a couple of gates with portcullises: ----These last were converted afterwards into orgues, as the better thing; and during the winter of the same year, my uncle _Toby_, instead of a new suit of clothes, which he always had at _Christmas_, treated himself with a handsome sentry-box, to stand at the corner of the bowling-green, betwixt which point and the foot of the glacis, there was left a little kind of an esplanade for him and the corporal to confer and hold councils of war upon.\n----The sentry-box was in case of rain.\nAll these were painted white three times over the ensuing spring, which enabled my uncle _Toby_ to take the field with great splendour.\nMy father would often say to _Yorick_, that if any mortal in the whole universe had done such a thing, except his brother _Toby_, it would have been looked upon by the world as one of the most refined satires upon the parade and prancing manner in which _Lewis_ XIV. from the beginning of the war, but particularly that very year, had taken the field ----But 'tis not my brother _Toby's_ nature, kind soul! my father would add, to insult any one.\n----But let us go on.",
        "paragraph_chars": [
            [
                0,
                398
            ],
            [
                398,
                743
            ],
            [
                743,
                1846
            ],
            [
                1846,
                2448
            ],
            [
                2448,
                2557
            ],
            [
                2557,
                2782
            ],
            [
                2782,
                3313
            ],
            [
                3313,
                3353
            ],
            [
                3353,
                3489
            ],
            [
                3489,
                3936
            ],
            [
                3936,
                3957
            ]
        ],
        "segment_chars": [
            [
                0,
                398
            ],
            [
                398,
                743
            ],
            [
                743,
                1231
            ],
            [
                1231,
                1319
            ],
            [
                1319,
                1554
            ],
            [
                1554,
                1714
            ],
            [
                1714,
                1721
            ],
            [
                1721,
                1726
            ],
            [
                1726,
                1759
            ],
            [
                1759,
                1846
            ],
            [
                1846,
                2448
            ],
            [
                2448,
                2557
            ],
            [
                2557,
                2782
            ],
            [
                2782,
                3313
            ],
            [
                3313,
                3353
            ],
            [
                3353,
                3489
            ],
            [
                3489,
                3756
            ],
            [
                3756,
                3896
            ],
            [
                3896,
                3936
            ],
            [
                3936,
                3957
            ]
        ],
        "overlap_chars": [
            [
                0,
                53
            ],
            [
                204,
                206
            ],
            [
                264,
                266
            ],
            [
                61,
                111
            ],
            [
                148,
                168
            ],
            [
                183,
                193
            ],
            [
                211,
                222
            ],
            [
                267,
                279
            ],
            [
                310,
                327
            ],
            [
                330,
                398
            ],
            [
                398,
                414
            ],
            [
                416,
                427
            ],
            [
                429,
                445
            ],
            [
                450,
                458
            ],
            [
                466,
                470
            ],
            [
                687,
                690
            ],
            [
                482,
                485
            ],
            [
                491,
                499
            ],
            [
                512,
                561
            ],
            [
                564,
                601
            ],
            [
                500,
                503
            ],
            [
                613,
                623
            ],
            [
                636,
                642
            ],
            [
                677,
                686
            ],
            [
                704,
                743
            ],
            [
                743,
                774
            ],
            [
                787,
                797
            ],
            [
                800,
                860
            ],
            [
                988,
                1017
            ],
            [
                1018,
                1073
            ],
            [
                925,
                927
            ],
            [
                1106,
                1120
            ],
            [
                1125,
                1141
            ],
            [
                1143,
                1150
            ],
            [
                1152,
                1164
            ],
            [
                1167,
                1216
            ],
            [
                1221,
                1230
            ],
            [
                1235,
                1269
            ],
            [
                1275,
                1277
            ],
            [
                1279,
                1319
            ],
            [
                1319,
                1413
            ],
            [
                1429,
                1435
            ],
            [
                1440,
                1442
            ],
            [
                1552,
                1554
            ],
            [
                1558,
                1566
            ],
            [
                1706,
                1708
            ],
            [
                1567,
                1570
            ],
            [
                1576,
                1579
            ],
            [
                1589,
                1590
            ],
            [
                1644,
                1703
            ],
            [
                1712,
                1714
            ],
            [
                1714,
                1721
            ],
            [
                1721,
                1726
            ],
            [
                1791,
                1807
            ],
            [
                1819,
                1846
            ],
            [
                1846,
                1853
            ],
            [
                1854,
                1859
            ],
            [
                1873,
                1896
            ],
            [
                1901,
                1913
            ],
            [
                1919,
                1949
            ],
            [
                1977,
                1981
            ],
            [
                1950,
                1954
            ],
            [
                2021,
                2033
            ],
            [
                2045,
                2064
            ],
            [
                2073,
                2083
            ],
            [
                2087,
                2127
            ],
            [
                2132,
                2153
            ],
            [
                2158,
                2166
            ],
            [
                1914,
                1916
            ],
            [
                2174,
                2177
            ],
            [
                2190,
                2216
            ],
            [
                2313,
                2324
            ],
            [
                2349,
                2426
            ],
            [
                2446,
                2448
            ],
            [
                2448,
                2488
            ],
            [
                2512,
                2557
            ],
            [
                2557,
                2594
            ],
            [
                2602,
                2606
            ],
            [
                2608,
                2613
            ],
            [
                2615,
                2618
            ],
            [
                2620,
                2628
            ],
            [
                2629,
                2661
            ],
            [
                2670,
                2700
            ],
            [
                2704,
                2723
            ],
            [
                2751,
                2782
            ],
            [
                2782,
                2788
            ],
            [
                2796,
                2861
            ],
            [
                3053,
                3062
            ],
            [
                2993,
                3028
            ],
            [
                3035,
                3037
            ],
            [
                3065,
                3152
            ],
            [
                2861,
                2862
            ],
            [
                3154,
                3161
            ],
            [
                2938,
                2941
            ],
            [
                3190,
                3211
            ],
            [
                3217,
                3225
            ],
            [
                3237,
                3274
            ],
            [
                3286,
                3313
            ],
            [
                3317,
                3353
            ],
            [
                3399,
                3402
            ],
            [
                3411,
                3417
            ],
            [
                3353,
                3381
            ],
            [
                3417,
                3441
            ],
            [
                3449,
                3489
            ],
            [
                3489,
                3517
            ],
            [
                3519,
                3525
            ],
            [
                3526,
                3539
            ],
            [
                3569,
                3610
            ],
            [
                3650,
                3652
            ],
            [
                3617,
                3649
            ],
            [
                3663,
                3665
            ],
            [
                3682,
                3689
            ],
            [
                3698,
                3706
            ],
            [
                3718,
                3742
            ],
            [
                3747,
                3749
            ],
            [
                3751,
                3754
            ],
            [
                3550,
                3553
            ],
            [
                3754,
                3755
            ],
            [
                3844,
                3867
            ],
            [
                3873,
                3875
            ],
            [
                3877,
                3894
            ],
            [
                3896,
                3916
            ],
            [
                3917,
                3934
            ],
            [
                3940,
                3957
            ]
        ],
        "row_chars": [
            [
                0,
                398
            ],
            [
                398,
                743
            ],
            [
                743,
                1231
            ],
            [
                1231,
                1319
            ],
            [
                1319,
                1554
            ],
            [
                1554,
                1714
            ],
            [
                1714,
                1721
            ],
            [
                1721,
                1726
            ],
            [
                1726,
                1759
            ],
            [
                1759,
                1846
            ],
            [
                1846,
                2448
            ],
            [
                2448,
                2557
            ],
            [
                2557,
                2782
            ],
            [
                2782,
                3313
            ],
            [
                3313,
                3353
            ],
            [
                3353,
                3489
            ],
            [
                3489,
                3756
            ],
            [
                3756,
                3896
            ],
            [
                3896,
                3936
            ],
            [
                3936,
                3957
            ]
        ]
    },
    "abridged": {
        "text": "When the town, with its works, was finished, my uncle Toby and the corporal began to run their first parallel from the same points as the allies ran theirs; and following the accounts in the daily papers, they went on, during the whole siege, step by step with the allies.\nWhen the duke of Marlborough made a lodgment, my uncle Toby made one too. And when a bastion was battered down, or a defence ruined, the corporal took his mattock and did the same - and so on; gaining ground over the works, till the town fell into their hands.\nTo one who took pleasure in the happiness of others, there could not have been a greater sight in the world, than to have stood behind the hornbeam hedge, and observed the spirit with which my uncle Toby and Trim sallied forth; the one with the Gazette in his hand, the other with a spade on his shoulder to execute its contents.\nWhat an honest triumph in my uncle Toby's looks as he marched up to the ramparts! What intense pleasure swimming in his eye as he stood over the corporal, reading the paragraph to him while he worked. - But when he mounted the chamade, with the colours in his hand, to fix them upon the ramparts - Heaven! Earth! Sea! wet or dry, ye never made so intoxicating a draught.\nIn this happy track for many years, without interruption, except now and then when the west wind detained the Flanders mail, and kept them in torture - but still 'twas the torture of the happy - in this track, I say, my uncle Toby and Trim moved for many years, every year adding some improvement to their operations, which always opened fresh springs of delight.\nThe first year's campaign was carried on in the plain and simple method I've related.\nIn the second year, in which my uncle Toby took Liege and Ruremond, he thought he might afford the expense of four handsome draw-bridges, two of which I have described in the former part of my work.\nAt the end of the same year he added a couple of gates with portcullises. That Christmas, instead of a new suit of clothes, he treated himself with a handsome sentry-box, to stand at the corner of the bowling-green: betwixt this and the glacis, there was a little esplanade for him and the corporal to hold councils of war upon.\nThe sentry-box was in case of rain.\nThe following spring, all these were painted white, which enabled my uncle Toby to take the field with great splendour.\nMy father would often say to Yorick, that if any man alive had done such a thing, except his brother Toby, it would have been looked upon as a refined satire upon the parading, prancing manner in which Louis XIV had taken the field.\n'But 'tis not my brother Toby's nature, kind soul!' my father would add, 'to insult any one.'\n- But let us go on.",
        "paragraph_chars": [
            [
                0,
                273
            ],
            [
                273,
                534
            ],
            [
                534,
                864
            ],
            [
                864,
                1235
            ],
            [
                1235,
                1599
            ],
            [
                1599,
                1685
            ],
            [
                1685,
                1884
            ],
            [
                1884,
                2213
            ],
            [
                2213,
                2249
            ],
            [
                2249,
                2369
            ],
            [
                2369,
                2602
            ],
            [
                2602,
                2696
            ],
            [
                2696,
                2715
            ]
        ],
        "segment_chars": [
            [
                0,
                273
            ],
            [
                273,
                347
            ],
            [
                347,
                534
            ],
            [
                534,
                864
            ],
            [
                864,
                946
            ],
            [
                946,
                1065
            ],
            [
                1065,
                1170
            ],
            [
                1170,
                1177
            ],
            [
                1177,
                1182
            ],
            [
                1182,
                1235
            ],
            [
                1235,
                1599
            ],
            [
                1599,
                1685
            ],
            [
                1685,
                1884
            ],
            [
                1884,
                1958
            ],
            [
                1958,
                2213
            ],
            [
                2213,
                2249
            ],
            [
                2249,
                2369
            ],
            [
                2369,
                2602
            ],
            [
                2602,
                2654
            ],
            [
                2654,
                2696
            ],
            [
                2696,
                2715
            ]
        ],
        "overlap_chars": [
            [
                0,
                53
            ],
            [
                54,
                56
            ],
            [
                56,
                58
            ],
            [
                59,
                109
            ],
            [
                110,
                130
            ],
            [
                134,
                144
            ],
            [
                149,
                160
            ],
            [
                171,
                183
            ],
            [
                187,
                204
            ],
            [
                205,
                273
            ],
            [
                273,
                289
            ],
            [
                290,
                301
            ],
            [
                302,
                318
            ],
            [
                319,
                327
            ],
            [
                333,
                337
            ],
            [
                338,
                341
            ],
            [
                342,
                345
            ],
            [
                347,
                355
            ],
            [
                356,
                405
            ],
            [
                406,
                443
            ],
            [
                444,
                447
            ],
            [
                455,
                465
            ],
            [
                474,
                480
            ],
            [
                486,
                495
            ],
            [
                495,
                534
            ],
            [
                534,
                565
            ],
            [
                576,
                586
            ],
            [
                587,
                647
            ],
            [
                648,
                677
            ],
            [
                677,
                732
            ],
            [
                735,
                737
            ],
            [
                747,
                761
            ],
            [
                762,
                778
            ],
            [
                779,
                786
            ],
            [
                787,
                799
            ],
            [
                800,
                849
            ],
            [
                854,
                863
            ],
            [
                864,
                898
            ],
            [
                903,
                905
            ],
            [
                906,
                946
            ],
            [
                946,
                1040
            ],
            [
                1041,
                1047
            ],
            [
                1054,
                1056
            ],
            [
                1063,
                1065
            ],
            [
                1067,
                1075
            ],
            [
                1076,
                1078
            ],
            [
                1087,
                1090
            ],
            [
                1095,
                1098
            ],
            [
                1098,
                1099
            ],
            [
                1100,
                1159
            ],
            [
                1168,
                1170
            ],
            [
                1170,
                1177
            ],
            [
                1177,
                1182
            ],
            [
                1186,
                1202
            ],
            [
                1208,
                1235
            ],
            [
                1235,
                1242
            ],
            [
                1249,
                1254
            ],
            [
                1255,
                1278
            ],
            [
                1279,
                1291
            ],
            [
                1291,
                1321
            ],
            [
                1322,
                1326
            ],
            [
                1327,
                1331
            ],
            [
                1332,
                1344
            ],
            [
                1354,
                1373
            ],
            [
                1374,
                1384
            ],
            [
                1387,
                1427
            ],
            [
                1430,
                1451
            ],
            [
                1452,
                1460
            ],
            [
                1461,
                1463
            ],
            [
                1466,
                1469
            ],
            [
                1481,
                1507
            ],
            [
                1508,
                1519
            ],
            [
                1520,
                1597
            ],
            [
                1597,
                1599
            ],
            [
                1599,
                1639
            ],
            [
                1640,
                1685
            ],
            [
                1685,
                1722
            ],
            [
                1728,
                1732
            ],
            [
                1733,
                1738
            ],
            [
                1739,
                1742
            ],
            [
                1743,
                1751
            ],
            [
                1751,
                1783
            ],
            [
                1792,
                1822
            ],
            [
                1823,
                1842
            ],
            [
                1853,
                1884
            ],
            [
                1884,
                1890
            ],
            [
                1891,
                1956
            ],
            [
                1963,
                1972
            ],
            [
                1972,
                2007
            ],
            [
                2008,
                2010
            ],
            [
                2011,
                2098
            ],
            [
                2098,
                2099
            ],
            [
                2100,
                2107
            ],
            [
                2113,
                2116
            ],
            [
                2117,
                2138
            ],
            [
                2139,
                2147
            ],
            [
                2148,
                2185
            ],
            [
                2186,
                2213
            ],
            [
                2213,
                2249
            ],
            [
                2249,
                2252
            ],
            [
                2263,
                2269
            ],
            [
                2271,
                2299
            ],
            [
                2299,
                2323
            ],
            [
                2329,
                2369
            ],
            [
                2369,
                2397
            ],
            [
                2398,
                2404
            ],
            [
                2404,
                2417
            ],
            [
                2428,
                2469
            ],
            [
                2472,
                2474
            ],
            [
                2474,
                2506
            ],
            [
                2507,
                2509
            ],
            [
                2512,
                2519
            ],
            [
                2527,
                2535
            ],
            [
                2546,
                2570
            ],
            [
                2574,
                2576
            ],
            [
                2577,
                2580
            ],
            [
                2591,
                2594
            ],
            [
                2600,
                2601
            ],
            [
                2603,
                2626
            ],
            [
                2631,
                2633
            ],
            [
                2634,
                2651
            ],
            [
                2654,
                2674
            ],
            [
                2676,
                2693
            ],
            [
                2698,
                2715
            ]
        ],
        "row_chars": [
            [
                0,
                273
            ],
            [
                273,
                534
            ],
            [
                534,
                864
            ],
            [
                864,
                946
            ],
            [
                946,
                1065
            ],
            [
                1065,
                1170
            ],
            [
                1170,
                1177
            ],
            [
                1177,
                1182
            ],
            [
                1182,
                1182
            ],
            [
                1182,
                1235
            ],
            [
                1235,
                1599
            ],
            [
                1599,
                1685
            ],
            [
                1685,
                1884
            ],
            [
                1884,
                2213
            ],
            [
                2213,
                2249
            ],
            [
                2249,
                2369
            ],
            [
                2369,
                2602
            ],
            [
                2602,
                2654
            ],
            [
                2654,
                2696
            ],
            [
                2696,
                2715
            ]
        ]
    }
}