{
    "original": {
        "text": "The corporal had slipped out about ten minutes before my uncle _Toby_, in order to fix his apparatus, and just give the enemy a shot or two before my uncle _Toby_ came.\nHe had drawn the six field-pieces for this end, all close up together in front of my uncle _Toby's_ sentry-box, leaving only an interval of about a yard and a half betwixt the three, on the right and left, for the convenience of charging, &c. --and the sake possibly of two batteries, which he might think double the honour of one.\nIn the rear and facing this opening, with his back to the door of the sentry-box, for fear of being flanked, had the corporal wisely taken his post: ----He held the ivory pipe, appertaining to the battery on the right, betwixt the finger and thumb of his right hand, --and the ebony pipe tipp'd with silver, which appertained to the battery on the left, betwixt the finger and thumb of the other----and with his right knee fixed firm upon the ground, as if in the front rank of his platoon, was the corporal with his Montero-cap upon his head, furiously playing off his two cross batteries at the same time against the counter-guard, which faced the counter-scarp, where the attack was to be made that morning. His first intention, as I said, was no more than giving the enemy a single puff or two; --but the pleasure of the _puffs_, as well as the _puffing_, had insensibly got hold of the corporal, and drawn him on from puff to puff, into the very height of the attack, by the time my uncle _Toby_ joined him.\n'Twas well for my father, that my uncle _Toby_ had not his will to make that day.",
        "paragraph_chars": [
            [
                0,
                169
            ],
            [
                169,
                501
            ],
            [
                501,
                1514
            ],
            [
                1514,
                1595
            ]
        ],
        "segment_chars": [
            [
                0,
                169
            ],
            [
                169,
                501
            ],
            [
                501,
                1212
            ],
            [
                1212,
                1514
            ],
            [
                1514,
                1595
            ]
        ],
        "overlap_chars": [
            [
                0,
                28
            ],
            [
                35,
                62
            ],
            [
                69,
                70
            ],
            [
                80,
                155
            ],
            [
                163,
                169
            ],
            [
                169,
                202
            ],
            [
                217,
                250
            ],
            [
                418,
                421
            ],
            [
                269,
                288
            ],
            [
                306,
                350
            ],
            [
                352,
                410
            ],
            [
                414,
                417
            ],
            [
                427,
                435
            ],
            [
                439,
                501
            ],
            [
                501,
                528
            ],
            [
                536,
                582
            ],
            [
                614,
                626
            ],
            [
                610,
                613
            ],
            [
                634,
                648
            ],
            [
                654,
                677
            ],
            [
                691,
                767
            ],
            [
                770,
                788
            ],
            [
                807,
                814
            ],
            [
                827,
                854
            ],
            [
                891,
                896
            ],
            [
                904,
                923
            ],
            [
                930,
                991
            ],
            [
                996,
                1008
            ],
            [
                608,
                609
            ],
            [
                1009,
                1044
            ],
            [
                992,
                995
            ],
            [
                1045,
                1074
            ],
            [
                1081,
                1134
            ],
            [
                1166,
                1211
            ],
            [
                1212,
                1299
            ],
            [
                1302,
                1325
            ],
            [
                1327,
                1332
            ],
            [
                1333,
                1349
            ],
            [
                1351,
                1358
            ],
            [
                1359,
                1405
            ],
            [
                1406,
                1494
            ],
            [
                1502,
                1514
            ],
            [
                1514,
                1553
            ],
            [
                1578,
                1580
            ],
            [
                1565,
                1568
            ],
            [
                1569,
                1577
            ],
            [
                1586,
                1595
            ]
        ],
        "row_chars": [
            [
                0,
                169
            ],
            [
                169,
                501
            ],
            [
                501,
                1212
            ],
            [
                1212,
                1514
            ],
            [
                1514,
                1595
            ]
        ]
    },
    "abridged": {
        "text": "The corporal had slipped out ten minutes before my uncle Toby, to fix his apparatus, and just give the enemy a shot or two before my uncle came.\nHe had drawn the six field-pieces all close up together in front of the sentry-box, leaving a gap of about a yard and a half betwixt the three on the right and left, for the convenience of charging, &c., and also possibly to make two batteries, which he might think double the honour of one.\nIn the rear and facing this gap, with his back to the door of the sentry-box, the corporal had taken his post. He held the ivory pipe, leading to the battery on the right, betwixt the finger and thumb of his right hand, and the ebony pipe, which led to the battery on the left, in his other hand. With his right knee firm upon the ground, as if in the front rank of his platoon, the corporal, with his Montero-cap upon his head, was furiously playing off his two batteries at the same time against the counter-guard, where the attack was to be made that morning.\nHis first intention, as I said, was no more than giving the enemy a single puff or two; but the pleasure of the puffs, as well as the puffing, had insensibly got hold of the corporal, and had drawn him on from puff to puff, into the very height of the attack, by the time my uncle Toby joined him.\n'Twas well for my father, that my uncle Toby was not due to write his will that day.",
        "paragraph_chars": [
            [
                0,
                145
            ],
            [
                145,
                437
            ],
            [
                437,
                1000
            ],
            [
                1000,
                1298
            ],
            [
                1298,
                1382
            ]
        ],
        "segment_chars": [
            [
                0,
                145
            ],
            [
                145,
                437
            ],
            [
                437,
                548
            ],
            [
                548,
                734
            ],
            [
                734,
                1000
            ],
            [
                1000,
                1298
            ],
            [
                1298,
                1382
            ]
        ],
        "overlap_chars": [
            [
                0,
                28
            ],
            [
                29,
                56
            ],
            [
                61,
                62
            ],
            [
                63,
                138
            ],
            [
                139,
                145
            ],
            [
                145,
                178
            ],
            [
                179,
                212
            ],
            [
                213,
                216
            ],
            [
                217,
                236
            ],
            [
                243,
                287
            ],
            [
                288,
                346
            ],
            [
                349,
                352
            ],
            [
                358,
                366
            ],
            [
                375,
                437
            ],
            [
                437,
                464
            ],
            [
                468,
                514
            ],
            [
                515,
                527
            ],
            [
                528,
                531
            ],
            [
                532,
                546
            ],
            [
                548,
                571
            ],
            [
                580,
                656
            ],
            [
                657,
                675
            ],
            [
                675,
                682
            ],
            [
                687,
                714
            ],
            [
                722,
                727
            ],
            [
                734,
                753
            ],
            [
                754,
                815
            ],
            [
                816,
                828
            ],
            [
                828,
                829
            ],
            [
                830,
                865
            ],
            [
                866,
                869
            ],
            [
                870,
                899
            ],
            [
                900,
                953
            ],
            [
                954,
                999
            ],
            [
                1000,
                1087
            ],
            [
                1088,
                1111
            ],
            [
                1112,
                1117
            ],
            [
                1117,
                1133
            ],
            [
                1134,
                1141
            ],
            [
                1141,
                1187
            ],
            [
                1192,
                1280
            ],
            [
                1286,
                1298
            ],
            [
                1298,
                1337
            ],
            [
                1338,
                1340
            ],
            [
                1347,
                1350
            ],
            [
                1364,
                1372
            ],
            [
                1373,
                1382
            ]
        ],
        "row_chars": [
            [
                0,
                145
            ],
            [
                145,
                437
            ],
            [
                437,
                1000
            ],
            [
                1000,
                1298
            ],
            [
                1298,
                1382
            ]
        ]
    }
}