{
    "original": {
        "text": "------How could you, Madam, be so inattentive in reading the last chapter? I told you in it, _That my mother was not a papist_. ----Papist! You told me no such thing, Sir. --Madam, I beg leave to repeat it over again, that I told you as plain, at least, as words, by direct inference, could tell you such a thing. --Then, Sir, I must have miss'd a page. --No, Madam, --you have not miss'd a word. ----Then I was asleep, Sir. --My pride, Madam, cannot allow you that refuge. ----Then, I declare, I know nothing at all about the matter. --That, Madam, is the very fault I lay to your charge; and as a punishment for it, I do insist upon it, that you immediately turn back, that is, as soon as you get to the next full stop, and read the whole chapter over again. I have imposed this penance upon the lady, neither out of wantonness nor cruelty; but from the best of motives; and therefore shall make her no apology for it when she returns back: --'Tis to rebuke a vicious taste, which has crept into thousands besides herself, --of reading straight forwards, more in quest of the adventures, than of the deep erudition and knowledge which a book of this cast, if read over as it should be, would infallibly impart with them ----The mind should be accustomed to make wise reflections, and draw curious conclusions as it goes along; the habitude of which made _Pliny_ the younger affirm, \"That he never read a book so bad, but he drew some profit from it.\" The stories of _Greece_ and _Rome_, run over without this turn and application, --do less service, I affirm it, than the history of _Parismus_ and _Parismenus_, or of the Seven Champions of _England_, read with it.\n------But here comes my fair lady. Have you read over again the chapter, Madam, as I desired you? --You have: And did you not observe the passage, upon the second reading, which admits the inference? ----Not a word like it! Then, Madam, be pleased to ponder well the last line but one of the chapter, where I take upon me to say, \"It was _necessary_ I should be born before I was christen'd.\" Had my mother, Madam, been a Papist, that consequence did not follow.[1.1]\nIt is a terrible misfortune for this same book of mine, but more so to the Republick of letters; --so that my own is quite swallowed up in the consideration of it, --that this selfsame vile pruriency for fresh adventures in all things, has got so strongly into our habit and humour, --and so wholly intent are we upon satisfying the impatience of our concupiscence that way, --that nothing but the gross and more carnal parts of a composition will go down: --The subtle hints and sly communications of science fly off, like spirits upwards, ----the heavy moral escapes downwards; and both the one and the other are as much lost to the world, as if they were still left in the bottom of the ink-horn.\nI wish the male-reader has not pass'd by many a one, as quaint and curious as this one, in which the female-reader has been detected. I wish it may have its effects; --and that all good people, both male and female, from her example, may be taught to think as well as read.\nMEMOIRE present Messieurs les Docteurs de SORBONNE[1.2]\n_Un Chirurgien Accoucheur, represente Messieurs les Docteurs de SORBONNE, qu'il y a des cas, quoique trs rares, o une mere ne sauroit accoucher, & mme o l'enfant est tellement renferm dans le sein de sa mere, qu'il ne fait paritre aucune partie de son corps, ce qui seroit un cas, suivant les Rituels, de lui confrer, du moins sous condition, le baptme. Le Chirurgien, qui consulte, prtend, par le moyen d'une _petite canulle_, de pouvoir baptiser immediatement l'enfant, sans faire aucun tort la mere. ----Il demand si ce moyen, qu'il vient de proposer, est permis & lgitime, & s'il peut s'en servir dans les cas qu'il vient d'exposer._\n[Footnote 1.1: The _Romish_ Rituals direct the baptizing of the child, in cases of danger, _before_ it is born; --but upon this proviso, That some part or other of the child's body be seen by the baptizer: ----But the Doctors of the _Sorbonne_, by a deliberation held amongst them, _April_ 10, 1733, --have enlarged the powers of the midwives, by determining, That though no part of the child's body should appear, ----that baptism shall, nevertheless, be administered to it by injection, --_par le moyen d'une petite canulle_, --Anglic _a squirt_. ----'Tis very strange that St. _Thomas Aquinas_, who had so good a mechanical head, both for tying and untying the knots of school-divinity, --should, after so much pains bestowed upon this, --give up the point at last, as a second _La chose impossible_, --\"Infantes in maternis uteris existentes (quoth St. _Thomas!_) baptizari possunt _nullo modo_.\" --O _Thomas!_ _Thomas!_\nIf the reader has the curiosity to see the question upon baptism _by injection_, as presented to the Doctors of the _Sorbonne_, with their consultation thereupon, it is as follows.]\n[Footnote 1.2: Vide Deventer, Paris edit., 4to, 1734, p. 366.]\nREPONSE\n_Le Conseil estime, que la question propose souffre de grandes difficults. Les Thologiens posent d'un ct pour principe, que le baptme, qui est une naissance spirituelle, suppose une premiere naissance; il faut tre n dans le monde, pour renatre en _Jesus Christ_, comme ils l'enseignent. _S. Thomas, 3 part, qust. 88, artic. II_, suit cette doctrine comme une verit constante; l'on ne peut, dit ce S. Docteur, baptiser les enfans qui sont renferms dans le sein de leurs meres, & _S. Thomas_ est fond sur ce, que les enfans ne sont point ns, & ne peuvent tre compts parmi les autres hommes; d'o il conclud, qu'ils ne peuvent tre l'objet d'une action extrieure, pour reevoir par leur ministre, les sacremens ncessaires au salut:_ Pueri in maternis uteris existentes nondum prodierunt in lucem ut cum aliis hominibus vitam ducant; unde non possunt subjici actioni human, ut per eorum ministerium sacramenta recipiant ad salutem. _Les rituels ordonnent dans la pratique ce que les thologiens ont tabli sur les mmes matires, & ils deffendent tous d'une manire uniforme, de baptiser les enfans qui sont renferms dans le sein de leurs meres, s'ils ne font parotre quelque partie de leurs corps. Le concours des thologiens, & des rituels, qui sont les rgles des diocses, paroit former une autorit qui termine la question presente; cependant le conseil de conscience considerant d'un ct, que le raisonnement des thologiens est uniquement fond sur une raison de convenance, & que la deffense des rituels suppose que l'on ne peut baptiser immediatement les enfans ainsi renferms dans le sein de leurs meres, ce qui est contre la supposition presente; & d'un autre ct, considerant que les mmes thologiens enseignent, que l'on peut risquer les sacremens que _Jesus Christ_ a tablis comme des moyens faciles, mais ncessaires pour sanctifier les hommes; & d'ailleurs estimant, que les enfans renferms dans le sein de leurs meres, pourroient tre capables de salut, parcequ'ils sont capables de damnation; --pour ces considerations, & en egard l'expos, suivant lequel on assure avoir trouv un moyen certain de baptiser ces enfans ainsi renferms, sans faire aucun tort la mere, le Conseil estime que l'on pourroit se servir du moyen propos, dans la confiance qu'il a, que Dieu n'a point laiss ces sortes d'enfans sans aucuns secours, & supposant, comme il est expos, que le moyen dont il s'agit est propre leur procurer le baptme; cependant comme il s'agiroit, en autorisant la pratique propose, de changer une regie universellement tablie, le Conseil croit que celui qui consulte doit s'addresser son evque, & qui il appartient de juger de l'utilit, & du danger du moyen propos, & comme, sous le bon plaisir de l'evque, le Conseil estime qu'il faudroit recourir au Pape, qui a le droit d'expliquer les rgles de l'eglise, & d'y droger dans le cas, ou la loi ne sauroit obliger, quelque sage & quelque utile que paroisse la manire de baptiser dont il s'agit, le Conseil ne pourroit l'approuver sans le concours de ces deux autorits. On conseile au moins celui qui consulte, de s'addresser son evque, & de lui faire part de la presente dcision, afin que, si le prelat entre dans les raisons sur lesquelles les docteurs soussigns s'appuyent, il puisse tre autoris dans le cas de ncessit, ou il risqueroit trop d'attendre que la permission ft demande & accorde d'employer le moyen qu'il propose si avantageux au salut de l'enfant. Au reste, le Conseil, en estimant que l'on pourroit s'en servir, croit cependant, que si les enfans dont il s'agit, venoient au monde, contre l'esperance de ceux qui se seroient servis du mme moyen, il seroit ncessaire de les baptiser sous condition; & en cela le Conseil se conforme tous les rituels, qui en autorisant le baptme d'un enfant qui fait parotre quelque partie de son corps, enjoignent nantmoins, & ordonnent de le baptiser sous condition, s'il vient heureusement au monde._\nDeliber en _Sorbonne_, le 10 _Avril_, 1733.\nA. LE MOYNE. L. DE ROMIGNY. DE MARCILLY.\nMr. _Tristram Shandy's_ compliments to Messrs. _Le Moyne_, _De Romigny_, and _De Marcilly_; hopes they all rested well the night after so tiresome a consultation. --He begs to know, whether after the ceremony of marriage, and before that of consummation, the baptizing all the HOMUNCULI at once, slapdash, by _injection_, would not be a shorter and safer cut still; on condition, as above, That if the HOMUNCULI do well, and come safe into the world after this, that each and every of them shall be baptized again (_sous condition_) ----And provided, in the second place, That the thing can be done, which _Mr. Shandy_ apprehends it may, _par le moyen d'une petite canulle_, and _sans faire aucun tort au pere_.",
        "paragraph_chars": [
            [
                0,
                1668
            ],
            [
                1668,
                2136
            ],
            [
                2136,
                2836
            ],
            [
                2836,
                3110
            ],
            [
                3110,
                3166
            ],
            [
                3166,
                3804
            ],
            [
                3804,
                4729
            ],
            [
                4729,
                4911
            ],
            [
                4911,
                4974
            ],
            [
                4974,
                4982
            ],
            [
                4982,
                8878
            ],
            [
                8878,
                8922
            ],
            [
                8922,
                8963
            ],
            [
                8963,
                9674
            ]
        ],
        "segment_chars": [
            [
                0,
                75
            ],
            [
                75,
                128
            ],
            [
                128,
                140
            ],
            [
                140,
                172
            ],
            [
                172,
                314
            ],
            [
                314,
                354
            ],
            [
                354,
                397
            ],
            [
                397,
                425
            ],
            [
                425,
                474
            ],
            [
                474,
                535
            ],
            [
                535,
                761
            ],
            [
                761,
                1453
            ],
            [
                1453,
                1668
            ],
            [
                1668,
                1703
            ],
            [
                1703,
                1766
            ],
            [
                1766,
                1868
            ],
            [
                1868,
                1892
            ],
            [
                1892,
                2061
            ],
            [
                2061,
                2130
            ],
            [
                2130,
                2136
            ],
            [
                2136,
                2836
            ],
            [
                2836,
                2970
            ],
            [
                2970,
                3110
            ],
            [
                3110,
                3166
            ],
            [
                3166,
                3520
            ],
            [
                3520,
                3669
            ],
            [
                3669,
                3804
            ],
            [
                3804,
                4353
            ],
            [
                4353,
                4705
            ],
            [
                4705,
                4729
            ],
            [
                4729,
                4911
            ],
            [
                4911,
                4974
            ],
            [
                4974,
                4982
            ],
            [
                4982,
                5057
            ],
            [
                5057,
                5269
            ],
            [
                5269,
                5907
            ],
            [
                5907,
                6169
            ],
            [
                6169,
                7995
            ],
            [
                7995,
                8390
            ],
            [
                8390,
                8878
            ],
            [
                8878,
                8922
            ],
            [
                8922,
                8925
            ],
            [
                8925,
                8935
            ],
            [
                8935,
                8950
            ],
            [
                8950,
                8963
            ],
            [
                8963,
                9126
            ],
            [
                9126,
                9674
            ]
        ],
        "overlap_chars": [
            [
                6,
                45
            ],
            [
                73,
                75
            ],
            [
                75,
                88
            ],
            [
                91,
                92
            ],
            [
                94,
                125
            ],
            [
                138,
                140
            ],
            [
                140,
                171
            ],
            [
                174,
                182
            ],
            [
                196,
                202
            ],
            [
                218,
                242
            ],
            [
                254,
                262
            ],
            [
                285,
                295
            ],
            [
                312,
                313
            ],
            [
                316,
                320
            ],
            [
                327,
                338
            ],
            [
                346,
                353
            ],
            [
                356,
                366
            ],
            [
                369,
                381
            ],
            [
                389,
                396
            ],
            [
                401,
                424
            ],
            [
                541,
                548
            ],
            [
                568,
                569
            ],
            [
                623,
                629
            ],
            [
                639,
                669
            ],
            [
                720,
                760
            ],
            [
                761,
                803
            ],
            [
                812,
                818
            ],
            [
                834,
                886
            ],
            [
                893,
                912
            ],
            [
                945,
                975
            ],
            [
                977,
                1024
            ],
            [
                1027,
                1037
            ],
            [
                1057,
                1106
            ],
            [
                1121,
                1151
            ],
            [
                1177,
                1183
            ],
            [
                1205,
                1211
            ],
            [
                1226,
                1229
            ],
            [
                1235,
                1280
            ],
            [
                1171,
                1173
            ],
            [
                1423,
                1425
            ],
            [
                1317,
                1321
            ],
            [
                1327,
                1328
            ],
            [
                1333,
                1338
            ],
            [
                1345,
                1355
            ],
            [
                1357,
                1362
            ],
            [
                1364,
                1383
            ],
            [
                1385,
                1417
            ],
            [
                1286,
                1290
            ],
            [
                1431,
                1450
            ],
            [
                1674,
                1703
            ],
            [
                1703,
                1752
            ],
            [
                1764,
                1766
            ],
            [
                1768,
                1813
            ],
            [
                1866,
                1868
            ],
            [
                1892,
                1904
            ],
            [
                1919,
                1952
            ],
            [
                1967,
                1976
            ],
            [
                1993,
                1997
            ],
            [
                1999,
                2005
            ],
            [
                2007,
                2016
            ],
            [
                2018,
                2054
            ],
            [
                2061,
                2114
            ],
            [
                2119,
                2130
            ],
            [
                2851,
                2852
            ],
            [
                4442,
                4445
            ],
            [
                2207,
                2210
            ],
            [
                3824,
                3830
            ],
            [
                3832,
                3855
            ],
            [
                3861,
                3874
            ],
            [
                2296,
                2298
            ],
            [
                2250,
                2252
            ],
            [
                2272,
                2274
            ],
            [
                3887,
                3894
            ],
            [
                3896,
                3902
            ],
            [
                3904,
                3915
            ],
            [
                2407,
                2410
            ],
            [
                4018,
                4036
            ],
            [
                4041,
                4046
            ],
            [
                2984,
                2988
            ],
            [
                4223,
                4235
            ],
            [
                2980,
                2983
            ],
            [
                4257,
                4275
            ],
            [
                2275,
                2278
            ],
            [
                3972,
                3977
            ],
            [
                4279,
                4292
            ],
            [
                4311,
                4329
            ],
            [
                2943,
                2944
            ],
            [
                3956,
                3958
            ],
            [
                2357,
                2359
            ],
            [
                2190,
                2191
            ],
            [
                4342,
                4350
            ],
            [
                2132,
                2133
            ],
            [
                4358,
                4383
            ],
            [
                4385,
                4399
            ],
            [
                4204,
                4210
            ],
            [
                4106,
                4110
            ],
            [
                2307,
                2311
            ],
            [
                2968,
                2969
            ],
            [
                4483,
                4484
            ],
            [
                4310,
                4311
            ],
            [
                4611,
                4649
            ],
            [
                4651,
                4656
            ],
            [
                2298,
                2299
            ],
            [
                4357,
                4358
            ],
            [
                4676,
                4689
            ],
            [
                4691,
                4701
            ],
            [
                4707,
                4708
            ],
            [
                4662,
                4669
            ],
            [
                4710,
                4716
            ],
            [
                2136,
                2172
            ],
            [
                2178,
                2190
            ],
            [
                2889,
                2891
            ],
            [
                2360,
                2363
            ],
            [
                2238,
                2242
            ],
            [
                2595,
                2598
            ],
            [
                2321,
                2325
            ],
            [
                2336,
                2356
            ],
            [
                2372,
                2406
            ],
            [
                3162,
                3163
            ],
            [
                2201,
                2203
            ],
            [
                2435,
                2486
            ],
            [
                2513,
                2543
            ],
            [
                2549,
                2566
            ],
            [
                2584,
                2586
            ],
            [
                3875,
                3877
            ],
            [
                3815,
                3816
            ],
            [
                2599,
                2611
            ],
            [
                2646,
                2653
            ],
            [
                2655,
                2675
            ],
            [
                2231,
                2232
            ],
            [
                2681,
                2724
            ],
            [
                2747,
                2793
            ],
            [
                2800,
                2830
            ],
            [
                2834,
                2836
            ],
            [
                2836,
                2842
            ],
            [
                2302,
                2306
            ],
            [
                3052,
                3056
            ],
            [
                2914,
                2918
            ],
            [
                2852,
                2858
            ],
            [
                3977,
                3979
            ],
            [
                3061,
                3069
            ],
            [
                3013,
                3028
            ],
            [
                3070,
                3110
            ],
            [
                4729,
                4742
            ],
            [
                2903,
                2910
            ],
            [
                4761,
                4793
            ],
            [
                4795,
                4807
            ],
            [
                4808,
                4844
            ],
            [
                4849,
                4854
            ],
            [
                4855,
                4867
            ],
            [
                4881,
                4908
            ],
            [
                4659,
                4660
            ],
            [
                4650,
                4651
            ],
            [
                3809,
                3813
            ],
            [
                2591,
                2592
            ],
            [
                2882,
                2883
            ],
            [
                2725,
                2728
            ],
            [
                3993,
                3999
            ],
            [
                3817,
                3818
            ],
            [
                4670,
                4671
            ],
            [
                3110,
                3160
            ],
            [
                4922,
                4923
            ],
            [
                2130,
                2131
            ],
            [
                4931,
                4974
            ],
            [
                3167,
                3519
            ],
            [
                3520,
                3575
            ],
            [
                3577,
                3591
            ],
            [
                3592,
                3668
            ],
            [
                3673,
                3801
            ],
            [
                4008,
                4009
            ],
            [
                4052,
                4053
            ],
            [
                3985,
                3987
            ],
            [
                4000,
                4004
            ],
            [
                2977,
                2979
            ],
            [
                2922,
                2926
            ],
            [
                3878,
                3883
            ],
            [
                4047,
                4051
            ],
            [
                2221,
                2223
            ],
            [
                4418,
                4419
            ],
            [
                4983,
                5057
            ],
            [
                5057,
                5228
            ],
            [
                5230,
                5242
            ],
            [
                5243,
                5269
            ],
            [
                5270,
                5308
            ],
            [
                5309,
                5459
            ],
            [
                5461,
                5470
            ],
            [
                5472,
                5707
            ],
            [
                5709,
                5907
            ],
            [
                5908,
                6169
            ],
            [
                6169,
                6725
            ],
            [
                6727,
                6739
            ],
            [
                6741,
                6969
            ],
            [
                6972,
                7995
            ],
            [
                7995,
                8389
            ],
            [
                8572,
                8574
            ],
            [
                8458,
                8460
            ],
            [
                8616,
                8620
            ],
            [
                8398,
                8399
            ],
            [
                8502,
                8504
            ],
            [
                8890,
                8898
            ],
            [
                8899,
                8906
            ],
            [
                8908,
                8913
            ],
            [
                8914,
                8922
            ],
            [
                8922,
                8925
            ],
            [
                8925,
                8934
            ],
            [
                8935,
                8949
            ],
            [
                8950,
                8963
            ],
            [
                8963,
                8966
            ],
            [
                8973,
                8985
            ],
            [
                8987,
                9009
            ],
            [
                9011,
                9019
            ],
            [
                9020,
                9021
            ],
            [
                9023,
                9033
            ],
            [
                9034,
                9039
            ],
            [
                9041,
                9052
            ],
            [
                9053,
                9054
            ],
            [
                9055,
                9065
            ],
            [
                9070,
                9126
            ],
            [
                9128,
                9143
            ],
            [
                9145,
                9231
            ],
            [
                9445,
                9447
            ],
            [
                9232,
                9271
            ],
            [
                9283,
                9328
            ],
            [
                9358,
                9360
            ],
            [
                9388,
                9424
            ],
            [
                9453,
                9476
            ],
            [
                9504,
                9512
            ],
            [
                9535,
                9568
            ],
            [
                9572,
                9580
            ],
            [
                9593,
                9600
            ],
            [
                9602,
                9635
            ],
            [
                9382,
                9387
            ],
            [
                9648,
                9672
            ],
            [
                9636,
                9641
            ],
            [
                9361,
                9364
            ]
        ],
        "row_chars": [
            [
                0,
                75
            ],
            [
                75,
                128
            ],
            [
                128,
                140
            ],
            [
                140,
                172
            ],
            [
                172,
                314
            ],
            [
                314,
                354
            ],
            [
                354,
                397
            ],
            [
                397,
                425
            ],
            [
                425,
                474
            ],
            [
                474,
                535
            ],
            [
                535,
                761
            ],
            [
                761,
                1453
            ],
            [
                1453,
                1668
            ],
            [
                1668,
                1703
            ],
            [
                1703,
                1766
            ],
            [
                1766,
                1868
            ],
            [
                1868,
                1892
            ],
            [
                1892,
                2061
            ],
            [
                2061,
                2130
            ],
            [
                2130,
                4974
            ],
            [
                4974,
                4982
            ],
            [
                4982,
                5057
            ],
            [
                5057,
                5269
            ],
            [
                5269,
                5907
            ],
            [
                5907,
                6169
            ],
            [
                6169,
                7995
            ],
            [
                7995,
                8878
            ],
            [
                8878,
                8922
            ],
            [
                8922,
                8925
            ],
            [
                8925,
                8935
            ],
            [
                8935,
                8950
            ],
            [
                8950,
                8963
            ],
            [
                8963,
                9126
            ],
            [
                9126,
                9674
            ]
        ]
    },
    "abridged": {
        "text": "How could you, Madam, be so inattentive? I told you in that last chapter, that my mother was not a papist.\n- Papist! You told me no such thing, Sir.\n- Madam, I repeat that I told you as plain as words could tell.\n- Then I must have missed a page.\n- No, Madam, you have not missed a word.\n- Then I was asleep, Sir.\n- No, Madam. I insist that you immediately turn back, and read the whole chapter over again.\nI have imposed this penance upon the lady, not out of cruelty; but from the best of motives; and therefore make her no apology. 'Tis to rebuke a vicious taste which has crept into thousands besides herself, of reading more in quest of the adventures, than of the deep knowledge which a book of this type should impart. The reader should be accustomed to make wise reflections as he goes; a habit which made Pliny the younger affirm, 'That he never read a book so bad that he could not draw some profit from it.'\nBut here comes my fair lady. - Have you read over again the chapter, Madam, as I asked? You have: And did you not observe the passage? No? Then, Madam, please ponder well the last line but one, where I say, 'It was necessary I should be born before I was christened.' Had my mother, Madam, been a Papist, that consequence would not follow.\n- For the Romish rituals direct the baptising of the child, if it is in danger, before it is born; and the Doctors of the Sorbonne have determined that baptism may be administered to the unborn child by injection, using une petite canulle - or in English, a squirt. ('Tis very strange that St. Thomas Aquinas should have rejected this possibility. - 'Infantes in maternis uteris existentes,' quoth he, 'baptizari possunt nullo modo.' - O Thomas! Thomas!)\nIt is a terrible misfortune for this book of mine - as for all literature - that the vile lust for fresh adventures has got so strongly into our habit. So intent are we upon satisfying the impatience of our desire that nothing but the gross and carnal parts of a book go in. Subtle hints fly off like spirits upwards; the heavy moral escapes downwards; and both are as much lost to the world, as if they were left in the bottom of the ink-well.\nI wish that from this reader's example, all good people may be taught to think as well as read.\nIf the reader is curious to see the question upon baptism by injection, as presented to the Doctors of the Sorbonne, with their response thereupon, it is as follows.\n(Note: A translation from the French by the abridger follows each section below:)\nMEMOIRE present Messieurs les Docteurs de SORBONNE . [Vide Deventer, Paris edit., 4to, 1734, p. 366.]\nUn Chirurgien Accoucheur, represente Messieurs les Docteurs de SORBONNE, qu'il y a des cas, quoique trs rares, o une mere ne sauroit accoucher, & mme o l'enfant est tellement renferm dans le sein de sa mere, qu'il ne fait paritre aucune partie de son corps, ce qui seroit un cas, suivant les Rituels, de lui confrer, du moins sous condition, le baptme. Le Chirurgien, qui consulte, prtend, par le moyen d'une petite canulle, de pouvoir baptiser immediatement l'enfant, sans faire aucun tort la mere. Il demand si ce moyen, qu'il vient de proposer, est permis & lgitime, & s'il peut s'en servir dans les cas qu'il vient d'exposer.\n(Translation: A baby may be baptised before it is born, in certain cases, by means of a little tube.)\nRESPONSE\nLe Conseil estime, que la question propose souffre de grandes difficults. Les Thologiens posent d'un ct pour principe, que le baptme, qui est une naissance spirituelle, suppose une premiere naissance; il faut tre n dans le monde, pour renatre en Jesus Christ, comme ils l'enseignent. S. Thomas, 3 part, qust. 88, artic. II, suit cette doctrine comme une verit constante; l'on ne peut, dit ce S. Docteur, baptiser les enfans qui sont renferms dans le sein de leurs meres, & S. Thomas est fond sur ce, que les enfans ne sont point ns, & ne peuvent tre compts parmi les autres hommes; d'o il conclud, qu'ils ne peuvent tre l'objet d'une action extrieure, pour reevoir par leur ministre, les sacremens ncessaires au salut: Pueri in maternis uteris existentes nondum prodierunt in lucem ut cum aliis hominibus vitam ducant; unde non possunt subjici actioni human, ut per eorum ministerium sacramenta recipiant ad salutem. Les rituels ordonnent dans la pratique ce que les thologiens ont tabli sur les mmes matires, & ils deffendent tous d'une manire uniforme, de baptiser les enfans qui sont renferms dans le sein de leurs meres, s'ils ne font parotre quelque partie de leurs corps. Le concours des thologiens, & des rituels, qui sont les rgles des diocses, paroit former une autorit qui termine la question presente; cependant le conseil de conscience considerant d'un ct, que le raisonnement des thologiens est uniquement fond sur une raison de convenance, & que la deffense des rituels suppose que l'on ne peut baptiser immediatement les enfans ainsi renferms dans le sein de leurs meres, ce qui est contre la supposition presente; & d'un autre ct, considerant que les mmes thologiens enseignent, que l'on peut risquer les sacremens que Jesus Christ a tablis comme des moyens faciles, mais ncessaires pour sanctifier les hommes; & d'ailleurs estimant, que les enfans renferms dans le sein de leurs meres, pourroient tre capables de salut, parcequ'ils sont capables de damnation; -pour ces considerations, & en egard l'expos, suivant lequel on assure avoir trouv un moyen certain de baptiser ces enfans ainsi renferms, sans faire aucun tort la mere, le Conseil estime que l'on pourroit se servir du moyen propos, dans la confiance qu'il a, que Dieu n'a point laiss ces sortes d'enfans sans aucuns secours, & supposant, comme il est expos, que le moyen dont il s'agit est propre leur procurer le baptme; cependant comme il s'agiroit, en autorisant la pratique propose, de changer une regie universellement tablie, le Conseil croit que celui qui consulte doit s'addresser son evque, & qui il appartient de juger de l'utilit, & du danger du moyen propos, & comme, sous le bon plaisir de l'evque, le Conseil estime qu'il faudroit recourir au Pape, qui a le droit d'expliquer les rgles de l'eglise, & d'y droger dans le cas, ou la loi ne sauroit obliger, quelque sage & quelque utile que paroisse la manire de baptiser dont il s'agit, le Conseil ne pourroit l'approuver sans le concours de ces deux autorits. On conseile au moins celui qui consulte, de s'addresser son evque, & de lui faire part de la presente dcision, afin que, si le prelat entre dans les raisons sur lesquelles les docteurs soussigns s'appuyent, il puisse tre autoris dans le cas de ncessit, ou il risqueroit trop d'attendre que la permission ft demande & accorde d'employer le moyen qu'il propose si avantageux au salut de l'enfant.\n(Translation: No! If a child is not born it cannot be baptised. Though if you really must, perhaps it can.)\nSorbonne, le 10 Avril, 1733.\nA. LE MOYNE.\nL. DE ROMIGNY.\nDE MARCILLY.\nMr. Tristram Shandy's compliments to Messrs. Le Moyne, De Romigny, and De Marcilly; he hopes they rested well the night after so tiresome a consultation. He begs to know whether after the ceremony of marriage, and before that of consummation, the baptizing of all the Homunculi at once, slapdash, by injection, would not be a shorter and safer cut still; if they come safe into the world after this, they shall be baptized again.\n- Provided that the thing can be done, which Mr. Shandy believes it may, par le moyen d'une petite canulle, and sans faire aucun tort au pere (by means of a tiny tube, and without doing any damage to the father.)",
        "paragraph_chars": [
            [
                0,
                107
            ],
            [
                107,
                149
            ],
            [
                149,
                213
            ],
            [
                213,
                247
            ],
            [
                247,
                288
            ],
            [
                288,
                314
            ],
            [
                314,
                407
            ],
            [
                407,
                919
            ],
            [
                919,
                1259
            ],
            [
                1259,
                1714
            ],
            [
                1714,
                2159
            ],
            [
                2159,
                2255
            ],
            [
                2255,
                2421
            ],
            [
                2421,
                2503
            ],
            [
                2503,
                2605
            ],
            [
                2605,
                3235
            ],
            [
                3235,
                3337
            ],
            [
                3337,
                3346
            ],
            [
                3346,
                6742
            ],
            [
                6742,
                6850
            ],
            [
                6850,
                6879
            ],
            [
                6879,
                6892
            ],
            [
                6892,
                6907
            ],
            [
                6907,
                6920
            ],
            [
                6920,
                7350
            ],
            [
                7350,
                7562
            ]
        ],
        "segment_chars": [
            [
                0,
                41
            ],
            [
                41,
                107
            ],
            [
                107,
                117
            ],
            [
                117,
                149
            ],
            [
                149,
                213
            ],
            [
                213,
                247
            ],
            [
                247,
                288
            ],
            [
                288,
                314
            ],
            [
                314,
                327
            ],
            [
                327,
                407
            ],
            [
                407,
                535
            ],
            [
                535,
                726
            ],
            [
                726,
                919
            ],
            [
                919,
                948
            ],
            [
                948,
                1007
            ],
            [
                1007,
                1054
            ],
            [
                1054,
                1058
            ],
            [
                1058,
                1187
            ],
            [
                1187,
                1259
            ],
            [
                1259,
                1525
            ],
            [
                1525,
                1607
            ],
            [
                1607,
                1693
            ],
            [
                1693,
                1705
            ],
            [
                1705,
                1714
            ],
            [
                1714,
                1866
            ],
            [
                1866,
                1989
            ],
            [
                1989,
                2159
            ],
            [
                2159,
                2255
            ],
            [
                2255,
                2421
            ],
            [
                2421,
                2503
            ],
            [
                2503,
                2556
            ],
            [
                2556,
                2605
            ],
            [
                2605,
                2958
            ],
            [
                2958,
                3105
            ],
            [
                3105,
                3235
            ],
            [
                3235,
                3337
            ],
            [
                3337,
                3346
            ],
            [
                3346,
                3420
            ],
            [
                3420,
                3630
            ],
            [
                3630,
                4263
            ],
            [
                4263,
                4524
            ],
            [
                4524,
                6347
            ],
            [
                6347,
                6742
            ],
            [
                6742,
                6760
            ],
            [
                6760,
                6806
            ],
            [
                6806,
                6850
            ],
            [
                6850,
                6879
            ],
            [
                6879,
                6882
            ],
            [
                6882,
                6892
            ],
            [
                6892,
                6907
            ],
            [
                6907,
                6920
            ],
            [
                6920,
                7074
            ],
            [
                7074,
                7350
            ],
            [
                7350,
                7562
            ]
        ],
        "overlap_chars": [
            [
                0,
                39
            ],
            [
                39,
                41
            ],
            [
                41,
                54
            ],
            [
                72,
                73
            ],
            [
                74,
                105
            ],
            [
                115,
                117
            ],
            [
                117,
                148
            ],
            [
                151,
                159
            ],
            [
                160,
                166
            ],
            [
                167,
                191
            ],
            [
                192,
                200
            ],
            [
                201,
                211
            ],
            [
                211,
                212
            ],
            [
                215,
                219
            ],
            [
                220,
                231
            ],
            [
                239,
                246
            ],
            [
                249,
                259
            ],
            [
                260,
                272
            ],
            [
                280,
                287
            ],
            [
                290,
                313
            ],
            [
                318,
                325
            ],
            [
                327,
                328
            ],
            [
                329,
                335
            ],
            [
                336,
                366
            ],
            [
                366,
                406
            ],
            [
                407,
                449
            ],
            [
                454,
                460
            ],
            [
                461,
                513
            ],
            [
                514,
                533
            ],
            [
                535,
                565
            ],
            [
                566,
                613
            ],
            [
                614,
                624
            ],
            [
                625,
                674
            ],
            [
                675,
                705
            ],
            [
                711,
                717
            ],
            [
                718,
                724
            ],
            [
                726,
                729
            ],
            [
                737,
                782
            ],
            [
                783,
                785
            ],
            [
                786,
                788
            ],
            [
                789,
                793
            ],
            [
                793,
                794
            ],
            [
                797,
                802
            ],
            [
                803,
                813
            ],
            [
                814,
                819
            ],
            [
                820,
                839
            ],
            [
                841,
                873
            ],
            [
                892,
                896
            ],
            [
                897,
                916
            ],
            [
                919,
                948
            ],
            [
                950,
                999
            ],
            [
                1005,
                1007
            ],
            [
                1007,
                1052
            ],
            [
                1052,
                1054
            ],
            [
                1058,
                1070
            ],
            [
                1078,
                1111
            ],
            [
                1111,
                1120
            ],
            [
                1121,
                1125
            ],
            [
                1127,
                1133
            ],
            [
                1134,
                1143
            ],
            [
                1144,
                1180
            ],
            [
                1187,
                1240
            ],
            [
                1247,
                1258
            ],
            [
                1259,
                1260
            ],
            [
                1261,
                1264
            ],
            [
                1265,
                1268
            ],
            [
                1269,
                1275
            ],
            [
                1276,
                1299
            ],
            [
                1305,
                1318
            ],
            [
                1322,
                1324
            ],
            [
                1325,
                1327
            ],
            [
                1328,
                1330
            ],
            [
                1331,
                1338
            ],
            [
                1339,
                1345
            ],
            [
                1346,
                1357
            ],
            [
                1358,
                1361
            ],
            [
                1362,
                1380
            ],
            [
                1384,
                1389
            ],
            [
                1390,
                1394
            ],
            [
                1406,
                1418
            ],
            [
                1419,
                1422
            ],
            [
                1423,
                1441
            ],
            [
                1442,
                1445
            ],
            [
                1453,
                1458
            ],
            [
                1459,
                1472
            ],
            [
                1479,
                1497
            ],
            [
                1498,
                1499
            ],
            [
                1500,
                1502
            ],
            [
                1503,
                1505
            ],
            [
                1513,
                1514
            ],
            [
                1515,
                1523
            ],
            [
                1523,
                1524
            ],
            [
                1527,
                1552
            ],
            [
                1553,
                1567
            ],
            [
                1568,
                1574
            ],
            [
                1575,
                1579
            ],
            [
                1589,
                1593
            ],
            [
                1605,
                1606
            ],
            [
                1607,
                1608
            ],
            [
                1609,
                1610
            ],
            [
                1610,
                1648
            ],
            [
                1651,
                1656
            ],
            [
                1659,
                1660
            ],
            [
                1661,
                1662
            ],
            [
                1666,
                1679
            ],
            [
                1680,
                1690
            ],
            [
                1695,
                1696
            ],
            [
                1697,
                1704
            ],
            [
                1705,
                1711
            ],
            [
                1714,
                1750
            ],
            [
                1751,
                1763
            ],
            [
                1766,
                1768
            ],
            [
                1773,
                1776
            ],
            [
                1790,
                1794
            ],
            [
                1795,
                1798
            ],
            [
                1799,
                1803
            ],
            [
                1809,
                1829
            ],
            [
                1830,
                1864
            ],
            [
                1864,
                1865
            ],
            [
                1866,
                1868
            ],
            [
                1869,
                1920
            ],
            [
                1928,
                1958
            ],
            [
                1959,
                1976
            ],
            [
                1982,
                1984
            ],
            [
                1985,
                1987
            ],
            [
                1987,
                1988
            ],
            [
                1989,
                2001
            ],
            [
                2002,
                2009
            ],
            [
                2010,
                2030
            ],
            [
                2030,
                2031
            ],
            [
                2032,
                2075
            ],
            [
                2076,
                2122
            ],
            [
                2123,
                2153
            ],
            [
                2157,
                2159
            ],
            [
                2159,
                2165
            ],
            [
                2166,
                2170
            ],
            [
                2171,
                2175
            ],
            [
                2176,
                2180
            ],
            [
                2181,
                2187
            ],
            [
                2187,
                2189
            ],
            [
                2190,
                2198
            ],
            [
                2199,
                2214
            ],
            [
                2215,
                2255
            ],
            [
                2255,
                2268
            ],
            [
                2272,
                2279
            ],
            [
                2280,
                2312
            ],
            [
                2313,
                2325
            ],
            [
                2325,
                2361
            ],
            [
                2365,
                2370
            ],
            [
                2370,
                2382
            ],
            [
                2392,
                2419
            ],
            [
                2419,
                2420
            ],
            [
                2421,
                2422
            ],
            [
                2422,
                2426
            ],
            [
                2426,
                2427
            ],
            [
                2428,
                2429
            ],
            [
                2447,
                2450
            ],
            [
                2458,
                2464
            ],
            [
                2500,
                2501
            ],
            [
                2501,
                2502
            ],
            [
                2503,
                2553
            ],
            [
                2554,
                2555
            ],
            [
                2556,
                2557
            ],
            [
                2562,
                2605
            ],
            [
                2605,
                2957
            ],
            [
                2958,
                3013
            ],
            [
                3014,
                3028
            ],
            [
                3028,
                3104
            ],
            [
                3105,
                3233
            ],
            [
                3247,
                3248
            ],
            [
                3249,
                3250
            ],
            [
                3260,
                3262
            ],
            [
                3263,
                3267
            ],
            [
                3279,
                3281
            ],
            [
                3289,
                3293
            ],
            [
                3302,
                3307
            ],
            [
                3307,
                3311
            ],
            [
                3318,
                3320
            ],
            [
                3321,
                3322
            ],
            [
                3346,
                3420
            ],
            [
                3420,
                3591
            ],
            [
                3592,
                3604
            ],
            [
                3604,
                3630
            ],
            [
                3630,
                3668
            ],
            [
                3668,
                3818
            ],
            [
                3819,
                3828
            ],
            [
                3829,
                4064
            ],
            [
                4065,
                4263
            ],
            [
                4263,
                4524
            ],
            [
                4524,
                5080
            ],
            [
                5081,
                5093
            ],
            [
                5094,
                5322
            ],
            [
                5324,
                6347
            ],
            [
                6347,
                6741
            ],
            [
                6771,
                6773
            ],
            [
                6783,
                6785
            ],
            [
                6796,
                6800
            ],
            [
                6831,
                6832
            ],
            [
                6841,
                6843
            ],
            [
                6850,
                6858
            ],
            [
                6858,
                6865
            ],
            [
                6866,
                6871
            ],
            [
                6871,
                6879
            ],
            [
                6879,
                6882
            ],
            [
                6882,
                6891
            ],
            [
                6892,
                6906
            ],
            [
                6907,
                6920
            ],
            [
                6920,
                6923
            ],
            [
                6929,
                6941
            ],
            [
                6942,
                6964
            ],
            [
                6965,
                6973
            ],
            [
                6973,
                6974
            ],
            [
                6975,
                6985
            ],
            [
                6985,
                6990
            ],
            [
                6991,
                7002
            ],
            [
                7002,
                7003
            ],
            [
                7007,
                7017
            ],
            [
                7018,
                7074
            ],
            [
                7074,
                7089
            ],
            [
                7090,
                7176
            ],
            [
                7177,
                7179
            ],
            [
                7180,
                7219
            ],
            [
                7229,
                7274
            ],
            [
                7275,
                7277
            ],
            [
                7283,
                7319
            ],
            [
                7325,
                7348
            ],
            [
                7352,
                7360
            ],
            [
                7361,
                7394
            ],
            [
                7397,
                7405
            ],
            [
                7415,
                7422
            ],
            [
                7423,
                7456
            ],
            [
                7456,
                7461
            ],
            [
                7467,
                7491
            ],
            [
                7516,
                7521
            ],
            [
                7550,
                7553
            ]
        ],
        "row_chars": [
            [
                0,
                41
            ],
            [
                41,
                107
            ],
            [
                107,
                117
            ],
            [
                117,
                149
            ],
            [
                149,
                213
            ],
            [
                213,
                247
            ],
            [
                247,
                288
            ],
            [
                288,
                314
            ],
            [
                314,
                314
            ],
            [
                314,
                314
            ],
            [
                314,
                407
            ],
            [
                407,
                919
            ],
            [
                919,
                919
            ],
            [
                919,
                948
            ],
            [
                948,
                1007
            ],
            [
                1007,
                1054
            ],
            [
                1054,
                1058
            ],
            [
                1058,
                1187
            ],
            [
                1187,
                1259
            ],
            [
                1259,
                3337
            ],
            [
                3337,
                3346
            ],
            [
                3346,
                3420
            ],
            [
                3420,
                3630
            ],
            [
                3630,
                4263
            ],
            [
                4263,
                4524
            ],
            [
                4524,
                6347
            ],
            [
                6347,
                6850
            ],
            [
                6850,
                6879
            ],
            [
                6879,
                6882
            ],
            [
                6882,
                6892
            ],
            [
                6892,
                6907
            ],
            [
                6907,
                6920
            ],
            [
                6920,
                7074
            ],
            [
                7074,
                7562
            ]
        ]
    }
}