{
    "original": {
        "text": "I am not insensible, brother _Shandy_, that when a man whose profession is arms, wishes, as I have done, for war, --it has an ill aspect to the world; ----and that, how just and right soever his motives and intentions may be, --he stands in an uneasy posture in vindicating himself from private views in doing it.\nFor this cause, if a soldier is a prudent man, which he may be without being a jot the less brave, he will be sure not to utter his wish in the hearing of an enemy; for say what he will, an enemy will not believe him. ----He will be cautious of doing it even to a friend, --lest he may suffer in his esteem: ----But if his heart is overcharged, and a secret sigh for arms must have its vent, he will reserve it for the ear of a brother, who knows his character to the bottom, and what his true notions, dispositions, and principles of honour are: What, I _hope_, I have been in all these, brother _Shandy_, would be unbecoming in me to say: ----much worse, I know, have I been than I ought, --and something worse, perhaps, than I think: But such as I am, you, my dear brother _Shandy_, who have sucked the same breasts with me, --and with whom I have been brought up from my cradle, --and from whose knowledge, from the first hours of our boyish pastimes, down to this, I have concealed no one action of my life, and scarce a thought in it ----Such as I am, brother, you must by this time know me, with all my vices, and with all my weaknesses too, whether of my age, my temper, my passions, or my understanding.\nTell me then, my dear brother _Shandy_, upon which of them it is, that when I condemned the peace of _Utrecht_, and grieved the war was not carried on with vigour a little longer, you should think your brother did it upon unworthy views; or that in wishing for war, he should be bad enough to wish more of his fellow-creatures slain, --more slaves made, and more families driven from their peaceful habitations, merely for his own pleasure: ----Tell me, brother _Shandy_, upon what one deed of mine do you ground it? [_The devil a deed do I know of, dear _Toby_, but one for a hundred pounds, which I lent thee to carry on these cursed sieges._]\nIf, when I was a school-boy, I could not hear a drum beat, but my heart beat with it--was it my fault? Did I plant the propensity there? ----Did I sound the alarm within, or Nature?\nWhen _Guy_, Earl of _Warwick_, and _Parismus_ and _Parismenus_, and _Valentine_ and _Orson_, and the _Seven Champions of England_, were handed around the school, --were they not all purchased with my own pocket-money? Was that selfish, brother _Shandy?_ When we read over the siege of _Troy_, which lasted ten years and eight months, ----though with such a train of artillery as we had at _Namur_, the town might have been carried in a week--was I not as much concerned for the destruction of the _Greeks_ and _Trojans_ as any boy of the whole school? Had I not three strokes of a ferula given me, two on my right hand, and one on my left, for calling _Helena_ a bitch for it? Did any one of you shed more tears for _Hector?_ And when king _Priam_ came to the camp to beg his body, and returned weeping back to _Troy_ without it, --you know, brother, I could not eat my dinner.------\n----Did that bespeak me cruel? Or because, brother _Shandy_, my blood flew out into the camp, and my heart panted for war, --was it a proof it could not ache for the distresses of war too?\nO brother! 'tis one thing for a soldier to gather laurels, --and 'tis another to scatter cypress. ----[_Who told thee, my dear _Toby_, that cypress was used by the antients on mournful occasions?_]\n----'Tis one thing, brother _Shandy_, for a soldier to hazard his own life--to leap first down into the trench, where he is sure to be cut in pieces: ----'Tis one thing, from public spirit and a thirst of glory, to enter the breach the first man, --To stand in the foremost rank, and march bravely on with drums and trumpets, and colours flying about his ears: ----'Tis one thing, I say, brother _Shandy_, to do this, --and 'tis another thing to reflect on the miseries of war; --to view the desolations of whole countries, and consider the intolerable fatigues and hardships which the soldier himself, the instrument who works them, is forced (for sixpence a day, if he can get it) to undergo.\nNeed I be told, dear _Yorick_, as I was by you, in _Le Fever's_ funeral sermon, _That so soft and gentle a creature, born to love, to mercy, and kindness, as man is, was not shaped for this?_ ----But why did you not add, _Yorick_, --if not by NATURE--that he is so by NECESSITY? ----For what is war? what is it, _Yorick_, when fought as ours has been, upon principles of _liberty_, and upon principles of _honour_----what is it, but the getting together of quiet and harmless people, with their swords in their hands, to keep the ambitious and the turbulent within bounds? And heaven is my witness, brother _Shandy_, that the pleasure I have taken in these things, --and that infinite delight, in particular, which has attended my sieges in my bowling-green, has arose within me, and I hope in the corporal too, from the consciousness we both had, that in carrying them on, we were answering the great ends of our creation.",
        "paragraph_chars": [
            [
                0,
                314
            ],
            [
                314,
                1527
            ],
            [
                1527,
                2173
            ],
            [
                2173,
                2355
            ],
            [
                2355,
                3239
            ],
            [
                3239,
                3428
            ],
            [
                3428,
                3626
            ],
            [
                3626,
                4321
            ],
            [
                4321,
                5244
            ]
        ],
        "segment_chars": [
            [
                0,
                314
            ],
            [
                314,
                532
            ],
            [
                532,
                1527
            ],
            [
                1527,
                2044
            ],
            [
                2044,
                2173
            ],
            [
                2173,
                2276
            ],
            [
                2276,
                2310
            ],
            [
                2310,
                2355
            ],
            [
                2355,
                2573
            ],
            [
                2573,
                2907
            ],
            [
                2907,
                3032
            ],
            [
                3032,
                3239
            ],
            [
                3239,
                3270
            ],
            [
                3270,
                3428
            ],
            [
                3428,
                3439
            ],
            [
                3439,
                3526
            ],
            [
                3526,
                3626
            ],
            [
                3626,
                4321
            ],
            [
                4321,
                4600
            ],
            [
                4600,
                4621
            ],
            [
                4621,
                4894
            ],
            [
                4894,
                5244
            ]
        ],
        "overlap_chars": [
            [
                0,
                4
            ],
            [
                19,
                28
            ],
            [
                30,
                36
            ],
            [
                37,
                50
            ],
            [
                51,
                54
            ],
            [
                81,
                113
            ],
            [
                116,
                122
            ],
            [
                149,
                150
            ],
            [
                155,
                164
            ],
            [
                165,
                173
            ],
            [
                191,
                202
            ],
            [
                218,
                225
            ],
            [
                228,
                250
            ],
            [
                259,
                281
            ],
            [
                312,
                314
            ],
            [
                328,
                345
            ],
            [
                348,
                355
            ],
            [
                359,
                420
            ],
            [
                429,
                432
            ],
            [
                436,
                482
            ],
            [
                501,
                532
            ],
            [
                536,
                585
            ],
            [
                588,
                620
            ],
            [
                626,
                774
            ],
            [
                788,
                807
            ],
            [
                835,
                865
            ],
            [
                867,
                868
            ],
            [
                901,
                910
            ],
            [
                912,
                918
            ],
            [
                919,
                953
            ],
            [
                877,
                888
            ],
            [
                959,
                978
            ],
            [
                991,
                1004
            ],
            [
                831,
                834
            ],
            [
                1021,
                1049
            ],
            [
                1051,
                1089
            ],
            [
                1098,
                1103
            ],
            [
                1109,
                1124
            ],
            [
                1138,
                1141
            ],
            [
                1144,
                1196
            ],
            [
                1199,
                1207
            ],
            [
                1284,
                1303
            ],
            [
                1308,
                1325
            ],
            [
                1358,
                1370
            ],
            [
                1379,
                1429
            ],
            [
                1007,
                1010
            ],
            [
                1447,
                1457
            ],
            [
                1246,
                1248
            ],
            [
                1477,
                1481
            ],
            [
                1485,
                1491
            ],
            [
                1327,
                1330
            ],
            [
                1512,
                1527
            ],
            [
                1527,
                1556
            ],
            [
                1558,
                1564
            ],
            [
                1565,
                1566
            ],
            [
                1572,
                1585
            ],
            [
                1598,
                1627
            ],
            [
                1629,
                1636
            ],
            [
                1637,
                1650
            ],
            [
                1593,
                1597
            ],
            [
                1651,
                1677
            ],
            [
                1690,
                1705
            ],
            [
                1737,
                1740
            ],
            [
                1707,
                1710
            ],
            [
                1718,
                1723
            ],
            [
                1586,
                1588
            ],
            [
                1749,
                1757
            ],
            [
                1724,
                1736
            ],
            [
                1591,
                1592
            ],
            [
                1768,
                1802
            ],
            [
                1820,
                1824
            ],
            [
                1825,
                1853
            ],
            [
                1817,
                1819
            ],
            [
                1803,
                1805
            ],
            [
                1854,
                1860
            ],
            [
                1765,
                1767
            ],
            [
                1899,
                1966
            ],
            [
                1972,
                1988
            ],
            [
                1990,
                1996
            ],
            [
                1997,
                2008
            ],
            [
                2013,
                2032
            ],
            [
                2040,
                2044
            ],
            [
                2046,
                2081
            ],
            [
                2094,
                2169
            ],
            [
                2173,
                2231
            ],
            [
                2236,
                2244
            ],
            [
                2250,
                2257
            ],
            [
                2259,
                2274
            ],
            [
                2342,
                2353
            ],
            [
                2353,
                2355
            ],
            [
                2355,
                2359
            ],
            [
                2361,
                2364
            ],
            [
                2365,
                2374
            ],
            [
                2376,
                2383
            ],
            [
                2446,
                2455
            ],
            [
                2457,
                2483
            ],
            [
                2484,
                2516
            ],
            [
                2519,
                2573
            ],
            [
                2573,
                2598
            ],
            [
                2600,
                2607
            ],
            [
                2609,
                2639
            ],
            [
                2641,
                2645
            ],
            [
                2646,
                2647
            ],
            [
                2797,
                2851
            ],
            [
                2853,
                2859
            ],
            [
                2671,
                2674
            ],
            [
                2866,
                2873
            ],
            [
                2875,
                2885
            ],
            [
                2786,
                2788
            ],
            [
                2753,
                2756
            ],
            [
                2899,
                2907
            ],
            [
                2911,
                2916
            ],
            [
                2943,
                2948
            ],
            [
                2917,
                2942
            ],
            [
                2995,
                3006
            ],
            [
                3008,
                3011
            ],
            [
                3016,
                3032
            ],
            [
                3032,
                3070
            ],
            [
                3072,
                3079
            ],
            [
                3081,
                3094
            ],
            [
                3096,
                3101
            ],
            [
                3103,
                3165
            ],
            [
                3167,
                3171
            ],
            [
                3173,
                3183
            ],
            [
                3187,
                3232
            ],
            [
                3243,
                3251
            ],
            [
                3260,
                3262
            ],
            [
                3263,
                3270
            ],
            [
                3270,
                3289
            ],
            [
                3291,
                3297
            ],
            [
                3298,
                3299
            ],
            [
                3337,
                3361
            ],
            [
                3379,
                3428
            ],
            [
                3428,
                3439
            ],
            [
                3439,
                3486
            ],
            [
                3489,
                3526
            ],
            [
                3532,
                3554
            ],
            [
                3561,
                3591
            ],
            [
                3601,
                3622
            ],
            [
                3635,
                3653
            ],
            [
                3655,
                3661
            ],
            [
                3662,
                3700
            ],
            [
                3702,
                3715
            ],
            [
                3721,
                3775
            ],
            [
                3780,
                3800
            ],
            [
                3819,
                3857
            ],
            [
                3862,
                3867
            ],
            [
                3904,
                3950
            ],
            [
                3985,
                3986
            ],
            [
                4046,
                4103
            ],
            [
                4106,
                4166
            ],
            [
                4192,
                4227
            ],
            [
                4260,
                4321
            ],
            [
                4321,
                4341
            ],
            [
                4343,
                4349
            ],
            [
                4350,
                4351
            ],
            [
                4402,
                4451
            ],
            [
                4455,
                4511
            ],
            [
                4517,
                4541
            ],
            [
                4543,
                4549
            ],
            [
                4367,
                4368
            ],
            [
                4554,
                4570
            ],
            [
                4572,
                4599
            ],
            [
                4604,
                4621
            ],
            [
                4621,
                4632
            ],
            [
                4634,
                4640
            ],
            [
                4641,
                4654
            ],
            [
                4673,
                4691
            ],
            [
                4703,
                4706
            ],
            [
                4748,
                4894
            ],
            [
                4894,
                4927
            ],
            [
                4929,
                4935
            ],
            [
                4936,
                4985
            ],
            [
                4988,
                5058
            ],
            [
                5191,
                5193
            ],
            [
                5062,
                5137
            ],
            [
                5169,
                5173
            ],
            [
                5195,
                5222
            ],
            [
                5228,
                5244
            ]
        ],
        "row_chars": [
            [
                0,
                314
            ],
            [
                314,
                532
            ],
            [
                532,
                1527
            ],
            [
                1527,
                2044
            ],
            [
                2044,
                2173
            ],
            [
                2173,
                2355
            ],
            [
                2355,
                2573
            ],
            [
                2573,
                2907
            ],
            [
                2907,
                3032
            ],
            [
                3032,
                3239
            ],
            [
                3239,
                3270
            ],
            [
                3270,
                3428
            ],
            [
                3428,
                3439
            ],
            [
                3439,
                3526
            ],
            [
                3526,
                3626
            ],
            [
                3626,
                4321
            ],
            [
                4321,
                4600
            ],
            [
                4600,
                4621
            ],
            [
                4621,
                4894
            ],
            [
                4894,
                5244
            ]
        ]
    },
    "abridged": {
        "text": "I am aware, brother Shandy, that when a military man wishes, as I have done, for war, it has a bad appearance; and that, no matter how just his motives may be, he stands in an uneasy position in vindicating himself.\nTherefore, if a soldier is prudent, which he may be without being a jot the less brave, he will not utter his wish in the hearing of an enemy; for an enemy will not believe him. He will be cautious of doing it even to a friend, lest he may suffer in his esteem.\nBut if his heart is overcharged, and a secret sigh for arms must have its vent, he will reserve it for the ear of a brother, who knows his character, and what his true principles of honour are: what I hope mine are, brother Shandy, would be unbecoming in me to say - I have been much worse, I know, than I ought, and somewhat worse, perhaps, than I think.\nBut such as I am, you, my dear brother, who sucked the same breast as me, and with whom I have been brought up from my cradle, and from whom I have concealed no action of my life - such as I am, you must by this time know me, with all my vices and weaknesses of age, temper and understanding.\nTell me then, my dear brother Shandy, which of them was at fault when I condemned the peace of Utrecht, and grieved that the war was not carried on a little longer? Did you think it unworthy of your brother, that in wishing for war, he should wish for more of his fellow-creatures to be slain, or driven from their peaceful habitations, merely for his own pleasure? Tell me, brother Shandy, upon what deed of mine do you base it? [The devil a deed do I know of, dear Toby - wrote my father - except one for a hundred pounds, which I lent thee to carry on these cursed sieges.]\nIf, when I was a school-boy, I could not hear a drum beat, without my heart beating with it - was it my fault, or Nature's?\nWhen Guy, Earl of Warwick, and the Seven Champions of England, were handed around the school, were they not all purchased with my own pocket-money? Was that selfish, brother Shandy? When we read over the siege of Troy, was I not as much concerned for the destruction of the Greeks and Trojans as any boy in the school? Was I not given three strokes of a ferula for calling Helen a bitch for it? Did any one of you shed more tears for Hector? And when king Priam came to the camp to beg his body, and returned weeping back to Troy without it - you know, brother, I could not eat my dinner.\nDid that show me to be cruel? Or because, brother Shandy, my heart panted for war, did that prove it could not ache for the distresses of war too?\nO brother! 'tis one thing for a soldier to gather laurels, and 'tis another to scatter cypress. [Who told thee, my dear Toby, that cypress was used by the ancients on mournful occasions?]\n'Tis one thing, brother Shandy, for a soldier to hazard his own life - to leap first into the trench, where he is sure to be cut in pieces: 'tis one thing, from a thirst of glory, to enter the breach first, and march bravely on with drums and trumpets: - and 'tis another thing to reflect on the miseries of war; to view the desolations of whole countries, and consider the hardships which the soldier himself is forced (for sixpence a day, if he can get it) to undergo.\nNeed I be told, dear Yorick, that so soft and gentle a creature, born to love, mercy, and kindness, as man is, was not shaped for this? But why did you not add, Yorick, - if not by Nature - that he is so by Necessity?\nFor what is war? what is it, Yorick, when fought upon principles of liberty and honour, but the getting together of quiet and harmless people, with their swords in their hands, to keep the ambitious and the turbulent within bounds? And heaven is my witness, brother Shandy, that the pleasure I have taken in these things, and that infinite delight, in particular, which has attended my sieges on my bowling-green, has arose within me, and I hope in the corporal too, from our awareness that we were answering the great purposes of our creation.",
        "paragraph_chars": [
            [
                0,
                216
            ],
            [
                216,
                478
            ],
            [
                478,
                834
            ],
            [
                834,
                1127
            ],
            [
                1127,
                1704
            ],
            [
                1704,
                1828
            ],
            [
                1828,
                2417
            ],
            [
                2417,
                2564
            ],
            [
                2564,
                2752
            ],
            [
                2752,
                3223
            ],
            [
                3223,
                3441
            ],
            [
                3441,
                3985
            ]
        ],
        "segment_chars": [
            [
                0,
                216
            ],
            [
                216,
                394
            ],
            [
                394,
                478
            ],
            [
                478,
                834
            ],
            [
                834,
                1127
            ],
            [
                1127,
                1292
            ],
            [
                1292,
                1493
            ],
            [
                1493,
                1557
            ],
            [
                1557,
                1704
            ],
            [
                1704,
                1828
            ],
            [
                1828,
                1976
            ],
            [
                1976,
                2010
            ],
            [
                2010,
                2147
            ],
            [
                2147,
                2223
            ],
            [
                2223,
                2270
            ],
            [
                2270,
                2417
            ],
            [
                2417,
                2447
            ],
            [
                2447,
                2564
            ],
            [
                2564,
                2575
            ],
            [
                2575,
                2660
            ],
            [
                2660,
                2752
            ],
            [
                2752,
                3223
            ],
            [
                3223,
                3359
            ],
            [
                3359,
                3441
            ],
            [
                3441,
                3458
            ],
            [
                3458,
                3673
            ],
            [
                3673,
                3985
            ]
        ],
        "overlap_chars": [
            [
                0,
                4
            ],
            [
                10,
                19
            ],
            [
                20,
                26
            ],
            [
                26,
                39
            ],
            [
                49,
                52
            ],
            [
                53,
                85
            ],
            [
                86,
                92
            ],
            [
                109,
                110
            ],
            [
                111,
                120
            ],
            [
                131,
                139
            ],
            [
                140,
                151
            ],
            [
                152,
                159
            ],
            [
                160,
                182
            ],
            [
                192,
                214
            ],
            [
                214,
                216
            ],
            [
                225,
                242
            ],
            [
                243,
                250
            ],
            [
                250,
                311
            ],
            [
                312,
                315
            ],
            [
                316,
                362
            ],
            [
                363,
                394
            ],
            [
                394,
                443
            ],
            [
                444,
                476
            ],
            [
                478,
                626
            ],
            [
                626,
                645
            ],
            [
                646,
                676
            ],
            [
                677,
                678
            ],
            [
                692,
                701
            ],
            [
                702,
                708
            ],
            [
                708,
                742
            ],
            [
                745,
                756
            ],
            [
                757,
                776
            ],
            [
                777,
                790
            ],
            [
                791,
                794
            ],
            [
                804,
                832
            ],
            [
                834,
                872
            ],
            [
                872,
                877
            ],
            [
                878,
                893
            ],
            [
                904,
                907
            ],
            [
                908,
                960
            ],
            [
                961,
                969
            ],
            [
                975,
                994
            ],
            [
                995,
                1012
            ],
            [
                1015,
                1027
            ],
            [
                1027,
                1077
            ],
            [
                1078,
                1081
            ],
            [
                1082,
                1092
            ],
            [
                1093,
                1095
            ],
            [
                1096,
                1100
            ],
            [
                1101,
                1107
            ],
            [
                1108,
                1111
            ],
            [
                1112,
                1127
            ],
            [
                1127,
                1156
            ],
            [
                1157,
                1163
            ],
            [
                1163,
                1164
            ],
            [
                1165,
                1178
            ],
            [
                1192,
                1221
            ],
            [
                1222,
                1229
            ],
            [
                1229,
                1242
            ],
            [
                1243,
                1247
            ],
            [
                1248,
                1274
            ],
            [
                1275,
                1290
            ],
            [
                1292,
                1295
            ],
            [
                1296,
                1299
            ],
            [
                1300,
                1305
            ],
            [
                1306,
                1308
            ],
            [
                1309,
                1317
            ],
            [
                1321,
                1333
            ],
            [
                1333,
                1334
            ],
            [
                1335,
                1369
            ],
            [
                1370,
                1374
            ],
            [
                1379,
                1407
            ],
            [
                1408,
                1410
            ],
            [
                1411,
                1413
            ],
            [
                1414,
                1420
            ],
            [
                1421,
                1423
            ],
            [
                1424,
                1491
            ],
            [
                1493,
                1509
            ],
            [
                1510,
                1516
            ],
            [
                1516,
                1527
            ],
            [
                1528,
                1547
            ],
            [
                1553,
                1557
            ],
            [
                1558,
                1593
            ],
            [
                1626,
                1701
            ],
            [
                1704,
                1762
            ],
            [
                1771,
                1779
            ],
            [
                1788,
                1795
            ],
            [
                1798,
                1813
            ],
            [
                1813,
                1824
            ],
            [
                1826,
                1828
            ],
            [
                1828,
                1832
            ],
            [
                1833,
                1836
            ],
            [
                1836,
                1845
            ],
            [
                1846,
                1853
            ],
            [
                1853,
                1862
            ],
            [
                1863,
                1889
            ],
            [
                1889,
                1921
            ],
            [
                1922,
                1976
            ],
            [
                1976,
                2001
            ],
            [
                2002,
                2009
            ],
            [
                2010,
                2040
            ],
            [
                2041,
                2045
            ],
            [
                2045,
                2046
            ],
            [
                2047,
                2101
            ],
            [
                2102,
                2108
            ],
            [
                2109,
                2112
            ],
            [
                2113,
                2120
            ],
            [
                2121,
                2131
            ],
            [
                2132,
                2134
            ],
            [
                2135,
                2138
            ],
            [
                2139,
                2147
            ],
            [
                2151,
                2156
            ],
            [
                2157,
                2162
            ],
            [
                2163,
                2188
            ],
            [
                2189,
                2200
            ],
            [
                2201,
                2204
            ],
            [
                2207,
                2223
            ],
            [
                2223,
                2261
            ],
            [
                2262,
                2269
            ],
            [
                2270,
                2283
            ],
            [
                2284,
                2289
            ],
            [
                2290,
                2352
            ],
            [
                2353,
                2357
            ],
            [
                2358,
                2368
            ],
            [
                2371,
                2416
            ],
            [
                2417,
                2425
            ],
            [
                2431,
                2433
            ],
            [
                2440,
                2447
            ],
            [
                2447,
                2466
            ],
            [
                2467,
                2473
            ],
            [
                2473,
                2474
            ],
            [
                2475,
                2499
            ],
            [
                2515,
                2564
            ],
            [
                2564,
                2575
            ],
            [
                2575,
                2622
            ],
            [
                2623,
                2660
            ],
            [
                2661,
                2683
            ],
            [
                2688,
                2718
            ],
            [
                2728,
                2749
            ],
            [
                2757,
                2775
            ],
            [
                2776,
                2782
            ],
            [
                2782,
                2820
            ],
            [
                2823,
                2836
            ],
            [
                2837,
                2891
            ],
            [
                2892,
                2912
            ],
            [
                2913,
                2951
            ],
            [
                2952,
                2957
            ],
            [
                2957,
                3003
            ],
            [
                3003,
                3004
            ],
            [
                3007,
                3064
            ],
            [
                3065,
                3125
            ],
            [
                3126,
                3161
            ],
            [
                3162,
                3223
            ],
            [
                3223,
                3243
            ],
            [
                3244,
                3250
            ],
            [
                3250,
                3251
            ],
            [
                3252,
                3301
            ],
            [
                3302,
                3358
            ],
            [
                3359,
                3383
            ],
            [
                3384,
                3390
            ],
            [
                3390,
                3391
            ],
            [
                3394,
                3410
            ],
            [
                3413,
                3440
            ],
            [
                3441,
                3458
            ],
            [
                3458,
                3469
            ],
            [
                3470,
                3476
            ],
            [
                3476,
                3489
            ],
            [
                3490,
                3508
            ],
            [
                3517,
                3520
            ],
            [
                3527,
                3673
            ],
            [
                3673,
                3706
            ],
            [
                3707,
                3713
            ],
            [
                3713,
                3762
            ],
            [
                3763,
                3833
            ],
            [
                3834,
                3836
            ],
            [
                3837,
                3912
            ],
            [
                3927,
                3931
            ],
            [
                3932,
                3959
            ],
            [
                3969,
                3985
            ]
        ],
        "row_chars": [
            [
                0,
                216
            ],
            [
                216,
                394
            ],
            [
                394,
                1127
            ],
            [
                1127,
                1557
            ],
            [
                1557,
                1704
            ],
            [
                1704,
                1828
            ],
            [
                1828,
                1976
            ],
            [
                1976,
                2147
            ],
            [
                2147,
                2223
            ],
            [
                2223,
                2417
            ],
            [
                2417,
                2447
            ],
            [
                2447,
                2564
            ],
            [
                2564,
                2575
            ],
            [
                2575,
                2660
            ],
            [
                2660,
                2752
            ],
            [
                2752,
                3223
            ],
            [
                3223,
                3441
            ],
            [
                3441,
                3458
            ],
            [
                3458,
                3673
            ],
            [
                3673,
                3985
            ]
        ]
    }
}