{
    "original": {
        "text": "I told the Christian reader in the beginning of the chapter which preceded my uncle _Toby's_ apologetical oration, --though in a different trope from what I should make use of now, That the peace of _Utrecht_ was within an ace of creating the same shyness betwixt my uncle _Toby_ and his hobby-horse, as it did betwixt the queen and the rest of the confederating powers.\nThere is an indignant way in which a man sometimes dismounts his horse, which as good as says to him, \"I'll go afoot, Sir, all the days of my life, before I would ride a single mile upon your back again.\" Now my uncle _Toby_ could not be said to dismount his horse in this manner; for in strictness of language, he could not be said to dismount his horse at all----his horse rather flung him----and somewhat _viciously_, which made my uncle _Toby_ take it ten times more unkindly. Let this matter be settled by state-jockies as they like. ----It created, I say, a sort of shyness betwixt my uncle _Toby_ and his hobby-horse. ----He had no occasion for him from the month of _March_ to _November_, which was the summer after the articles were signed, except it was now and then to take a short ride out, just to see that the fortifications and harbour of _Dunkirk_ were demolished, according to stipulation.\nThe _French_ were so backwards all that summer in setting about that affair, and Monsieur _Tugghe_, the Deputy from the magistrates of _Dunkirk_, presented so many affecting petitions to the queen, --beseeching her majesty to cause only her thunder-bolts to fall upon the martial works, which might have incurred her displeasure, --but to spare--to spare the mole, for the mole's sake; which, in its naked situation, could be no more than an object of pity----and the queen (who was but a woman) being of a pitiful disposition, --and her ministers also, they not wishing in their hearts to have the town dismantled, for these private reasons, * * * * * * * * * * * ----\n* * * * * * * * * * * * * * * * * * * * * ; so that the whole went heavily on with my uncle _Toby_; insomuch, that it was not within three full months, after he and the corporal had constructed the town, and put it in a condition to be destroyed, that the several commandants, commissaries, deputies, negociators, and intendants, would permit him to set about it. ----Fatal interval of inactivity!\nThe corporal was for beginning the demolition, by making a breach in the ramparts, or main fortifications of the town ----No, --that will never do, corporal, said my uncle _Toby_, for in going that way to work with the town, the _English_ garrison will not be safe in it an hour; because if the _French_ are treacherous ----They are as treacherous as devils, an' please your honour, said the corporal ----It gives me concern always when I hear it, _Trim_, said my uncle _Toby_, --for they don't want personal bravery; and if a breach is made in the ramparts, they may enter it, and make themselves masters of the place when they please: ----Let them enter it, said the corporal, lifting up his pioneer's spade in both his hands, as if he was going to lay about him with it, --let them enter, an' please your honour, if they dare. ----In cases like this, corporal, said my uncle _Toby_, slipping his right hand down to the middle of his cane, and holding it afterwards truncheon-wise with his forefinger extended, ----'tis no part of the consideration of a commandant, what the enemy dare, --or what they dare not do; he must act with prudence. We will begin with the outworks both towards the sea and the land, and particularly with fort _Louis_, the most distant of them all, and demolish it first, --and the rest, one by one, both on our right and left, as we retreat towards the town; ----then we'll demolish the mole, --next fill up the harbour, --then retire into the citadel, and blow it up into the air: and having done that, corporal, we'll embark for _England_. ----We are there, quoth the corporal, recollecting himself ----Very true, said my uncle _Toby_--looking at the church.",
        "paragraph_chars": [
            [
                0,
                371
            ],
            [
                371,
                1278
            ],
            [
                1278,
                1948
            ],
            [
                1948,
                2346
            ],
            [
                2346,
                4035
            ]
        ],
        "segment_chars": [
            [
                0,
                371
            ],
            [
                371,
                576
            ],
            [
                576,
                852
            ],
            [
                852,
                910
            ],
            [
                910,
                996
            ],
            [
                996,
                1278
            ],
            [
                1278,
                1948
            ],
            [
                1948,
                2312
            ],
            [
                2312,
                2346
            ],
            [
                2346,
                3176
            ],
            [
                3176,
                3490
            ],
            [
                3490,
                3917
            ],
            [
                3917,
                4035
            ]
        ],
        "overlap_chars": [
            [
                0,
                83
            ],
            [
                89,
                91
            ],
            [
                93,
                114
            ],
            [
                181,
                198
            ],
            [
                200,
                207
            ],
            [
                264,
                272
            ],
            [
                145,
                149
            ],
            [
                284,
                299
            ],
            [
                369,
                371
            ],
            [
                371,
                464
            ],
            [
                471,
                472
            ],
            [
                474,
                487
            ],
            [
                494,
                497
            ],
            [
                510,
                573
            ],
            [
                576,
                588
            ],
            [
                704,
                706
            ],
            [
                596,
                650
            ],
            [
                681,
                682
            ],
            [
                790,
                791
            ],
            [
                726,
                732
            ],
            [
                746,
                752
            ],
            [
                716,
                725
            ],
            [
                753,
                762
            ],
            [
                766,
                778
            ],
            [
                848,
                852
            ],
            [
                914,
                924
            ],
            [
                933,
                967
            ],
            [
                975,
                996
            ],
            [
                1000,
                1009
            ],
            [
                1019,
                1031
            ],
            [
                1053,
                1055
            ],
            [
                1119,
                1127
            ],
            [
                1135,
                1224
            ],
            [
                1230,
                1233
            ],
            [
                1108,
                1112
            ],
            [
                1240,
                1250
            ],
            [
                1276,
                1278
            ],
            [
                1278,
                1281
            ],
            [
                1291,
                1341
            ],
            [
                2160,
                2162
            ],
            [
                1353,
                1367
            ],
            [
                1369,
                1375
            ],
            [
                1376,
                1388
            ],
            [
                1418,
                1421
            ],
            [
                1422,
                1475
            ],
            [
                1478,
                1492
            ],
            [
                1501,
                1509
            ],
            [
                1515,
                1540
            ],
            [
                1510,
                1514
            ],
            [
                1541,
                1563
            ],
            [
                1662,
                1663
            ],
            [
                1738,
                1751
            ],
            [
                1730,
                1734
            ],
            [
                1563,
                1564
            ],
            [
                1808,
                1825
            ],
            [
                1837,
                1848
            ],
            [
                1865,
                1942
            ],
            [
                1948,
                1977
            ],
            [
                2063,
                2069
            ],
            [
                2081,
                2098
            ],
            [
                2100,
                2105
            ],
            [
                2031,
                2039
            ],
            [
                1614,
                1616
            ],
            [
                2109,
                2151
            ],
            [
                2178,
                2203
            ],
            [
                2212,
                2224
            ],
            [
                2239,
                2247
            ],
            [
                2152,
                2155
            ],
            [
                2278,
                2297
            ],
            [
                1992,
                1994
            ],
            [
                2310,
                2311
            ],
            [
                2316,
                2321
            ],
            [
                2334,
                2346
            ],
            [
                2346,
                2362
            ],
            [
                2363,
                2427
            ],
            [
                3174,
                3175
            ],
            [
                2707,
                2708
            ],
            [
                2468,
                2471
            ],
            [
                2474,
                2492
            ],
            [
                2504,
                2517
            ],
            [
                2548,
                2550
            ],
            [
                2427,
                2428
            ],
            [
                3140,
                3141
            ],
            [
                2526,
                2529
            ],
            [
                2455,
                2458
            ],
            [
                2576,
                2583
            ],
            [
                2585,
                2610
            ],
            [
                2617,
                2640
            ],
            [
                2650,
                2665
            ],
            [
                2675,
                2704
            ],
            [
                2716,
                2727
            ],
            [
                2729,
                2746
            ],
            [
                2751,
                2770
            ],
            [
                3094,
                3096
            ],
            [
                2785,
                2793
            ],
            [
                2802,
                2815
            ],
            [
                2492,
                2493
            ],
            [
                2826,
                2840
            ],
            [
                2846,
                2964
            ],
            [
                3122,
                3137
            ],
            [
                3162,
                3174
            ],
            [
                3006,
                3024
            ],
            [
                3036,
                3039
            ],
            [
                3050,
                3055
            ],
            [
                3363,
                3364
            ],
            [
                3180,
                3208
            ],
            [
                3210,
                3223
            ],
            [
                3261,
                3263
            ],
            [
                3208,
                3209
            ],
            [
                3400,
                3412
            ],
            [
                3466,
                3490
            ],
            [
                3490,
                3521
            ],
            [
                3527,
                3560
            ],
            [
                3749,
                3761
            ],
            [
                3597,
                3609
            ],
            [
                3591,
                3592
            ],
            [
                3579,
                3583
            ],
            [
                3588,
                3590
            ],
            [
                3621,
                3622
            ],
            [
                3639,
                3644
            ],
            [
                3648,
                3673
            ],
            [
                3702,
                3733
            ],
            [
                3738,
                3748
            ],
            [
                3775,
                3794
            ],
            [
                3803,
                3842
            ],
            [
                3855,
                3860
            ],
            [
                3798,
                3802
            ],
            [
                3877,
                3905
            ],
            [
                3907,
                3914
            ],
            [
                3921,
                3933
            ],
            [
                3935,
                3975
            ],
            [
                3985,
                3989
            ],
            [
                3991,
                4004
            ],
            [
                3933,
                3934
            ],
            [
                4013,
                4035
            ]
        ],
        "row_chars": [
            [
                0,
                371
            ],
            [
                371,
                576
            ],
            [
                576,
                852
            ],
            [
                852,
                910
            ],
            [
                910,
                996
            ],
            [
                996,
                1278
            ],
            [
                1278,
                2312
            ],
            [
                2312,
                2346
            ],
            [
                2346,
                3176
            ],
            [
                3176,
                3490
            ],
            [
                3490,
                3917
            ],
            [
                3917,
                4035
            ]
        ]
    },
    "abridged": {
        "text": "I told the Christian reader in the beginning of the chapter which preceded my uncle Toby's apologetical oration, that the peace of Utrecht almost parted my uncle Toby from his hobby-horse.\nThere is an indignant way in which a man sometimes dismounts his horse, which as good as says, 'I'll go afoot all my life, before I would ride a single mile upon your back again.'\nNow my uncle Toby could not be said to dismount his horse in this manner, or indeed, at all - rather, his horse flung him - and somewhat viciously. It created a sort of shyness betwixt my uncle Toby and his hobby-horse. He had no use for him from March to November, except now and then to take a short ride out, just to see that the fortifications and harbour of Dunkirk were correctly demolished.\nThe French were so backwards all that summer in setting about it, and Monsieur Tugghe, the Deputy at Dunkirk, presented so many affecting petitions to the queen, beseeching her to cause her thunder-bolts to fall only upon the martial works; and the queen having pity, and her ministers not wishing to have the town dismantled, for these private reasons, * * * * * * * * * * * * * * * * * * * * * * * * * * - it was three full months after my uncle Toby and the corporal had constructed the town, ready to be destroyed, that the commandants, deputies and negotiators would permit him to do so.\n-Fatal inactivity!\nThe corporal was all for beginning the demolition, by making a breach in the ramparts.\n'No, that will never do,' said my uncle Toby, 'for then the English garrison will not be safe an hour; because if the French are treacherous-'\n'They are as treacherous as devils, your honour,' said the corporal.\n'It gives me concern to hear it, Trim,' said my uncle Toby, 'for they don't lack personal bravery; and if a breach is made in the ramparts, they may enter it, and make themselves masters of the place.'\n'Let them enter, if they dare,' said the corporal, brandishing his spade.\n'In cases like this, corporal,' said my uncle Toby, 'a commandant must act with prudence. We will begin with the outworks towards the sea and the land, and demolish the most distant, Fort Louis, first - and the rest, one by one, as we retreat towards the town; then we'll fill up the harbour - retire into the citadel, and blow it up: and then, corporal, we'll embark for England.'\n'We are there,' quoth the corporal, recollecting himself.\n'Very true,' said my uncle Toby, looking at the church.",
        "paragraph_chars": [
            [
                0,
                189
            ],
            [
                189,
                369
            ],
            [
                369,
                767
            ],
            [
                767,
                1360
            ],
            [
                1360,
                1379
            ],
            [
                1379,
                1466
            ],
            [
                1466,
                1609
            ],
            [
                1609,
                1678
            ],
            [
                1678,
                1880
            ],
            [
                1880,
                1954
            ],
            [
                1954,
                2336
            ],
            [
                2336,
                2394
            ],
            [
                2394,
                2449
            ]
        ],
        "segment_chars": [
            [
                0,
                189
            ],
            [
                189,
                369
            ],
            [
                369,
                517
            ],
            [
                517,
                589
            ],
            [
                589,
                767
            ],
            [
                767,
                1360
            ],
            [
                1360,
                1379
            ],
            [
                1379,
                1466
            ],
            [
                1466,
                1609
            ],
            [
                1609,
                1678
            ],
            [
                1678,
                1880
            ],
            [
                1880,
                1954
            ],
            [
                1954,
                2044
            ],
            [
                2044,
                2336
            ],
            [
                2336,
                2394
            ],
            [
                2394,
                2449
            ]
        ],
        "overlap_chars": [
            [
                0,
                83
            ],
            [
                88,
                90
            ],
            [
                91,
                112
            ],
            [
                113,
                130
            ],
            [
                131,
                138
            ],
            [
                153,
                161
            ],
            [
                167,
                171
            ],
            [
                172,
                187
            ],
            [
                187,
                189
            ],
            [
                189,
                282
            ],
            [
                282,
                283
            ],
            [
                285,
                298
            ],
            [
                299,
                302
            ],
            [
                303,
                366
            ],
            [
                369,
                381
            ],
            [
                382,
                384
            ],
            [
                387,
                441
            ],
            [
                441,
                442
            ],
            [
                452,
                453
            ],
            [
                454,
                460
            ],
            [
                463,
                469
            ],
            [
                471,
                480
            ],
            [
                481,
                490
            ],
            [
                493,
                505
            ],
            [
                513,
                517
            ],
            [
                517,
                527
            ],
            [
                528,
                562
            ],
            [
                568,
                589
            ],
            [
                589,
                598
            ],
            [
                603,
                615
            ],
            [
                622,
                624
            ],
            [
                633,
                641
            ],
            [
                642,
                731
            ],
            [
                736,
                739
            ],
            [
                740,
                744
            ],
            [
                755,
                765
            ],
            [
                765,
                767
            ],
            [
                767,
                770
            ],
            [
                778,
                828
            ],
            [
                829,
                831
            ],
            [
                831,
                845
            ],
            [
                846,
                852
            ],
            [
                852,
                864
            ],
            [
                872,
                875
            ],
            [
                875,
                928
            ],
            [
                929,
                943
            ],
            [
                944,
                952
            ],
            [
                953,
                978
            ],
            [
                979,
                983
            ],
            [
                984,
                1006
            ],
            [
                1006,
                1007
            ],
            [
                1008,
                1021
            ],
            [
                1029,
                1033
            ],
            [
                1033,
                1034
            ],
            [
                1035,
                1052
            ],
            [
                1053,
                1064
            ],
            [
                1065,
                1142
            ],
            [
                1143,
                1172
            ],
            [
                1175,
                1181
            ],
            [
                1182,
                1199
            ],
            [
                1200,
                1205
            ],
            [
                1206,
                1214
            ],
            [
                1215,
                1217
            ],
            [
                1220,
                1262
            ],
            [
                1269,
                1294
            ],
            [
                1295,
                1307
            ],
            [
                1308,
                1316
            ],
            [
                1317,
                1320
            ],
            [
                1333,
                1352
            ],
            [
                1356,
                1358
            ],
            [
                1358,
                1359
            ],
            [
                1361,
                1366
            ],
            [
                1367,
                1379
            ],
            [
                1379,
                1395
            ],
            [
                1400,
                1464
            ],
            [
                1464,
                1465
            ],
            [
                1466,
                1467
            ],
            [
                1467,
                1470
            ],
            [
                1471,
                1489
            ],
            [
                1492,
                1505
            ],
            [
                1506,
                1508
            ],
            [
                1510,
                1511
            ],
            [
                1512,
                1513
            ],
            [
                1513,
                1516
            ],
            [
                1522,
                1525
            ],
            [
                1526,
                1533
            ],
            [
                1534,
                1559
            ],
            [
                1560,
                1583
            ],
            [
                1591,
                1606
            ],
            [
                1615,
                1644
            ],
            [
                1645,
                1656
            ],
            [
                1659,
                1676
            ],
            [
                1679,
                1698
            ],
            [
                1699,
                1701
            ],
            [
                1702,
                1710
            ],
            [
                1718,
                1731
            ],
            [
                1736,
                1737
            ],
            [
                1739,
                1753
            ],
            [
                1759,
                1877
            ],
            [
                1881,
                1896
            ],
            [
                1897,
                1909
            ],
            [
                1912,
                1930
            ],
            [
                1943,
                1946
            ],
            [
                1947,
                1952
            ],
            [
                1954,
                1955
            ],
            [
                1955,
                1983
            ],
            [
                1986,
                1999
            ],
            [
                2000,
                2002
            ],
            [
                2004,
                2005
            ],
            [
                2007,
                2019
            ],
            [
                2020,
                2044
            ],
            [
                2044,
                2075
            ],
            [
                2076,
                2109
            ],
            [
                2110,
                2122
            ],
            [
                2123,
                2135
            ],
            [
                2135,
                2136
            ],
            [
                2137,
                2141
            ],
            [
                2145,
                2147
            ],
            [
                2147,
                2148
            ],
            [
                2149,
                2154
            ],
            [
                2157,
                2182
            ],
            [
                2183,
                2214
            ],
            [
                2215,
                2225
            ],
            [
                2226,
                2245
            ],
            [
                2248,
                2287
            ],
            [
                2287,
                2292
            ],
            [
                2293,
                2297
            ],
            [
                2297,
                2325
            ],
            [
                2326,
                2333
            ],
            [
                2337,
                2349
            ],
            [
                2352,
                2392
            ],
            [
                2400,
                2404
            ],
            [
                2407,
                2420
            ],
            [
                2425,
                2426
            ],
            [
                2427,
                2449
            ]
        ],
        "row_chars": [
            [
                0,
                189
            ],
            [
                189,
                369
            ],
            [
                369,
                517
            ],
            [
                517,
                517
            ],
            [
                517,
                589
            ],
            [
                589,
                767
            ],
            [
                767,
                1360
            ],
            [
                1360,
                1379
            ],
            [
                1379,
                1954
            ],
            [
                1954,
                2044
            ],
            [
                2044,
                2336
            ],
            [
                2336,
                2449
            ]
        ]
    }
}