{
    "original": {
        "text": "To my uncle Mr. _Toby Shandy_ do I stand indebted for the preceding anecdote, to whom my father, who was an excellent natural philosopher, and much given to close reasoning upon the smallest matters, had oft, and heavily complained of the injury; but once more particularly, as my uncle _Toby_ well remember'd, upon his observing a most unaccountable obliquity (as he call'd it) in my manner of setting up my top, and justifying the principles upon which I had done it, --the old gentleman shook his head, and in a tone more expressive by half of sorrow than reproach, --he said his heart all along foreboded, and he saw it verified in this, and from a thousand other observations he had made upon me, That I should neither think nor act like any other man's child: --_But alas!_ continued he, shaking his head a second time, and wiping away a tear which was trickling down his cheeks, _My Tristram's misfortunes began nine months before ever he came into the world_.\n--My mother, who was sitting by, look'd up, --but she knew no more than her backside what my father meant, --but my uncle, Mr. _Toby Shandy_, who had been often informed of the affair, --understood him very well.",
        "paragraph_chars": [
            [
                0,
                968
            ],
            [
                968,
                1180
            ]
        ],
        "segment_chars": [
            [
                0,
                968
            ],
            [
                968,
                1180
            ]
        ],
        "overlap_chars": [
            [
                33,
                34
            ],
            [
                54,
                76
            ],
            [
                0,
                15
            ],
            [
                154,
                156
            ],
            [
                536,
                538
            ],
            [
                22,
                28
            ],
            [
                76,
                95
            ],
            [
                200,
                207
            ],
            [
                209,
                245
            ],
            [
                251,
                255
            ],
            [
                95,
                96
            ],
            [
                261,
                286
            ],
            [
                173,
                177
            ],
            [
                756,
                758
            ],
            [
                320,
                350
            ],
            [
                379,
                408
            ],
            [
                409,
                413
            ],
            [
                472,
                514
            ],
            [
                547,
                553
            ],
            [
                515,
                519
            ],
            [
                574,
                588
            ],
            [
                457,
                460
            ],
            [
                589,
                608
            ],
            [
                702,
                752
            ],
            [
                759,
                764
            ],
            [
                362,
                364
            ],
            [
                780,
                793
            ],
            [
                830,
                836
            ],
            [
                842,
                848
            ],
            [
                646,
                650
            ],
            [
                874,
                885
            ],
            [
                887,
                965
            ],
            [
                970,
                1000
            ],
            [
                1008,
                1011
            ],
            [
                1014,
                1073
            ],
            [
                1073,
                1074
            ],
            [
                1081,
                1094
            ],
            [
                1101,
                1107
            ],
            [
                1108,
                1152
            ],
            [
                1166,
                1180
            ]
        ],
        "row_chars": [
            [
                0,
                968
            ],
            [
                968,
                1180
            ]
        ]
    },
    "abridged": {
        "text": "I owe the preceding anecdote to my uncle Mr. Toby Shandy, to whom my father had oft and heavily complained of the injury. Once, particularly, as my uncle Toby remembered - upon my father's observing a most unaccountable slant in my manner of setting up my spinning-top, the old gentleman shook his head, and in a sorrowful tone said his heart had all along foreboded that I should neither think nor act like any other child.\n'Alas!' continued he, wiping a tear from his cheeks, 'my Tristram's misfortunes began nine months before ever he came into the world.'\nMy mother, who was sitting by, looked up, but she knew no more than her backside what my father meant. However, my uncle, Mr. Toby Shandy, who had been often informed of the affair, understood him very well.",
        "paragraph_chars": [
            [
                0,
                425
            ],
            [
                425,
                560
            ],
            [
                560,
                767
            ]
        ],
        "segment_chars": [
            [
                0,
                122
            ],
            [
                122,
                425
            ],
            [
                425,
                433
            ],
            [
                433,
                560
            ],
            [
                560,
                663
            ],
            [
                663,
                767
            ]
        ],
        "overlap_chars": [
            [
                0,
                1
            ],
            [
                6,
                28
            ],
            [
                29,
                44
            ],
            [
                45,
                47
            ],
            [
                47,
                49
            ],
            [
                50,
                56
            ],
            [
                56,
                75
            ],
            [
                76,
                83
            ],
            [
                84,
                120
            ],
            [
                122,
                126
            ],
            [
                126,
                127
            ],
            [
                128,
                153
            ],
            [
                172,
                176
            ],
            [
                186,
                188
            ],
            [
                189,
                219
            ],
            [
                226,
                255
            ],
            [
                265,
                269
            ],
            [
                270,
                312
            ],
            [
                313,
                319
            ],
            [
                323,
                327
            ],
            [
                328,
                342
            ],
            [
                343,
                346
            ],
            [
                347,
                366
            ],
            [
                367,
                417
            ],
            [
                418,
                423
            ],
            [
                428,
                430
            ],
            [
                433,
                446
            ],
            [
                447,
                453
            ],
            [
                454,
                460
            ],
            [
                461,
                465
            ],
            [
                466,
                477
            ],
            [
                479,
                557
            ],
            [
                560,
                590
            ],
            [
                598,
                601
            ],
            [
                602,
                661
            ],
            [
                670,
                671
            ],
            [
                672,
                685
            ],
            [
                691,
                697
            ],
            [
                697,
                741
            ],
            [
                753,
                767
            ]
        ],
        "row_chars": [
            [
                0,
                560
            ],
            [
                560,
                767
            ]
        ]
    }
}