{
    "original": {
        "text": "No ----I think, I said, I would write two volumes every year, provided the vile cough which then tormented me, and which to this hour I dread worse than the devil, would but give me leave--and in another place--(but where, I can't recollect now) speaking of my book as a _machine_, and laying my pen and ruler down cross-wise upon the table, in order to gain the greater credit to it --I swore it should be kept a going at that rate these forty years, if it pleased but the fountain of life to bless me so long with health and good spirits.\nNow as for my spirits, little have I to lay to their charge--nay so very little (unless the mounting me upon a long stick and playing the fool with me nineteen hours out of the twenty-four, be accusations) that on the contrary, I have much--much to thank 'em for: cheerily have ye made me tread the path of life with all the burthens of it (except its cares) upon my back; in no one moment of my existence, that I remember, have ye once deserted me, or tinged the objects which came in my way, either with sable, or with a sickly green; in dangers ye gilded my horizon with hope, and when DEATH himself knocked at my door--ye bad him come again; and in so gay a tone of careless indifference did ye do it, that he doubted of his commission----\n\"--There must certainly be some mistake in this matter,\" quoth he.\nNow there is nothing in this world I abominate worse, than to be interrupted in a story----and I was that moment telling _Eugenius_ a most tawdry one in my way, of a nun who fancied herself a shell-fish, and of a monk damn'd for eating a muscle, and was shewing him the grounds and justice of the procedure----\n\"--Did ever so grave a personage get into so vile a scrape?\" quoth Death. Thou hast had a narrow escape, _Tristram_, said _Eugenius_, taking hold of my hand as I finished my story----\nBut there is no _living_, _Eugenius_, replied I, at this rate; for as this _son of a whore_ has found out my lodgings----\n--You call him rightly, said _Eugenius_, --for by sin, we are told, he enter'd the world ----I care not which way he enter'd, quoth I, provided he be not in such a hurry to take me out with him--for I have forty volumes to write, and forty thousand things to say and do which no body in the world will say and do for me, except thyself; and as thou seest he has got me by the throat (for _Eugenius_ could scarce hear me speak across the table), and that I am no match for him in the open field, had I not better, whilst these few scatter'd spirits remain, and these two spider legs of mine (holding one of them up to him) are able to support me--had I not better, _Eugenius_, fly for my life? 'Tis my advice, my dear _Tristram_, said _Eugenius_ --Then by heaven! I will lead him a dance he little thinks of----for I will gallop, quoth I, without looking once behind me, to the banks of the _Garonne_; and if I hear him clattering at my heels ----I'll scamper away to mount _Vesuvius_----from thence to _Joppa_, and from _Joppa_ to the world's end; where, if he follows me, I pray God he may break his neck----\n--He runs more risk _there_, said _Eugenius_, than thou.\n_Eugenius's_ wit and affection brought blood into the cheek from whence it had been some months banish'd----'twas a vile moment to bid adieu in; he led me to my chaise----_Allons!_ said I; the postboy gave a crack with his whip----off I went like a cannon, and in half a dozen bounds got into _Dover_.",
        "paragraph_chars": [
            [
                0,
                541
            ],
            [
                541,
                1285
            ],
            [
                1285,
                1352
            ],
            [
                1352,
                1663
            ],
            [
                1663,
                1847
            ],
            [
                1847,
                1969
            ],
            [
                1969,
                3079
            ],
            [
                3079,
                3136
            ],
            [
                3136,
                3437
            ]
        ],
        "segment_chars": [
            [
                0,
                541
            ],
            [
                541,
                1285
            ],
            [
                1285,
                1352
            ],
            [
                1352,
                1663
            ],
            [
                1663,
                1724
            ],
            [
                1724,
                1737
            ],
            [
                1737,
                1847
            ],
            [
                1847,
                1969
            ],
            [
                1969,
                2662
            ],
            [
                2662,
                2732
            ],
            [
                2732,
                3079
            ],
            [
                3079,
                3136
            ],
            [
                3136,
                3437
            ]
        ],
        "overlap_chars": [
            [
                0,
                2
            ],
            [
                320,
                321
            ],
            [
                7,
                120
            ],
            [
                134,
                169
            ],
            [
                179,
                181
            ],
            [
                189,
                209
            ],
            [
                211,
                245
            ],
            [
                386,
                411
            ],
            [
                414,
                454
            ],
            [
                503,
                541
            ],
            [
                541,
                563
            ],
            [
                667,
                730
            ],
            [
                769,
                775
            ],
            [
                782,
                803
            ],
            [
                805,
                861
            ],
            [
                889,
                892
            ],
            [
                900,
                913
            ],
            [
                970,
                972
            ],
            [
                571,
                575
            ],
            [
                973,
                989
            ],
            [
                1078,
                1162
            ],
            [
                1164,
                1166
            ],
            [
                866,
                867
            ],
            [
                1171,
                1185
            ],
            [
                767,
                768
            ],
            [
                1191,
                1200
            ],
            [
                663,
                666
            ],
            [
                1211,
                1219
            ],
            [
                1201,
                1207
            ],
            [
                1247,
                1262
            ],
            [
                1266,
                1269
            ],
            [
                1294,
                1324
            ],
            [
                1342,
                1352
            ],
            [
                1352,
                1388
            ],
            [
                1399,
                1439
            ],
            [
                1443,
                1472
            ],
            [
                1474,
                1482
            ],
            [
                1484,
                1501
            ],
            [
                1511,
                1569
            ],
            [
                1577,
                1589
            ],
            [
                1596,
                1605
            ],
            [
                1614,
                1621
            ],
            [
                1634,
                1658
            ],
            [
                1670,
                1692
            ],
            [
                1696,
                1721
            ],
            [
                1724,
                1736
            ],
            [
                1742,
                1767
            ],
            [
                1774,
                1777
            ],
            [
                1780,
                1784
            ],
            [
                1786,
                1794
            ],
            [
                1795,
                1803
            ],
            [
                1812,
                1842
            ],
            [
                1847,
                1862
            ],
            [
                1864,
                1870
            ],
            [
                1871,
                1872
            ],
            [
                1874,
                1882
            ],
            [
                1885,
                1895
            ],
            [
                1899,
                1903
            ],
            [
                1923,
                1937
            ],
            [
                1939,
                1964
            ],
            [
                2168,
                2244
            ],
            [
                2253,
                2288
            ],
            [
                2304,
                2323
            ],
            [
                1991,
                1992
            ],
            [
                2327,
                2356
            ],
            [
                1999,
                2007
            ],
            [
                2368,
                2394
            ],
            [
                2423,
                2494
            ],
            [
                2535,
                2558
            ],
            [
                2591,
                2613
            ],
            [
                2615,
                2631
            ],
            [
                2645,
                2660
            ],
            [
                2667,
                2685
            ],
            [
                2692,
                2695
            ],
            [
                2698,
                2702
            ],
            [
                2704,
                2712
            ],
            [
                2662,
                2664
            ],
            [
                2721,
                2732
            ],
            [
                2732,
                2755
            ],
            [
                2779,
                2796
            ],
            [
                2839,
                2858
            ],
            [
                2860,
                2867
            ],
            [
                2798,
                2806
            ],
            [
                2870,
                2910
            ],
            [
                2915,
                2941
            ],
            [
                2946,
                2951
            ],
            [
                2978,
                2988
            ],
            [
                2997,
                3015
            ],
            [
                3024,
                3074
            ],
            [
                3081,
                3098
            ],
            [
                3100,
                3105
            ],
            [
                3108,
                3112
            ],
            [
                3114,
                3122
            ],
            [
                3106,
                3107
            ],
            [
                3125,
                3134
            ],
            [
                3137,
                3147
            ],
            [
                3149,
                3231
            ],
            [
                3244,
                3276
            ],
            [
                3279,
                3303
            ],
            [
                3308,
                3314
            ],
            [
                3317,
                3336
            ],
            [
                3355,
                3363
            ],
            [
                3367,
                3428
            ]
        ],
        "row_chars": [
            [
                0,
                541
            ],
            [
                541,
                1285
            ],
            [
                1285,
                1352
            ],
            [
                1352,
                1663
            ],
            [
                1663,
                1724
            ],
            [
                1724,
                1737
            ],
            [
                1737,
                1847
            ],
            [
                1847,
                1969
            ],
            [
                1969,
                2662
            ],
            [
                2662,
                2732
            ],
            [
                2732,
                3079
            ],
            [
                3079,
                3136
            ],
            [
                3136,
                3437
            ]
        ]
    },
    "abridged": {
        "text": "No - I think, I said, I would write two volumes every year, provided the vile cough which then tormented me, and which I dread worse than the devil, would allow me - and in another place (but where, I can't recollect now) I swore it should be kept going at that rate these forty years, if I were blessed so long with health and good spirits.\nNow as for my spirits, apart from playing the fool with me nineteen hours out of the twenty-four, I have much to thank 'em for. Cheerily have ye made me tread the path of life with all its burdens upon my back; ye have never once deserted me. In dangers ye gilded my horizon with hope, and when Death himself knocked at my door - ye bade him come again, in so gay and careless a tone that he doubted his mission-\n'There must certainly be some mistake,' quoth he.\nNow there is nothing in this world I hate worse, than to be interrupted in a story - and I was that moment telling Eugenius a most tawdry one, of a nun who fancied herself a shell-fish, and of a monk damned for eating a mussel, and was showing him the justice of the procedure-\n'Did ever so grave a person get into so vile a scrape?' quoth Death.\n'Thou hast had a narrow escape, Tristram,' said Eugenius, taking my hand as I finished my story.\n'But there is no living, Eugenius,' replied I, 'now that this son of a whore has found out my lodgings. I have forty volumes to write, and forty thousand things to say and do which nobody in the world will say and do for me; and as thou seest, Death has got me by the throat (for Eugenius could scarce hear me speak). As I am no match for him in the open field, had I not better, whilst these two spider legs of mine are able to support me - had I not better fly for my life?'\n''Tis my advice, my dear Tristram,' said Eugenius.\n'Then by heaven! I will lead him a dance - for I will gallop to the banks of the Garonne,' quoth I, 'and if I hear him clattering at my heels I'll scamper away to Mount Vesuvius, and from there to the world's end. If he follows me, I pray God he may break his neck.'\n'He runs more risk there,' said Eugenius, 'than thou.'\nEugenius's wit and affection brought blood into the cheek from whence it had been some months banished. - 'Twas a vile moment to bid adieu; he led me to my chaise.\n'Allons!' said I; the postboy cracked his whip - off I went like a cannon, and in half a dozen bounds got into Dover.",
        "paragraph_chars": [
            [
                0,
                342
            ],
            [
                342,
                755
            ],
            [
                755,
                805
            ],
            [
                805,
                1083
            ],
            [
                1083,
                1152
            ],
            [
                1152,
                1249
            ],
            [
                1249,
                1726
            ],
            [
                1726,
                1777
            ],
            [
                1777,
                2044
            ],
            [
                2044,
                2099
            ],
            [
                2099,
                2263
            ],
            [
                2263,
                2380
            ]
        ],
        "segment_chars": [
            [
                0,
                342
            ],
            [
                342,
                470
            ],
            [
                470,
                585
            ],
            [
                585,
                755
            ],
            [
                755,
                805
            ],
            [
                805,
                1083
            ],
            [
                1083,
                1139
            ],
            [
                1139,
                1152
            ],
            [
                1152,
                1249
            ],
            [
                1249,
                1353
            ],
            [
                1353,
                1567
            ],
            [
                1567,
                1726
            ],
            [
                1726,
                1777
            ],
            [
                1777,
                1794
            ],
            [
                1794,
                1991
            ],
            [
                1991,
                2044
            ],
            [
                2044,
                2099
            ],
            [
                2099,
                2203
            ],
            [
                2203,
                2263
            ],
            [
                2263,
                2273
            ],
            [
                2273,
                2380
            ]
        ],
        "overlap_chars": [
            [
                0,
                2
            ],
            [
                3,
                4
            ],
            [
                5,
                118
            ],
            [
                119,
                154
            ],
            [
                161,
                163
            ],
            [
                166,
                186
            ],
            [
                187,
                221
            ],
            [
                222,
                247
            ],
            [
                248,
                288
            ],
            [
                304,
                342
            ],
            [
                342,
                364
            ],
            [
                376,
                439
            ],
            [
                440,
                446
            ],
            [
                447,
                468
            ],
            [
                470,
                526
            ],
            [
                527,
                530
            ],
            [
                539,
                552
            ],
            [
                553,
                555
            ],
            [
                556,
                560
            ],
            [
                567,
                583
            ],
            [
                585,
                669
            ],
            [
                672,
                674
            ],
            [
                675,
                676
            ],
            [
                680,
                694
            ],
            [
                694,
                695
            ],
            [
                696,
                705
            ],
            [
                706,
                709
            ],
            [
                710,
                718
            ],
            [
                719,
                725
            ],
            [
                726,
                741
            ],
            [
                742,
                745
            ],
            [
                762,
                792
            ],
            [
                795,
                805
            ],
            [
                805,
                841
            ],
            [
                847,
                887
            ],
            [
                890,
                919
            ],
            [
                920,
                928
            ],
            [
                929,
                946
            ],
            [
                946,
                1004
            ],
            [
                1012,
                1024
            ],
            [
                1031,
                1040
            ],
            [
                1049,
                1056
            ],
            [
                1057,
                1081
            ],
            [
                1088,
                1110
            ],
            [
                1111,
                1136
            ],
            [
                1139,
                1151
            ],
            [
                1158,
                1183
            ],
            [
                1189,
                1192
            ],
            [
                1195,
                1199
            ],
            [
                1200,
                1208
            ],
            [
                1208,
                1216
            ],
            [
                1217,
                1247
            ],
            [
                1250,
                1265
            ],
            [
                1266,
                1272
            ],
            [
                1272,
                1273
            ],
            [
                1274,
                1282
            ],
            [
                1285,
                1295
            ],
            [
                1306,
                1310
            ],
            [
                1311,
                1325
            ],
            [
                1326,
                1351
            ],
            [
                1353,
                1429
            ],
            [
                1437,
                1472
            ],
            [
                1472,
                1491
            ],
            [
                1491,
                1492
            ],
            [
                1499,
                1528
            ],
            [
                1529,
                1537
            ],
            [
                1538,
                1564
            ],
            [
                1570,
                1641
            ],
            [
                1642,
                1665
            ],
            [
                1666,
                1688
            ],
            [
                1691,
                1707
            ],
            [
                1708,
                1723
            ],
            [
                1732,
                1750
            ],
            [
                1756,
                1759
            ],
            [
                1762,
                1766
            ],
            [
                1767,
                1775
            ],
            [
                1777,
                1779
            ],
            [
                1783,
                1794
            ],
            [
                1794,
                1817
            ],
            [
                1820,
                1837
            ],
            [
                1838,
                1857
            ],
            [
                1858,
                1865
            ],
            [
                1868,
                1876
            ],
            [
                1878,
                1918
            ],
            [
                1919,
                1945
            ],
            [
                1949,
                1954
            ],
            [
                1954,
                1964
            ],
            [
                1971,
                1989
            ],
            [
                1991,
                2041
            ],
            [
                2045,
                2062
            ],
            [
                2063,
                2068
            ],
            [
                2071,
                2075
            ],
            [
                2076,
                2084
            ],
            [
                2084,
                2085
            ],
            [
                2087,
                2096
            ],
            [
                2099,
                2109
            ],
            [
                2110,
                2192
            ],
            [
                2205,
                2237
            ],
            [
                2237,
                2261
            ],
            [
                2264,
                2270
            ],
            [
                2273,
                2292
            ],
            [
                2301,
                2309
            ],
            [
                2312,
                2373
            ]
        ],
        "row_chars": [
            [
                0,
                342
            ],
            [
                342,
                755
            ],
            [
                755,
                805
            ],
            [
                805,
                1083
            ],
            [
                1083,
                1139
            ],
            [
                1139,
                1152
            ],
            [
                1152,
                1249
            ],
            [
                1249,
                1353
            ],
            [
                1353,
                1726
            ],
            [
                1726,
                1794
            ],
            [
                1794,
                2044
            ],
            [
                2044,
                2099
            ],
            [
                2099,
                2380
            ]
        ]
    }
}