{
    "original": {
        "text": "The learned Bishop _Hall_, I mean the famous Dr. _Joseph Hall_, who was Bishop of _Exeter_ in King _James_ the First's reign, tells us in one of his _Decads_, at the end of his divine art of meditation, imprinted at _London_, in the year 1610, by _John Beal_, dwelling in _Aldersgate-street_, \"That it is an abominable thing for a man to commend himself;\" ----and I really think it is so.\nAnd yet, on the other hand, when a thing is executed in a masterly kind of a fashion, which thing is not likely to be found out; --I think it is full as abominable, that a man should lose the honour of it, and go out of the world with the conceit of it rotting in his head.\nThis is precisely my situation.\nFor in this long digression which I was accidentally led into, as in all my digressions (one only excepted) there is a masterstroke of digressive skill, the merit of which has all along, I fear, been overlooked by my reader, --not for want of penetration in him, --but because 'tis an excellence seldom looked for, or expected indeed, in a digression; --and it is this: That tho' my digressions are all fair, as you observe, --and that I fly off from what I am about, as far, and as often too, as any writer in _Great Britain_; yet I constantly take care to order affairs so that my main business does not stand still in my absence.\nI was just going, for example, to have given you the great outlines of my uncle _Toby's_ most whimsical character; --when my aunt _Dinah_ and the coachman came across us, and led us a vagary some millions of miles into the very heart of the planetary system: Notwithstanding all this, you perceive that the drawing of my uncle _Toby's_ character went on gently all the time; --not the great contours of it, --that was impossible, --but some familiar strokes and faint designations of it, were here and there touch'd on, as we went along, so that you are much better acquainted with my uncle _Toby_ now than you was before.\nBy this contrivance the machinery of my work is of a species by itself; two contrary motions are introduced into it, and reconciled, which were thought to be at variance with each other. In a word, my work is digressive, and it is progressive too, --and at the same time.\nThis, Sir, is a very different story from that of the earth's moving round her axis, in her diurnal rotation, with her progress in her elliptick orbit which brings about the year, and constitutes that variety and vicissitude of seasons we enjoy; --though I own it suggested the thought, --as I believe the greatest of our boasted improvements and discoveries have come from such trifling hints.\nDigressions, incontestably, are the sunshine; ----they are the life, the soul of reading! --take them out of this book, for instance, --you might as well take the book along with them; --one cold eternal winter would reign in every page of it; restore them to the writer; --he steps forth like a bridegroom, --bids All-hail; brings in variety, and forbids the appetite to fail.\nAll the dexterity is in the good cookery and management of them, so as to be not only for the advantage of the reader, but also of the author, whose distress, in this matter, is truly pitiable: For, if he begins a digression, --from that moment, I observe, his whole work stands stock still; --and if he goes on with his main work, --then there is an end of his digression.\n----This is vile work. --For which reason, from the beginning of this, you see, I have constructed the main work and the adventitious parts of it with such intersections, and have so complicated and involved the digressive and progressive movements, one wheel within another, that the whole machine, in general, has been kept a-going; --and, what's more, it shall be kept a-going these forty years, if it pleases the fountain of health to bless me so long with life and good spirits.",
        "paragraph_chars": [
            [
                0,
                389
            ],
            [
                389,
                663
            ],
            [
                663,
                695
            ],
            [
                695,
                1328
            ],
            [
                1328,
                1951
            ],
            [
                1951,
                2223
            ],
            [
                2223,
                2618
            ],
            [
                2618,
                2996
            ],
            [
                2996,
                3370
            ],
            [
                3370,
                3853
            ]
        ],
        "segment_chars": [
            [
                0,
                389
            ],
            [
                389,
                663
            ],
            [
                663,
                695
            ],
            [
                695,
                1328
            ],
            [
                1328,
                1951
            ],
            [
                1951,
                2138
            ],
            [
                2138,
                2223
            ],
            [
                2223,
                2618
            ],
            [
                2618,
                2708
            ],
            [
                2708,
                2996
            ],
            [
                2996,
                3370
            ],
            [
                3370,
                3393
            ],
            [
                3393,
                3853
            ]
        ],
        "overlap_chars": [
            [
                34,
                48
            ],
            [
                50,
                61
            ],
            [
                62,
                81
            ],
            [
                83,
                89
            ],
            [
                91,
                98
            ],
            [
                100,
                105
            ],
            [
                27,
                28
            ],
            [
                116,
                148
            ],
            [
                150,
                156
            ],
            [
                25,
                26
            ],
            [
                159,
                161
            ],
            [
                217,
                223
            ],
            [
                226,
                246
            ],
            [
                248,
                257
            ],
            [
                157,
                158
            ],
            [
                170,
                172
            ],
            [
                276,
                290
            ],
            [
                201,
                202
            ],
            [
                294,
                337
            ],
            [
                346,
                353
            ],
            [
                360,
                365
            ],
            [
                387,
                389
            ],
            [
                389,
                474
            ],
            [
                494,
                503
            ],
            [
                516,
                517
            ],
            [
                520,
                533
            ],
            [
                539,
                552
            ],
            [
                554,
                627
            ],
            [
                636,
                663
            ],
            [
                663,
                695
            ],
            [
                695,
                784
            ],
            [
                784,
                787
            ],
            [
                801,
                919
            ],
            [
                922,
                929
            ],
            [
                935,
                957
            ],
            [
                960,
                997
            ],
            [
                1013,
                1021
            ],
            [
                1030,
                1046
            ],
            [
                1049,
                1064
            ],
            [
                1065,
                1069
            ],
            [
                1075,
                1119
            ],
            [
                1122,
                1125
            ],
            [
                1131,
                1145
            ],
            [
                1163,
                1165
            ],
            [
                1189,
                1205
            ],
            [
                1207,
                1220
            ],
            [
                1221,
                1328
            ],
            [
                1328,
                1380
            ],
            [
                1387,
                1407
            ],
            [
                1413,
                1415
            ],
            [
                1432,
                1441
            ],
            [
                1756,
                1757
            ],
            [
                1445,
                1457
            ],
            [
                1459,
                1464
            ],
            [
                1466,
                1509
            ],
            [
                1519,
                1550
            ],
            [
                1556,
                1585
            ],
            [
                1607,
                1654
            ],
            [
                1660,
                1662
            ],
            [
                1664,
                1702
            ],
            [
                1705,
                1734
            ],
            [
                1760,
                1768
            ],
            [
                1790,
                1795
            ],
            [
                1778,
                1785
            ],
            [
                1816,
                1835
            ],
            [
                1844,
                1918
            ],
            [
                1926,
                1938
            ],
            [
                1943,
                1951
            ],
            [
                1951,
                1958
            ],
            [
                2082,
                2083
            ],
            [
                2023,
                2063
            ],
            [
                1971,
                1995
            ],
            [
                2066,
                2082
            ],
            [
                2136,
                2138
            ],
            [
                2138,
                2175
            ],
            [
                2182,
                2198
            ],
            [
                2205,
                2223
            ],
            [
                2223,
                2306
            ],
            [
                2308,
                2314
            ],
            [
                2323,
                2332
            ],
            [
                2333,
                2364
            ],
            [
                2368,
                2401
            ],
            [
                2403,
                2406
            ],
            [
                2424,
                2431
            ],
            [
                2448,
                2458
            ],
            [
                2467,
                2468
            ],
            [
                2471,
                2479
            ],
            [
                2484,
                2509
            ],
            [
                2512,
                2544
            ],
            [
                2570,
                2618
            ],
            [
                2618,
                2662
            ],
            [
                2668,
                2708
            ],
            [
                2710,
                2751
            ],
            [
                2962,
                2965
            ],
            [
                2754,
                2802
            ],
            [
                2809,
                2854
            ],
            [
                2862,
                2889
            ],
            [
                2892,
                2924
            ],
            [
                2933,
                2941
            ],
            [
                2987,
                2989
            ],
            [
                2974,
                2977
            ],
            [
                2994,
                2996
            ],
            [
                2996,
                3003
            ],
            [
                3014,
                3054
            ],
            [
                3059,
                3060
            ],
            [
                3073,
                3188
            ],
            [
                3190,
                3221
            ],
            [
                3224,
                3240
            ],
            [
                3253,
                3287
            ],
            [
                3290,
                3327
            ],
            [
                3330,
                3370
            ],
            [
                3374,
                3393
            ],
            [
                3395,
                3421
            ],
            [
                3439,
                3468
            ],
            [
                3435,
                3439
            ],
            [
                3516,
                3703
            ],
            [
                3712,
                3749
            ],
            [
                3756,
                3853
            ]
        ],
        "row_chars": [
            [
                0,
                389
            ],
            [
                389,
                663
            ],
            [
                663,
                695
            ],
            [
                695,
                1328
            ],
            [
                1328,
                1951
            ],
            [
                1951,
                2138
            ],
            [
                2138,
                2223
            ],
            [
                2223,
                2618
            ],
            [
                2618,
                2708
            ],
            [
                2708,
                2996
            ],
            [
                2996,
                3370
            ],
            [
                3370,
                3393
            ],
            [
                3393,
                3853
            ]
        ]
    },
    "abridged": {
        "text": "The famous Dr. Joseph Hall, who was Bishop of Exeter in King James I's reign, tells us in one of his Decads, printed at London in the year 1610, by John Beal, of Aldersgate-street, 'That it is an abominable thing for a man to praise himself'; and I agree.\nAnd yet, on the other hand, when a thing is executed in a masterly kind of a fashion, yet likely to go undiscovered; - I think it is just as abominable that a man should lose the honour of it, and go out of the world with the idea of it rotting in his head.\nThis is precisely my situation.\nFor in this long digression which I was accidentally led into, as in all my digressions (apart from one) there is a masterstroke of digressive skill, the merit of which has all along, I fear, been overlooked by my reader, - not for lack of penetration in him, - but because 'tis an excellence seldom expected in a digression; - and it is this:\nThat though my digressions are all fair, as you observe, and though I fly off from my subject as much as any writer in Great Britain; yet I constantly take care to order affairs so that my main business does not stand still in my absence.\nI was just going, for example, to have given you the outlines of my uncle Toby's character, when my aunt Dinah and the coachman came across us, and led us wandering some millions of miles into the heart of the planetary system. Despite this, you perceive that the drawing of my uncle Toby's character went on gently all the time; - not the great contours of it, but some faint strokes were here and there touched on, as we went along, so that you are much better acquainted with my uncle Toby now than you were before.\nBy this means, two contrary motions are introduced into the machinery of my work, and reconciled. In a word, my work is digressive, and progressive too, both at the same time.\nThis, Sir, is a very different story from that of the earth's moving round her axis in her daily rotation, along with her progress in her elliptic orbit which brings about the year and our variety of seasons; - though I admit it suggested the thought, as I believe the greatest of our discoveries have come from such trifling hints.\nDigressions, incontestably, are the sunshine - they are the life, the soul of reading! Take them out of this book, for instance, and you might as well take the book along with them; cold eternal winter would reign in every page. Restore them to the writer; - he steps forth like a bridegroom who bids All-hail to the feast.\nAll the skill is in the good cookery and management of these digressions, not only for the advantage of the reader, but also of the author, whose distress, in this matter, is truly pitiable. For, if he begins a digression, from that moment his whole work stands stock still; - and if he goes on with his main work, then there is an end of his digression.\nThis is vile work. For which reason, from the start, you see, I have constructed this book with such intersections, and have so complicated and involved the digressive and progressive movements, one wheel within another, that the whole machine, in general, has been kept a-going. What's more, it shall be kept a-going for forty years, if it pleases the fountain of health to bless me so long with life and good spirits.",
        "paragraph_chars": [
            [
                0,
                256
            ],
            [
                256,
                514
            ],
            [
                514,
                546
            ],
            [
                546,
                890
            ],
            [
                890,
                1129
            ],
            [
                1129,
                1648
            ],
            [
                1648,
                1824
            ],
            [
                1824,
                2157
            ],
            [
                2157,
                2481
            ],
            [
                2481,
                2836
            ],
            [
                2836,
                3255
            ]
        ],
        "segment_chars": [
            [
                0,
                256
            ],
            [
                256,
                514
            ],
            [
                514,
                546
            ],
            [
                546,
                890
            ],
            [
                890,
                1129
            ],
            [
                1129,
                1357
            ],
            [
                1357,
                1648
            ],
            [
                1648,
                1746
            ],
            [
                1746,
                1824
            ],
            [
                1824,
                2157
            ],
            [
                2157,
                2244
            ],
            [
                2244,
                2386
            ],
            [
                2386,
                2481
            ],
            [
                2481,
                2672
            ],
            [
                2672,
                2836
            ],
            [
                2836,
                2855
            ],
            [
                2855,
                3116
            ],
            [
                3116,
                3255
            ]
        ],
        "overlap_chars": [
            [
                0,
                14
            ],
            [
                15,
                26
            ],
            [
                26,
                45
            ],
            [
                46,
                52
            ],
            [
                53,
                60
            ],
            [
                61,
                66
            ],
            [
                67,
                68
            ],
            [
                68,
                100
            ],
            [
                101,
                107
            ],
            [
                107,
                108
            ],
            [
                117,
                119
            ],
            [
                120,
                126
            ],
            [
                127,
                147
            ],
            [
                148,
                157
            ],
            [
                157,
                158
            ],
            [
                159,
                161
            ],
            [
                165,
                179
            ],
            [
                179,
                180
            ],
            [
                182,
                225
            ],
            [
                233,
                240
            ],
            [
                243,
                248
            ],
            [
                254,
                256
            ],
            [
                256,
                341
            ],
            [
                346,
                355
            ],
            [
                371,
                372
            ],
            [
                375,
                388
            ],
            [
                394,
                407
            ],
            [
                408,
                481
            ],
            [
                487,
                514
            ],
            [
                514,
                546
            ],
            [
                546,
                635
            ],
            [
                646,
                649
            ],
            [
                649,
                767
            ],
            [
                770,
                777
            ],
            [
                783,
                805
            ],
            [
                808,
                845
            ],
            [
                846,
                854
            ],
            [
                855,
                871
            ],
            [
                874,
                889
            ],
            [
                890,
                894
            ],
            [
                902,
                946
            ],
            [
                947,
                950
            ],
            [
                958,
                972
            ],
            [
                984,
                986
            ],
            [
                992,
                1008
            ],
            [
                1009,
                1022
            ],
            [
                1022,
                1129
            ],
            [
                1129,
                1181
            ],
            [
                1182,
                1202
            ],
            [
                1207,
                1209
            ],
            [
                1210,
                1219
            ],
            [
                1219,
                1220
            ],
            [
                1221,
                1233
            ],
            [
                1234,
                1239
            ],
            [
                1240,
                1283
            ],
            [
                1294,
                1325
            ],
            [
                1326,
                1355
            ],
            [
                1365,
                1412
            ],
            [
                1417,
                1419
            ],
            [
                1420,
                1458
            ],
            [
                1461,
                1490
            ],
            [
                1491,
                1499
            ],
            [
                1500,
                1505
            ],
            [
                1506,
                1513
            ],
            [
                1514,
                1533
            ],
            [
                1542,
                1616
            ],
            [
                1622,
                1634
            ],
            [
                1640,
                1648
            ],
            [
                1648,
                1655
            ],
            [
                1661,
                1662
            ],
            [
                1663,
                1703
            ],
            [
                1704,
                1728
            ],
            [
                1728,
                1744
            ],
            [
                1744,
                1746
            ],
            [
                1746,
                1783
            ],
            [
                1784,
                1800
            ],
            [
                1806,
                1824
            ],
            [
                1824,
                1907
            ],
            [
                1908,
                1914
            ],
            [
                1921,
                1930
            ],
            [
                1937,
                1968
            ],
            [
                1971,
                2004
            ],
            [
                2005,
                2008
            ],
            [
                2013,
                2020
            ],
            [
                2021,
                2031
            ],
            [
                2031,
                2032
            ],
            [
                2035,
                2043
            ],
            [
                2050,
                2075
            ],
            [
                2076,
                2108
            ],
            [
                2109,
                2157
            ],
            [
                2157,
                2201
            ],
            [
                2204,
                2244
            ],
            [
                2244,
                2285
            ],
            [
                2286,
                2289
            ],
            [
                2290,
                2338
            ],
            [
                2339,
                2384
            ],
            [
                2386,
                2413
            ],
            [
                2416,
                2448
            ],
            [
                2458,
                2466
            ],
            [
                2467,
                2469
            ],
            [
                2470,
                2473
            ],
            [
                2479,
                2481
            ],
            [
                2481,
                2488
            ],
            [
                2495,
                2535
            ],
            [
                2553,
                2554
            ],
            [
                2555,
                2670
            ],
            [
                2672,
                2703
            ],
            [
                2704,
                2720
            ],
            [
                2721,
                2755
            ],
            [
                2758,
                2795
            ],
            [
                2796,
                2836
            ],
            [
                2836,
                2855
            ],
            [
                2855,
                2881
            ],
            [
                2887,
                2916
            ],
            [
                2917,
                2921
            ],
            [
                2927,
                3114
            ],
            [
                3116,
                3153
            ],
            [
                3158,
                3255
            ]
        ],
        "row_chars": [
            [
                0,
                256
            ],
            [
                256,
                514
            ],
            [
                514,
                546
            ],
            [
                546,
                1129
            ],
            [
                1129,
                1648
            ],
            [
                1648,
                1746
            ],
            [
                1746,
                1824
            ],
            [
                1824,
                2157
            ],
            [
                2157,
                2244
            ],
            [
                2244,
                2481
            ],
            [
                2481,
                2836
            ],
            [
                2836,
                2855
            ],
            [
                2855,
                3255
            ]
        ]
    }
}