{
    "original": {
        "text": "Was I in a condition to stipulate with Death, as I am this moment with my apothecary, how and where I will take his clyster ----I should certainly declare against submitting to it before my friends; and therefore I never seriously think upon the mode and manner of this great catastrophe, which generally takes up and torments my thoughts as much as the catastrophe itself; but I constantly draw the curtain across it with this wish, that the Disposer of all things may so order it, that it happen not to me in my own house----but rather in some decent inn----at home, I know it, ----the concern of my friends, and the last services of wiping my brows, and smoothing my pillow, which the quivering hand of pale affection shall pay me, will so crucify my soul; that I shall die of a distemper which my physician is not aware of: but in an inn, the few cold offices I wanted, would be purchased with a few guineas, and paid me with an undisturbed, but punctual attention----but mark. This inn should not be the inn at _Abbeville_----if there was not another inn in the universe, I would strike that inn out of the capitulation: so\nLet the horses be in the chaise exactly by four in the morning ----Yes, by four, Sir, ----or by _Genevieve!_ I'll raise a clatter in the house shall wake the dead.",
        "paragraph_chars": [
            [
                0,
                1129
            ],
            [
                1129,
                1292
            ]
        ],
        "segment_chars": [
            [
                0,
                982
            ],
            [
                982,
                1129
            ],
            [
                1129,
                1292
            ]
        ],
        "overlap_chars": [
            [
                4,
                5
            ],
            [
                39,
                45
            ],
            [
                71,
                115
            ],
            [
                128,
                146
            ],
            [
                21,
                23
            ],
            [
                174,
                197
            ],
            [
                203,
                245
            ],
            [
                255,
                294
            ],
            [
                318,
                438
            ],
            [
                466,
                469
            ],
            [
                488,
                497
            ],
            [
                502,
                507
            ],
            [
                498,
                501
            ],
            [
                508,
                523
            ],
            [
                527,
                556
            ],
            [
                560,
                575
            ],
            [
                481,
                482
            ],
            [
                584,
                610
            ],
            [
                636,
                651
            ],
            [
                653,
                677
            ],
            [
                735,
                739
            ],
            [
                743,
                759
            ],
            [
                828,
                855
            ],
            [
                624,
                632
            ],
            [
                864,
                872
            ],
            [
                874,
                916
            ],
            [
                925,
                968
            ],
            [
                972,
                982
            ],
            [
                982,
                1015
            ],
            [
                1017,
                1026
            ],
            [
                1075,
                1076
            ],
            [
                1031,
                1043
            ],
            [
                1056,
                1075
            ],
            [
                1129,
                1146
            ],
            [
                1169,
                1191
            ],
            [
                1196,
                1213
            ],
            [
                1235,
                1236
            ],
            [
                1219,
                1221
            ],
            [
                1238,
                1292
            ]
        ],
        "row_chars": [
            [
                0,
                982
            ],
            [
                982,
                1129
            ],
            [
                1129,
                1292
            ]
        ]
    },
    "abridged": {
        "text": "If I could tell Death, like my apothecary, how and where I will take his purge - I should certainly refuse to submit to it before my friends. Therefore I never seriously think upon the manner of this great catastrophe, which torments my thoughts as much as the catastrophe itself; but I constantly draw the curtain across it with this wish, that God may let it happen to me not in my own house - but rather in some decent inn. At home, I know, the concern of my friends, wiping my brows and smoothing my pillow, will crucify my soul; but in an inn, the few cold services I wanted would be purchased with a few guineas, and provided with an undisturbed, but punctual attention.\n- But mark. This inn should not be the inn at Abbeville, even if there was no other inn in the universe.\nLet the horses be ready by four in the morning - Yes, by four, Sir! or I'll raise a clatter in the house shall wake the dead.",
        "paragraph_chars": [
            [
                0,
                677
            ],
            [
                677,
                782
            ],
            [
                782,
                907
            ]
        ],
        "segment_chars": [
            [
                0,
                142
            ],
            [
                142,
                427
            ],
            [
                427,
                677
            ],
            [
                677,
                689
            ],
            [
                689,
                782
            ],
            [
                782,
                850
            ],
            [
                850,
                907
            ]
        ],
        "overlap_chars": [
            [
                3,
                4
            ],
            [
                16,
                22
            ],
            [
                28,
                72
            ],
            [
                81,
                99
            ],
            [
                107,
                109
            ],
            [
                117,
                140
            ],
            [
                142,
                184
            ],
            [
                185,
                224
            ],
            [
                225,
                345
            ],
            [
                350,
                353
            ],
            [
                358,
                367
            ],
            [
                368,
                373
            ],
            [
                374,
                377
            ],
            [
                378,
                393
            ],
            [
                396,
                425
            ],
            [
                427,
                442
            ],
            [
                442,
                443
            ],
            [
                444,
                470
            ],
            [
                471,
                486
            ],
            [
                487,
                511
            ],
            [
                512,
                516
            ],
            [
                517,
                533
            ],
            [
                534,
                561
            ],
            [
                562,
                570
            ],
            [
                571,
                579
            ],
            [
                580,
                622
            ],
            [
                632,
                675
            ],
            [
                679,
                689
            ],
            [
                689,
                722
            ],
            [
                723,
                732
            ],
            [
                732,
                733
            ],
            [
                739,
                751
            ],
            [
                761,
                780
            ],
            [
                782,
                799
            ],
            [
                806,
                828
            ],
            [
                831,
                848
            ],
            [
                848,
                849
            ],
            [
                850,
                852
            ],
            [
                853,
                907
            ]
        ],
        "row_chars": [
            [
                0,
                689
            ],
            [
                689,
                782
            ],
            [
                782,
                907
            ]
        ]
    }
}