{
    "original": {
        "text": "I have a strong propensity in me to begin this chapter very nonsensically, and I will not baulk my fancy. --Accordingly I set off thus:\nIf the fixture of _Momus's_ glass in the human breast, according to the proposed emendation of that arch-critick, had taken place, ----first, This foolish consequence would certainly have followed, --That the very wisest and very gravest of us all, in one coin or other, must have paid window-money every day of our lives.\nAnd, secondly, That had the said glass been there set up, nothing more would have been wanting, in order to have taken a man's character, but to have taken a chair and gone softly, as you would to a dioptrical beehive, and look'd in, --view'd the soul stark naked; --observed all her motions, --her machinations; --traced all her maggots from their first engendering to their crawling forth; --watched her loose in her frisks, her gambols, her capricios; and after some notice of her more solemn deportment, consequent upon such frisks, etc. ----then taken your pen and ink and set down nothing but what you had seen, and could have sworn to: --But this is an advantage not to be had by the biographer in this planet; --in the planet _Mercury_ (belike) it may be so, if not better still for him; ----for there the intense heat of the country, which is proved by computators, from its vicinity to the sun, to be more than equal to that of red-hot iron, --must, I think, long ago have vitrified the bodies of the inhabitants, (as the efficient cause) to suit them for the climate (which is the final cause); so that betwixt them both, all the tenements of their souls, from top to bottom, may be nothing else, for aught the soundest philosophy can shew to the contrary, but one fine transparent body of clear glass (bating the umbilical knot)--so that, till the inhabitants grow old and tolerably wrinkled, whereby the rays of light, in passing through them, become so monstrously refracted, ----or return reflected from their surfaces in such transverse lines to the eye, that a man cannot be seen through; --his soul might as well, unless for mere ceremony, or the trifling advantage which the umbilical point gave her, --might, upon all other accounts, I say, as well play the fool out o'doors as in her own house.\nBut this, as I said above, is not the case of the inhabitants of this earth; --our minds shine not through the body, but are wrapt up here in a dark covering of uncrystalized flesh and blood; so that, if we would come to the specific characters of them, we must go some other way to work.\nMany, in good truth, are the ways, which human wit has been forced to take, to do this thing with exactness.\nSome, for instance, draw all their characters with wind-instruments. --_Virgil_ takes notice of that way in the affair of _Dido_ and _neas_; --but it is as fallacious as the breath of fame; --and, moreover, bespeaks a narrow genius. I am not ignorant that the _Italians_ pretend to a mathematical exactness in their designations of one particular sort of character among them, from the _forte_ or _piano_ of a certain wind-instrument they use, --which they say is infallible. --I dare not mention the name of the instrument in this place; --'tis sufficient we have it amongst us, --but never think of making a drawing by it; --this is nigmatical, and intended to be so, at least _ad populum_: --And therefore, I beg, Madam, when you come here, that you read on as fast as you can, and never stop to make any inquiry about it.\nThere are others again, who will draw a man's character from no other helps in the world, but merely from his evacuations; --but this often gives a very incorrect outline, --unless, indeed, you take a sketch of his repletions too; and by correcting one drawing from the other, compound one good figure out of them both.\nI should have no objection to this method, but that I think it must smell too strong of the lamp, --and be render'd still more operose, by forcing you to have an eye to the rest of his _Non-naturals_. ----Why the most natural actions of a man's life should be called his Non-naturals, --is another question.\nThere are others, fourthly, who disdain every one of these expedients; --not from any fertility of their own, but from the various ways of doing it, which they have borrowed from the honourable devices which the Pentagraphic Brethren[1.3] of the brush have shewn in taking copies. --These, you must know, are your great historians.\nOne of these you will see drawing a full-length character _against the light_; --that's illiberal, --dishonest, --and hard upon the character of the man who sits.\nOthers, to mend the matter, will make a drawing of you in the _Camera_; --that is most unfair of all, --because, _there_ you are sure to be represented in some of your most ridiculous attitudes.\nTo avoid all and every one of these errors in giving you my uncle _Toby's_ character, I am determined to draw it by no mechanical help whatever; ----nor shall my pencil be guided by any one wind-instrument which ever was blown upon, either on this, or on the other side of the _Alps_; --nor will I consider either his repletions or his discharges, --or touch upon his Non-naturals--but, in a word, I will draw my uncle _Toby's_ character from his HOBBY-HORSE.\n[Footnote 1.3: Pentagraph, an instrument to copy Prints and Pictures mechanically, and in any proportion.]",
        "paragraph_chars": [
            [
                0,
                136
            ],
            [
                136,
                459
            ],
            [
                459,
                2275
            ],
            [
                2275,
                2564
            ],
            [
                2564,
                2673
            ],
            [
                2673,
                3499
            ],
            [
                3499,
                3819
            ],
            [
                3819,
                4127
            ],
            [
                4127,
                4459
            ],
            [
                4459,
                4622
            ],
            [
                4622,
                4817
            ],
            [
                4817,
                5277
            ],
            [
                5277,
                5383
            ]
        ],
        "segment_chars": [
            [
                0,
                106
            ],
            [
                106,
                136
            ],
            [
                136,
                459
            ],
            [
                459,
                2275
            ],
            [
                2275,
                2564
            ],
            [
                2564,
                2673
            ],
            [
                2673,
                2742
            ],
            [
                2742,
                2906
            ],
            [
                2906,
                3149
            ],
            [
                3149,
                3499
            ],
            [
                3499,
                3819
            ],
            [
                3819,
                4020
            ],
            [
                4020,
                4127
            ],
            [
                4127,
                4408
            ],
            [
                4408,
                4459
            ],
            [
                4459,
                4622
            ],
            [
                4622,
                4817
            ],
            [
                4817,
                5277
            ],
            [
                5277,
                5383
            ]
        ],
        "overlap_chars": [
            [
                0,
                1
            ],
            [
                33,
                73
            ],
            [
                104,
                106
            ],
            [
                120,
                136
            ],
            [
                136,
                138
            ],
            [
                155,
                162
            ],
            [
                164,
                169
            ],
            [
                250,
                253
            ],
            [
                170,
                172
            ],
            [
                177,
                182
            ],
            [
                189,
                190
            ],
            [
                208,
                216
            ],
            [
                231,
                235
            ],
            [
                151,
                153
            ],
            [
                248,
                249
            ],
            [
                336,
                340
            ],
            [
                240,
                241
            ],
            [
                265,
                266
            ],
            [
                139,
                142
            ],
            [
                271,
                276
            ],
            [
                291,
                308
            ],
            [
                319,
                323
            ],
            [
                276,
                277
            ],
            [
                380,
                383
            ],
            [
                374,
                379
            ],
            [
                407,
                429
            ],
            [
                435,
                459
            ],
            [
                459,
                462
            ],
            [
                483,
                486
            ],
            [
                770,
                771
            ],
            [
                474,
                478
            ],
            [
                517,
                545
            ],
            [
                564,
                566
            ],
            [
                578,
                608
            ],
            [
                627,
                657
            ],
            [
                669,
                681
            ],
            [
                689,
                692
            ],
            [
                1400,
                1401
            ],
            [
                702,
                723
            ],
            [
                739,
                742
            ],
            [
                912,
                913
            ],
            [
                781,
                807
            ],
            [
                826,
                850
            ],
            [
                1146,
                1149
            ],
            [
                2071,
                2075
            ],
            [
                878,
                884
            ],
            [
                623,
                626
            ],
            [
                890,
                897
            ],
            [
                1175,
                1176
            ],
            [
                914,
                917
            ],
            [
                1005,
                1009
            ],
            [
                1098,
                1100
            ],
            [
                1016,
                1028
            ],
            [
                1037,
                1045
            ],
            [
                1058,
                1075
            ],
            [
                2273,
                2275
            ],
            [
                1104,
                1145
            ],
            [
                1150,
                1160
            ],
            [
                1164,
                1175
            ],
            [
                999,
                1000
            ],
            [
                1179,
                1192
            ],
            [
                462,
                463
            ],
            [
                472,
                473
            ],
            [
                1212,
                1225
            ],
            [
                1259,
                1292
            ],
            [
                1359,
                1362
            ],
            [
                1413,
                1482
            ],
            [
                1565,
                1572
            ],
            [
                1646,
                1649
            ],
            [
                567,
                571
            ],
            [
                1735,
                1751
            ],
            [
                1757,
                1771
            ],
            [
                1815,
                1843
            ],
            [
                1854,
                1922
            ],
            [
                1926,
                1948
            ],
            [
                1801,
                1803
            ],
            [
                2030,
                2063
            ],
            [
                2275,
                2278
            ],
            [
                2409,
                2413
            ],
            [
                2345,
                2350
            ],
            [
                2354,
                2399
            ],
            [
                2406,
                2408
            ],
            [
                2414,
                2441
            ],
            [
                2450,
                2474
            ],
            [
                2476,
                2487
            ],
            [
                2309,
                2312
            ],
            [
                2509,
                2519
            ],
            [
                2527,
                2536
            ],
            [
                2540,
                2554
            ],
            [
                2562,
                2564
            ],
            [
                2564,
                2568
            ],
            [
                2585,
                2597
            ],
            [
                2570,
                2572
            ],
            [
                2599,
                2614
            ],
            [
                2643,
                2650
            ],
            [
                2671,
                2673
            ],
            [
                2673,
                2742
            ],
            [
                2745,
                2751
            ],
            [
                2769,
                2794
            ],
            [
                2802,
                2805
            ],
            [
                2889,
                2890
            ],
            [
                2809,
                2811
            ],
            [
                2812,
                2813
            ],
            [
                2816,
                2828
            ],
            [
                2840,
                2861
            ],
            [
                2904,
                2906
            ],
            [
                2906,
                2907
            ],
            [
                2924,
                2932
            ],
            [
                2934,
                2942
            ],
            [
                2944,
                2951
            ],
            [
                2952,
                2954
            ],
            [
                3005,
                3037
            ],
            [
                3048,
                3058
            ],
            [
                3067,
                3069
            ],
            [
                3078,
                3116
            ],
            [
                3119,
                3149
            ],
            [
                3151,
                3196
            ],
            [
                3210,
                3211
            ],
            [
                3294,
                3296
            ],
            [
                3230,
                3251
            ],
            [
                3300,
                3307
            ],
            [
                3309,
                3341
            ],
            [
                3383,
                3395
            ],
            [
                3415,
                3457
            ],
            [
                3464,
                3471
            ],
            [
                3489,
                3499
            ],
            [
                3499,
                3515
            ],
            [
                3523,
                3559
            ],
            [
                3605,
                3621
            ],
            [
                3624,
                3670
            ],
            [
                3673,
                3679
            ],
            [
                3689,
                3713
            ],
            [
                3575,
                3577
            ],
            [
                3725,
                3733
            ],
            [
                3776,
                3800
            ],
            [
                3600,
                3604
            ],
            [
                3808,
                3819
            ],
            [
                3819,
                3916
            ],
            [
                3919,
                3925
            ],
            [
                4106,
                4108
            ],
            [
                3955,
                3987
            ],
            [
                4000,
                4003
            ],
            [
                4037,
                4052
            ],
            [
                4125,
                4127
            ],
            [
                4127,
                4166
            ],
            [
                4180,
                4185
            ],
            [
                4196,
                4197
            ],
            [
                4200,
                4212
            ],
            [
                4223,
                4240
            ],
            [
                4282,
                4286
            ],
            [
                4246,
                4249
            ],
            [
                4177,
                4179
            ],
            [
                4406,
                4408
            ],
            [
                4410,
                4459
            ],
            [
                4459,
                4516
            ],
            [
                4518,
                4535
            ],
            [
                4536,
                4537
            ],
            [
                4540,
                4546
            ],
            [
                4556,
                4557
            ],
            [
                4573,
                4622
            ],
            [
                4622,
                4628
            ],
            [
                4650,
                4683
            ],
            [
                4685,
                4691
            ],
            [
                4696,
                4723
            ],
            [
                4726,
                4733
            ],
            [
                4743,
                4761
            ],
            [
                4774,
                4776
            ],
            [
                4785,
                4817
            ],
            [
                4817,
                4829
            ],
            [
                4847,
                4882
            ],
            [
                4888,
                4890
            ],
            [
                4892,
                4961
            ],
            [
                4966,
                5002
            ],
            [
                5007,
                5022
            ],
            [
                5100,
                5101
            ],
            [
                5104,
                5164
            ],
            [
                5188,
                5189
            ],
            [
                5199,
                5202
            ],
            [
                5204,
                5235
            ],
            [
                5241,
                5243
            ],
            [
                5245,
                5276
            ]
        ],
        "row_chars": [
            [
                0,
                106
            ],
            [
                106,
                136
            ],
            [
                136,
                459
            ],
            [
                459,
                2275
            ],
            [
                2275,
                2564
            ],
            [
                2564,
                2673
            ],
            [
                2673,
                2742
            ],
            [
                2742,
                2906
            ],
            [
                2906,
                3149
            ],
            [
                3149,
                3499
            ],
            [
                3499,
                3819
            ],
            [
                3819,
                4127
            ],
            [
                4127,
                4408
            ],
            [
                4408,
                4459
            ],
            [
                4459,
                4622
            ],
            [
                4622,
                4817
            ],
            [
                4817,
                5277
            ],
            [
                5277,
                5383
            ]
        ]
    },
    "abridged": {
        "text": "I am inclined to begin this chapter very nonsensically. - Accordingly I set off thus:\nIf Momus's glass windows had been fixed in human breasts, as proposed by that mocking spirit of Greek mythology, so that men's thought might be laid bare; - then, the first consequence would have been, that all of us must have paid window-tax every day of our lives.\nAnd the second; that nothing more would have been necessary to examine a man's character, but to have gone softly, as you would to a beehive, and looked in, - viewed the soul stark naked; observed her movements; traced all her maggots from their hatching to their crawling forth; - watched the soul's frisks and gambols; - and then to take your pen and set down what you had seen.\nBut this is an advantage not to be had by any biographer on this planet. In the planet Mercury, perhaps, it may be so, - for there the intense heat of the nearby sun must, I think, long ago have vitrified the bodies of the inhabitants, so that they may have fine transparent bodies of clear glass - until the inhabitants grow old and wrinkled, whereby the rays of light, in passing through them, become monstrously refracted, so that a man cannot be seen through.\nBut here on earth our minds shine not through the body, but are wrapped up in a dark covering of uncrystallised flesh and blood; so that if we would see the characters within, we must do it some other way.\nMany are the ways in which human wit can do this.\nSome, for instance, draw all their characters with wind-instruments. Virgil notes that way in the affair of Dido and Aeneas; but it is as false as the breath of fame. I know that the Italians pretend be able to exactly measure one particular sort of character, from the forte or piano of a certain wind-instrument they use, which they say is infallible. I dare not mention the name of the instrument; it's enough that we have it amongst us. -This is enigmatical, and intended to be so. I beg, Madam, that you read on as fast as you can, and do not stop to inquire about it.\nThere are others who will draw a man's character from his evacuations; but this often gives a very incorrect outline, unless you take a sketch of his in-goings too; and compound one good figure from them both.\nI should have no objection to this method, but that I think it must smell too strong of the lamp, and be made wearisome by forcing you to have an eye to his natural actions.\nThere are others, fourthly, who disdain all these methods; not from any creativity of their own, but because they borrow the ideas of mechanical copyists. - These, you must know, are your great historians.\nOne of these you will see drawing a full-length character against the light; that's dishonest, and hard upon the character of the man who sits.\nOthers will make a drawing of you in the Camera Obscura - that is most unfair of all, because you are sure to be shown in your most ridiculous attitudes.\nTo avoid all these errors in giving you my uncle Toby's character, I am determined to draw it by no mechanical help whatever; nor shall my pencil be guided by any wind-instrument; nor will I consider either his repletions or his discharges, - but in a word, I will draw my uncle Toby's character from his Hobby-Horse.",
        "paragraph_chars": [
            [
                0,
                86
            ],
            [
                86,
                353
            ],
            [
                353,
                734
            ],
            [
                734,
                1198
            ],
            [
                1198,
                1404
            ],
            [
                1404,
                1454
            ],
            [
                1454,
                2028
            ],
            [
                2028,
                2238
            ],
            [
                2238,
                2412
            ],
            [
                2412,
                2618
            ],
            [
                2618,
                2762
            ],
            [
                2762,
                2916
            ],
            [
                2916,
                3233
            ]
        ],
        "segment_chars": [
            [
                0,
                56
            ],
            [
                56,
                86
            ],
            [
                86,
                353
            ],
            [
                353,
                734
            ],
            [
                734,
                807
            ],
            [
                807,
                1198
            ],
            [
                1198,
                1404
            ],
            [
                1404,
                1454
            ],
            [
                1454,
                1523
            ],
            [
                1523,
                1621
            ],
            [
                1621,
                1808
            ],
            [
                1808,
                1895
            ],
            [
                1895,
                1940
            ],
            [
                1940,
                2028
            ],
            [
                2028,
                2238
            ],
            [
                2238,
                2412
            ],
            [
                2412,
                2567
            ],
            [
                2567,
                2618
            ],
            [
                2618,
                2762
            ],
            [
                2762,
                2916
            ],
            [
                2916,
                3233
            ]
        ],
        "overlap_chars": [
            [
                0,
                1
            ],
            [
                14,
                54
            ],
            [
                54,
                56
            ],
            [
                70,
                86
            ],
            [
                86,
                88
            ],
            [
                89,
                96
            ],
            [
                97,
                102
            ],
            [
                111,
                114
            ],
            [
                126,
                128
            ],
            [
                129,
                134
            ],
            [
                142,
                143
            ],
            [
                147,
                155
            ],
            [
                159,
                163
            ],
            [
                179,
                181
            ],
            [
                197,
                198
            ],
            [
                202,
                206
            ],
            [
                241,
                242
            ],
            [
                247,
                248
            ],
            [
                249,
                252
            ],
            [
                253,
                258
            ],
            [
                259,
                276
            ],
            [
                277,
                281
            ],
            [
                286,
                287
            ],
            [
                293,
                296
            ],
            [
                297,
                302
            ],
            [
                303,
                325
            ],
            [
                329,
                353
            ],
            [
                353,
                356
            ],
            [
                357,
                360
            ],
            [
                367,
                368
            ],
            [
                369,
                373
            ],
            [
                374,
                402
            ],
            [
                413,
                415
            ],
            [
                424,
                454
            ],
            [
                455,
                485
            ],
            [
                486,
                498
            ],
            [
                506,
                509
            ],
            [
                510,
                511
            ],
            [
                519,
                540
            ],
            [
                550,
                553
            ],
            [
                563,
                564
            ],
            [
                572,
                598
            ],
            [
                608,
                632
            ],
            [
                643,
                646
            ],
            [
                647,
                651
            ],
            [
                654,
                660
            ],
            [
                661,
                664
            ],
            [
                665,
                672
            ],
            [
                672,
                673
            ],
            [
                676,
                679
            ],
            [
                680,
                684
            ],
            [
                685,
                687
            ],
            [
                693,
                705
            ],
            [
                706,
                714
            ],
            [
                715,
                732
            ],
            [
                732,
                734
            ],
            [
                734,
                775
            ],
            [
                780,
                790
            ],
            [
                794,
                805
            ],
            [
                805,
                806
            ],
            [
                807,
                820
            ],
            [
                828,
                829
            ],
            [
                837,
                838
            ],
            [
                839,
                852
            ],
            [
                855,
                888
            ],
            [
                896,
                899
            ],
            [
                900,
                969
            ],
            [
                970,
                977
            ],
            [
                983,
                986
            ],
            [
                987,
                991
            ],
            [
                992,
                1008
            ],
            [
                1016,
                1030
            ],
            [
                1039,
                1067
            ],
            [
                1068,
                1136
            ],
            [
                1137,
                1159
            ],
            [
                1160,
                1162
            ],
            [
                1163,
                1196
            ],
            [
                1198,
                1201
            ],
            [
                1202,
                1206
            ],
            [
                1210,
                1215
            ],
            [
                1216,
                1261
            ],
            [
                1270,
                1272
            ],
            [
                1273,
                1300
            ],
            [
                1310,
                1334
            ],
            [
                1335,
                1346
            ],
            [
                1351,
                1354
            ],
            [
                1355,
                1365
            ],
            [
                1372,
                1381
            ],
            [
                1388,
                1402
            ],
            [
                1402,
                1404
            ],
            [
                1404,
                1408
            ],
            [
                1409,
                1421
            ],
            [
                1422,
                1424
            ],
            [
                1425,
                1440
            ],
            [
                1445,
                1452
            ],
            [
                1452,
                1454
            ],
            [
                1454,
                1523
            ],
            [
                1523,
                1529
            ],
            [
                1536,
                1561
            ],
            [
                1567,
                1570
            ],
            [
                1571,
                1572
            ],
            [
                1575,
                1577
            ],
            [
                1577,
                1578
            ],
            [
                1579,
                1591
            ],
            [
                1598,
                1619
            ],
            [
                1619,
                1621
            ],
            [
                1621,
                1622
            ],
            [
                1628,
                1636
            ],
            [
                1637,
                1645
            ],
            [
                1646,
                1653
            ],
            [
                1662,
                1664
            ],
            [
                1681,
                1713
            ],
            [
                1713,
                1723
            ],
            [
                1730,
                1732
            ],
            [
                1739,
                1777
            ],
            [
                1778,
                1808
            ],
            [
                1808,
                1853
            ],
            [
                1853,
                1854
            ],
            [
                1855,
                1857
            ],
            [
                1872,
                1893
            ],
            [
                1896,
                1903
            ],
            [
                1906,
                1938
            ],
            [
                1940,
                1952
            ],
            [
                1952,
                1994
            ],
            [
                2002,
                2009
            ],
            [
                2018,
                2028
            ],
            [
                2028,
                2044
            ],
            [
                2045,
                2081
            ],
            [
                2082,
                2098
            ],
            [
                2099,
                2145
            ],
            [
                2146,
                2152
            ],
            [
                2153,
                2177
            ],
            [
                2178,
                2180
            ],
            [
                2188,
                2196
            ],
            [
                2197,
                2221
            ],
            [
                2222,
                2226
            ],
            [
                2227,
                2238
            ],
            [
                2238,
                2335
            ],
            [
                2336,
                2342
            ],
            [
                2352,
                2354
            ],
            [
                2358,
                2390
            ],
            [
                2391,
                2394
            ],
            [
                2395,
                2410
            ],
            [
                2410,
                2412
            ],
            [
                2412,
                2451
            ],
            [
                2456,
                2461
            ],
            [
                2469,
                2470
            ],
            [
                2471,
                2483
            ],
            [
                2495,
                2512
            ],
            [
                2521,
                2525
            ],
            [
                2533,
                2536
            ],
            [
                2543,
                2545
            ],
            [
                2565,
                2567
            ],
            [
                2569,
                2618
            ],
            [
                2618,
                2675
            ],
            [
                2676,
                2693
            ],
            [
                2693,
                2694
            ],
            [
                2695,
                2701
            ],
            [
                2711,
                2712
            ],
            [
                2713,
                2762
            ],
            [
                2762,
                2768
            ],
            [
                2769,
                2802
            ],
            [
                2803,
                2809
            ],
            [
                2820,
                2847
            ],
            [
                2848,
                2855
            ],
            [
                2856,
                2874
            ],
            [
                2881,
                2883
            ],
            [
                2884,
                2916
            ],
            [
                2916,
                2928
            ],
            [
                2929,
                2964
            ],
            [
                2969,
                2971
            ],
            [
                2972,
                3041
            ],
            [
                3042,
                3078
            ],
            [
                3079,
                3094
            ],
            [
                3094,
                3095
            ],
            [
                3096,
                3156
            ],
            [
                3157,
                3158
            ],
            [
                3159,
                3162
            ],
            [
                3163,
                3194
            ],
            [
                3199,
                3201
            ],
            [
                3202,
                3233
            ]
        ],
        "row_chars": [
            [
                0,
                56
            ],
            [
                56,
                86
            ],
            [
                86,
                353
            ],
            [
                353,
                1198
            ],
            [
                1198,
                1404
            ],
            [
                1404,
                1454
            ],
            [
                1454,
                1523
            ],
            [
                1523,
                1621
            ],
            [
                1621,
                1808
            ],
            [
                1808,
                2028
            ],
            [
                2028,
                2238
            ],
            [
                2238,
                2412
            ],
            [
                2412,
                2567
            ],
            [
                2567,
                2618
            ],
            [
                2618,
                2762
            ],
            [
                2762,
                2916
            ],
            [
                2916,
                3233
            ],
            [
                3233,
                3233
            ]
        ]
    }
}