{
    "original": {
        "text": "The abbess of _Andoillets_, which, if you look into the large set of provincial maps now publishing at _Paris_, you will find situated amongst the hills which divide _Burgundy_ from _Savoy_, being in danger of an _Anchylosis_ or stiff joint (the _sinovia_ of her knee becoming hard by long matins), and having tried every remedy----first, prayers and thanksgiving; then invocations to all the saints in heaven promiscuously----then particularly to every saint who had ever had a stiff leg, before her----then touching it with all the reliques of the convent, principally with the thigh-bone of the man of _Lystra_, who had been impotent from his youth----then wrapping it up in her veil when she went to bed--then cross-wise her rosary--then bringing in to her aid the secular arm, and anointing it with oils and hot fat of animals----then treating it with emollient and resolving fomentations----then with poultices of marsh-mallows, mallows, bonus Henricus, white lillies and fenugreek--then taking the woods, I mean the smoak of 'em, holding her scapulary across her lap----then decoctions of wild chicory, water-cresses, chervil, sweet cecily and cochlearia----and nothing all this while answering, was prevailed on at last to try the hot baths of _Bourbon_----so having first obtain'd leave of the visitor-general to take care of her existence--she ordered all to be got ready for her journey: a novice of the convent of about seventeen, who had been troubled with a whitloe in her middle finger, by sticking it constantly into the abbess's cast poultices, &c. --had gained such an interest, that overlooking a sciatical old nun, who might have been set up for ever by the hot-baths of _Bourbon_, _Margarita_, the little novice, was elected as the companion of the journey.\nAn old calesh, belonging to the abbesse, lined with green frize, was ordered to be drawn out into the sun--the gardener of the convent being chosen muleteer--led out the two old mules, to clip the hair from the rump-ends of their tails, whilst a couple of lay-sisters were busied, the one in darning the lining, and the other in sewing on the shreads of yellow binding, which the teeth of time had unravelled----the under-gardener dress'd the muleteer's hat in hot wine-lees----and a taylor sat musically at it, in a shed over-against the convent, in assorting four dozen of bells for the harness, whistling to each bell, as he tied it on with a thong.----\n----The carpenter and the smith of _Andoillets_ held a council of wheels; and by seven, the morning after, all look'd spruce, and was ready at the gate of the convent for the hot-baths of _Bourbon_--two rows of the unfortunate stood ready there an hour before.\nThe abbess of _Andoillets_, supported by _Margarita_ the novice, advanced slowly to the calesh, both clad in white, with their black rosaries hanging at their breasts----\n----There was a simple solemnity in the contrast: they entered the calesh; and nuns in the same uniform, sweet emblem of innocence, each occupied a window, and as the abbess and _Margarita_ look'd up--each (the sciatical poor nun excepted)--each stream'd out the end of her veil in the air--then kiss'd the lilly hand which let it go: the good abbess and _Margarita_ laid their hands saint-wise upon their breasts--look'd up to heaven--then to them--and look'd \"God bless you, dear sisters.\"\nI declare I am interested in this story, and wish I had been there.\nThe gardener, whom I shall now call the muleteer, was a little, hearty, broad-set, good-natured, chattering, toping kind of a fellow, who troubled his head very little with the _hows_ and _whens_ of life; so had mortgaged a month of his conventical wages in a borrachio, or leathern cask of wine, which he had disposed behind the calesh, with a large russet-coloured riding-coat over it, to guard it from the sun; and as the weather was hot, and he not a niggard of his labours, walking ten times more than he rode--he found more occasions than those of nature, to fall back to the rear of his carriage; till by frequent coming and going, it had so happen'd, that all his wine had leak'd out at the _legal_ vent of the borrachio, before one half of the journey was finish'd.\nMan is a creature born to habitudes. The day had been sultry--the evening was delicious--the wine was generous--the _Burgundian_ hill on which it grew was steep--a little tempting bush over the door of a cool cottage at the foot of it, hung vibrating in full harmony with the passions--a gentle air rustled distinctly through the leaves-- \"Come--come, thirsty muleteer--come in.\"\n--The muleteer was a son of _Adam_; I need not say a word more. He gave the mules, each of 'em, a sound lash, and looking in the abbess's and _Margarita's_ faces (as he did it)--as much as to say \"here I am\"--he gave a second good crack--as much as to say to his mules, \"get on\"----so slinking behind, he enter'd the little inn at the foot of the hill.\nThe muleteer, as I told you, was a little, joyous, chirping fellow, who thought not of to-morrow, nor of what had gone before, or what was to follow it, provided he got but his scantling of Burgundy, and a little chit-chat along with it; so entering into a long conversation, as how he was chief gardener to the convent of _Andoillets_, &c. &c., and out of friendship for the abbess and Mademoiselle _Margarita_, who was only in her noviciate, he had come along with them from the confines of _Savoy_, &c. &c. --and as how she had got a white swelling by her devotions--and what a nation of herbs he had procured to mollify her humours, &c. &c., and that if the waters of _Bourbon_ did not mend that leg--she might as well be lame of both--&c. &c. &c. --He so contrived his story, as absolutely to forget the heroine of it--and with her the little novice, and what was a more ticklish point to be forgot than both--the two mules; who being creatures that take advantage of the world, inasmuch as their parents took it of them--and they not being in a condition to return the obligation _downwards_ (as men and women and beasts are)--they do it side-ways, and long-ways, and back-ways--and up hill, and down hill, and which way they can. ------Philosophers, with all their ethicks, have never considered this rightly--how should the poor muleteer, then in his cups, consider it at all? he did not in the least--'tis time we do; let us leave him then in the vortex of his element, the happiest and most thoughtless of mortal men----and for a moment let us look after the mules, the abbess, and _Margarita_.\nBy virtue of the muleteer's two last strokes the mules had gone quietly on, following their own consciences up the hill, till they had conquer'd about one half of it; when the elder of them, a shrewd crafty old devil, at the turn of an angle, giving a side glance, and no muleteer behind them----\nBy my fig! said she, swearing, I'll go no further ----And if I do, replied the other, they shall make a drum of my hide.----\nAnd so with one consent they stopp'd thus----",
        "paragraph_chars": [
            [
                0,
                1779
            ],
            [
                1779,
                2436
            ],
            [
                2436,
                2697
            ],
            [
                2697,
                2868
            ],
            [
                2868,
                3360
            ],
            [
                3360,
                3428
            ],
            [
                3428,
                4203
            ],
            [
                4203,
                4583
            ],
            [
                4583,
                4936
            ],
            [
                4936,
                6541
            ],
            [
                6541,
                6838
            ],
            [
                6838,
                6963
            ],
            [
                6963,
                7008
            ]
        ],
        "segment_chars": [
            [
                0,
                1779
            ],
            [
                1779,
                2436
            ],
            [
                2436,
                2697
            ],
            [
                2697,
                2868
            ],
            [
                2868,
                3360
            ],
            [
                3360,
                3428
            ],
            [
                3428,
                4203
            ],
            [
                4203,
                4240
            ],
            [
                4240,
                4583
            ],
            [
                4583,
                4647
            ],
            [
                4647,
                4936
            ],
            [
                4936,
                6173
            ],
            [
                6173,
                6321
            ],
            [
                6321,
                6541
            ],
            [
                6541,
                6838
            ],
            [
                6838,
                6849
            ],
            [
                6849,
                6963
            ],
            [
                6963,
                7008
            ]
        ],
        "overlap_chars": [
            [
                0,
                13
            ],
            [
                15,
                25
            ],
            [
                26,
                33
            ],
            [
                107,
                109
            ],
            [
                126,
                152
            ],
            [
                167,
                175
            ],
            [
                299,
                302
            ],
            [
                183,
                188
            ],
            [
                33,
                34
            ],
            [
                303,
                309
            ],
            [
                1470,
                1471
            ],
            [
                229,
                234
            ],
            [
                263,
                267
            ],
            [
                235,
                240
            ],
            [
                110,
                111
            ],
            [
                310,
                328
            ],
            [
                1397,
                1398
            ],
            [
                332,
                423
            ],
            [
                719,
                720
            ],
            [
                427,
                488
            ],
            [
                504,
                533
            ],
            [
                197,
                199
            ],
            [
                546,
                570
            ],
            [
                576,
                604
            ],
            [
                606,
                612
            ],
            [
                613,
                651
            ],
            [
                1310,
                1311
            ],
            [
                655,
                686
            ],
            [
                226,
                228
            ],
            [
                725,
                735
            ],
            [
                1681,
                1682
            ],
            [
                709,
                713
            ],
            [
                769,
                776
            ],
            [
                189,
                190
            ],
            [
                786,
                812
            ],
            [
                881,
                893
            ],
            [
                897,
                934
            ],
            [
                966,
                967
            ],
            [
                974,
                987
            ],
            [
                1077,
                1132
            ],
            [
                782,
                785
            ],
            [
                1134,
                1146
            ],
            [
                1777,
                1779
            ],
            [
                687,
                691
            ],
            [
                66,
                68
            ],
            [
                488,
                489
            ],
            [
                692,
                695
            ],
            [
                1228,
                1251
            ],
            [
                1265,
                1267
            ],
            [
                1350,
                1397
            ],
            [
                1564,
                1565
            ],
            [
                1399,
                1407
            ],
            [
                1423,
                1442
            ],
            [
                1703,
                1712
            ],
            [
                1732,
                1748
            ],
            [
                259,
                262
            ],
            [
                1753,
                1762
            ],
            [
                1779,
                1785
            ],
            [
                1844,
                1884
            ],
            [
                2430,
                2431
            ],
            [
                1886,
                1913
            ],
            [
                1792,
                1793
            ],
            [
                1914,
                1926
            ],
            [
                1927,
                1935
            ],
            [
                1818,
                1819
            ],
            [
                1937,
                1962
            ],
            [
                2014,
                2051
            ],
            [
                2071,
                2082
            ],
            [
                2083,
                2089
            ],
            [
                2091,
                2094
            ],
            [
                2108,
                2121
            ],
            [
                2130,
                2187
            ],
            [
                2261,
                2262
            ],
            [
                2270,
                2283
            ],
            [
                2291,
                2300
            ],
            [
                1842,
                1843
            ],
            [
                2330,
                2350
            ],
            [
                2354,
                2399
            ],
            [
                2401,
                2417
            ],
            [
                2614,
                2615
            ],
            [
                2514,
                2522
            ],
            [
                2440,
                2443
            ],
            [
                2528,
                2535
            ],
            [
                2541,
                2546
            ],
            [
                2554,
                2582
            ],
            [
                2595,
                2602
            ],
            [
                2583,
                2587
            ],
            [
                2695,
                2697
            ],
            [
                2697,
                2710
            ],
            [
                2712,
                2722
            ],
            [
                2723,
                2737
            ],
            [
                2739,
                2748
            ],
            [
                2750,
                2784
            ],
            [
                2793,
                2797
            ],
            [
                2798,
                2863
            ],
            [
                3257,
                3258
            ],
            [
                2918,
                2930
            ],
            [
                2941,
                2999
            ],
            [
                2901,
                2903
            ],
            [
                3022,
                3023
            ],
            [
                3000,
                3004
            ],
            [
                3171,
                3176
            ],
            [
                3181,
                3185
            ],
            [
                3135,
                3137
            ],
            [
                3203,
                3218
            ],
            [
                3343,
                3344
            ],
            [
                3312,
                3316
            ],
            [
                3360,
                3428
            ],
            [
                3428,
                3499
            ],
            [
                3511,
                3536
            ],
            [
                3554,
                3565
            ],
            [
                3636,
                3664
            ],
            [
                3677,
                3687
            ],
            [
                3702,
                3709
            ],
            [
                3711,
                3737
            ],
            [
                3747,
                3757
            ],
            [
                3764,
                3785
            ],
            [
                3795,
                3840
            ],
            [
                3846,
                3876
            ],
            [
                3905,
                3942
            ],
            [
                3509,
                3510
            ],
            [
                3944,
                3952
            ],
            [
                3958,
                3967
            ],
            [
                3990,
                4036
            ],
            [
                4092,
                4104
            ],
            [
                4158,
                4164
            ],
            [
                4177,
                4192
            ],
            [
                4169,
                4173
            ],
            [
                4201,
                4203
            ],
            [
                4203,
                4220
            ],
            [
                4229,
                4234
            ],
            [
                4238,
                4240
            ],
            [
                4240,
                4263
            ],
            [
                4265,
                4290
            ],
            [
                4292,
                4313
            ],
            [
                4315,
                4318
            ],
            [
                4320,
                4330
            ],
            [
                4332,
                4336
            ],
            [
                4354,
                4363
            ],
            [
                4365,
                4404
            ],
            [
                4420,
                4438
            ],
            [
                4502,
                4509
            ],
            [
                4470,
                4474
            ],
            [
                4489,
                4501
            ],
            [
                4549,
                4571
            ],
            [
                4573,
                4580
            ],
            [
                4585,
                4597
            ],
            [
                4650,
                4664
            ],
            [
                4679,
                4724
            ],
            [
                4726,
                4737
            ],
            [
                4739,
                4744
            ],
            [
                4746,
                4748
            ],
            [
                4772,
                4778
            ],
            [
                4674,
                4675
            ],
            [
                4780,
                4789
            ],
            [
                4792,
                4799
            ],
            [
                4842,
                4851
            ],
            [
                4800,
                4819
            ],
            [
                4832,
                4834
            ],
            [
                4854,
                4857
            ],
            [
                4664,
                4665
            ],
            [
                4868,
                4887
            ],
            [
                4896,
                4899
            ],
            [
                4907,
                4910
            ],
            [
                4934,
                4936
            ],
            [
                4936,
                5002
            ],
            [
                5444,
                5445
            ],
            [
                5380,
                5382
            ],
            [
                5008,
                5022
            ],
            [
                5087,
                5104
            ],
            [
                5109,
                5112
            ],
            [
                5134,
                5211
            ],
            [
                5215,
                5258
            ],
            [
                5260,
                5270
            ],
            [
                5271,
                5285
            ],
            [
                5455,
                5490
            ],
            [
                5790,
                5800
            ],
            [
                5527,
                5539
            ],
            [
                5304,
                5307
            ],
            [
                5365,
                5368
            ],
            [
                5571,
                5607
            ],
            [
                5618,
                5639
            ],
            [
                5002,
                5003
            ],
            [
                5641,
                5666
            ],
            [
                5436,
                5444
            ],
            [
                5025,
                5026
            ],
            [
                5362,
                5364
            ],
            [
                5706,
                5716
            ],
            [
                5690,
                5692
            ],
            [
                5720,
                5730
            ],
            [
                5833,
                5839
            ],
            [
                5741,
                5758
            ],
            [
                6084,
                6085
            ],
            [
                5212,
                5214
            ],
            [
                5452,
                5454
            ],
            [
                5773,
                5790
            ],
            [
                6099,
                6100
            ],
            [
                5506,
                5514
            ],
            [
                5071,
                5074
            ],
            [
                5807,
                5811
            ],
            [
                5032,
                5033
            ],
            [
                5851,
                5869
            ],
            [
                6063,
                6066
            ],
            [
                5876,
                5919
            ],
            [
                5319,
                5322
            ],
            [
                5061,
                5062
            ],
            [
                6095,
                6099
            ],
            [
                6085,
                6094
            ],
            [
                5840,
                5844
            ],
            [
                6114,
                6115
            ],
            [
                6121,
                6133
            ],
            [
                6138,
                6172
            ],
            [
                6264,
                6267
            ],
            [
                6273,
                6281
            ],
            [
                6324,
                6331
            ],
            [
                6301,
                6309
            ],
            [
                6239,
                6243
            ],
            [
                6363,
                6384
            ],
            [
                6413,
                6462
            ],
            [
                6466,
                6469
            ],
            [
                6483,
                6494
            ],
            [
                6470,
                6473
            ],
            [
                6501,
                6527
            ],
            [
                6529,
                6538
            ],
            [
                6554,
                6615
            ],
            [
                6649,
                6675
            ],
            [
                6686,
                6691
            ],
            [
                6696,
                6758
            ],
            [
                6822,
                6828
            ],
            [
                6806,
                6809
            ],
            [
                6810,
                6821
            ],
            [
                6838,
                6847
            ],
            [
                6854,
                6858
            ],
            [
                6869,
                6887
            ],
            [
                6892,
                6903
            ],
            [
                6905,
                6923
            ],
            [
                6924,
                6957
            ],
            [
                6963,
                6991
            ]
        ],
        "row_chars": [
            [
                0,
                1779
            ],
            [
                1779,
                2436
            ],
            [
                2436,
                2697
            ],
            [
                2697,
                2868
            ],
            [
                2868,
                3360
            ],
            [
                3360,
                3428
            ],
            [
                3428,
                4203
            ],
            [
                4203,
                4240
            ],
            [
                4240,
                4583
            ],
            [
                4583,
                4936
            ],
            [
                4936,
                6173
            ],
            [
                6173,
                6541
            ],
            [
                6541,
                6838
            ],
            [
                6838,
                6849
            ],
            [
                6849,
                6963
            ],
            [
                6963,
                7008
            ]
        ]
    },
    "abridged": {
        "text": "The abbess of Andoillets, which is situated amongst the hills between Burgundy and Savoy, having a stiff knee joint, tried every remedy: first, prayers and thanksgiving; then invocations to all the saints in heaven promiscuously - then particularly to every saint who had ever had a stiff leg; then touching it with all the relics in the convent, principally the thigh-bone of the man of Lystra, who had been impotent from his youth - then wrapping it up in her veil or her rosary - then trying secular aids, anointing it with oils and fomentations - then with poultices of marsh-mallows, lilies and fenugreek - then decoctions of wild chicory, water-cresses, chervil and sweet Cecily.\nWhen none of these worked, she decided to try the hot baths of Bourbon - so she ordered all to be got ready for her journey. A novice of about seventeen, Margarita, was elected as her companion.\nAn old carriage was ordered to be drawn out into the sun. The gardener of the convent, being chosen as muleteer, led out the two old mules, whilst a couple of lay-sisters were busy darning the carriage lining and sewing on the shreds of yellow binding, which the teeth of time had unravelled. A tailor sat musically in a shed, assorting four dozen bells for the harness, whistling to each bell as he tied it on.\n- By seven the next morning, all looked spruce, and was ready at the convent gate.\nThe abbess of Andoillets, supported by Margarita the novice, advanced slowly to the carriage; both were clad in white, with their black rosaries hanging at their breasts.\n- They entered; and nuns in the same uniform, sweet emblem of innocence, looked in, each kissing the lily hand of the good abbess, who blessed them.\nI declare I am interested in this story, and wish I had been there.\nThe gardener, whom I shall now call the muleteer, was a little, hearty, good-natured, chattering, drinking fellow, who had mortgaged a month of his wages in a leather cask of wine, which he had put behind the carriage, with a large russet riding-coat over it, to guard it from the sun. As the weather was hot, and he was active, walking ten times more than he rode, he found many occasions to fall back to the rear of his carriage; till all his wine was gone before the journey was half finished.\nMan is a creature of habit. The day had been sultry - the evening was delicious - the wine was generous - the Burgundian hill was steep - a little tempting bush over the door of an inn at the foot of it, rustled with a gentle air - 'Come, thirsty muleteer - come in.'\n- The muleteer gave the mules a sound lash, and looking in the abbess's and Margarita's faces as if to say 'here I am' he gave his mules a second good crack to get them moving, and slinking behind, he entered the inn.\nThe muleteer, as I told you, was a little, joyous, chirping fellow. He thought not of tomorrow, provided he got his wine, and a little chit-chat along with it; so entering into a long conversation, about how he was chief gardener to the convent of Andoillets, &c. &c., and how she had got a white swelling by kneeling, and what herbs he had got for her, &c. &c., and that if the waters of Bourbon did not mend that leg, she might as well be lame, &c. &c.-\n- In telling his story, he absolutely forgot about the heroine of it - as well as the little novice - and what was more important, the two mules; who are creatures that take advantage of the world, and would rather go sideways, longways, and backwards than forwards - and up hill, down hill, and which way they can.\nThe muleteer did not consider this. Let us leave him then, the happiest and most thoughtless of mortal men - and let us look for the mules, the abbess, and Margarita.\nAfter the muleteer's two last strokes the mules had gone quietly on up the hill, till they had conquered about half of it; when the elder of them, a shrewd crafty old devil, glancing behind and seeing no muleteer-\n'By my fig!' swore she, 'I'll go no further.'\n'And if I do,' replied the other, 'they shall make a drum of my hide.'\nAnd so with one consent they stopped.",
        "paragraph_chars": [
            [
                0,
                686
            ],
            [
                686,
                881
            ],
            [
                881,
                1293
            ],
            [
                1293,
                1376
            ],
            [
                1376,
                1547
            ],
            [
                1547,
                1696
            ],
            [
                1696,
                1764
            ],
            [
                1764,
                2261
            ],
            [
                2261,
                2529
            ],
            [
                2529,
                2747
            ],
            [
                2747,
                3203
            ],
            [
                3203,
                3519
            ],
            [
                3519,
                3686
            ],
            [
                3686,
                3900
            ],
            [
                3900,
                3946
            ],
            [
                3946,
                4017
            ],
            [
                4017,
                4054
            ]
        ],
        "segment_chars": [
            [
                0,
                686
            ],
            [
                686,
                811
            ],
            [
                811,
                881
            ],
            [
                881,
                939
            ],
            [
                939,
                1174
            ],
            [
                1174,
                1293
            ],
            [
                1293,
                1376
            ],
            [
                1376,
                1547
            ],
            [
                1547,
                1696
            ],
            [
                1696,
                1764
            ],
            [
                1764,
                2050
            ],
            [
                2050,
                2261
            ],
            [
                2261,
                2289
            ],
            [
                2289,
                2529
            ],
            [
                2529,
                2747
            ],
            [
                2747,
                2815
            ],
            [
                2815,
                3203
            ],
            [
                3203,
                3519
            ],
            [
                3519,
                3555
            ],
            [
                3555,
                3686
            ],
            [
                3686,
                3900
            ],
            [
                3900,
                3913
            ],
            [
                3913,
                3946
            ],
            [
                3946,
                4017
            ],
            [
                4017,
                4054
            ]
        ],
        "overlap_chars": [
            [
                0,
                13
            ],
            [
                14,
                24
            ],
            [
                24,
                31
            ],
            [
                32,
                34
            ],
            [
                35,
                61
            ],
            [
                70,
                78
            ],
            [
                79,
                82
            ],
            [
                83,
                88
            ],
            [
                88,
                89
            ],
            [
                90,
                96
            ],
            [
                97,
                98
            ],
            [
                99,
                104
            ],
            [
                105,
                109
            ],
            [
                110,
                115
            ],
            [
                115,
                116
            ],
            [
                117,
                135
            ],
            [
                135,
                136
            ],
            [
                137,
                228
            ],
            [
                229,
                230
            ],
            [
                231,
                292
            ],
            [
                294,
                323
            ],
            [
                331,
                333
            ],
            [
                334,
                358
            ],
            [
                359,
                387
            ],
            [
                388,
                394
            ],
            [
                394,
                432
            ],
            [
                433,
                434
            ],
            [
                435,
                466
            ],
            [
                467,
                469
            ],
            [
                470,
                480
            ],
            [
                481,
                482
            ],
            [
                483,
                487
            ],
            [
                495,
                502
            ],
            [
                507,
                508
            ],
            [
                509,
                535
            ],
            [
                536,
                548
            ],
            [
                551,
                588
            ],
            [
                589,
                590
            ],
            [
                596,
                609
            ],
            [
                612,
                667
            ],
            [
                668,
                671
            ],
            [
                672,
                684
            ],
            [
                684,
                686
            ],
            [
                686,
                690
            ],
            [
                696,
                698
            ],
            [
                711,
                712
            ],
            [
                713,
                716
            ],
            [
                725,
                748
            ],
            [
                759,
                761
            ],
            [
                762,
                809
            ],
            [
                809,
                810
            ],
            [
                811,
                819
            ],
            [
                820,
                839
            ],
            [
                840,
                849
            ],
            [
                849,
                865
            ],
            [
                866,
                869
            ],
            [
                870,
                879
            ],
            [
                881,
                887
            ],
            [
                897,
                937
            ],
            [
                937,
                938
            ],
            [
                939,
                966
            ],
            [
                966,
                967
            ],
            [
                968,
                980
            ],
            [
                984,
                992
            ],
            [
                992,
                993
            ],
            [
                994,
                1019
            ],
            [
                1019,
                1056
            ],
            [
                1062,
                1073
            ],
            [
                1083,
                1089
            ],
            [
                1090,
                1093
            ],
            [
                1094,
                1107
            ],
            [
                1115,
                1172
            ],
            [
                1174,
                1175
            ],
            [
                1183,
                1196
            ],
            [
                1197,
                1206
            ],
            [
                1206,
                1207
            ],
            [
                1208,
                1228
            ],
            [
                1229,
                1274
            ],
            [
                1275,
                1291
            ],
            [
                1293,
                1294
            ],
            [
                1295,
                1303
            ],
            [
                1304,
                1307
            ],
            [
                1313,
                1320
            ],
            [
                1320,
                1325
            ],
            [
                1333,
                1361
            ],
            [
                1362,
                1369
            ],
            [
                1370,
                1374
            ],
            [
                1374,
                1376
            ],
            [
                1376,
                1389
            ],
            [
                1390,
                1400
            ],
            [
                1400,
                1414
            ],
            [
                1415,
                1424
            ],
            [
                1425,
                1459
            ],
            [
                1470,
                1474
            ],
            [
                1480,
                1545
            ],
            [
                1547,
                1548
            ],
            [
                1549,
                1561
            ],
            [
                1561,
                1619
            ],
            [
                1627,
                1629
            ],
            [
                1629,
                1630
            ],
            [
                1631,
                1635
            ],
            [
                1644,
                1649
            ],
            [
                1653,
                1657
            ],
            [
                1658,
                1660
            ],
            [
                1661,
                1676
            ],
            [
                1676,
                1677
            ],
            [
                1690,
                1694
            ],
            [
                1696,
                1764
            ],
            [
                1764,
                1835
            ],
            [
                1836,
                1861
            ],
            [
                1871,
                1882
            ],
            [
                1883,
                1911
            ],
            [
                1912,
                1922
            ],
            [
                1923,
                1930
            ],
            [
                1931,
                1957
            ],
            [
                1962,
                1972
            ],
            [
                1981,
                2002
            ],
            [
                2003,
                2048
            ],
            [
                2050,
                2080
            ],
            [
                2091,
                2128
            ],
            [
                2128,
                2129
            ],
            [
                2130,
                2138
            ],
            [
                2144,
                2153
            ],
            [
                2154,
                2200
            ],
            [
                2201,
                2213
            ],
            [
                2223,
                2229
            ],
            [
                2230,
                2245
            ],
            [
                2246,
                2250
            ],
            [
                2259,
                2261
            ],
            [
                2261,
                2278
            ],
            [
                2282,
                2287
            ],
            [
                2287,
                2289
            ],
            [
                2289,
                2312
            ],
            [
                2315,
                2340
            ],
            [
                2343,
                2364
            ],
            [
                2367,
                2370
            ],
            [
                2371,
                2381
            ],
            [
                2382,
                2386
            ],
            [
                2387,
                2396
            ],
            [
                2399,
                2438
            ],
            [
                2446,
                2464
            ],
            [
                2465,
                2472
            ],
            [
                2473,
                2477
            ],
            [
                2478,
                2490
            ],
            [
                2494,
                2516
            ],
            [
                2519,
                2526
            ],
            [
                2531,
                2543
            ],
            [
                2544,
                2558
            ],
            [
                2559,
                2604
            ],
            [
                2605,
                2616
            ],
            [
                2617,
                2622
            ],
            [
                2623,
                2625
            ],
            [
                2629,
                2635
            ],
            [
                2636,
                2637
            ],
            [
                2637,
                2646
            ],
            [
                2648,
                2655
            ],
            [
                2656,
                2665
            ],
            [
                2666,
                2685
            ],
            [
                2686,
                2688
            ],
            [
                2689,
                2692
            ],
            [
                2704,
                2705
            ],
            [
                2710,
                2729
            ],
            [
                2738,
                2741
            ],
            [
                2742,
                2745
            ],
            [
                2745,
                2747
            ],
            [
                2747,
                2813
            ],
            [
                2813,
                2814
            ],
            [
                2815,
                2817
            ],
            [
                2818,
                2832
            ],
            [
                2841,
                2858
            ],
            [
                2859,
                2862
            ],
            [
                2867,
                2944
            ],
            [
                2951,
                2994
            ],
            [
                2995,
                3005
            ],
            [
                3005,
                3019
            ],
            [
                3020,
                3055
            ],
            [
                3064,
                3074
            ],
            [
                3075,
                3087
            ],
            [
                3092,
                3095
            ],
            [
                3096,
                3099
            ],
            [
                3099,
                3135
            ],
            [
                3144,
                3165
            ],
            [
                3165,
                3166
            ],
            [
                3167,
                3192
            ],
            [
                3192,
                3200
            ],
            [
                3203,
                3204
            ],
            [
                3205,
                3207
            ],
            [
                3216,
                3226
            ],
            [
                3227,
                3229
            ],
            [
                3230,
                3240
            ],
            [
                3241,
                3247
            ],
            [
                3254,
                3271
            ],
            [
                3272,
                3273
            ],
            [
                3274,
                3276
            ],
            [
                3282,
                3284
            ],
            [
                3285,
                3302
            ],
            [
                3303,
                3304
            ],
            [
                3305,
                3313
            ],
            [
                3314,
                3317
            ],
            [
                3318,
                3322
            ],
            [
                3332,
                3333
            ],
            [
                3334,
                3352
            ],
            [
                3353,
                3356
            ],
            [
                3357,
                3400
            ],
            [
                3401,
                3404
            ],
            [
                3429,
                3430
            ],
            [
                3431,
                3435
            ],
            [
                3435,
                3444
            ],
            [
                3455,
                3459
            ],
            [
                3469,
                3470
            ],
            [
                3471,
                3483
            ],
            [
                3484,
                3518
            ],
            [
                3519,
                3522
            ],
            [
                3523,
                3531
            ],
            [
                3532,
                3539
            ],
            [
                3540,
                3548
            ],
            [
                3549,
                3553
            ],
            [
                3555,
                3576
            ],
            [
                3576,
                3625
            ],
            [
                3628,
                3631
            ],
            [
                3632,
                3643
            ],
            [
                3644,
                3647
            ],
            [
                3648,
                3674
            ],
            [
                3675,
                3684
            ],
            [
                3692,
                3753
            ],
            [
                3754,
                3780
            ],
            [
                3791,
                3796
            ],
            [
                3797,
                3859
            ],
            [
                3869,
                3875
            ],
            [
                3876,
                3879
            ],
            [
                3887,
                3898
            ],
            [
                3901,
                3910
            ],
            [
                3919,
                3923
            ],
            [
                3925,
                3943
            ],
            [
                3947,
                3958
            ],
            [
                3961,
                3979
            ],
            [
                3981,
                4014
            ],
            [
                4017,
                4045
            ]
        ],
        "row_chars": [
            [
                0,
                881
            ],
            [
                881,
                1293
            ],
            [
                1293,
                1376
            ],
            [
                1376,
                1547
            ],
            [
                1547,
                1696
            ],
            [
                1696,
                1764
            ],
            [
                1764,
                2261
            ],
            [
                2261,
                2289
            ],
            [
                2289,
                2529
            ],
            [
                2529,
                2747
            ],
            [
                2747,
                3519
            ],
            [
                3519,
                3686
            ],
            [
                3686,
                3900
            ],
            [
                3900,
                3913
            ],
            [
                3913,
                4017
            ],
            [
                4017,
                4054
            ]
        ]
    }
}