{
    "original": {
        "text": "----All you need say of _Fontainbleau_ (in case you are ask'd) is, that it stands about forty miles (south _something_) from _Paris_, in the middle of a large forest ----That there is something great in it ----That the king goes there once every two or three years, with his whole court, for the pleasure of the chase--and that, during that carnival of sporting, any _English_ gentleman of fashion (you need not forget yourself) may be accommodated with a nag or two, to partake of the sport, taking care only not to out-gallop the king----\nThough there are two reasons why you need not talk loud of this to every one.\nFirst, Because 'twill make the said nags the harder to be got; and\nSecondly, 'Tis not a word of it true. ----_Allons!_\nAs for SENS----you may dispatch--in a word------ \"_'Tis an archiepiscopal see_.\"\n----For JOIGNY--the less, I think, one says of it the better.\nBut for AUXERRE --I could go on for ever: for in my _grand tour_ through _Europe_, in which, after all, my father (not caring to trust me with any one) attended me himself, with my uncle _Toby_, and _Trim_, and _Obadiah_, and indeed most of the family, except my mother, who being taken up with a project of knitting my father a pair of large worsted breeches--(the thing is common sense)--and she not caring to be put out of her way, she staid at home, at SHANDY HALL, to keep things right during the expedition; in which, I say, my father stopping us two days at _Auxerre_, and his researches being ever of such a nature, that they would have found fruit even in a desert----he has left me enough to say upon AUXERRE: in short, wherever my father went----but 'twas more remarkably so, in this journey through _France_ and _Italy_, than in any other stages of his life----his road seemed to lie so much on one side of that, wherein all other travellers have gone before him--he saw kings and courts and silks of all colours, in such strange lights----and his remarks and reasonings upon the characters, the manners, and customs, of the countries we pass'd over, were so opposite to those of all other mortal men, particularly those of my uncle _Toby_ and _Trim_--(to say nothing of myself)--and to crown all--the occurrences and scrapes which we were perpetually meeting and getting into, in consequence of his systems and opiniatry--they were of so odd, so mix'd and tragi-comical a contexture --That the whole put together, it appears of so different a shade and tint from any tour of _Europe_, which was ever executed--that I will venture to pronounce--the fault must be mine and mine only--if it be not read by all travellers and travel-readers, till travelling is no more, --or which comes to the same point--till the world, finally, takes it into its head to stand still.----\n----But this rich bale is not to be open'd now; except a small thread or two of it, merely to unravel the mystery of my father's stay at AUXERRE.\n----As I have mentioned it--'tis too slight to be kept suspended; and when 'tis wove in, there is an end of it.\nWe'll go, brother _Toby_, said my father, whilst dinner is coddling--to the abby of Saint _Germain_, if it be only to see these bodies, of which Monsieur _Sequier_ has given such a recommendation. ----I'll go see any body, quoth my uncle _Toby_; for he was all compliance through every step of the journey ----Defend me! said my father--they are all mummies ----Then one need not shave; quoth my uncle _Toby_ ----Shave! no--cried my father--'twill be more like relations to go with our beards on --So out we sallied, the corporal lending his master his arm, and bringing up the rear, to the abby of Saint _Germain_.\nEverything is very fine, and very rich, and very superb, and very magnificent, said my father, addressing himself to the sacristan, who was a younger brother of the order of _Benedictines_--but our curiosity has led us to see the bodies, of which Monsieur _Sequier_ has given the world so exact a description. --The sacristan made a bow, and lighting a torch first, which he had always in the vestry ready for the purpose; he led us into the tomb of St. _Heribald_ ----This, said the sacristan, laying his hand upon the tomb, was a renowned prince of the house of _Bavaria_, who under the successive reigns of _Charlemagne_, _Louis le Debonnair_, and _Charles the Bald_, bore a great sway in the government, and had a principal hand in bringing everything into order and discipline----\nThen he has been as great, said my uncle, in the field, as in the cabinet ----I dare say he has been a gallant soldier ----He was a monk--said the sacristan.\nMy uncle _Toby_ and _Trim_ sought comfort in each other's faces--but found it not: my father clapped both his hands upon his cod-piece, which was a way he had when anything hugely tickled him: for though he hated a monk and the very smell of a monk worse than all the devils in hell----yet the shot hitting my uncle _Toby_ and _Trim_ so much harder than him, 'twas a relative triumph; and put him into the gayest humour in the world.\n----And pray what do you call this gentleman? quoth my father, rather sportingly: This tomb, said the young _Benedictine_, looking downwards, contains the bones of Saint MAXIMA, who came from _Ravenna_ on purpose to touch the body----\n----Of Saint MAXIMUS, said my father, popping in with his saint before him, --they were two of the greatest saints in the whole martyrology, added my father ----Excuse me, said the sacristan--------'twas to touch the bones of Saint _Germain_, the builder of the abby ----And what did she get by it? said my uncle _Toby_ ----What does any woman get by it? said my father ----MARTYRDOME; replied the young _Benedictine_, making a bow down to the ground, and uttering the word with so humble but decisive a cadence, it disarmed my father for a moment. 'Tis supposed, continued the _Benedictine_, that St. _Maxima_ has lain in this tomb four hundred years, and two hundred before her canonization----'Tis but a slow rise, brother _Toby_, quoth my father, in this self-same army of martyrs. ----A desperate slow one, an' please your honour, said _Trim_, unless one could purchase ----I should rather sell out entirely, quoth my uncle _Toby_ ----I am pretty much of your opinion, brother _Toby_, said my father.\n----Poor St. _Maxima!_ said my uncle _Toby_ low to himself, as we turn'd from her tomb: She was one of the fairest and most beautiful ladies either of _Italy_ or _France_, continued the sacristan ----But who the duce has got lain down here, besides her? quoth my father, pointing with his cane to a large tomb as we walked on ----It is Saint _Optat_, Sir, answered the sacristan ----And properly is Saint _Optat_ plac'd! said my father: And what is Saint _Optat's_ story? continued he. Saint _Optat_, replied the sacristan, was a bishop----\n----I thought so, by heaven! cried my father, interrupting him ----Saint _Optat!_----how should Saint _Optat_ fail? so snatching out his pocket-book, and the young _Benedictine_ holding him the torch as he wrote, he set it down as a new prop to his system of Christian names, and I will be bold to say, so disinterested was he in the search of truth, that had he found a treasure in Saint _Optat's_ tomb, it would not have made him half so rich: 'Twas as successful a short visit as ever was paid to the dead; and so highly was his fancy pleas'd with all that had passed in it, --that he determined at once to stay another day in _Auxerre_.\n--I'll see the rest of these good gentry to-morrow, said my father, as we cross'd over the square --And while you are paying that visit, brother _Shandy_, quoth my uncle _Toby_--the corporal and I will mount the ramparts.",
        "paragraph_chars": [
            [
                0,
                541
            ],
            [
                541,
                619
            ],
            [
                619,
                686
            ],
            [
                686,
                738
            ],
            [
                738,
                819
            ],
            [
                819,
                881
            ],
            [
                881,
                2764
            ],
            [
                2764,
                2910
            ],
            [
                2910,
                3022
            ],
            [
                3022,
                3638
            ],
            [
                3638,
                4424
            ],
            [
                4424,
                4582
            ],
            [
                4582,
                5016
            ],
            [
                5016,
                5251
            ],
            [
                5251,
                6257
            ],
            [
                6257,
                6798
            ],
            [
                6798,
                7439
            ],
            [
                7439,
                7660
            ]
        ],
        "segment_chars": [
            [
                0,
                541
            ],
            [
                541,
                619
            ],
            [
                619,
                686
            ],
            [
                686,
                724
            ],
            [
                724,
                738
            ],
            [
                738,
                819
            ],
            [
                819,
                881
            ],
            [
                881,
                2764
            ],
            [
                2764,
                2910
            ],
            [
                2910,
                3022
            ],
            [
                3022,
                3219
            ],
            [
                3219,
                3343
            ],
            [
                3343,
                3442
            ],
            [
                3442,
                3638
            ],
            [
                3638,
                3948
            ],
            [
                3948,
                4424
            ],
            [
                4424,
                4582
            ],
            [
                4582,
                5016
            ],
            [
                5016,
                5062
            ],
            [
                5062,
                5251
            ],
            [
                5251,
                5550
            ],
            [
                5550,
                5606
            ],
            [
                5606,
                5800
            ],
            [
                5800,
                6037
            ],
            [
                6037,
                6257
            ],
            [
                6257,
                6511
            ],
            [
                6511,
                6678
            ],
            [
                6678,
                6729
            ],
            [
                6729,
                6743
            ],
            [
                6743,
                6798
            ],
            [
                6798,
                6827
            ],
            [
                6827,
                6914
            ],
            [
                6914,
                7439
            ],
            [
                7439,
                7660
            ]
        ],
        "overlap_chars": [
            [
                4,
                23
            ],
            [
                25,
                29
            ],
            [
                32,
                37
            ],
            [
                65,
                66
            ],
            [
                48,
                55
            ],
            [
                327,
                328
            ],
            [
                63,
                65
            ],
            [
                67,
                99
            ],
            [
                120,
                124
            ],
            [
                126,
                131
            ],
            [
                132,
                165
            ],
            [
                210,
                234
            ],
            [
                240,
                274
            ],
            [
                281,
                287
            ],
            [
                468,
                470
            ],
            [
                319,
                322
            ],
            [
                363,
                366
            ],
            [
                368,
                375
            ],
            [
                377,
                397
            ],
            [
                429,
                435
            ],
            [
                454,
                455
            ],
            [
                40,
                42
            ],
            [
                491,
                536
            ],
            [
                541,
                607
            ],
            [
                617,
                619
            ],
            [
                619,
                686
            ],
            [
                686,
                695
            ],
            [
                696,
                724
            ],
            [
                729,
                736
            ],
            [
                738,
                749
            ],
            [
                753,
                769
            ],
            [
                771,
                780
            ],
            [
                790,
                815
            ],
            [
                823,
                833
            ],
            [
                835,
                843
            ],
            [
                854,
                881
            ],
            [
                881,
                884
            ],
            [
                1645,
                1647
            ],
            [
                885,
                896
            ],
            [
                2622,
                2623
            ],
            [
                899,
                932
            ],
            [
                934,
                944
            ],
            [
                946,
                953
            ],
            [
                955,
                961
            ],
            [
                962,
                972
            ],
            [
                985,
                994
            ],
            [
                1016,
                1018
            ],
            [
                1052,
                1067
            ],
            [
                1007,
                1009
            ],
            [
                1074,
                1079
            ],
            [
                1086,
                1091
            ],
            [
                1093,
                1100
            ],
            [
                1101,
                1240
            ],
            [
                972,
                973
            ],
            [
                1326,
                1333
            ],
            [
                1335,
                1349
            ],
            [
                1351,
                1445
            ],
            [
                1447,
                1454
            ],
            [
                983,
                984
            ],
            [
                1461,
                1475
            ],
            [
                1565,
                1572
            ],
            [
                1580,
                1591
            ],
            [
                2408,
                2410
            ],
            [
                1601,
                1634
            ],
            [
                1638,
                1641
            ],
            [
                1668,
                1691
            ],
            [
                1271,
                1274
            ],
            [
                2727,
                2729
            ],
            [
                1857,
                1880
            ],
            [
                1907,
                1929
            ],
            [
                1933,
                1948
            ],
            [
                1964,
                1983
            ],
            [
                1998,
                2009
            ],
            [
                2011,
                2030
            ],
            [
                2038,
                2093
            ],
            [
                2173,
                2189
            ],
            [
                1243,
                1246
            ],
            [
                2211,
                2244
            ],
            [
                2257,
                2270
            ],
            [
                1739,
                1745
            ],
            [
                1314,
                1315
            ],
            [
                2321,
                2325
            ],
            [
                2329,
                2335
            ],
            [
                2346,
                2363
            ],
            [
                1457,
                1460
            ],
            [
                2384,
                2393
            ],
            [
                2411,
                2418
            ],
            [
                2422,
                2434
            ],
            [
                2452,
                2460
            ],
            [
                1726,
                1731
            ],
            [
                2461,
                2468
            ],
            [
                2470,
                2476
            ],
            [
                2479,
                2502
            ],
            [
                2504,
                2510
            ],
            [
                2516,
                2526
            ],
            [
                2149,
                2152
            ],
            [
                2538,
                2560
            ],
            [
                2576,
                2611
            ],
            [
                2630,
                2636
            ],
            [
                2701,
                2710
            ],
            [
                2753,
                2759
            ],
            [
                2768,
                2799
            ],
            [
                2807,
                2908
            ],
            [
                2908,
                2910
            ],
            [
                3022,
                3039
            ],
            [
                3100,
                3102
            ],
            [
                3048,
                3063
            ],
            [
                3091,
                3100
            ],
            [
                3103,
                3111
            ],
            [
                3046,
                3047
            ],
            [
                3137,
                3156
            ],
            [
                3161,
                3175
            ],
            [
                3177,
                3184
            ],
            [
                3223,
                3243
            ],
            [
                3245,
                3259
            ],
            [
                3266,
                3293
            ],
            [
                3316,
                3327
            ],
            [
                3364,
                3379
            ],
            [
                3343,
                3357
            ],
            [
                3389,
                3407
            ],
            [
                3409,
                3423
            ],
            [
                3440,
                3442
            ],
            [
                3442,
                3444
            ],
            [
                3452,
                3461
            ],
            [
                3464,
                3482
            ],
            [
                3493,
                3517
            ],
            [
                3520,
                3529
            ],
            [
                3606,
                3615
            ],
            [
                3618,
                3626
            ],
            [
                3638,
                3715
            ],
            [
                3717,
                3731
            ],
            [
                3752,
                3779
            ],
            [
                3818,
                3821
            ],
            [
                3828,
                3831
            ],
            [
                3857,
                3893
            ],
            [
                3895,
                3902
            ],
            [
                3904,
                3946
            ],
            [
                3950,
                3963
            ],
            [
                3974,
                3996
            ],
            [
                4002,
                4003
            ],
            [
                4061,
                4091
            ],
            [
                4010,
                4012
            ],
            [
                4098,
                4101
            ],
            [
                4113,
                4163
            ],
            [
                4164,
                4188
            ],
            [
                4203,
                4210
            ],
            [
                4211,
                4226
            ],
            [
                4238,
                4247
            ],
            [
                4249,
                4260
            ],
            [
                4111,
                4112
            ],
            [
                4267,
                4269
            ],
            [
                4285,
                4288
            ],
            [
                4290,
                4306
            ],
            [
                4261,
                4262
            ],
            [
                4316,
                4344
            ],
            [
                4502,
                4515
            ],
            [
                4525,
                4542
            ],
            [
                4451,
                4464
            ],
            [
                4547,
                4560
            ],
            [
                4562,
                4582
            ],
            [
                4582,
                4590
            ],
            [
                4598,
                4601
            ],
            [
                4627,
                4637
            ],
            [
                4939,
                4940
            ],
            [
                4965,
                4966
            ],
            [
                4647,
                4650
            ],
            [
                4665,
                4801
            ],
            [
                4831,
                4864
            ],
            [
                4868,
                4871
            ],
            [
                4876,
                4897
            ],
            [
                4971,
                5016
            ],
            [
                5020,
                5060
            ],
            [
                5062,
                5077
            ],
            [
                5086,
                5096
            ],
            [
                5305,
                5308
            ],
            [
                5103,
                5107
            ],
            [
                5109,
                5123
            ],
            [
                5130,
                5136
            ],
            [
                5077,
                5078
            ],
            [
                5449,
                5450
            ],
            [
                5167,
                5207
            ],
            [
                5214,
                5216
            ],
            [
                5455,
                5482
            ],
            [
                5492,
                5515
            ],
            [
                5522,
                5548
            ],
            [
                5550,
                5563
            ],
            [
                5575,
                5604
            ],
            [
                5606,
                5620
            ],
            [
                5629,
                5631
            ],
            [
                5637,
                5654
            ],
            [
                5661,
                5667
            ],
            [
                5668,
                5669
            ],
            [
                5725,
                5739
            ],
            [
                5744,
                5754
            ],
            [
                5762,
                5800
            ],
            [
                5948,
                5951
            ],
            [
                5805,
                5813
            ],
            [
                5815,
                5828
            ],
            [
                5835,
                5841
            ],
            [
                5813,
                5814
            ],
            [
                5947,
                5948
            ],
            [
                5844,
                5852
            ],
            [
                5854,
                5860
            ],
            [
                5862,
                5943
            ],
            [
                5956,
                5976
            ],
            [
                5985,
                6001
            ],
            [
                6002,
                6009
            ],
            [
                6020,
                6035
            ],
            [
                6065,
                6066
            ],
            [
                6041,
                6062
            ],
            [
                6074,
                6085
            ],
            [
                6087,
                6091
            ],
            [
                6255,
                6257
            ],
            [
                6261,
                6269
            ],
            [
                6271,
                6277
            ],
            [
                6280,
                6293
            ],
            [
                6301,
                6315
            ],
            [
                6349,
                6371
            ],
            [
                6391,
                6397
            ],
            [
                6405,
                6407
            ],
            [
                6416,
                6418
            ],
            [
                6429,
                6452
            ],
            [
                6457,
                6468
            ],
            [
                6474,
                6496
            ],
            [
                6511,
                6582
            ],
            [
                6587,
                6598
            ],
            [
                6600,
                6605
            ],
            [
                6606,
                6611
            ],
            [
                6613,
                6635
            ],
            [
                6694,
                6711
            ],
            [
                6713,
                6720
            ],
            [
                6722,
                6727
            ],
            [
                6744,
                6748
            ],
            [
                6750,
                6755
            ],
            [
                6781,
                6793
            ],
            [
                6802,
                6825
            ],
            [
                6827,
                6860
            ],
            [
                6865,
                6870
            ],
            [
                6872,
                6877
            ],
            [
                6948,
                6951
            ],
            [
                6917,
                6947
            ],
            [
                7001,
                7009
            ],
            [
                7018,
                7072
            ],
            [
                7078,
                7087
            ],
            [
                6914,
                6916
            ],
            [
                7088,
                7092
            ],
            [
                6998,
                7000
            ],
            [
                7093,
                7099
            ],
            [
                7149,
                7153
            ],
            [
                7011,
                7013
            ],
            [
                7154,
                7157
            ],
            [
                7161,
                7186
            ],
            [
                7188,
                7195
            ],
            [
                7197,
                7242
            ],
            [
                7244,
                7265
            ],
            [
                7272,
                7314
            ],
            [
                7118,
                7121
            ],
            [
                7378,
                7427
            ],
            [
                7429,
                7436
            ],
            [
                7441,
                7489
            ],
            [
                7491,
                7512
            ],
            [
                7526,
                7536
            ],
            [
                7659,
                7660
            ],
            [
                7539,
                7583
            ],
            [
                7594,
                7608
            ],
            [
                7489,
                7490
            ],
            [
                7617,
                7659
            ]
        ],
        "row_chars": [
            [
                0,
                541
            ],
            [
                541,
                619
            ],
            [
                619,
                686
            ],
            [
                686,
                724
            ],
            [
                724,
                738
            ],
            [
                738,
                819
            ],
            [
                819,
                881
            ],
            [
                881,
                2764
            ],
            [
                2764,
                2910
            ],
            [
                2910,
                3022
            ],
            [
                3022,
                3219
            ],
            [
                3219,
                3343
            ],
            [
                3343,
                3442
            ],
            [
                3442,
                3638
            ],
            [
                3638,
                3948
            ],
            [
                3948,
                4424
            ],
            [
                4424,
                4582
            ],
            [
                4582,
                5016
            ],
            [
                5016,
                5062
            ],
            [
                5062,
                5550
            ],
            [
                5550,
                5606
            ],
            [
                5606,
                5800
            ],
            [
                5800,
                6037
            ],
            [
                6037,
                6257
            ],
            [
                6257,
                6511
            ],
            [
                6511,
                6678
            ],
            [
                6678,
                6729
            ],
            [
                6729,
                6743
            ],
            [
                6743,
                6798
            ],
            [
                6798,
                6827
            ],
            [
                6827,
                6914
            ],
            [
                6914,
                7439
            ],
            [
                7439,
                7660
            ]
        ]
    },
    "abridged": {
        "text": "All you need say of Fontainebleau, if you are asked, is that it stands about forty miles from Paris, in the middle of a large forest - that the king goes there every two or three years, with his court, to hunt - and any English gentleman of fashion may be loaned a horse to join in, taking care only not to out-gallop the king.\nThough there are two reasons why you need not talk loud of this to everyone.\nFirst, because 'twill make the said nags the harder to be got; and\nSecondly, because 'tis not a word of it true. Allons!\nAs for Sens - you may dispatch it in a word - ''Tis an archiepiscopal see.'\nFor Joigny - the less one says of it the better.\nBut as for Auxerre - I could go on for ever: for in my grand tour through Europe, in which my father accompanied me, with my uncle Toby, and Trim, and Obadiah, and indeed most of the family, except my mother, who being taken up with a project of knitting my father a pair of large worsted breeches, stayed at home at Shandy Hall to keep things right during the expedition; in which, I say, my father stopping us two days at Auxerre, his researches left me plenty to say upon it - in short, wherever my father went - but especially in this journey through France and Italy - he saw kings and courts in such strange lights - and his remarks upon the characters and customs of the countries we passed over, were so opposite to those of all other mortal men - and to crown all - the scrapes which we were perpetually getting into, because of his opinions, were so odd and tragi-comical - and the whole tour appears so different from any other tour of Europe which was ever executed - that I venture to say the fault must be mine if it be not read by all travellers, till the world stands still.\nBut this rich bale is not to be opened now; except a small thread or two of it, merely to unravel the mystery of my father's stay at Auxerre, since I have mentioned it.\n'We'll go, brother Toby,' said my father, 'to the abbey of Saint Germain, to see these bodies which Monsieur Sequier recommends.'\n'I'll go see any body,' quoth my uncle Toby; for he was all compliance throughout the journey.\n'They are all mummies,' said my father.\n'Then one need not shave,' quoth my uncle.\n'Shave! No,' cried my father - ''twill be more like family to go with our beards on.'\nSo out we went to the abbey of Saint Germain.\n'Everything is very fine, and very rich, and very superb, and very magnificent,' said my father to the sacristan, who was a Benedictine - 'but we hoped to see the bodies, of which Monsieur Sequier has given the world so exact a description.'\nThe sacristan bowed, and lighting a torch, he led us into the tomb of St. Heribald.\n'This,' said the sacristan, laying his hand upon the tomb, 'was a renowned prince of Bavaria, who under the reigns of Charlemagne, Louis and Charles the Bald, held great sway in the government.'\n'I dare say he was a gallant soldier too,' said my uncle.\n'He was a monk,' said the sacristan.\nMy uncle Toby and Trim looked at each other, dismayed; but my father clapped both his hands upon his cod-piece, which was a way he had when anything hugely tickled him: for though he hated a monk worse than all the devils in hell - yet this shot hitting my uncle Toby put him into the gayest humour in the world.\n'And pray what do you call this gentleman?' quoth my father sportingly.\n'This tomb,' said the young Benedictine, 'contains the bones of Saint Maxima, who came from Ravenna to touch the bones of Saint Germain, the builder of the abbey.'\n'And what did she get by it?' said my uncle Toby.\n'What does any woman get by it?' said my father.\n'Martyrdom,' replied the young Benedictine, with so humble yet decisive a tone, it disarmed my father for a moment. ''Tis supposed,' continued the Benedictine, 'that St. Maxima has lain in this tomb four hundred years, and two hundred before her canonization.'\n''Tis a slow rise, brother Toby,' quoth my father, 'in this army of martyrs.'\n'A desperate slow one, your honour,' said Trim.\n'Poor St. Maxima!' said my uncle Toby low to himself.\n'She was one of the fairest ladies of Italy or France,' continued the sacristan.\n'But who the deuce has got lain down here?' quoth my father, pointing with his cane to a large tomb as we walked on.\n'It is Saint Optat, Sir,' answered the sacristan.\n'And what is Saint Optat's story?'\n'Saint Optat was a bishop-'\n'I thought so, by heaven!' cried my father, interrupting him. 'Saint Optat!' and snatching out his pocket-book, he wrote it down as a new prop to his system of christian names. I will be so bold as to say that even if he had found a treasure in Saint Optat's tomb, it would not have made him half so rich. 'Twas as successful a visit as ever was paid to the dead; and so pleased was my father that he determined at once to stay another day in Auxerre.\n'I'll see the rest of these good gentry to-morrow,' said my father, as we crossed the square.\n'And while you are paying that visit, brother,' quoth my uncle Toby, 'the corporal and I will mount the ramparts.'",
        "paragraph_chars": [
            [
                0,
                328
            ],
            [
                328,
                405
            ],
            [
                405,
                472
            ],
            [
                472,
                526
            ],
            [
                526,
                602
            ],
            [
                602,
                651
            ],
            [
                651,
                1742
            ],
            [
                1742,
                1911
            ],
            [
                1911,
                2041
            ],
            [
                2041,
                2136
            ],
            [
                2136,
                2176
            ],
            [
                2176,
                2219
            ],
            [
                2219,
                2305
            ],
            [
                2305,
                2351
            ],
            [
                2351,
                2593
            ],
            [
                2593,
                2677
            ],
            [
                2677,
                2872
            ],
            [
                2872,
                2930
            ],
            [
                2930,
                2967
            ],
            [
                2967,
                3280
            ],
            [
                3280,
                3352
            ],
            [
                3352,
                3516
            ],
            [
                3516,
                3566
            ],
            [
                3566,
                3615
            ],
            [
                3615,
                3876
            ],
            [
                3876,
                3954
            ],
            [
                3954,
                4002
            ],
            [
                4002,
                4056
            ],
            [
                4056,
                4137
            ],
            [
                4137,
                4254
            ],
            [
                4254,
                4304
            ],
            [
                4304,
                4339
            ],
            [
                4339,
                4367
            ],
            [
                4367,
                4819
            ],
            [
                4819,
                4913
            ],
            [
                4913,
                5027
            ]
        ],
        "segment_chars": [
            [
                0,
                328
            ],
            [
                328,
                405
            ],
            [
                405,
                472
            ],
            [
                472,
                518
            ],
            [
                518,
                526
            ],
            [
                526,
                602
            ],
            [
                602,
                651
            ],
            [
                651,
                1742
            ],
            [
                1742,
                1911
            ],
            [
                1911,
                2041
            ],
            [
                2041,
                2136
            ],
            [
                2136,
                2176
            ],
            [
                2176,
                2219
            ],
            [
                2219,
                2227
            ],
            [
                2227,
                2305
            ],
            [
                2305,
                2351
            ],
            [
                2351,
                2593
            ],
            [
                2593,
                2677
            ],
            [
                2677,
                2872
            ],
            [
                2872,
                2930
            ],
            [
                2930,
                2967
            ],
            [
                2967,
                3280
            ],
            [
                3280,
                3324
            ],
            [
                3324,
                3352
            ],
            [
                3352,
                3516
            ],
            [
                3516,
                3546
            ],
            [
                3546,
                3566
            ],
            [
                3566,
                3599
            ],
            [
                3599,
                3615
            ],
            [
                3615,
                3731
            ],
            [
                3731,
                3876
            ],
            [
                3876,
                3954
            ],
            [
                3954,
                4002
            ],
            [
                4002,
                4021
            ],
            [
                4021,
                4056
            ],
            [
                4056,
                4137
            ],
            [
                4137,
                4181
            ],
            [
                4181,
                4254
            ],
            [
                4254,
                4304
            ],
            [
                4304,
                4339
            ],
            [
                4339,
                4367
            ],
            [
                4367,
                4394
            ],
            [
                4394,
                4429
            ],
            [
                4429,
                4444
            ],
            [
                4444,
                4544
            ],
            [
                4544,
                4673
            ],
            [
                4673,
                4819
            ],
            [
                4819,
                4913
            ],
            [
                4913,
                5027
            ]
        ],
        "overlap_chars": [
            [
                0,
                19
            ],
            [
                20,
                24
            ],
            [
                28,
                33
            ],
            [
                33,
                34
            ],
            [
                38,
                45
            ],
            [
                51,
                52
            ],
            [
                53,
                55
            ],
            [
                56,
                88
            ],
            [
                89,
                93
            ],
            [
                94,
                99
            ],
            [
                99,
                132
            ],
            [
                135,
                159
            ],
            [
                160,
                194
            ],
            [
                195,
                201
            ],
            [
                202,
                204
            ],
            [
                212,
                215
            ],
            [
                216,
                219
            ],
            [
                220,
                227
            ],
            [
                228,
                248
            ],
            [
                249,
                255
            ],
            [
                263,
                264
            ],
            [
                279,
                281
            ],
            [
                281,
                326
            ],
            [
                328,
                394
            ],
            [
                403,
                405
            ],
            [
                405,
                472
            ],
            [
                472,
                481
            ],
            [
                490,
                518
            ],
            [
                518,
                525
            ],
            [
                526,
                537
            ],
            [
                540,
                556
            ],
            [
                560,
                569
            ],
            [
                574,
                599
            ],
            [
                602,
                612
            ],
            [
                615,
                623
            ],
            [
                624,
                651
            ],
            [
                651,
                654
            ],
            [
                655,
                657
            ],
            [
                658,
                669
            ],
            [
                670,
                671
            ],
            [
                672,
                705
            ],
            [
                706,
                716
            ],
            [
                717,
                724
            ],
            [
                725,
                731
            ],
            [
                731,
                741
            ],
            [
                742,
                751
            ],
            [
                764,
                766
            ],
            [
                766,
                781
            ],
            [
                782,
                784
            ],
            [
                786,
                791
            ],
            [
                796,
                801
            ],
            [
                802,
                809
            ],
            [
                809,
                948
            ],
            [
                948,
                949
            ],
            [
                957,
                964
            ],
            [
                965,
                979
            ],
            [
                980,
                1074
            ],
            [
                1075,
                1082
            ],
            [
                1082,
                1083
            ],
            [
                1084,
                1098
            ],
            [
                1099,
                1106
            ],
            [
                1114,
                1125
            ],
            [
                1126,
                1128
            ],
            [
                1131,
                1164
            ],
            [
                1167,
                1170
            ],
            [
                1182,
                1205
            ],
            [
                1213,
                1216
            ],
            [
                1217,
                1219
            ],
            [
                1225,
                1248
            ],
            [
                1249,
                1271
            ],
            [
                1274,
                1289
            ],
            [
                1290,
                1309
            ],
            [
                1310,
                1321
            ],
            [
                1322,
                1341
            ],
            [
                1349,
                1404
            ],
            [
                1407,
                1423
            ],
            [
                1426,
                1429
            ],
            [
                1430,
                1463
            ],
            [
                1464,
                1477
            ],
            [
                1486,
                1492
            ],
            [
                1501,
                1502
            ],
            [
                1503,
                1507
            ],
            [
                1508,
                1514
            ],
            [
                1515,
                1532
            ],
            [
                1535,
                1538
            ],
            [
                1539,
                1548
            ],
            [
                1554,
                1561
            ],
            [
                1562,
                1574
            ],
            [
                1575,
                1583
            ],
            [
                1584,
                1589
            ],
            [
                1590,
                1597
            ],
            [
                1598,
                1604
            ],
            [
                1605,
                1628
            ],
            [
                1631,
                1637
            ],
            [
                1638,
                1648
            ],
            [
                1649,
                1652
            ],
            [
                1653,
                1675
            ],
            [
                1676,
                1711
            ],
            [
                1711,
                1717
            ],
            [
                1718,
                1727
            ],
            [
                1735,
                1741
            ],
            [
                1742,
                1773
            ],
            [
                1781,
                1882
            ],
            [
                1909,
                1911
            ],
            [
                1912,
                1929
            ],
            [
                1932,
                1934
            ],
            [
                1937,
                1952
            ],
            [
                1954,
                1963
            ],
            [
                1967,
                1975
            ],
            [
                1983,
                1984
            ],
            [
                1985,
                2004
            ],
            [
                2005,
                2019
            ],
            [
                2020,
                2027
            ],
            [
                2042,
                2062
            ],
            [
                2065,
                2079
            ],
            [
                2084,
                2111
            ],
            [
                2123,
                2134
            ],
            [
                2142,
                2157
            ],
            [
                2160,
                2174
            ],
            [
                2182,
                2200
            ],
            [
                2203,
                2217
            ],
            [
                2225,
                2227
            ],
            [
                2227,
                2229
            ],
            [
                2238,
                2247
            ],
            [
                2252,
                2270
            ],
            [
                2278,
                2302
            ],
            [
                2305,
                2314
            ],
            [
                2320,
                2329
            ],
            [
                2333,
                2341
            ],
            [
                2352,
                2429
            ],
            [
                2432,
                2446
            ],
            [
                2447,
                2474
            ],
            [
                2480,
                2483
            ],
            [
                2490,
                2493
            ],
            [
                2503,
                2539
            ],
            [
                2540,
                2547
            ],
            [
                2548,
                2590
            ],
            [
                2593,
                2606
            ],
            [
                2612,
                2634
            ],
            [
                2634,
                2635
            ],
            [
                2636,
                2666
            ],
            [
                2667,
                2669
            ],
            [
                2672,
                2675
            ],
            [
                2685,
                2735
            ],
            [
                2737,
                2761
            ],
            [
                2762,
                2769
            ],
            [
                2769,
                2784
            ],
            [
                2785,
                2794
            ],
            [
                2795,
                2806
            ],
            [
                2806,
                2807
            ],
            [
                2811,
                2813
            ],
            [
                2814,
                2817
            ],
            [
                2818,
                2834
            ],
            [
                2834,
                2835
            ],
            [
                2841,
                2869
            ],
            [
                2873,
                2886
            ],
            [
                2891,
                2908
            ],
            [
                2915,
                2928
            ],
            [
                2931,
                2944
            ],
            [
                2947,
                2967
            ],
            [
                2967,
                2975
            ],
            [
                2981,
                2984
            ],
            [
                3000,
                3010
            ],
            [
                3010,
                3011
            ],
            [
                3020,
                3021
            ],
            [
                3022,
                3025
            ],
            [
                3026,
                3162
            ],
            [
                3163,
                3196
            ],
            [
                3199,
                3202
            ],
            [
                3208,
                3229
            ],
            [
                3235,
                3280
            ],
            [
                3281,
                3321
            ],
            [
                3324,
                3339
            ],
            [
                3340,
                3350
            ],
            [
                3354,
                3357
            ],
            [
                3358,
                3362
            ],
            [
                3365,
                3379
            ],
            [
                3385,
                3391
            ],
            [
                3391,
                3392
            ],
            [
                3393,
                3394
            ],
            [
                3403,
                3443
            ],
            [
                3449,
                3451
            ],
            [
                3452,
                3479
            ],
            [
                3487,
                3510
            ],
            [
                3517,
                3543
            ],
            [
                3546,
                3559
            ],
            [
                3567,
                3596
            ],
            [
                3599,
                3613
            ],
            [
                3620,
                3622
            ],
            [
                3628,
                3645
            ],
            [
                3651,
                3657
            ],
            [
                3657,
                3658
            ],
            [
                3659,
                3673
            ],
            [
                3678,
                3688
            ],
            [
                3693,
                3731
            ],
            [
                3733,
                3736
            ],
            [
                3737,
                3745
            ],
            [
                3748,
                3761
            ],
            [
                3767,
                3773
            ],
            [
                3773,
                3774
            ],
            [
                3775,
                3776
            ],
            [
                3776,
                3784
            ],
            [
                3785,
                3791
            ],
            [
                3792,
                3873
            ],
            [
                3882,
                3902
            ],
            [
                3910,
                3926
            ],
            [
                3928,
                3935
            ],
            [
                3936,
                3951
            ],
            [
                3954,
                3955
            ],
            [
                3955,
                3976
            ],
            [
                3977,
                3988
            ],
            [
                3991,
                3995
            ],
            [
                4000,
                4002
            ],
            [
                4003,
                4011
            ],
            [
                4012,
                4018
            ],
            [
                4021,
                4034
            ],
            [
                4040,
                4054
            ],
            [
                4061,
                4083
            ],
            [
                4084,
                4090
            ],
            [
                4091,
                4093
            ],
            [
                4100,
                4102
            ],
            [
                4112,
                4135
            ],
            [
                4138,
                4149
            ],
            [
                4156,
                4178
            ],
            [
                4181,
                4252
            ],
            [
                4255,
                4266
            ],
            [
                4267,
                4272
            ],
            [
                4272,
                4277
            ],
            [
                4280,
                4302
            ],
            [
                4305,
                4322
            ],
            [
                4323,
                4330
            ],
            [
                4331,
                4336
            ],
            [
                4341,
                4345
            ],
            [
                4346,
                4351
            ],
            [
                4352,
                4364
            ],
            [
                4368,
                4391
            ],
            [
                4394,
                4427
            ],
            [
                4430,
                4435
            ],
            [
                4436,
                4441
            ],
            [
                4444,
                4447
            ],
            [
                4448,
                4478
            ],
            [
                4479,
                4487
            ],
            [
                4488,
                4542
            ],
            [
                4544,
                4553
            ],
            [
                4554,
                4556
            ],
            [
                4557,
                4561
            ],
            [
                4562,
                4564
            ],
            [
                4565,
                4571
            ],
            [
                4572,
                4576
            ],
            [
                4585,
                4587
            ],
            [
                4588,
                4591
            ],
            [
                4592,
                4617
            ],
            [
                4618,
                4625
            ],
            [
                4626,
                4671
            ],
            [
                4673,
                4694
            ],
            [
                4695,
                4737
            ],
            [
                4746,
                4749
            ],
            [
                4760,
                4809
            ],
            [
                4810,
                4817
            ],
            [
                4820,
                4868
            ],
            [
                4871,
                4892
            ],
            [
                4901,
                4911
            ],
            [
                4911,
                4912
            ],
            [
                4914,
                4958
            ],
            [
                4961,
                4975
            ],
            [
                4980,
                4981
            ],
            [
                4983,
                5025
            ]
        ],
        "row_chars": [
            [
                0,
                328
            ],
            [
                328,
                405
            ],
            [
                405,
                472
            ],
            [
                472,
                518
            ],
            [
                518,
                526
            ],
            [
                526,
                602
            ],
            [
                602,
                651
            ],
            [
                651,
                1742
            ],
            [
                1742,
                1911
            ],
            [
                1911,
                1911
            ],
            [
                1911,
                2041
            ],
            [
                2041,
                2136
            ],
            [
                2136,
                2227
            ],
            [
                2227,
                2351
            ],
            [
                2351,
                2593
            ],
            [
                2593,
                2872
            ],
            [
                2872,
                2967
            ],
            [
                2967,
                3280
            ],
            [
                3280,
                3324
            ],
            [
                3324,
                3546
            ],
            [
                3546,
                3599
            ],
            [
                3599,
                3731
            ],
            [
                3731,
                3954
            ],
            [
                3954,
                4002
            ],
            [
                4002,
                4181
            ],
            [
                4181,
                4304
            ],
            [
                4304,
                4339
            ],
            [
                4339,
                4339
            ],
            [
                4339,
                4367
            ],
            [
                4367,
                4394
            ],
            [
                4394,
                4444
            ],
            [
                4444,
                4819
            ],
            [
                4819,
                5027
            ]
        ]
    }
}