{
    "original": {
        "text": "I am glad of it, said I, settling the account with myself, as I walk'd into _Lyons_----my chaise being all laid higgledy-piggledy with my baggage in a cart, which was moving slowly before me ----I am heartily glad, said I, that 'tis all broke to pieces; for now I can go directly by water to _Avignon_, which will carry me on a hundred and twenty miles of my journey, and not cost me seven livres----and from thence, continued I, bringing forwards the account, I can hire a couple of mules--or asses, if I like (for nobody knows me) and cross the plains of _Languedoc_ for almost nothing ----I shall gain four hundred livres by the misfortune clear into my purse: and pleasure! worth--worth double the money by it. With what velocity, continued I, clapping my two hands together, shall I fly down the rapid _Rhone_, with the VIVARES on my right hand, and DAUPHINY on my left, scarce seeing the ancient cities of VIENNE, _Valence_, and _Vivieres_. What a flame will it rekindle in the lamp, to snatch a blushing grape from the _Hermitage_ and _Cte roti_, as I shoot by the foot of them! and what a fresh spring in the blood! to behold upon the banks advancing and retiring, the castles of romance, whence courteous knights have whilome rescued the distress'd----and see vertiginous, the rocks, the mountains, the cataracts, and all the hurry which Nature is in with all her great works about her.\nAs I went on thus, methought my chaise, the wreck of which look'd stately enough at the first, insensibly grew less and less in its size; the freshness of the painting was no more--the gilding lost its lustre--and the whole affair appeared so poor in my eyes--so sorry! --so contemptible! and, in a word, so much worse than the abbess of _Andoillets'_ itself--that I was just opening my mouth to give it to the devil--when a pert vamping chaise-undertaker, stepping nimbly across the street, demanded if Monsieur would have his chaise refitted ----No, no, said I, shaking my head sideways --Would Monsieur chuse to sell it? rejoined the undertaker. --With all my soul, said I--the iron work is worth forty livres--and the glasses worth forty more--and the leather you may take to live on.\nWhat a mine of wealth, quoth I, as he counted me the money, has this post-chaise brought me in? And this is my usual method of book-keeping, at least with the disasters of life--making a penny of every one of 'em as they happen to me----\n----Do, my dear _Jenny_, tell the world for me, how I behaved under one, the most oppressive of its kind, which could befal me as a man, proud as he ought to be of his manhood----\n'Tis enough, saidst thou, coming close up to me, as I stood with my garters in my hand, reflecting upon what had _not_ pass'd----'Tis enough, _Tristram_, and I am satisfied, saidst thou, whispering these words in my ear, **** ** **** *** ******; --**** ** **----any other man would have sunk down to the center----\n----Everything is good for something, quoth I.\n----I'll go into _Wales_ for six weeks, and drink goat's whey--and I'll gain seven years longer life for the accident. For which reason I think myself inexcusable, for blaming fortune so often as I have done, for pelting me all my life long, like an ungracious duchess, as I call'd her, with so many small evils: surely, if I have any cause to be angry with her, 'tis that she has not sent me great ones--a score of good cursed, bouncing losses, would have been as good as a pension to me.\n----One of a hundred a year, or so, is all I wish --I would not be at the plague of paying land-tax for a larger.",
        "paragraph_chars": [
            [
                0,
                1396
            ],
            [
                1396,
                2185
            ],
            [
                2185,
                2423
            ],
            [
                2423,
                2603
            ],
            [
                2603,
                2918
            ],
            [
                2918,
                2965
            ],
            [
                2965,
                3455
            ],
            [
                3455,
                3568
            ]
        ],
        "segment_chars": [
            [
                0,
                678
            ],
            [
                678,
                715
            ],
            [
                715,
                947
            ],
            [
                947,
                1086
            ],
            [
                1086,
                1124
            ],
            [
                1124,
                1396
            ],
            [
                1396,
                1666
            ],
            [
                1666,
                1685
            ],
            [
                1685,
                2020
            ],
            [
                2020,
                2045
            ],
            [
                2045,
                2185
            ],
            [
                2185,
                2281
            ],
            [
                2281,
                2423
            ],
            [
                2423,
                2603
            ],
            [
                2603,
                2918
            ],
            [
                2918,
                2965
            ],
            [
                2965,
                3084
            ],
            [
                3084,
                3455
            ],
            [
                3455,
                3568
            ]
        ],
        "overlap_chars": [
            [
                0,
                15
            ],
            [
                17,
                24
            ],
            [
                59,
                63
            ],
            [
                71,
                75
            ],
            [
                77,
                82
            ],
            [
                87,
                190
            ],
            [
                195,
                213
            ],
            [
                215,
                222
            ],
            [
                223,
                279
            ],
            [
                368,
                371
            ],
            [
                280,
                291
            ],
            [
                293,
                300
            ],
            [
                301,
                367
            ],
            [
                400,
                415
            ],
            [
                459,
                489
            ],
            [
                533,
                556
            ],
            [
                558,
                567
            ],
            [
                569,
                587
            ],
            [
                592,
                642
            ],
            [
                662,
                676
            ],
            [
                685,
                707
            ],
            [
                713,
                715
            ],
            [
                745,
                746
            ],
            [
                780,
                785
            ],
            [
                788,
                806
            ],
            [
                808,
                813
            ],
            [
                874,
                919
            ],
            [
                921,
                928
            ],
            [
                849,
                854
            ],
            [
                936,
                944
            ],
            [
                993,
                1025
            ],
            [
                1027,
                1036
            ],
            [
                1038,
                1041
            ],
            [
                1047,
                1051
            ],
            [
                1052,
                1067
            ],
            [
                1080,
                1085
            ],
            [
                1086,
                1124
            ],
            [
                1124,
                1148
            ],
            [
                1173,
                1196
            ],
            [
                1204,
                1226
            ],
            [
                1235,
                1246
            ],
            [
                1171,
                1172
            ],
            [
                1159,
                1162
            ],
            [
                1265,
                1268
            ],
            [
                1293,
                1326
            ],
            [
                1347,
                1353
            ],
            [
                1360,
                1394
            ],
            [
                1396,
                1434
            ],
            [
                1502,
                1506
            ],
            [
                1532,
                1575
            ],
            [
                1577,
                1604
            ],
            [
                1606,
                1619
            ],
            [
                1627,
                1635
            ],
            [
                1656,
                1666
            ],
            [
                1668,
                1685
            ],
            [
                1756,
                1771
            ],
            [
                1789,
                1791
            ],
            [
                1797,
                1812
            ],
            [
                1814,
                1825
            ],
            [
                1834,
                1939
            ],
            [
                2018,
                2019
            ],
            [
                1745,
                1746
            ],
            [
                1944,
                1950
            ],
            [
                1952,
                1958
            ],
            [
                1987,
                2001
            ],
            [
                2011,
                2018
            ],
            [
                2047,
                2063
            ],
            [
                2065,
                2071
            ],
            [
                2183,
                2184
            ],
            [
                2073,
                2108
            ],
            [
                2110,
                2117
            ],
            [
                2132,
                2142
            ],
            [
                2185,
                2189
            ],
            [
                2200,
                2206
            ],
            [
                2249,
                2276
            ],
            [
                2285,
                2324
            ],
            [
                2363,
                2386
            ],
            [
                2413,
                2418
            ],
            [
                2427,
                2438
            ],
            [
                2440,
                2445
            ],
            [
                2446,
                2462
            ],
            [
                2471,
                2490
            ],
            [
                2496,
                2515
            ],
            [
                2529,
                2543
            ],
            [
                2547,
                2558
            ],
            [
                2560,
                2565
            ],
            [
                2584,
                2598
            ],
            [
                2608,
                2614
            ],
            [
                2616,
                2627
            ],
            [
                2645,
                2715
            ],
            [
                2717,
                2720
            ],
            [
                2733,
                2744
            ],
            [
                2751,
                2754
            ],
            [
                2755,
                2775
            ],
            [
                2784,
                2788
            ],
            [
                2777,
                2783
            ],
            [
                2788,
                2800
            ],
            [
                2813,
                2822
            ],
            [
                2732,
                2733
            ],
            [
                2824,
                2848
            ],
            [
                2851,
                2861
            ],
            [
                2865,
                2906
            ],
            [
                2922,
                2954
            ],
            [
                2956,
                2965
            ],
            [
                3101,
                3102
            ],
            [
                3141,
                3200
            ],
            [
                3252,
                3285
            ],
            [
                3238,
                3239
            ],
            [
                3309,
                3317
            ],
            [
                3333,
                3337
            ],
            [
                3342,
                3368
            ],
            [
                3370,
                3454
            ]
        ],
        "row_chars": [
            [
                0,
                715
            ],
            [
                715,
                947
            ],
            [
                947,
                1086
            ],
            [
                1086,
                1124
            ],
            [
                1124,
                1396
            ],
            [
                1396,
                1666
            ],
            [
                1666,
                1685
            ],
            [
                1685,
                2020
            ],
            [
                2020,
                2045
            ],
            [
                2045,
                2185
            ],
            [
                2185,
                2281
            ],
            [
                2281,
                2423
            ],
            [
                2423,
                2603
            ],
            [
                2603,
                2918
            ],
            [
                2918,
                2965
            ],
            [
                2965,
                3084
            ],
            [
                3084,
                3455
            ],
            [
                3455,
                3568
            ]
        ]
    },
    "abridged": {
        "text": "'I am glad of it,' said I, as I walked into Lyons - my chaise being all laid higgledy-piggledy with my baggage in a cart, which was moving slowly before me -\n'I am heartily glad,' said I, 'that 'tis all broke to pieces; for now I can go directly and cheaply by water to Avignon, which will carry me on a hundred and twenty miles of my journey, - and from thence, I can hire a couple of mules and cross the plains of Languedoc for almost nothing. I shall gain four hundred livres by the misfortune: and pleasure worth double the money. How fast I shall fly down the rapid Rhone, scarce seeing the ancient cities of Vienne, Valence, and Vivieres! I shall snatch a blushing grape from the Hermitage and Cte roti, as I shoot by them!\n'And what a fresh spring in the blood! to behold upon the banks the castles of romance, where courteous knights have rescued the distressed, and to see the mountains, the cataracts, and Nature with all her great works about her.'\nAs I went on thus, methought my chaise grew gradually smaller; the freshness of the painting was no more - the gilding lost its lustre - and the whole thing appeared so sorry! so contemptible! - that I was just about to curse it to the devil - when a pert chaise-undertaker, stepping nimbly across the street, demanded if Monsieur would have his chaise refitted?\n'No, no,' said I.\n'Would Monsieur sell it?'\n'With all my soul,' said I. 'The iron work is worth forty livres - and the windows forty more.'\nWhat wealth this post-chaise brought me! This is my usual method of book-keeping - making a penny of every disaster that happens to me-\nDo, my dear Jenny, tell the world how I behaved under the most oppressive disaster which could befall me as a man proud of his manhood-\n''Tis enough,' saidst thou to me, as I stood with my garters in my hand, reflecting upon what had not happened. ''Tis enough, Tristram, and I am satisfied,' thou saidst, whispering in my ear: '**** ** **** *** ******; **** ** **.' - Any other man would have sunk down to the centre.\n'Everything is good for something,' quoth I.\nSo I should not blame fortune so often as I have done, for pelting me all my life with so many small evils: surely, I should be angry that fortune has not sent me great ones. A score of good cursed, bouncing losses, would have been as good as a pension to me.",
        "paragraph_chars": [
            [
                0,
                158
            ],
            [
                158,
                730
            ],
            [
                730,
                960
            ],
            [
                960,
                1323
            ],
            [
                1323,
                1341
            ],
            [
                1341,
                1367
            ],
            [
                1367,
                1463
            ],
            [
                1463,
                1599
            ],
            [
                1599,
                1735
            ],
            [
                1735,
                2018
            ],
            [
                2018,
                2063
            ],
            [
                2063,
                2322
            ]
        ],
        "segment_chars": [
            [
                0,
                158
            ],
            [
                158,
                446
            ],
            [
                446,
                535
            ],
            [
                535,
                645
            ],
            [
                645,
                730
            ],
            [
                730,
                769
            ],
            [
                769,
                960
            ],
            [
                960,
                1136
            ],
            [
                1136,
                1153
            ],
            [
                1153,
                1323
            ],
            [
                1323,
                1341
            ],
            [
                1341,
                1367
            ],
            [
                1367,
                1395
            ],
            [
                1395,
                1463
            ],
            [
                1463,
                1504
            ],
            [
                1504,
                1599
            ],
            [
                1599,
                1735
            ],
            [
                1735,
                1847
            ],
            [
                1847,
                1966
            ],
            [
                1966,
                2018
            ],
            [
                2018,
                2063
            ],
            [
                2063,
                2238
            ],
            [
                2238,
                2322
            ]
        ],
        "overlap_chars": [
            [
                1,
                16
            ],
            [
                19,
                26
            ],
            [
                27,
                31
            ],
            [
                39,
                43
            ],
            [
                44,
                49
            ],
            [
                52,
                155
            ],
            [
                159,
                177
            ],
            [
                180,
                187
            ],
            [
                189,
                245
            ],
            [
                246,
                249
            ],
            [
                258,
                269
            ],
            [
                270,
                277
            ],
            [
                277,
                343
            ],
            [
                346,
                361
            ],
            [
                361,
                391
            ],
            [
                392,
                415
            ],
            [
                416,
                425
            ],
            [
                426,
                444
            ],
            [
                446,
                496
            ],
            [
                496,
                510
            ],
            [
                511,
                533
            ],
            [
                533,
                535
            ],
            [
                544,
                545
            ],
            [
                546,
                551
            ],
            [
                552,
                570
            ],
            [
                571,
                576
            ],
            [
                576,
                621
            ],
            [
                622,
                629
            ],
            [
                629,
                634
            ],
            [
                635,
                643
            ],
            [
                653,
                685
            ],
            [
                686,
                695
            ],
            [
                696,
                699
            ],
            [
                704,
                708
            ],
            [
                708,
                723
            ],
            [
                724,
                729
            ],
            [
                731,
                769
            ],
            [
                769,
                793
            ],
            [
                794,
                817
            ],
            [
                824,
                846
            ],
            [
                847,
                858
            ],
            [
                869,
                870
            ],
            [
                871,
                874
            ],
            [
                878,
                881
            ],
            [
                882,
                915
            ],
            [
                916,
                922
            ],
            [
                923,
                957
            ],
            [
                960,
                998
            ],
            [
                999,
                1003
            ],
            [
                1021,
                1064
            ],
            [
                1067,
                1094
            ],
            [
                1097,
                1110
            ],
            [
                1117,
                1125
            ],
            [
                1126,
                1136
            ],
            [
                1136,
                1153
            ],
            [
                1155,
                1170
            ],
            [
                1177,
                1179
            ],
            [
                1186,
                1201
            ],
            [
                1204,
                1215
            ],
            [
                1216,
                1321
            ],
            [
                1321,
                1322
            ],
            [
                1323,
                1324
            ],
            [
                1324,
                1330
            ],
            [
                1333,
                1339
            ],
            [
                1342,
                1356
            ],
            [
                1357,
                1364
            ],
            [
                1368,
                1384
            ],
            [
                1387,
                1393
            ],
            [
                1393,
                1394
            ],
            [
                1396,
                1431
            ],
            [
                1434,
                1441
            ],
            [
                1450,
                1460
            ],
            [
                1463,
                1467
            ],
            [
                1468,
                1474
            ],
            [
                1475,
                1502
            ],
            [
                1504,
                1543
            ],
            [
                1546,
                1569
            ],
            [
                1592,
                1597
            ],
            [
                1599,
                1610
            ],
            [
                1611,
                1616
            ],
            [
                1616,
                1632
            ],
            [
                1633,
                1652
            ],
            [
                1653,
                1672
            ],
            [
                1682,
                1696
            ],
            [
                1701,
                1712
            ],
            [
                1713,
                1718
            ],
            [
                1719,
                1733
            ],
            [
                1741,
                1747
            ],
            [
                1750,
                1761
            ],
            [
                1762,
                1832
            ],
            [
                1833,
                1836
            ],
            [
                1849,
                1860
            ],
            [
                1866,
                1869
            ],
            [
                1869,
                1889
            ],
            [
                1892,
                1896
            ],
            [
                1897,
                1903
            ],
            [
                1903,
                1915
            ],
            [
                1916,
                1925
            ],
            [
                1927,
                1928
            ],
            [
                1928,
                1952
            ],
            [
                1953,
                1963
            ],
            [
                1968,
                2009
            ],
            [
                2019,
                2051
            ],
            [
                2054,
                2063
            ],
            [
                2066,
                2067
            ],
            [
                2085,
                2144
            ],
            [
                2145,
                2178
            ],
            [
                2179,
                2180
            ],
            [
                2188,
                2196
            ],
            [
                2197,
                2201
            ],
            [
                2210,
                2236
            ],
            [
                2238,
                2322
            ]
        ],
        "row_chars": [
            [
                0,
                535
            ],
            [
                535,
                645
            ],
            [
                645,
                730
            ],
            [
                730,
                769
            ],
            [
                769,
                960
            ],
            [
                960,
                1136
            ],
            [
                1136,
                1153
            ],
            [
                1153,
                1367
            ],
            [
                1367,
                1367
            ],
            [
                1367,
                1463
            ],
            [
                1463,
                1504
            ],
            [
                1504,
                1599
            ],
            [
                1599,
                1735
            ],
            [
                1735,
                2018
            ],
            [
                2018,
                2063
            ],
            [
                2063,
                2063
            ],
            [
                2063,
                2322
            ],
            [
                2322,
                2322
            ]
        ]
    }
}