{
    "original": {
        "text": "If I was not morally sure that the reader must be out of all patience for my uncle _Toby's_ character, ----I would here previously have convinced him that there is no instrument so fit to draw such a thing with, as that which I have pitch'd upon.\nA man and his HOBBY-HORSE, tho' I cannot say that they act and re-act exactly after the same manner in which the soul and body do upon each other: Yet doubtless there is a communication between them of some kind; and my opinion rather is, that there is something in it more of the manner of electrified bodies, --and that, by means of the heated parts of the rider, which come immediately into contact with the back of the HOBBY-HORSE, --by long journeys and much friction, it so happens, that the body of the rider is at length fill'd as full of HOBBY-HORSICAL matter as it can hold; ----so that if you are able to give but a clear description of the nature of the one, you may form a pretty exact notion of the genius and character of the other.\nNow the HOBBY-HORSE which my uncle _Toby_ always rode upon, was in my opinion a HOBBY-HORSE well worth giving a description of, if it was only upon the score of his great singularity; --for you might have travelled from _York_ to _Dover_, --from _Dover_ to _Penzance_ in _Cornwall_, and from _Penzance_ to _York_ back again, and not have seen such another upon the road; or if you had seen such a one, whatever haste you had been in, you must infallibly have stopp'd to have taken a view of him. Indeed, the gait and figure of him was so strange, and so utterly unlike was he, from his head to his tail, to any one of the whole species, that it was now and then made a matter of dispute, ----whether he was really a HOBBY-HORSE or no: but as the Philosopher would use no other argument to the Sceptic, who disputed with him against the reality of motion, save that of rising up upon his legs, and walking across the room; --so would my uncle _Toby_ use no other argument to prove his HOBBY-HORSE was a HOBBY-HORSE indeed, but by getting upon his back and riding him about; --leaving the world, after that, to determine the point as it thought fit.\nIn good truth, my uncle _Toby_ mounted him with so much pleasure, and he carried my uncle _Toby_ so well, ----that he troubled his head very little with what the world either said or thought about it.\nIt is now high time, however, that I give you a description of him: --But to go on regularly, I only beg you will give me leave to acquaint you first, how my uncle _Toby_ came by him.",
        "paragraph_chars": [
            [
                0,
                247
            ],
            [
                247,
                995
            ],
            [
                995,
                2143
            ],
            [
                2143,
                2344
            ],
            [
                2344,
                2527
            ]
        ],
        "segment_chars": [
            [
                0,
                247
            ],
            [
                247,
                995
            ],
            [
                995,
                1491
            ],
            [
                1491,
                2143
            ],
            [
                2143,
                2344
            ],
            [
                2344,
                2527
            ]
        ],
        "overlap_chars": [
            [
                0,
                12
            ],
            [
                21,
                49
            ],
            [
                74,
                82
            ],
            [
                88,
                90
            ],
            [
                92,
                102
            ],
            [
                107,
                119
            ],
            [
                146,
                214
            ],
            [
                245,
                247
            ],
            [
                247,
                273
            ],
            [
                297,
                301
            ],
            [
                302,
                305
            ],
            [
                382,
                392
            ],
            [
                347,
                349
            ],
            [
                317,
                324
            ],
            [
                331,
                339
            ],
            [
                783,
                785
            ],
            [
                356,
                376
            ],
            [
                611,
                612
            ],
            [
                394,
                407
            ],
            [
                417,
                474
            ],
            [
                482,
                490
            ],
            [
                513,
                515
            ],
            [
                414,
                416
            ],
            [
                510,
                512
            ],
            [
                524,
                557
            ],
            [
                560,
                611
            ],
            [
                636,
                682
            ],
            [
                685,
                720
            ],
            [
                741,
                775
            ],
            [
                794,
                830
            ],
            [
                724,
                726
            ],
            [
                844,
                867
            ],
            [
                872,
                959
            ],
            [
                971,
                995
            ],
            [
                995,
                1029
            ],
            [
                1222,
                1224
            ],
            [
                1037,
                1048
            ],
            [
                1053,
                1072
            ],
            [
                1087,
                1097
            ],
            [
                1119,
                1121
            ],
            [
                1177,
                1178
            ],
            [
                1080,
                1081
            ],
            [
                1181,
                1214
            ],
            [
                1216,
                1220
            ],
            [
                1249,
                1251
            ],
            [
                1298,
                1300
            ],
            [
                1253,
                1261
            ],
            [
                1318,
                1337
            ],
            [
                1392,
                1395
            ],
            [
                1126,
                1128
            ],
            [
                1489,
                1491
            ],
            [
                1491,
                1498
            ],
            [
                1530,
                1563
            ],
            [
                1602,
                1605
            ],
            [
                1610,
                1616
            ],
            [
                1623,
                1630
            ],
            [
                1564,
                1571
            ],
            [
                1632,
                1639
            ],
            [
                1801,
                1809
            ],
            [
                1687,
                1722
            ],
            [
                1728,
                1733
            ],
            [
                2127,
                2129
            ],
            [
                1526,
                1529
            ],
            [
                2021,
                2023
            ],
            [
                1928,
                1936
            ],
            [
                1586,
                1588
            ],
            [
                2024,
                2066
            ],
            [
                2141,
                2143
            ],
            [
                2143,
                2145
            ],
            [
                2151,
                2166
            ],
            [
                2174,
                2232
            ],
            [
                2240,
                2248
            ],
            [
                2253,
                2260
            ],
            [
                2279,
                2290
            ],
            [
                2296,
                2310
            ],
            [
                2326,
                2344
            ],
            [
                2344,
                2410
            ],
            [
                2414,
                2417
            ],
            [
                2488,
                2494
            ],
            [
                2463,
                2465
            ],
            [
                2475,
                2487
            ],
            [
                2495,
                2507
            ],
            [
                2418,
                2420
            ],
            [
                2515,
                2527
            ]
        ],
        "row_chars": [
            [
                0,
                247
            ],
            [
                247,
                995
            ],
            [
                995,
                1491
            ],
            [
                1491,
                2143
            ],
            [
                2143,
                2344
            ],
            [
                2344,
                2527
            ]
        ]
    },
    "abridged": {
        "text": "If I was not sure that the reader must be impatient to hear my uncle Toby's character, I would here convince him that there is no instrument so fit to draw such a thing with, as a Hobby-Horse.\nA man and his Hobby-Horse, though they may not act on each other in exactly the same way as the soul and body do, yet doubtless have a communication between them of some kind; and my opinion is, that it is in the manner of electrified bodies, and that, by means of the heated parts of the rider coming into contact with the back of the Hobby-Horse, by long journeys and much friction, the body of the rider is at length filled with as much Hobby-Horsical matter as it can hold. So if you are able to give a clear description of the nature of the one, you may form a pretty exact notion of the character of the other.\nNow the Hobby-Horse which my uncle Toby always rode, was in my opinion well worth describing because of its uniqueness; - for you might have travelled from York to Dover to Penzance, and not have seen one like it. Indeed, so strange, and so utterly unlike any of the species was he, that it might be disputed whether he was really a Hobby-Horse at all: but it was proved by my uncle Toby's getting upon his back and riding him about.\nIn truth, my uncle Toby mounted him with so much pleasure, and he carried my uncle so well, - that he cared very little what the world thought about it.\nIt is now high time, however, that I give you a description of him. But first, just let me acquaint you with how my uncle Toby came by him.",
        "paragraph_chars": [
            [
                0,
                193
            ],
            [
                193,
                810
            ],
            [
                810,
                1244
            ],
            [
                1244,
                1397
            ],
            [
                1397,
                1536
            ]
        ],
        "segment_chars": [
            [
                0,
                193
            ],
            [
                193,
                671
            ],
            [
                671,
                810
            ],
            [
                810,
                1024
            ],
            [
                1024,
                1244
            ],
            [
                1244,
                1397
            ],
            [
                1397,
                1465
            ],
            [
                1465,
                1536
            ]
        ],
        "overlap_chars": [
            [
                0,
                12
            ],
            [
                13,
                41
            ],
            [
                60,
                68
            ],
            [
                73,
                75
            ],
            [
                76,
                86
            ],
            [
                87,
                99
            ],
            [
                109,
                177
            ],
            [
                191,
                193
            ],
            [
                193,
                219
            ],
            [
                227,
                231
            ],
            [
                240,
                243
            ],
            [
                247,
                257
            ],
            [
                258,
                260
            ],
            [
                261,
                268
            ],
            [
                269,
                277
            ],
            [
                282,
                284
            ],
            [
                285,
                305
            ],
            [
                305,
                306
            ],
            [
                307,
                320
            ],
            [
                326,
                383
            ],
            [
                384,
                392
            ],
            [
                393,
                395
            ],
            [
                396,
                398
            ],
            [
                399,
                401
            ],
            [
                402,
                435
            ],
            [
                436,
                487
            ],
            [
                495,
                541
            ],
            [
                542,
                577
            ],
            [
                578,
                612
            ],
            [
                633,
                669
            ],
            [
                671,
                673
            ],
            [
                674,
                697
            ],
            [
                698,
                785
            ],
            [
                786,
                810
            ],
            [
                810,
                844
            ],
            [
                845,
                847
            ],
            [
                850,
                861
            ],
            [
                861,
                880
            ],
            [
                881,
                891
            ],
            [
                911,
                913
            ],
            [
                928,
                929
            ],
            [
                930,
                931
            ],
            [
                932,
                965
            ],
            [
                966,
                970
            ],
            [
                971,
                973
            ],
            [
                980,
                982
            ],
            [
                983,
                991
            ],
            [
                991,
                1010
            ],
            [
                1011,
                1014
            ],
            [
                1020,
                1022
            ],
            [
                1022,
                1024
            ],
            [
                1024,
                1031
            ],
            [
                1032,
                1065
            ],
            [
                1066,
                1069
            ],
            [
                1070,
                1076
            ],
            [
                1077,
                1084
            ],
            [
                1085,
                1092
            ],
            [
                1093,
                1100
            ],
            [
                1110,
                1118
            ],
            [
                1119,
                1154
            ],
            [
                1161,
                1166
            ],
            [
                1167,
                1169
            ],
            [
                1170,
                1173
            ],
            [
                1181,
                1183
            ],
            [
                1184,
                1192
            ],
            [
                1193,
                1195
            ],
            [
                1200,
                1242
            ],
            [
                1242,
                1244
            ],
            [
                1244,
                1246
            ],
            [
                1247,
                1262
            ],
            [
                1268,
                1326
            ],
            [
                1327,
                1335
            ],
            [
                1338,
                1345
            ],
            [
                1352,
                1363
            ],
            [
                1364,
                1378
            ],
            [
                1379,
                1397
            ],
            [
                1397,
                1463
            ],
            [
                1465,
                1468
            ],
            [
                1469,
                1475
            ],
            [
                1485,
                1487
            ],
            [
                1488,
                1500
            ],
            [
                1506,
                1518
            ],
            [
                1519,
                1521
            ],
            [
                1524,
                1536
            ]
        ],
        "row_chars": [
            [
                0,
                193
            ],
            [
                193,
                810
            ],
            [
                810,
                1024
            ],
            [
                1024,
                1244
            ],
            [
                1244,
                1397
            ],
            [
                1397,
                1536
            ]
        ]
    }
}