{
    "original": {
        "text": "----'Twas by a poor ass, who had just turned in with a couple of large panniers upon his back, to collect eleemosynary turnip-tops and cabbage-leaves; and stood dubious, with his two fore-feet on the inside of the threshold, and with his two hinder feet towards the street, as not knowing very well whether he was to go in or no.\nNow, 'tis an animal (be in what hurry I may) I cannot bear to strike----there is a patient endurance of sufferings, wrote so unaffectedly in his looks and carriage, which pleads so mightily for him, that it always disarms me; and to that degree, that I do not like to speak unkindly to him: on the contrary, meet him where I will--whether in town or country--in cart or under panniers--whether in liberty or bondage ----I have ever something civil to say to him on my part; and as one word begets another (if he has as little to do as I) ----I generally fall into conversation with him; and surely never is my imagination so busy as in framing his responses from the etchings of his countenance--and where those carry me not deep enough----in flying from my own heart into his, and seeing what is natural for an ass to think--as well as a man, upon the occasion. In truth, it is the only creature of all the classes of beings below me, with whom I can do this: for parrots, jackdaws, &c. ----I never exchange a word with them----nor with the apes, &c., for pretty near the same reason; they act by rote, as the others speak by it, and equally make me silent: nay my dog and my cat, though I value them both----(and for my dog he would speak if he could)--yet somehow or other, they neither of them possess the talents for conversation ----I can make nothing of a discourse with them, beyond the _proposition_, the _reply_, and _rejoinder_, which terminated my father's and my mother's conversations, in his beds of justice----and those utter'd----there's an end of the dialogue----\n--But with an ass, I can commune for ever.\nCome, _Honesty!_ said I, ----seeing it was impracticable to pass betwixt him and the gate----art thou for coming in, or going out?\nThe ass twisted his head round to look up the street----\nWell--replied I--we'll wait a minute for thy driver:\n----He turned his head thoughtful about, and looked wistfully the opposite way----\nI understand thee perfectly, answered I ----If thou takest a wrong step in this affair, he will cudgel thee to death ----Well! a minute is but a minute, and if it saves a fellow-creature a drubbing, it shall not be set down as ill spent.\nHe was eating the stem of an artichoke as this discourse went on, and in the little peevish contentions of nature betwixt hunger and unsavouriness, had dropt it out of his mouth half a dozen times, and pick'd it up again ----God help thee, _Jack!_ said I, thou hast a bitter breakfast on't--and many a bitter day's labour, --and many a bitter blow, I fear, for its wages----'tis all--all bitterness to thee, whatever life is to others. ----And now thy mouth, if one knew the truth of it, is as bitter, I dare say, as soot--(for he had cast aside the stem) and thou hast not a friend perhaps in all this world, that will give thee a macaroon. ----In saying this, I pull'd out a paper of 'em, which I had just purchased, and gave him one--and at this moment that I am telling it, my heart smites me, that there was more of pleasantry in the conceit, of seeing _how_ an ass would eat a macaroon----than of benevolence in giving him one, which presided in the act.\nWhen the ass had eaten his macaroon, I press'd him to come in--the poor beast was heavy loaded----his legs seem'd to tremble under him----he hung rather backwards, and as I pull'd at his halter, it broke short in my hand----he look'd up pensive in my face-- \"Don't thrash me with it--but if you will, you may\" ----If I do, said I, I'll be d----d.\nThe word was but one-half of it pronounced, like the abbess of _Andoillets'_--(so there was no sin in it)--when a person coming in, let fall a thundering bastinado upon the poor devil's crupper, which put an end to the ceremony.\n_Out upon it!_\ncried I----but the interjection was equivocal----and, I think, wrong placed too--for the end of an osier which had started out from the contexture of the ass's pannier, had caught hold of my breeches pocket, as he rush'd by me, and rent it in the most disastrous direction you can imagine----so that the\n_Out upon it!_ in my opinion, should have come in here----but this I leave to be settled by\nTHE REVIEWERS OF MY BREECHES,\nwhich I have brought over along with me for that purpose.",
        "paragraph_chars": [
            [
                0,
                330
            ],
            [
                330,
                1912
            ],
            [
                1912,
                1955
            ],
            [
                1955,
                2086
            ],
            [
                2086,
                2143
            ],
            [
                2143,
                2196
            ],
            [
                2196,
                2279
            ],
            [
                2279,
                2517
            ],
            [
                2517,
                3478
            ],
            [
                3478,
                3825
            ],
            [
                3825,
                4054
            ],
            [
                4054,
                4069
            ],
            [
                4069,
                4373
            ],
            [
                4373,
                4465
            ],
            [
                4465,
                4495
            ],
            [
                4495,
                4552
            ]
        ],
        "segment_chars": [
            [
                0,
                330
            ],
            [
                330,
                1193
            ],
            [
                1193,
                1912
            ],
            [
                1912,
                1955
            ],
            [
                1955,
                2086
            ],
            [
                2086,
                2143
            ],
            [
                2143,
                2196
            ],
            [
                2196,
                2279
            ],
            [
                2279,
                2406
            ],
            [
                2406,
                2517
            ],
            [
                2517,
                2953
            ],
            [
                2953,
                3159
            ],
            [
                3159,
                3478
            ],
            [
                3478,
                3825
            ],
            [
                3825,
                4054
            ],
            [
                4054,
                4069
            ],
            [
                4069,
                4373
            ],
            [
                4373,
                4465
            ],
            [
                4465,
                4495
            ],
            [
                4495,
                4552
            ]
        ],
        "overlap_chars": [
            [
                5,
                94
            ],
            [
                119,
                241
            ],
            [
                249,
                253
            ],
            [
                262,
                273
            ],
            [
                277,
                288
            ],
            [
                299,
                330
            ],
            [
                330,
                334
            ],
            [
                375,
                398
            ],
            [
                340,
                342
            ],
            [
                402,
                410
            ],
            [
                411,
                444
            ],
            [
                468,
                480
            ],
            [
                529,
                559
            ],
            [
                581,
                589
            ],
            [
                590,
                619
            ],
            [
                1191,
                1192
            ],
            [
                621,
                637
            ],
            [
                368,
                369
            ],
            [
                638,
                642
            ],
            [
                444,
                445
            ],
            [
                750,
                756
            ],
            [
                762,
                791
            ],
            [
                802,
                834
            ],
            [
                493,
                494
            ],
            [
                872,
                915
            ],
            [
                619,
                620
            ],
            [
                974,
                996
            ],
            [
                792,
                794
            ],
            [
                1009,
                1012
            ],
            [
                677,
                679
            ],
            [
                1080,
                1084
            ],
            [
                1098,
                1106
            ],
            [
                1092,
                1097
            ],
            [
                1106,
                1154
            ],
            [
                1193,
                1226
            ],
            [
                1266,
                1317
            ],
            [
                1322,
                1355
            ],
            [
                1359,
                1367
            ],
            [
                1372,
                1376
            ],
            [
                1414,
                1415
            ],
            [
                1383,
                1386
            ],
            [
                1416,
                1436
            ],
            [
                1448,
                1464
            ],
            [
                1473,
                1487
            ],
            [
                1493,
                1536
            ],
            [
                1540,
                1544
            ],
            [
                1549,
                1555
            ],
            [
                1559,
                1582
            ],
            [
                1585,
                1588
            ],
            [
                1612,
                1627
            ],
            [
                1636,
                1664
            ],
            [
                1669,
                1724
            ],
            [
                1738,
                1743
            ],
            [
                1745,
                1750
            ],
            [
                1751,
                1756
            ],
            [
                1762,
                1767
            ],
            [
                1768,
                1775
            ],
            [
                1787,
                1802
            ],
            [
                1806,
                1828
            ],
            [
                1830,
                1852
            ],
            [
                1914,
                1955
            ],
            [
                1955,
                1960
            ],
            [
                1972,
                1979
            ],
            [
                1984,
                1997
            ],
            [
                2012,
                2014
            ],
            [
                2028,
                2031
            ],
            [
                2048,
                2056
            ],
            [
                2061,
                2084
            ],
            [
                2086,
                2138
            ],
            [
                2143,
                2147
            ],
            [
                2157,
                2158
            ],
            [
                2160,
                2194
            ],
            [
                2200,
                2218
            ],
            [
                2237,
                2274
            ],
            [
                2279,
                2306
            ],
            [
                2308,
                2318
            ],
            [
                2323,
                2350
            ],
            [
                2365,
                2395
            ],
            [
                2400,
                2406
            ],
            [
                2406,
                2467
            ],
            [
                2476,
                2480
            ],
            [
                2487,
                2490
            ],
            [
                2506,
                2515
            ],
            [
                2517,
                2563
            ],
            [
                2574,
                2586
            ],
            [
                2665,
                2668
            ],
            [
                2675,
                2718
            ],
            [
                2726,
                2737
            ],
            [
                2891,
                2892
            ],
            [
                2742,
                2756
            ],
            [
                2758,
                2762
            ],
            [
                2765,
                2772
            ],
            [
                2778,
                2801
            ],
            [
                2646,
                2649
            ],
            [
                2817,
                2839
            ],
            [
                2842,
                2877
            ],
            [
                2882,
                2887
            ],
            [
                2951,
                2953
            ],
            [
                2957,
                2974
            ],
            [
                3005,
                3038
            ],
            [
                3040,
                3072
            ],
            [
                3073,
                3099
            ],
            [
                3108,
                3157
            ],
            [
                3163,
                3180
            ],
            [
                3188,
                3193
            ],
            [
                3200,
                3252
            ],
            [
                3254,
                3257
            ],
            [
                3295,
                3319
            ],
            [
                3278,
                3279
            ],
            [
                3261,
                3265
            ],
            [
                3330,
                3334
            ],
            [
                3376,
                3379
            ],
            [
                3381,
                3408
            ],
            [
                3412,
                3416
            ],
            [
                3335,
                3337
            ],
            [
                3476,
                3478
            ],
            [
                3478,
                3516
            ],
            [
                3525,
                3539
            ],
            [
                3823,
                3824
            ],
            [
                3541,
                3559
            ],
            [
                3566,
                3572
            ],
            [
                3576,
                3584
            ],
            [
                3592,
                3602
            ],
            [
                3642,
                3650
            ],
            [
                3658,
                3681
            ],
            [
                3688,
                3698
            ],
            [
                3616,
                3618
            ],
            [
                3712,
                3722
            ],
            [
                3766,
                3768
            ],
            [
                3640,
                3641
            ],
            [
                3737,
                3760
            ],
            [
                3792,
                3799
            ],
            [
                3801,
                3808
            ],
            [
                3809,
                3818
            ],
            [
                3822,
                3823
            ],
            [
                3825,
                3841
            ],
            [
                3846,
                3850
            ],
            [
                3857,
                3887
            ],
            [
                3889,
                3899
            ],
            [
                3903,
                3929
            ],
            [
                3845,
                3846
            ],
            [
                3932,
                3978
            ],
            [
                3989,
                4018
            ],
            [
                4052,
                4054
            ],
            [
                4055,
                4066
            ],
            [
                4069,
                4076
            ],
            [
                4080,
                4114
            ],
            [
                4150,
                4167
            ],
            [
                4219,
                4236
            ],
            [
                4238,
                4275
            ],
            [
                4277,
                4282
            ],
            [
                4293,
                4357
            ],
            [
                4361,
                4373
            ],
            [
                4374,
                4385
            ],
            [
                4388,
                4419
            ],
            [
                4423,
                4427
            ],
            [
                4431,
                4465
            ],
            [
                4465,
                4468
            ],
            [
                4479,
                4481
            ],
            [
                4482,
                4495
            ],
            [
                4495,
                4515
            ],
            [
                4521,
                4552
            ]
        ],
        "row_chars": [
            [
                0,
                330
            ],
            [
                330,
                1193
            ],
            [
                1193,
                1912
            ],
            [
                1912,
                1955
            ],
            [
                1955,
                2086
            ],
            [
                2086,
                2143
            ],
            [
                2143,
                2196
            ],
            [
                2196,
                2279
            ],
            [
                2279,
                2406
            ],
            [
                2406,
                2517
            ],
            [
                2517,
                2953
            ],
            [
                2953,
                3159
            ],
            [
                3159,
                3478
            ],
            [
                3478,
                3825
            ],
            [
                3825,
                4054
            ],
            [
                4054,
                4069
            ],
            [
                4069,
                4373
            ],
            [
                4373,
                4465
            ],
            [
                4465,
                4495
            ],
            [
                4495,
                4552
            ]
        ]
    },
    "abridged": {
        "text": "-'Twas by a poor ass, who had just turned in with a couple of large panniers upon his back, for turnip-tops and cabbage-leaves; and stood dubious, with his two fore-feet on the inside of the threshold, and with his two hind feet on the street, not knowing whether he was to go in or no.\nNow, I cannot bear to strike an ass - there is such a patient endurance of sufferings in his looks that it always disarms me; and I do not even like to speak unkindly to him. On the contrary, wherever I meet an ass, I have always something civil to say to him; and as one word begets another, I generally fall into conversation with him: imagining his responses from the expression on his face - or from looking into his heart, and seeing what is natural for an ass to think.\nIn truth, it is the only creature with whom I can do this: for parrots, jackdaws, &c. - I never exchange a word with them - nor with apes; for they act by rote, as parrots speak by it, and both make me silent. Even my dog and my cat, though I value them both (and my dog would speak if he could) - yet neither of them has the talents for conversation - I can make nothing of a discourse with them, beyond the proposition, the reply, and rejoinder, which ended my father's and mother's conversations in his beds of justice.\n- But with an ass, I can commune for ever.\n'Come, Honesty!' said I, seeing it was impossible to get past him - 'art thou coming in, or going out?'\nThe ass twisted his head round to look up the street.\n'Well,' replied I, 'we'll wait a minute for thy driver.'\nHe turned his head and looked wistfully the opposite way.\n'I understand thee perfectly,' answered I. 'If thou takest a wrong step, he will cudgel thee to death. - Well! a minute is but a minute, and if it saves a fellow-creature a beating, it is not ill spent.'\nHe was eating the stem of an artichoke as this went on, and had dropped it out of his mouth half a dozen times, and picked it up again.\n'God help thee, Jack!' said I, 'thou hast a bitter breakfast - and a bitter day's labour, and many a bitter blow, I fear, for wages. - And now thy mouth is as bitter, I dare say, as soot' (for he had cast aside the stem) 'and thou hast not a friend in all this world, that will give thee a macaroon.'\nIn saying this, I pulled out a bag of 'em, which I had just purchased, and gave him one - and my heart smites me, that I did this more to see how an ass would eat a macaroon than out of kindness.\nWhen the ass had eaten his macaroon, I pressed him to come in. The poor beast was heavily loaded - his legs seemed to tremble - and as I pulled at his halter, it broke in my hand. He looked up pensive as if to say, 'Don't thrash me with it.'\n'If I do,' said I, 'I'll be d__d.' The word was but half pronounced, like the abbess of Andoillets's (so there was no sin in it) - when a person coming in, let fall a thundering blow upon the poor devil's crupper.\n'Out upon it!' cried I - but the interjection was equivocal - for the end of an willow branch in the ass's pannier had caught hold of my breeches pocket as he rushed past me, and rent it in the most disastrous direction you can imagine - so that the\n'Out upon it!' in my opinion, should have come here.\nBut this I leave to be settled by\nTHE\nREVIEWERS\nOF\nMY BREECHES,\nwhich I have brought along with me for that purpose.",
        "paragraph_chars": [
            [
                0,
                287
            ],
            [
                287,
                763
            ],
            [
                763,
                1286
            ],
            [
                1286,
                1329
            ],
            [
                1329,
                1433
            ],
            [
                1433,
                1487
            ],
            [
                1487,
                1544
            ],
            [
                1544,
                1602
            ],
            [
                1602,
                1806
            ],
            [
                1806,
                1942
            ],
            [
                1942,
                2243
            ],
            [
                2243,
                2439
            ],
            [
                2439,
                2681
            ],
            [
                2681,
                2895
            ],
            [
                2895,
                3145
            ],
            [
                3145,
                3198
            ],
            [
                3198,
                3232
            ],
            [
                3232,
                3236
            ],
            [
                3236,
                3246
            ],
            [
                3246,
                3249
            ],
            [
                3249,
                3262
            ],
            [
                3262,
                3314
            ]
        ],
        "segment_chars": [
            [
                0,
                287
            ],
            [
                287,
                462
            ],
            [
                462,
                763
            ],
            [
                763,
                973
            ],
            [
                973,
                1286
            ],
            [
                1286,
                1329
            ],
            [
                1329,
                1346
            ],
            [
                1346,
                1433
            ],
            [
                1433,
                1487
            ],
            [
                1487,
                1544
            ],
            [
                1544,
                1602
            ],
            [
                1602,
                1645
            ],
            [
                1645,
                1705
            ],
            [
                1705,
                1713
            ],
            [
                1713,
                1806
            ],
            [
                1806,
                1942
            ],
            [
                1942,
                1965
            ],
            [
                1965,
                2075
            ],
            [
                2075,
                2243
            ],
            [
                2243,
                2439
            ],
            [
                2439,
                2502
            ],
            [
                2502,
                2619
            ],
            [
                2619,
                2681
            ],
            [
                2681,
                2716
            ],
            [
                2716,
                2895
            ],
            [
                2895,
                2910
            ],
            [
                2910,
                3145
            ],
            [
                3145,
                3160
            ],
            [
                3160,
                3198
            ],
            [
                3198,
                3232
            ],
            [
                3232,
                3236
            ],
            [
                3236,
                3246
            ],
            [
                3246,
                3249
            ],
            [
                3249,
                3262
            ],
            [
                3262,
                3314
            ]
        ],
        "overlap_chars": [
            [
                2,
                91
            ],
            [
                96,
                218
            ],
            [
                224,
                228
            ],
            [
                232,
                243
            ],
            [
                244,
                255
            ],
            [
                256,
                287
            ],
            [
                287,
                291
            ],
            [
                292,
                315
            ],
            [
                316,
                318
            ],
            [
                325,
                333
            ],
            [
                339,
                372
            ],
            [
                373,
                385
            ],
            [
                386,
                416
            ],
            [
                417,
                425
            ],
            [
                431,
                460
            ],
            [
                460,
                461
            ],
            [
                462,
                478
            ],
            [
                488,
                489
            ],
            [
                490,
                494
            ],
            [
                501,
                502
            ],
            [
                503,
                509
            ],
            [
                517,
                546
            ],
            [
                546,
                578
            ],
            [
                578,
                579
            ],
            [
                580,
                623
            ],
            [
                623,
                624
            ],
            [
                635,
                657
            ],
            [
                669,
                671
            ],
            [
                672,
                675
            ],
            [
                683,
                685
            ],
            [
                686,
                690
            ],
            [
                699,
                707
            ],
            [
                708,
                713
            ],
            [
                713,
                761
            ],
            [
                763,
                796
            ],
            [
                797,
                848
            ],
            [
                851,
                884
            ],
            [
                887,
                895
            ],
            [
                896,
                900
            ],
            [
                900,
                901
            ],
            [
                902,
                905
            ],
            [
                906,
                926
            ],
            [
                935,
                951
            ],
            [
                957,
                971
            ],
            [
                978,
                1021
            ],
            [
                1022,
                1026
            ],
            [
                1027,
                1033
            ],
            [
                1034,
                1057
            ],
            [
                1061,
                1064
            ],
            [
                1065,
                1080
            ],
            [
                1085,
                1113
            ],
            [
                1116,
                1171
            ],
            [
                1183,
                1188
            ],
            [
                1189,
                1194
            ],
            [
                1194,
                1199
            ],
            [
                1204,
                1209
            ],
            [
                1209,
                1216
            ],
            [
                1223,
                1238
            ],
            [
                1239,
                1261
            ],
            [
                1262,
                1284
            ],
            [
                1288,
                1329
            ],
            [
                1330,
                1335
            ],
            [
                1346,
                1353
            ],
            [
                1354,
                1367
            ],
            [
                1379,
                1381
            ],
            [
                1391,
                1394
            ],
            [
                1398,
                1406
            ],
            [
                1407,
                1430
            ],
            [
                1433,
                1485
            ],
            [
                1488,
                1492
            ],
            [
                1503,
                1504
            ],
            [
                1507,
                1541
            ],
            [
                1544,
                1562
            ],
            [
                1563,
                1600
            ],
            [
                1603,
                1630
            ],
            [
                1633,
                1643
            ],
            [
                1646,
                1673
            ],
            [
                1673,
                1703
            ],
            [
                1707,
                1713
            ],
            [
                1713,
                1774
            ],
            [
                1782,
                1786
            ],
            [
                1790,
                1793
            ],
            [
                1794,
                1803
            ],
            [
                1806,
                1852
            ],
            [
                1853,
                1865
            ],
            [
                1866,
                1869
            ],
            [
                1878,
                1921
            ],
            [
                1929,
                1940
            ],
            [
                1942,
                1943
            ],
            [
                1943,
                1957
            ],
            [
                1958,
                1962
            ],
            [
                1965,
                1972
            ],
            [
                1979,
                2002
            ],
            [
                2005,
                2008
            ],
            [
                2009,
                2031
            ],
            [
                2032,
                2067
            ],
            [
                2068,
                2073
            ],
            [
                2073,
                2075
            ],
            [
                2077,
                2094
            ],
            [
                2095,
                2128
            ],
            [
                2130,
                2162
            ],
            [
                2164,
                2190
            ],
            [
                2191,
                2240
            ],
            [
                2243,
                2260
            ],
            [
                2268,
                2273
            ],
            [
                2278,
                2330
            ],
            [
                2333,
                2336
            ],
            [
                2337,
                2361
            ],
            [
                2362,
                2363
            ],
            [
                2368,
                2372
            ],
            [
                2373,
                2377
            ],
            [
                2385,
                2388
            ],
            [
                2389,
                2416
            ],
            [
                2417,
                2421
            ],
            [
                2426,
                2428
            ],
            [
                2437,
                2439
            ],
            [
                2439,
                2477
            ],
            [
                2486,
                2500
            ],
            [
                2500,
                2501
            ],
            [
                2502,
                2520
            ],
            [
                2529,
                2535
            ],
            [
                2538,
                2546
            ],
            [
                2554,
                2564
            ],
            [
                2567,
                2575
            ],
            [
                2583,
                2606
            ],
            [
                2607,
                2617
            ],
            [
                2619,
                2621
            ],
            [
                2629,
                2639
            ],
            [
                2643,
                2645
            ],
            [
                2652,
                2653
            ],
            [
                2655,
                2678
            ],
            [
                2682,
                2689
            ],
            [
                2692,
                2699
            ],
            [
                2701,
                2710
            ],
            [
                2712,
                2713
            ],
            [
                2716,
                2732
            ],
            [
                2733,
                2737
            ],
            [
                2738,
                2768
            ],
            [
                2769,
                2779
            ],
            [
                2782,
                2808
            ],
            [
                2810,
                2811
            ],
            [
                2812,
                2858
            ],
            [
                2864,
                2893
            ],
            [
                2893,
                2895
            ],
            [
                2896,
                2907
            ],
            [
                2910,
                2917
            ],
            [
                2920,
                2954
            ],
            [
                2957,
                2974
            ],
            [
                2992,
                3009
            ],
            [
                3010,
                3047
            ],
            [
                3048,
                3053
            ],
            [
                3066,
                3130
            ],
            [
                3133,
                3145
            ],
            [
                3146,
                3157
            ],
            [
                3160,
                3191
            ],
            [
                3192,
                3196
            ],
            [
                3198,
                3232
            ],
            [
                3232,
                3235
            ],
            [
                3246,
                3248
            ],
            [
                3249,
                3262
            ],
            [
                3262,
                3282
            ],
            [
                3283,
                3314
            ]
        ],
        "row_chars": [
            [
                0,
                287
            ],
            [
                287,
                763
            ],
            [
                763,
                1286
            ],
            [
                1286,
                1329
            ],
            [
                1329,
                1433
            ],
            [
                1433,
                1487
            ],
            [
                1487,
                1544
            ],
            [
                1544,
                1602
            ],
            [
                1602,
                1713
            ],
            [
                1713,
                1806
            ],
            [
                1806,
                2075
            ],
            [
                2075,
                2243
            ],
            [
                2243,
                2439
            ],
            [
                2439,
                2716
            ],
            [
                2716,
                2895
            ],
            [
                2895,
                2910
            ],
            [
                2910,
                3145
            ],
            [
                3145,
                3232
            ],
            [
                3232,
                3262
            ],
            [
                3262,
                3314
            ]
        ]
    }
}