{
    "original": {
        "text": "No matter how, or in what mood--but I flew from the tomb of the lovers--or rather I did not fly _from_ it--(for there was no such thing existing) and just got time enough to the boat to save my passage; --and ere I had sailed a hundred yards, the _Rhne_ and the _San_ met together, and carried me down merrily betwixt them.\nBut I have described this voyage down the _Rhne_, before I made it----\n----So now I am at _Avignon_, and as there is nothing to see but the old house, in which the duke of _Ormond_ resided, and nothing to stop me but a short remark upon the place, in three minutes you will see me crossing the bridge upon a mule, with _Franois_ upon a horse with my portmanteau behind him, and the owner of both, striding the way before us, with a long gun upon his shoulder, and a sword under his arm, lest peradventure we should run away with his cattle. Had you seen my breeches in entering _Avignon_, ----Though you'd have seen them better, I think, as I mounted--you would not have thought the precaution amiss, or found in your heart to have taken it in dudgeon; for my own part, I took it most kindly; and determined to make him a present of them, when we got to the end of our journey, for the trouble they had put him to, of arming himself at all points against them.\nBefore I go further, let me get rid of my remark upon _Avignon_, which is this: That I think it wrong, merely because a man's hat has been blown off his head by chance the first night he comes to _Avignon_, ----that he should therefore say, \"_Avignon_ is more subject to high winds than any town in all _France_:\" for which reason I laid no stress upon the accident till I had enquired of the master of the inn about it, who telling me seriously it was so----and hearing, moreover, the windiness of _Avignon_ spoke of in the country about as a proverb ----I set it down, merely to ask the learned what can be the cause----the consequence I saw--for they are all Dukes, Marquisses, and Counts, there----the duce a Baron, in all _Avignon_----so that there is scarce any talking to them on a windy day.\nPrithee, friend, said I, take hold of my mule for a moment----for I wanted to pull off one of my jack-boots, which hurt my heel--the man was standing quite idle at the door of the inn, and as I had taken it into my head, he was someway concerned about the house or stable, I put the bridle into his hand--so begun with the boot: --when I had finished the affair, I turned about to take the mule from the man, and thank him----\n------But _Monsieur le Marquis_ had walked in----",
        "paragraph_chars": [
            [
                0,
                324
            ],
            [
                324,
                395
            ],
            [
                395,
                1285
            ],
            [
                1285,
                2085
            ],
            [
                2085,
                2512
            ],
            [
                2512,
                2561
            ]
        ],
        "segment_chars": [
            [
                0,
                324
            ],
            [
                324,
                395
            ],
            [
                395,
                865
            ],
            [
                865,
                1285
            ],
            [
                1285,
                2085
            ],
            [
                2085,
                2512
            ],
            [
                2512,
                2561
            ]
        ],
        "overlap_chars": [
            [
                36,
                70
            ],
            [
                72,
                91
            ],
            [
                107,
                111
            ],
            [
                103,
                105
            ],
            [
                144,
                154
            ],
            [
                174,
                182
            ],
            [
                18,
                20
            ],
            [
                159,
                163
            ],
            [
                183,
                201
            ],
            [
                213,
                246
            ],
            [
                248,
                252
            ],
            [
                254,
                261
            ],
            [
                268,
                271
            ],
            [
                280,
                324
            ],
            [
                324,
                365
            ],
            [
                367,
                371
            ],
            [
                374,
                390
            ],
            [
                399,
                413
            ],
            [
                415,
                422
            ],
            [
                423,
                440
            ],
            [
                518,
                624
            ],
            [
                630,
                642
            ],
            [
                653,
                665
            ],
            [
                696,
                719
            ],
            [
                721,
                729
            ],
            [
                738,
                747
            ],
            [
                749,
                815
            ],
            [
                829,
                856
            ],
            [
                863,
                865
            ],
            [
                865,
                889
            ],
            [
                911,
                912
            ],
            [
                976,
                1023
            ],
            [
                1283,
                1285
            ],
            [
                1285,
                1338
            ],
            [
                1340,
                1347
            ],
            [
                1348,
                1364
            ],
            [
                1365,
                1442
            ],
            [
                1453,
                1480
            ],
            [
                1482,
                1489
            ],
            [
                1490,
                1491
            ],
            [
                1496,
                1525
            ],
            [
                1528,
                1535
            ],
            [
                1537,
                1539
            ],
            [
                1688,
                1691
            ],
            [
                1576,
                1587
            ],
            [
                1616,
                1677
            ],
            [
                1692,
                1695
            ],
            [
                1696,
                1704
            ],
            [
                1721,
                1740
            ],
            [
                1744,
                1783
            ],
            [
                1785,
                1792
            ],
            [
                1794,
                1802
            ],
            [
                1824,
                1836
            ],
            [
                1841,
                1903
            ],
            [
                1907,
                1928
            ],
            [
                1930,
                1976
            ],
            [
                1803,
                1805
            ],
            [
                2013,
                2020
            ],
            [
                2025,
                2085
            ],
            [
                2085,
                2100
            ],
            [
                2102,
                2109
            ],
            [
                2115,
                2119
            ],
            [
                2123,
                2143
            ],
            [
                2147,
                2212
            ],
            [
                2214,
                2245
            ],
            [
                2249,
                2273
            ],
            [
                2277,
                2278
            ],
            [
                2306,
                2312
            ],
            [
                2321,
                2330
            ],
            [
                2337,
                2356
            ],
            [
                2390,
                2392
            ],
            [
                2358,
                2388
            ],
            [
                2393,
                2412
            ],
            [
                2416,
                2435
            ],
            [
                2446,
                2456
            ],
            [
                2463,
                2507
            ],
            [
                2518,
                2521
            ],
            [
                2527,
                2542
            ],
            [
                2544,
                2557
            ]
        ],
        "row_chars": [
            [
                0,
                324
            ],
            [
                324,
                395
            ],
            [
                395,
                865
            ],
            [
                865,
                1285
            ],
            [
                1285,
                2085
            ],
            [
                2085,
                2512
            ],
            [
                2512,
                2561
            ]
        ]
    },
    "abridged": {
        "text": "I flew from the tomb of the lovers - or rather I did not (for it did not exist) and just reached the boat in time to save my passage. Before I had sailed a hundred yards, the Rhne and the Sane met, and carried me down merrily betwixt them.\nBut I have described this voyage down the Rhne before I made it-\nSo now I am at Avignon, and as there is nothing to stop me but a short remark upon the place, in three minutes you will see me crossing the bridge on a mule, with Franois upon a horse, and the owner of both striding before us with a long gun upon his shoulder, and a sword under his arm, lest we should run away with his animals. Had you seen my breeches, you would not have thought the precaution amiss.\nBefore I go further, let me get rid of my remark upon Avignon, which is this:\nThat I think it wrong, merely because a man's hat has been blown off his head the first night he comes to Avignon, that he should therefore say, 'Avignon is the windiest town in all France.'\nThis is why I laid no stress upon the accident till I had enquired of the inn-keeper about it. When I was told seriously it was so - and hearing, moreover, the windiness of Avignon spoke of as a proverb - I set it down, merely to ask the learned what can be the cause. The consequence I saw - for they are all Dukes, Marquisses, and Counts in Avignon - so that there is scarce any talking to them on a windy day.\n'Prithee, friend,' said I, 'hold my mule for a moment,' - for I wanted to pull off one of my jack-boots, which hurt my heel. The man was standing quite idle outside the door of the inn, and I assumed he was in some way concerned with the house or stable; so I put the bridle into his hand and begun with the boot.\nWhen I had finished, I turned to take the mule from the man, and thank him-\nBut Monsieur le Marquis had walked in-",
        "paragraph_chars": [
            [
                0,
                240
            ],
            [
                240,
                305
            ],
            [
                305,
                710
            ],
            [
                710,
                788
            ],
            [
                788,
                979
            ],
            [
                979,
                1392
            ],
            [
                1392,
                1706
            ],
            [
                1706,
                1782
            ],
            [
                1782,
                1820
            ]
        ],
        "segment_chars": [
            [
                0,
                134
            ],
            [
                134,
                240
            ],
            [
                240,
                305
            ],
            [
                305,
                635
            ],
            [
                635,
                710
            ],
            [
                710,
                788
            ],
            [
                788,
                979
            ],
            [
                979,
                1074
            ],
            [
                1074,
                1248
            ],
            [
                1248,
                1392
            ],
            [
                1392,
                1517
            ],
            [
                1517,
                1706
            ],
            [
                1706,
                1782
            ],
            [
                1782,
                1820
            ]
        ],
        "overlap_chars": [
            [
                0,
                34
            ],
            [
                37,
                56
            ],
            [
                57,
                61
            ],
            [
                62,
                64
            ],
            [
                78,
                88
            ],
            [
                97,
                105
            ],
            [
                106,
                108
            ],
            [
                109,
                113
            ],
            [
                114,
                132
            ],
            [
                141,
                174
            ],
            [
                175,
                179
            ],
            [
                180,
                187
            ],
            [
                193,
                196
            ],
            [
                196,
                240
            ],
            [
                240,
                281
            ],
            [
                282,
                286
            ],
            [
                287,
                303
            ],
            [
                305,
                319
            ],
            [
                320,
                327
            ],
            [
                327,
                344
            ],
            [
                345,
                451
            ],
            [
                455,
                467
            ],
            [
                476,
                488
            ],
            [
                488,
                511
            ],
            [
                512,
                520
            ],
            [
                521,
                530
            ],
            [
                531,
                597
            ],
            [
                598,
                625
            ],
            [
                633,
                635
            ],
            [
                635,
                659
            ],
            [
                659,
                660
            ],
            [
                661,
                708
            ],
            [
                708,
                710
            ],
            [
                710,
                763
            ],
            [
                764,
                771
            ],
            [
                771,
                787
            ],
            [
                788,
                865
            ],
            [
                866,
                893
            ],
            [
                894,
                901
            ],
            [
                901,
                902
            ],
            [
                903,
                932
            ],
            [
                934,
                941
            ],
            [
                942,
                944
            ],
            [
                945,
                948
            ],
            [
                958,
                969
            ],
            [
                991,
                1052
            ],
            [
                1053,
                1056
            ],
            [
                1064,
                1072
            ],
            [
                1090,
                1109
            ],
            [
                1112,
                1151
            ],
            [
                1152,
                1159
            ],
            [
                1160,
                1168
            ],
            [
                1169,
                1181
            ],
            [
                1184,
                1246
            ],
            [
                1248,
                1269
            ],
            [
                1272,
                1318
            ],
            [
                1319,
                1321
            ],
            [
                1322,
                1329
            ],
            [
                1332,
                1392
            ],
            [
                1393,
                1408
            ],
            [
                1411,
                1418
            ],
            [
                1420,
                1424
            ],
            [
                1425,
                1445
            ],
            [
                1450,
                1515
            ],
            [
                1517,
                1548
            ],
            [
                1557,
                1581
            ],
            [
                1582,
                1583
            ],
            [
                1592,
                1598
            ],
            [
                1611,
                1620
            ],
            [
                1626,
                1645
            ],
            [
                1647,
                1649
            ],
            [
                1650,
                1680
            ],
            [
                1685,
                1704
            ],
            [
                1706,
                1725
            ],
            [
                1725,
                1735
            ],
            [
                1736,
                1780
            ],
            [
                1782,
                1785
            ],
            [
                1790,
                1805
            ],
            [
                1806,
                1819
            ]
        ],
        "row_chars": [
            [
                0,
                240
            ],
            [
                240,
                305
            ],
            [
                305,
                635
            ],
            [
                635,
                710
            ],
            [
                710,
                1392
            ],
            [
                1392,
                1782
            ],
            [
                1782,
                1820
            ]
        ]
    }
}