{
    "original": {
        "text": "I had not gone above two leagues and a half, before the man with his gun began to look at his priming.\nI had three several times loiter'd _terribly_ behind; half a mile at least every time; once, in deep conference with a drum-maker, who was making drums for the fairs of _Baucaira_ and _Tarascone_ --I did not understand the principles----\nThe second time, I cannot so properly say, I stopp'd----for meeting a couple of _Franciscans_ straitened more for time than myself, and not being able to get to the bottom of what I was about ----I had turn'd back with them----\nThe third, was an affair of trade with a gossip, for a hand-basket of _Provence_ figs for four sous; this would have been transacted at once; but for a case of conscience at the close of it; for when the figs were paid for, it turn'd out, that there were two dozen of eggs cover'd over with vine-leaves at the bottom of the basket--as I had no intention of buying eggs --I made no sort of claim of them--as for the space they had occupied--what signified it? I had figs enow for my money----\n--But it was my intention to have the basket--it was the gossip's intention to keep it, without which, she could do nothing with her eggs----and unless I had the basket, I could do as little with my figs, which were too ripe already, and most of 'em burst at the side: this brought on a short contention, which terminated in sundry proposals, what we should both do----\n----How we disposed of our eggs and figs, I defy you, or the Devil himself, had he not been there (which I am persuaded he was), to form the least probable conjecture: You will read the whole of it------not this year, for I am hastening to the story of my uncle _Toby's_ amours--but you will read it in the collection of those which have arose out of the journey across this plain--and which, therefore, I call my\nPLAIN STORIES.\nHow far my pen has been fatigued, like those of other travellers, in this journey of it, over so barren a track--the world must judge--but the traces of it, which are now all set o' vibrating together this moment, tell me 'tis the most fruitful and busy period of my life; for as I had made no convention with my man with the gun, as to time--by stopping and talking to every soul I met, who was not in a full trot--joining all parties before me--waiting for every soul behind--hailing all those who were coming through cross-roads--arresting all kinds of beggars, pilgrims, fiddlers, friars----not passing by a woman in a mulberry-tree without commending her legs, and tempting her into conversation with a pinch of snuff ------In short, by seizing every handle, of what size or shape soever, which chance held out to me in this journey --I turned my _plain_ into a _city_ --I was always in company, and with great variety too; and as my mule loved society as much as myself, and had some proposals always on his part to offer to every beast he met --I am confident we could have passed through _Pall-Mall_, or St. _James's_-Street for a month together, with fewer adventures--and seen less of human nature.\nO! there is that sprightly frankness, which at once unpins every plait of a _Languedocian's_ dress--that whatever is beneath it, it looks so like the simplicity which poets sing of in better days --I will delude my fancy, and believe it is so.\n'Twas in the road betwixt _Nismes_ and _Lunel_, where there is the best _Muscatto_ wine in all _France_, and which by the bye belongs to the honest canons of MONTPELLIER--and foul befal the man who has drank it at their table, who grudges them a drop of it.\n----The sun was set--they had done their work; the nymphs had tied up their hair afresh--and the swains were preparing for a carousal----my mule made a dead point----'Tis the fife and tabourin, said I ----I'm frighten'd to death, quoth he ----They are running at the ring of pleasure, said I, giving him a prick ----By saint _Boogar_, and all the saints at the backside of the door of purgatory, said he--(making the same resolution with the abbesse of _Andoillets_) I'll not go a step further------'Tis very well, sir, said I ----I never will argue a point with one of your family, as long as I live; so leaping off his back, and kicking off one boot into this ditch, and t'other into that --I'll take a dance, said I--so stay you here.\nA sun-burnt daughter of Labour rose up from the groupe to meet me, as I advanced towards them; her hair, which was a dark chesnut approaching rather to a black, was tied up in a knot, all but a single tress.\nWe want a cavalier, said she, holding out both her hands, as if to offer them --And a cavalier ye shall have; said I, taking hold of both of them.\nHadst thou, _Nannette_, been array'd like a dutchesse!\n----But that cursed slit in thy petticoat!\n_Nannette_ cared not for it.\nWe could not have done without you, said she, letting go one hand, with self-taught politeness, leading me up with the other.\nA lame youth, whom _Apollo_ had recompensed with a pipe, and to which he had added a tabourin of his own accord, ran sweetly over the prelude, as he sat upon the bank ----Tie me up this tress instantly, said _Nannette_, putting a piece of string into my hand --It taught me to forget I was a stranger ----The whole knot fell down ----We had been seven years acquainted.\nThe youth struck the note upon the tabourin--his pipe followed, and off we bounded---- \"the duce take that slit!\"\nThe sister of the youth, who had stolen her voice from heaven, sung alternately with her brother----'twas a _Gascoigne_ roundelay.\nVIVA LA JOIA! FIDON LA TRISTESSA!\nThe nymphs join'd in unison, and their swains an octave below them----\nI would have given a crown to have it sew'd up--_Nannette_ would not have given a SOUS--_Viva la joia!_ was in her lips--_Viva la joia!_ was in her eyes. A transient spark of amity shot across the space betwixt us ----She look'd amiable! ----Why could I not live, and end my days thus? Just Disposer of our joys and sorrows, cried I, why could not a man sit down in the lap of content here----and dance, and sing, and say his prayers, and go to heaven with this nut-brown maid? Capriciously did she bend her head on one side, and dance up insidious ----Then 'tis time to dance off, quoth I; so changing only partners and tunes, I danced it away from _Lunel_ to _Montpellier_----from thence to _Pesnas_, _Beziers_ ----I danced it along through _Narbonne_, _Carcasson_, and _Castle Naudairy_, till at last I danced myself into _Perdrillo's_ pavillion, where pulling out a paper of black lines, that I might go on straight forwards, without digression or parenthesis, in my uncle _Toby's_ amours----\nI begun thus----",
        "paragraph_chars": [
            [
                0,
                103
            ],
            [
                103,
                341
            ],
            [
                341,
                569
            ],
            [
                569,
                1061
            ],
            [
                1061,
                1431
            ],
            [
                1431,
                1845
            ],
            [
                1845,
                1860
            ],
            [
                1860,
                3069
            ],
            [
                3069,
                3313
            ],
            [
                3313,
                3571
            ],
            [
                3571,
                4309
            ],
            [
                4309,
                4517
            ],
            [
                4517,
                4664
            ],
            [
                4664,
                4719
            ],
            [
                4719,
                4762
            ],
            [
                4762,
                4791
            ],
            [
                4791,
                4917
            ],
            [
                4917,
                5287
            ],
            [
                5287,
                5401
            ],
            [
                5401,
                5532
            ],
            [
                5532,
                5566
            ],
            [
                5566,
                5637
            ],
            [
                5637,
                6634
            ],
            [
                6634,
                6650
            ]
        ],
        "segment_chars": [
            [
                0,
                103
            ],
            [
                103,
                341
            ],
            [
                341,
                569
            ],
            [
                569,
                1028
            ],
            [
                1028,
                1061
            ],
            [
                1061,
                1431
            ],
            [
                1431,
                1845
            ],
            [
                1845,
                1860
            ],
            [
                1860,
                3069
            ],
            [
                3069,
                3072
            ],
            [
                3072,
                3313
            ],
            [
                3313,
                3571
            ],
            [
                3571,
                4309
            ],
            [
                4309,
                4517
            ],
            [
                4517,
                4664
            ],
            [
                4664,
                4719
            ],
            [
                4719,
                4762
            ],
            [
                4762,
                4791
            ],
            [
                4791,
                4917
            ],
            [
                4917,
                5287
            ],
            [
                5287,
                5401
            ],
            [
                5401,
                5532
            ],
            [
                5532,
                5546
            ],
            [
                5546,
                5566
            ],
            [
                5566,
                5637
            ],
            [
                5637,
                5791
            ],
            [
                5791,
                5875
            ],
            [
                5875,
                5923
            ],
            [
                5923,
                6115
            ],
            [
                6115,
                6634
            ],
            [
                6634,
                6650
            ]
        ],
        "overlap_chars": [
            [
                0,
                103
            ],
            [
                103,
                114
            ],
            [
                123,
                131
            ],
            [
                149,
                155
            ],
            [
                232,
                233
            ],
            [
                157,
                195
            ],
            [
                220,
                232
            ],
            [
                301,
                321
            ],
            [
                341,
                359
            ],
            [
                409,
                420
            ],
            [
                427,
                433
            ],
            [
                446,
                450
            ],
            [
                455,
                532
            ],
            [
                537,
                542
            ],
            [
                550,
                564
            ],
            [
                569,
                578
            ],
            [
                580,
                583
            ],
            [
                597,
                617
            ],
            [
                622,
                623
            ],
            [
                594,
                596
            ],
            [
                640,
                648
            ],
            [
                650,
                669
            ],
            [
                711,
                714
            ],
            [
                764,
                795
            ],
            [
                803,
                806
            ],
            [
                808,
                833
            ],
            [
                837,
                841
            ],
            [
                855,
                899
            ],
            [
                904,
                937
            ],
            [
                628,
                629
            ],
            [
                1063,
                1066
            ],
            [
                1213,
                1214
            ],
            [
                1095,
                1105
            ],
            [
                1202,
                1205
            ],
            [
                1114,
                1124
            ],
            [
                1137,
                1148
            ],
            [
                1164,
                1198
            ],
            [
                1149,
                1156
            ],
            [
                1067,
                1069
            ],
            [
                1231,
                1241
            ],
            [
                1252,
                1353
            ],
            [
                1364,
                1371
            ],
            [
                1383,
                1385
            ],
            [
                1393,
                1402
            ],
            [
                1404,
                1426
            ],
            [
                1435,
                1483
            ],
            [
                1560,
                1562
            ],
            [
                1599,
                1628
            ],
            [
                1634,
                1692
            ],
            [
                1698,
                1700
            ],
            [
                1702,
                1708
            ],
            [
                1710,
                1751
            ],
            [
                1530,
                1535
            ],
            [
                1769,
                1811
            ],
            [
                1813,
                1845
            ],
            [
                1845,
                1860
            ],
            [
                1860,
                1863
            ],
            [
                1884,
                1892
            ],
            [
                1868,
                1883
            ],
            [
                1926,
                1941
            ],
            [
                1949,
                1971
            ],
            [
                1892,
                1893
            ],
            [
                1973,
                1993
            ],
            [
                2385,
                2386
            ],
            [
                1995,
                2026
            ],
            [
                2031,
                2034
            ],
            [
                2042,
                2153
            ],
            [
                2165,
                2201
            ],
            [
                2961,
                2962
            ],
            [
                2203,
                2246
            ],
            [
                2276,
                2305
            ],
            [
                2315,
                2318
            ],
            [
                2330,
                2336
            ],
            [
                2403,
                2415
            ],
            [
                2425,
                2443
            ],
            [
                2761,
                2764
            ],
            [
                2445,
                2451
            ],
            [
                2455,
                2466
            ],
            [
                2470,
                2582
            ],
            [
                2589,
                2622
            ],
            [
                2654,
                2697
            ],
            [
                1924,
                1925
            ],
            [
                2700,
                2711
            ],
            [
                2713,
                2718
            ],
            [
                2720,
                2726
            ],
            [
                2728,
                2732
            ],
            [
                2974,
                2975
            ],
            [
                2736,
                2760
            ],
            [
                2789,
                2859
            ],
            [
                2879,
                2909
            ],
            [
                2912,
                2955
            ],
            [
                2993,
                3004
            ],
            [
                3015,
                3036
            ],
            [
                3067,
                3069
            ],
            [
                3069,
                3072
            ],
            [
                3072,
                3105
            ],
            [
                3146,
                3155
            ],
            [
                3169,
                3173
            ],
            [
                3201,
                3206
            ],
            [
                3210,
                3264
            ],
            [
                3267,
                3313
            ],
            [
                3313,
                3338
            ],
            [
                3340,
                3346
            ],
            [
                3348,
                3351
            ],
            [
                3356,
                3358
            ],
            [
                3359,
                3384
            ],
            [
                3386,
                3394
            ],
            [
                3396,
                3403
            ],
            [
                3569,
                3571
            ],
            [
                3575,
                3590
            ],
            [
                3612,
                3616
            ],
            [
                3616,
                3651
            ],
            [
                3664,
                3667
            ],
            [
                3675,
                3704
            ],
            [
                3708,
                3715
            ],
            [
                3723,
                3727
            ],
            [
                4307,
                4309
            ],
            [
                3738,
                3754
            ],
            [
                4244,
                4245
            ],
            [
                3758,
                3761
            ],
            [
                3765,
                3771
            ],
            [
                3737,
                3738
            ],
            [
                3776,
                3779
            ],
            [
                3791,
                3799
            ],
            [
                3801,
                3809
            ],
            [
                4070,
                4071
            ],
            [
                3887,
                3895
            ],
            [
                3897,
                3903
            ],
            [
                3763,
                3764
            ],
            [
                4038,
                4064
            ],
            [
                4080,
                4089
            ],
            [
                3856,
                3863
            ],
            [
                4176,
                4213
            ],
            [
                4245,
                4246
            ],
            [
                4264,
                4282
            ],
            [
                4291,
                4307
            ],
            [
                4309,
                4356
            ],
            [
                4364,
                4374
            ],
            [
                4376,
                4389
            ],
            [
                4402,
                4407
            ],
            [
                4435,
                4438
            ],
            [
                4408,
                4412
            ],
            [
                4470,
                4492
            ],
            [
                4497,
                4500
            ],
            [
                4501,
                4517
            ],
            [
                4517,
                4535
            ],
            [
                4537,
                4558
            ],
            [
                4564,
                4573
            ],
            [
                4597,
                4625
            ],
            [
                4627,
                4641
            ],
            [
                4658,
                4664
            ],
            [
                4664,
                4674
            ],
            [
                4674,
                4675
            ],
            [
                4677,
                4685
            ],
            [
                4686,
                4692
            ],
            [
                4701,
                4709
            ],
            [
                4717,
                4718
            ],
            [
                4723,
                4762
            ],
            [
                4763,
                4771
            ],
            [
                4773,
                4790
            ],
            [
                4832,
                4835
            ],
            [
                4895,
                4900
            ],
            [
                4906,
                4909
            ],
            [
                4852,
                4856
            ],
            [
                4915,
                4917
            ],
            [
                4917,
                4929
            ],
            [
                4961,
                4972
            ],
            [
                4974,
                4977
            ],
            [
                5000,
                5001
            ],
            [
                5005,
                5008
            ],
            [
                5030,
                5083
            ],
            [
                5092,
                5108
            ],
            [
                5011,
                5013
            ],
            [
                5120,
                5124
            ],
            [
                5126,
                5134
            ],
            [
                5135,
                5175
            ],
            [
                5201,
                5217
            ],
            [
                5222,
                5225
            ],
            [
                5232,
                5246
            ],
            [
                5251,
                5287
            ],
            [
                5287,
                5296
            ],
            [
                5351,
                5369
            ],
            [
                5415,
                5424
            ],
            [
                5405,
                5411
            ],
            [
                5501,
                5508
            ],
            [
                5510,
                5519
            ],
            [
                5521,
                5532
            ],
            [
                5532,
                5545
            ],
            [
                5546,
                5566
            ],
            [
                5566,
                5576
            ],
            [
                5584,
                5586
            ],
            [
                5593,
                5632
            ],
            [
                5726,
                5738
            ],
            [
                5741,
                5744
            ],
            [
                5690,
                5694
            ],
            [
                5752,
                5756
            ],
            [
                5778,
                5791
            ],
            [
                5791,
                5792
            ],
            [
                5803,
                5850
            ],
            [
                5879,
                5899
            ],
            [
                5901,
                5923
            ],
            [
                5971,
                6026
            ],
            [
                6030,
                6114
            ],
            [
                6196,
                6217
            ],
            [
                6219,
                6239
            ],
            [
                6245,
                6286
            ],
            [
                6291,
                6293
            ],
            [
                6295,
                6297
            ],
            [
                6299,
                6310
            ],
            [
                6315,
                6329
            ],
            [
                6341,
                6348
            ],
            [
                6372,
                6379
            ],
            [
                6381,
                6389
            ],
            [
                6163,
                6166
            ],
            [
                6397,
                6402
            ],
            [
                6426,
                6461
            ],
            [
                6463,
                6474
            ],
            [
                6476,
                6479
            ],
            [
                6485,
                6506
            ],
            [
                6507,
                6512
            ],
            [
                6161,
                6162
            ],
            [
                6529,
                6544
            ],
            [
                6548,
                6556
            ],
            [
                6150,
                6152
            ],
            [
                6565,
                6585
            ],
            [
                6217,
                6218
            ],
            [
                6605,
                6613
            ],
            [
                6619,
                6621
            ],
            [
                6623,
                6629
            ],
            [
                6634,
                6635
            ],
            [
                6642,
                6646
            ]
        ],
        "row_chars": [
            [
                0,
                103
            ],
            [
                103,
                341
            ],
            [
                341,
                569
            ],
            [
                569,
                1028
            ],
            [
                1028,
                1061
            ],
            [
                1061,
                1431
            ],
            [
                1431,
                1845
            ],
            [
                1845,
                1860
            ],
            [
                1860,
                3069
            ],
            [
                3069,
                3072
            ],
            [
                3072,
                3313
            ],
            [
                3313,
                3571
            ],
            [
                3571,
                4309
            ],
            [
                4309,
                4517
            ],
            [
                4517,
                4664
            ],
            [
                4664,
                4719
            ],
            [
                4719,
                4762
            ],
            [
                4762,
                4791
            ],
            [
                4791,
                4917
            ],
            [
                4917,
                5287
            ],
            [
                5287,
                5401
            ],
            [
                5401,
                5532
            ],
            [
                5532,
                5546
            ],
            [
                5546,
                5566
            ],
            [
                5566,
                5637
            ],
            [
                5637,
                5791
            ],
            [
                5791,
                5875
            ],
            [
                5875,
                5923
            ],
            [
                5923,
                6115
            ],
            [
                6115,
                6634
            ],
            [
                6634,
                6650
            ]
        ]
    },
    "abridged": {
        "text": "I had not gone above two leagues and a half, before the man with his gun began to look at his priming.\nI had three times loitered terribly behind, half a mile at least every time; once, talking to a drum-maker - I did not understand his craft-\nThe second time, I met a couple of Franciscans more short of time than myself, and not being able to get to the bottom of what I was about - I had turned back with them-\nThe third time was to trade with a gossip, a basket of Provence figs for four sous; but when the figs were paid for, it turned out that there were two dozen eggs covered with vine-leaves at the bottom of the basket. I had no intention of buying eggs-\nBut I wanted the basket - and the gossip wanted to keep it, or she could do nothing with her eggs - and without it I could do nothing with my figs, which were too ripe already, and most of 'em burst at the side: this brought on a short argument, which ended in different proposals about what we should both do.\n- How we disposed of our eggs and figs, I defy you to guess. You will read the whole of it - not this year, for I am hastening to the story of my uncle Toby's amours - but you will read it in the collection of stories which arose out of the journey across this plain - and which, therefore, I call my\nPLAIN STORIES.\nHow fatigued my pen has been in this journey over so barren a track, the world must judge - but the traces of it, which are all vibrating together this moment, tell me 'tis the most fruitful and busy period of my life; for as I had made no agreement with my man with the gun, as to time - by stopping and talking to every soul I met - joining all parties before me - waiting for everyone behind - hailing all kinds of pilgrims, fiddlers and friars - not passing a woman in a mulberry-tree without commending her legs, and tempting her into conversation with a pinch of snuff-\nIn short, by seizing every handle which chance held out to me in this journey, I turned my plain into a city. - I was always in company, and as my mule loved society as much as myself, and had some proposals to offer to every beast he met - I am confident we could have passed through London for a month with fewer adventures.\nO! there is that sprightly frankness in the Languedocians that looks like the simplicity which poets sing of in better days. - I will delude my fancy, and believe it is so.\n'Twas in the road betwixt Nismes and Lunel, where there is the best Muscatto wine in France.\nThe sun was set - work was finished; the nymphs had tied up their hair - the men were preparing for a carousal - my mule stopped dead.\n''Tis the fife and tambourine,' said I.\n'I'm frightened to death,' quoth he. 'By saint Boogar, I'll not go a step further.'\n'Very well, sir,' said I, leaping off his back, and kicking off my boots. 'I'll take a dance, - so stay you here.'\nA sun-burnt daughter of Labour rose up from the group to meet me as I advanced; her chestnut hair was tied up in a knot, but for a single tress.\n'We want a cavalier,' said she, holding out her hands.\n'And a cavalier ye shall have,' said I, taking them.\nHadst thou only, Nannette, been dressed like a duchess! - But that cursed slit in thy petticoat!\nNannette cared not for it. She led me up by the hand.\nA lame youth with a pipe and a tambourine ran sweetly over the prelude, as he sat upon the bank.\n'Tie me up this tress of hair,' said Nannette, putting a piece of string into my hand . - I forgot I was a stranger. - The knot fell down - we had been seven years acquainted.\nThe youth played - and off we bounded.\nThe youth's sister sang like an angel - 'twas a Gascoigne roundelay.\nVIVA LA JOIA!\nFIDON LA TRISTESSA!\nThe nymphs joined in, and their swains an octave below them.\n'Viva la joia!' was on Nanette's lips - and in her eyes. A spark of amity shot across the space betwixt us.\nWhy could I not live and end my days thus? why could not a man sit down in the lap of content here - and dance, and sing, and say his prayers, and go to heaven with this nut-brown maid?\n''Tis time to dance off,' quoth I; so changing partners and tunes, I danced it away from Lunel to Montpellier - from thence to Beziers - through Narbonne and Carcasson, till at last I danced myself into Perdrillo's pavilion, where pulling out a lined paper, so that I might go straight on, without digression, to my uncle Toby's amours-\nI began thus-",
        "paragraph_chars": [
            [
                0,
                103
            ],
            [
                103,
                244
            ],
            [
                244,
                414
            ],
            [
                414,
                665
            ],
            [
                665,
                976
            ],
            [
                976,
                1277
            ],
            [
                1277,
                1292
            ],
            [
                1292,
                1868
            ],
            [
                1868,
                2195
            ],
            [
                2195,
                2368
            ],
            [
                2368,
                2461
            ],
            [
                2461,
                2596
            ],
            [
                2596,
                2636
            ],
            [
                2636,
                2720
            ],
            [
                2720,
                2835
            ],
            [
                2835,
                2980
            ],
            [
                2980,
                3035
            ],
            [
                3035,
                3088
            ],
            [
                3088,
                3185
            ],
            [
                3185,
                3239
            ],
            [
                3239,
                3336
            ],
            [
                3336,
                3512
            ],
            [
                3512,
                3551
            ],
            [
                3551,
                3620
            ],
            [
                3620,
                3634
            ],
            [
                3634,
                3654
            ],
            [
                3654,
                3715
            ],
            [
                3715,
                3823
            ],
            [
                3823,
                4009
            ],
            [
                4009,
                4346
            ],
            [
                4346,
                4359
            ]
        ],
        "segment_chars": [
            [
                0,
                103
            ],
            [
                103,
                244
            ],
            [
                244,
                414
            ],
            [
                414,
                630
            ],
            [
                630,
                665
            ],
            [
                665,
                976
            ],
            [
                976,
                1037
            ],
            [
                1037,
                1277
            ],
            [
                1277,
                1292
            ],
            [
                1292,
                1868
            ],
            [
                1868,
                1978
            ],
            [
                1978,
                2195
            ],
            [
                2195,
                2198
            ],
            [
                2198,
                2320
            ],
            [
                2320,
                2368
            ],
            [
                2368,
                2461
            ],
            [
                2461,
                2596
            ],
            [
                2596,
                2636
            ],
            [
                2636,
                2673
            ],
            [
                2673,
                2720
            ],
            [
                2720,
                2794
            ],
            [
                2794,
                2835
            ],
            [
                2835,
                2980
            ],
            [
                2980,
                3035
            ],
            [
                3035,
                3088
            ],
            [
                3088,
                3144
            ],
            [
                3144,
                3185
            ],
            [
                3185,
                3212
            ],
            [
                3212,
                3239
            ],
            [
                3239,
                3336
            ],
            [
                3336,
                3424
            ],
            [
                3424,
                3453
            ],
            [
                3453,
                3512
            ],
            [
                3512,
                3551
            ],
            [
                3551,
                3620
            ],
            [
                3620,
                3634
            ],
            [
                3634,
                3654
            ],
            [
                3654,
                3715
            ],
            [
                3715,
                3731
            ],
            [
                3731,
                3772
            ],
            [
                3772,
                3823
            ],
            [
                3823,
                3866
            ],
            [
                3866,
                4009
            ],
            [
                4009,
                4346
            ],
            [
                4346,
                4359
            ]
        ],
        "overlap_chars": [
            [
                0,
                103
            ],
            [
                103,
                114
            ],
            [
                115,
                123
            ],
            [
                139,
                145
            ],
            [
                145,
                146
            ],
            [
                147,
                185
            ],
            [
                197,
                209
            ],
            [
                212,
                232
            ],
            [
                244,
                262
            ],
            [
                267,
                278
            ],
            [
                284,
                290
            ],
            [
                291,
                295
            ],
            [
                305,
                382
            ],
            [
                385,
                390
            ],
            [
                398,
                412
            ],
            [
                414,
                423
            ],
            [
                429,
                432
            ],
            [
                436,
                456
            ],
            [
                457,
                458
            ],
            [
                466,
                468
            ],
            [
                469,
                477
            ],
            [
                478,
                497
            ],
            [
                498,
                501
            ],
            [
                502,
                533
            ],
            [
                541,
                544
            ],
            [
                545,
                570
            ],
            [
                571,
                575
            ],
            [
                584,
                628
            ],
            [
                630,
                663
            ],
            [
                663,
                664
            ],
            [
                665,
                668
            ],
            [
                669,
                670
            ],
            [
                678,
                688
            ],
            [
                691,
                694
            ],
            [
                695,
                705
            ],
            [
                713,
                724
            ],
            [
                728,
                762
            ],
            [
                769,
                776
            ],
            [
                777,
                779
            ],
            [
                780,
                790
            ],
            [
                799,
                900
            ],
            [
                909,
                916
            ],
            [
                923,
                925
            ],
            [
                936,
                945
            ],
            [
                952,
                974
            ],
            [
                978,
                1026
            ],
            [
                1027,
                1029
            ],
            [
                1037,
                1066
            ],
            [
                1069,
                1127
            ],
            [
                1132,
                1134
            ],
            [
                1135,
                1141
            ],
            [
                1144,
                1185
            ],
            [
                1194,
                1199
            ],
            [
                1200,
                1242
            ],
            [
                1245,
                1277
            ],
            [
                1277,
                1292
            ],
            [
                1292,
                1295
            ],
            [
                1296,
                1304
            ],
            [
                1305,
                1320
            ],
            [
                1321,
                1336
            ],
            [
                1337,
                1359
            ],
            [
                1359,
                1360
            ],
            [
                1361,
                1381
            ],
            [
                1382,
                1383
            ],
            [
                1384,
                1415
            ],
            [
                1416,
                1419
            ],
            [
                1420,
                1531
            ],
            [
                1542,
                1578
            ],
            [
                1579,
                1580
            ],
            [
                1581,
                1624
            ],
            [
                1627,
                1656
            ],
            [
                1667,
                1670
            ],
            [
                1680,
                1686
            ],
            [
                1697,
                1709
            ],
            [
                1710,
                1728
            ],
            [
                1729,
                1732
            ],
            [
                1733,
                1739
            ],
            [
                1742,
                1753
            ],
            [
                1754,
                1866
            ],
            [
                1868,
                1901
            ],
            [
                1902,
                1945
            ],
            [
                1945,
                1946
            ],
            [
                1947,
                1958
            ],
            [
                1959,
                1964
            ],
            [
                1965,
                1971
            ],
            [
                1972,
                1976
            ],
            [
                1976,
                1977
            ],
            [
                1980,
                2004
            ],
            [
                2005,
                2075
            ],
            [
                2076,
                2106
            ],
            [
                2109,
                2152
            ],
            [
                2160,
                2171
            ],
            [
                2172,
                2193
            ],
            [
                2193,
                2195
            ],
            [
                2195,
                2198
            ],
            [
                2198,
                2231
            ],
            [
                2239,
                2248
            ],
            [
                2253,
                2257
            ],
            [
                2258,
                2263
            ],
            [
                2264,
                2318
            ],
            [
                2322,
                2368
            ],
            [
                2368,
                2393
            ],
            [
                2394,
                2400
            ],
            [
                2401,
                2404
            ],
            [
                2408,
                2410
            ],
            [
                2410,
                2435
            ],
            [
                2436,
                2444
            ],
            [
                2445,
                2452
            ],
            [
                2459,
                2461
            ],
            [
                2461,
                2476
            ],
            [
                2479,
                2483
            ],
            [
                2496,
                2531
            ],
            [
                2534,
                2537
            ],
            [
                2542,
                2571
            ],
            [
                2574,
                2581
            ],
            [
                2590,
                2594
            ],
            [
                2594,
                2596
            ],
            [
                2598,
                2614
            ],
            [
                2615,
                2616
            ],
            [
                2619,
                2622
            ],
            [
                2628,
                2634
            ],
            [
                2636,
                2637
            ],
            [
                2637,
                2640
            ],
            [
                2652,
                2660
            ],
            [
                2663,
                2671
            ],
            [
                2673,
                2674
            ],
            [
                2674,
                2682
            ],
            [
                2683,
                2689
            ],
            [
                2689,
                2690
            ],
            [
                2691,
                2717
            ],
            [
                2726,
                2735
            ],
            [
                2738,
                2745
            ],
            [
                2746,
                2783
            ],
            [
                2794,
                2795
            ],
            [
                2795,
                2813
            ],
            [
                2816,
                2832
            ],
            [
                2835,
                2882
            ],
            [
                2889,
                2899
            ],
            [
                2900,
                2913
            ],
            [
                2913,
                2918
            ],
            [
                2924,
                2927
            ],
            [
                2928,
                2932
            ],
            [
                2933,
                2955
            ],
            [
                2956,
                2959
            ],
            [
                2964,
                2980
            ],
            [
                2981,
                2999
            ],
            [
                3002,
                3023
            ],
            [
                3024,
                3033
            ],
            [
                3036,
                3064
            ],
            [
                3067,
                3081
            ],
            [
                3082,
                3088
            ],
            [
                3088,
                3098
            ],
            [
                3103,
                3104
            ],
            [
                3105,
                3113
            ],
            [
                3113,
                3119
            ],
            [
                3128,
                3136
            ],
            [
                3142,
                3143
            ],
            [
                3146,
                3185
            ],
            [
                3185,
                3193
            ],
            [
                3194,
                3211
            ],
            [
                3212,
                3215
            ],
            [
                3220,
                3225
            ],
            [
                3229,
                3232
            ],
            [
                3233,
                3237
            ],
            [
                3237,
                3239
            ],
            [
                3239,
                3251
            ],
            [
                3252,
                3263
            ],
            [
                3264,
                3267
            ],
            [
                3268,
                3269
            ],
            [
                3274,
                3277
            ],
            [
                3281,
                3334
            ],
            [
                3341,
                3357
            ],
            [
                3358,
                3360
            ],
            [
                3368,
                3372
            ],
            [
                3373,
                3381
            ],
            [
                3381,
                3421
            ],
            [
                3435,
                3451
            ],
            [
                3455,
                3458
            ],
            [
                3459,
                3473
            ],
            [
                3476,
                3512
            ],
            [
                3512,
                3521
            ],
            [
                3531,
                3549
            ],
            [
                3551,
                3560
            ],
            [
                3563,
                3569
            ],
            [
                3591,
                3598
            ],
            [
                3599,
                3608
            ],
            [
                3609,
                3620
            ],
            [
                3620,
                3633
            ],
            [
                3634,
                3654
            ],
            [
                3654,
                3664
            ],
            [
                3672,
                3674
            ],
            [
                3674,
                3713
            ],
            [
                3716,
                3728
            ],
            [
                3731,
                3734
            ],
            [
                3741,
                3745
            ],
            [
                3748,
                3752
            ],
            [
                3759,
                3772
            ],
            [
                3772,
                3773
            ],
            [
                3774,
                3821
            ],
            [
                3823,
                3843
            ],
            [
                3844,
                3866
            ],
            [
                3866,
                3921
            ],
            [
                3924,
                4008
            ],
            [
                4011,
                4032
            ],
            [
                4035,
                4055
            ],
            [
                4056,
                4097
            ],
            [
                4101,
                4103
            ],
            [
                4104,
                4106
            ],
            [
                4107,
                4118
            ],
            [
                4121,
                4135
            ],
            [
                4136,
                4143
            ],
            [
                4146,
                4153
            ],
            [
                4154,
                4162
            ],
            [
                4163,
                4166
            ],
            [
                4171,
                4176
            ],
            [
                4176,
                4211
            ],
            [
                4212,
                4223
            ],
            [
                4224,
                4227
            ],
            [
                4232,
                4253
            ],
            [
                4260,
                4265
            ],
            [
                4265,
                4266
            ],
            [
                4270,
                4285
            ],
            [
                4286,
                4294
            ],
            [
                4295,
                4297
            ],
            [
                4297,
                4317
            ],
            [
                4317,
                4318
            ],
            [
                4322,
                4330
            ],
            [
                4335,
                4337
            ],
            [
                4338,
                4344
            ],
            [
                4346,
                4347
            ],
            [
                4354,
                4358
            ]
        ],
        "row_chars": [
            [
                0,
                103
            ],
            [
                103,
                244
            ],
            [
                244,
                414
            ],
            [
                414,
                665
            ],
            [
                665,
                665
            ],
            [
                665,
                976
            ],
            [
                976,
                1277
            ],
            [
                1277,
                1292
            ],
            [
                1292,
                2195
            ],
            [
                2195,
                2198
            ],
            [
                2198,
                2368
            ],
            [
                2368,
                2461
            ],
            [
                2461,
                2835
            ],
            [
                2835,
                2980
            ],
            [
                2980,
                3088
            ],
            [
                3088,
                3144
            ],
            [
                3144,
                3185
            ],
            [
                3185,
                3212
            ],
            [
                3212,
                3239
            ],
            [
                3239,
                3512
            ],
            [
                3512,
                3551
            ],
            [
                3551,
                3620
            ],
            [
                3620,
                3634
            ],
            [
                3634,
                3654
            ],
            [
                3654,
                3715
            ],
            [
                3715,
                3772
            ],
            [
                3772,
                3823
            ],
            [
                3823,
                3866
            ],
            [
                3866,
                4009
            ],
            [
                4009,
                4346
            ],
            [
                4346,
                4359
            ]
        ]
    }
}