{
    "original": {
        "text": "I do not speak it with regard to the coarseness or cleanness of them--or the strength of their gussets----but pray do not night-shifts differ from day-shifts as much in this particular, as in anything else in the world; That they so far exceed the others in length, that when you are laid down in them, they fall almost as much below the feet, as the day-shifts fall short of them?\nWidow _Wadman's_ night-shifts (as was the mode I suppose in King _William's_ and Queen _Anne's_ reigns) were cut however after this fashion; and if the fashion is changed (for in _Italy_ they are come to nothing)----so much the worse for the public; they were two _Flemish_ ells and a half in length; so that allowing a moderate woman two ells, she had half an ell to spare, to do what she would with.\nNow from one little indulgence gained after another, in the many bleak and decemberly nights of a seven years widowhood, things had insensibly come to this pass, and for the two last years had got establish'd into one of the ordinances of the bed-chamber --That as soon as Mrs. _Wadman_ was put to bed, and had got her legs stretched down to the bottom of it, of which she always gave _Bridget_ notice--_Bridget_, with all suitable decorum, having first open'd the bed-cloaths at the feet, took hold of the half-ell of cloth we are speaking of, and having gently, and with both her hands, drawn it downwards to its furthest extension, and then contracted it again side-long by four or five even plaits, she took a large corking pin out of her sleeve, and with the point directed towards her, pinn'd the plaits all fast together a little above the hem; which done, she tuck'd all in tight at the feet, and wish'd her mistress a good night.\nThis was constant, and without any other variation than this; that on shivering and tempestuous nights, when _Bridget_ untuck'd the feet of the bed, &c., to do this----she consulted no thermometer but that of her own passions; and so performed it standing--kneeling--or squatting, according to the different degrees of faith, hope, and charity, she was in, and bore towards her mistress that night. In every other respect, the _etiquette_ was sacred, and might have vied with the most mechanical one of the most inflexible bed-chamber in _Christendom_.\nThe first night, as soon as the corporal had conducted my uncle _Toby_ upstairs, which was about ten ----Mrs. _Wadman_ threw herself into her arm-chair, and crossing her left knee with her right, which formed a resting-place for her elbow, she reclin'd her cheek upon the palm of her hand, and leaning forwards ruminated till midnight upon both sides of the question.\nThe second night she went to her bureau, and having ordered _Bridget_ to bring her up a couple of fresh candles and leave them upon the table, she took out her marriage-settlement, and read it over with great devotion: and the third night (which was the last of my uncle _Toby's_ stay) when _Bridget_ had pull'd down the night-shift, and was assaying to stick in the corking pin----\n----With a kick of both heels at once, but at the same time the most natural kick that could be kick'd in her situation----for supposing * * * * * * * * * to be the sun in its meridian, it was a north-east kick----she kick'd the pin out of her fingers----the _etiquette_ which hung upon it, down----down it fell to the ground, and was shiver'd into a thousand atoms.\nFrom all which it was plain that widow _Wadman_ was in love with my uncle _Toby_.",
        "paragraph_chars": [
            [
                0,
                382
            ],
            [
                382,
                784
            ],
            [
                784,
                1723
            ],
            [
                1723,
                2276
            ],
            [
                2276,
                2644
            ],
            [
                2644,
                3027
            ],
            [
                3027,
                3394
            ],
            [
                3394,
                3475
            ]
        ],
        "segment_chars": [
            [
                0,
                382
            ],
            [
                382,
                784
            ],
            [
                784,
                1723
            ],
            [
                1723,
                2122
            ],
            [
                2122,
                2276
            ],
            [
                2276,
                2644
            ],
            [
                2644,
                3027
            ],
            [
                3027,
                3394
            ],
            [
                3394,
                3475
            ]
        ],
        "overlap_chars": [
            [
                184,
                185
            ],
            [
                115,
                128
            ],
            [
                135,
                151
            ],
            [
                166,
                173
            ],
            [
                218,
                229
            ],
            [
                230,
                232
            ],
            [
                161,
                165
            ],
            [
                264,
                322
            ],
            [
                233,
                236
            ],
            [
                328,
                346
            ],
            [
                351,
                355
            ],
            [
                362,
                382
            ],
            [
                382,
                387
            ],
            [
                389,
                397
            ],
            [
                399,
                405
            ],
            [
                412,
                441
            ],
            [
                463,
                468
            ],
            [
                455,
                457
            ],
            [
                478,
                483
            ],
            [
                484,
                494
            ],
            [
                558,
                560
            ],
            [
                509,
                521
            ],
            [
                630,
                645
            ],
            [
                656,
                784
            ],
            [
                784,
                787
            ],
            [
                837,
                904
            ],
            [
                935,
                939
            ],
            [
                912,
                915
            ],
            [
                977,
                980
            ],
            [
                1362,
                1365
            ],
            [
                1027,
                1038
            ],
            [
                1452,
                1453
            ],
            [
                1041,
                1061
            ],
            [
                1063,
                1069
            ],
            [
                1071,
                1094
            ],
            [
                1108,
                1117
            ],
            [
                1099,
                1107
            ],
            [
                1118,
                1143
            ],
            [
                1196,
                1202
            ],
            [
                1207,
                1237
            ],
            [
                1245,
                1255
            ],
            [
                1261,
                1290
            ],
            [
                1291,
                1308
            ],
            [
                835,
                836
            ],
            [
                1379,
                1381
            ],
            [
                1327,
                1328
            ],
            [
                1439,
                1441
            ],
            [
                1346,
                1347
            ],
            [
                1621,
                1634
            ],
            [
                1371,
                1372
            ],
            [
                1659,
                1671
            ],
            [
                944,
                949
            ],
            [
                1696,
                1723
            ],
            [
                1833,
                1840
            ],
            [
                1723,
                1727
            ],
            [
                2125,
                2130
            ],
            [
                2115,
                2120
            ],
            [
                1783,
                1784
            ],
            [
                1851,
                1854
            ],
            [
                2162,
                2172
            ],
            [
                2120,
                2121
            ],
            [
                2276,
                2339
            ],
            [
                2347,
                2356
            ],
            [
                2367,
                2376
            ],
            [
                2470,
                2471
            ],
            [
                2381,
                2385
            ],
            [
                2387,
                2393
            ],
            [
                2395,
                2432
            ],
            [
                2520,
                2524
            ],
            [
                2529,
                2543
            ],
            [
                2556,
                2565
            ],
            [
                2516,
                2519
            ],
            [
                2587,
                2610
            ],
            [
                2642,
                2644
            ],
            [
                2644,
                2684
            ],
            [
                2791,
                2914
            ],
            [
                2714,
                2716
            ],
            [
                2920,
                2922
            ],
            [
                2924,
                2934
            ],
            [
                2945,
                2948
            ],
            [
                2956,
                2985
            ],
            [
                2995,
                3010
            ],
            [
                3019,
                3022
            ],
            [
                3227,
                3228
            ],
            [
                3031,
                3056
            ],
            [
                3241,
                3244
            ],
            [
                3252,
                3278
            ],
            [
                3073,
                3076
            ],
            [
                3334,
                3364
            ],
            [
                3371,
                3394
            ],
            [
                3394,
                3398
            ],
            [
                3403,
                3432
            ],
            [
                3434,
                3440
            ],
            [
                3442,
                3467
            ]
        ],
        "row_chars": [
            [
                0,
                382
            ],
            [
                382,
                784
            ],
            [
                784,
                1723
            ],
            [
                1723,
                2276
            ],
            [
                2276,
                2644
            ],
            [
                2644,
                3027
            ],
            [
                3027,
                3394
            ],
            [
                3394,
                3475
            ]
        ]
    },
    "abridged": {
        "text": "Pray, do not night-shirts differ from day-shirts in this way; that they are so much longer, that when you are laid down in them, they fall almost as far below the feet, as day-shirts fall short of them?\nWidow Wadman's night-shirts (as was the mode I suppose in Queen Anne's reign) were cut in this fashion; they were two ells and a half in length; so that allowing a moderate woman two ells, she had half an ell to spare, to do what she would with.\nNow in the many bleak and decemberly nights of a seven years widowhood, this habit had gradually got established in her bed-chamber. - That as soon as Mrs. Wadman was put to bed, and had stretched her legs down to the bottom of it, Bridget, with suitable decorum, having first opened the bed-clothes at the feet, took hold of the spare half-ell of cloth, drew it down, twisted it, pinned it above the hem, tucked all in tight, and wished her mistress a good night.\nBridget did this every night; the etiquette was sacred.\nThe first night, as soon as the corporal had conducted my uncle Toby upstairs, at about ten, Mrs. Wadman threw herself into her arm-chair, and reclining her cheek upon her hand, she ruminated till midnight.\nThe second night she went to her bureau, took out her marriage-settlement, and read it over with great devotion: and the third night (which was the last of my uncle Toby's stay) when Bridget had pulled down the night-shift, and was trying to stick in the pin-\n- With a kick of both heels she kicked the pin out of her fingers - the etiquette fell to the ground, and was shivered into a thousand atoms.\nFrom which it was plain that widow Wadman was in love with my uncle Toby.",
        "paragraph_chars": [
            [
                0,
                203
            ],
            [
                203,
                449
            ],
            [
                449,
                914
            ],
            [
                914,
                970
            ],
            [
                970,
                1177
            ],
            [
                1177,
                1437
            ],
            [
                1437,
                1579
            ],
            [
                1579,
                1652
            ]
        ],
        "segment_chars": [
            [
                0,
                203
            ],
            [
                203,
                449
            ],
            [
                449,
                582
            ],
            [
                582,
                914
            ],
            [
                914,
                970
            ],
            [
                970,
                1177
            ],
            [
                1177,
                1437
            ],
            [
                1437,
                1579
            ],
            [
                1579,
                1652
            ]
        ],
        "overlap_chars": [
            [
                4,
                5
            ],
            [
                6,
                19
            ],
            [
                26,
                42
            ],
            [
                49,
                56
            ],
            [
                60,
                71
            ],
            [
                76,
                78
            ],
            [
                79,
                83
            ],
            [
                90,
                148
            ],
            [
                149,
                152
            ],
            [
                153,
                171
            ],
            [
                172,
                176
            ],
            [
                183,
                203
            ],
            [
                203,
                208
            ],
            [
                209,
                217
            ],
            [
                218,
                224
            ],
            [
                231,
                260
            ],
            [
                261,
                266
            ],
            [
                271,
                273
            ],
            [
                274,
                279
            ],
            [
                279,
                289
            ],
            [
                290,
                292
            ],
            [
                293,
                305
            ],
            [
                305,
                320
            ],
            [
                321,
                449
            ],
            [
                449,
                452
            ],
            [
                453,
                520
            ],
            [
                521,
                525
            ],
            [
                532,
                535
            ],
            [
                546,
                549
            ],
            [
                565,
                568
            ],
            [
                569,
                580
            ],
            [
                582,
                583
            ],
            [
                584,
                604
            ],
            [
                605,
                611
            ],
            [
                612,
                635
            ],
            [
                636,
                645
            ],
            [
                646,
                654
            ],
            [
                655,
                680
            ],
            [
                688,
                694
            ],
            [
                695,
                725
            ],
            [
                733,
                743
            ],
            [
                749,
                778
            ],
            [
                785,
                802
            ],
            [
                802,
                803
            ],
            [
                809,
                811
            ],
            [
                816,
                817
            ],
            [
                826,
                828
            ],
            [
                828,
                829
            ],
            [
                840,
                853
            ],
            [
                853,
                854
            ],
            [
                862,
                874
            ],
            [
                874,
                879
            ],
            [
                887,
                914
            ],
            [
                914,
                921
            ],
            [
                926,
                930
            ],
            [
                931,
                936
            ],
            [
                937,
                942
            ],
            [
                942,
                943
            ],
            [
                944,
                947
            ],
            [
                958,
                968
            ],
            [
                968,
                969
            ],
            [
                970,
                1033
            ],
            [
                1039,
                1048
            ],
            [
                1052,
                1061
            ],
            [
                1061,
                1062
            ],
            [
                1063,
                1067
            ],
            [
                1068,
                1074
            ],
            [
                1075,
                1112
            ],
            [
                1113,
                1117
            ],
            [
                1123,
                1137
            ],
            [
                1138,
                1147
            ],
            [
                1148,
                1151
            ],
            [
                1152,
                1175
            ],
            [
                1175,
                1177
            ],
            [
                1177,
                1217
            ],
            [
                1218,
                1341
            ],
            [
                1342,
                1344
            ],
            [
                1346,
                1348
            ],
            [
                1349,
                1359
            ],
            [
                1368,
                1371
            ],
            [
                1379,
                1408
            ],
            [
                1416,
                1431
            ],
            [
                1432,
                1435
            ],
            [
                1437,
                1438
            ],
            [
                1439,
                1464
            ],
            [
                1465,
                1468
            ],
            [
                1476,
                1502
            ],
            [
                1505,
                1508
            ],
            [
                1519,
                1549
            ],
            [
                1556,
                1579
            ],
            [
                1579,
                1583
            ],
            [
                1584,
                1613
            ],
            [
                1614,
                1620
            ],
            [
                1621,
                1646
            ]
        ],
        "row_chars": [
            [
                0,
                203
            ],
            [
                203,
                449
            ],
            [
                449,
                914
            ],
            [
                914,
                970
            ],
            [
                970,
                1177
            ],
            [
                1177,
                1437
            ],
            [
                1437,
                1579
            ],
            [
                1579,
                1652
            ]
        ]
    }
}