{
    "original": {
        "text": "The Fates, who certainly all foreknew of these amours of widow _Wadman_ and my uncle _Toby_, had, from the first creation of matter and motion (and with more courtesy than they usually do things of this kind), established such a chain of causes and effects hanging so fast to one another, that it was scarce possible for my uncle _Toby_ to have dwelt in any other house in the world, or to have occupied any other garden in _Christendom_, but the very house and garden which join'd and laid parallel to Mrs. _Wadman's_; this, with the advantage of a thickset arbour in Mrs. _Wadman's_ garden, but planted in the hedge-row of my uncle _Toby's_, put all the occasions into her hands which Love-militancy wanted; she could observe my uncle _Toby's_ motions, and was mistress likewise of his councils of war; and as his unsuspecting heart had given leave to the corporal, through the mediation of _Bridget_, to make her a wicker-gate of communication to enlarge her walks, it enabled her to carry on her approaches to the very door of the sentry-box; and sometimes out of gratitude, to make an attack, and endeavour to blow my uncle _Toby_ up in the very sentry-box itself.",
        "paragraph_chars": [
            [
                0,
                1169
            ]
        ],
        "segment_chars": [
            [
                0,
                1169
            ]
        ],
        "overlap_chars": [
            [
                0,
                24
            ],
            [
                29,
                33
            ],
            [
                41,
                62
            ],
            [
                64,
                70
            ],
            [
                72,
                84
            ],
            [
                273,
                275
            ],
            [
                91,
                131
            ],
            [
                642,
                643
            ],
            [
                210,
                256
            ],
            [
                287,
                329
            ],
            [
                1011,
                1013
            ],
            [
                337,
                420
            ],
            [
                437,
                474
            ],
            [
                500,
                507
            ],
            [
                509,
                517
            ],
            [
                520,
                573
            ],
            [
                575,
                583
            ],
            [
                585,
                633
            ],
            [
                639,
                641
            ],
            [
                1077,
                1078
            ],
            [
                671,
                674
            ],
            [
                648,
                665
            ],
            [
                687,
                708
            ],
            [
                710,
                736
            ],
            [
                742,
                744
            ],
            [
                753,
                758
            ],
            [
                784,
                811
            ],
            [
                835,
                838
            ],
            [
                839,
                875
            ],
            [
                902,
                911
            ],
            [
                916,
                917
            ],
            [
                918,
                929
            ],
            [
                947,
                986
            ],
            [
                1014,
                1077
            ],
            [
                1079,
                1101
            ],
            [
                1112,
                1128
            ],
            [
                1136,
                1169
            ]
        ],
        "row_chars": [
            [
                0,
                1169
            ]
        ]
    },
    "abridged": {
        "text": "The Fates, who certainly foresaw these amours of widow Wadman and my uncle Toby, had, from the first creation of matter, established such a chain of causes and effects, that it was scarce possible for my uncle Toby to have dwelt in any other house in the world, or to have occupied any other garden, but the very house and garden which lay next to Mrs. Wadman's.\nThis, with the advantage of a thickset arbour in Mrs. Wadman's garden, but planted in the hedge-row of my uncle Toby's, gave her all the occasions Love-militancy wanted. She could observe my uncle Toby's movements, and hear his councils of war; and as he had unsuspectingly given leave to the corporal, through Bridget, to make Widow Wadman a communicating wicker-gate to enlarge her walks, it enabled her to approach the very door of the sentry-box; and sometimes out of gratitude to make an attack, and try to blow my uncle Toby up in the very sentry-box itself.",
        "paragraph_chars": [
            [
                0,
                363
            ],
            [
                363,
                927
            ]
        ],
        "segment_chars": [
            [
                0,
                363
            ],
            [
                363,
                533
            ],
            [
                533,
                927
            ]
        ],
        "overlap_chars": [
            [
                0,
                24
            ],
            [
                25,
                29
            ],
            [
                33,
                54
            ],
            [
                55,
                61
            ],
            [
                62,
                74
            ],
            [
                75,
                77
            ],
            [
                79,
                119
            ],
            [
                119,
                120
            ],
            [
                121,
                167
            ],
            [
                167,
                209
            ],
            [
                210,
                212
            ],
            [
                215,
                298
            ],
            [
                298,
                335
            ],
            [
                345,
                352
            ],
            [
                353,
                361
            ],
            [
                363,
                416
            ],
            [
                417,
                425
            ],
            [
                426,
                474
            ],
            [
                479,
                481
            ],
            [
                481,
                482
            ],
            [
                488,
                491
            ],
            [
                492,
                509
            ],
            [
                510,
                531
            ],
            [
                533,
                559
            ],
            [
                564,
                566
            ],
            [
                576,
                581
            ],
            [
                587,
                614
            ],
            [
                618,
                621
            ],
            [
                637,
                673
            ],
            [
                681,
                690
            ],
            [
                704,
                705
            ],
            [
                720,
                731
            ],
            [
                732,
                771
            ],
            [
                781,
                844
            ],
            [
                845,
                867
            ],
            [
                872,
                888
            ],
            [
                894,
                927
            ]
        ],
        "row_chars": [
            [
                0,
                927
            ]
        ]
    }
}