{
    "original": {
        "text": "----And so to make sure of both systems, Mrs. _Wadman_ predetermined to light my uncle _Toby_ neither at this end or that; but, like a prodigal's candle, to light him, if possible, at both ends at once.\nNow, through all the lumber rooms of military furniture, including both of horse and foot, from the great arsenal of _Venice_ to the _Tower_ of _London_ (exclusive), if Mrs. _Wadman_ had been rummaging for seven years together, and with _Bridget_ to help her, she could not have found any one _blind_ or _mantelet_ so fit for her purpose, as that which the expediency of my uncle _Toby's_ affairs had fix'd up ready to her hands.\nI believe I have not told you----but I don't know----possibly I have----be it as it will, 'tis one of the number of those many things, which a man had better do over again, than dispute about it --That whatever town or fortress the corporal was at work upon, during the course of their campaign, my uncle _Toby_ always took care, on the inside of his sentry-box, which was towards his left hand, to have a plan of the place, fasten'd up with two or three pins at the top, but loose at the bottom, for the conveniency of holding it up to the eye, &c. . . . as occasions required; so that when an attack was resolved upon, Mrs. _Wadman_ had nothing more to do, when she had got advanced to the door of the sentry-box, but to extend her right hand; and edging in her left foot at the same movement, to take hold of the map or plan, or upright, or whatever it was, and with out-stretched neck meeting it half way, --to advance it towards her; on which my uncle _Toby's_ passions were sure to catch fire----for he would instantly take hold of the other corner of the map in his left hand, and with the end of his pipe in the other, begin an explanation.\nWhen the attack was advanced to this point; ----the world will naturally enter into the reasons of Mrs. _Wadman's_ next stroke of generalship----which was, to take my uncle _Toby's_ tobacco-pipe out of his hand as soon as she possibly could; which, under one pretence or other, but generally that of pointing more distinctly at some redoubt or breastwork in the map, she would effect before my uncle _Toby_ (poor soul!) had well march'd above half a dozen toises with it.\n--It obliged my uncle _Toby_ to make use of his forefinger.\nThe difference it made in the attack was this; That in going upon it, as in the first case, with the end of her forefinger against the end of my uncle _Toby's_ tobacco-pipe, she might have travelled with it, along the lines, from _Dan_ to _Beersheba_, had my uncle _Toby's_ lines reach'd so far, without any effect: For as there was no arterial or vital heat in the end of the tobacco-pipe, it could excite no sentiment----it could neither give fire by pulsation----or receive it by sympathy----'twas nothing but smoke.\nWhereas, in following my uncle _Toby's_ forefinger with hers, close thro' all the little turns and indentings of his works--pressing sometimes against the side of it----then treading upon its nail----then tripping it up----then touching it here----then there, and so on----it set something at least in motion.\nThis, tho' slight skirmishing, and at a distance from the main body, yet drew on the rest; for here, the map usually falling with the back of it, close to the side of the sentry-box, my uncle _Toby_, in the simplicity of his soul, would lay his hand flat upon it, in order to go on with his explanation; and Mrs. _Wadman_, by a manuvre as quick as thought, would as certainly place her's close beside it; this at once opened a communication, large enough for any sentiment to pass or repass, which a person skill'd in the elementary and practical part of love-making, has occasion for----\nBy bringing up her forefinger parallel (as before) to my uncle _Toby's_----it unavoidably brought the thumb into action----and the forefinger and thumb being once engaged, as naturally brought in the whole hand. Thine, dear uncle _Toby!_ was never now in its right place ----Mrs. _Wadman_ had it ever to take up, or, with the gentlest pushings, protrusions, and equivocal compressions, that a hand to be removed is capable of receiving----to get it press'd a hair breadth of one side out of her way.\nWhilst this was doing, how could she forget to make him sensible, that it was her leg (and no one's else) at the bottom of the sentry-box, which slightly press'd against the calf of his ----So that my uncle _Toby_ being thus attacked and sore push'd on both his wings----was it a wonder, if now and then, it put his centre into disorder?----\n----The duce take it! said my uncle _Toby_.",
        "paragraph_chars": [
            [
                0,
                203
            ],
            [
                203,
                633
            ],
            [
                633,
                1782
            ],
            [
                1782,
                2254
            ],
            [
                2254,
                2314
            ],
            [
                2314,
                2834
            ],
            [
                2834,
                3144
            ],
            [
                3144,
                3733
            ],
            [
                3733,
                4233
            ],
            [
                4233,
                4575
            ],
            [
                4575,
                4618
            ]
        ],
        "segment_chars": [
            [
                0,
                203
            ],
            [
                203,
                633
            ],
            [
                633,
                1189
            ],
            [
                1189,
                1782
            ],
            [
                1782,
                2202
            ],
            [
                2202,
                2254
            ],
            [
                2254,
                2314
            ],
            [
                2314,
                2834
            ],
            [
                2834,
                3144
            ],
            [
                3144,
                3733
            ],
            [
                3733,
                3945
            ],
            [
                3945,
                4233
            ],
            [
                4233,
                4575
            ],
            [
                4575,
                4597
            ],
            [
                4597,
                4618
            ]
        ],
        "overlap_chars": [
            [
                4,
                45
            ],
            [
                47,
                53
            ],
            [
                69,
                86
            ],
            [
                154,
                156
            ],
            [
                166,
                203
            ],
            [
                203,
                207
            ],
            [
                369,
                376
            ],
            [
                378,
                384
            ],
            [
                386,
                420
            ],
            [
                208,
                223
            ],
            [
                240,
                248
            ],
            [
                224,
                239
            ],
            [
                299,
                302
            ],
            [
                337,
                342
            ],
            [
                275,
                277
            ],
            [
                348,
                354
            ],
            [
                461,
                487
            ],
            [
                518,
                555
            ],
            [
                574,
                582
            ],
            [
                329,
                331
            ],
            [
                600,
                603
            ],
            [
                610,
                633
            ],
            [
                633,
                662
            ],
            [
                666,
                682
            ],
            [
                686,
                701
            ],
            [
                830,
                898
            ],
            [
                913,
                927
            ],
            [
                929,
                937
            ],
            [
                1029,
                1031
            ],
            [
                945,
                951
            ],
            [
                1037,
                1056
            ],
            [
                970,
                976
            ],
            [
                980,
                995
            ],
            [
                1058,
                1062
            ],
            [
                1067,
                1074
            ],
            [
                1088,
                1137
            ],
            [
                1150,
                1177
            ],
            [
                1181,
                1182
            ],
            [
                1212,
                1214
            ],
            [
                1390,
                1392
            ],
            [
                1225,
                1234
            ],
            [
                1252,
                1258
            ],
            [
                1260,
                1266
            ],
            [
                1268,
                1308
            ],
            [
                1318,
                1378
            ],
            [
                1429,
                1461
            ],
            [
                1379,
                1382
            ],
            [
                1545,
                1589
            ],
            [
                1595,
                1597
            ],
            [
                1599,
                1631
            ],
            [
                1506,
                1507
            ],
            [
                1635,
                1725
            ],
            [
                1737,
                1782
            ],
            [
                1830,
                1854
            ],
            [
                1866,
                1877
            ],
            [
                1881,
                1885
            ],
            [
                1887,
                1895
            ],
            [
                1897,
                1923
            ],
            [
                1927,
                1954
            ],
            [
                1811,
                1813
            ],
            [
                1960,
                1962
            ],
            [
                1964,
                2022
            ],
            [
                2029,
                2036
            ],
            [
                1787,
                1790
            ],
            [
                2041,
                2049
            ],
            [
                2079,
                2090
            ],
            [
                2107,
                2122
            ],
            [
                2137,
                2147
            ],
            [
                2256,
                2275
            ],
            [
                2283,
                2314
            ],
            [
                2314,
                2365
            ],
            [
                2422,
                2425
            ],
            [
                2430,
                2436
            ],
            [
                2445,
                2464
            ],
            [
                2550,
                2552
            ],
            [
                2764,
                2766
            ],
            [
                2470,
                2472
            ],
            [
                2474,
                2486
            ],
            [
                2498,
                2502
            ],
            [
                2622,
                2628
            ],
            [
                2630,
                2649
            ],
            [
                2659,
                2723
            ],
            [
                2815,
                2834
            ],
            [
                2834,
                2864
            ],
            [
                2870,
                2872
            ],
            [
                2874,
                2901
            ],
            [
                2908,
                2956
            ],
            [
                2967,
                2999
            ],
            [
                3003,
                3030
            ],
            [
                3034,
                3053
            ],
            [
                3062,
                3078
            ],
            [
                3082,
                3103
            ],
            [
                3107,
                3123
            ],
            [
                3133,
                3144
            ],
            [
                3144,
                3149
            ],
            [
                3155,
                3268
            ],
            [
                3290,
                3335
            ],
            [
                3617,
                3619
            ],
            [
                3375,
                3456
            ],
            [
                3458,
                3464
            ],
            [
                3465,
                3471
            ],
            [
                3477,
                3506
            ],
            [
                3520,
                3529
            ],
            [
                3532,
                3547
            ],
            [
                3733,
                3771
            ],
            [
                3784,
                3795
            ],
            [
                3801,
                3803
            ],
            [
                3808,
                3852
            ],
            [
                3908,
                3945
            ],
            [
                4008,
                4012
            ],
            [
                4014,
                4020
            ],
            [
                3981,
                3984
            ],
            [
                4037,
                4044
            ],
            [
                3945,
                3962
            ],
            [
                4034,
                4036
            ],
            [
                3968,
                3969
            ],
            [
                4050,
                4076
            ],
            [
                4091,
                4094
            ],
            [
                4105,
                4117
            ],
            [
                4119,
                4130
            ],
            [
                4145,
                4168
            ],
            [
                4231,
                4233
            ],
            [
                4233,
                4248
            ],
            [
                4254,
                4288
            ],
            [
                4299,
                4318
            ],
            [
                4339,
                4386
            ],
            [
                4395,
                4418
            ],
            [
                4423,
                4439
            ],
            [
                4447,
                4466
            ],
            [
                4483,
                4490
            ],
            [
                4504,
                4510
            ],
            [
                4513,
                4570
            ],
            [
                4588,
                4595
            ],
            [
                4597,
                4610
            ]
        ],
        "row_chars": [
            [
                0,
                203
            ],
            [
                203,
                633
            ],
            [
                633,
                1189
            ],
            [
                1189,
                1782
            ],
            [
                1782,
                2202
            ],
            [
                2202,
                2254
            ],
            [
                2254,
                2314
            ],
            [
                2314,
                2834
            ],
            [
                2834,
                3144
            ],
            [
                3144,
                3733
            ],
            [
                3733,
                3945
            ],
            [
                3945,
                4233
            ],
            [
                4233,
                4575
            ],
            [
                4575,
                4597
            ],
            [
                4597,
                4618
            ]
        ]
    },
    "abridged": {
        "text": "- And so to make sure of both systems, Mrs. Wadman planned to light my uncle Toby, if possible, at both ends at once.\nNow, if Mrs. Wadman had been rummaging for seven years through all the military lumber rooms of the Tower of London, she could not have found anything so fit for her purpose, as that which my uncle Toby had fixed up ready to her hands.\nI believe I have not told you - but I don't know - possibly I have - that whatever town or fortress the corporal was at work upon, during their campaign my uncle Toby always kept a plan of the place inside his sentry-box, fastened up with pins at the top, but loose at the bottom, for the convenience of holding it up to the eye.\nSo in an attack, Mrs. Wadman had nothing more to do, when she had got to the door of the sentry-box, but to extend her right hand; to take hold of the map or plan, and to advance it towards her; on which my uncle Toby's passions were sure to catch fire - for he would instantly take hold of the other corner of the map in his left hand, and with his pipe in the other, begin an explanation.\nThe world will naturally understand the reasons for Mrs. Wadman's next stroke of generalship - which was, to take my uncle Toby's tobacco-pipe out of his hand as soon as she possibly could, under the pretence of pointing at some redoubt in the map.\n- It obliged my uncle Toby to make use of his forefinger.\nThe difference it made in the attack was this; that placing her finger on the end of my uncle Toby's tobacco-pipe would have caused no effect. For as there was no blood or vital heat in the end of the tobacco-pipe, it could excite no feeling - nothing but smoke.\nWhereas, in following my uncle Toby's forefinger with hers, close through all the little turns and indentings of his works - pressing sometimes against the side of it - then treading upon its nail - then tripping it up - touching it here - then there, and so on - it set something in motion.\nThis, though slight skirmishing, and at a distance from the main body, yet drew on the rest; for here, the map usually falling close to the side of the sentry-box, my uncle Toby would lay his hand flat upon it, in order to go on with his explanation; and Mrs. Wadman, by a manoeuvre as quick as thought, would place her hand close beside it.\nBy bringing up her forefinger parallel to my uncle Toby's - it unavoidably brought the thumb into action - which naturally brought in the whole hand. Mrs. Wadman might now take up thine, dear uncle Toby! with the gentlest pushings and compressions that a hand is capable of receiving.\nWhilst this was happening, how could she forget to make him aware that it was her leg at the bottom of the sentry-box, which slightly pressed against the calf of his - so that my uncle Toby being thus attacked on both sides - was it any wonder, if now and then, it put his centre into disorder?\n'The deuce take it!' said my uncle Toby.",
        "paragraph_chars": [
            [
                0,
                118
            ],
            [
                118,
                354
            ],
            [
                354,
                684
            ],
            [
                684,
                1075
            ],
            [
                1075,
                1324
            ],
            [
                1324,
                1382
            ],
            [
                1382,
                1645
            ],
            [
                1645,
                1937
            ],
            [
                1937,
                2279
            ],
            [
                2279,
                2564
            ],
            [
                2564,
                2859
            ],
            [
                2859,
                2899
            ]
        ],
        "segment_chars": [
            [
                0,
                118
            ],
            [
                118,
                354
            ],
            [
                354,
                684
            ],
            [
                684,
                1075
            ],
            [
                1075,
                1324
            ],
            [
                1324,
                1382
            ],
            [
                1382,
                1525
            ],
            [
                1525,
                1645
            ],
            [
                1645,
                1937
            ],
            [
                1937,
                2279
            ],
            [
                2279,
                2429
            ],
            [
                2429,
                2483
            ],
            [
                2483,
                2564
            ],
            [
                2564,
                2859
            ],
            [
                2859,
                2880
            ],
            [
                2880,
                2899
            ]
        ],
        "overlap_chars": [
            [
                2,
                43
            ],
            [
                44,
                50
            ],
            [
                59,
                76
            ],
            [
                77,
                79
            ],
            [
                81,
                118
            ],
            [
                118,
                122
            ],
            [
                123,
                130
            ],
            [
                131,
                137
            ],
            [
                138,
                172
            ],
            [
                173,
                188
            ],
            [
                189,
                197
            ],
            [
                198,
                213
            ],
            [
                214,
                217
            ],
            [
                218,
                223
            ],
            [
                224,
                226
            ],
            [
                227,
                233
            ],
            [
                233,
                259
            ],
            [
                269,
                306
            ],
            [
                307,
                315
            ],
            [
                316,
                318
            ],
            [
                321,
                324
            ],
            [
                331,
                354
            ],
            [
                354,
                383
            ],
            [
                386,
                402
            ],
            [
                405,
                420
            ],
            [
                423,
                491
            ],
            [
                492,
                506
            ],
            [
                507,
                515
            ],
            [
                516,
                518
            ],
            [
                521,
                527
            ],
            [
                533,
                552
            ],
            [
                553,
                559
            ],
            [
                560,
                575
            ],
            [
                576,
                580
            ],
            [
                585,
                592
            ],
            [
                593,
                642
            ],
            [
                655,
                682
            ],
            [
                682,
                683
            ],
            [
                684,
                686
            ],
            [
                687,
                689
            ],
            [
                690,
                699
            ],
            [
                699,
                705
            ],
            [
                706,
                712
            ],
            [
                713,
                753
            ],
            [
                754,
                814
            ],
            [
                815,
                847
            ],
            [
                848,
                851
            ],
            [
                852,
                896
            ],
            [
                901,
                903
            ],
            [
                904,
                936
            ],
            [
                937,
                938
            ],
            [
                939,
                1029
            ],
            [
                1030,
                1075
            ],
            [
                1075,
                1099
            ],
            [
                1111,
                1122
            ],
            [
                1127,
                1131
            ],
            [
                1132,
                1140
            ],
            [
                1141,
                1167
            ],
            [
                1170,
                1197
            ],
            [
                1198,
                1200
            ],
            [
                1202,
                1204
            ],
            [
                1205,
                1263
            ],
            [
                1263,
                1270
            ],
            [
                1271,
                1274
            ],
            [
                1275,
                1283
            ],
            [
                1284,
                1295
            ],
            [
                1296,
                1311
            ],
            [
                1312,
                1322
            ],
            [
                1326,
                1345
            ],
            [
                1351,
                1382
            ],
            [
                1382,
                1433
            ],
            [
                1442,
                1445
            ],
            [
                1446,
                1452
            ],
            [
                1456,
                1475
            ],
            [
                1476,
                1478
            ],
            [
                1478,
                1480
            ],
            [
                1480,
                1482
            ],
            [
                1483,
                1495
            ],
            [
                1502,
                1506
            ],
            [
                1517,
                1523
            ],
            [
                1525,
                1544
            ],
            [
                1551,
                1615
            ],
            [
                1626,
                1645
            ],
            [
                1645,
                1675
            ],
            [
                1680,
                1682
            ],
            [
                1683,
                1710
            ],
            [
                1719,
                1767
            ],
            [
                1779,
                1811
            ],
            [
                1814,
                1841
            ],
            [
                1844,
                1863
            ],
            [
                1866,
                1882
            ],
            [
                1885,
                1906
            ],
            [
                1909,
                1925
            ],
            [
                1926,
                1937
            ],
            [
                1937,
                1942
            ],
            [
                1950,
                2063
            ],
            [
                2064,
                2109
            ],
            [
                2110,
                2112
            ],
            [
                2115,
                2196
            ],
            [
                2197,
                2203
            ],
            [
                2203,
                2209
            ],
            [
                2217,
                2246
            ],
            [
                2247,
                2256
            ],
            [
                2262,
                2277
            ],
            [
                2279,
                2317
            ],
            [
                2318,
                2329
            ],
            [
                2334,
                2336
            ],
            [
                2339,
                2383
            ],
            [
                2392,
                2429
            ],
            [
                2429,
                2433
            ],
            [
                2434,
                2440
            ],
            [
                2447,
                2450
            ],
            [
                2451,
                2458
            ],
            [
                2459,
                2476
            ],
            [
                2477,
                2479
            ],
            [
                2481,
                2482
            ],
            [
                2483,
                2509
            ],
            [
                2510,
                2513
            ],
            [
                2514,
                2526
            ],
            [
                2527,
                2538
            ],
            [
                2539,
                2562
            ],
            [
                2562,
                2564
            ],
            [
                2564,
                2579
            ],
            [
                2589,
                2623
            ],
            [
                2630,
                2649
            ],
            [
                2650,
                2697
            ],
            [
                2706,
                2729
            ],
            [
                2732,
                2748
            ],
            [
                2754,
                2773
            ],
            [
                2774,
                2781
            ],
            [
                2790,
                2796
            ],
            [
                2801,
                2858
            ],
            [
                2870,
                2877
            ],
            [
                2880,
                2893
            ]
        ],
        "row_chars": [
            [
                0,
                118
            ],
            [
                118,
                354
            ],
            [
                354,
                684
            ],
            [
                684,
                1075
            ],
            [
                1075,
                1324
            ],
            [
                1324,
                1324
            ],
            [
                1324,
                1382
            ],
            [
                1382,
                1645
            ],
            [
                1645,
                1937
            ],
            [
                1937,
                2279
            ],
            [
                2279,
                2429
            ],
            [
                2429,
                2564
            ],
            [
                2564,
                2859
            ],
            [
                2859,
                2880
            ],
            [
                2880,
                2899
            ]
        ]
    }
}