{
    "original": {
        "text": "There is nothing so foolish, when you are at the expence of making an entertainment of this kind, as to order things so badly, as to let your criticks and gentry of refined taste run it down: Nor is there anything so likely to make them do it, as that of leaving them out of the party, or, what is full as offensive, of bestowing your attention upon the rest of your guests in so particular a way, as if there was no such thing as a critick (by occupation) at table.\n----I guard against both; for, in the first place, I have left half a dozen places purposely open for them; --and in the next place, I pay them all court. --Gentlemen, I kiss your hands, I protest no company could give me half the pleasure, --by my soul I am glad to see you ------I beg only you will make no strangers of yourselves, but sit down without any ceremony, and fall on heartily.\nI said I had left six places, and I was upon the point of carrying my complaisance so far, as to have left a seventh open for them, --and in this very spot I stand on; but being told by a Critick (tho' not by occupation, --but by nature) that I had acquitted myself well enough, I shall fill it up directly, hoping, in the meantime, that I shall be able to make a great deal of more room next year.\n------How, in the name of wonder! could your uncle _Toby_, who, it seems, was a military man, and whom you have represented as no fool, ----be at the same time such a confused, pudding-headed, muddle-headed, fellow, as --Go look.\nSo, Sir Critick, I could have replied; but I scorn it. --'Tis language unurbane, --and only befitting the man who cannot give clear and satisfactory accounts of things, or dive deep enough into the first causes of human ignorance and confusion. It is moreover the reply valiant--and therefore I reject it: for tho' it might have suited my uncle _Toby's_ character as a soldier excellently well, and had he not accustomed himself, in such attacks, to whistle the _Lillabullero_, as he wanted no courage, 'tis the very answer he would have given; yet it would by no means have done for me. You see as plain as can be, that I write as a man of erudition; --that even my similies, my allusions, my illustrations, my metaphors, are erudite, --and that I must sustain my character properly, and contrast it properly too, --else what would become of me? Why, Sir, I should be undone; --at this very moment that I am going here to fill up one place against a critick, --I should have made an opening for a couple.\n----Therefore I answer thus:\nPray, Sir, in all the reading which you have ever read, did you ever read such a book as _Locke's_ Essay upon the Human Understanding? ----Don't answer me rashly--because many, I know, quote the book, who have not read it--and many have read it who understand it not: --If either of these is your case, as I write to instruct, I will tell you in three words what the book is. --It is a history. --A history! of who? what? where? when? Don't hurry yourself ----It is a history-book, Sir (which may possibly recommend it to the world) of what passes in a man's own mind; and if you will say so much of the book, and no more, believe me, you will cut no contemptible figure in a metaphysick circle.\nBut this by the way.\nNow if you will venture to go along with me, and look down into the bottom of this matter, it will be found that the cause of obscurity and confusion, in the mind of a man, is threefold.\nDull organs, dear Sir, in the first place. Secondly, slight and transient impressions made by the objects, when the said organs are not dull. And thirdly, a memory like unto a sieve, not able to retain what it has received. --Call down _Dolly_ your chambermaid, and I will give you my cap and bell along with it, if I make not this matter so plain that _Dolly_ herself should understand it as well as _Malbranch_. ----When _Dolly_ has indited her epistle to _Robin_, and has thrust her arm into the bottom of her pocket hanging by her right side; --take that opportunity to recollect that the organs and faculties of perception can, by nothing in this world, be so aptly typified and explained as by that one thing which _Dolly's_ hand is in search of. --Your organs are not so dull that I should inform you--'tis an inch, Sir, of red seal-wax.\nWhen this is melted, and dropped upon the letter, if _Dolly_ fumbles too long for her thimble, till the wax is over hardened, it will not receive the mark of her thimble from the usual impulse which was wont to imprint it. Very well. If _Dolly's_ wax, for want of better, is bees-wax, or of a temper too soft, --tho' it may receive, --it will not hold the impression, how hard soever _Dolly_ thrusts against it; and last of all, supposing the wax good, and eke the thimble, but applied thereto in careless haste, as her Mistress rings the bell; ----in any one of these three cases the print left by the thimble will be as unlike the prototype as a brass-jack.\nNow you must understand that not one of these was the true cause of the confusion in my uncle _Toby's_ discourse; and it is for that very reason I enlarge upon them so long, after the manner of great physiologists--to shew the world, what it did _not_ arise from.\nWhat it did arise from, I have hinted above, and a fertile source of obscurity it is, --and ever will be, --and that is the unsteady uses of words, which have perplexed the clearest and most exalted understandings.\nIt is ten to one (at _Arthur's_) whether you have ever read the literary histories of past ages; --if you have, what terrible battles, 'yclept logomachies, have they occasioned and perpetuated with so much gall and ink-shed, --that a good-natured man cannot read the accounts of them without tears in his eyes.\nGentle critick! when thou hast weighed all this, and considered within thyself how much of thy own knowledge, discourse, and conversation has been pestered and disordered at one time or other, by this, and this only: --What a pudder and racket in COUNCILS about and ; and in the SCHOOLS of the learned about power and about spirit; --about essences, and about quintessences; ----about substances, and about space. ----What confusion in greater THEATRES from words of little meaning, and as indeterminate a sense! when thou considerest this, thou wilt not wonder at my uncle _Toby's_ perplexities, --thou wilt drop a tear of pity upon his scarp and his counterscarp; --his glacis and his covered way; --his ravelin and his half-moon: 'Twas not by ideas, --by Heaven; his life was put in jeopardy by words.",
        "paragraph_chars": [
            [
                0,
                467
            ],
            [
                467,
                858
            ],
            [
                858,
                1257
            ],
            [
                1257,
                1487
            ],
            [
                1487,
                2493
            ],
            [
                2493,
                2522
            ],
            [
                2522,
                3218
            ],
            [
                3218,
                3239
            ],
            [
                3239,
                3426
            ],
            [
                3426,
                4271
            ],
            [
                4271,
                4931
            ],
            [
                4931,
                5195
            ],
            [
                5195,
                5410
            ],
            [
                5410,
                5721
            ],
            [
                5721,
                6525
            ]
        ],
        "segment_chars": [
            [
                0,
                467
            ],
            [
                467,
                622
            ],
            [
                622,
                858
            ],
            [
                858,
                1257
            ],
            [
                1257,
                1291
            ],
            [
                1291,
                1487
            ],
            [
                1487,
                1542
            ],
            [
                1542,
                1732
            ],
            [
                1732,
                2075
            ],
            [
                2075,
                2334
            ],
            [
                2334,
                2493
            ],
            [
                2493,
                2522
            ],
            [
                2522,
                2657
            ],
            [
                2657,
                2898
            ],
            [
                2898,
                2917
            ],
            [
                2917,
                2930
            ],
            [
                2930,
                2938
            ],
            [
                2938,
                2944
            ],
            [
                2944,
                2951
            ],
            [
                2951,
                2957
            ],
            [
                2957,
                3218
            ],
            [
                3218,
                3239
            ],
            [
                3239,
                3426
            ],
            [
                3426,
                3469
            ],
            [
                3469,
                3568
            ],
            [
                3568,
                3650
            ],
            [
                3650,
                3840
            ],
            [
                3840,
                4179
            ],
            [
                4179,
                4271
            ],
            [
                4271,
                4494
            ],
            [
                4494,
                4505
            ],
            [
                4505,
                4931
            ],
            [
                4931,
                5195
            ],
            [
                5195,
                5410
            ],
            [
                5410,
                5721
            ],
            [
                5721,
                5737
            ],
            [
                5737,
                6135
            ],
            [
                6135,
                6234
            ],
            [
                6234,
                6525
            ]
        ],
        "overlap_chars": [
            [
                0,
                41
            ],
            [
                60,
                103
            ],
            [
                133,
                141
            ],
            [
                179,
                190
            ],
            [
                192,
                246
            ],
            [
                255,
                288
            ],
            [
                320,
                373
            ],
            [
                125,
                126
            ],
            [
                151,
                154
            ],
            [
                45,
                48
            ],
            [
                42,
                44
            ],
            [
                460,
                467
            ],
            [
                471,
                574
            ],
            [
                577,
                621
            ],
            [
                633,
                652
            ],
            [
                664,
                707
            ],
            [
                710,
                741
            ],
            [
                805,
                813
            ],
            [
                834,
                858
            ],
            [
                858,
                897
            ],
            [
                952,
                988
            ],
            [
                1024,
                1045
            ],
            [
                1096,
                1165
            ],
            [
                992,
                995
            ],
            [
                1215,
                1219
            ],
            [
                1236,
                1257
            ],
            [
                1263,
                1291
            ],
            [
                1291,
                1307
            ],
            [
                1314,
                1315
            ],
            [
                1335,
                1350
            ],
            [
                1355,
                1392
            ],
            [
                1397,
                1399
            ],
            [
                1417,
                1457
            ],
            [
                1465,
                1475
            ],
            [
                1478,
                1487
            ],
            [
                1487,
                1494
            ],
            [
                1502,
                1542
            ],
            [
                1549,
                1557
            ],
            [
                1566,
                1567
            ],
            [
                1574,
                1578
            ],
            [
                1593,
                1618
            ],
            [
                1636,
                1684
            ],
            [
                1691,
                1716
            ],
            [
                1730,
                1732
            ],
            [
                1732,
                1764
            ],
            [
                1766,
                1796
            ],
            [
                1802,
                1831
            ],
            [
                2045,
                2047
            ],
            [
                1837,
                1839
            ],
            [
                1841,
                1881
            ],
            [
                1886,
                1944
            ],
            [
                1950,
                1962
            ],
            [
                2032,
                2044
            ],
            [
                2067,
                2074
            ],
            [
                2075,
                2082
            ],
            [
                2101,
                2127
            ],
            [
                2137,
                2138
            ],
            [
                2141,
                2157
            ],
            [
                2162,
                2176
            ],
            [
                2194,
                2222
            ],
            [
                2225,
                2271
            ],
            [
                2309,
                2334
            ],
            [
                2334,
                2363
            ],
            [
                2366,
                2368
            ],
            [
                2374,
                2392
            ],
            [
                2415,
                2437
            ],
            [
                2445,
                2446
            ],
            [
                2449,
                2491
            ],
            [
                2491,
                2493
            ],
            [
                2497,
                2522
            ],
            [
                2522,
                2532
            ],
            [
                2578,
                2595
            ],
            [
                2612,
                2619
            ],
            [
                2621,
                2657
            ],
            [
                2661,
                2683
            ],
            [
                2685,
                2743
            ],
            [
                2745,
                2770
            ],
            [
                2785,
                2788
            ],
            [
                2771,
                2784
            ],
            [
                2792,
                2823
            ],
            [
                2847,
                2898
            ],
            [
                2900,
                2916
            ],
            [
                2919,
                2930
            ],
            [
                2930,
                2938
            ],
            [
                2938,
                2944
            ],
            [
                2944,
                2951
            ],
            [
                2951,
                2956
            ],
            [
                2982,
                3007
            ],
            [
                3055,
                3206
            ],
            [
                3210,
                3218
            ],
            [
                3218,
                3226
            ],
            [
                3227,
                3239
            ],
            [
                3239,
                3292
            ],
            [
                3298,
                3364
            ],
            [
                3379,
                3388
            ],
            [
                3390,
                3392
            ],
            [
                3405,
                3410
            ],
            [
                3397,
                3401
            ],
            [
                3412,
                3426
            ],
            [
                3426,
                3469
            ],
            [
                3469,
                3485
            ],
            [
                3500,
                3531
            ],
            [
                3566,
                3568
            ],
            [
                3568,
                3649
            ],
            [
                3652,
                3661
            ],
            [
                3670,
                3698
            ],
            [
                3744,
                3748
            ],
            [
                3753,
                3778
            ],
            [
                3787,
                3815
            ],
            [
                3844,
                3848
            ],
            [
                3857,
                3860
            ],
            [
                3869,
                3872
            ],
            [
                3881,
                3883
            ],
            [
                3891,
                3920
            ],
            [
                3935,
                3945
            ],
            [
                3971,
                3972
            ],
            [
                4000,
                4025
            ],
            [
                4040,
                4057
            ],
            [
                4059,
                4096
            ],
            [
                4110,
                4130
            ],
            [
                4135,
                4146
            ],
            [
                4153,
                4155
            ],
            [
                4157,
                4177
            ],
            [
                4240,
                4260
            ],
            [
                4265,
                4271
            ],
            [
                4271,
                4323
            ],
            [
                4332,
                4365
            ],
            [
                4371,
                4378
            ],
            [
                4395,
                4396
            ],
            [
                4397,
                4420
            ],
            [
                4433,
                4440
            ],
            [
                4421,
                4425
            ],
            [
                4492,
                4494
            ],
            [
                4494,
                4505
            ],
            [
                4505,
                4507
            ],
            [
                4514,
                4516
            ],
            [
                4518,
                4521
            ],
            [
                4543,
                4545
            ],
            [
                4571,
                4580
            ],
            [
                4550,
                4551
            ],
            [
                4588,
                4594
            ],
            [
                4623,
                4638
            ],
            [
                4606,
                4622
            ],
            [
                4679,
                4727
            ],
            [
                4732,
                4756
            ],
            [
                4924,
                4925
            ],
            [
                4820,
                4826
            ],
            [
                4831,
                4851
            ],
            [
                4521,
                4522
            ],
            [
                4852,
                4886
            ],
            [
                4887,
                4889
            ],
            [
                4929,
                4931
            ],
            [
                4931,
                4984
            ],
            [
                4990,
                5024
            ],
            [
                5146,
                5148
            ],
            [
                5030,
                5032
            ],
            [
                5034,
                5095
            ],
            [
                5096,
                5104
            ],
            [
                5154,
                5163
            ],
            [
                5165,
                5176
            ],
            [
                5178,
                5181
            ],
            [
                5183,
                5195
            ],
            [
                5195,
                5239
            ],
            [
                5312,
                5376
            ],
            [
                5394,
                5410
            ],
            [
                5509,
                5511
            ],
            [
                5451,
                5506
            ],
            [
                5628,
                5629
            ],
            [
                5522,
                5543
            ],
            [
                5686,
                5688
            ],
            [
                5571,
                5575
            ],
            [
                5516,
                5520
            ],
            [
                5591,
                5602
            ],
            [
                5520,
                5521
            ],
            [
                5603,
                5628
            ],
            [
                5629,
                5633
            ],
            [
                5637,
                5672
            ],
            [
                5689,
                5719
            ],
            [
                5735,
                5737
            ],
            [
                6234,
                6243
            ],
            [
                6256,
                6294
            ],
            [
                6476,
                6478
            ],
            [
                6300,
                6302
            ],
            [
                6304,
                6316
            ],
            [
                6325,
                6386
            ],
            [
                6389,
                6420
            ],
            [
                6423,
                6452
            ],
            [
                6487,
                6515
            ],
            [
                6460,
                6473
            ],
            [
                6516,
                6525
            ]
        ],
        "row_chars": [
            [
                0,
                467
            ],
            [
                467,
                622
            ],
            [
                622,
                858
            ],
            [
                858,
                1257
            ],
            [
                1257,
                1291
            ],
            [
                1291,
                1487
            ],
            [
                1487,
                1542
            ],
            [
                1542,
                1732
            ],
            [
                1732,
                2075
            ],
            [
                2075,
                2334
            ],
            [
                2334,
                2493
            ],
            [
                2493,
                2522
            ],
            [
                2522,
                2657
            ],
            [
                2657,
                2898
            ],
            [
                2898,
                2917
            ],
            [
                2917,
                2930
            ],
            [
                2930,
                2938
            ],
            [
                2938,
                2944
            ],
            [
                2944,
                2951
            ],
            [
                2951,
                2957
            ],
            [
                2957,
                3218
            ],
            [
                3218,
                3239
            ],
            [
                3239,
                3426
            ],
            [
                3426,
                3469
            ],
            [
                3469,
                3568
            ],
            [
                3568,
                3650
            ],
            [
                3650,
                3840
            ],
            [
                3840,
                4271
            ],
            [
                4271,
                4494
            ],
            [
                4494,
                4505
            ],
            [
                4505,
                4931
            ],
            [
                4931,
                5195
            ],
            [
                5195,
                5410
            ],
            [
                5410,
                5737
            ],
            [
                5737,
                6135
            ],
            [
                6135,
                6234
            ],
            [
                6234,
                6525
            ]
        ]
    },
    "abridged": {
        "text": "There is nothing so foolish, when you are making an entertainment of this kind, as to let your critics run it down. Nor is there anything so likely to make them do it, as leaving them out of the party, or bestowing your attention upon the rest of your guests, and ignoring the critics at your table.\n- I guard against both; for, in the first place, I have left half a dozen places purposely open for them; and in the next place, I pay them all court.\n- Gentlemen, I kiss your hands; no company could give me half the pleasure, - by my soul I am glad to see you. - Sit down, and fall on heartily.\nI said I had left six places, and I was about to have left a seventh open for them; but being told by a Critic that I had acquitted myself well enough, I shall fill it up directly, and make more room next year.\n'How, in the name of wonder! could your uncle Toby, a military man, whom you have represented as no fool, be such a confused, pudding-headed, muddle-brained fellow, as-'\nGo look.\nSo, Sir Critic, I could have replied; but I scorn it. 'Tis uncivil language, only fit for a man who cannot give clear accounts of things, or dive deep enough into the causes of human ignorance. It is moreover the reply valiant - and therefore I reject it: for though it might have suited my uncle Toby's character as a soldier excellently well, (had he not accustomed himself, in such attacks, to whistle Lillabullero,) yet it would not do for me.\nYou see plainly, that I write as a man of learning; - that even my similes, my allusions, my metaphors, are erudite, - and that I must sustain my character properly, or what would become of me? Why, Sir, I should be undone; at the very moment that I filled up one place against a critic, I should have made an opening for a couple more.\nTherefore I answer thus:\nPray, Sir, did you ever read Locke's Essay upon the Human Understanding? - Don't answer me rashly - because many, I know, quote the book, who have not read it - and many have read it who do not understand it. If either of these is your case, I will tell you in three words what the book is. It is a history.\n- A history! of who? what? where? when?\nIt is a history-book, Sir, of what passes in a man's own mind; and if you will say so much of the book, and no more, believe me, you will cut no contemptible figure in a metaphysic circle.\nBut this is by the way.\nNow if you will venture to go along with me, and look into the bottom of this matter, it will be found that the cause of confusion in a man's mind is threefold.\nDull organs, dear Sir, in the first place. Secondly, slight impressions made by the objects. And thirdly, a memory like unto a sieve, not able to retain what it has received.\nCall down Dolly your chambermaid, and I will make this matter so plain that Dolly herself should understand it. When Dolly has written her letter to Robin, and has thrust her arm into her pocket;- recollect that the organs of perception can by nothing in this world, be so aptly explained as by that thing which Dolly's hand is in search of: - an inch, Sir, of red sealing-wax.\nWhen this is melted, and dropped upon the letter, if Dolly fumbles too long for her thimble, the wax will be too hard, and it will not receive the thimble's mark. Very well. If Dolly's wax is too soft, - though it may take the impression, it will not hold it; and last of all, supposing the wax good, and also the thimble, but applied too hastily - in any of these three cases, the print left by the thimble will not be true.\nNow you must understand that not one of these was the cause of the confusion in my uncle Toby's discourse; and it is for that very reason I enlarge upon them for so long, - to show the world what it did not arise from.\nWhat it did arise from, I have hinted above, is the unsteady uses of words, which have perplexed the clearest understandings.\nIf you have ever read the literary histories of past ages; - what terrible battles of words they have perpetuated, with so much gall and ink shed that a good-natured man cannot read them without tears in his eyes - gentle critic! when thou hast considered all this, thou wilt not wonder at my uncle Toby's perplexities. Thou wilt drop a tear of pity upon his scarp and his counterscarp; his glacis and his covered way; his ravelin and his half-moon. His life was put in jeopardy not by ideas, but by words.",
        "paragraph_chars": [
            [
                0,
                300
            ],
            [
                300,
                451
            ],
            [
                451,
                596
            ],
            [
                596,
                807
            ],
            [
                807,
                977
            ],
            [
                977,
                986
            ],
            [
                986,
                1434
            ],
            [
                1434,
                1771
            ],
            [
                1771,
                1796
            ],
            [
                1796,
                2104
            ],
            [
                2104,
                2144
            ],
            [
                2144,
                2333
            ],
            [
                2333,
                2357
            ],
            [
                2357,
                2518
            ],
            [
                2518,
                2693
            ],
            [
                2693,
                3071
            ],
            [
                3071,
                3497
            ],
            [
                3497,
                3716
            ],
            [
                3716,
                3842
            ],
            [
                3842,
                4348
            ]
        ],
        "segment_chars": [
            [
                0,
                116
            ],
            [
                116,
                300
            ],
            [
                300,
                451
            ],
            [
                451,
                562
            ],
            [
                562,
                596
            ],
            [
                596,
                807
            ],
            [
                807,
                836
            ],
            [
                836,
                977
            ],
            [
                977,
                986
            ],
            [
                986,
                1040
            ],
            [
                1040,
                1180
            ],
            [
                1180,
                1434
            ],
            [
                1434,
                1628
            ],
            [
                1628,
                1771
            ],
            [
                1771,
                1796
            ],
            [
                1796,
                1869
            ],
            [
                1869,
                2005
            ],
            [
                2005,
                2087
            ],
            [
                2087,
                2104
            ],
            [
                2104,
                2117
            ],
            [
                2117,
                2125
            ],
            [
                2125,
                2131
            ],
            [
                2131,
                2138
            ],
            [
                2138,
                2144
            ],
            [
                2144,
                2333
            ],
            [
                2333,
                2357
            ],
            [
                2357,
                2518
            ],
            [
                2518,
                2561
            ],
            [
                2561,
                2611
            ],
            [
                2611,
                2693
            ],
            [
                2693,
                2805
            ],
            [
                2805,
                3071
            ],
            [
                3071,
                3234
            ],
            [
                3234,
                3245
            ],
            [
                3245,
                3497
            ],
            [
                3497,
                3716
            ],
            [
                3716,
                3842
            ],
            [
                3842,
                4072
            ],
            [
                4072,
                4162
            ],
            [
                4162,
                4292
            ],
            [
                4292,
                4348
            ]
        ],
        "overlap_chars": [
            [
                0,
                41
            ],
            [
                42,
                85
            ],
            [
                86,
                94
            ],
            [
                103,
                114
            ],
            [
                116,
                170
            ],
            [
                171,
                204
            ],
            [
                205,
                258
            ],
            [
                258,
                259
            ],
            [
                260,
                263
            ],
            [
                273,
                276
            ],
            [
                285,
                287
            ],
            [
                293,
                300
            ],
            [
                302,
                405
            ],
            [
                406,
                450
            ],
            [
                462,
                481
            ],
            [
                483,
                526
            ],
            [
                529,
                560
            ],
            [
                564,
                572
            ],
            [
                572,
                596
            ],
            [
                596,
                635
            ],
            [
                642,
                678
            ],
            [
                678,
                699
            ],
            [
                707,
                776
            ],
            [
                777,
                780
            ],
            [
                781,
                785
            ],
            [
                786,
                807
            ],
            [
                808,
                836
            ],
            [
                836,
                852
            ],
            [
                857,
                858
            ],
            [
                859,
                874
            ],
            [
                875,
                912
            ],
            [
                913,
                915
            ],
            [
                916,
                956
            ],
            [
                964,
                974
            ],
            [
                977,
                986
            ],
            [
                986,
                993
            ],
            [
                1000,
                1040
            ],
            [
                1053,
                1061
            ],
            [
                1061,
                1062
            ],
            [
                1063,
                1067
            ],
            [
                1078,
                1103
            ],
            [
                1104,
                1152
            ],
            [
                1153,
                1178
            ],
            [
                1178,
                1180
            ],
            [
                1180,
                1212
            ],
            [
                1215,
                1245
            ],
            [
                1253,
                1282
            ],
            [
                1285,
                1287
            ],
            [
                1287,
                1289
            ],
            [
                1290,
                1330
            ],
            [
                1332,
                1390
            ],
            [
                1391,
                1403
            ],
            [
                1406,
                1418
            ],
            [
                1426,
                1433
            ],
            [
                1434,
                1441
            ],
            [
                1449,
                1475
            ],
            [
                1484,
                1485
            ],
            [
                1488,
                1504
            ],
            [
                1508,
                1522
            ],
            [
                1522,
                1550
            ],
            [
                1553,
                1599
            ],
            [
                1603,
                1628
            ],
            [
                1628,
                1657
            ],
            [
                1658,
                1660
            ],
            [
                1665,
                1683
            ],
            [
                1691,
                1713
            ],
            [
                1720,
                1721
            ],
            [
                1722,
                1764
            ],
            [
                1769,
                1771
            ],
            [
                1771,
                1796
            ],
            [
                1796,
                1806
            ],
            [
                1807,
                1824
            ],
            [
                1825,
                1832
            ],
            [
                1833,
                1869
            ],
            [
                1871,
                1893
            ],
            [
                1896,
                1954
            ],
            [
                1957,
                1982
            ],
            [
                1986,
                1989
            ],
            [
                1990,
                2003
            ],
            [
                2005,
                2036
            ],
            [
                2036,
                2087
            ],
            [
                2087,
                2103
            ],
            [
                2106,
                2117
            ],
            [
                2117,
                2125
            ],
            [
                2125,
                2131
            ],
            [
                2131,
                2138
            ],
            [
                2138,
                2143
            ],
            [
                2144,
                2169
            ],
            [
                2171,
                2322
            ],
            [
                2325,
                2333
            ],
            [
                2333,
                2341
            ],
            [
                2345,
                2357
            ],
            [
                2357,
                2410
            ],
            [
                2411,
                2477
            ],
            [
                2478,
                2487
            ],
            [
                2488,
                2490
            ],
            [
                2491,
                2496
            ],
            [
                2499,
                2503
            ],
            [
                2504,
                2518
            ],
            [
                2518,
                2561
            ],
            [
                2561,
                2577
            ],
            [
                2578,
                2609
            ],
            [
                2609,
                2611
            ],
            [
                2611,
                2692
            ],
            [
                2693,
                2702
            ],
            [
                2709,
                2737
            ],
            [
                2738,
                2742
            ],
            [
                2743,
                2768
            ],
            [
                2775,
                2803
            ],
            [
                2805,
                2809
            ],
            [
                2816,
                2819
            ],
            [
                2828,
                2831
            ],
            [
                2839,
                2841
            ],
            [
                2847,
                2876
            ],
            [
                2877,
                2887
            ],
            [
                2887,
                2888
            ],
            [
                2890,
                2915
            ],
            [
                2916,
                2933
            ],
            [
                2934,
                2971
            ],
            [
                2972,
                2992
            ],
            [
                2993,
                3004
            ],
            [
                3010,
                3012
            ],
            [
                3013,
                3033
            ],
            [
                3037,
                3057
            ],
            [
                3065,
                3071
            ],
            [
                3071,
                3123
            ],
            [
                3130,
                3163
            ],
            [
                3164,
                3171
            ],
            [
                3188,
                3189
            ],
            [
                3194,
                3217
            ],
            [
                3218,
                3225
            ],
            [
                3228,
                3232
            ],
            [
                3232,
                3234
            ],
            [
                3234,
                3245
            ],
            [
                3245,
                3247
            ],
            [
                3253,
                3255
            ],
            [
                3256,
                3259
            ],
            [
                3260,
                3262
            ],
            [
                3263,
                3272
            ],
            [
                3273,
                3274
            ],
            [
                3282,
                3288
            ],
            [
                3294,
                3309
            ],
            [
                3310,
                3326
            ],
            [
                3327,
                3375
            ],
            [
                3381,
                3405
            ],
            [
                3418,
                3419
            ],
            [
                3420,
                3426
            ],
            [
                3427,
                3447
            ],
            [
                3447,
                3448
            ],
            [
                3449,
                3483
            ],
            [
                3488,
                3490
            ],
            [
                3495,
                3497
            ],
            [
                3497,
                3550
            ],
            [
                3551,
                3585
            ],
            [
                3586,
                3588
            ],
            [
                3590,
                3592
            ],
            [
                3593,
                3654
            ],
            [
                3659,
                3667
            ],
            [
                3678,
                3687
            ],
            [
                3688,
                3699
            ],
            [
                3700,
                3703
            ],
            [
                3704,
                3716
            ],
            [
                3716,
                3760
            ],
            [
                3761,
                3825
            ],
            [
                3826,
                3842
            ],
            [
                3842,
                3844
            ],
            [
                3845,
                3900
            ],
            [
                3901,
                3902
            ],
            [
                3903,
                3924
            ],
            [
                3925,
                3927
            ],
            [
                3934,
                3938
            ],
            [
                3939,
                3943
            ],
            [
                3944,
                3955
            ],
            [
                3955,
                3956
            ],
            [
                3957,
                3982
            ],
            [
                3983,
                3987
            ],
            [
                3988,
                4023
            ],
            [
                4024,
                4054
            ],
            [
                4070,
                4072
            ],
            [
                4072,
                4081
            ],
            [
                4102,
                4140
            ],
            [
                4143,
                4145
            ],
            [
                4145,
                4147
            ],
            [
                4148,
                4160
            ],
            [
                4167,
                4228
            ],
            [
                4229,
                4260
            ],
            [
                4261,
                4290
            ],
            [
                4292,
                4320
            ],
            [
                4321,
                4334
            ],
            [
                4339,
                4348
            ]
        ],
        "row_chars": [
            [
                0,
                300
            ],
            [
                300,
                451
            ],
            [
                451,
                596
            ],
            [
                596,
                807
            ],
            [
                807,
                836
            ],
            [
                836,
                986
            ],
            [
                986,
                1040
            ],
            [
                1040,
                1180
            ],
            [
                1180,
                1434
            ],
            [
                1434,
                1628
            ],
            [
                1628,
                1771
            ],
            [
                1771,
                1796
            ],
            [
                1796,
                1869
            ],
            [
                1869,
                2087
            ],
            [
                2087,
                2104
            ],
            [
                2104,
                2117
            ],
            [
                2117,
                2125
            ],
            [
                2125,
                2131
            ],
            [
                2131,
                2138
            ],
            [
                2138,
                2144
            ],
            [
                2144,
                2333
            ],
            [
                2333,
                2357
            ],
            [
                2357,
                2518
            ],
            [
                2518,
                2561
            ],
            [
                2561,
                2611
            ],
            [
                2611,
                2693
            ],
            [
                2693,
                2805
            ],
            [
                2805,
                3071
            ],
            [
                3071,
                3234
            ],
            [
                3234,
                3245
            ],
            [
                3245,
                3497
            ],
            [
                3497,
                3716
            ],
            [
                3716,
                3842
            ],
            [
                3842,
                4072
            ],
            [
                4072,
                4072
            ],
            [
                4072,
                4072
            ],
            [
                4072,
                4348
            ]
        ]
    }
}