{
    "original": {
        "text": "It was a thousand pities----though I believe, an' please your honour, I am going to say but a foolish kind of a thing for a soldier----\nA soldier, cried my uncle _Toby_, interrupting the corporal, is no more exempt from saying a foolish thing, _Trim_, than a man of letters ----But not so often, an' please your honour, replied the corporal ----My uncle _Toby_ gave a nod.\nIt was a thousand pities then, said the corporal, casting his eye upon _Dunkirk_, and the mole, as _Servius Sulpicius_, in returning out of _Asia_ (when he sailed from _gina_ towards _Megara_), did upon _Corinth_ and _Pyreus_----\n--\"It was a thousand pities, an' please your honour, to destroy these works----and a thousand pities to have let them stood.\"----\n----Thou art right, _Trim_, in both cases; said my uncle _Toby_. ----This, continued the corporal, is the reason, that from the beginning of their demolition to the end ----I have never once whistled, or sung, or laugh'd, or cry'd, or talk'd of past done deeds, or told your honour one story good or bad----\n----Thou hast many excellencies, _Trim_, said my uncle _Toby_, and I hold it not the least of them, as thou happenest to be a story-teller, that of the number thou hast told me, either to amuse me in my painful hours, or divert me in my grave ones--thou hast seldom told me a bad one----\n----Because, an' please your honour, except one of a _King of Bohemia and his seven castles_, --they are all true; for they are about myself----\nI do not like the subject the worse, _Trim_, said my uncle _Toby_, on that score: But prithee what is this story? thou hast excited my curiosity.\nI'll tell it your honour, quoth the corporal, directly --Provided, said my uncle _Toby_, looking earnestly towards _Dunkirk_ and the mole again----provided it is not a merry one; to such, _Trim_, a man should ever bring one half of the entertainment along with him; and the disposition I am in at present would wrong both thee, _Trim_, and thy story ----It is not a merry one by any means, replied the corporal --Nor would I have it altogether a grave one, added my uncle _Toby_ ----It is neither the one nor the other, replied the corporal, but will suit your honour exactly ----Then I'll thank thee for it with all my heart, cried my uncle _Toby_; so prithee begin it, _Trim_.\nThe corporal made his reverence; and though it is not so easy a matter as the world imagines, to pull off a lank _Montero_-cap with grace----or a whit less difficult, in my conceptions, when a man is sitting squat upon the ground, to make a bow so teeming with respect as the corporal was wont; yet by suffering the palm of his right hand, which was towards his master, to slip backwards upon the grass, a little beyond his body, in order to allow it the greater sweep----and by an unforced compression, at the same time, of his cap with the thumb and the two forefingers of his left, by which the diameter of the cap became reduced, so that it might be said, rather to be insensibly squeez'd--than pull'd off with a flatus----the corporal acquitted himself of both in a better manner than the posture of his affairs promised; and having hemmed twice, to find in what key his story would best go, and best suit his master's humour, --he exchanged a single look of kindness with him, and set off thus.\nTHE STORY OF THE KING OF BOHEMIA AND HIS SEVEN CASTLES\nThere was a certain king of Bo - - he------\nAs the corporal was entering the confines of _Bohemia_, my uncle _Toby_ obliged him to halt for a single moment; he had set out bare-headed, having, since he pull'd off his _Montero_-cap in the latter end of the last chapter, left it lying beside him on the ground.\n----The eye of Goodness espieth all things----so that before the corporal had well got through the first five words of his story, had my uncle _Toby_ twice touch'd his _Montero_-cap with the end of his cane, interrogatively----as much as to say, Why don't you put it on, _Trim?_ _Trim_ took it up with the most respectful slowness, and casting a glance of humiliation as he did it, upon the embroidery of the fore-part, which being dismally tarnish'd and fray'd moreover in some of the principal leaves and boldest parts of the pattern, he lay'd it down again between his two feet, in order to moralise upon the subject.\n----'Tis every word of it but too true, cried my uncle _Toby_, that thou art about to observe----\n\"_Nothing in this world, Trim, is made to last for ever._\"\n----But when tokens, dear _Tom_, of thy love and remembrance wear out, said _Trim_, what shall we say?\nThere is no occasion, _Trim_, quoth my uncle _Toby_, to say anything else; and was a man to puzzle his brains till Doom's day, I believe, _Trim_, it would be impossible.\nThe corporal, perceiving my uncle _Toby_ was in the right, and that it would be in vain for the wit of man to think of extracting a purer moral from his cap, without further attempting it, he put it on; and passing his hand across his forehead to rub out a pensive wrinkle, which the text and the doctrine between them had engender'd, he return'd, with the same look and tone of voice, to his story of the king of _Bohemia_ and his seven castles.\nTHE STORY OF THE KING OF BOHEMIA AND HIS SEVEN CASTLES, CONTINUED\nThere was a certain king of _Bohemia_, but in whose reign, except his own, I am not able to inform your honour----\nI do not desire it of thee, _Trim_, by any means, cried my uncle _Toby_.\n----It was a little before the time, an' please your honour, when giants were beginning to leave off breeding: --but in what year of our Lord that was----\nI would not give a halfpenny to know, said my uncle _Toby_.\n----Only, an' please your honour, it makes a story look the better in the face----\n----'Tis thy own, _Trim_, so ornament it after thy own fashion; and take any date, continued my uncle _Toby_, looking pleasantly upon him--take any date in the whole world thou chusest, and put it to--thou art heartily welcome----\nThe corporal bowed; for of every century, and of every year of that century, from the first creation of the world down to _Noah's_ flood; and from _Noah's_ flood to the birth of _Abraham_; through all the pilgrimages of the patriarchs, to the departure of the _Israelites_ out of _Egypt_----and throughout all the Dynasties, Olympiads, Urbeconditas, and other memorable epochas of the different nations of the world, down to the coming of Christ, and from thence to the very moment in which the corporal was telling his story----had my uncle _Toby_ subjected this vast empire of time and all its abysses at his feet; but as MODESTY scarce touches with a finger what LIBERALITY offers her with both hands open--the corporal contented himself with the very _worst year_ of the whole bunch; which, to prevent your honours of the Majority and Minority from tearing the very flesh off your bones in contestation, 'Whether that year is not always the last cast-year of the last cast-almanack' ----I tell you plainly it was; but from a different reason than you wot of----\n----It was the year next him----which being, the year of our Lord seventeen hundred and twelve, when the Duke of _Ormond_ was playing the devil in _Flanders_----the corporal took it, and set out with it afresh on his expedition to _Bohemia_.\nTHE STORY OF THE KING OF BOHEMIA AND HIS SEVEN CASTLES, CONTINUED\nIn the year of our Lord one thousand seven hundred and twelve, there was, an' please your honour----\n----To tell thee truly, _Trim_, quoth my uncle _Toby_, any other date would have pleased me much better, not only on account of the sad stain upon our history that year, in marching off our troops, and refusing to cover the siege of _Quesnoi_, though _Fagel_ was carrying on the works with such incredible vigour--but likewise on the score, _Trim_, of thy own story; because if there are--and which, from what thou hast dropt, I partly suspect to be the fact--if there are giants in it----\nThere is but one, an' please your honour----\n----'Tis as bad as twenty, replied my uncle _Toby_----thou should'st have carried him back some seven or eight hundred years out of harm's way, both of critics and other people: and therefore I would advise thee, if ever thou tellest it again----\n----If I live, an' please your honour, but once to get through it, I will never tell it again, quoth _Trim_, either to man, woman, or child ----Poo--poo! said my uncle _Toby_--but with accents of such sweet encouragement did he utter it, that the corporal went on with his story with more alacrity than ever.\nTHE STORY OF THE KING OF BOHEMIA AND HIS SEVEN CASTLES, CONTINUED\nThere was, an' please your honour, said the corporal, raising his voice and rubbing the palms of his two hands cheerily together as he begun, a certain king of _Bohemia_----\n----Leave out the date entirely, _Trim_, quoth my uncle _Toby_, leaning forwards, and laying his hand gently upon the corporal's shoulder to temper the interruption--leave it out entirely, _Trim_; a story passes very well without these niceties, unless one is pretty sure of 'em ----Sure of 'em! said the corporal, shaking his head----\nRight; answered my uncle _Toby_, it is not easy, _Trim_, for one, bred up as thou and I have been to arms, who seldom looks further forward than to the end of his musket, or backwards beyond his knapsack, to know much about this matter ----God bless your honour! said the corporal, won by the _manner_ of my uncle _Toby's_ reasoning, as much as by the reasoning itself, he has something else to do; if not on action, or a march, or upon duty in his garrison--he has his firelock, an' please your honour, to furbish--his accoutrements to take care of--his regimentals to mend--himself to shave and keep clean, so as to appear always like what he is upon the parade; what business, added the corporal triumphantly, has a soldier, an' please your honour, to know anything at all of _geography?_\n----Thou would'st have said _chronology_, _Trim_, said my uncle _Toby_; for as for geography, 'tis of absolute use to him; he must be acquainted intimately with every country and its boundaries where his profession carries him; he should know every town and city, and village and hamlet, with the canals, the roads, and hollow ways which lead up to them; there is not a river or a rivulet he passes, _Trim_, but he should be able at first sight to tell thee what is its name--in what mountains it takes its rise--what is its course--how far it is navigable--where fordable--where not; he should know the fertility of every valley, as well as the hind who ploughs it; and be able to describe, or, if it is required, to give thee an exact map of all the plains and defiles, the forts, the acclivities, the woods and morasses, thro' and by which his army is to march; he should know their produce, their plants, their minerals, their waters, their animals, their seasons, their climates, their heats and cold, their inhabitants, their customs, their language, their policy, and even their religion.\nIs it else to be conceived, corporal, continued my uncle _Toby_, rising up in his sentry-box, as he began to warm in this part of his discourse--how _Marlborough_ could have marched his army from the banks of the _Maes_ to _Belburg_; from _Belburg_ to _Kerpenord_--(here the corporal could sit no longer) from _Kerpenord_, _Trim_, to _Kalsaken_; from _Kalsaken_ to _Newdorf_; from _Newdorf_ to _Landenbourg_; from _Landenbourg_ to _Mildenheim_; from _Mildenheim_ to _Elchingen_; from _Elchingen_ to _Gingen_; from _Gingen_ to _Balmerchoffen_; from _Balmerchoffen_ to _Skellenburg_, where he broke in upon the enemy's works; forced his passage over the _Danube_; cross'd the _Lech_--push'd on his troops into the heart of the empire, marching at the head of them through _Fribourg_, _Hokenwert_, and _Schonevelt_, to the plains of _Blenheim_ and _Hochstet?_ ----Great as he was, corporal, he could not have advanced a step, or made one single day's march without the aids of _Geography_. ----As for _Chronology_, I own, _Trim_, continued my uncle _Toby_, sitting down again coolly in his sentry-box, that of all others, it seems a science which the soldier might best spare, was it not for the lights which that science must one day give him, in determining the invention of powder; the furious execution of which, renversing everything like thunder before it, has become a new ra to us of military improvements, changing so totally the nature of attacks and defences both by sea and land, and awakening so much art and skill in doing it, that the world cannot be too exact in ascertaining the precise time of its discovery, or too inquisitive in knowing what great man was the discoverer, and what occasions gave birth to it.\nI am far from controverting, continued my uncle _Toby_, what historians agree in, that in the year of our Lord 1380, under the reign of _Wencelaus_, son of _Charles_ the Fourth----a certain priest, whose name was _Schwartz_, show'd the use of powder to the _Venetians_, in their wars against the _Genoese_; but 'tis certain he was not the first; because if we are to believe Don _Pedro_, the bishop of _Leon_ --How came priests and bishops, an' please your honour, to trouble their heads so much about gunpowder? God knows, said my uncle _Toby_----his providence brings good out of everything--and he avers, in his chronicle of King _Alphonsus_, who reduced _Toledo_, That in the year 1343, which was full thirty-seven years before that time, the secret of powder was well known, and employed with success, both by Moors and Christians, not only in their sea-combats, at that period, but in many of their most memorable sieges in _Spain_ and _Barbary_ --And all the world knows, that Friar _Bacon_ had wrote expressly about it, and had generously given the world a receipt to make it by, above a hundred and fifty years before even _Schwartz_ was born --And that the _Chinese_, added my uncle _Toby_, embarrass us, and all accounts of it, still more, by boasting of the invention some hundreds of years even before him----\n--They are a pack of liars, I believe, cried _Trim_----\n----They are somehow or other deceived, said my uncle _Toby_, in this matter, as is plain to me from the present miserable state of military architecture amongst them; which consists of nothing more than a foss with a brick wall without flanks--and for what they gave us as a bastion at each angle of it, 'tis so barbarously constructed, that it looks for all the world ------------Like one of my seven castles, an' please your honour, quoth _Trim_.\nMy uncle _Toby_, tho' in the utmost distress for a comparison, most courteously refused _Trim's_ offer--till _Trim_ telling him, he had half a dozen more in _Bohemia_, which he knew not how to get off his hands----my uncle _Toby_ was so touch'd with the pleasantry of heart of the corporal----that he discontinued his dissertation upon gunpowder----and begged the corporal forthwith to go on with his story of the King of _Bohemia_ and his seven castles.\nTHE STORY OF THE KING OF BOHEMIA AND HIS SEVEN CASTLES, CONTINUED\nThis _unfortunate_ King of _Bohemia_, said _Trim_, ----Was he unfortunate, then? cried my uncle _Toby_, for he had been so wrapt up in his dissertation upon gunpowder, and other military affairs, that tho' he had desired the corporal to go on, yet the many interruptions he had given, dwelt not so strong upon his fancy as to account for the epithet ----Was he _unfortunate_, then, _Trim?_ said my uncle _Toby_, pathetically ----The corporal, wishing first the _word_ and all its synonimas at the devil, forthwith began to run back in his mind, the principal events in the King of _Bohemia's_ story; from every one of which, it appearing that he was the most fortunate man that ever existed in the world----it put the corporal to a stand: for not caring to retract his epithet----and less to explain it----and least of all, to twist his tale (like men of lore) to serve a system----he looked up in my uncle _Toby's_ face for assistance----but seeing it was the very thing my uncle _Toby_ sat in expectation of himself----after a hum and a haw, he went on------\nThe King of _Bohemia_, an' please your honour, replied the corporal, was _unfortunate_, as thus ----That taking great pleasure and delight in navigation and all sort of sea affairs----and there _happening_ throughout the whole kingdom of _Bohemia_, to be no seaport town whatever----\nHow the duce should there--_Trim?_ cried my uncle _Toby_; for _Bohemia_ being totally inland, it could have happen'd no otherwise ----It might, said _Trim_, if it had pleased God----\nMy uncle _Toby_ never spoke of the being and natural attributes of God, but with diffidence and hesitation----\n----I believe not, replied my uncle _Toby_, after some pause----for being inland, as I said, and having _Silesia_ and _Moravia_ to the east; _Lusatia_ and _Upper Saxony_ to the north; _Franconia_ to the west; _Bavaria_ to the south; _Bohemia_ could not have been propell'd to the sea without ceasing to be _Bohemia_----nor could the sea, on the other hand, have come up to _Bohemia_, without overflowing a great part of _Germany_, and destroying millions of unfortunate inhabitants who could make no defence against it ----Scandalous! cried _Trim_ --Which would bespeak, added my uncle _Toby_, mildly, such a want of compassion in him who is the father of it----that, I think, _Trim_----the thing could have happen'd no way.\nThe corporal made the bow of unfeigned conviction; and went on.\nNow the King of _Bohemia_ with his queen and courtiers _happening_ one fine summer's evening to walk out ----Aye! there the word _happening_ is right, _Trim_, cried my uncle _Toby_; for the King of _Bohemia_ and his queen might have walk'd out or let it alone: ----'twas a matter of contingency, which might happen, or not, just as chance ordered it.\nKing _William_ was of an opinion, an' please your honour, quoth _Trim_, that everything was predestined for us in this world; insomuch, that he would often say to his soldiers, that \"every ball had its billet.\" He was a great man, said my uncle _Toby_ ----And I believe, continued _Trim_, to this day, that the shot which disabled me at the battle of _Landen_, was pointed at my knee for no other purpose, but to take me out of his service, and place me in your honour's, where I should be taken so much better care of in my old age ----It shall never, _Trim_, be construed otherwise, said my uncle _Toby_.\nThe heart, both of the master and the man, were alike subject to sudden overflowings; ----a short silence ensued.\nBesides, said the corporal, resuming the discourse--but in a gayer accent----if it had not been for that single shot, I had never, an' please your honour, been in love------\nSo, thou wast once in love, _Trim!_ said my uncle _Toby_, smiling----\nSouse! replied the corporal--over head and ears! an' please your honour. Prithee when? where? --and how came it to pass? ----I never heard one word of it before; quoth my uncle _Toby_: ----I dare say, answered _Trim_, that every drummer and serjeant's son in the regiment knew of it ----It's high time I should----said my uncle _Toby_.\nYour honour remembers with concern, said the corporal, the total rout and confusion of our camp and army at the affair of _Landen_; every one was left to shift for himself; and if it had not been for the regiments of _Wyndham_, _Lumley_, and _Galway_, which covered the retreat over the bridge of _Neerspeeken_, the king himself could scarce have gained it----he was press'd hard, as your honour knows, on every side of him----\nGallant mortal! cried my uncle _Toby_, caught up with enthusiasm--this moment, now that all is lost, I see him galloping across me, corporal, to the left, to bring up the remains of the English horse along with him to support the right, and tear the laurel from _Luxembourg's_ brows, if yet 'tis possible ----I see him with the knot of his scarfe just shot off, infusing fresh spirits into poor _Galway's_ regiment--riding along the line--then wheeling about, and charging _Conti_ at the head of it ----Brave! brave, by heaven! cried my uncle _Toby_--he deserves a crown ----As richly, as a thief a halter; shouted _Trim_.\nMy uncle _Toby_ knew the corporal's loyalty; --otherwise the comparison was not at all to his mind----it did not altogether strike the corporal's fancy when he had made it----but it could not be recall'd----so he had nothing to do, but proceed.\nAs the number of wounded was prodigious, and no one had time to think of anything but his own safety --Though _Talmash_, said my uncle _Toby_, brought off the foot with great prudence ----But I was left upon the field, said the corporal. Thou wast so; poor fellow! replied my uncle _Toby_ ----So that it was noon the next day, continued the corporal, before I was exchanged, and put into a cart with thirteen or fourteen more, in order to be convey'd to our hospital.\nThere is no part of the body, an' please your honour, where a wound occasions more intolerable anguish than upon the knee----\nExcept the groin; said my uncle _Toby_. An' please your honour, replied the corporal, the knee, in my opinion, must certainly be the most acute, there being so many tendons and what-d'ye-call-'ems all about it.\nIt is for that reason, quoth my uncle _Toby_, that the groin is infinitely more sensible----there being not only as many tendons and what-d'ye-call-'ems (for I know their names as little as thou dost)----about it----but moreover * * *----\nMrs. _Wadman_, who had been all the time in her arbour--instantly stopp'd her breath--unpinn'd her mob at the chin, and stood up upon one leg----\nThe dispute was maintained with amicable and equal force betwixt my uncle _Toby_ and _Trim_ for some time; till _Trim_ at length recollecting that he had often cried at his master's sufferings, but never shed a tear at his own--was for giving up the point, which my uncle _Toby_ would not allow----'Tis a proof of nothing, _Trim_, said he, but the generosity of thy temper----\nSo that whether the pain of a wound in the groin (cteris paribus) is greater than the pain of a wound in the knee----or\nWhether the pain of a wound in the knee is not greater than the pain of a wound in the groin----are points which to this day remain unsettled.",
        "paragraph_chars": [
            [
                0,
                136
            ],
            [
                136,
                373
            ],
            [
                373,
                603
            ],
            [
                603,
                733
            ],
            [
                733,
                1041
            ],
            [
                1041,
                1329
            ],
            [
                1329,
                1474
            ],
            [
                1474,
                1620
            ],
            [
                1620,
                2299
            ],
            [
                2299,
                3300
            ],
            [
                3300,
                3355
            ],
            [
                3355,
                3399
            ],
            [
                3399,
                3665
            ],
            [
                3665,
                4286
            ],
            [
                4286,
                4384
            ],
            [
                4384,
                4443
            ],
            [
                4443,
                4546
            ],
            [
                4546,
                4716
            ],
            [
                4716,
                5163
            ],
            [
                5163,
                5229
            ],
            [
                5229,
                5344
            ],
            [
                5344,
                5417
            ],
            [
                5417,
                5572
            ],
            [
                5572,
                5632
            ],
            [
                5632,
                5715
            ],
            [
                5715,
                5946
            ],
            [
                5946,
                7012
            ],
            [
                7012,
                7254
            ],
            [
                7254,
                7320
            ],
            [
                7320,
                7421
            ],
            [
                7421,
                7911
            ],
            [
                7911,
                7956
            ],
            [
                7956,
                8203
            ],
            [
                8203,
                8512
            ],
            [
                8512,
                8578
            ],
            [
                8578,
                8752
            ],
            [
                8752,
                9088
            ],
            [
                9088,
                9880
            ],
            [
                9880,
                10976
            ],
            [
                10976,
                12702
            ],
            [
                12702,
                14025
            ],
            [
                14025,
                14081
            ],
            [
                14081,
                14531
            ],
            [
                14531,
                14986
            ],
            [
                14986,
                15052
            ],
            [
                15052,
                16113
            ],
            [
                16113,
                16397
            ],
            [
                16397,
                16580
            ],
            [
                16580,
                16691
            ],
            [
                16691,
                17416
            ],
            [
                17416,
                17480
            ],
            [
                17480,
                17831
            ],
            [
                17831,
                18438
            ],
            [
                18438,
                18552
            ],
            [
                18552,
                18726
            ],
            [
                18726,
                18796
            ],
            [
                18796,
                19132
            ],
            [
                19132,
                19560
            ],
            [
                19560,
                20183
            ],
            [
                20183,
                20428
            ],
            [
                20428,
                20896
            ],
            [
                20896,
                21022
            ],
            [
                21022,
                21233
            ],
            [
                21233,
                21472
            ],
            [
                21472,
                21618
            ],
            [
                21618,
                21995
            ],
            [
                21995,
                22115
            ],
            [
                22115,
                22257
            ]
        ],
        "segment_chars": [
            [
                0,
                136
            ],
            [
                136,
                373
            ],
            [
                373,
                603
            ],
            [
                603,
                733
            ],
            [
                733,
                798
            ],
            [
                798,
                1041
            ],
            [
                1041,
                1329
            ],
            [
                1329,
                1474
            ],
            [
                1474,
                1588
            ],
            [
                1588,
                1620
            ],
            [
                1620,
                2299
            ],
            [
                2299,
                3300
            ],
            [
                3300,
                3355
            ],
            [
                3355,
                3399
            ],
            [
                3399,
                3665
            ],
            [
                3665,
                4286
            ],
            [
                4286,
                4384
            ],
            [
                4384,
                4443
            ],
            [
                4443,
                4546
            ],
            [
                4546,
                4716
            ],
            [
                4716,
                5163
            ],
            [
                5163,
                5229
            ],
            [
                5229,
                5344
            ],
            [
                5344,
                5417
            ],
            [
                5417,
                5572
            ],
            [
                5572,
                5632
            ],
            [
                5632,
                5715
            ],
            [
                5715,
                5946
            ],
            [
                5946,
                7012
            ],
            [
                7012,
                7254
            ],
            [
                7254,
                7320
            ],
            [
                7320,
                7421
            ],
            [
                7421,
                7911
            ],
            [
                7911,
                7956
            ],
            [
                7956,
                8203
            ],
            [
                8203,
                8357
            ],
            [
                8357,
                8512
            ],
            [
                8512,
                8578
            ],
            [
                8578,
                8752
            ],
            [
                8752,
                9048
            ],
            [
                9048,
                9088
            ],
            [
                9088,
                9351
            ],
            [
                9351,
                9880
            ],
            [
                9880,
                10976
            ],
            [
                10976,
                11963
            ],
            [
                11963,
                12702
            ],
            [
                12702,
                13215
            ],
            [
                13215,
                14025
            ],
            [
                14025,
                14081
            ],
            [
                14081,
                14531
            ],
            [
                14531,
                14986
            ],
            [
                14986,
                15052
            ],
            [
                15052,
                15133
            ],
            [
                15133,
                16113
            ],
            [
                16113,
                16397
            ],
            [
                16397,
                16580
            ],
            [
                16580,
                16691
            ],
            [
                16691,
                17226
            ],
            [
                17226,
                17416
            ],
            [
                17416,
                17480
            ],
            [
                17480,
                17594
            ],
            [
                17594,
                17831
            ],
            [
                17831,
                18042
            ],
            [
                18042,
                18438
            ],
            [
                18438,
                18552
            ],
            [
                18552,
                18726
            ],
            [
                18726,
                18796
            ],
            [
                18796,
                18803
            ],
            [
                18803,
                18845
            ],
            [
                18845,
                18869
            ],
            [
                18869,
                18883
            ],
            [
                18883,
                18890
            ],
            [
                18890,
                18917
            ],
            [
                18917,
                19132
            ],
            [
                19132,
                19560
            ],
            [
                19560,
                19576
            ],
            [
                19576,
                20070
            ],
            [
                20070,
                20088
            ],
            [
                20088,
                20183
            ],
            [
                20183,
                20428
            ],
            [
                20428,
                20666
            ],
            [
                20666,
                20693
            ],
            [
                20693,
                20896
            ],
            [
                20896,
                21022
            ],
            [
                21022,
                21062
            ],
            [
                21062,
                21233
            ],
            [
                21233,
                21472
            ],
            [
                21472,
                21618
            ],
            [
                21618,
                21995
            ],
            [
                21995,
                22115
            ],
            [
                22115,
                22257
            ]
        ],
        "overlap_chars": [
            [
                48,
                49
            ],
            [
                0,
                24
            ],
            [
                28,
                44
            ],
            [
                70,
                87
            ],
            [
                92,
                101
            ],
            [
                112,
                131
            ],
            [
                298,
                299
            ],
            [
                136,
                145
            ],
            [
                147,
                161
            ],
            [
                145,
                146
            ],
            [
                197,
                242
            ],
            [
                252,
                273
            ],
            [
                278,
                295
            ],
            [
                307,
                318
            ],
            [
                320,
                340
            ],
            [
                371,
                372
            ],
            [
                606,
                631
            ],
            [
                643,
                678
            ],
            [
                682,
                726
            ],
            [
                742,
                752
            ],
            [
                776,
                789
            ],
            [
                808,
                831
            ],
            [
                832,
                834
            ],
            [
                874,
                890
            ],
            [
                906,
                945
            ],
            [
                993,
                1024
            ],
            [
                806,
                807
            ],
            [
                1025,
                1036
            ],
            [
                1050,
                1073
            ],
            [
                1082,
                1095
            ],
            [
                1159,
                1161
            ],
            [
                1080,
                1081
            ],
            [
                1104,
                1107
            ],
            [
                1186,
                1192
            ],
            [
                1200,
                1288
            ],
            [
                1102,
                1103
            ],
            [
                1172,
                1173
            ],
            [
                1144,
                1148
            ],
            [
                1295,
                1324
            ],
            [
                1344,
                1345
            ],
            [
                1333,
                1341
            ],
            [
                1353,
                1381
            ],
            [
                1383,
                1420
            ],
            [
                1421,
                1422
            ],
            [
                1425,
                1469
            ],
            [
                1474,
                1487
            ],
            [
                1504,
                1509
            ],
            [
                1541,
                1554
            ],
            [
                1519,
                1532
            ],
            [
                1556,
                1588
            ],
            [
                1625,
                1632
            ],
            [
                1767,
                1798
            ],
            [
                2221,
                2224
            ],
            [
                1906,
                1910
            ],
            [
                1911,
                1913
            ],
            [
                1816,
                1817
            ],
            [
                1914,
                1924
            ],
            [
                1799,
                1801
            ],
            [
                2225,
                2227
            ],
            [
                1974,
                1983
            ],
            [
                1986,
                1991
            ],
            [
                1996,
                2008
            ],
            [
                2010,
                2030
            ],
            [
                2033,
                2063
            ],
            [
                2066,
                2071
            ],
            [
                2077,
                2091
            ],
            [
                2103,
                2116
            ],
            [
                2121,
                2138
            ],
            [
                2140,
                2161
            ],
            [
                2162,
                2195
            ],
            [
                1620,
                1621
            ],
            [
                2210,
                2220
            ],
            [
                1884,
                1885
            ],
            [
                2273,
                2290
            ],
            [
                2247,
                2261
            ],
            [
                2299,
                2320
            ],
            [
                2330,
                2352
            ],
            [
                2356,
                2360
            ],
            [
                2393,
                2411
            ],
            [
                2413,
                2420
            ],
            [
                2422,
                2436
            ],
            [
                2530,
                2567
            ],
            [
                2485,
                2528
            ],
            [
                2592,
                2600
            ],
            [
                2611,
                2637
            ],
            [
                2669,
                2701
            ],
            [
                2771,
                2774
            ],
            [
                2832,
                2836
            ],
            [
                2874,
                2882
            ],
            [
                2391,
                2392
            ],
            [
                2959,
                2965
            ],
            [
                2993,
                2997
            ],
            [
                3005,
                3008
            ],
            [
                2824,
                2831
            ],
            [
                3026,
                3056
            ],
            [
                3124,
                3136
            ],
            [
                2657,
                2660
            ],
            [
                2464,
                2465
            ],
            [
                3233,
                3235
            ],
            [
                3286,
                3300
            ],
            [
                3300,
                3355
            ],
            [
                3361,
                3385
            ],
            [
                3455,
                3463
            ],
            [
                3471,
                3478
            ],
            [
                3402,
                3414
            ],
            [
                3483,
                3490
            ],
            [
                3453,
                3454
            ],
            [
                3428,
                3431
            ],
            [
                3573,
                3580
            ],
            [
                3531,
                3532
            ],
            [
                3582,
                3585
            ],
            [
                3650,
                3663
            ],
            [
                3847,
                3871
            ],
            [
                4078,
                4079
            ],
            [
                3892,
                3910
            ],
            [
                3911,
                3935
            ],
            [
                3937,
                3941
            ],
            [
                3951,
                3966
            ],
            [
                3976,
                4010
            ],
            [
                4011,
                4017
            ],
            [
                4047,
                4073
            ],
            [
                4083,
                4090
            ],
            [
                3415,
                3418
            ],
            [
                4097,
                4110
            ],
            [
                4116,
                4119
            ],
            [
                4200,
                4204
            ],
            [
                4211,
                4246
            ],
            [
                4256,
                4286
            ],
            [
                4359,
                4379
            ],
            [
                4326,
                4340
            ],
            [
                4324,
                4325
            ],
            [
                4290,
                4291
            ],
            [
                4349,
                4353
            ],
            [
                4386,
                4407
            ],
            [
                4415,
                4439
            ],
            [
                4447,
                4462
            ],
            [
                4476,
                4478
            ],
            [
                4464,
                4468
            ],
            [
                4483,
                4512
            ],
            [
                4514,
                4518
            ],
            [
                4462,
                4463
            ],
            [
                4527,
                4544
            ],
            [
                4552,
                4557
            ],
            [
                4599,
                4619
            ],
            [
                4576,
                4590
            ],
            [
                4635,
                4637
            ],
            [
                4714,
                4716
            ],
            [
                4716,
                4740
            ],
            [
                4779,
                4825
            ],
            [
                4846,
                4873
            ],
            [
                4908,
                4917
            ],
            [
                4773,
                4778
            ],
            [
                5102,
                5114
            ],
            [
                5161,
                5163
            ],
            [
                5163,
                5229
            ],
            [
                5235,
                5256
            ],
            [
                5258,
                5265
            ],
            [
                5266,
                5286
            ],
            [
                5302,
                5339
            ],
            [
                5344,
                5362
            ],
            [
                5370,
                5371
            ],
            [
                5394,
                5408
            ],
            [
                5380,
                5382
            ],
            [
                5456,
                5457
            ],
            [
                5421,
                5452
            ],
            [
                5478,
                5527
            ],
            [
                5530,
                5546
            ],
            [
                5559,
                5567
            ],
            [
                5572,
                5608
            ],
            [
                5610,
                5623
            ],
            [
                5644,
                5645
            ],
            [
                5636,
                5641
            ],
            [
                5653,
                5687
            ],
            [
                5692,
                5698
            ],
            [
                5720,
                5732
            ],
            [
                5739,
                5743
            ],
            [
                5783,
                5796
            ],
            [
                5887,
                5891
            ],
            [
                5896,
                5904
            ],
            [
                5934,
                5941
            ],
            [
                5808,
                5816
            ],
            [
                5912,
                5914
            ],
            [
                5833,
                5843
            ],
            [
                5946,
                5978
            ],
            [
                6014,
                6067
            ],
            [
                6069,
                6075
            ],
            [
                6077,
                6087
            ],
            [
                6135,
                6142
            ],
            [
                6252,
                6281
            ],
            [
                6296,
                6321
            ],
            [
                6179,
                6180
            ],
            [
                6349,
                6471
            ],
            [
                6900,
                6901
            ],
            [
                6479,
                6487
            ],
            [
                6108,
                6110
            ],
            [
                6505,
                6561
            ],
            [
                6563,
                6638
            ],
            [
                6650,
                6654
            ],
            [
                6644,
                6649
            ],
            [
                6922,
                6923
            ],
            [
                6656,
                6700
            ],
            [
                6702,
                6712
            ],
            [
                6714,
                6732
            ],
            [
                6741,
                6764
            ],
            [
                6794,
                6810
            ],
            [
                6816,
                6839
            ],
            [
                5986,
                5987
            ],
            [
                6937,
                6962
            ],
            [
                7023,
                7031
            ],
            [
                7106,
                7124
            ],
            [
                7134,
                7158
            ],
            [
                7173,
                7242
            ],
            [
                7244,
                7251
            ],
            [
                7254,
                7320
            ],
            [
                7320,
                7343
            ],
            [
                7381,
                7416
            ],
            [
                7428,
                7444
            ],
            [
                7453,
                7467
            ],
            [
                7425,
                7427
            ],
            [
                7451,
                7452
            ],
            [
                7476,
                7512
            ],
            [
                7518,
                7602
            ],
            [
                7607,
                7617
            ],
            [
                7821,
                7825
            ],
            [
                7641,
                7653
            ],
            [
                7659,
                7662
            ],
            [
                7735,
                7738
            ],
            [
                7748,
                7760
            ],
            [
                7770,
                7786
            ],
            [
                7474,
                7475
            ],
            [
                7786,
                7808
            ],
            [
                7875,
                7879
            ],
            [
                7894,
                7906
            ],
            [
                7931,
                7932
            ],
            [
                7924,
                7928
            ],
            [
                7940,
                7951
            ],
            [
                7961,
                7981
            ],
            [
                7983,
                7999
            ],
            [
                7960,
                7961
            ],
            [
                8010,
                8080
            ],
            [
                7981,
                7982
            ],
            [
                8081,
                8098
            ],
            [
                8105,
                8115
            ],
            [
                8138,
                8198
            ],
            [
                8220,
                8221
            ],
            [
                8207,
                8211
            ],
            [
                8242,
                8250
            ],
            [
                8254,
                8296
            ],
            [
                8298,
                8303
            ],
            [
                8347,
                8350
            ],
            [
                8216,
                8217
            ],
            [
                8357,
                8370
            ],
            [
                8379,
                8423
            ],
            [
                8441,
                8471
            ],
            [
                8492,
                8500
            ],
            [
                8510,
                8512
            ],
            [
                8512,
                8578
            ],
            [
                8584,
                8611
            ],
            [
                8613,
                8649
            ],
            [
                8611,
                8612
            ],
            [
                8720,
                8737
            ],
            [
                8739,
                8746
            ],
            [
                9027,
                9028
            ],
            [
                8756,
                8784
            ],
            [
                8793,
                8807
            ],
            [
                8791,
                8792
            ],
            [
                8854,
                8860
            ],
            [
                8838,
                8853
            ],
            [
                8861,
                8889
            ],
            [
                9043,
                9044
            ],
            [
                8949,
                8996
            ],
            [
                9121,
                9135
            ],
            [
                9145,
                9148
            ],
            [
                9119,
                9120
            ],
            [
                9291,
                9295
            ],
            [
                9212,
                9219
            ],
            [
                9228,
                9232
            ],
            [
                9236,
                9257
            ],
            [
                9328,
                9349
            ],
            [
                9351,
                9368
            ],
            [
                9751,
                9752
            ],
            [
                9570,
                9571
            ],
            [
                9461,
                9493
            ],
            [
                9530,
                9532
            ],
            [
                9497,
                9507
            ],
            [
                9494,
                9496
            ],
            [
                9508,
                9519
            ],
            [
                9525,
                9529
            ],
            [
                9547,
                9566
            ],
            [
                9592,
                9602
            ],
            [
                9639,
                9662
            ],
            [
                9672,
                9695
            ],
            [
                9753,
                9766
            ],
            [
                9801,
                9814
            ],
            [
                9840,
                9856
            ],
            [
                9390,
                9392
            ],
            [
                10468,
                10474
            ],
            [
                9909,
                9919
            ],
            [
                9920,
                9921
            ],
            [
                9930,
                9943
            ],
            [
                9950,
                9951
            ],
            [
                9974,
                9975
            ],
            [
                9959,
                9972
            ],
            [
                10241,
                10243
            ],
            [
                9979,
                9981
            ],
            [
                9991,
                10054
            ],
            [
                10106,
                10137
            ],
            [
                10148,
                10155
            ],
            [
                9928,
                9929
            ],
            [
                10059,
                10062
            ],
            [
                10177,
                10184
            ],
            [
                10346,
                10349
            ],
            [
                10189,
                10194
            ],
            [
                10055,
                10058
            ],
            [
                10413,
                10420
            ],
            [
                10427,
                10436
            ],
            [
                10142,
                10147
            ],
            [
                10438,
                10452
            ],
            [
                10233,
                10234
            ],
            [
                10292,
                10309
            ],
            [
                10595,
                10602
            ],
            [
                10608,
                10638
            ],
            [
                9972,
                9973
            ],
            [
                10656,
                10662
            ],
            [
                10684,
                10693
            ],
            [
                10717,
                10870
            ],
            [
                10893,
                10976
            ],
            [
                11121,
                11124
            ],
            [
                10982,
                10986
            ],
            [
                11014,
                11032
            ],
            [
                10987,
                10989
            ],
            [
                11039,
                11068
            ],
            [
                11139,
                11144
            ],
            [
                11126,
                11137
            ],
            [
                11145,
                11175
            ],
            [
                11190,
                11194
            ],
            [
                11082,
                11084
            ],
            [
                11200,
                11207
            ],
            [
                11320,
                11321
            ],
            [
                11196,
                11198
            ],
            [
                11342,
                11349
            ],
            [
                11771,
                11774
            ],
            [
                11371,
                11382
            ],
            [
                11208,
                11214
            ],
            [
                11225,
                11227
            ],
            [
                11503,
                11516
            ],
            [
                11350,
                11351
            ],
            [
                11817,
                11820
            ],
            [
                11307,
                11309
            ],
            [
                11549,
                11555
            ],
            [
                11556,
                11627
            ],
            [
                11629,
                11635
            ],
            [
                11383,
                11384
            ],
            [
                11185,
                11188
            ],
            [
                11651,
                11655
            ],
            [
                11665,
                11708
            ],
            [
                11789,
                11805
            ],
            [
                11807,
                11815
            ],
            [
                11830,
                11831
            ],
            [
                11837,
                11852
            ],
            [
                11862,
                11898
            ],
            [
                11930,
                11949
            ],
            [
                11967,
                11973
            ],
            [
                11975,
                11985
            ],
            [
                11986,
                11994
            ],
            [
                12003,
                12021
            ],
            [
                12356,
                12358
            ],
            [
                12448,
                12450
            ],
            [
                12028,
                12048
            ],
            [
                12001,
                12002
            ],
            [
                12075,
                12079
            ],
            [
                12095,
                12103
            ],
            [
                12233,
                12236
            ],
            [
                12106,
                12168
            ],
            [
                12237,
                12249
            ],
            [
                12250,
                12257
            ],
            [
                12176,
                12181
            ],
            [
                12336,
                12339
            ],
            [
                12347,
                12352
            ],
            [
                12362,
                12442
            ],
            [
                12512,
                12538
            ],
            [
                12603,
                12648
            ],
            [
                12585,
                12588
            ],
            [
                12653,
                12663
            ],
            [
                12700,
                12702
            ],
            [
                13145,
                13146
            ],
            [
                12702,
                12715
            ],
            [
                12731,
                12749
            ],
            [
                12729,
                12730
            ],
            [
                12758,
                12779
            ],
            [
                12782,
                12800
            ],
            [
                12813,
                12817
            ],
            [
                12882,
                12898
            ],
            [
                12916,
                12924
            ],
            [
                12934,
                12944
            ],
            [
                12945,
                12958
            ],
            [
                12960,
                12969
            ],
            [
                12970,
                12997
            ],
            [
                12999,
                13006
            ],
            [
                13007,
                13080
            ],
            [
                13082,
                13087
            ],
            [
                13088,
                13103
            ],
            [
                13113,
                13142
            ],
            [
                13154,
                13213
            ],
            [
                13215,
                13224
            ],
            [
                13226,
                13239
            ],
            [
                13775,
                13777
            ],
            [
                13786,
                13788
            ],
            [
                13414,
                13415
            ],
            [
                13300,
                13334
            ],
            [
                13340,
                13345
            ],
            [
                13368,
                13377
            ],
            [
                13387,
                13391
            ],
            [
                13445,
                13458
            ],
            [
                13459,
                13485
            ],
            [
                13495,
                13538
            ],
            [
                13548,
                13569
            ],
            [
                13296,
                13299
            ],
            [
                13601,
                13631
            ],
            [
                13633,
                13638
            ],
            [
                13640,
                13643
            ],
            [
                13649,
                13652
            ],
            [
                13656,
                13679
            ],
            [
                13681,
                13691
            ],
            [
                13700,
                13709
            ],
            [
                13720,
                13729
            ],
            [
                13796,
                13828
            ],
            [
                13835,
                13843
            ],
            [
                13845,
                13853
            ],
            [
                13856,
                13868
            ],
            [
                13870,
                13877
            ],
            [
                13880,
                13894
            ],
            [
                13224,
                13225
            ],
            [
                13913,
                13915
            ],
            [
                13941,
                13981
            ],
            [
                13987,
                14020
            ],
            [
                14032,
                14051
            ],
            [
                14064,
                14069
            ],
            [
                14090,
                14093
            ],
            [
                14111,
                14119
            ],
            [
                14143,
                14157
            ],
            [
                14121,
                14134
            ],
            [
                14171,
                14173
            ],
            [
                14384,
                14387
            ],
            [
                14159,
                14170
            ],
            [
                14177,
                14324
            ],
            [
                14326,
                14329
            ],
            [
                14355,
                14356
            ],
            [
                14357,
                14372
            ],
            [
                14119,
                14120
            ],
            [
                14391,
                14450
            ],
            [
                14495,
                14496
            ],
            [
                14463,
                14492
            ],
            [
                14504,
                14515
            ],
            [
                14517,
                14522
            ],
            [
                14531,
                14539
            ],
            [
                14546,
                14547
            ],
            [
                14580,
                14618
            ],
            [
                14624,
                14626
            ],
            [
                14628,
                14633
            ],
            [
                14647,
                14658
            ],
            [
                14660,
                14687
            ],
            [
                14689,
                14696
            ],
            [
                14697,
                14741
            ],
            [
                14745,
                14753
            ],
            [
                14761,
                14767
            ],
            [
                14776,
                14780
            ],
            [
                14808,
                14820
            ],
            [
                14824,
                14831
            ],
            [
                14845,
                14848
            ],
            [
                14862,
                14876
            ],
            [
                14658,
                14659
            ],
            [
                14880,
                14890
            ],
            [
                14914,
                14937
            ],
            [
                14984,
                14986
            ],
            [
                14986,
                15052
            ],
            [
                15071,
                15078
            ],
            [
                15080,
                15087
            ],
            [
                15090,
                15094
            ],
            [
                15107,
                15131
            ],
            [
                15133,
                15147
            ],
            [
                15286,
                15288
            ],
            [
                15481,
                15502
            ],
            [
                15300,
                15303
            ],
            [
                15514,
                15518
            ],
            [
                15542,
                15555
            ],
            [
                15566,
                15595
            ],
            [
                15597,
                15632
            ],
            [
                15634,
                15643
            ],
            [
                15645,
                15656
            ],
            [
                15670,
                15675
            ],
            [
                15677,
                15679
            ],
            [
                15690,
                15724
            ],
            [
                15743,
                15755
            ],
            [
                15759,
                15761
            ],
            [
                15273,
                15285
            ],
            [
                15184,
                15190
            ],
            [
                15789,
                15816
            ],
            [
                15390,
                15393
            ],
            [
                15836,
                15854
            ],
            [
                15858,
                15893
            ],
            [
                15934,
                15943
            ],
            [
                15947,
                15958
            ],
            [
                15375,
                15377
            ],
            [
                15964,
                15966
            ],
            [
                15968,
                15976
            ],
            [
                15154,
                15155
            ],
            [
                15991,
                16001
            ],
            [
                15447,
                15455
            ],
            [
                15779,
                15781
            ],
            [
                16062,
                16069
            ],
            [
                15218,
                15219
            ],
            [
                16073,
                16106
            ],
            [
                16117,
                16124
            ],
            [
                16126,
                16133
            ],
            [
                16168,
                16181
            ],
            [
                16138,
                16139
            ],
            [
                16182,
                16185
            ],
            [
                16213,
                16239
            ],
            [
                16252,
                16293
            ],
            [
                16297,
                16306
            ],
            [
                16319,
                16350
            ],
            [
                16352,
                16359
            ],
            [
                16362,
                16392
            ],
            [
                16397,
                16404
            ],
            [
                16410,
                16422
            ],
            [
                16539,
                16540
            ],
            [
                16432,
                16446
            ],
            [
                16453,
                16454
            ],
            [
                16455,
                16458
            ],
            [
                16460,
                16467
            ],
            [
                16469,
                16504
            ],
            [
                16514,
                16526
            ],
            [
                16534,
                16539
            ],
            [
                16541,
                16545
            ],
            [
                16552,
                16553
            ],
            [
                16554,
                16575
            ],
            [
                16580,
                16588
            ],
            [
                16596,
                16610
            ],
            [
                16647,
                16650
            ],
            [
                16661,
                16671
            ],
            [
                16695,
                16708
            ],
            [
                16710,
                16717
            ],
            [
                16733,
                16740
            ],
            [
                16746,
                16751
            ],
            [
                16898,
                16899
            ],
            [
                16755,
                16758
            ],
            [
                16788,
                16794
            ],
            [
                16796,
                16803
            ],
            [
                16805,
                16808
            ],
            [
                16810,
                16817
            ],
            [
                16819,
                16831
            ],
            [
                16833,
                16840
            ],
            [
                16842,
                16845
            ],
            [
                16847,
                16859
            ],
            [
                16861,
                16874
            ],
            [
                16880,
                16885
            ],
            [
                16887,
                16898
            ],
            [
                16782,
                16787
            ],
            [
                16901,
                16908
            ],
            [
                16910,
                16922
            ],
            [
                16708,
                16709
            ],
            [
                16925,
                16932
            ],
            [
                16934,
                16953
            ],
            [
                16964,
                16996
            ],
            [
                16998,
                17005
            ],
            [
                17010,
                17027
            ],
            [
                17048,
                17063
            ],
            [
                17065,
                17072
            ],
            [
                17073,
                17110
            ],
            [
                17120,
                17148
            ],
            [
                17191,
                17198
            ],
            [
                17161,
                17172
            ],
            [
                17241,
                17252
            ],
            [
                17293,
                17299
            ],
            [
                17305,
                17329
            ],
            [
                17347,
                17349
            ],
            [
                17353,
                17357
            ],
            [
                17359,
                17367
            ],
            [
                17260,
                17261
            ],
            [
                17378,
                17393
            ],
            [
                17408,
                17414
            ],
            [
                17399,
                17405
            ],
            [
                17416,
                17444
            ],
            [
                17455,
                17480
            ],
            [
                17480,
                17495
            ],
            [
                17497,
                17504
            ],
            [
                17506,
                17534
            ],
            [
                17547,
                17584
            ],
            [
                17589,
                17594
            ],
            [
                17594,
                17608
            ],
            [
                17621,
                17630
            ],
            [
                17639,
                17653
            ],
            [
                17660,
                17661
            ],
            [
                17662,
                17677
            ],
            [
                17679,
                17686
            ],
            [
                17688,
                17712
            ],
            [
                17720,
                17726
            ],
            [
                17799,
                17802
            ],
            [
                17739,
                17740
            ],
            [
                17745,
                17762
            ],
            [
                17812,
                17818
            ],
            [
                17867,
                17868
            ],
            [
                17831,
                17835
            ],
            [
                17837,
                17844
            ],
            [
                17846,
                17852
            ],
            [
                17856,
                17864
            ],
            [
                17876,
                17887
            ],
            [
                17889,
                17894
            ],
            [
                17887,
                17888
            ],
            [
                17903,
                17956
            ],
            [
                17967,
                18019
            ],
            [
                18025,
                18041
            ],
            [
                18042,
                18060
            ],
            [
                18062,
                18075
            ],
            [
                18120,
                18122
            ],
            [
                18087,
                18100
            ],
            [
                18102,
                18111
            ],
            [
                18060,
                18061
            ],
            [
                18133,
                18181
            ],
            [
                18183,
                18189
            ],
            [
                18190,
                18243
            ],
            [
                18276,
                18301
            ],
            [
                18263,
                18270
            ],
            [
                18301,
                18363
            ],
            [
                18100,
                18101
            ],
            [
                18416,
                18429
            ],
            [
                18449,
                18453
            ],
            [
                18481,
                18485
            ],
            [
                18454,
                18456
            ],
            [
                18503,
                18523
            ],
            [
                18528,
                18552
            ],
            [
                18685,
                18686
            ],
            [
                18552,
                18559
            ],
            [
                18566,
                18578
            ],
            [
                18559,
                18560
            ],
            [
                18629,
                18671
            ],
            [
                18676,
                18681
            ],
            [
                18707,
                18719
            ],
            [
                18728,
                18753
            ],
            [
                18762,
                18775
            ],
            [
                18782,
                18791
            ],
            [
                18830,
                18834
            ],
            [
                18825,
                18829
            ],
            [
                18843,
                18845
            ],
            [
                18856,
                18867
            ],
            [
                18869,
                18883
            ],
            [
                18883,
                18890
            ],
            [
                18892,
                18917
            ],
            [
                18921,
                18956
            ],
            [
                18958,
                18972
            ],
            [
                18985,
                18995
            ],
            [
                18997,
                19005
            ],
            [
                18995,
                18996
            ],
            [
                19014,
                19032
            ],
            [
                19052,
                19078
            ],
            [
                19083,
                19099
            ],
            [
                19110,
                19123
            ],
            [
                19132,
                19153
            ],
            [
                19187,
                19222
            ],
            [
                19232,
                19239
            ],
            [
                19255,
                19261
            ],
            [
                19262,
                19263
            ],
            [
                19274,
                19348
            ],
            [
                19352,
                19357
            ],
            [
                19166,
                19167
            ],
            [
                19364,
                19367
            ],
            [
                19368,
                19373
            ],
            [
                19375,
                19381
            ],
            [
                19382,
                19409
            ],
            [
                19442,
                19488
            ],
            [
                19492,
                19498
            ],
            [
                19507,
                19533
            ],
            [
                19560,
                19574
            ],
            [
                19576,
                19590
            ],
            [
                19702,
                19704
            ],
            [
                19597,
                19598
            ],
            [
                19609,
                19624
            ],
            [
                19851,
                19852
            ],
            [
                19661,
                19680
            ],
            [
                19715,
                19753
            ],
            [
                19795,
                19821
            ],
            [
                19823,
                19835
            ],
            [
                19837,
                19842
            ],
            [
                19869,
                19878
            ],
            [
                19983,
                19997
            ],
            [
                19999,
                20032
            ],
            [
                20034,
                20039
            ],
            [
                20041,
                20058
            ],
            [
                20068,
                20070
            ],
            [
                20070,
                20088
            ],
            [
                20111,
                20130
            ],
            [
                20135,
                20165
            ],
            [
                20167,
                20174
            ],
            [
                20183,
                20191
            ],
            [
                20408,
                20410
            ],
            [
                20199,
                20227
            ],
            [
                20240,
                20276
            ],
            [
                20314,
                20326
            ],
            [
                20285,
                20287
            ],
            [
                20413,
                20414
            ],
            [
                20358,
                20377
            ],
            [
                20390,
                20395
            ],
            [
                20426,
                20428
            ],
            [
                20428,
                20528
            ],
            [
                20547,
                20548
            ],
            [
                20620,
                20645
            ],
            [
                20664,
                20666
            ],
            [
                20729,
                20753
            ],
            [
                20779,
                20791
            ],
            [
                20807,
                20854
            ],
            [
                20864,
                20869
            ],
            [
                20879,
                20881
            ],
            [
                20886,
                20895
            ],
            [
                20896,
                20925
            ],
            [
                20937,
                20963
            ],
            [
                20974,
                21017
            ],
            [
                21022,
                21038
            ],
            [
                21040,
                21053
            ],
            [
                21062,
                21084
            ],
            [
                21086,
                21107
            ],
            [
                21108,
                21222
            ],
            [
                21229,
                21231
            ],
            [
                21233,
                21254
            ],
            [
                21256,
                21270
            ],
            [
                21254,
                21255
            ],
            [
                21279,
                21312
            ],
            [
                21325,
                21345
            ],
            [
                21354,
                21385
            ],
            [
                21449,
                21467
            ],
            [
                21472,
                21476
            ],
            [
                21478,
                21484
            ],
            [
                21485,
                21503
            ],
            [
                21508,
                21526
            ],
            [
                21546,
                21556
            ],
            [
                21567,
                21574
            ],
            [
                21586,
                21597
            ],
            [
                21601,
                21613
            ],
            [
                21618,
                21629
            ],
            [
                21645,
                21691
            ],
            [
                21699,
                21702
            ],
            [
                21723,
                21729
            ],
            [
                21737,
                21844
            ],
            [
                21947,
                21948
            ],
            [
                21630,
                21633
            ],
            [
                21861,
                21889
            ],
            [
                21897,
                21912
            ],
            [
                21917,
                21920
            ],
            [
                21923,
                21940
            ],
            [
                21949,
                21957
            ],
            [
                21916,
                21917
            ],
            [
                21958,
                21961
            ],
            [
                21980,
                21983
            ],
            [
                21966,
                21976
            ],
            [
                21995,
                21997
            ],
            [
                22003,
                22043
            ],
            [
                22061,
                22108
            ],
            [
                22112,
                22114
            ],
            [
                22228,
                22239
            ],
            [
                22247,
                22257
            ]
        ],
        "row_chars": [
            [
                0,
                136
            ],
            [
                136,
                373
            ],
            [
                373,
                603
            ],
            [
                603,
                733
            ],
            [
                733,
                798
            ],
            [
                798,
                1041
            ],
            [
                1041,
                1329
            ],
            [
                1329,
                1474
            ],
            [
                1474,
                1588
            ],
            [
                1588,
                1620
            ],
            [
                1620,
                2299
            ],
            [
                2299,
                3300
            ],
            [
                3300,
                3355
            ],
            [
                3355,
                3399
            ],
            [
                3399,
                4286
            ],
            [
                4286,
                4443
            ],
            [
                4443,
                4546
            ],
            [
                4546,
                4716
            ],
            [
                4716,
                5163
            ],
            [
                5163,
                5229
            ],
            [
                5229,
                5344
            ],
            [
                5344,
                5417
            ],
            [
                5417,
                5572
            ],
            [
                5572,
                5632
            ],
            [
                5632,
                5715
            ],
            [
                5715,
                5946
            ],
            [
                5946,
                7254
            ],
            [
                7254,
                7320
            ],
            [
                7320,
                7421
            ],
            [
                7421,
                7911
            ],
            [
                7911,
                7956
            ],
            [
                7956,
                8203
            ],
            [
                8203,
                8357
            ],
            [
                8357,
                8512
            ],
            [
                8512,
                8578
            ],
            [
                8578,
                8752
            ],
            [
                8752,
                9048
            ],
            [
                9048,
                9088
            ],
            [
                9088,
                9351
            ],
            [
                9351,
                9880
            ],
            [
                9880,
                10976
            ],
            [
                10976,
                11963
            ],
            [
                11963,
                12702
            ],
            [
                12702,
                13215
            ],
            [
                13215,
                14025
            ],
            [
                14025,
                14081
            ],
            [
                14081,
                14531
            ],
            [
                14531,
                14986
            ],
            [
                14986,
                15052
            ],
            [
                15052,
                15133
            ],
            [
                15133,
                16113
            ],
            [
                16113,
                16397
            ],
            [
                16397,
                16580
            ],
            [
                16580,
                16691
            ],
            [
                16691,
                17226
            ],
            [
                17226,
                17416
            ],
            [
                17416,
                17480
            ],
            [
                17480,
                17594
            ],
            [
                17594,
                17831
            ],
            [
                17831,
                18042
            ],
            [
                18042,
                18438
            ],
            [
                18438,
                18552
            ],
            [
                18552,
                18726
            ],
            [
                18726,
                18796
            ],
            [
                18796,
                18803
            ],
            [
                18803,
                18845
            ],
            [
                18845,
                18869
            ],
            [
                18869,
                18883
            ],
            [
                18883,
                18890
            ],
            [
                18890,
                18917
            ],
            [
                18917,
                19132
            ],
            [
                19132,
                19560
            ],
            [
                19560,
                19576
            ],
            [
                19576,
                20070
            ],
            [
                20070,
                20088
            ],
            [
                20088,
                20183
            ],
            [
                20183,
                20428
            ],
            [
                20428,
                20666
            ],
            [
                20666,
                20693
            ],
            [
                20693,
                20896
            ],
            [
                20896,
                21022
            ],
            [
                21022,
                21062
            ],
            [
                21062,
                21233
            ],
            [
                21233,
                21472
            ],
            [
                21472,
                21618
            ],
            [
                21618,
                21995
            ],
            [
                21995,
                22257
            ]
        ]
    },
    "abridged": {
        "text": "'It was a thousand pities - though I believe I am going to say a foolish thing for a soldier-'\n'A soldier,' cried my uncle Toby, 'is no more exempt from saying a foolish thing than a man of letters.'\n'But not so often, your honour,' replied the corporal. '-It was a thousand pities, your honour, to destroy these works - and a thousand pities to have let them stood.'\n'Thou art right, Trim,' said my uncle.\n'This,' continued the corporal, 'is why during their demolition I have never once whistled, or sung, or laughed, or told your honour one story, good or bad-'\n'Thou hast many excellencies, Trim,' said my uncle Toby, 'and of the stories thou hast told me, either to amuse me in my painful hours, or divert me in my grave ones, - thou hast seldom told me a bad one.'\n'Because, your honour, except one of a King of Bohemia and his seven castles, they are all true; for they are about myself.'\n'I do not like them worse on that score,' said my uncle Toby. 'But prithee what is this story? Tell it - provided it is not a merry one; for I am not in a mood at present to do it justice.'\n'It is not merry by any means,' replied the corporal.\n'Nor would I have it altogether grave,' added my uncle Toby.\n'It is neither one nor the other,' replied the corporal, 'but will suit your honour exactly.'\n'I thank thee; prithee begin it, Trim,' cried my uncle Toby.\nThe corporal made his bow; and though it is not easy to pull off a lank Montero-cap with grace - nor to make a bow so teeming with respect when a man is sitting squat upon the ground; yet by allowing the palm of his right hand to slip backwards upon the grass - and with his left hand, squeezing rather than pulling off his cap - the corporal acquitted himself well; and having cleared his throat, he set off thus.\nTHE STORY OF THE KING OF BOHEMIA AND HIS SEVEN CASTLES\n'There was a certain king of Bo-'\nMy uncle Toby obliged the corporal to halt, by touching the Montero-cap on the ground with the end of his cane - as much as to say, 'Why don't you put it on, Trim?'\nTrim took it up with respectful slowness, and casting a humiliated glance upon the embroidery of the front, which was dismally tarnished and frayed, he laid it down again between his two feet, to moralise upon the subject.\n'Thou art about to observe,' cried my uncle Toby, '-that nothing in this world is made to last for ever.'\n'But when tokens of my dear brother's love and remembrance wear out,' said Trim, 'what shall we say?'\n'There is no need to say anything else,' quoth my uncle Toby.\nThe corporal, perceiving that it would be in vain for the wit of man to extract a purer moral from his cap, put it on, and returned to his story.\nTHE STORY OF THE KING OF BOHEMIA AND HIS SEVEN CASTLES, CONTINUED\n'There was a certain king of Bohemia, but in whose reign, I am not able to inform your honour-'\n'I do not desire it, Trim,' cried my uncle Toby.\n'It was a little before the time when giants were beginning to leave off breeding: but in what year that was-'\n'I would not give a halfpenny to know,' said my uncle Toby.\n'Only, your honour, it makes a story look better-'\n''Tis thy own, Trim, so take any date thou choosest, and welcome,' said my uncle Toby pleasantly.\nThe corporal bowed; for of every century, from the first creation of the world down to Noah's flood; and through all the Dynasties, Olympiads, and other memorable epochs of the world, down to the coming of Christ, and from thence to the very moment in which the corporal was telling his story - my uncle Toby laid this vast empire of time and all its abysses at his feet.\nBut as Modesty scarce touches with a finger what Liberality offers her with open hands - the corporal contented himself with the very worst year of the whole bunch.\nTo prevent your honours from tearing the flesh off your bones in argument, I tell you plainly it was the year 1712, when the Duke of Ormond was playing the devil in Flanders. - The corporal took it, and set out with it afresh on his expedition to Bohemia.\nTHE STORY OF THE KING OF BOHEMIA AND HIS SEVEN CASTLES, CONTINUED\n'In the year of our Lord 1712, there was, an' please your honour-'\n'To tell thee truly, Trim,' quoth my uncle Toby, 'any other date would have pleased me better, not only on account of the sad stain upon our history that year, in marching our troops away from the siege of Quesnoi - but also on the score of thy own story, Trim; because if there are in fact giants in it-'\n'Only one, your honour.'\n''Tis as bad as twenty,' replied my uncle Toby; 'thou should'st have carried him back some seven or eight hundred years, out of harm's way of critics. Therefore I would advise thee, if ever thou tellest it again-'\n'If I but once get through it, I will never tell it again,' quoth Trim.\n'Poo, poo!' said my uncle Toby; but with accents of such sweet encouragement that the corporal went on with alacrity.\nTHE STORY OF THE KING OF BOHEMIA AND HIS SEVEN CASTLES, CONTINUED\n'There was, an' please your honour,' said the corporal, raising his voice, 'a certain king of Bohemia-'\n'Leave out the date entirely, Trim,' quoth my uncle, gently laying his hand upon the corporal's shoulder. 'A story passes very well without these niceties. It is not easy for a soldier like us, Trim, to see further than the end of his musket.'\n'God bless your honour!' said the corporal; 'a soldier has something else to do; if not in action, or on a march, or on duty - he has his firelock to furbish - his regimentals to mend - himself to shave and keep clean: what business has a soldier to know anything of geography?'\n'Thou shouldst say chronology, Trim,' said my uncle; 'for geography is of great use to him; he must be acquainted intimately with every country; he should know every town and village, its canals, its roads and rivers - how far they are navigable, and where fordable; he should be able to give an exact map of all the plains, forts, woods and swamps through which his army is to march; he should know their produce, their plants, their minerals, their waters, their animals, their seasons, their climates, their inhabitants, their customs, their language, their policy, and even their religion.\n'For how else,' continued my uncle Toby, rising up in his sentry-box - 'how else could Marlborough have marched his army from the Maes to Belburg; then to Newdorf and Landenbourg; from thence to Balmerchoffen; and to Skellenburg, where he broke in upon the enemy's works; forced his passage over the Danube; crossed the Lech - pushed on his troops into the heart of the empire, to the plains of Blenheim? Great as he was, he could not have advanced a step, without the aids of Geography.\n'As for Chronology, I own, Trim,' continued my uncle Toby, sitting down again, 'that it seems the science which the soldier might best spare, was it not for the invention of gunpowder; which has opened a new era of military improvements, changing so totally the nature of attacks and defences, that the world cannot be too inquisitive in knowing what great man was its discoverer.\n'I am far from disputing,' continued my uncle, 'what historians agree, that in the year 1380 a certain priest called Schwartz showed the use of gunpowder to the Venetians, in their wars against the Genoese; but 'tis certain he was not the first; because if we are to believe Don Pedro, the bishop of Leon-'\n'How came priests and bishops, your honour, to trouble their heads so much about gunpowder?'\n'God knows,' said my uncle Toby; '-He avers, in his chronicle of King Alphonsus, that in 1343 the secret of gunpowder was well known, and used with success, both by Moors and Christians, in their sea-combats, and their most memorable sieges in Spain and Barbary. - And all the world knows that Friar Bacon had wrote about it, a hundred and fifty years before Schwartz was born. - And that the Chinese,' added my uncle, 'embarrass us still more, by boasting of the invention hundreds of years even before him-'\n'They are a pack of liars,' cried Trim.\n'They are deceived in this matter,' said my uncle Toby, 'as is plain from the present miserable state of military architecture amongst them; which consists of nothing more than a foss with a brick wall without flanks - and with a supposed bastion at each, so barbarously constructed, that it looks for all the world-'\n'Like one of my seven castles, your honour,' quoth Trim.\nMy uncle Toby, though needing a comparison, most courteously refused Trim's offer - till Trim telling him he had half a dozen more in Bohemia, which he knew not how to get off his hands - my uncle Toby was so touched with the corporal's kindness that he stopped his speech upon gunpowder, and begged him to go on with his story.\nTHE STORY OF THE KING OF BOHEMIA AND HIS SEVEN CASTLES, CONTINUED\n'This unfortunate King of Bohemia-' said Trim.\n'Was he unfortunate, then?' cried my uncle Toby.\nThe corporal, wishing the word at the devil, began to run back in his mind the principal events in the King of Bohemia's story; from which it appeared that he was the most fortunate man in the world. It stopped the corporal in his tracks: for not caring to retract the phrase - still less to explain it - and least of all, to twist his tale - he looked in my uncle Toby's face for help, but seeing my uncle Toby awaiting help himself, after a hum and a haw, he went on:\n'The King of Bohemia,' said the corporal, 'was unfortunate in this - that taking great pleasure in navigation and all sort of sea affairs - and there happening throughout the whole kingdom of Bohemia to be no seaport town whatever-'\n'How the deuce should there be, Trim?' cried my uncle Toby; 'for Bohemia being totally inland, it could have happened no otherwise.'\n'There might be,' said Trim, 'if it had pleased God.'\nMy uncle Toby never spoke of God without diffidence.\n'I believe not,' he replied, after a pause; 'for having Silesia and Moravia to the east; Lusatia and Upper Saxony to the north; Franconia to the west, and Bavaria to the south, Bohemia could not have been propelled to the sea without ceasing to be Bohemia. Nor could the sea have come up to Bohemia, without overflowing a great part of Germany, and destroying millions of defenceless inhabitants. Which would mean such a lack of compassion in him who caused it - that I think, Trim, the thing could in no way happen.'\nThe corporal made the bow of conviction; and went on.\n'Now the King of Bohemia with his queen and courtiers happening one fine summer's evening to walk out-'\n'Aye! there the word happening is right, Trim,' cried my uncle Toby; 'for the King of Bohemia and his queen might have walked out or not: - 'twas a matter of chance.'\n'King William was of the opinion, your honour,' quoth Trim, 'that everything was predestined for us in this world; so that he would often say to his soldiers, that \"every bullet had its billet.\"'\n'He was a great man,' said my uncle Toby.\n'And I believe,' continued Trim, 'that the shot which disabled me at the battle of Landen, was pointed at my knee for no other purpose, but to place me in your honour's service, where I should be taken so much better care of in my old age.'\n'So I believe too, Trim,' said my uncle Toby.\nBoth hearts were full of sudden overflowings; a short silence ensued.\n'Besides,' resumed the corporal more cheerfully, 'if it had not been for that single shot, I would never have been in love.'\n'So, thou wast once in love, Trim!' said my uncle Toby, smiling.\n'Head over heels! your honour.'\n'Prithee when? where? - and how came it to pass? I never heard one word of it before,' quoth my uncle.\n'I dare say,' answered Trim, 'that every drummer in the regiment knew of it.'\n'Then it's high time I did,' said my uncle Toby.\n'Your honour remembers the total rout and confusion of our army at Landen; everyone was left to shift for himself; and if it had not been for the regiments of Wyndham, Lumley, and Galway, which covered the retreat, the king himself could scarce have gained it - he was pressed hard, as your honour knows-'\n'Gallant mortal!' cried my uncle Toby, with enthusiasm - 'I see him galloping to bring up the remains of the English cavalry, and tear the laurel from Luxembourg's brows - I see him riding along the line - then wheeling about, and charging Conti at the head of it - Brave! brave, by heaven! He deserves a crown.'\n'As richly, as a thief a halter,' shouted Trim.\nMy uncle Toby knew the corporal's loyalty; - otherwise the comparison was not at all to his liking. The corporal regretted it, but it could not be recalled; so he went on.\n'As the number of wounded was prodigious, and no one had time to think of anything but his own safety, I was left upon the field. It was noon the next day before I was put into a cart with thirteen or fourteen more, to be taken to hospital. There is no part of the body, your honour, where a wound causes more intolerable anguish than upon the knee-'\n'Except the groin,' said my uncle Toby.\n'An' please your honour,' replied the corporal, 'the knee, in my opinion, must certainly be the most acute, there being so many tendons and what-d'ye-call-'ems all around it.'\n'It is for that reason,' quoth my uncle Toby, 'that the groin is infinitely more sensitive - there being not only tendons and what-d'ye-call-'ems - but moreover * * *.'\nMrs. Wadman, who had been all this time in her arbour, instantly held her breath - unpinned her mob-cap, and stood upon one leg.\nThe dispute went on with amicable and equal force betwixt my uncle Toby and Trim; till Trim at length recollecting that he had often cried at his master's sufferings, but never shed a tear at his own, was willing to give up the point, which my uncle Toby would not allow.\n''Tis proof of nothing, Trim,' said he, 'but thy generosity.'\nSo whether the pain of a wound in the groin is greater than the pain of a wound in the knee - or vice versa - to this day remains unsettled.",
        "paragraph_chars": [
            [
                0,
                95
            ],
            [
                95,
                200
            ],
            [
                200,
                368
            ],
            [
                368,
                407
            ],
            [
                407,
                565
            ],
            [
                565,
                771
            ],
            [
                771,
                896
            ],
            [
                896,
                1086
            ],
            [
                1086,
                1140
            ],
            [
                1140,
                1201
            ],
            [
                1201,
                1295
            ],
            [
                1295,
                1356
            ],
            [
                1356,
                1771
            ],
            [
                1771,
                1826
            ],
            [
                1826,
                1860
            ],
            [
                1860,
                2025
            ],
            [
                2025,
                2248
            ],
            [
                2248,
                2354
            ],
            [
                2354,
                2456
            ],
            [
                2456,
                2518
            ],
            [
                2518,
                2664
            ],
            [
                2664,
                2730
            ],
            [
                2730,
                2826
            ],
            [
                2826,
                2875
            ],
            [
                2875,
                2986
            ],
            [
                2986,
                3046
            ],
            [
                3046,
                3097
            ],
            [
                3097,
                3195
            ],
            [
                3195,
                3567
            ],
            [
                3567,
                3732
            ],
            [
                3732,
                3988
            ],
            [
                3988,
                4054
            ],
            [
                4054,
                4121
            ],
            [
                4121,
                4427
            ],
            [
                4427,
                4452
            ],
            [
                4452,
                4666
            ],
            [
                4666,
                4738
            ],
            [
                4738,
                4856
            ],
            [
                4856,
                4922
            ],
            [
                4922,
                5026
            ],
            [
                5026,
                5270
            ],
            [
                5270,
                5549
            ],
            [
                5549,
                6143
            ],
            [
                6143,
                6631
            ],
            [
                6631,
                7012
            ],
            [
                7012,
                7319
            ],
            [
                7319,
                7412
            ],
            [
                7412,
                7922
            ],
            [
                7922,
                7962
            ],
            [
                7962,
                8280
            ],
            [
                8280,
                8337
            ],
            [
                8337,
                8666
            ],
            [
                8666,
                8732
            ],
            [
                8732,
                8779
            ],
            [
                8779,
                8828
            ],
            [
                8828,
                9298
            ],
            [
                9298,
                9531
            ],
            [
                9531,
                9664
            ],
            [
                9664,
                9718
            ],
            [
                9718,
                9771
            ],
            [
                9771,
                10289
            ],
            [
                10289,
                10343
            ],
            [
                10343,
                10447
            ],
            [
                10447,
                10614
            ],
            [
                10614,
                10810
            ],
            [
                10810,
                10852
            ],
            [
                10852,
                11093
            ],
            [
                11093,
                11139
            ],
            [
                11139,
                11209
            ],
            [
                11209,
                11334
            ],
            [
                11334,
                11399
            ],
            [
                11399,
                11431
            ],
            [
                11431,
                11534
            ],
            [
                11534,
                11612
            ],
            [
                11612,
                11661
            ],
            [
                11661,
                11967
            ],
            [
                11967,
                12280
            ],
            [
                12280,
                12328
            ],
            [
                12328,
                12500
            ],
            [
                12500,
                12851
            ],
            [
                12851,
                12891
            ],
            [
                12891,
                13067
            ],
            [
                13067,
                13236
            ],
            [
                13236,
                13365
            ],
            [
                13365,
                13637
            ],
            [
                13637,
                13699
            ],
            [
                13699,
                13839
            ]
        ],
        "segment_chars": [
            [
                0,
                95
            ],
            [
                95,
                200
            ],
            [
                200,
                255
            ],
            [
                255,
                368
            ],
            [
                368,
                407
            ],
            [
                407,
                565
            ],
            [
                565,
                771
            ],
            [
                771,
                896
            ],
            [
                896,
                958
            ],
            [
                958,
                991
            ],
            [
                991,
                1086
            ],
            [
                1086,
                1140
            ],
            [
                1140,
                1201
            ],
            [
                1201,
                1295
            ],
            [
                1295,
                1356
            ],
            [
                1356,
                1771
            ],
            [
                1771,
                1826
            ],
            [
                1826,
                1860
            ],
            [
                1860,
                2025
            ],
            [
                2025,
                2248
            ],
            [
                2248,
                2354
            ],
            [
                2354,
                2456
            ],
            [
                2456,
                2518
            ],
            [
                2518,
                2664
            ],
            [
                2664,
                2730
            ],
            [
                2730,
                2826
            ],
            [
                2826,
                2875
            ],
            [
                2875,
                2986
            ],
            [
                2986,
                3046
            ],
            [
                3046,
                3097
            ],
            [
                3097,
                3195
            ],
            [
                3195,
                3567
            ],
            [
                3567,
                3732
            ],
            [
                3732,
                3907
            ],
            [
                3907,
                3988
            ],
            [
                3988,
                4054
            ],
            [
                4054,
                4121
            ],
            [
                4121,
                4427
            ],
            [
                4427,
                4452
            ],
            [
                4452,
                4603
            ],
            [
                4603,
                4666
            ],
            [
                4666,
                4738
            ],
            [
                4738,
                4750
            ],
            [
                4750,
                4856
            ],
            [
                4856,
                4922
            ],
            [
                4922,
                5026
            ],
            [
                5026,
                5132
            ],
            [
                5132,
                5182
            ],
            [
                5182,
                5270
            ],
            [
                5270,
                5295
            ],
            [
                5295,
                5549
            ],
            [
                5549,
                6143
            ],
            [
                6143,
                6548
            ],
            [
                6548,
                6631
            ],
            [
                6631,
                7012
            ],
            [
                7012,
                7319
            ],
            [
                7319,
                7412
            ],
            [
                7412,
                7675
            ],
            [
                7675,
                7790
            ],
            [
                7790,
                7922
            ],
            [
                7922,
                7962
            ],
            [
                7962,
                8280
            ],
            [
                8280,
                8337
            ],
            [
                8337,
                8666
            ],
            [
                8666,
                8732
            ],
            [
                8732,
                8779
            ],
            [
                8779,
                8807
            ],
            [
                8807,
                8828
            ],
            [
                8828,
                9028
            ],
            [
                9028,
                9298
            ],
            [
                9298,
                9531
            ],
            [
                9531,
                9570
            ],
            [
                9570,
                9664
            ],
            [
                9664,
                9718
            ],
            [
                9718,
                9771
            ],
            [
                9771,
                10028
            ],
            [
                10028,
                10168
            ],
            [
                10168,
                10289
            ],
            [
                10289,
                10343
            ],
            [
                10343,
                10447
            ],
            [
                10447,
                10453
            ],
            [
                10453,
                10614
            ],
            [
                10614,
                10810
            ],
            [
                10810,
                10852
            ],
            [
                10852,
                11093
            ],
            [
                11093,
                11139
            ],
            [
                11139,
                11209
            ],
            [
                11209,
                11334
            ],
            [
                11334,
                11370
            ],
            [
                11370,
                11399
            ],
            [
                11399,
                11417
            ],
            [
                11417,
                11431
            ],
            [
                11431,
                11446
            ],
            [
                11446,
                11453
            ],
            [
                11453,
                11480
            ],
            [
                11480,
                11534
            ],
            [
                11534,
                11612
            ],
            [
                11612,
                11661
            ],
            [
                11661,
                11967
            ],
            [
                11967,
                11985
            ],
            [
                11985,
                12240
            ],
            [
                12240,
                12258
            ],
            [
                12258,
                12280
            ],
            [
                12280,
                12328
            ],
            [
                12328,
                12428
            ],
            [
                12428,
                12500
            ],
            [
                12500,
                12630
            ],
            [
                12630,
                12741
            ],
            [
                12741,
                12851
            ],
            [
                12851,
                12891
            ],
            [
                12891,
                13067
            ],
            [
                13067,
                13236
            ],
            [
                13236,
                13365
            ],
            [
                13365,
                13637
            ],
            [
                13637,
                13699
            ],
            [
                13699,
                13839
            ]
        ],
        "overlap_chars": [
            [
                0,
                1
            ],
            [
                1,
                25
            ],
            [
                28,
                44
            ],
            [
                45,
                62
            ],
            [
                63,
                72
            ],
            [
                73,
                92
            ],
            [
                95,
                96
            ],
            [
                96,
                105
            ],
            [
                108,
                122
            ],
            [
                127,
                128
            ],
            [
                130,
                175
            ],
            [
                176,
                197
            ],
            [
                201,
                218
            ],
            [
                219,
                230
            ],
            [
                233,
                253
            ],
            [
                253,
                254
            ],
            [
                257,
                282
            ],
            [
                283,
                318
            ],
            [
                321,
                365
            ],
            [
                374,
                384
            ],
            [
                392,
                405
            ],
            [
                415,
                438
            ],
            [
                440,
                442
            ],
            [
                454,
                470
            ],
            [
                471,
                510
            ],
            [
                518,
                549
            ],
            [
                549,
                550
            ],
            [
                551,
                562
            ],
            [
                571,
                594
            ],
            [
                602,
                615
            ],
            [
                616,
                618
            ],
            [
                620,
                621
            ],
            [
                623,
                626
            ],
            [
                627,
                633
            ],
            [
                642,
                730
            ],
            [
                730,
                731
            ],
            [
                732,
                733
            ],
            [
                734,
                738
            ],
            [
                739,
                768
            ],
            [
                771,
                772
            ],
            [
                772,
                780
            ],
            [
                781,
                809
            ],
            [
                810,
                847
            ],
            [
                847,
                848
            ],
            [
                849,
                893
            ],
            [
                897,
                910
            ],
            [
                916,
                921
            ],
            [
                922,
                935
            ],
            [
                938,
                951
            ],
            [
                959,
                991
            ],
            [
                991,
                998
            ],
            [
                1001,
                1032
            ],
            [
                1033,
                1036
            ],
            [
                1037,
                1041
            ],
            [
                1046,
                1048
            ],
            [
                1049,
                1050
            ],
            [
                1056,
                1066
            ],
            [
                1067,
                1069
            ],
            [
                1073,
                1075
            ],
            [
                1087,
                1096
            ],
            [
                1097,
                1102
            ],
            [
                1103,
                1115
            ],
            [
                1118,
                1138
            ],
            [
                1141,
                1171
            ],
            [
                1172,
                1177
            ],
            [
                1180,
                1194
            ],
            [
                1202,
                1215
            ],
            [
                1216,
                1233
            ],
            [
                1236,
                1257
            ],
            [
                1259,
                1292
            ],
            [
                1296,
                1297
            ],
            [
                1298,
                1308
            ],
            [
                1308,
                1309
            ],
            [
                1310,
                1327
            ],
            [
                1335,
                1349
            ],
            [
                1356,
                1377
            ],
            [
                1381,
                1403
            ],
            [
                1404,
                1408
            ],
            [
                1409,
                1427
            ],
            [
                1428,
                1435
            ],
            [
                1436,
                1450
            ],
            [
                1457,
                1494
            ],
            [
                1495,
                1538
            ],
            [
                1538,
                1546
            ],
            [
                1556,
                1582
            ],
            [
                1583,
                1615
            ],
            [
                1618,
                1621
            ],
            [
                1622,
                1626
            ],
            [
                1627,
                1635
            ],
            [
                1640,
                1641
            ],
            [
                1652,
                1658
            ],
            [
                1659,
                1663
            ],
            [
                1672,
                1675
            ],
            [
                1676,
                1683
            ],
            [
                1686,
                1716
            ],
            [
                1721,
                1733
            ],
            [
                1742,
                1745
            ],
            [
                1752,
                1753
            ],
            [
                1754,
                1756
            ],
            [
                1757,
                1771
            ],
            [
                1771,
                1826
            ],
            [
                1833,
                1857
            ],
            [
                1860,
                1868
            ],
            [
                1874,
                1881
            ],
            [
                1882,
                1894
            ],
            [
                1895,
                1902
            ],
            [
                1902,
                1903
            ],
            [
                1916,
                1919
            ],
            [
                1920,
                1927
            ],
            [
                1927,
                1928
            ],
            [
                1928,
                1931
            ],
            [
                1932,
                1945
            ],
            [
                1946,
                1970
            ],
            [
                1971,
                1972
            ],
            [
                1973,
                1991
            ],
            [
                1993,
                2017
            ],
            [
                2025,
                2029
            ],
            [
                2030,
                2045
            ],
            [
                2046,
                2080
            ],
            [
                2092,
                2098
            ],
            [
                2099,
                2125
            ],
            [
                2131,
                2138
            ],
            [
                2139,
                2142
            ],
            [
                2143,
                2156
            ],
            [
                2162,
                2165
            ],
            [
                2172,
                2176
            ],
            [
                2182,
                2217
            ],
            [
                2218,
                2248
            ],
            [
                2254,
                2274
            ],
            [
                2277,
                2291
            ],
            [
                2296,
                2297
            ],
            [
                2298,
                2299
            ],
            [
                2300,
                2304
            ],
            [
                2305,
                2326
            ],
            [
                2327,
                2351
            ],
            [
                2355,
                2370
            ],
            [
                2371,
                2373
            ],
            [
                2377,
                2381
            ],
            [
                2392,
                2421
            ],
            [
                2424,
                2428
            ],
            [
                2433,
                2434
            ],
            [
                2436,
                2453
            ],
            [
                2463,
                2468
            ],
            [
                2474,
                2494
            ],
            [
                2497,
                2511
            ],
            [
                2512,
                2514
            ],
            [
                2516,
                2518
            ],
            [
                2518,
                2542
            ],
            [
                2543,
                2589
            ],
            [
                2598,
                2625
            ],
            [
                2626,
                2635
            ],
            [
                2635,
                2640
            ],
            [
                2650,
                2662
            ],
            [
                2662,
                2664
            ],
            [
                2664,
                2730
            ],
            [
                2737,
                2758
            ],
            [
                2759,
                2766
            ],
            [
                2766,
                2786
            ],
            [
                2786,
                2823
            ],
            [
                2827,
                2845
            ],
            [
                2845,
                2846
            ],
            [
                2854,
                2868
            ],
            [
                2871,
                2873
            ],
            [
                2875,
                2876
            ],
            [
                2876,
                2907
            ],
            [
                2908,
                2957
            ],
            [
                2958,
                2974
            ],
            [
                2975,
                2983
            ],
            [
                2987,
                3023
            ],
            [
                3026,
                3039
            ],
            [
                3046,
                3047
            ],
            [
                3047,
                3052
            ],
            [
                3053,
                3087
            ],
            [
                3088,
                3094
            ],
            [
                3099,
                3111
            ],
            [
                3116,
                3120
            ],
            [
                3121,
                3134
            ],
            [
                3135,
                3139
            ],
            [
                3145,
                3153
            ],
            [
                3154,
                3161
            ],
            [
                3169,
                3177
            ],
            [
                3178,
                3180
            ],
            [
                3183,
                3193
            ],
            [
                3195,
                3227
            ],
            [
                3228,
                3281
            ],
            [
                3282,
                3288
            ],
            [
                3289,
                3299
            ],
            [
                3300,
                3307
            ],
            [
                3308,
                3337
            ],
            [
                3338,
                3363
            ],
            [
                3363,
                3364
            ],
            [
                3365,
                3487
            ],
            [
                3488,
                3489
            ],
            [
                3490,
                3498
            ],
            [
                3499,
                3501
            ],
            [
                3509,
                3565
            ],
            [
                3567,
                3642
            ],
            [
                3643,
                3647
            ],
            [
                3648,
                3653
            ],
            [
                3654,
                3655
            ],
            [
                3656,
                3700
            ],
            [
                3701,
                3711
            ],
            [
                3712,
                3730
            ],
            [
                3732,
                3755
            ],
            [
                3756,
                3772
            ],
            [
                3773,
                3796
            ],
            [
                3805,
                3806
            ],
            [
                3807,
                3832
            ],
            [
                3833,
                3841
            ],
            [
                3846,
                3864
            ],
            [
                3872,
                3896
            ],
            [
                3909,
                3978
            ],
            [
                3979,
                3986
            ],
            [
                3988,
                4054
            ],
            [
                4055,
                4078
            ],
            [
                4083,
                4118
            ],
            [
                4125,
                4141
            ],
            [
                4149,
                4163
            ],
            [
                4164,
                4166
            ],
            [
                4168,
                4169
            ],
            [
                4171,
                4207
            ],
            [
                4208,
                4292
            ],
            [
                4293,
                4303
            ],
            [
                4309,
                4313
            ],
            [
                4314,
                4326
            ],
            [
                4331,
                4334
            ],
            [
                4337,
                4340
            ],
            [
                4346,
                4358
            ],
            [
                4359,
                4375
            ],
            [
                4375,
                4376
            ],
            [
                4381,
                4403
            ],
            [
                4407,
                4411
            ],
            [
                4412,
                4424
            ],
            [
                4427,
                4428
            ],
            [
                4433,
                4437
            ],
            [
                4438,
                4449
            ],
            [
                4454,
                4474
            ],
            [
                4477,
                4493
            ],
            [
                4500,
                4501
            ],
            [
                4501,
                4571
            ],
            [
                4571,
                4572
            ],
            [
                4573,
                4590
            ],
            [
                4591,
                4601
            ],
            [
                4603,
                4663
            ],
            [
                4666,
                4667
            ],
            [
                4667,
                4671
            ],
            [
                4672,
                4680
            ],
            [
                4681,
                4723
            ],
            [
                4726,
                4731
            ],
            [
                4739,
                4742
            ],
            [
                4742,
                4743
            ],
            [
                4750,
                4763
            ],
            [
                4770,
                4814
            ],
            [
                4815,
                4845
            ],
            [
                4846,
                4854
            ],
            [
                4854,
                4856
            ],
            [
                4856,
                4922
            ],
            [
                4929,
                4956
            ],
            [
                4959,
                4995
            ],
            [
                4995,
                4996
            ],
            [
                4998,
                5015
            ],
            [
                5016,
                5023
            ],
            [
                5026,
                5027
            ],
            [
                5027,
                5055
            ],
            [
                5063,
                5077
            ],
            [
                5077,
                5078
            ],
            [
                5079,
                5085
            ],
            [
                5086,
                5101
            ],
            [
                5102,
                5130
            ],
            [
                5132,
                5133
            ],
            [
                5133,
                5180
            ],
            [
                5182,
                5196
            ],
            [
                5197,
                5200
            ],
            [
                5218,
                5219
            ],
            [
                5224,
                5228
            ],
            [
                5233,
                5240
            ],
            [
                5241,
                5245
            ],
            [
                5246,
                5267
            ],
            [
                5271,
                5292
            ],
            [
                5295,
                5312
            ],
            [
                5312,
                5313
            ],
            [
                5314,
                5315
            ],
            [
                5325,
                5357
            ],
            [
                5358,
                5360
            ],
            [
                5361,
                5371
            ],
            [
                5372,
                5374
            ],
            [
                5375,
                5386
            ],
            [
                5390,
                5394
            ],
            [
                5397,
                5416
            ],
            [
                5417,
                5427
            ],
            [
                5430,
                5453
            ],
            [
                5464,
                5487
            ],
            [
                5489,
                5502
            ],
            [
                5503,
                5516
            ],
            [
                5517,
                5533
            ],
            [
                5534,
                5536
            ],
            [
                5555,
                5561
            ],
            [
                5568,
                5578
            ],
            [
                5578,
                5579
            ],
            [
                5587,
                5600
            ],
            [
                5600,
                5601
            ],
            [
                5602,
                5603
            ],
            [
                5603,
                5616
            ],
            [
                5617,
                5619
            ],
            [
                5620,
                5622
            ],
            [
                5629,
                5692
            ],
            [
                5692,
                5723
            ],
            [
                5724,
                5731
            ],
            [
                5731,
                5732
            ],
            [
                5733,
                5736
            ],
            [
                5737,
                5744
            ],
            [
                5745,
                5748
            ],
            [
                5749,
                5754
            ],
            [
                5755,
                5758
            ],
            [
                5768,
                5775
            ],
            [
                5785,
                5794
            ],
            [
                5794,
                5799
            ],
            [
                5800,
                5814
            ],
            [
                5814,
                5815
            ],
            [
                5816,
                5833
            ],
            [
                5834,
                5841
            ],
            [
                5842,
                5872
            ],
            [
                5872,
                5873
            ],
            [
                5874,
                5880
            ],
            [
                5881,
                5890
            ],
            [
                5906,
                6059
            ],
            [
                6060,
                6143
            ],
            [
                6148,
                6151
            ],
            [
                6152,
                6156
            ],
            [
                6159,
                6177
            ],
            [
                6178,
                6180
            ],
            [
                6182,
                6211
            ],
            [
                6224,
                6229
            ],
            [
                6230,
                6241
            ],
            [
                6242,
                6272
            ],
            [
                6273,
                6277
            ],
            [
                6278,
                6280
            ],
            [
                6281,
                6288
            ],
            [
                6288,
                6289
            ],
            [
                6295,
                6297
            ],
            [
                6298,
                6305
            ],
            [
                6306,
                6309
            ],
            [
                6310,
                6321
            ],
            [
                6321,
                6327
            ],
            [
                6335,
                6337
            ],
            [
                6338,
                6351
            ],
            [
                6351,
                6352
            ],
            [
                6353,
                6356
            ],
            [
                6357,
                6359
            ],
            [
                6365,
                6371
            ],
            [
                6371,
                6442
            ],
            [
                6443,
                6449
            ],
            [
                6449,
                6450
            ],
            [
                6459,
                6462
            ],
            [
                6463,
                6467
            ],
            [
                6477,
                6520
            ],
            [
                6521,
                6537
            ],
            [
                6538,
                6546
            ],
            [
                6546,
                6547
            ],
            [
                6548,
                6563
            ],
            [
                6563,
                6599
            ],
            [
                6600,
                6619
            ],
            [
                6632,
                6638
            ],
            [
                6639,
                6649
            ],
            [
                6649,
                6657
            ],
            [
                6665,
                6683
            ],
            [
                6684,
                6686
            ],
            [
                6686,
                6688
            ],
            [
                6688,
                6708
            ],
            [
                6708,
                6709
            ],
            [
                6711,
                6715
            ],
            [
                6716,
                6724
            ],
            [
                6725,
                6728
            ],
            [
                6729,
                6791
            ],
            [
                6792,
                6804
            ],
            [
                6808,
                6815
            ],
            [
                6816,
                6821
            ],
            [
                6822,
                6825
            ],
            [
                6833,
                6838
            ],
            [
                6843,
                6923
            ],
            [
                6923,
                6949
            ],
            [
                6950,
                6995
            ],
            [
                6996,
                6999
            ],
            [
                7000,
                7010
            ],
            [
                7010,
                7012
            ],
            [
                7012,
                7013
            ],
            [
                7013,
                7026
            ],
            [
                7039,
                7057
            ],
            [
                7057,
                7058
            ],
            [
                7060,
                7081
            ],
            [
                7081,
                7099
            ],
            [
                7100,
                7104
            ],
            [
                7105,
                7121
            ],
            [
                7129,
                7137
            ],
            [
                7145,
                7155
            ],
            [
                7159,
                7172
            ],
            [
                7173,
                7182
            ],
            [
                7182,
                7209
            ],
            [
                7210,
                7217
            ],
            [
                7217,
                7290
            ],
            [
                7291,
                7296
            ],
            [
                7296,
                7311
            ],
            [
                7320,
                7349
            ],
            [
                7350,
                7409
            ],
            [
                7413,
                7422
            ],
            [
                7425,
                7438
            ],
            [
                7439,
                7441
            ],
            [
                7441,
                7443
            ],
            [
                7446,
                7447
            ],
            [
                7447,
                7481
            ],
            [
                7486,
                7491
            ],
            [
                7491,
                7500
            ],
            [
                7501,
                7505
            ],
            [
                7506,
                7519
            ],
            [
                7523,
                7549
            ],
            [
                7555,
                7598
            ],
            [
                7599,
                7620
            ],
            [
                7621,
                7624
            ],
            [
                7625,
                7655
            ],
            [
                7656,
                7661
            ],
            [
                7662,
                7665
            ],
            [
                7670,
                7673
            ],
            [
                7677,
                7700
            ],
            [
                7701,
                7711
            ],
            [
                7718,
                7727
            ],
            [
                7728,
                7737
            ],
            [
                7738,
                7770
            ],
            [
                7771,
                7779
            ],
            [
                7780,
                7788
            ],
            [
                7792,
                7804
            ],
            [
                7805,
                7812
            ],
            [
                7815,
                7829
            ],
            [
                7829,
                7830
            ],
            [
                7842,
                7844
            ],
            [
                7845,
                7885
            ],
            [
                7886,
                7919
            ],
            [
                7928,
                7947
            ],
            [
                7950,
                7955
            ],
            [
                7968,
                7971
            ],
            [
                7972,
                7980
            ],
            [
                7981,
                7995
            ],
            [
                7998,
                8011
            ],
            [
                8012,
                8014
            ],
            [
                8016,
                8019
            ],
            [
                8019,
                8030
            ],
            [
                8031,
                8178
            ],
            [
                8181,
                8184
            ],
            [
                8190,
                8191
            ],
            [
                8201,
                8216
            ],
            [
                8216,
                8217
            ],
            [
                8218,
                8277
            ],
            [
                8280,
                8281
            ],
            [
                8281,
                8310
            ],
            [
                8311,
                8322
            ],
            [
                8325,
                8330
            ],
            [
                8337,
                8345
            ],
            [
                8350,
                8351
            ],
            [
                8367,
                8405
            ],
            [
                8410,
                8412
            ],
            [
                8413,
                8418
            ],
            [
                8431,
                8442
            ],
            [
                8443,
                8470
            ],
            [
                8471,
                8478
            ],
            [
                8478,
                8522
            ],
            [
                8525,
                8533
            ],
            [
                8539,
                8545
            ],
            [
                8554,
                8558
            ],
            [
                8559,
                8571
            ],
            [
                8583,
                8590
            ],
            [
                8599,
                8602
            ],
            [
                8610,
                8624
            ],
            [
                8624,
                8625
            ],
            [
                8626,
                8636
            ],
            [
                8641,
                8664
            ],
            [
                8664,
                8666
            ],
            [
                8666,
                8732
            ],
            [
                8750,
                8757
            ],
            [
                8758,
                8765
            ],
            [
                8768,
                8772
            ],
            [
                8780,
                8804
            ],
            [
                8807,
                8821
            ],
            [
                8822,
                8824
            ],
            [
                8828,
                8849
            ],
            [
                8850,
                8853
            ],
            [
                8854,
                8858
            ],
            [
                8859,
                8872
            ],
            [
                8873,
                8902
            ],
            [
                8903,
                8938
            ],
            [
                8939,
                8948
            ],
            [
                8949,
                8960
            ],
            [
                8961,
                8966
            ],
            [
                8967,
                8969
            ],
            [
                8979,
                9013
            ],
            [
                9014,
                9026
            ],
            [
                9028,
                9030
            ],
            [
                9039,
                9051
            ],
            [
                9052,
                9058
            ],
            [
                9065,
                9092
            ],
            [
                9093,
                9096
            ],
            [
                9112,
                9130
            ],
            [
                9133,
                9168
            ],
            [
                9171,
                9180
            ],
            [
                9181,
                9192
            ],
            [
                9193,
                9195
            ],
            [
                9197,
                9199
            ],
            [
                9200,
                9208
            ],
            [
                9213,
                9214
            ],
            [
                9215,
                9225
            ],
            [
                9226,
                9234
            ],
            [
                9235,
                9237
            ],
            [
                9254,
                9261
            ],
            [
                9261,
                9262
            ],
            [
                9263,
                9296
            ],
            [
                9303,
                9310
            ],
            [
                9311,
                9318
            ],
            [
                9326,
                9339
            ],
            [
                9340,
                9341
            ],
            [
                9341,
                9344
            ],
            [
                9367,
                9393
            ],
            [
                9394,
                9435
            ],
            [
                9438,
                9447
            ],
            [
                9458,
                9489
            ],
            [
                9490,
                9497
            ],
            [
                9498,
                9528
            ],
            [
                9532,
                9539
            ],
            [
                9546,
                9558
            ],
            [
                9561,
                9562
            ],
            [
                9570,
                9584
            ],
            [
                9589,
                9590
            ],
            [
                9592,
                9595
            ],
            [
                9596,
                9603
            ],
            [
                9604,
                9639
            ],
            [
                9649,
                9661
            ],
            [
                9671,
                9676
            ],
            [
                9682,
                9686
            ],
            [
                9691,
                9692
            ],
            [
                9694,
                9715
            ],
            [
                9718,
                9726
            ],
            [
                9732,
                9746
            ],
            [
                9747,
                9750
            ],
            [
                9759,
                9769
            ],
            [
                9772,
                9785
            ],
            [
                9791,
                9798
            ],
            [
                9798,
                9805
            ],
            [
                9808,
                9813
            ],
            [
                9813,
                9814
            ],
            [
                9816,
                9819
            ],
            [
                9820,
                9826
            ],
            [
                9827,
                9834
            ],
            [
                9835,
                9838
            ],
            [
                9839,
                9846
            ],
            [
                9847,
                9859
            ],
            [
                9860,
                9867
            ],
            [
                9868,
                9871
            ],
            [
                9872,
                9884
            ],
            [
                9885,
                9898
            ],
            [
                9903,
                9908
            ],
            [
                9909,
                9920
            ],
            [
                9920,
                9925
            ],
            [
                9926,
                9933
            ],
            [
                9934,
                9946
            ],
            [
                9946,
                9947
            ],
            [
                9948,
                9955
            ],
            [
                9956,
                9975
            ],
            [
                9986,
                10018
            ],
            [
                10019,
                10026
            ],
            [
                10028,
                10045
            ],
            [
                10046,
                10061
            ],
            [
                10062,
                10069
            ],
            [
                10069,
                10106
            ],
            [
                10114,
                10142
            ],
            [
                10143,
                10150
            ],
            [
                10155,
                10166
            ],
            [
                10168,
                10179
            ],
            [
                10185,
                10191
            ],
            [
                10197,
                10221
            ],
            [
                10229,
                10231
            ],
            [
                10234,
                10238
            ],
            [
                10239,
                10247
            ],
            [
                10252,
                10253
            ],
            [
                10254,
                10269
            ],
            [
                10273,
                10279
            ],
            [
                10280,
                10286
            ],
            [
                10289,
                10317
            ],
            [
                10318,
                10343
            ],
            [
                10344,
                10359
            ],
            [
                10360,
                10367
            ],
            [
                10368,
                10396
            ],
            [
                10407,
                10444
            ],
            [
                10448,
                10453
            ],
            [
                10453,
                10467
            ],
            [
                10478,
                10487
            ],
            [
                10495,
                10509
            ],
            [
                10514,
                10515
            ],
            [
                10517,
                10532
            ],
            [
                10533,
                10540
            ],
            [
                10541,
                10565
            ],
            [
                10573,
                10579
            ],
            [
                10580,
                10583
            ],
            [
                10583,
                10584
            ],
            [
                10587,
                10604
            ],
            [
                10605,
                10611
            ],
            [
                10614,
                10615
            ],
            [
                10615,
                10619
            ],
            [
                10620,
                10627
            ],
            [
                10628,
                10634
            ],
            [
                10639,
                10647
            ],
            [
                10648,
                10659
            ],
            [
                10662,
                10667
            ],
            [
                10672,
                10673
            ],
            [
                10675,
                10728
            ],
            [
                10732,
                10784
            ],
            [
                10792,
                10808
            ],
            [
                10811,
                10829
            ],
            [
                10832,
                10845
            ],
            [
                10846,
                10848
            ],
            [
                10853,
                10866
            ],
            [
                10869,
                10878
            ],
            [
                10883,
                10884
            ],
            [
                10886,
                10934
            ],
            [
                10935,
                10941
            ],
            [
                10941,
                10994
            ],
            [
                10995,
                11020
            ],
            [
                11021,
                11028
            ],
            [
                11028,
                11090
            ],
            [
                11110,
                11111
            ],
            [
                11119,
                11132
            ],
            [
                11139,
                11143
            ],
            [
                11151,
                11155
            ],
            [
                11161,
                11163
            ],
            [
                11164,
                11184
            ],
            [
                11185,
                11209
            ],
            [
                11209,
                11210
            ],
            [
                11210,
                11217
            ],
            [
                11228,
                11240
            ],
            [
                11256,
                11257
            ],
            [
                11259,
                11301
            ],
            [
                11308,
                11313
            ],
            [
                11319,
                11331
            ],
            [
                11337,
                11362
            ],
            [
                11370,
                11383
            ],
            [
                11388,
                11397
            ],
            [
                11400,
                11404
            ],
            [
                11405,
                11409
            ],
            [
                11415,
                11417
            ],
            [
                11417,
                11428
            ],
            [
                11432,
                11446
            ],
            [
                11446,
                11453
            ],
            [
                11455,
                11480
            ],
            [
                11480,
                11515
            ],
            [
                11518,
                11532
            ],
            [
                11535,
                11545
            ],
            [
                11548,
                11556
            ],
            [
                11561,
                11562
            ],
            [
                11564,
                11582
            ],
            [
                11583,
                11609
            ],
            [
                11618,
                11634
            ],
            [
                11641,
                11654
            ],
            [
                11662,
                11683
            ],
            [
                11684,
                11719
            ],
            [
                11720,
                11727
            ],
            [
                11728,
                11734
            ],
            [
                11734,
                11735
            ],
            [
                11745,
                11819
            ],
            [
                11822,
                11827
            ],
            [
                11827,
                11828
            ],
            [
                11832,
                11835
            ],
            [
                11835,
                11840
            ],
            [
                11841,
                11847
            ],
            [
                11847,
                11874
            ],
            [
                11874,
                11920
            ],
            [
                11923,
                11929
            ],
            [
                11938,
                11964
            ],
            [
                11968,
                11982
            ],
            [
                11985,
                11999
            ],
            [
                12000,
                12002
            ],
            [
                12004,
                12005
            ],
            [
                12006,
                12021
            ],
            [
                12024,
                12025
            ],
            [
                12025,
                12044
            ],
            [
                12045,
                12083
            ],
            [
                12091,
                12117
            ],
            [
                12118,
                12130
            ],
            [
                12131,
                12136
            ],
            [
                12139,
                12148
            ],
            [
                12156,
                12170
            ],
            [
                12173,
                12206
            ],
            [
                12207,
                12212
            ],
            [
                12213,
                12230
            ],
            [
                12238,
                12240
            ],
            [
                12240,
                12258
            ],
            [
                12258,
                12277
            ],
            [
                12281,
                12311
            ],
            [
                12314,
                12321
            ],
            [
                12328,
                12336
            ],
            [
                12337,
                12339
            ],
            [
                12342,
                12370
            ],
            [
                12383,
                12419
            ],
            [
                12428,
                12440
            ],
            [
                12451,
                12453
            ],
            [
                12453,
                12454
            ],
            [
                12455,
                12474
            ],
            [
                12485,
                12490
            ],
            [
                12498,
                12500
            ],
            [
                12501,
                12601
            ],
            [
                12601,
                12602
            ],
            [
                12603,
                12628
            ],
            [
                12628,
                12630
            ],
            [
                12630,
                12654
            ],
            [
                12655,
                12667
            ],
            [
                12668,
                12715
            ],
            [
                12716,
                12721
            ],
            [
                12728,
                12730
            ],
            [
                12731,
                12740
            ],
            [
                12741,
                12770
            ],
            [
                12771,
                12797
            ],
            [
                12805,
                12848
            ],
            [
                12852,
                12868
            ],
            [
                12871,
                12884
            ],
            [
                12892,
                12914
            ],
            [
                12917,
                12938
            ],
            [
                12940,
                13054
            ],
            [
                13062,
                13064
            ],
            [
                13068,
                13089
            ],
            [
                13092,
                13106
            ],
            [
                13111,
                13112
            ],
            [
                13114,
                13147
            ],
            [
                13160,
                13180
            ],
            [
                13181,
                13212
            ],
            [
                13215,
                13233
            ],
            [
                13236,
                13240
            ],
            [
                13241,
                13247
            ],
            [
                13247,
                13265
            ],
            [
                13271,
                13289
            ],
            [
                13306,
                13316
            ],
            [
                13328,
                13335
            ],
            [
                13339,
                13350
            ],
            [
                13351,
                13363
            ],
            [
                13365,
                13376
            ],
            [
                13385,
                13431
            ],
            [
                13437,
                13440
            ],
            [
                13445,
                13451
            ],
            [
                13457,
                13564
            ],
            [
                13564,
                13565
            ],
            [
                13566,
                13569
            ],
            [
                13586,
                13614
            ],
            [
                13620,
                13635
            ],
            [
                13639,
                13642
            ],
            [
                13643,
                13660
            ],
            [
                13668,
                13676
            ],
            [
                13677,
                13678
            ],
            [
                13678,
                13681
            ],
            [
                13682,
                13685
            ],
            [
                13686,
                13696
            ],
            [
                13699,
                13701
            ],
            [
                13702,
                13742
            ],
            [
                13743,
                13790
            ],
            [
                13793,
                13795
            ],
            [
                13809,
                13820
            ],
            [
                13829,
                13839
            ]
        ],
        "row_chars": [
            [
                0,
                95
            ],
            [
                95,
                255
            ],
            [
                255,
                255
            ],
            [
                255,
                368
            ],
            [
                368,
                407
            ],
            [
                407,
                565
            ],
            [
                565,
                771
            ],
            [
                771,
                896
            ],
            [
                896,
                991
            ],
            [
                991,
                991
            ],
            [
                991,
                1356
            ],
            [
                1356,
                1771
            ],
            [
                1771,
                1826
            ],
            [
                1826,
                1860
            ],
            [
                1860,
                2248
            ],
            [
                2248,
                2354
            ],
            [
                2354,
                2456
            ],
            [
                2456,
                2518
            ],
            [
                2518,
                2664
            ],
            [
                2664,
                2730
            ],
            [
                2730,
                2826
            ],
            [
                2826,
                2875
            ],
            [
                2875,
                2986
            ],
            [
                2986,
                3046
            ],
            [
                3046,
                3097
            ],
            [
                3097,
                3195
            ],
            [
                3195,
                3988
            ],
            [
                3988,
                4054
            ],
            [
                4054,
                4121
            ],
            [
                4121,
                4427
            ],
            [
                4427,
                4452
            ],
            [
                4452,
                4666
            ],
            [
                4666,
                4750
            ],
            [
                4750,
                4856
            ],
            [
                4856,
                4922
            ],
            [
                4922,
                5026
            ],
            [
                5026,
                5182
            ],
            [
                5182,
                5182
            ],
            [
                5182,
                5295
            ],
            [
                5295,
                5549
            ],
            [
                5549,
                6143
            ],
            [
                6143,
                6631
            ],
            [
                6631,
                7012
            ],
            [
                7012,
                7412
            ],
            [
                7412,
                7922
            ],
            [
                7922,
                7962
            ],
            [
                7962,
                8337
            ],
            [
                8337,
                8666
            ],
            [
                8666,
                8732
            ],
            [
                8732,
                8807
            ],
            [
                8807,
                9298
            ],
            [
                9298,
                9531
            ],
            [
                9531,
                9718
            ],
            [
                9718,
                9771
            ],
            [
                9771,
                10168
            ],
            [
                10168,
                10289
            ],
            [
                10289,
                10343
            ],
            [
                10343,
                10453
            ],
            [
                10453,
                10614
            ],
            [
                10614,
                10810
            ],
            [
                10810,
                11139
            ],
            [
                11139,
                11209
            ],
            [
                11209,
                11334
            ],
            [
                11334,
                11399
            ],
            [
                11399,
                11399
            ],
            [
                11399,
                11417
            ],
            [
                11417,
                11431
            ],
            [
                11431,
                11446
            ],
            [
                11446,
                11453
            ],
            [
                11453,
                11480
            ],
            [
                11480,
                11661
            ],
            [
                11661,
                11967
            ],
            [
                11967,
                11985
            ],
            [
                11985,
                12240
            ],
            [
                12240,
                12258
            ],
            [
                12258,
                12328
            ],
            [
                12328,
                12500
            ],
            [
                12500,
                12630
            ],
            [
                12630,
                12630
            ],
            [
                12630,
                12741
            ],
            [
                12741,
                12851
            ],
            [
                12851,
                12891
            ],
            [
                12891,
                13067
            ],
            [
                13067,
                13236
            ],
            [
                13236,
                13365
            ],
            [
                13365,
                13699
            ],
            [
                13699,
                13839
            ]
        ]
    }
}