{
    "original": {
        "text": "The anguish of my knee, continued the corporal, was excessive in itself; and the uneasiness of the cart, with the roughness of the roads, which were terribly cut up--making bad still worse--every step was death to me: so that with the loss of blood, and the want of care-taking of me, and a fever I felt coming on besides----(Poor soul! said my uncle _Toby_)----all together, an' please your honour, was more than I could sustain.\nI was telling my sufferings to a young woman at a peasant's house, where our cart, which was the last of the line, had halted; they had help'd me in, and the young woman had taken a cordial out of her pocket and dropp'd it upon some sugar, and seeing it had cheer'd me, she had given it me a second and a third time ----So I was telling her, an' please your honour, the anguish I was in, and was saying it was so intolerable to me, that I had much rather lie down upon the bed, turning my face towards one which was in the corner of the room--and die, than go on----when, upon her attempting to lead me to it, I fainted away in her arms. She was a good soul! as your honour, said the corporal, wiping his eyes, will hear.\nI thought _love_ had been a joyous thing, quoth my uncle _Toby_.\n'Tis the most serious thing, an' please your honour (sometimes), that is in the world.\nBy the persuasion of the young woman, continued the corporal, the cart with the wounded men set off without me: she had assured them I should expire immediately if I was put into the cart. So when I came to myself ----I found myself in a still quiet cottage, with no one but the young woman, and the peasant and his wife. I was laid across the bed in the corner of the room, with my wounded leg upon a chair, and the young woman beside me, holding the corner of her handkerchief dipp'd in vinegar to my nose with one hand, and rubbing my temples with the other.\nI took her at first for the daughter of the peasant (for it was no inn)--so had offer'd her a little purse with eighteen florins, which my poor brother _Tom_ (here _Trim_ wip'd his eyes) had sent me as a token, by a recruit, just before he set out for _Lisbon_.----\n----I never told your honour that piteous story yet----here _Trim_ wiped his eyes a third time.\nThe young woman call'd the old man and his wife into the room, to show them the money, in order to gain me credit for a bed and what little necessaries I should want, till I should be in a condition to be got to the hospital ----Come then! said she, tying up the little purse --I'll be your banker--but as that office alone will not keep me employ'd, I'll be your nurse too.\nI thought by her manner of speaking this, as well as by her dress, which I then began to consider more attentively----that the young woman could not be the daughter of the peasant.\nShe was in black down to her toes, with her hair conceal'd under a cambric border, laid close to her forehead: she was one of those kind of nuns, an' please your honour, of which, your honour knows, there are a good many in _Flanders_, which they let go loose ----By thy description, _Trim_, said my uncle _Toby_, I dare say she was a young _Beguine_, of which there are none to be found anywhere but in the _Spanish Netherlands_--except at _Amsterdam_----they differ from nuns in this, that they can quit their cloister if they choose to marry; they visit and take care of the sick by profession ----I had rather, for my own part, they did it out of good-nature.\n----She often told me, quoth _Trim_, she did it for the love of Christ --I did not like it. ----I believe, _Trim_, we are both wrong, said my uncle _Toby_--we'll ask Mr. _Yorick_ about it to-night at my brother _Shandy's_----so put me in mind; added my uncle _Toby_.\nThe young _Beguine_, continued the corporal, had scarce given herself time to tell me \"she would be my nurse,\" when she hastily turned about to begin the office of one, and prepare something for me----and in a short time--though I thought it a long one--she came back with flannels, &c. &c., and having fomented my knee soundly for a couple of hours, &c., and made me a thin bason of gruel for my supper--she wish'd me rest, and promised to be with me early in the morning. ----She wished me, an' please your honour, what was not to be had. My fever ran very high that night--her figure made sad disturbance within me --I was every moment cutting the world in two--to give her half of it--and every moment was I crying, That I had nothing but a knapsack and eighteen florins to share with her ----The whole night long was the fair _Beguine_, like an angel, close by my bedside, holding back the curtain and offering me cordials--and I was only awakened from my dream by her coming there at the hour promised, and giving them in reality. In truth, she was scarce ever from me; and so accustomed was I to receive life from her hands, that my heart sickened, and I lost colour when she left the room: and yet, continued the corporal (making one of the strangest reflections upon it in the world)----\n----\"_It was not love_\"----for during the three weeks she was almost constantly with me, fomenting my knee with her hand, night and day --I can honestly say, an' please your honour--that * * * * * * * * * * * * * * * * * once.\nThat was very odd, _Trim_, quoth my uncle _Toby_.\nI think so too--said Mrs. _Wadman_.\nIt never did, said the corporal.",
        "paragraph_chars": [
            [
                0,
                431
            ],
            [
                431,
                1153
            ],
            [
                1153,
                1218
            ],
            [
                1218,
                1305
            ],
            [
                1305,
                1867
            ],
            [
                1867,
                2133
            ],
            [
                2133,
                2229
            ],
            [
                2229,
                2604
            ],
            [
                2604,
                2785
            ],
            [
                2785,
                3449
            ],
            [
                3449,
                3716
            ],
            [
                3716,
                5013
            ],
            [
                5013,
                5240
            ],
            [
                5240,
                5290
            ],
            [
                5290,
                5326
            ],
            [
                5326,
                5358
            ]
        ],
        "segment_chars": [
            [
                0,
                337
            ],
            [
                337,
                431
            ],
            [
                431,
                1069
            ],
            [
                1069,
                1090
            ],
            [
                1090,
                1153
            ],
            [
                1153,
                1218
            ],
            [
                1218,
                1305
            ],
            [
                1305,
                1494
            ],
            [
                1494,
                1627
            ],
            [
                1627,
                1867
            ],
            [
                1867,
                2133
            ],
            [
                2133,
                2229
            ],
            [
                2229,
                2469
            ],
            [
                2469,
                2604
            ],
            [
                2604,
                2785
            ],
            [
                2785,
                3449
            ],
            [
                3449,
                3541
            ],
            [
                3541,
                3716
            ],
            [
                3716,
                4190
            ],
            [
                4190,
                4257
            ],
            [
                4257,
                4753
            ],
            [
                4753,
                5013
            ],
            [
                5013,
                5240
            ],
            [
                5240,
                5290
            ],
            [
                5290,
                5326
            ],
            [
                5326,
                5358
            ]
        ],
        "overlap_chars": [
            [
                4,
                22
            ],
            [
                24,
                47
            ],
            [
                378,
                379
            ],
            [
                48,
                61
            ],
            [
                71,
                103
            ],
            [
                311,
                313
            ],
            [
                110,
                119
            ],
            [
                131,
                136
            ],
            [
                177,
                188
            ],
            [
                190,
                253
            ],
            [
                289,
                296
            ],
            [
                314,
                321
            ],
            [
                22,
                23
            ],
            [
                362,
                374
            ],
            [
                400,
                421
            ],
            [
                429,
                431
            ],
            [
                775,
                776
            ],
            [
                504,
                512
            ],
            [
                550,
                556
            ],
            [
                476,
                480
            ],
            [
                491,
                496
            ],
            [
                556,
                562
            ],
            [
                574,
                584
            ],
            [
                462,
                475
            ],
            [
                611,
                620
            ],
            [
                628,
                638
            ],
            [
                459,
                461
            ],
            [
                675,
                684
            ],
            [
                697,
                704
            ],
            [
                715,
                746
            ],
            [
                431,
                432
            ],
            [
                768,
                771
            ],
            [
                533,
                535
            ],
            [
                797,
                818
            ],
            [
                827,
                894
            ],
            [
                974,
                993
            ],
            [
                997,
                1036
            ],
            [
                900,
                907
            ],
            [
                1039,
                1069
            ],
            [
                1069,
                1090
            ],
            [
                1090,
                1104
            ],
            [
                1142,
                1151
            ],
            [
                1106,
                1140
            ],
            [
                1151,
                1153
            ],
            [
                1153,
                1162
            ],
            [
                1164,
                1168
            ],
            [
                1179,
                1193
            ],
            [
                1195,
                1209
            ],
            [
                1223,
                1246
            ],
            [
                1258,
                1269
            ],
            [
                1270,
                1282
            ],
            [
                1291,
                1304
            ],
            [
                1367,
                1415
            ],
            [
                1492,
                1494
            ],
            [
                1494,
                1508
            ],
            [
                1523,
                1542
            ],
            [
                1549,
                1627
            ],
            [
                1627,
                1666
            ],
            [
                1678,
                1752
            ],
            [
                1767,
                1783
            ],
            [
                1791,
                1812
            ],
            [
                1826,
                1850
            ],
            [
                1865,
                1867
            ],
            [
                1867,
                1894
            ],
            [
                1911,
                1918
            ],
            [
                1895,
                1903
            ],
            [
                2076,
                2077
            ],
            [
                1940,
                1946
            ],
            [
                1955,
                2018
            ],
            [
                2020,
                2023
            ],
            [
                2054,
                2065
            ],
            [
                2090,
                2118
            ],
            [
                2123,
                2126
            ],
            [
                2137,
                2184
            ],
            [
                2188,
                2192
            ],
            [
                2200,
                2214
            ],
            [
                2227,
                2229
            ],
            [
                2233,
                2244
            ],
            [
                2252,
                2290
            ],
            [
                2292,
                2314
            ],
            [
                2290,
                2291
            ],
            [
                2316,
                2361
            ],
            [
                2369,
                2402
            ],
            [
                2431,
                2453
            ],
            [
                2458,
                2467
            ],
            [
                2469,
                2477
            ],
            [
                2507,
                2526
            ],
            [
                2580,
                2602
            ],
            [
                2604,
                2639
            ],
            [
                2644,
                2670
            ],
            [
                2722,
                2759
            ],
            [
                2776,
                2783
            ],
            [
                2760,
                2768
            ],
            [
                2783,
                2784
            ],
            [
                2785,
                2833
            ],
            [
                2844,
                2866
            ],
            [
                2894,
                2929
            ],
            [
                2953,
                3008
            ],
            [
                2933,
                2934
            ],
            [
                3049,
                3068
            ],
            [
                3077,
                3090
            ],
            [
                2879,
                2881
            ],
            [
                2866,
                2867
            ],
            [
                3099,
                3125
            ],
            [
                2929,
                2930
            ],
            [
                3152,
                3155
            ],
            [
                3167,
                3172
            ],
            [
                3186,
                3192
            ],
            [
                3194,
                3213
            ],
            [
                3447,
                3448
            ],
            [
                3241,
                3329
            ],
            [
                3027,
                3031
            ],
            [
                3346,
                3381
            ],
            [
                3386,
                3398
            ],
            [
                3417,
                3447
            ],
            [
                3457,
                3470
            ],
            [
                3472,
                3477
            ],
            [
                3470,
                3471
            ],
            [
                3486,
                3519
            ],
            [
                3539,
                3540
            ],
            [
                3522,
                3539
            ],
            [
                3605,
                3618
            ],
            [
                3620,
                3626
            ],
            [
                3628,
                3645
            ],
            [
                3554,
                3555
            ],
            [
                3646,
                3659
            ],
            [
                3661,
                3669
            ],
            [
                3674,
                3676
            ],
            [
                3681,
                3683
            ],
            [
                3583,
                3596
            ],
            [
                3720,
                3725
            ],
            [
                3737,
                3760
            ],
            [
                3799,
                3801
            ],
            [
                3803,
                3824
            ],
            [
                3735,
                3736
            ],
            [
                3791,
                3793
            ],
            [
                3889,
                3913
            ],
            [
                3917,
                3936
            ],
            [
                3970,
                3998
            ],
            [
                4008,
                4035
            ],
            [
                4044,
                4066
            ],
            [
                4072,
                4090
            ],
            [
                4097,
                4119
            ],
            [
                3883,
                3884
            ],
            [
                3832,
                3835
            ],
            [
                4132,
                4189
            ],
            [
                4211,
                4212
            ],
            [
                4252,
                4255
            ],
            [
                4255,
                4257
            ],
            [
                4257,
                4290
            ],
            [
                4426,
                4427
            ],
            [
                4292,
                4295
            ],
            [
                4336,
                4379
            ],
            [
                4434,
                4435
            ],
            [
                4381,
                4397
            ],
            [
                4405,
                4408
            ],
            [
                4428,
                4434
            ],
            [
                4436,
                4508
            ],
            [
                4513,
                4533
            ],
            [
                4538,
                4546
            ],
            [
                4556,
                4572
            ],
            [
                4422,
                4425
            ],
            [
                4573,
                4593
            ],
            [
                4623,
                4643
            ],
            [
                4645,
                4676
            ],
            [
                4683,
                4696
            ],
            [
                4715,
                4753
            ],
            [
                4763,
                4782
            ],
            [
                4783,
                4798
            ],
            [
                4837,
                4840
            ],
            [
                4810,
                4815
            ],
            [
                4846,
                4870
            ],
            [
                4890,
                4921
            ],
            [
                4923,
                4945
            ],
            [
                4761,
                4762
            ],
            [
                4947,
                4953
            ],
            [
                5019,
                5034
            ],
            [
                5040,
                5148
            ],
            [
                5151,
                5170
            ],
            [
                5182,
                5193
            ],
            [
                5195,
                5225
            ],
            [
                5234,
                5238
            ],
            [
                5245,
                5258
            ],
            [
                5267,
                5281
            ],
            [
                5290,
                5304
            ],
            [
                5306,
                5315
            ],
            [
                5317,
                5323
            ],
            [
                5326,
                5338
            ],
            [
                5340,
                5358
            ]
        ],
        "row_chars": [
            [
                0,
                431
            ],
            [
                431,
                1069
            ],
            [
                1069,
                1090
            ],
            [
                1090,
                1153
            ],
            [
                1153,
                1218
            ],
            [
                1218,
                1305
            ],
            [
                1305,
                1494
            ],
            [
                1494,
                1627
            ],
            [
                1627,
                1867
            ],
            [
                1867,
                2133
            ],
            [
                2133,
                2229
            ],
            [
                2229,
                2469
            ],
            [
                2469,
                2604
            ],
            [
                2604,
                2785
            ],
            [
                2785,
                3449
            ],
            [
                3449,
                3541
            ],
            [
                3541,
                3716
            ],
            [
                3716,
                4190
            ],
            [
                4190,
                4257
            ],
            [
                4257,
                4753
            ],
            [
                4753,
                5013
            ],
            [
                5013,
                5240
            ],
            [
                5240,
                5290
            ],
            [
                5290,
                5326
            ],
            [
                5326,
                5358
            ]
        ]
    },
    "abridged": {
        "text": "'The anguish of my knee,' continued the corporal, 'was excessive; and the uneasiness of the cart on the rough roads made it still worse. Every step was death to me: so that with the loss of blood, and a fever besides, all together it was more than I could bear.\n'Our cart halted at a peasants' house; they helped me in, and a young woman took a cordial from her pocket to give me. Seeing it cheered me, she gave it me a second and a third time.\n'I told her of the anguish I was in, saying it was so intolerable to me, that I had much rather lie down and die, than go on - when, upon her attempting to lead me to the bed, I fainted away in her arms. She was a good soul! as your honour will hear,' said the corporal, wiping his eyes.\n'I thought love was a joyous thing,' quoth my uncle Toby.\n''Tis the most serious thing, your honour, (sometimes), in the world. The cart with the wounded men set off without me. So when I came round, I found myself in a quiet cottage, with no one but the young woman, and the peasant and his wife. I was laid across the bed in the corner, with my wounded leg upon a chair, and the young woman beside me, holding her handkerchief dipped in vinegar to my nose, and rubbing my temples.\n'I took her at first for the peasant's daughter, so had offered her a little purse with eighteen florins, which my poor brother Tom had sent me, just before he set out for Lisbon. - I never told your honour that piteous story yet.' - Here Trim wiped his eyes again.\n'The young woman called the old man and his wife into the room to show them the money,' he went on, 'in order to gain me credit for a bed and what necessaries I should want, till I could be got to the hospital. \"Come then!\" said she; \"I'll be your banker - and I'll be your nurse too.\"\n'I thought by her manner of speaking, as well as by her dress, that the young woman could not be the peasant's daughter. She was in black down to her toes, with her hair concealed under a cambric border: she was one of those kind of nuns, of which, your honour knows, there are a good many in Flanders.'\n'By thy description, Trim,' said my uncle Toby, 'I dare say she was a young Beguine, who are found in the Spanish Netherlands. They differ from nuns in this, that they can quit their cloister if they choose to marry. They take care of the sick by profession - though I had rather they did it out of good-nature.'\n'She often told me,' quoth Trim, 'she did it for the love of Christ. - I did not like it.'\n'We'll ask Mr. Yorick about it to-night, at my brother Shandy's - so remind me,' said my uncle Toby.\n'The young Beguine,' continued the corporal, 'having told me she would be my nurse, went to prepare something for me - and in a short time she came back with flannels, and having fomented my knee for a couple of hours, and made me a thin basin of gruel for my supper, she wished me rest, and promised to be with me early in the morning.\n'I had little rest. My fever ran very high that night - I kept seeing her - I was every moment cutting the world in two, to give her half - and crying that I had nothing but a knapsack and eighteen florins to share with her. The whole night long, I dreamed the fair Beguine, like an angel, was close by my bedside, offering me cordials - and I was only awakened from my dreams by her coming as promised, and giving them in reality. She was scarce ever away from me; and so dependent on her was I, that my heart sickened when she left the room: and yet,' continued the corporal, making a strange observation-\n'- it was not love - for during the three weeks she was almost constantly with me, fomenting my knee with her hand, night and day - I can honestly say, your honour, that * * * * * * * * * * * * * ,not once.'\n'That was very odd, Trim,' quoth my uncle Toby.\n'I think so too,' said Mrs. Wadman.\n'It never did,' said the corporal.",
        "paragraph_chars": [
            [
                0,
                262
            ],
            [
                262,
                445
            ],
            [
                445,
                733
            ],
            [
                733,
                791
            ],
            [
                791,
                1216
            ],
            [
                1216,
                1482
            ],
            [
                1482,
                1768
            ],
            [
                1768,
                2072
            ],
            [
                2072,
                2385
            ],
            [
                2385,
                2476
            ],
            [
                2476,
                2577
            ],
            [
                2577,
                2914
            ],
            [
                2914,
                3522
            ],
            [
                3522,
                3730
            ],
            [
                3730,
                3778
            ],
            [
                3778,
                3814
            ],
            [
                3814,
                3848
            ]
        ],
        "segment_chars": [
            [
                0,
                137
            ],
            [
                137,
                262
            ],
            [
                262,
                381
            ],
            [
                381,
                445
            ],
            [
                445,
                649
            ],
            [
                649,
                670
            ],
            [
                670,
                733
            ],
            [
                733,
                791
            ],
            [
                791,
                861
            ],
            [
                861,
                911
            ],
            [
                911,
                1031
            ],
            [
                1031,
                1216
            ],
            [
                1216,
                1396
            ],
            [
                1396,
                1448
            ],
            [
                1448,
                1482
            ],
            [
                1482,
                1693
            ],
            [
                1693,
                1706
            ],
            [
                1706,
                1768
            ],
            [
                1768,
                1889
            ],
            [
                1889,
                2072
            ],
            [
                2072,
                2199
            ],
            [
                2199,
                2289
            ],
            [
                2289,
                2385
            ],
            [
                2385,
                2454
            ],
            [
                2454,
                2476
            ],
            [
                2476,
                2577
            ],
            [
                2577,
                2914
            ],
            [
                2914,
                2934
            ],
            [
                2934,
                3139
            ],
            [
                3139,
                3346
            ],
            [
                3346,
                3522
            ],
            [
                3522,
                3730
            ],
            [
                3730,
                3778
            ],
            [
                3778,
                3814
            ],
            [
                3814,
                3848
            ]
        ],
        "overlap_chars": [
            [
                5,
                23
            ],
            [
                26,
                49
            ],
            [
                50,
                51
            ],
            [
                51,
                64
            ],
            [
                64,
                96
            ],
            [
                97,
                99
            ],
            [
                100,
                109
            ],
            [
                110,
                115
            ],
            [
                124,
                135
            ],
            [
                137,
                200
            ],
            [
                201,
                208
            ],
            [
                209,
                216
            ],
            [
                216,
                217
            ],
            [
                218,
                230
            ],
            [
                234,
                255
            ],
            [
                260,
                262
            ],
            [
                262,
                263
            ],
            [
                263,
                271
            ],
            [
                272,
                278
            ],
            [
                279,
                283
            ],
            [
                294,
                299
            ],
            [
                299,
                305
            ],
            [
                313,
                323
            ],
            [
                324,
                337
            ],
            [
                343,
                352
            ],
            [
                358,
                368
            ],
            [
                369,
                371
            ],
            [
                381,
                390
            ],
            [
                399,
                406
            ],
            [
                412,
                443
            ],
            [
                446,
                447
            ],
            [
                453,
                456
            ],
            [
                457,
                459
            ],
            [
                460,
                481
            ],
            [
                482,
                549
            ],
            [
                550,
                569
            ],
            [
                572,
                611
            ],
            [
                612,
                619
            ],
            [
                619,
                649
            ],
            [
                649,
                670
            ],
            [
                670,
                684
            ],
            [
                685,
                694
            ],
            [
                697,
                731
            ],
            [
                731,
                733
            ],
            [
                734,
                743
            ],
            [
                744,
                748
            ],
            [
                753,
                767
            ],
            [
                770,
                784
            ],
            [
                797,
                820
            ],
            [
                821,
                832
            ],
            [
                834,
                846
            ],
            [
                847,
                860
            ],
            [
                861,
                909
            ],
            [
                909,
                911
            ],
            [
                911,
                925
            ],
            [
                933,
                952
            ],
            [
                953,
                1031
            ],
            [
                1031,
                1070
            ],
            [
                1070,
                1144
            ],
            [
                1145,
                1161
            ],
            [
                1169,
                1190
            ],
            [
                1190,
                1214
            ],
            [
                1214,
                1216
            ],
            [
                1217,
                1244
            ],
            [
                1245,
                1252
            ],
            [
                1255,
                1263
            ],
            [
                1263,
                1264
            ],
            [
                1265,
                1271
            ],
            [
                1280,
                1343
            ],
            [
                1344,
                1347
            ],
            [
                1348,
                1359
            ],
            [
                1359,
                1387
            ],
            [
                1391,
                1394
            ],
            [
                1398,
                1445
            ],
            [
                1450,
                1454
            ],
            [
                1460,
                1474
            ],
            [
                1480,
                1482
            ],
            [
                1487,
                1498
            ],
            [
                1506,
                1544
            ],
            [
                1545,
                1567
            ],
            [
                1580,
                1581
            ],
            [
                1583,
                1628
            ],
            [
                1629,
                1662
            ],
            [
                1669,
                1691
            ],
            [
                1694,
                1703
            ],
            [
                1706,
                1714
            ],
            [
                1717,
                1736
            ],
            [
                1743,
                1765
            ],
            [
                1769,
                1804
            ],
            [
                1804,
                1830
            ],
            [
                1831,
                1868
            ],
            [
                1869,
                1876
            ],
            [
                1879,
                1887
            ],
            [
                1887,
                1888
            ],
            [
                1889,
                1937
            ],
            [
                1948,
                1970
            ],
            [
                1970,
                2005
            ],
            [
                2005,
                2060
            ],
            [
                2072,
                2073
            ],
            [
                2073,
                2092
            ],
            [
                2100,
                2113
            ],
            [
                2114,
                2116
            ],
            [
                2118,
                2119
            ],
            [
                2121,
                2147
            ],
            [
                2155,
                2156
            ],
            [
                2161,
                2164
            ],
            [
                2165,
                2170
            ],
            [
                2171,
                2177
            ],
            [
                2178,
                2197
            ],
            [
                2197,
                2198
            ],
            [
                2199,
                2287
            ],
            [
                2289,
                2293
            ],
            [
                2294,
                2329
            ],
            [
                2339,
                2351
            ],
            [
                2352,
                2382
            ],
            [
                2390,
                2403
            ],
            [
                2406,
                2411
            ],
            [
                2416,
                2417
            ],
            [
                2419,
                2452
            ],
            [
                2452,
                2453
            ],
            [
                2456,
                2473
            ],
            [
                2477,
                2490
            ],
            [
                2491,
                2497
            ],
            [
                2498,
                2515
            ],
            [
                2515,
                2516
            ],
            [
                2517,
                2530
            ],
            [
                2531,
                2539
            ],
            [
                2542,
                2544
            ],
            [
                2552,
                2554
            ],
            [
                2557,
                2570
            ],
            [
                2582,
                2587
            ],
            [
                2598,
                2621
            ],
            [
                2635,
                2637
            ],
            [
                2638,
                2659
            ],
            [
                2659,
                2660
            ],
            [
                2666,
                2668
            ],
            [
                2669,
                2693
            ],
            [
                2696,
                2715
            ],
            [
                2716,
                2744
            ],
            [
                2745,
                2772
            ],
            [
                2773,
                2795
            ],
            [
                2796,
                2814
            ],
            [
                2821,
                2843
            ],
            [
                2843,
                2844
            ],
            [
                2845,
                2848
            ],
            [
                2856,
                2913
            ],
            [
                2914,
                2915
            ],
            [
                2917,
                2920
            ],
            [
                2932,
                2934
            ],
            [
                2934,
                2967
            ],
            [
                2970,
                2971
            ],
            [
                2984,
                2987
            ],
            [
                2990,
                3033
            ],
            [
                3033,
                3034
            ],
            [
                3035,
                3051
            ],
            [
                3054,
                3057
            ],
            [
                3058,
                3064
            ],
            [
                3065,
                3137
            ],
            [
                3139,
                3159
            ],
            [
                3171,
                3179
            ],
            [
                3187,
                3203
            ],
            [
                3204,
                3207
            ],
            [
                3208,
                3228
            ],
            [
                3229,
                3249
            ],
            [
                3252,
                3283
            ],
            [
                3291,
                3304
            ],
            [
                3308,
                3346
            ],
            [
                3346,
                3365
            ],
            [
                3371,
                3386
            ],
            [
                3400,
                3403
            ],
            [
                3404,
                3409
            ],
            [
                3409,
                3433
            ],
            [
                3434,
                3465
            ],
            [
                3468,
                3490
            ],
            [
                3490,
                3491
            ],
            [
                3492,
                3498
            ],
            [
                3525,
                3540
            ],
            [
                3543,
                3651
            ],
            [
                3654,
                3673
            ],
            [
                3674,
                3685
            ],
            [
                3687,
                3717
            ],
            [
                3723,
                3727
            ],
            [
                3736,
                3749
            ],
            [
                3757,
                3771
            ],
            [
                3779,
                3793
            ],
            [
                3796,
                3805
            ],
            [
                3806,
                3812
            ],
            [
                3815,
                3827
            ],
            [
                3830,
                3848
            ]
        ],
        "row_chars": [
            [
                0,
                262
            ],
            [
                262,
                649
            ],
            [
                649,
                670
            ],
            [
                670,
                733
            ],
            [
                733,
                791
            ],
            [
                791,
                861
            ],
            [
                861,
                911
            ],
            [
                911,
                1031
            ],
            [
                1031,
                1216
            ],
            [
                1216,
                1396
            ],
            [
                1396,
                1482
            ],
            [
                1482,
                1706
            ],
            [
                1706,
                1768
            ],
            [
                1768,
                1889
            ],
            [
                1889,
                2385
            ],
            [
                2385,
                2476
            ],
            [
                2476,
                2577
            ],
            [
                2577,
                2914
            ],
            [
                2914,
                2934
            ],
            [
                2934,
                3346
            ],
            [
                3346,
                3522
            ],
            [
                3522,
                3730
            ],
            [
                3730,
                3778
            ],
            [
                3778,
                3814
            ],
            [
                3814,
                3848
            ]
        ]
    }
}