{
    "original": {
        "text": "My father had such a skirmishing, cutting kind of a slashing way with him, in his disputations, thrusting and ripping, and giving every one a stroke to remember him by in his turn--that if there were twenty people in company--in less than half an hour he was sure to have every one of 'em against him.\nWhat did not a little contribute to leave him thus without an ally, was, that if there was any one post more untenable than the rest, he would be sure to throw himself into it; and to do him justice, when he was once there, he would defend it so gallantly, that 'twould have been a concern, either to a brave man or a good-natured one, to have seen him driven out.\n_Yorick_, for this reason, though he would often attack him--yet could never bear to do it with all his force.\nDoctor _Slop's_ VIRGINITY, in the close of the last chapter, had got him for once on the right side of the rampart; and he was beginning to blow up all the convents in _Christendom_ about _Slop's_ ears, when corporal _Trim_ came into the parlour to inform my uncle _Toby_, that his thin scarlet breeches, in which the attack was to be made upon Mrs. _Wadman_, would not do; for that the taylor, in ripping them up, in order to turn them, had found they had been turn'd before ----Then turn them again, brother, said my father, rapidly, for there will be many a turning of 'em yet before all's done in the affair ----They are as rotten as dirt, said the corporal ----Then by all means, said my father, bespeak a new pair, brother----for though I know, continued my father, turning himself to the company, that widow _Wadman_ has been deeply in love with my brother _Toby_ for many years, and has used every art and circumvention of woman to outwit him into the same passion, yet now that she has caught him----her fever will be pass'd its height----\n----She has gain'd her point.\nIn this case, continued my father, which _Plato_, I am persuaded, never thought of ----Love, you see, is not so much a SENTIMENT as a SITUATION, into which a man enters, as my brother _Toby_ would do, into a _corps_----no matter whether he loves the service or no----being once in it--he acts as if he did; and takes every step to shew himself a man of prowesse.\nThe hypothesis, like the rest of my father's, was plausible enough, and my uncle _Toby_ had but a single word to object to it--in which _Trim_ stood ready to second him----but my father had not drawn his conclusion----\nFor this reason, continued my father (stating the case over again)--notwithstanding all the world knows, that Mrs. _Wadman_ _affects_ my brother _Toby_--and my brother _Toby_ contrariwise _affects_ Mrs. _Wadman_, and no obstacle in nature to forbid the music striking up this very night, yet will I answer for it, that this self-same tune will not be play'd this twelvemonth.\nWe have taken our measures badly, quoth my uncle _Toby_, looking up interrogatively in _Trim's_ face.\nI would lay my _Montero_-cap, said _Trim_ ----Now _Trim's_ _Montero_-cap, as I once told you, was his constant wager; and having furbish'd it up that very night, in order to go upon the attack--it made the odds look more considerable ----I would lay, an' please your honour, my _Montero_-cap to a shilling--was it proper, continued _Trim_ (making a bow), to offer a wager before your honours----\n----There is nothing improper in it, said my father--'tis a mode of expression; for in saying thou would'st lay thy _Montero_-cap to a shilling--all thou meanest is this--that thou believest--\n----Now, What do'st thou believe?\nThat widow _Wadman_, an' please your worship, cannot hold it out ten days----\nAnd whence, cried _Slop_, jeeringly, hast thou all this knowledge of woman, friend?\nBy falling in love with a popish clergywoman; said _Trim_.\n'Twas a _Beguine_, said my uncle _Toby_.\nDoctor _Slop_ was too much in wrath to listen to the distinction; and my father taking that very crisis to fall in helter-skelter upon the whole order of Nuns and _Beguines_, a set of silly, fusty, baggages----_Slop_ could not stand it----and my uncle _Toby_ having some measures to take about his breeches--and _Yorick_ about his fourth general division--in order for their several attacks next day--the company broke up: and my father being left alone, and having half an hour upon his hands betwixt that and bed-time; he called for pen, ink, and paper, and wrote my uncle _Toby_ the following letter of instructions:\nMY DEAR BROTHER _Toby_,\nWhat I am going to say to thee is upon the nature of women, and of love-making to them; and perhaps it is as well for thee--tho' not so well for me--that thou hast occasion for a letter of instructions upon that head, and that I am able to write it to thee.\nHad it been the good pleasure of him who disposes of our lots--and thou no sufferer by the knowledge, I had been well content that thou should'st have dipp'd the pen this moment into the ink, instead of myself; but that not being the case ------------Mrs. _Shandy_ being now close beside me, preparing for bed ----I have thrown together without order, and just as they have come into my mind, such hints and documents as I deem may be of use to thee; intending, in this, to give thee a token of my love; not doubting, my dear _Toby_, of the manner in which it will be accepted.\nIn the first place, with regard to all which concerns religion in the affair----though I perceive from a glow in my cheek, that I blush as I begin to speak to thee upon the subject, as well knowing, notwithstanding thy unaffected secrecy, how few of its offices thou neglectest--yet I would remind thee of one (during the continuance of thy courtship) in a particular manner, which I would not have omitted; and that is, never to go forth upon the enterprize, whether it be in the morning or the afternoon, without first recommending thyself to the protection of Almighty God, that he may defend thee from the evil one.\nShave the whole top of thy crown clean once at least every four or five days, but oftener if convenient; lest in taking off thy wig before her, thro' absence of mind, she should be able to discover how much has been cut away by Time----how much by _Trim_.\n--'Twere better to keep ideas of baldness out of her fancy.\nAlways carry it in thy mind, and act upon it as a sure maxim, _Toby_----\n\"_That women are timid:_\" And 'tis well they are----else there would be no dealing with them.\nLet not thy breeches be too tight, or hang too loose about thy thighs, like the trunk-hose of our ancestors.\n----A just medium prevents all conclusions.\nWhatever thou hast to say, be it more or less, forget not to utter it in a low soft tone of voice. Silence, and whatever approaches it, weaves dreams of midnight secrecy into the brain: For this cause, if thou canst help it, never throw down the tongs and poker.\nAvoid all kinds of pleasantry and facetiousness in thy discourse with her, and do whatever lies in thy power at the same time, to keep from her all books and writings which tend thereto: there are some devotional tracts, which if thou canst entice her to read over--it will be well: but suffer her not to look into _Rabelais_, or _Scarron_, or _Don Quixote_----\n----They are all books which excite laughter; and thou knowest, dear _Toby_, that there is no passion so serious as lust.\nStick a pin in the bosom of thy shirt, before thou enterest her parlour.\nAnd if thou art permitted to sit upon the same sopha with her, and she gives thee occasion to lay thy hand upon hers--beware of taking it----thou canst not lay thy hand on hers, but she will feel the temper of thine. Leave that and as many other things as thou canst, quite undetermined; by so doing, thou wilt have her curiosity on thy side; and if she is not conquered by that, and thy ASSE continues still kicking, which there is great reason to suppose ----Thou must begin, with first losing a few ounces of blood below the ears, according to the practice of the ancient _Scythians_, who cured the most intemperate fits of the appetite by that means.\n_Avicenna_, after this, is for having the part anointed with the syrup of hellebore, using proper evacuations and purges----and I believe rightly. But thou must eat little or no goat's flesh, nor red deer----nor even foal's flesh by any means; and carefully abstain----that is, as much as thou canst, from peacocks, cranes, coots, didappers, and water-hens----\nAs for thy drink --I need not tell thee, it must be the infusion of VERVAIN and the herb HANEA, of which _lian_ relates such effects--but if thy stomach palls with it--discontinue it from time to time, taking cucumbers, melons, purslane, water-lillies, woodbine, and lettice, in the stead of them.\nThere is nothing further for thee, which occurs to me at present----\n----Unless the breaking out of a fresh war ----So wishing everything, dear _Toby_, for the best,\nI rest thy affectionate brother,\nWALTER SHANDY.",
        "paragraph_chars": [
            [
                0,
                302
            ],
            [
                302,
                667
            ],
            [
                667,
                778
            ],
            [
                778,
                1827
            ],
            [
                1827,
                1857
            ],
            [
                1857,
                2220
            ],
            [
                2220,
                2439
            ],
            [
                2439,
                2815
            ],
            [
                2815,
                2917
            ],
            [
                2917,
                3313
            ],
            [
                3313,
                3506
            ],
            [
                3506,
                3540
            ],
            [
                3540,
                3618
            ],
            [
                3618,
                3702
            ],
            [
                3702,
                3761
            ],
            [
                3761,
                3802
            ],
            [
                3802,
                4422
            ],
            [
                4422,
                4446
            ],
            [
                4446,
                4704
            ],
            [
                4704,
                5282
            ],
            [
                5282,
                5902
            ],
            [
                5902,
                6158
            ],
            [
                6158,
                6218
            ],
            [
                6218,
                6291
            ],
            [
                6291,
                6385
            ],
            [
                6385,
                6494
            ],
            [
                6494,
                6538
            ],
            [
                6538,
                6801
            ],
            [
                6801,
                7163
            ],
            [
                7163,
                7285
            ],
            [
                7285,
                7358
            ],
            [
                7358,
                8013
            ],
            [
                8013,
                8374
            ],
            [
                8374,
                8672
            ],
            [
                8672,
                8741
            ],
            [
                8741,
                8838
            ],
            [
                8838,
                8871
            ],
            [
                8871,
                8885
            ]
        ],
        "segment_chars": [
            [
                0,
                302
            ],
            [
                302,
                667
            ],
            [
                667,
                778
            ],
            [
                778,
                1827
            ],
            [
                1827,
                1857
            ],
            [
                1857,
                2220
            ],
            [
                2220,
                2439
            ],
            [
                2439,
                2815
            ],
            [
                2815,
                2917
            ],
            [
                2917,
                3313
            ],
            [
                3313,
                3506
            ],
            [
                3506,
                3540
            ],
            [
                3540,
                3618
            ],
            [
                3618,
                3702
            ],
            [
                3702,
                3761
            ],
            [
                3761,
                3802
            ],
            [
                3802,
                4422
            ],
            [
                4422,
                4446
            ],
            [
                4446,
                4704
            ],
            [
                4704,
                5282
            ],
            [
                5282,
                5902
            ],
            [
                5902,
                6158
            ],
            [
                6158,
                6218
            ],
            [
                6218,
                6291
            ],
            [
                6291,
                6385
            ],
            [
                6385,
                6494
            ],
            [
                6494,
                6538
            ],
            [
                6538,
                6637
            ],
            [
                6637,
                6801
            ],
            [
                6801,
                7163
            ],
            [
                7163,
                7285
            ],
            [
                7285,
                7358
            ],
            [
                7358,
                7575
            ],
            [
                7575,
                8013
            ],
            [
                8013,
                8160
            ],
            [
                8160,
                8374
            ],
            [
                8374,
                8672
            ],
            [
                8672,
                8741
            ],
            [
                8741,
                8838
            ],
            [
                8838,
                8871
            ],
            [
                8871,
                8885
            ]
        ],
        "overlap_chars": [
            [
                0,
                33
            ],
            [
                52,
                81
            ],
            [
                96,
                129
            ],
            [
                140,
                167
            ],
            [
                181,
                224
            ],
            [
                94,
                95
            ],
            [
                226,
                302
            ],
            [
                368,
                369
            ],
            [
                380,
                396
            ],
            [
                406,
                482
            ],
            [
                514,
                581
            ],
            [
                603,
                614
            ],
            [
                335,
                337
            ],
            [
                344,
                347
            ],
            [
                662,
                667
            ],
            [
                668,
                674
            ],
            [
                675,
                726
            ],
            [
                732,
                778
            ],
            [
                778,
                784
            ],
            [
                786,
                792
            ],
            [
                794,
                850
            ],
            [
                860,
                945
            ],
            [
                947,
                958
            ],
            [
                960,
                965
            ],
            [
                967,
                973
            ],
            [
                975,
                994
            ],
            [
                1002,
                1042
            ],
            [
                1449,
                1451
            ],
            [
                1051,
                1127
            ],
            [
                1129,
                1135
            ],
            [
                1136,
                1155
            ],
            [
                1161,
                1164
            ],
            [
                1049,
                1050
            ],
            [
                1202,
                1239
            ],
            [
                1247,
                1253
            ],
            [
                1263,
                1287
            ],
            [
                1289,
                1304
            ],
            [
                1314,
                1375
            ],
            [
                1399,
                1420
            ],
            [
                1422,
                1439
            ],
            [
                1196,
                1201
            ],
            [
                1487,
                1497
            ],
            [
                1463,
                1477
            ],
            [
                1510,
                1527
            ],
            [
                1529,
                1538
            ],
            [
                1548,
                1557
            ],
            [
                1566,
                1581
            ],
            [
                1582,
                1592
            ],
            [
                1594,
                1600
            ],
            [
                1602,
                1641
            ],
            [
                1649,
                1687
            ],
            [
                1706,
                1750
            ],
            [
                1752,
                1783
            ],
            [
                1171,
                1172
            ],
            [
                1787,
                1804
            ],
            [
                1812,
                1822
            ],
            [
                1831,
                1838
            ],
            [
                1846,
                1857
            ],
            [
                1857,
                1869
            ],
            [
                1871,
                1880
            ],
            [
                1869,
                1870
            ],
            [
                1944,
                1948
            ],
            [
                1959,
                2025
            ],
            [
                2027,
                2040
            ],
            [
                2048,
                2053
            ],
            [
                2063,
                2064
            ],
            [
                2218,
                2219
            ],
            [
                2076,
                2120
            ],
            [
                1890,
                1891
            ],
            [
                2130,
                2140
            ],
            [
                1905,
                1906
            ],
            [
                2142,
                2187
            ],
            [
                2193,
                2209
            ],
            [
                2220,
                2234
            ],
            [
                2266,
                2300
            ],
            [
                2330,
                2332
            ],
            [
                2308,
                2311
            ],
            [
                2340,
                2345
            ],
            [
                2392,
                2413
            ],
            [
                2439,
                2454
            ],
            [
                2456,
                2465
            ],
            [
                2454,
                2455
            ],
            [
                2523,
                2542
            ],
            [
                2544,
                2553
            ],
            [
                2555,
                2561
            ],
            [
                2573,
                2583
            ],
            [
                2678,
                2680
            ],
            [
                2542,
                2543
            ],
            [
                2592,
                2606
            ],
            [
                2637,
                2641
            ],
            [
                2643,
                2649
            ],
            [
                2650,
                2667
            ],
            [
                2681,
                2730
            ],
            [
                2736,
                2737
            ],
            [
                2731,
                2735
            ],
            [
                2738,
                2751
            ],
            [
                2753,
                2757
            ],
            [
                2485,
                2488
            ],
            [
                2768,
                2789
            ],
            [
                2668,
                2670
            ],
            [
                2815,
                2847
            ],
            [
                2849,
                2863
            ],
            [
                2915,
                2917
            ],
            [
                3170,
                3171
            ],
            [
                2917,
                2931
            ],
            [
                2933,
                2940
            ],
            [
                2942,
                2945
            ],
            [
                2947,
                2951
            ],
            [
                2963,
                2966
            ],
            [
                2972,
                2974
            ],
            [
                2977,
                2984
            ],
            [
                2986,
                3050
            ],
            [
                3056,
                3061
            ],
            [
                3099,
                3109
            ],
            [
                2945,
                2946
            ],
            [
                3111,
                3132
            ],
            [
                3155,
                3166
            ],
            [
                3192,
                3194
            ],
            [
                3196,
                3203
            ],
            [
                3205,
                3222
            ],
            [
                3228,
                3230
            ],
            [
                3224,
                3227
            ],
            [
                3231,
                3237
            ],
            [
                3272,
                3308
            ],
            [
                3323,
                3348
            ],
            [
                3350,
                3364
            ],
            [
                3348,
                3349
            ],
            [
                3367,
                3391
            ],
            [
                3458,
                3461
            ],
            [
                3475,
                3477
            ],
            [
                3484,
                3503
            ],
            [
                3510,
                3519
            ],
            [
                3526,
                3538
            ],
            [
                3545,
                3550
            ],
            [
                3552,
                3558
            ],
            [
                3586,
                3597
            ],
            [
                3601,
                3613
            ],
            [
                3618,
                3628
            ],
            [
                3630,
                3635
            ],
            [
                3637,
                3641
            ],
            [
                3644,
                3654
            ],
            [
                3660,
                3700
            ],
            [
                3702,
                3746
            ],
            [
                3748,
                3752
            ],
            [
                3767,
                3768
            ],
            [
                3780,
                3793
            ],
            [
                3802,
                3808
            ],
            [
                3810,
                3814
            ],
            [
                3816,
                3823
            ],
            [
                3838,
                3893
            ],
            [
                3906,
                3913
            ],
            [
                3917,
                3964
            ],
            [
                3970,
                3974
            ],
            [
                3975,
                3976
            ],
            [
                3977,
                4008
            ],
            [
                4013,
                4017
            ],
            [
                4019,
                4037
            ],
            [
                4041,
                4053
            ],
            [
                4061,
                4108
            ],
            [
                4203,
                4223
            ],
            [
                4229,
                4295
            ],
            [
                4313,
                4321
            ],
            [
                4340,
                4341
            ],
            [
                4326,
                4340
            ],
            [
                4347,
                4376
            ],
            [
                4384,
                4422
            ],
            [
                4422,
                4437
            ],
            [
                4444,
                4446
            ],
            [
                4446,
                4537
            ],
            [
                4546,
                4551
            ],
            [
                4595,
                4704
            ],
            [
                4955,
                4959
            ],
            [
                4961,
                4967
            ],
            [
                4969,
                4978
            ],
            [
                4994,
                5013
            ],
            [
                5018,
                5040
            ],
            [
                4804,
                4805
            ],
            [
                5060,
                5107
            ],
            [
                5122,
                5126
            ],
            [
                5132,
                5145
            ],
            [
                5153,
                5206
            ],
            [
                5280,
                5282
            ],
            [
                5289,
                5294
            ],
            [
                5300,
                5316
            ],
            [
                5336,
                5347
            ],
            [
                5352,
                5358
            ],
            [
                5362,
                5370
            ],
            [
                5521,
                5559
            ],
            [
                5561,
                5591
            ],
            [
                5593,
                5599
            ],
            [
                5619,
                5632
            ],
            [
                5688,
                5729
            ],
            [
                5787,
                5902
            ],
            [
                5902,
                5928
            ],
            [
                5935,
                5940
            ],
            [
                5955,
                6045
            ],
            [
                6069,
                6079
            ],
            [
                6091,
                6134
            ],
            [
                6167,
                6218
            ],
            [
                6218,
                6224
            ],
            [
                6245,
                6246
            ],
            [
                6278,
                6279
            ],
            [
                6298,
                6313
            ],
            [
                6317,
                6339
            ],
            [
                6343,
                6385
            ],
            [
                6385,
                6494
            ],
            [
                6538,
                6564
            ],
            [
                6599,
                6616
            ],
            [
                6583,
                6584
            ],
            [
                6617,
                6637
            ],
            [
                6637,
                6644
            ],
            [
                6674,
                6722
            ],
            [
                6799,
                6801
            ],
            [
                6801,
                6882
            ],
            [
                6945,
                6948
            ],
            [
                7031,
                7041
            ],
            [
                6928,
                6944
            ],
            [
                6949,
                6954
            ],
            [
                6968,
                7027
            ],
            [
                7056,
                7065
            ],
            [
                7084,
                7087
            ],
            [
                7099,
                7102
            ],
            [
                7049,
                7052
            ],
            [
                7103,
                7115
            ],
            [
                7117,
                7125
            ],
            [
                7126,
                7130
            ],
            [
                7146,
                7157
            ],
            [
                7167,
                7175
            ],
            [
                7180,
                7231
            ],
            [
                7238,
                7285
            ],
            [
                7362,
                7404
            ],
            [
                7411,
                7424
            ],
            [
                7449,
                7474
            ],
            [
                7504,
                7535
            ],
            [
                7554,
                7575
            ],
            [
                7575,
                7585
            ],
            [
                7632,
                7645
            ],
            [
                7649,
                7651
            ],
            [
                7659,
                7699
            ],
            [
                7705,
                7745
            ],
            [
                7751,
                7760
            ],
            [
                7767,
                7774
            ],
            [
                7614,
                7618
            ],
            [
                7824,
                7834
            ],
            [
                7646,
                7648
            ],
            [
                7847,
                7932
            ],
            [
                7939,
                7943
            ],
            [
                7944,
                7984
            ],
            [
                7989,
                8013
            ],
            [
                8014,
                8022
            ],
            [
                8037,
                8110
            ],
            [
                8127,
                8133
            ],
            [
                8137,
                8160
            ],
            [
                8169,
                8217
            ],
            [
                8255,
                8278
            ],
            [
                8314,
                8342
            ],
            [
                8355,
                8369
            ],
            [
                8374,
                8390
            ],
            [
                8393,
                8478
            ],
            [
                8481,
                8484
            ],
            [
                8486,
                8506
            ],
            [
                8508,
                8532
            ],
            [
                8574,
                8575
            ],
            [
                8583,
                8619
            ],
            [
                8625,
                8640
            ],
            [
                8670,
                8672
            ],
            [
                8672,
                8696
            ],
            [
                8707,
                8736
            ],
            [
                8788,
                8815
            ],
            [
                8822,
                8838
            ],
            [
                8838,
                8871
            ],
            [
                8871,
                8885
            ]
        ],
        "row_chars": [
            [
                0,
                302
            ],
            [
                302,
                667
            ],
            [
                667,
                778
            ],
            [
                778,
                1857
            ],
            [
                1857,
                2220
            ],
            [
                2220,
                2439
            ],
            [
                2439,
                2815
            ],
            [
                2815,
                2917
            ],
            [
                2917,
                3313
            ],
            [
                3313,
                3540
            ],
            [
                3540,
                3618
            ],
            [
                3618,
                3702
            ],
            [
                3702,
                3761
            ],
            [
                3761,
                3802
            ],
            [
                3802,
                4422
            ],
            [
                4422,
                4446
            ],
            [
                4446,
                4704
            ],
            [
                4704,
                5282
            ],
            [
                5282,
                5902
            ],
            [
                5902,
                6158
            ],
            [
                6158,
                6218
            ],
            [
                6218,
                6291
            ],
            [
                6291,
                6385
            ],
            [
                6385,
                6494
            ],
            [
                6494,
                6538
            ],
            [
                6538,
                6637
            ],
            [
                6637,
                6801
            ],
            [
                6801,
                7163
            ],
            [
                7163,
                7285
            ],
            [
                7285,
                7358
            ],
            [
                7358,
                7575
            ],
            [
                7575,
                8013
            ],
            [
                8013,
                8160
            ],
            [
                8160,
                8374
            ],
            [
                8374,
                8672
            ],
            [
                8672,
                8741
            ],
            [
                8741,
                8838
            ],
            [
                8838,
                8871
            ],
            [
                8871,
                8885
            ]
        ]
    },
    "abridged": {
        "text": "My father had such a skirmishing, slashing way with him, in his arguments - thrusting and ripping, and giving everyone a stroke to remember him by - that if there were twenty people in company, in less than half an hour he was sure to have every one of 'em against him.\nMoreover, if there was any position more untenable than the rest, he would be sure to throw himself into it; and once there, he would defend it so gallantly, that 'twould have been difficult for a brave man to drive him out.\nYorick, for this reason, though he would often attack him, could never bear to do it with all his force.\nDoctor Slop's Virginity, in the close of the last chapter, had got him on the right side of the rampart; and he was beginning to blow up all the convents in Christendom about Slop's ears, when corporal Trim came into the parlour to inform my uncle Toby that his thin scarlet breeches, in which the attack was to be made upon Mrs. Wadman, would not do; for the tailor, about to turn them, had found they had been turned before.\n'Then turn them again, brother,' said my father, 'for there will be many a turning of 'em yet before all's done.'\n'They are as rotten as dirt,' said the corporal.\n'Then order a new pair,' said my father; 'for though I know,' he continued, turning to the company, 'that widow Wadman has been deeply in love with my brother Toby for many years, and has used every art of woman to outwit him into the same passion - yet now that she has caught him, her fever will be past its height - she has gained her point.\n'In this case,' he continued, 'Love is not so much a Sentiment as a Situation, into which a man enters as my brother Toby would enter a battalion. No matter whether he loves the service or no, once in it, he acts as if he did; and takes every step to show himself a man of prowess.'\nThe hypothesis was plausible enough, and my uncle Toby had only one objection to it - but my father had not finished.\n'For this reason,' he continued, 'although all the world knows that Mrs. Wadman loves my brother Toby, and my brother Toby loves Mrs. Wadman, and no obstacle can forbid the music striking up this very night, yet I will answer for it that the same tune will not be played in a year.'\n'We have taken our measures badly,' quoth my uncle Toby to Trim.\n'I would lay my Montero-cap,' said Trim - now Trim's Montero-cap, as I once told you, was his constant wager; and having furbished it up for the attack, it made the odds look better - 'I would lay my Montero-cap to a shilling - if it was proper to offer a wager before your honours-'\n'There is nothing improper in it,' said my father, ''tis a mode of expression. All it means is that thou believest - now, what dost thou believe?'\n'That widow Wadman cannot hold out ten days.'\n'And whence,' cried Slop jeeringly, 'hast thou all this knowledge of woman, friend?'\n'By falling in love with a popish clergywoman,' said Trim.\n''Twas a Beguine,' said my uncle Toby.\nDoctor Slop was too angry to listen to the distinction; and my father taking that chance to fall helter-skelter upon the whole order of Nuns and Beguines, as a set of silly, fusty, baggages - Slop could not stand it - and my uncle Toby having some measures to take about his breeches - the company broke up.\nMy father being left alone, and having half an hour upon his hands before bed-time, called for pen and paper, and wrote my uncle Toby the following letter of instructions:\nMY DEAR BROTHER TOBY,\nWhat I am going to say to thee is upon the nature of women, and of love-making to them; and it is good that thou hast occasion for a letter of instructions upon that head, and that I am able to write it to thee.\nMrs. Shandy being now nearby, preparing for bed - I have thrown together, just as they have come into my mind, such hints as I judge may be of use; intending, in this, to give thee a token of my love.\nFirstly, with regard to religion in this affair - though I know how few of its offices thou neglectest - yet I would remind thee of one thing during thy courtship; and that is, never to go forth upon the enterprise, without first recommending thyself to the protection of Almighty God, that he may defend thee from the evil one.\nShave the whole top of thy head clean every four or five days, but oftener if convenient; lest in taking off thy wig before her, she should discover how much has been cut away by Time.\n'Twere better to keep ideas of baldness out of her fancy.\nAlways remember, Toby,\n'That women are timid.' And 'tis well they are - or else there would be no dealing with them.\nLet not thy breeches be too tight, or hang too loose about thy thighs, like the trunk-hose of our ancestors.\nWhatever thou hast to say, utter it in a low, soft tone of voice. Silence weaves dreams of midnight secrecy into the brain.\nAvoid all kinds of pleasantry and facetiousness in thy discourse with her, and do all thou canst to keep from her books which tend thereto: there are some devotional tracts, which she may read over - but do not allow her to look into Rabelais, or Don Quixote.\nThey are books which excite laughter; and thou knowest, dear Toby, that there is no passion so serious as lust.\nIf thou art permitted to sit upon the same sofa with her, and to lay thy hand upon hers - beware: - thou canst not lay thy hand on hers, without her feeling the temper of thine. Leave that undetermined; so that thou wilt have her curiosity on thy side. If she is not conquered by that, and thy Ass continues kicking - thou must begin by losing a few ounces of blood below the ears, according to the practice of the ancient Scythians, who cured the most intemperate fits of appetite by that means.\nAvicenna is for having the part anointed with the syrup of hellebore, using proper purges - and I believe rightly. Thou must eat little or no goat's flesh, nor red deer; and carefully abstain from peacocks, cranes, coots and water-hens.\nAs for thy drink - I need not tell thee, it must be the infusion of Vervain and the herb Hanea, of which Aelian relates such effects - but if thy stomach palls, take cucumbers, melons, purslane, water-lilies, woodbine, and lettuce instead.\nThere is nothing further which occurs to me at present-\nSo wishing everything, dear Toby, for the best,\nI rest thy affectionate brother,\nWALTER SHANDY.",
        "paragraph_chars": [
            [
                0,
                270
            ],
            [
                270,
                495
            ],
            [
                495,
                600
            ],
            [
                600,
                1027
            ],
            [
                1027,
                1141
            ],
            [
                1141,
                1190
            ],
            [
                1190,
                1535
            ],
            [
                1535,
                1818
            ],
            [
                1818,
                1936
            ],
            [
                1936,
                2219
            ],
            [
                2219,
                2284
            ],
            [
                2284,
                2568
            ],
            [
                2568,
                2715
            ],
            [
                2715,
                2761
            ],
            [
                2761,
                2846
            ],
            [
                2846,
                2905
            ],
            [
                2905,
                2944
            ],
            [
                2944,
                3252
            ],
            [
                3252,
                3424
            ],
            [
                3424,
                3446
            ],
            [
                3446,
                3658
            ],
            [
                3658,
                3859
            ],
            [
                3859,
                4188
            ],
            [
                4188,
                4373
            ],
            [
                4373,
                4431
            ],
            [
                4431,
                4454
            ],
            [
                4454,
                4548
            ],
            [
                4548,
                4657
            ],
            [
                4657,
                4781
            ],
            [
                4781,
                5041
            ],
            [
                5041,
                5153
            ],
            [
                5153,
                5650
            ],
            [
                5650,
                5887
            ],
            [
                5887,
                6127
            ],
            [
                6127,
                6183
            ],
            [
                6183,
                6231
            ],
            [
                6231,
                6264
            ],
            [
                6264,
                6278
            ]
        ],
        "segment_chars": [
            [
                0,
                270
            ],
            [
                270,
                495
            ],
            [
                495,
                600
            ],
            [
                600,
                1027
            ],
            [
                1027,
                1141
            ],
            [
                1141,
                1190
            ],
            [
                1190,
                1535
            ],
            [
                1535,
                1682
            ],
            [
                1682,
                1818
            ],
            [
                1818,
                1936
            ],
            [
                1936,
                2219
            ],
            [
                2219,
                2284
            ],
            [
                2284,
                2568
            ],
            [
                2568,
                2647
            ],
            [
                2647,
                2715
            ],
            [
                2715,
                2761
            ],
            [
                2761,
                2846
            ],
            [
                2846,
                2905
            ],
            [
                2905,
                2944
            ],
            [
                2944,
                3252
            ],
            [
                3252,
                3424
            ],
            [
                3424,
                3446
            ],
            [
                3446,
                3658
            ],
            [
                3658,
                3859
            ],
            [
                3859,
                4188
            ],
            [
                4188,
                4373
            ],
            [
                4373,
                4431
            ],
            [
                4431,
                4454
            ],
            [
                4454,
                4478
            ],
            [
                4478,
                4548
            ],
            [
                4548,
                4657
            ],
            [
                4657,
                4723
            ],
            [
                4723,
                4781
            ],
            [
                4781,
                5041
            ],
            [
                5041,
                5153
            ],
            [
                5153,
                5331
            ],
            [
                5331,
                5406
            ],
            [
                5406,
                5650
            ],
            [
                5650,
                5765
            ],
            [
                5765,
                5887
            ],
            [
                5887,
                6127
            ],
            [
                6127,
                6183
            ],
            [
                6183,
                6231
            ],
            [
                6231,
                6264
            ],
            [
                6264,
                6278
            ]
        ],
        "overlap_chars": [
            [
                0,
                33
            ],
            [
                34,
                63
            ],
            [
                76,
                109
            ],
            [
                119,
                146
            ],
            [
                149,
                192
            ],
            [
                192,
                193
            ],
            [
                194,
                270
            ],
            [
                278,
                279
            ],
            [
                280,
                296
            ],
            [
                306,
                382
            ],
            [
                383,
                450
            ],
            [
                465,
                476
            ],
            [
                477,
                479
            ],
            [
                486,
                489
            ],
            [
                490,
                495
            ],
            [
                495,
                501
            ],
            [
                501,
                552
            ],
            [
                554,
                600
            ],
            [
                600,
                606
            ],
            [
                607,
                613
            ],
            [
                614,
                670
            ],
            [
                671,
                756
            ],
            [
                757,
                768
            ],
            [
                769,
                774
            ],
            [
                775,
                781
            ],
            [
                782,
                801
            ],
            [
                807,
                847
            ],
            [
                850,
                852
            ],
            [
                853,
                929
            ],
            [
                930,
                936
            ],
            [
                936,
                955
            ],
            [
                956,
                959
            ],
            [
                966,
                967
            ],
            [
                974,
                1011
            ],
            [
                1019,
                1025
            ],
            [
                1033,
                1057
            ],
            [
                1060,
                1075
            ],
            [
                1077,
                1138
            ],
            [
                1147,
                1168
            ],
            [
                1171,
                1188
            ],
            [
                1196,
                1201
            ],
            [
                1202,
                1212
            ],
            [
                1215,
                1229
            ],
            [
                1232,
                1249
            ],
            [
                1255,
                1264
            ],
            [
                1264,
                1273
            ],
            [
                1274,
                1289
            ],
            [
                1291,
                1301
            ],
            [
                1302,
                1308
            ],
            [
                1309,
                1348
            ],
            [
                1354,
                1392
            ],
            [
                1393,
                1437
            ],
            [
                1440,
                1471
            ],
            [
                1471,
                1472
            ],
            [
                1473,
                1490
            ],
            [
                1496,
                1506
            ],
            [
                1509,
                1516
            ],
            [
                1524,
                1535
            ],
            [
                1536,
                1548
            ],
            [
                1554,
                1563
            ],
            [
                1563,
                1564
            ],
            [
                1566,
                1570
            ],
            [
                1571,
                1637
            ],
            [
                1638,
                1651
            ],
            [
                1657,
                1662
            ],
            [
                1669,
                1670
            ],
            [
                1680,
                1681
            ],
            [
                1682,
                1726
            ],
            [
                1726,
                1727
            ],
            [
                1728,
                1738
            ],
            [
                1738,
                1739
            ],
            [
                1740,
                1785
            ],
            [
                1791,
                1807
            ],
            [
                1818,
                1832
            ],
            [
                1833,
                1867
            ],
            [
                1868,
                1870
            ],
            [
                1873,
                1876
            ],
            [
                1896,
                1901
            ],
            [
                1904,
                1925
            ],
            [
                1937,
                1952
            ],
            [
                1958,
                1967
            ],
            [
                1967,
                1968
            ],
            [
                1979,
                1998
            ],
            [
                1999,
                2008
            ],
            [
                2009,
                2015
            ],
            [
                2022,
                2032
            ],
            [
                2033,
                2035
            ],
            [
                2037,
                2038
            ],
            [
                2039,
                2053
            ],
            [
                2065,
                2069
            ],
            [
                2070,
                2076
            ],
            [
                2076,
                2093
            ],
            [
                2098,
                2147
            ],
            [
                2148,
                2149
            ],
            [
                2150,
                2154
            ],
            [
                2155,
                2168
            ],
            [
                2169,
                2173
            ],
            [
                2174,
                2177
            ],
            [
                2178,
                2199
            ],
            [
                2207,
                2209
            ],
            [
                2220,
                2252
            ],
            [
                2255,
                2269
            ],
            [
                2282,
                2284
            ],
            [
                2284,
                2285
            ],
            [
                2285,
                2299
            ],
            [
                2300,
                2307
            ],
            [
                2308,
                2311
            ],
            [
                2314,
                2318
            ],
            [
                2326,
                2329
            ],
            [
                2334,
                2336
            ],
            [
                2337,
                2344
            ],
            [
                2345,
                2409
            ],
            [
                2415,
                2420
            ],
            [
                2425,
                2435
            ],
            [
                2435,
                2436
            ],
            [
                2437,
                2458
            ],
            [
                2469,
                2480
            ],
            [
                2481,
                2483
            ],
            [
                2484,
                2491
            ],
            [
                2492,
                2509
            ],
            [
                2515,
                2517
            ],
            [
                2518,
                2521
            ],
            [
                2522,
                2528
            ],
            [
                2529,
                2565
            ],
            [
                2575,
                2600
            ],
            [
                2603,
                2617
            ],
            [
                2617,
                2618
            ],
            [
                2621,
                2645
            ],
            [
                2647,
                2650
            ],
            [
                2660,
                2662
            ],
            [
                2663,
                2682
            ],
            [
                2685,
                2694
            ],
            [
                2700,
                2712
            ],
            [
                2721,
                2726
            ],
            [
                2727,
                2733
            ],
            [
                2734,
                2745
            ],
            [
                2746,
                2758
            ],
            [
                2762,
                2772
            ],
            [
                2775,
                2780
            ],
            [
                2781,
                2785
            ],
            [
                2786,
                2796
            ],
            [
                2803,
                2843
            ],
            [
                2847,
                2891
            ],
            [
                2894,
                2898
            ],
            [
                2912,
                2913
            ],
            [
                2924,
                2937
            ],
            [
                2944,
                2950
            ],
            [
                2951,
                2955
            ],
            [
                2956,
                2963
            ],
            [
                2970,
                3025
            ],
            [
                3033,
                3040
            ],
            [
                3041,
                3088
            ],
            [
                3093,
                3097
            ],
            [
                3097,
                3098
            ],
            [
                3102,
                3133
            ],
            [
                3136,
                3140
            ],
            [
                3141,
                3159
            ],
            [
                3162,
                3174
            ],
            [
                3180,
                3227
            ],
            [
                3230,
                3250
            ],
            [
                3252,
                3318
            ],
            [
                3326,
                3334
            ],
            [
                3334,
                3335
            ],
            [
                3336,
                3350
            ],
            [
                3351,
                3380
            ],
            [
                3386,
                3424
            ],
            [
                3424,
                3439
            ],
            [
                3444,
                3446
            ],
            [
                3446,
                3537
            ],
            [
                3538,
                3543
            ],
            [
                3549,
                3658
            ],
            [
                3658,
                3662
            ],
            [
                3663,
                3669
            ],
            [
                3670,
                3679
            ],
            [
                3686,
                3705
            ],
            [
                3708,
                3730
            ],
            [
                3730,
                3731
            ],
            [
                3732,
                3779
            ],
            [
                3780,
                3784
            ],
            [
                3791,
                3804
            ],
            [
                3804,
                3857
            ],
            [
                3857,
                3859
            ],
            [
                3859,
                3864
            ],
            [
                3866,
                3882
            ],
            [
                3883,
                3894
            ],
            [
                3900,
                3906
            ],
            [
                3909,
                3917
            ],
            [
                3923,
                3961
            ],
            [
                3964,
                3994
            ],
            [
                4001,
                4007
            ],
            [
                4008,
                4021
            ],
            [
                4021,
                4062
            ],
            [
                4073,
                4188
            ],
            [
                4188,
                4214
            ],
            [
                4220,
                4225
            ],
            [
                4226,
                4316
            ],
            [
                4317,
                4327
            ],
            [
                4328,
                4371
            ],
            [
                4380,
                4431
            ],
            [
                4431,
                4437
            ],
            [
                4446,
                4447
            ],
            [
                4452,
                4453
            ],
            [
                4460,
                4475
            ],
            [
                4478,
                4500
            ],
            [
                4506,
                4548
            ],
            [
                4548,
                4657
            ],
            [
                4657,
                4683
            ],
            [
                4684,
                4701
            ],
            [
                4701,
                4702
            ],
            [
                4703,
                4723
            ],
            [
                4723,
                4730
            ],
            [
                4731,
                4779
            ],
            [
                4779,
                4781
            ],
            [
                4781,
                4862
            ],
            [
                4863,
                4866
            ],
            [
                4867,
                4877
            ],
            [
                4878,
                4894
            ],
            [
                4895,
                4900
            ],
            [
                4901,
                4960
            ],
            [
                4969,
                4978
            ],
            [
                4981,
                4984
            ],
            [
                4988,
                4991
            ],
            [
                4998,
                5001
            ],
            [
                5002,
                5014
            ],
            [
                5015,
                5023
            ],
            [
                5023,
                5027
            ],
            [
                5028,
                5039
            ],
            [
                5041,
                5049
            ],
            [
                5050,
                5101
            ],
            [
                5106,
                5153
            ],
            [
                5153,
                5195
            ],
            [
                5201,
                5214
            ],
            [
                5215,
                5240
            ],
            [
                5258,
                5289
            ],
            [
                5310,
                5331
            ],
            [
                5331,
                5341
            ],
            [
                5342,
                5355
            ],
            [
                5356,
                5358
            ],
            [
                5364,
                5404
            ],
            [
                5406,
                5446
            ],
            [
                5451,
                5460
            ],
            [
                5461,
                5468
            ],
            [
                5471,
                5475
            ],
            [
                5476,
                5486
            ],
            [
                5487,
                5489
            ],
            [
                5490,
                5575
            ],
            [
                5581,
                5585
            ],
            [
                5585,
                5625
            ],
            [
                5626,
                5650
            ],
            [
                5650,
                5658
            ],
            [
                5659,
                5732
            ],
            [
                5733,
                5739
            ],
            [
                5742,
                5765
            ],
            [
                5770,
                5818
            ],
            [
                5818,
                5841
            ],
            [
                5842,
                5870
            ],
            [
                5871,
                5885
            ],
            [
                5887,
                5903
            ],
            [
                5906,
                5991
            ],
            [
                5995,
                5998
            ],
            [
                5999,
                6019
            ],
            [
                6022,
                6046
            ],
            [
                6046,
                6047
            ],
            [
                6053,
                6089
            ],
            [
                6094,
                6109
            ],
            [
                6125,
                6127
            ],
            [
                6127,
                6151
            ],
            [
                6152,
                6181
            ],
            [
                6183,
                6210
            ],
            [
                6215,
                6231
            ],
            [
                6231,
                6264
            ],
            [
                6264,
                6278
            ]
        ],
        "row_chars": [
            [
                0,
                270
            ],
            [
                270,
                495
            ],
            [
                495,
                600
            ],
            [
                600,
                1535
            ],
            [
                1535,
                1818
            ],
            [
                1818,
                1936
            ],
            [
                1936,
                2219
            ],
            [
                2219,
                2284
            ],
            [
                2284,
                2568
            ],
            [
                2568,
                2715
            ],
            [
                2715,
                2761
            ],
            [
                2761,
                2846
            ],
            [
                2846,
                2905
            ],
            [
                2905,
                2944
            ],
            [
                2944,
                3424
            ],
            [
                3424,
                3446
            ],
            [
                3446,
                3658
            ],
            [
                3658,
                3859
            ],
            [
                3859,
                4188
            ],
            [
                4188,
                4373
            ],
            [
                4373,
                4431
            ],
            [
                4431,
                4454
            ],
            [
                4454,
                4548
            ],
            [
                4548,
                4657
            ],
            [
                4657,
                4657
            ],
            [
                4657,
                4723
            ],
            [
                4723,
                4781
            ],
            [
                4781,
                5041
            ],
            [
                5041,
                5153
            ],
            [
                5153,
                5153
            ],
            [
                5153,
                5331
            ],
            [
                5331,
                5650
            ],
            [
                5650,
                5765
            ],
            [
                5765,
                5887
            ],
            [
                5887,
                6127
            ],
            [
                6127,
                6183
            ],
            [
                6183,
                6231
            ],
            [
                6231,
                6264
            ],
            [
                6264,
                6278
            ]
        ]
    }
}