{
    "original": {
        "text": "Whilst my father was writing his letter of instructions, my uncle _Toby_ and the corporal were busy in preparing everything for the attack. As the turning of the thin scarlet breeches was laid aside (at least for the present), there was nothing which should put it off beyond the next morning; so accordingly it was resolved upon, for eleven o'clock.\nCome, my dear, said my father to my mother--'twill be but like a brother and sister, if you and I take a walk down to my brother _Toby's_----to countenance him in this attack of his.\nMy uncle _Toby_ and the corporal had been accoutred both some time, when my father and mother enter'd, and the clock striking eleven, were that moment in motion to sally forth--but the account of this is worth more than to be wove into the fag end of the eighth[8.7] volume of such a work as this. ----My father had no time but to put the letter of instructions into my uncle _Toby's_ coat-pocket----and join with my mother in wishing his attack prosperous.\nI could like, said my mother, to look through the key-hole out of curiosity ----Call it by its right name, my dear, quoth my father--\n_And look through the key-hole_ as long as you will.\n[Footnote 8.7: Alluding to the first edition.]\nTHE LIFE AND OPINIONS\nOF\nTRISTRAM SHANDY\nGENTLEMAN\nNon enim excursus hic ejus, sed opus ipsum est.\nPLIN. Lib. v. Epist. 6.\nSi quid urbaniuscul lusum a nobis, per Musas et Charitas et omnium potarum Numina, Oro te, ne me mal capias.\nA DEDICATION\nTO A GREAT MAN\nHaving, _a priori_, intended to dedicate _The Amours of my Uncle Toby_ to Mr. *** ----I see more reasons, _a posteriori_, for doing it to Lord *******.\nI should lament from my soul, if this exposed me to the jealousy of their Reverences; because _a posteriori_, in Court-latin, signifies the kissing hands for preferment--or anything else--in order to get it.\nMy opinion of Lord ******* is neither better nor worse, than it was of Mr. ***. Honours, like impressions upon coin, may give an ideal and local value to a bit of base metal; but Gold and Silver will pass all the world over without any other recommendation than their own weight.\nThe same good-will that made me think of offering up half an hour's amusement to Mr. *** when out of place--operates more forcibly at present, as half an hour's amusement will be more serviceable and refreshing after labour and sorrow, than after a philosophical repast.\nNothing is so perfectly _amusement_ as a total change of ideas; no ideas are so totally different as those of Ministers, and innocent Lovers: for which reason, when I come to talk of Statesmen and Patriots, and set such marks upon them as will prevent confusion and mistakes concerning them for the future --I propose to dedicate that Volume to some gentle Shepherd,\nWhose thoughts proud Science never taught to stray, Far as the Statesman's walk or Patriot-way; Yet _simple Nature_ to his hopes had given Out of a cloud-capp'd head a humbler heaven; Some _untam'd_ World in depths of wood embraced-- Some happier Island in the watry-waste-- And where admitted to that equal sky, His _faithful Dog_ should bear him company.\nIn a word, by thus introducing an entire new set of objects to his Imagination, I shall unavoidably give a _Diversion_ to his passionate and love-sick Contemplations. In the meantime,\nI am\nTHE AUTHOR.",
        "paragraph_chars": [
            [
                0,
                351
            ],
            [
                351,
                534
            ],
            [
                534,
                992
            ],
            [
                992,
                1126
            ],
            [
                1126,
                1179
            ],
            [
                1179,
                1226
            ],
            [
                1226,
                1248
            ],
            [
                1248,
                1251
            ],
            [
                1251,
                1267
            ],
            [
                1267,
                1277
            ],
            [
                1277,
                1325
            ],
            [
                1325,
                1349
            ],
            [
                1349,
                1458
            ],
            [
                1458,
                1471
            ],
            [
                1471,
                1486
            ],
            [
                1486,
                1638
            ],
            [
                1638,
                1846
            ],
            [
                1846,
                2126
            ],
            [
                2126,
                2397
            ],
            [
                2397,
                2764
            ],
            [
                2764,
                3121
            ],
            [
                3121,
                3305
            ],
            [
                3305,
                3310
            ],
            [
                3310,
                3321
            ]
        ],
        "segment_chars": [
            [
                0,
                140
            ],
            [
                140,
                351
            ],
            [
                351,
                534
            ],
            [
                534,
                832
            ],
            [
                832,
                992
            ],
            [
                992,
                1126
            ],
            [
                1126,
                1179
            ],
            [
                1179,
                1226
            ],
            [
                1226,
                1248
            ],
            [
                1248,
                1251
            ],
            [
                1251,
                1267
            ],
            [
                1267,
                1277
            ],
            [
                1277,
                1325
            ],
            [
                1325,
                1331
            ],
            [
                1331,
                1336
            ],
            [
                1336,
                1346
            ],
            [
                1346,
                1349
            ],
            [
                1349,
                1458
            ],
            [
                1458,
                1471
            ],
            [
                1471,
                1486
            ],
            [
                1486,
                1638
            ],
            [
                1638,
                1846
            ],
            [
                1846,
                1926
            ],
            [
                1926,
                2126
            ],
            [
                2126,
                2397
            ],
            [
                2397,
                2764
            ],
            [
                2764,
                3121
            ],
            [
                3121,
                3288
            ],
            [
                3288,
                3305
            ],
            [
                3305,
                3310
            ],
            [
                3310,
                3321
            ]
        ],
        "overlap_chars": [
            [
                0,
                65
            ],
            [
                73,
                99
            ],
            [
                103,
                112
            ],
            [
                124,
                140
            ],
            [
                140,
                198
            ],
            [
                329,
                330
            ],
            [
                227,
                236
            ],
            [
                258,
                329
            ],
            [
                331,
                351
            ],
            [
                395,
                396
            ],
            [
                351,
                364
            ],
            [
                366,
                393
            ],
            [
                396,
                404
            ],
            [
                414,
                423
            ],
            [
                492,
                494
            ],
            [
                456,
                479
            ],
            [
                485,
                487
            ],
            [
                364,
                365
            ],
            [
                507,
                532
            ],
            [
                602,
                627
            ],
            [
                600,
                601
            ],
            [
                534,
                542
            ],
            [
                550,
                566
            ],
            [
                668,
                672
            ],
            [
                695,
                709
            ],
            [
                711,
                726
            ],
            [
                735,
                795
            ],
            [
                801,
                831
            ],
            [
                836,
                849
            ],
            [
                853,
                857
            ],
            [
                862,
                909
            ],
            [
                915,
                917
            ],
            [
                919,
                930
            ],
            [
                934,
                992
            ],
            [
                992,
                1004
            ],
            [
                1006,
                1021
            ],
            [
                1022,
                1067
            ],
            [
                1072,
                1106
            ],
            [
                1108,
                1123
            ],
            [
                1127,
                1156
            ],
            [
                1158,
                1172
            ],
            [
                1226,
                1248
            ],
            [
                1248,
                1251
            ],
            [
                1251,
                1267
            ],
            [
                1267,
                1277
            ],
            [
                1458,
                1471
            ],
            [
                1471,
                1486
            ],
            [
                1486,
                1492
            ],
            [
                1506,
                1526
            ],
            [
                1528,
                1555
            ],
            [
                1557,
                1567
            ],
            [
                1572,
                1591
            ],
            [
                1593,
                1605
            ],
            [
                1606,
                1611
            ],
            [
                1618,
                1638
            ],
            [
                1638,
                1653
            ],
            [
                1668,
                1722
            ],
            [
                1666,
                1667
            ],
            [
                1724,
                1731
            ],
            [
                1733,
                1745
            ],
            [
                1746,
                1763
            ],
            [
                1774,
                1785
            ],
            [
                1786,
                1791
            ],
            [
                1808,
                1824
            ],
            [
                1826,
                1841
            ],
            [
                1796,
                1806
            ],
            [
                1844,
                1846
            ],
            [
                1846,
                1900
            ],
            [
                1902,
                1906
            ],
            [
                1914,
                1926
            ],
            [
                1926,
                1971
            ],
            [
                2000,
                2001
            ],
            [
                1985,
                1999
            ],
            [
                2009,
                2054
            ],
            [
                2065,
                2069
            ],
            [
                2055,
                2064
            ],
            [
                2070,
                2126
            ],
            [
                2126,
                2214
            ],
            [
                2243,
                2309
            ],
            [
                2326,
                2397
            ],
            [
                2397,
                2410
            ],
            [
                2433,
                2537
            ],
            [
                2555,
                2589
            ],
            [
                2602,
                2603
            ],
            [
                2636,
                2640
            ],
            [
                2612,
                2616
            ],
            [
                2633,
                2635
            ],
            [
                2641,
                2648
            ],
            [
                2663,
                2671
            ],
            [
                2628,
                2632
            ],
            [
                2705,
                2762
            ],
            [
                2764,
                2815
            ],
            [
                2816,
                2859
            ],
            [
                2860,
                2863
            ],
            [
                2865,
                2878
            ],
            [
                2880,
                2902
            ],
            [
                2903,
                2947
            ],
            [
                2948,
                2952
            ],
            [
                2954,
                2957
            ],
            [
                2963,
                2995
            ],
            [
                2998,
                3024
            ],
            [
                3030,
                3036
            ],
            [
                3039,
                3076
            ],
            [
                3077,
                3080
            ],
            [
                3091,
                3094
            ],
            [
                3096,
                3121
            ],
            [
                3121,
                3208
            ],
            [
                3221,
                3227
            ],
            [
                3240,
                3246
            ],
            [
                3262,
                3288
            ],
            [
                3288,
                3305
            ],
            [
                3305,
                3310
            ],
            [
                3310,
                3321
            ]
        ],
        "row_chars": [
            [
                0,
                140
            ],
            [
                140,
                351
            ],
            [
                351,
                534
            ],
            [
                534,
                832
            ],
            [
                832,
                992
            ],
            [
                992,
                1179
            ],
            [
                1179,
                1226
            ],
            [
                1226,
                1248
            ],
            [
                1248,
                1251
            ],
            [
                1251,
                1267
            ],
            [
                1267,
                1277
            ],
            [
                1277,
                1325
            ],
            [
                1325,
                1331
            ],
            [
                1331,
                1336
            ],
            [
                1336,
                1346
            ],
            [
                1346,
                1349
            ],
            [
                1349,
                1458
            ],
            [
                1458,
                1471
            ],
            [
                1471,
                1486
            ],
            [
                1486,
                1638
            ],
            [
                1638,
                1846
            ],
            [
                1846,
                1926
            ],
            [
                1926,
                2126
            ],
            [
                2126,
                2397
            ],
            [
                2397,
                2764
            ],
            [
                2764,
                3121
            ],
            [
                3121,
                3288
            ],
            [
                3288,
                3305
            ],
            [
                3305,
                3310
            ],
            [
                3310,
                3321
            ]
        ]
    },
    "abridged": {
        "text": "Whilst my father was writing his letter of instructions, my uncle Toby and the corporal were busy preparing for the attack. As the turning of the thin scarlet breeches was laid aside, there was no reason to put it off beyond the next morning; so accordingly it was resolved upon for eleven o'clock.\n'Come, my dear,' said my father to my mother - ''twill be a brotherly act to walk down to my brother Toby's, to support him in this attack of his.'\nWhen my father and mother entered, my uncle Toby and the corporal were about to sally forth - but the account is worth more than to be wove into the fag end of the eighth volume of such a work as this.\n- My father had just time to put the letter of instructions into my uncle Toby's coat-pocket - and join with my mother in wishing his attack prosperous.\n'I could like,' said my mother, 'to look through the key-hole out of curiosity.'\n'Call it by its right name, my dear,' quoth my father - 'and look through the key-hole as long as you like.'\nTHE LIFE AND OPINIONS\nOF\nTRISTRAM SHANDY\nGENTLEMAN\nA DEDICATION\nTO A GREAT MAN\nHaving previously intended to dedicate The Amours of my Uncle Toby to Mr. *** - I see more reasons, a posteriori, for dedicating it to Lord *******.\nI should lament if this exposed me to the jealousy of their Reverences, because a posteriori, in Court-Latin, means the kissing of hands - or anything else - in order to get preferment.\nMy opinion of Lord ******* is neither better nor worse than my opinion of Mr. ***. Honours, like impressions upon coin, may give a local value to base metal; but Gold and Silver will pass all over the world, without any other recommendation than their own weight.\nThe same good-will that made me think of offering up half an hour's amusement to Mr. *** operates more forcibly at present, as half an hour's amusement will be more refreshing after labour and sorrow, than after a philosophical repast.\nNothing is so amusing as a total change of ideas; no ideas are so totally different as those of Ministers, and innocent Lovers. Therefore, when I come to talk of Statesmen, it will be in such a way as to prevent mistakes about them. - I propose to dedicate that Volume to some gentle Shepherd; (as Pope almost says-)\nWhose thoughts proud Science never taught to stray,\nFar as the Statesman's walk or Patriot-way;\nYet simple Nature to his hopes had given\nOut of a cloud-capp'd head a humbler heaven;\nSome untamed World in depths of wood embraced-\nSome happier Island in the watery-waste-\nAnd where admitted to that equal sky,\nHis faithful Dog should bear him company.\nIn a word, by thus introducing an entire new set of objects to his Imagination, I shall give a Diversion to his love-sick Contemplations. In the meantime,\nI am\nTHE AUTHOR.",
        "paragraph_chars": [
            [
                0,
                299
            ],
            [
                299,
                447
            ],
            [
                447,
                649
            ],
            [
                649,
                802
            ],
            [
                802,
                883
            ],
            [
                883,
                992
            ],
            [
                992,
                1014
            ],
            [
                1014,
                1017
            ],
            [
                1017,
                1033
            ],
            [
                1033,
                1043
            ],
            [
                1043,
                1056
            ],
            [
                1056,
                1071
            ],
            [
                1071,
                1220
            ],
            [
                1220,
                1406
            ],
            [
                1406,
                1670
            ],
            [
                1670,
                1906
            ],
            [
                1906,
                2223
            ],
            [
                2223,
                2275
            ],
            [
                2275,
                2319
            ],
            [
                2319,
                2360
            ],
            [
                2360,
                2405
            ],
            [
                2405,
                2452
            ],
            [
                2452,
                2493
            ],
            [
                2493,
                2531
            ],
            [
                2531,
                2573
            ],
            [
                2573,
                2728
            ],
            [
                2728,
                2733
            ],
            [
                2733,
                2744
            ]
        ],
        "segment_chars": [
            [
                0,
                124
            ],
            [
                124,
                299
            ],
            [
                299,
                447
            ],
            [
                447,
                649
            ],
            [
                649,
                802
            ],
            [
                802,
                883
            ],
            [
                883,
                992
            ],
            [
                992,
                1014
            ],
            [
                1014,
                1017
            ],
            [
                1017,
                1033
            ],
            [
                1033,
                1043
            ],
            [
                1043,
                1056
            ],
            [
                1056,
                1071
            ],
            [
                1071,
                1220
            ],
            [
                1220,
                1406
            ],
            [
                1406,
                1489
            ],
            [
                1489,
                1670
            ],
            [
                1670,
                1906
            ],
            [
                1906,
                2034
            ],
            [
                2034,
                2139
            ],
            [
                2139,
                2223
            ],
            [
                2223,
                2275
            ],
            [
                2275,
                2319
            ],
            [
                2319,
                2360
            ],
            [
                2360,
                2405
            ],
            [
                2405,
                2452
            ],
            [
                2452,
                2493
            ],
            [
                2493,
                2531
            ],
            [
                2531,
                2573
            ],
            [
                2573,
                2711
            ],
            [
                2711,
                2728
            ],
            [
                2728,
                2733
            ],
            [
                2733,
                2744
            ]
        ],
        "overlap_chars": [
            [
                0,
                65
            ],
            [
                71,
                97
            ],
            [
                98,
                107
            ],
            [
                108,
                124
            ],
            [
                124,
                182
            ],
            [
                182,
                183
            ],
            [
                184,
                193
            ],
            [
                207,
                278
            ],
            [
                279,
                299
            ],
            [
                299,
                300
            ],
            [
                300,
                313
            ],
            [
                316,
                343
            ],
            [
                348,
                356
            ],
            [
                357,
                366
            ],
            [
                373,
                375
            ],
            [
                376,
                399
            ],
            [
                404,
                406
            ],
            [
                406,
                407
            ],
            [
                419,
                444
            ],
            [
                447,
                472
            ],
            [
                480,
                481
            ],
            [
                482,
                490
            ],
            [
                496,
                512
            ],
            [
                513,
                517
            ],
            [
                524,
                538
            ],
            [
                541,
                556
            ],
            [
                557,
                617
            ],
            [
                618,
                648
            ],
            [
                651,
                664
            ],
            [
                670,
                674
            ],
            [
                675,
                722
            ],
            [
                727,
                729
            ],
            [
                730,
                741
            ],
            [
                744,
                802
            ],
            [
                803,
                815
            ],
            [
                818,
                833
            ],
            [
                835,
                880
            ],
            [
                884,
                918
            ],
            [
                921,
                936
            ],
            [
                940,
                969
            ],
            [
                970,
                984
            ],
            [
                992,
                1014
            ],
            [
                1014,
                1017
            ],
            [
                1017,
                1033
            ],
            [
                1033,
                1043
            ],
            [
                1043,
                1056
            ],
            [
                1056,
                1071
            ],
            [
                1071,
                1077
            ],
            [
                1089,
                1109
            ],
            [
                1110,
                1137
            ],
            [
                1138,
                1148
            ],
            [
                1151,
                1170
            ],
            [
                1171,
                1183
            ],
            [
                1183,
                1188
            ],
            [
                1200,
                1220
            ],
            [
                1220,
                1235
            ],
            [
                1236,
                1290
            ],
            [
                1290,
                1291
            ],
            [
                1292,
                1299
            ],
            [
                1300,
                1312
            ],
            [
                1312,
                1329
            ],
            [
                1336,
                1347
            ],
            [
                1351,
                1356
            ],
            [
                1359,
                1375
            ],
            [
                1378,
                1393
            ],
            [
                1394,
                1404
            ],
            [
                1404,
                1406
            ],
            [
                1406,
                1460
            ],
            [
                1461,
                1465
            ],
            [
                1477,
                1489
            ],
            [
                1489,
                1534
            ],
            [
                1535,
                1536
            ],
            [
                1537,
                1551
            ],
            [
                1552,
                1597
            ],
            [
                1598,
                1602
            ],
            [
                1603,
                1612
            ],
            [
                1614,
                1670
            ],
            [
                1670,
                1758
            ],
            [
                1768,
                1834
            ],
            [
                1835,
                1906
            ],
            [
                1906,
                1919
            ],
            [
                1928,
                2032
            ],
            [
                2043,
                2077
            ],
            [
                2077,
                2078
            ],
            [
                2082,
                2086
            ],
            [
                2093,
                2097
            ],
            [
                2104,
                2106
            ],
            [
                2110,
                2117
            ],
            [
                2118,
                2126
            ],
            [
                2133,
                2137
            ],
            [
                2141,
                2198
            ],
            [
                2223,
                2274
            ],
            [
                2275,
                2318
            ],
            [
                2319,
                2322
            ],
            [
                2323,
                2336
            ],
            [
                2337,
                2359
            ],
            [
                2360,
                2404
            ],
            [
                2405,
                2409
            ],
            [
                2410,
                2413
            ],
            [
                2418,
                2450
            ],
            [
                2452,
                2478
            ],
            [
                2485,
                2491
            ],
            [
                2493,
                2530
            ],
            [
                2531,
                2534
            ],
            [
                2544,
                2547
            ],
            [
                2548,
                2573
            ],
            [
                2573,
                2660
            ],
            [
                2661,
                2667
            ],
            [
                2678,
                2684
            ],
            [
                2685,
                2711
            ],
            [
                2711,
                2728
            ],
            [
                2728,
                2733
            ],
            [
                2733,
                2744
            ]
        ],
        "row_chars": [
            [
                0,
                124
            ],
            [
                124,
                299
            ],
            [
                299,
                447
            ],
            [
                447,
                649
            ],
            [
                649,
                802
            ],
            [
                802,
                992
            ],
            [
                992,
                992
            ],
            [
                992,
                1014
            ],
            [
                1014,
                1017
            ],
            [
                1017,
                1033
            ],
            [
                1033,
                1043
            ],
            [
                1043,
                1043
            ],
            [
                1043,
                1043
            ],
            [
                1043,
                1043
            ],
            [
                1043,
                1043
            ],
            [
                1043,
                1043
            ],
            [
                1043,
                1043
            ],
            [
                1043,
                1056
            ],
            [
                1056,
                1071
            ],
            [
                1071,
                1220
            ],
            [
                1220,
                1406
            ],
            [
                1406,
                1489
            ],
            [
                1489,
                1670
            ],
            [
                1670,
                1906
            ],
            [
                1906,
                2223
            ],
            [
                2223,
                2573
            ],
            [
                2573,
                2711
            ],
            [
                2711,
                2728
            ],
            [
                2728,
                2733
            ],
            [
                2733,
                2744
            ]
        ]
    }
}