{
    "original": {
        "text": "I call all the powers of time and chance, which severally check us in our careers in this world, to bear me witness, that I could never yet get fairly to my uncle _Toby's_ amours, till this very moment, that my mother's _curiosity_, as she stated the affair, ----or a different impulse in her, as my father would have it----wished her to take a peep at them through the key-hole.\n\"Call it, my dear, by its right name, quoth my father, and look through the key-hole as long as you will.\"\nNothing but the fermentation of that little subacid humour, which I have often spoken of, in my father's habit, could have vented such an insinuation----he was however frank and generous in his nature, and at all times open to conviction; so that he had scarce got to the last word of this ungracious retort, when his conscience smote him.\nMy mother was then conjugally swinging with her left arm twisted under his right, in such wise, that the inside of her hand rested upon the back of his--she raised her fingers, and let them fall--it could scarce be call'd a tap; or if it was a tap---- 'twould have puzzled a casuist to say, whether 'twas a tap of remonstrance, or a tap of confession: my father, who was all sensibilities from head to foot, class'd it right --Conscience redoubled her blow--he turn'd his face suddenly the other way, and my mother supposing his body was about to turn with it in order to move homewards, by a cross movement of her right leg, keeping her left as its centre, brought herself so far in front, that as he turned his head, he met her eye ------Confusion again! he saw a thousand reasons to wipe out the reproach, and as many to reproach himself----a thin, blue, chill, pellucid chrystal with all its humours so at rest, the least mote or speck of desire might have been seen, at the bottom of it, had it existed----it did not----and how I happen to be so lewd myself, particularly a little before the vernal and autumnal equinoxes ----Heaven above knows ----My mother----madam----was so at no time, either by nature, by institution, or example.\nA temperate current of blood ran orderly through her veins in all months of the year, and in all critical moments both of the day and night alike; nor did she superinduce the least heat into her humours from the manual effervescencies of devotional tracts, which having little or no meaning in them, nature is oft-times obliged to find one ----And as for my father's example! 'twas so far from being either aiding or abetting thereunto, that 'twas the whole business of his life to keep all fancies of that kind out of her head ----Nature had done her part, to have spared him this trouble; and what was not a little inconsistent, my father knew it ----And here am I sitting, this 12th day of _August_ 1766, in a purple jerkin and yellow pair of slippers, without either wig or cap on, a most tragicomical completion of his prediction, \"That I should neither think, nor act like any other man's child, upon that very account.\"\nThe mistake in my father, was in attacking my mother's motive, instead of the act itself; for certainly key-holes were made for other purposes; and considering the act, as an act which interfered with a true proposition, and denied a key-hole to be what it was------it became a violation of nature; and was so far, you see, criminal.\nIt is for this reason, an' please your Reverences, That key-holes are the occasions of more sin and wickedness, than all other holes in this world put together.\n------which leads me to my uncle _Toby's_ amours.",
        "paragraph_chars": [
            [
                0,
                380
            ],
            [
                380,
                487
            ],
            [
                487,
                827
            ],
            [
                827,
                2068
            ],
            [
                2068,
                2995
            ],
            [
                2995,
                3329
            ],
            [
                3329,
                3490
            ],
            [
                3490,
                3539
            ]
        ],
        "segment_chars": [
            [
                0,
                380
            ],
            [
                380,
                487
            ],
            [
                487,
                827
            ],
            [
                827,
                1584
            ],
            [
                1584,
                2068
            ],
            [
                2068,
                2444
            ],
            [
                2444,
                2995
            ],
            [
                2995,
                3329
            ],
            [
                3329,
                3490
            ],
            [
                3490,
                3539
            ]
        ],
        "overlap_chars": [
            [
                0,
                47
            ],
            [
                58,
                104
            ],
            [
                108,
                115
            ],
            [
                117,
                162
            ],
            [
                335,
                337
            ],
            [
                168,
                170
            ],
            [
                172,
                178
            ],
            [
                180,
                202
            ],
            [
                208,
                219
            ],
            [
                263,
                320
            ],
            [
                331,
                334
            ],
            [
                345,
                349
            ],
            [
                358,
                380
            ],
            [
                381,
                416
            ],
            [
                418,
                434
            ],
            [
                435,
                479
            ],
            [
                487,
                589
            ],
            [
                597,
                609
            ],
            [
                617,
                636
            ],
            [
                640,
                687
            ],
            [
                724,
                747
            ],
            [
                772,
                827
            ],
            [
                827,
                840
            ],
            [
                846,
                916
            ],
            [
                1100,
                1101
            ],
            [
                923,
                978
            ],
            [
                980,
                1021
            ],
            [
                1023,
                1041
            ],
            [
                1049,
                1074
            ],
            [
                921,
                922
            ],
            [
                1079,
                1086
            ],
            [
                1110,
                1116
            ],
            [
                1118,
                1157
            ],
            [
                1164,
                1177
            ],
            [
                1179,
                1188
            ],
            [
                1235,
                1240
            ],
            [
                1243,
                1251
            ],
            [
                1265,
                1283
            ],
            [
                1285,
                1287
            ],
            [
                1295,
                1341
            ],
            [
                1116,
                1117
            ],
            [
                1342,
                1386
            ],
            [
                1413,
                1451
            ],
            [
                1483,
                1560
            ],
            [
                1577,
                1584
            ],
            [
                1584,
                1667
            ],
            [
                1671,
                1690
            ],
            [
                1690,
                1691
            ],
            [
                1731,
                1733
            ],
            [
                1743,
                1752
            ],
            [
                1761,
                1798
            ],
            [
                1816,
                1818
            ],
            [
                1820,
                1823
            ],
            [
                1827,
                1834
            ],
            [
                1838,
                1848
            ],
            [
                1852,
                1903
            ],
            [
                1913,
                1923
            ],
            [
                1944,
                1953
            ],
            [
                1741,
                1742
            ],
            [
                1965,
                1976
            ],
            [
                1981,
                1990
            ],
            [
                2003,
                2006
            ],
            [
                2007,
                2009
            ],
            [
                2066,
                2068
            ],
            [
                2091,
                2126
            ],
            [
                2130,
                2133
            ],
            [
                2382,
                2387
            ],
            [
                2213,
                2214
            ],
            [
                2223,
                2226
            ],
            [
                2239,
                2253
            ],
            [
                2127,
                2129
            ],
            [
                2259,
                2270
            ],
            [
                2381,
                2382
            ],
            [
                2412,
                2432
            ],
            [
                2442,
                2444
            ],
            [
                2444,
                2449
            ],
            [
                2516,
                2595
            ],
            [
                2600,
                2624
            ],
            [
                2501,
                2503
            ],
            [
                2641,
                2662
            ],
            [
                2699,
                2716
            ],
            [
                2721,
                2760
            ],
            [
                2762,
                2768
            ],
            [
                2770,
                2805
            ],
            [
                2814,
                2903
            ],
            [
                2510,
                2511
            ],
            [
                2905,
                2992
            ],
            [
                3010,
                3019
            ],
            [
                2999,
                3006
            ],
            [
                3021,
                3068
            ],
            [
                3159,
                3162
            ],
            [
                3083,
                3142
            ],
            [
                3069,
                3076
            ],
            [
                3220,
                3255
            ],
            [
                3261,
                3297
            ],
            [
                3302,
                3304
            ],
            [
                3298,
                3301
            ],
            [
                3308,
                3329
            ],
            [
                3339,
                3343
            ],
            [
                3332,
                3334
            ],
            [
                3350,
                3351
            ],
            [
                3363,
                3379
            ],
            [
                3385,
                3439
            ],
            [
                3441,
                3490
            ],
            [
                3496,
                3522
            ],
            [
                3528,
                3530
            ],
            [
                3532,
                3539
            ]
        ],
        "row_chars": [
            [
                0,
                380
            ],
            [
                380,
                487
            ],
            [
                487,
                827
            ],
            [
                827,
                1584
            ],
            [
                1584,
                2068
            ],
            [
                2068,
                2444
            ],
            [
                2444,
                2995
            ],
            [
                2995,
                3329
            ],
            [
                3329,
                3490
            ],
            [
                3490,
                3539
            ]
        ]
    },
    "abridged": {
        "text": "I call all the powers of time and chance, which check us in our careers in this world, to bear witness that I could never yet get fairly to my uncle Toby's amours till this very moment, when my mother's curiosity - or a different impulse in her, as my father would have it - made her wish to peep through the key-hole.\n'Call it, my dear, by its right name,' quoth my father, 'and look through the key-hole as long as you like.'\nNothing but the fermentation of that little subacid humour, which I have often spoken of, in my father, could have made such an insinuation. He was however frank and generous in his nature; so that he had scarce finished this ungracious retort, when his conscience smote him.\nMy mother was at that moment conjugally swinging with her left arm twisted under his right, in such a way that the inside of her hand rested upon the back of his - she raised her fingers, and let them fall - it could scarce be called a tap; or if it was a tap, 'twould be hard to say whether 'twas a tap of remonstrance, or of confession.\nMy father classed it right - Conscience redoubled her blow. - He turned his face suddenly the other way, and my mother, supposing his body was about to turn with it, by a cross movement of her right leg, brought herself so far in front, that as he turned his head, he met her eye.\n- Confusion again! he saw a thousand reasons to wipe out the reproach, and as many to reproach himself - a thin, blue, chill crystal, so clear that the least speck of desire might have been seen, if it had existed - it did not - and how I happen to be so lewd myself, particularly before the equinoxes, Heaven above knows - for my mother was never so.\nTemperate blood ran orderly through her veins at all times; she had never the least heat in her humours. - And as for my father! 'Twas the whole business of his life to keep all fancies of that kind out of her head. Nature had done her part to spare him this trouble; and my father knew it.\n- And here am I sitting, this 12th day of August 1766, in a purple jerkin and yellow slippers, without either wig or cap on, a most tragicomical completion of his prediction, 'That I should neither think, nor act like any other man's child, upon that very account.'\nMy father's mistake was in attacking my mother's motive, instead of her act; for certainly key-holes were made for other purposes; and the act denied a key-hole to be what it was. It became a violation of nature; and so was, you see, criminal.\nThis is why, your Reverences, key-holes are the occasions of more sin and wickedness than all other holes in this world put together.\n- which leads me to my uncle Toby's amours.",
        "paragraph_chars": [
            [
                0,
                319
            ],
            [
                319,
                428
            ],
            [
                428,
                704
            ],
            [
                704,
                1043
            ],
            [
                1043,
                1324
            ],
            [
                1324,
                1676
            ],
            [
                1676,
                1967
            ],
            [
                1967,
                2233
            ],
            [
                2233,
                2477
            ],
            [
                2477,
                2611
            ],
            [
                2611,
                2654
            ]
        ],
        "segment_chars": [
            [
                0,
                319
            ],
            [
                319,
                428
            ],
            [
                428,
                569
            ],
            [
                569,
                704
            ],
            [
                704,
                1043
            ],
            [
                1043,
                1103
            ],
            [
                1103,
                1324
            ],
            [
                1324,
                1343
            ],
            [
                1343,
                1676
            ],
            [
                1676,
                1781
            ],
            [
                1781,
                1805
            ],
            [
                1805,
                1892
            ],
            [
                1892,
                1967
            ],
            [
                1967,
                2233
            ],
            [
                2233,
                2413
            ],
            [
                2413,
                2477
            ],
            [
                2477,
                2611
            ],
            [
                2611,
                2654
            ]
        ],
        "overlap_chars": [
            [
                0,
                47
            ],
            [
                48,
                94
            ],
            [
                95,
                102
            ],
            [
                103,
                148
            ],
            [
                149,
                151
            ],
            [
                153,
                155
            ],
            [
                156,
                162
            ],
            [
                163,
                185
            ],
            [
                191,
                202
            ],
            [
                215,
                272
            ],
            [
                280,
                283
            ],
            [
                292,
                296
            ],
            [
                297,
                319
            ],
            [
                320,
                355
            ],
            [
                358,
                374
            ],
            [
                376,
                420
            ],
            [
                428,
                530
            ],
            [
                530,
                542
            ],
            [
                548,
                567
            ],
            [
                569,
                616
            ],
            [
                616,
                639
            ],
            [
                649,
                704
            ],
            [
                704,
                717
            ],
            [
                733,
                803
            ],
            [
                804,
                805
            ],
            [
                810,
                865
            ],
            [
                868,
                909
            ],
            [
                912,
                930
            ],
            [
                938,
                963
            ],
            [
                963,
                964
            ],
            [
                965,
                972
            ],
            [
                981,
                987
            ],
            [
                988,
                1027
            ],
            [
                1028,
                1041
            ],
            [
                1043,
                1052
            ],
            [
                1053,
                1058
            ],
            [
                1061,
                1069
            ],
            [
                1083,
                1101
            ],
            [
                1105,
                1107
            ],
            [
                1115,
                1161
            ],
            [
                1161,
                1162
            ],
            [
                1163,
                1207
            ],
            [
                1207,
                1245
            ],
            [
                1245,
                1322
            ],
            [
                1336,
                1343
            ],
            [
                1343,
                1426
            ],
            [
                1429,
                1448
            ],
            [
                1456,
                1457
            ],
            [
                1458,
                1460
            ],
            [
                1472,
                1481
            ],
            [
                1482,
                1519
            ],
            [
                1523,
                1525
            ],
            [
                1526,
                1529
            ],
            [
                1530,
                1537
            ],
            [
                1540,
                1550
            ],
            [
                1553,
                1604
            ],
            [
                1605,
                1615
            ],
            [
                1616,
                1625
            ],
            [
                1625,
                1626
            ],
            [
                1634,
                1645
            ],
            [
                1652,
                1661
            ],
            [
                1662,
                1665
            ],
            [
                1672,
                1674
            ],
            [
                1674,
                1676
            ],
            [
                1686,
                1721
            ],
            [
                1725,
                1728
            ],
            [
                1729,
                1734
            ],
            [
                1734,
                1735
            ],
            [
                1736,
                1739
            ],
            [
                1750,
                1764
            ],
            [
                1765,
                1767
            ],
            [
                1768,
                1779
            ],
            [
                1781,
                1782
            ],
            [
                1783,
                1803
            ],
            [
                1803,
                1805
            ],
            [
                1805,
                1810
            ],
            [
                1811,
                1890
            ],
            [
                1892,
                1916
            ],
            [
                1917,
                1919
            ],
            [
                1926,
                1947
            ],
            [
                1948,
                1965
            ],
            [
                1969,
                2008
            ],
            [
                2009,
                2015
            ],
            [
                2016,
                2051
            ],
            [
                2052,
                2141
            ],
            [
                2142,
                2143
            ],
            [
                2143,
                2230
            ],
            [
                2233,
                2242
            ],
            [
                2245,
                2252
            ],
            [
                2253,
                2300
            ],
            [
                2305,
                2308
            ],
            [
                2308,
                2367
            ],
            [
                2368,
                2375
            ],
            [
                2376,
                2411
            ],
            [
                2413,
                2449
            ],
            [
                2450,
                2452
            ],
            [
                2453,
                2456
            ],
            [
                2456,
                2477
            ],
            [
                2477,
                2481
            ],
            [
                2482,
                2484
            ],
            [
                2488,
                2489
            ],
            [
                2490,
                2506
            ],
            [
                2507,
                2561
            ],
            [
                2562,
                2611
            ],
            [
                2613,
                2639
            ],
            [
                2644,
                2646
            ],
            [
                2647,
                2654
            ]
        ],
        "row_chars": [
            [
                0,
                319
            ],
            [
                319,
                428
            ],
            [
                428,
                704
            ],
            [
                704,
                1343
            ],
            [
                1343,
                1676
            ],
            [
                1676,
                1805
            ],
            [
                1805,
                2233
            ],
            [
                2233,
                2477
            ],
            [
                2477,
                2611
            ],
            [
                2611,
                2654
            ]
        ]
    }
}