{
    "original": {
        "text": "My uncle _Toby_ turn'd his head more than once behind him, to see how he was supported by the corporal; and the corporal as oft as he did it, gave a slight flourish with his stick--but not vapouringly; and with the sweetest accent of most respectful encouragement, bid his honour \"never fear.\"\nNow my uncle _Toby_ did fear; and grievously too; he knew not (as my father had reproach'd him) so much as the right end of a Woman from the wrong, and therefore was never altogether at his ease near any one of them----unless in sorrow or distress; then infinite was his pity; nor would the most courteous knight of romance have gone further, at least upon one leg, to have wiped away a tear from a woman's eye; and yet excepting once that he was beguiled into it by Mrs. _Wadman_, he had never looked stedfastly into one; and would often tell my father in the simplicity of his heart, that it was almost (if not about) as bad as talking bawdy.----\n----And suppose it is? my father would say.",
        "paragraph_chars": [
            [
                0,
                294
            ],
            [
                294,
                943
            ],
            [
                943,
                986
            ]
        ],
        "segment_chars": [
            [
                0,
                294
            ],
            [
                294,
                943
            ],
            [
                943,
                966
            ],
            [
                966,
                986
            ]
        ],
        "overlap_chars": [
            [
                0,
                8
            ],
            [
                23,
                46
            ],
            [
                57,
                120
            ],
            [
                142,
                179
            ],
            [
                202,
                210
            ],
            [
                234,
                279
            ],
            [
                281,
                291
            ],
            [
                294,
                306
            ],
            [
                660,
                662
            ],
            [
                314,
                322
            ],
            [
                635,
                636
            ],
            [
                324,
                355
            ],
            [
                390,
                465
            ],
            [
                477,
                493
            ],
            [
                498,
                509
            ],
            [
                513,
                569
            ],
            [
                710,
                720
            ],
            [
                734,
                765
            ],
            [
                767,
                773
            ],
            [
                774,
                795
            ],
            [
                804,
                811
            ],
            [
                691,
                704
            ],
            [
                815,
                898
            ],
            [
                914,
                938
            ],
            [
                947,
                964
            ],
            [
                966,
                986
            ]
        ],
        "row_chars": [
            [
                0,
                294
            ],
            [
                294,
                943
            ],
            [
                943,
                966
            ],
            [
                966,
                986
            ]
        ]
    },
    "abridged": {
        "text": "My uncle Toby turned his head more than once, to see how he was supported by the corporal; and the corporal gave a slight flourish with his stick - and with most respectful encouragement, bid his honour 'never fear.'\nNow my uncle Toby did fear, and grievously too; he knew not so much as the right end of a Woman from the wrong, and therefore was never at his ease near one of them - unless in sorrow or distress; then infinite was his pity. Yet except when he was beguiled into it by Mrs. Wadman, he had never looked steadfastly into a woman's eye; and would often tell my father in the simplicity of his heart, that it was almost as bad as talking bawdy.\n'And suppose it is?' my father would say.",
        "paragraph_chars": [
            [
                0,
                217
            ],
            [
                217,
                657
            ],
            [
                657,
                698
            ]
        ],
        "segment_chars": [
            [
                0,
                217
            ],
            [
                217,
                442
            ],
            [
                442,
                657
            ],
            [
                657,
                678
            ],
            [
                678,
                698
            ]
        ],
        "overlap_chars": [
            [
                0,
                8
            ],
            [
                21,
                44
            ],
            [
                44,
                107
            ],
            [
                108,
                145
            ],
            [
                148,
                156
            ],
            [
                157,
                202
            ],
            [
                204,
                214
            ],
            [
                217,
                229
            ],
            [
                230,
                232
            ],
            [
                235,
                243
            ],
            [
                243,
                244
            ],
            [
                245,
                276
            ],
            [
                277,
                352
            ],
            [
                353,
                369
            ],
            [
                370,
                381
            ],
            [
                384,
                440
            ],
            [
                442,
                452
            ],
            [
                458,
                489
            ],
            [
                490,
                496
            ],
            [
                496,
                517
            ],
            [
                527,
                534
            ],
            [
                535,
                548
            ],
            [
                548,
                631
            ],
            [
                632,
                656
            ],
            [
                658,
                675
            ],
            [
                678,
                698
            ]
        ],
        "row_chars": [
            [
                0,
                217
            ],
            [
                217,
                657
            ],
            [
                657,
                678
            ],
            [
                678,
                698
            ]
        ]
    }
}