{
    "original": {
        "text": "As _Tom_, an' please your honour, had no business at that time with the _Moorish_ girl, he passed on into the room beyond, to talk to the _Jew's_ widow about love----and this pound of sausages; and being, as I have told your honour, an open cheary-hearted lad, with his character wrote in his looks and carriage, he took a chair, and without much apology, but with great civility at the same time, placed it close to her at the table, and sat down.\nThere is nothing so awkward, as courting a woman, an' please your honour, whilst she is making sausages ----So _Tom_ began a discourse upon them; first, gravely, ----\"as how they were made----with what meats, herbs, and spices\" --Then a little gayly, --as, \"With what skins----and if they never burst ----Whether the largest were not the best?\" ----and so on--taking care only as he went along, to season what he had to say upon sausages, rather under than over; ----that he might have room to act in----\nIt was owing to the neglect of that very precaution, said my uncle _Toby_, laying his hand upon _Trim's_ shoulder, that Count _De la Motte_ lost the battle of _Wynendale_: he pressed too speedily into the wood; which if he had not done, _Lisle_ had not fallen into our hands, nor _Ghent_ and _Bruges_, which both followed her example; it was so late in the year, continued my uncle _Toby_, and so terrible a season came on, that if things had not fallen out as they did, our troops must have perish'd in the open field.----\n----Why, therefore, may not battles, an' please your honour, as well as marriages, be made in heaven? --My uncle _Toby_ mused----\nReligion inclined him to say one thing, and his high idea of military skill tempted him to say another; so not being able to frame a reply exactly to his mind----my uncle _Toby_ said nothing at all; and the corporal finished his story.\nAs _Tom_ perceived, an' please your honour, that he gained ground, and that all he had said upon the subject of sausages was kindly taken, he went on to help her a little in making them. ----First, by taking hold of the ring of the sausage whilst she stroked the forced meat down with her hand----then by cutting the strings into proper lengths, and holding them in his hand, whilst she took them out one by one----then, by putting them across her mouth, that she might take them out as she wanted them----and so on from little to more, till at last he adventured to tie the sausage himself, whilst she held the snout.----\n----Now a widow, an' please your honour, always chuses a second husband as unlike the first as she can: so the affair was more than half settled in her mind before _Tom_ mentioned it.\nShe made a feint however of defending herself, by snatching up a sausage: ----_Tom_ instantly laid hold of another------\nBut seeing _Tom's_ had more gristle in it------\nShe signed the capitulation----and _Tom_ sealed it; and there was an end of the matter.",
        "paragraph_chars": [
            [
                0,
                449
            ],
            [
                449,
                954
            ],
            [
                954,
                1478
            ],
            [
                1478,
                1608
            ],
            [
                1608,
                1844
            ],
            [
                1844,
                2467
            ],
            [
                2467,
                2651
            ],
            [
                2651,
                2772
            ],
            [
                2772,
                2820
            ],
            [
                2820,
                2907
            ]
        ],
        "segment_chars": [
            [
                0,
                449
            ],
            [
                449,
                794
            ],
            [
                794,
                954
            ],
            [
                954,
                1478
            ],
            [
                1478,
                1580
            ],
            [
                1580,
                1608
            ],
            [
                1608,
                1844
            ],
            [
                1844,
                2031
            ],
            [
                2031,
                2467
            ],
            [
                2467,
                2651
            ],
            [
                2651,
                2772
            ],
            [
                2772,
                2820
            ],
            [
                2820,
                2907
            ]
        ],
        "overlap_chars": [
            [
                68,
                71
            ],
            [
                73,
                80
            ],
            [
                82,
                87
            ],
            [
                299,
                302
            ],
            [
                98,
                137
            ],
            [
                139,
                144
            ],
            [
                146,
                162
            ],
            [
                8,
                9
            ],
            [
                166,
                214
            ],
            [
                231,
                244
            ],
            [
                247,
                259
            ],
            [
                311,
                333
            ],
            [
                360,
                379
            ],
            [
                398,
                449
            ],
            [
                455,
                476
            ],
            [
                478,
                497
            ],
            [
                523,
                552
            ],
            [
                557,
                559
            ],
            [
                561,
                564
            ],
            [
                566,
                610
            ],
            [
                615,
                618
            ],
            [
                619,
                637
            ],
            [
                641,
                675
            ],
            [
                679,
                692
            ],
            [
                476,
                477
            ],
            [
                702,
                722
            ],
            [
                754,
                794
            ],
            [
                798,
                807
            ],
            [
                809,
                820
            ],
            [
                844,
                846
            ],
            [
                895,
                900
            ],
            [
                847,
                894
            ],
            [
                901,
                910
            ],
            [
                910,
                911
            ],
            [
                916,
                946
            ],
            [
                954,
                1005
            ],
            [
                1007,
                1020
            ],
            [
                1027,
                1049
            ],
            [
                1055,
                1057
            ],
            [
                1059,
                1068
            ],
            [
                1069,
                1079
            ],
            [
                1081,
                1092
            ],
            [
                1094,
                1112
            ],
            [
                1117,
                1123
            ],
            [
                1124,
                1163
            ],
            [
                1005,
                1006
            ],
            [
                1242,
                1245
            ],
            [
                1192,
                1197
            ],
            [
                1214,
                1229
            ],
            [
                1235,
                1240
            ],
            [
                1247,
                1253
            ],
            [
                1287,
                1315
            ],
            [
                1342,
                1382
            ],
            [
                1425,
                1435
            ],
            [
                1441,
                1445
            ],
            [
                1517,
                1518
            ],
            [
                1482,
                1485
            ],
            [
                1498,
                1514
            ],
            [
                1526,
                1578
            ],
            [
                1582,
                1590
            ],
            [
                1598,
                1603
            ],
            [
                1608,
                1655
            ],
            [
                1661,
                1683
            ],
            [
                1703,
                1710
            ],
            [
                1715,
                1746
            ],
            [
                1786,
                1798
            ],
            [
                1805,
                1844
            ],
            [
                1866,
                1867
            ],
            [
                1844,
                1846
            ],
            [
                1848,
                1851
            ],
            [
                1888,
                1926
            ],
            [
                1931,
                2005
            ],
            [
                2015,
                2031
            ],
            [
                2035,
                2106
            ],
            [
                2114,
                2137
            ],
            [
                2141,
                2206
            ],
            [
                2220,
                2240
            ],
            [
                2245,
                2255
            ],
            [
                2350,
                2359
            ],
            [
                2379,
                2396
            ],
            [
                2408,
                2462
            ],
            [
                2486,
                2487
            ],
            [
                2471,
                2483
            ],
            [
                2495,
                2514
            ],
            [
                2522,
                2588
            ],
            [
                2599,
                2630
            ],
            [
                2632,
                2635
            ],
            [
                2637,
                2651
            ],
            [
                2655,
                2724
            ],
            [
                2730,
                2733
            ],
            [
                2735,
                2765
            ],
            [
                2772,
                2782
            ],
            [
                2784,
                2789
            ],
            [
                2791,
                2813
            ],
            [
                2824,
                2834
            ],
            [
                2856,
                2859
            ],
            [
                2861,
                2906
            ]
        ],
        "row_chars": [
            [
                0,
                449
            ],
            [
                449,
                794
            ],
            [
                794,
                954
            ],
            [
                954,
                1478
            ],
            [
                1478,
                1580
            ],
            [
                1580,
                1608
            ],
            [
                1608,
                1844
            ],
            [
                1844,
                2031
            ],
            [
                2031,
                2467
            ],
            [
                2467,
                2651
            ],
            [
                2651,
                2772
            ],
            [
                2772,
                2820
            ],
            [
                2820,
                2907
            ]
        ]
    },
    "abridged": {
        "text": "'Tom walked past the Moorish girl, and went on into the room beyond, to talk to the Jew's widow about love, and this pound of sausages; and being, as I have said, an open cheery-hearted lad, he took a chair, and with great civility placed it close to her at the table, and sat down.\n'There is nothing so awkward as courting a woman whilst she is making sausages - so Tom began a discourse upon them; first, gravely, \"as to how they were made - with what meats, herbs, and spices;\" then a little gaily, as, \"With what skins - whether the largest were not the best?\" - and so on - taking care to under-season what he had to say upon sausages, rather than over-season; so that he might have room to act-'\n'It was owing to the neglect of that very precaution,' said my uncle Toby, laying his hand upon Trim's shoulder, 'that Count De la Motte lost the battle of Wynnendale: he pressed too speedily into the wood, and let Lisle fall into our hands, and then Ghent and Bruges; it was so late in the year, and so terrible a season came on, that otherwise our troops might have perished-'\n'Why may not battles, your honour, as well as marriages, be made in heaven?'\nMy uncle Toby mused-\nReligion inclined him to say one thing, and his idea of military skill another. Not being able to frame a reply, he said nothing; and the corporal finished his story.\n'As Tom saw that he gained ground, and that all he said upon the subject of sausages was kindly taken, he went on to help her in making them. - First, by taking hold of the ring of the sausage whilst she stroked the meat down with her hand - then by cutting the strings into proper lengths, and holding them whilst she took them one by one - and so on, till at last he ventured to tie the sausage himself, whilst she held the snout.\n'Now a widow, your honour, always chooses a second husband as unlike the first as she can: so the affair was half settled in her mind before Tom mentioned it.\n'She made a feint however of defending herself, by snatching up a sausage: Tom instantly laid hold of another.\n'But seeing Tom's had more gristle in it-\n'She signed the agreement; Tom sealed it; and there was an end of the matter.'",
        "paragraph_chars": [
            [
                0,
                283
            ],
            [
                283,
                702
            ],
            [
                702,
                1081
            ],
            [
                1081,
                1158
            ],
            [
                1158,
                1179
            ],
            [
                1179,
                1346
            ],
            [
                1346,
                1779
            ],
            [
                1779,
                1938
            ],
            [
                1938,
                2049
            ],
            [
                2049,
                2091
            ],
            [
                2091,
                2169
            ]
        ],
        "segment_chars": [
            [
                0,
                283
            ],
            [
                283,
                565
            ],
            [
                565,
                702
            ],
            [
                702,
                1081
            ],
            [
                1081,
                1158
            ],
            [
                1158,
                1179
            ],
            [
                1179,
                1259
            ],
            [
                1259,
                1346
            ],
            [
                1346,
                1488
            ],
            [
                1488,
                1779
            ],
            [
                1779,
                1938
            ],
            [
                1938,
                2049
            ],
            [
                2049,
                2091
            ],
            [
                2091,
                2169
            ]
        ],
        "overlap_chars": [
            [
                17,
                20
            ],
            [
                21,
                28
            ],
            [
                29,
                34
            ],
            [
                35,
                38
            ],
            [
                44,
                83
            ],
            [
                84,
                89
            ],
            [
                90,
                106
            ],
            [
                106,
                107
            ],
            [
                108,
                156
            ],
            [
                161,
                174
            ],
            [
                177,
                189
            ],
            [
                189,
                211
            ],
            [
                212,
                231
            ],
            [
                232,
                283
            ],
            [
                290,
                311
            ],
            [
                312,
                331
            ],
            [
                332,
                361
            ],
            [
                364,
                366
            ],
            [
                367,
                370
            ],
            [
                371,
                415
            ],
            [
                416,
                419
            ],
            [
                423,
                441
            ],
            [
                444,
                478
            ],
            [
                481,
                494
            ],
            [
                500,
                501
            ],
            [
                502,
                522
            ],
            [
                525,
                565
            ],
            [
                567,
                576
            ],
            [
                579,
                590
            ],
            [
                591,
                593
            ],
            [
                594,
                599
            ],
            [
                600,
                647
            ],
            [
                648,
                657
            ],
            [
                664,
                665
            ],
            [
                669,
                699
            ],
            [
                703,
                754
            ],
            [
                757,
                770
            ],
            [
                775,
                797
            ],
            [
                802,
                804
            ],
            [
                805,
                814
            ],
            [
                816,
                826
            ],
            [
                827,
                838
            ],
            [
                839,
                857
            ],
            [
                862,
                868
            ],
            [
                868,
                907
            ],
            [
                907,
                908
            ],
            [
                909,
                912
            ],
            [
                917,
                922
            ],
            [
                928,
                943
            ],
            [
                953,
                958
            ],
            [
                963,
                969
            ],
            [
                969,
                997
            ],
            [
                997,
                1037
            ],
            [
                1048,
                1058
            ],
            [
                1065,
                1069
            ],
            [
                1081,
                1082
            ],
            [
                1082,
                1085
            ],
            [
                1086,
                1102
            ],
            [
                1103,
                1155
            ],
            [
                1158,
                1166
            ],
            [
                1172,
                1177
            ],
            [
                1179,
                1226
            ],
            [
                1227,
                1249
            ],
            [
                1250,
                1257
            ],
            [
                1259,
                1290
            ],
            [
                1295,
                1307
            ],
            [
                1307,
                1346
            ],
            [
                1346,
                1347
            ],
            [
                1347,
                1349
            ],
            [
                1350,
                1353
            ],
            [
                1358,
                1396
            ],
            [
                1397,
                1471
            ],
            [
                1472,
                1488
            ],
            [
                1490,
                1561
            ],
            [
                1562,
                1585
            ],
            [
                1588,
                1653
            ],
            [
                1654,
                1674
            ],
            [
                1675,
                1685
            ],
            [
                1688,
                1697
            ],
            [
                1697,
                1714
            ],
            [
                1724,
                1778
            ],
            [
                1779,
                1780
            ],
            [
                1780,
                1792
            ],
            [
                1793,
                1812
            ],
            [
                1821,
                1887
            ],
            [
                1888,
                1919
            ],
            [
                1920,
                1923
            ],
            [
                1924,
                1938
            ],
            [
                1943,
                2012
            ],
            [
                2013,
                2016
            ],
            [
                2017,
                2047
            ],
            [
                2050,
                2060
            ],
            [
                2061,
                2066
            ],
            [
                2067,
                2089
            ],
            [
                2096,
                2106
            ],
            [
                2118,
                2121
            ],
            [
                2122,
                2167
            ]
        ],
        "row_chars": [
            [
                0,
                283
            ],
            [
                283,
                565
            ],
            [
                565,
                702
            ],
            [
                702,
                1081
            ],
            [
                1081,
                1158
            ],
            [
                1158,
                1179
            ],
            [
                1179,
                1346
            ],
            [
                1346,
                1488
            ],
            [
                1488,
                1779
            ],
            [
                1779,
                1938
            ],
            [
                1938,
                2049
            ],
            [
                2049,
                2091
            ],
            [
                2091,
                2169
            ]
        ]
    }
}