{
    "original": {
        "text": "My mother had gone with her left arm twisted in my father's right, till they had got to the fatal angle of the old garden wall, where Doctor _Slop_ was overthrown by _Obadiah_ on the coach-horse: as this was directly opposite to the front of Mrs. _Wadman's_ house, when my father came to it, he gave a look across; and seeing my uncle _Toby_ and the corporal within ten paces of the door, he turn'd about---- \"Let us just stop a moment, quoth my father, and see with what ceremonies my brother _Toby_ and his man _Trim_ make their first entry----it will not detain us, added my father, a single minute:\" ----No matter, if it be ten minutes, quoth my mother.\n----It will not detain us half one; said my father.\nThe corporal was just then setting in with the story of his brother _Tom_ and the _Jew's_ widow: the story went on--and on----it had episodes in it----it came back, and went on----and on again; there was no end of it----the reader found it very long----\n----G-- help my father! he pish'd fifty times at every new attitude, and gave the corporal's stick, with all its flourishings and dangling, to as many devils as chose to accept of them.\nWhen issues of events like these my father is waiting for, are hanging in the scales of fate, the mind has the advantage of changing the principle of expectation three times, without which it would not have power to see it out.\nCuriosity governs the _first moment_; and the second moment is all conomy to justify the expence of the first----and for the third, fourth, fifth, and sixth moments, and so on to the day of judgment--'tis a point of HONOUR.\nI need not be told, that the ethic writers have assigned this all to Patience; but that VIRTUE, methinks, has extent of dominion sufficient of her own, and enough to do in it, without invading the few dismantled castles which HONOUR has left him upon the earth.\nMy father stood it out as well as he could with these three auxiliaries to the end of _Trim's_ story; and from thence to the end of my uncle _Toby's_ panegyrick upon arms, in the chapter following it; when seeing, that instead of marching up to Mrs. _Wadman's_ door, they both faced about and march'd down the avenue diametrically opposite to his expectation--he broke out at once with that little subacid soreness of humour which, in certain situations, distinguished his character from that of all other men.",
        "paragraph_chars": [
            [
                0,
                658
            ],
            [
                658,
                710
            ],
            [
                710,
                964
            ],
            [
                964,
                1150
            ],
            [
                1150,
                1378
            ],
            [
                1378,
                1602
            ],
            [
                1602,
                1864
            ],
            [
                1864,
                2374
            ]
        ],
        "segment_chars": [
            [
                0,
                658
            ],
            [
                658,
                710
            ],
            [
                710,
                964
            ],
            [
                964,
                988
            ],
            [
                988,
                1150
            ],
            [
                1150,
                1378
            ],
            [
                1378,
                1602
            ],
            [
                1602,
                1864
            ],
            [
                1864,
                2374
            ]
        ],
        "overlap_chars": [
            [
                0,
                76
            ],
            [
                208,
                225
            ],
            [
                229,
                246
            ],
            [
                248,
                256
            ],
            [
                258,
                263
            ],
            [
                708,
                709
            ],
            [
                270,
                279
            ],
            [
                307,
                334
            ],
            [
                85,
                87
            ],
            [
                163,
                165
            ],
            [
                342,
                391
            ],
            [
                694,
                698
            ],
            [
                126,
                127
            ],
            [
                410,
                436
            ],
            [
                454,
                461
            ],
            [
                483,
                493
            ],
            [
                226,
                228
            ],
            [
                501,
                512
            ],
            [
                520,
                542
            ],
            [
                188,
                189
            ],
            [
                546,
                567
            ],
            [
                300,
                301
            ],
            [
                595,
                601
            ],
            [
                608,
                617
            ],
            [
                619,
                639
            ],
            [
                641,
                658
            ],
            [
                710,
                736
            ],
            [
                753,
                777
            ],
            [
                779,
                782
            ],
            [
                784,
                791
            ],
            [
                793,
                798
            ],
            [
                800,
                824
            ],
            [
                826,
                832
            ],
            [
                890,
                926
            ],
            [
                968,
                969
            ],
            [
                972,
                988
            ],
            [
                988,
                992
            ],
            [
                998,
                1009
            ],
            [
                1031,
                1036
            ],
            [
                1042,
                1089
            ],
            [
                1102,
                1103
            ],
            [
                1010,
                1012
            ],
            [
                1148,
                1150
            ],
            [
                1150,
                1154
            ],
            [
                1165,
                1252
            ],
            [
                1325,
                1332
            ],
            [
                1339,
                1378
            ],
            [
                1378,
                1399
            ],
            [
                1401,
                1413
            ],
            [
                1414,
                1444
            ],
            [
                1452,
                1466
            ],
            [
                1475,
                1487
            ],
            [
                1491,
                1553
            ],
            [
                1578,
                1602
            ],
            [
                1637,
                1658
            ],
            [
                1664,
                1667
            ],
            [
                1659,
                1663
            ],
            [
                1668,
                1711
            ],
            [
                1758,
                1764
            ],
            [
                1778,
                1843
            ],
            [
                1848,
                1864
            ],
            [
                1864,
                1906
            ],
            [
                1936,
                1949
            ],
            [
                1955,
                1957
            ],
            [
                1959,
                1969
            ],
            [
                1982,
                2004
            ],
            [
                2204,
                2206
            ],
            [
                2010,
                2012
            ],
            [
                2025,
                2034
            ],
            [
                2063,
                2069
            ],
            [
                2034,
                2035
            ],
            [
                2070,
                2076
            ],
            [
                2078,
                2113
            ],
            [
                2115,
                2123
            ],
            [
                2125,
                2140
            ],
            [
                2153,
                2156
            ],
            [
                2165,
                2180
            ],
            [
                2036,
                2042
            ],
            [
                2195,
                2203
            ],
            [
                2224,
                2294
            ],
            [
                2319,
                2359
            ],
            [
                2364,
                2374
            ]
        ],
        "row_chars": [
            [
                0,
                710
            ],
            [
                710,
                964
            ],
            [
                964,
                988
            ],
            [
                988,
                1150
            ],
            [
                1150,
                1378
            ],
            [
                1378,
                1602
            ],
            [
                1602,
                1864
            ],
            [
                1864,
                2374
            ]
        ]
    },
    "abridged": {
        "text": "My mother had gone with her left arm twisted in my father's right, till they were directly opposite the front of Mrs. Wadman's house. My father looked across; and seeing my uncle Toby and the corporal within ten paces of the door, he said,\n'Let us just stop a moment, and see how my brother Toby and his man Trim make their first entry - it will not detain us a minute.'\n'No matter if it be ten minutes,' quoth my mother.\nThe corporal was just then starting the story of his brother Tom and the Jew's widow: the story went on - and on - and on again; there was no end of it.\nG__ help my father! he pished fifty times, and wished the corporal's stick, with all its flourishings, at the devil.\nWhen events like these my father is waiting for, are hanging in the scales of fate, the mind changes its expectations; without this it would not have power to see it out.\nCuriosity governs the first moment; and the second moment is all economy to justify the expense of the first - and for the third, fourth, fifth, and sixth moments, and so on - 'tis a point of Honour.\nWriters have assigned all this to Patience; but that Virtue, methinks, has enough power without invading the few dismantled castles which Honour has left upon the earth.\nMy father stood it out as well as he could to the end of Trim's story; and then to the end of my uncle Toby's speech upon arms; when, seeing that instead of marching up to Mrs. Wadman's door, they both turned around and marched down the avenue in the opposite direction - he broke out at once with that little subacid soreness of humour which distinguished his character from that of other men.",
        "paragraph_chars": [
            [
                0,
                240
            ],
            [
                240,
                371
            ],
            [
                371,
                422
            ],
            [
                422,
                575
            ],
            [
                575,
                692
            ],
            [
                692,
                863
            ],
            [
                863,
                1063
            ],
            [
                1063,
                1233
            ],
            [
                1233,
                1627
            ]
        ],
        "segment_chars": [
            [
                0,
                134
            ],
            [
                134,
                240
            ],
            [
                240,
                371
            ],
            [
                371,
                422
            ],
            [
                422,
                575
            ],
            [
                575,
                595
            ],
            [
                595,
                692
            ],
            [
                692,
                863
            ],
            [
                863,
                1063
            ],
            [
                1063,
                1233
            ],
            [
                1233,
                1627
            ]
        ],
        "overlap_chars": [
            [
                0,
                76
            ],
            [
                82,
                99
            ],
            [
                100,
                117
            ],
            [
                118,
                126
            ],
            [
                127,
                132
            ],
            [
                132,
                133
            ],
            [
                134,
                143
            ],
            [
                151,
                178
            ],
            [
                179,
                181
            ],
            [
                181,
                183
            ],
            [
                184,
                233
            ],
            [
                234,
                238
            ],
            [
                238,
                239
            ],
            [
                241,
                267
            ],
            [
                268,
                275
            ],
            [
                280,
                290
            ],
            [
                291,
                293
            ],
            [
                296,
                307
            ],
            [
                313,
                335
            ],
            [
                336,
                337
            ],
            [
                338,
                359
            ],
            [
                360,
                361
            ],
            [
                362,
                368
            ],
            [
                372,
                381
            ],
            [
                382,
                402
            ],
            [
                405,
                422
            ],
            [
                422,
                448
            ],
            [
                458,
                482
            ],
            [
                483,
                486
            ],
            [
                487,
                494
            ],
            [
                495,
                500
            ],
            [
                501,
                525
            ],
            [
                528,
                534
            ],
            [
                537,
                573
            ],
            [
                575,
                576
            ],
            [
                579,
                595
            ],
            [
                595,
                599
            ],
            [
                605,
                616
            ],
            [
                616,
                621
            ],
            [
                629,
                676
            ],
            [
                676,
                677
            ],
            [
                678,
                680
            ],
            [
                690,
                692
            ],
            [
                692,
                696
            ],
            [
                697,
                784
            ],
            [
                811,
                818
            ],
            [
                824,
                863
            ],
            [
                863,
                884
            ],
            [
                885,
                897
            ],
            [
                897,
                927
            ],
            [
                936,
                950
            ],
            [
                959,
                971
            ],
            [
                974,
                1036
            ],
            [
                1039,
                1063
            ],
            [
                1063,
                1084
            ],
            [
                1085,
                1088
            ],
            [
                1089,
                1093
            ],
            [
                1094,
                1137
            ],
            [
                1138,
                1144
            ],
            [
                1151,
                1216
            ],
            [
                1217,
                1233
            ],
            [
                1233,
                1275
            ],
            [
                1276,
                1289
            ],
            [
                1294,
                1296
            ],
            [
                1297,
                1307
            ],
            [
                1313,
                1335
            ],
            [
                1336,
                1338
            ],
            [
                1340,
                1342
            ],
            [
                1350,
                1359
            ],
            [
                1359,
                1365
            ],
            [
                1365,
                1366
            ],
            [
                1367,
                1373
            ],
            [
                1374,
                1409
            ],
            [
                1410,
                1418
            ],
            [
                1419,
                1434
            ],
            [
                1449,
                1452
            ],
            [
                1461,
                1476
            ],
            [
                1477,
                1483
            ],
            [
                1484,
                1492
            ],
            [
                1505,
                1575
            ],
            [
                1576,
                1616
            ],
            [
                1617,
                1627
            ]
        ],
        "row_chars": [
            [
                0,
                422
            ],
            [
                422,
                575
            ],
            [
                575,
                595
            ],
            [
                595,
                692
            ],
            [
                692,
                863
            ],
            [
                863,
                1063
            ],
            [
                1063,
                1233
            ],
            [
                1233,
                1627
            ]
        ]
    }
}