{
    "original": {
        "text": "Upon looking back from the end of the last chapter, and surveying the texture of what has been wrote, it is necessary, that upon this page and the three following, a good quantity of heterogeneous matter be inserted to keep up that just balance betwixt wisdom and folly, without which a book would not hold together a single year: nor is it a poor creeping digression (which but for the name of, a man might continue as well going on in the king's highway) which will do the business----no; if it is to be a digression, it must be a good frisky one, and upon a frisky subject too, where neither the horse or his rider are to be caught, but by rebound.\nThe only difficulty, is raising powers suitable to the nature of the service: FANCY is capricious --WIT must not be searched for--and PLEASANTRY (good-natured slut as she is) will not come in at a call, was an empire to be laid at her feet.\n----The best way for a man is to say his prayers----\nOnly if it puts him in mind of his infirmities and defects as well ghostly as bodily--for that purpose, he will find himself rather worse after he has said them than before--for other purposes, better.\nFor my own part, there is not a way either moral or mechanical under heaven that I could think of, which I have not taken with myself in this case: sometimes by addressing myself directly to the soul herself, and arguing the point over and over again with her upon the extent of her own faculties----\n----I never could make them an inch the wider----\nThen by changing my system, and trying what could be made of it upon the body, by temperance, soberness, and chastity: These are good, quoth I, in themselves--they are good, absolutely; --they are good, relatively; --they are good for health--they are good for happiness in this world--they are good for happiness in the next----\nIn short, they were good for everything but the thing wanted; and there they were good for nothing, but to leave the soul just as heaven made it: as for the theological virtues of faith and hope, they give it courage; but then that snivelling virtue of Meekness (as my father would always call it) takes it quite away again, so you are exactly where you started.\nNow in all common and ordinary cases, there is nothing which I have found to answer so well as this----\n----Certainly, if there is any dependence upon Logic, and that I am not blinded by self-love, there must be something of true genius about me, merely upon this symptom of it, that I do not know what envy is: for never do I hit upon any invention or device which tendeth to the furtherance of good writing, but I instantly make it public; willing that all mankind should write as well as myself.\n----Which they certainly will, when they think as little.",
        "paragraph_chars": [
            [
                0,
                652
            ],
            [
                652,
                893
            ],
            [
                893,
                946
            ],
            [
                946,
                1148
            ],
            [
                1148,
                1449
            ],
            [
                1449,
                1499
            ],
            [
                1499,
                1829
            ],
            [
                1829,
                2192
            ],
            [
                2192,
                2296
            ],
            [
                2296,
                2691
            ],
            [
                2691,
                2748
            ]
        ],
        "segment_chars": [
            [
                0,
                652
            ],
            [
                652,
                893
            ],
            [
                893,
                946
            ],
            [
                946,
                1148
            ],
            [
                1148,
                1449
            ],
            [
                1449,
                1499
            ],
            [
                1499,
                1829
            ],
            [
                1829,
                2192
            ],
            [
                2192,
                2296
            ],
            [
                2296,
                2691
            ],
            [
                2691,
                2748
            ]
        ],
        "overlap_chars": [
            [
                0,
                117
            ],
            [
                119,
                146
            ],
            [
                147,
                152
            ],
            [
                162,
                182
            ],
            [
                197,
                203
            ],
            [
                204,
                231
            ],
            [
                237,
                315
            ],
            [
                329,
                334
            ],
            [
                463,
                467
            ],
            [
                341,
                367
            ],
            [
                468,
                483
            ],
            [
                487,
                490
            ],
            [
                520,
                579
            ],
            [
                650,
                652
            ],
            [
                652,
                671
            ],
            [
                673,
                749
            ],
            [
                752,
                755
            ],
            [
                765,
                767
            ],
            [
                782,
                815
            ],
            [
                819,
                840
            ],
            [
                844,
                854
            ],
            [
                859,
                868
            ],
            [
                875,
                893
            ],
            [
                897,
                909
            ],
            [
                920,
                922
            ],
            [
                910,
                919
            ],
            [
                923,
                941
            ],
            [
                946,
                950
            ],
            [
                1138,
                1139
            ],
            [
                951,
                956
            ],
            [
                962,
                965
            ],
            [
                974,
                1004
            ],
            [
                1048,
                1118
            ],
            [
                1146,
                1148
            ],
            [
                1148,
                1269
            ],
            [
                1282,
                1284
            ],
            [
                1290,
                1305
            ],
            [
                1309,
                1347
            ],
            [
                1355,
                1360
            ],
            [
                1499,
                1506
            ],
            [
                1531,
                1616
            ],
            [
                1624,
                1632
            ],
            [
                1634,
                1642
            ],
            [
                1730,
                1740
            ],
            [
                1756,
                1783
            ],
            [
                1384,
                1387
            ],
            [
                1799,
                1824
            ],
            [
                1829,
                1973
            ],
            [
                1975,
                1985
            ],
            [
                1998,
                2078
            ],
            [
                2082,
                2192
            ],
            [
                2192,
                2202
            ],
            [
                2214,
                2268
            ],
            [
                2210,
                2213
            ],
            [
                2276,
                2291
            ],
            [
                2309,
                2313
            ],
            [
                2359,
                2438
            ],
            [
                2476,
                2541
            ],
            [
                2569,
                2601
            ],
            [
                2608,
                2617
            ],
            [
                2623,
                2633
            ],
            [
                2642,
                2691
            ],
            [
                2695,
                2748
            ]
        ],
        "row_chars": [
            [
                0,
                652
            ],
            [
                652,
                893
            ],
            [
                893,
                946
            ],
            [
                946,
                1148
            ],
            [
                1148,
                1829
            ],
            [
                1829,
                2192
            ],
            [
                2192,
                2296
            ],
            [
                2296,
                2691
            ],
            [
                2691,
                2748
            ]
        ]
    },
    "abridged": {
        "text": "Upon looking back from the end of the last chapter, and surveying the texture of what has been wrote, it is necessary that upon this page and the next three, a good quantity of assorted matter should be inserted to keep up that balance betwixt wisdom and folly, without which a book would not hold together: nor will a poor creeping digression do the business - no; it must be a good frisky one, and upon a frisky subject too.\nThe only difficulty is raising powers suitable to the nature of the service: Fancy is capricious - Wit should be spontaneous - and Pleasantry (good-natured slut though she is) will not come at a call, even if an empire were laid at her feet.\n- The best way is for a man to say his prayers-\nOnly, if it reminds him of his infirmities and defects, he will find himself rather worse after he has said them than before.\nFor my own part, there is not a way either moral or mechanical under heaven that I could think of, which I have not taken in his case: sometimes addressing myself directly to the soul, and then by trying what could be made of it upon the body, by temperance, soberness, and chastity.\n'These are good,' quoth I, 'for health - for happiness in this world - and for happiness in the next-'\nIn short, they were good for everything but the thing wanted; and there they were good for nothing, but to leave the soul just as heaven made it. As for the virtues of faith and hope, they give it courage; but then that snivelling virtue Meekness (as my father would always call it) takes it quite away again, so you are exactly where you started.\nNow in all ordinary cases, there is nothing which I have found to inspire the author's wit and fancy so well as this-\n- Certainly, if I am not blinded by self-love, there must be something of true genius about me, because I do not know what envy is: for never do I hit upon any invention for the furtherance of good writing, without instantly making it public; wishing that all mankind should write as well as myself.\n- Which they certainly will, when they think as little.",
        "paragraph_chars": [
            [
                0,
                427
            ],
            [
                427,
                669
            ],
            [
                669,
                717
            ],
            [
                717,
                843
            ],
            [
                843,
                1127
            ],
            [
                1127,
                1230
            ],
            [
                1230,
                1578
            ],
            [
                1578,
                1696
            ],
            [
                1696,
                1996
            ],
            [
                1996,
                2051
            ]
        ],
        "segment_chars": [
            [
                0,
                427
            ],
            [
                427,
                669
            ],
            [
                669,
                717
            ],
            [
                717,
                843
            ],
            [
                843,
                1127
            ],
            [
                1127,
                1230
            ],
            [
                1230,
                1376
            ],
            [
                1376,
                1578
            ],
            [
                1578,
                1696
            ],
            [
                1696,
                1996
            ],
            [
                1996,
                2051
            ]
        ],
        "overlap_chars": [
            [
                0,
                117
            ],
            [
                118,
                145
            ],
            [
                151,
                156
            ],
            [
                156,
                176
            ],
            [
                186,
                192
            ],
            [
                200,
                227
            ],
            [
                228,
                306
            ],
            [
                306,
                311
            ],
            [
                312,
                316
            ],
            [
                317,
                343
            ],
            [
                344,
                359
            ],
            [
                362,
                365
            ],
            [
                366,
                425
            ],
            [
                425,
                427
            ],
            [
                427,
                446
            ],
            [
                447,
                523
            ],
            [
                526,
                529
            ],
            [
                537,
                539
            ],
            [
                554,
                587
            ],
            [
                595,
                616
            ],
            [
                617,
                627
            ],
            [
                636,
                645
            ],
            [
                651,
                669
            ],
            [
                671,
                683
            ],
            [
                684,
                686
            ],
            [
                687,
                696
            ],
            [
                697,
                715
            ],
            [
                717,
                721
            ],
            [
                721,
                722
            ],
            [
                723,
                728
            ],
            [
                737,
                740
            ],
            [
                741,
                771
            ],
            [
                771,
                841
            ],
            [
                841,
                843
            ],
            [
                843,
                964
            ],
            [
                965,
                967
            ],
            [
                972,
                987
            ],
            [
                988,
                1026
            ],
            [
                1026,
                1031
            ],
            [
                1032,
                1039
            ],
            [
                1040,
                1125
            ],
            [
                1134,
                1142
            ],
            [
                1145,
                1153
            ],
            [
                1155,
                1165
            ],
            [
                1168,
                1195
            ],
            [
                1198,
                1201
            ],
            [
                1202,
                1227
            ],
            [
                1230,
                1374
            ],
            [
                1376,
                1386
            ],
            [
                1387,
                1467
            ],
            [
                1468,
                1578
            ],
            [
                1578,
                1588
            ],
            [
                1589,
                1643
            ],
            [
                1669,
                1672
            ],
            [
                1679,
                1694
            ],
            [
                1707,
                1711
            ],
            [
                1712,
                1791
            ],
            [
                1800,
                1865
            ],
            [
                1870,
                1902
            ],
            [
                1911,
                1920
            ],
            [
                1928,
                1938
            ],
            [
                1947,
                1996
            ],
            [
                1998,
                2051
            ]
        ],
        "row_chars": [
            [
                0,
                427
            ],
            [
                427,
                669
            ],
            [
                669,
                717
            ],
            [
                717,
                843
            ],
            [
                843,
                1230
            ],
            [
                1230,
                1578
            ],
            [
                1578,
                1696
            ],
            [
                1696,
                1996
            ],
            [
                1996,
                2051
            ]
        ]
    }
}