{
    "original": {
        "text": "As Mrs. _Bridget's_ finger and thumb were upon the latch, the corporal did not knock as oft as perchance your honour's taylor ----I might have taken my example something nearer home; for I owe mine, some five and twenty pounds at least, and wonder at the man's patience----\n----But this is nothing at all to the world: only 'tis a cursed thing to be in debt, and there seems to be a fatality in the exchequers of some poor princes, particularly those of our house, which no Economy can bind down in irons: for my own part, I'm persuaded there is not any one prince, prelate, pope, or potentate, great or small upon earth, more desirous in his heart of keeping straight with the world than I am---- or who takes more likely means for it. I never give above half a guinea----or walk with boots----or cheapen tooth-picks----or lay out a shilling upon a band-box the year round; and for the six months I'm in the country, I'm upon so small a scale, that with all the good temper in the world, I outdo _Rousseau_, a bar length------for I keep neither man or boy, or horse, or cow, or dog, or cat, or anything that can eat or drink, except a thin poor piece of a Vestal (to keep my fire in), and who has generally as bad an appetite as myself----but if you think this makes a philosopher of me ----I would not my good people! give a rush for your judgments.\nTrue philosophy----but there is no treating the subject whilst my uncle is whistling Lillabullero.\n----Let us go into the house.",
        "paragraph_chars": [
            [
                0,
                274
            ],
            [
                274,
                1352
            ],
            [
                1352,
                1451
            ],
            [
                1451,
                1480
            ]
        ],
        "segment_chars": [
            [
                0,
                274
            ],
            [
                274,
                737
            ],
            [
                737,
                1320
            ],
            [
                1320,
                1352
            ],
            [
                1352,
                1451
            ],
            [
                1451,
                1480
            ]
        ],
        "overlap_chars": [
            [
                0,
                7
            ],
            [
                16,
                18
            ],
            [
                20,
                87
            ],
            [
                92,
                94
            ],
            [
                105,
                118
            ],
            [
                193,
                197
            ],
            [
                181,
                192
            ],
            [
                204,
                269
            ],
            [
                278,
                297
            ],
            [
                305,
                404
            ],
            [
                451,
                463
            ],
            [
                523,
                545
            ],
            [
                471,
                473
            ],
            [
                558,
                564
            ],
            [
                573,
                593
            ],
            [
                622,
                626
            ],
            [
                660,
                690
            ],
            [
                698,
                737
            ],
            [
                737,
                769
            ],
            [
                773,
                791
            ],
            [
                795,
                817
            ],
            [
                821,
                823
            ],
            [
                832,
                842
            ],
            [
                848,
                858
            ],
            [
                873,
                908
            ],
            [
                916,
                919
            ],
            [
                927,
                943
            ],
            [
                945,
                949
            ],
            [
                989,
                996
            ],
            [
                1004,
                1006
            ],
            [
                1027,
                1037
            ],
            [
                1046,
                1049
            ],
            [
                1056,
                1163
            ],
            [
                1164,
                1185
            ],
            [
                1190,
                1236
            ],
            [
                1240,
                1287
            ],
            [
                1292,
                1303
            ],
            [
                1320,
                1352
            ],
            [
                1352,
                1367
            ],
            [
                1371,
                1451
            ],
            [
                1455,
                1480
            ]
        ],
        "row_chars": [
            [
                0,
                274
            ],
            [
                274,
                737
            ],
            [
                737,
                1352
            ],
            [
                1352,
                1451
            ],
            [
                1451,
                1480
            ]
        ]
    },
    "abridged": {
        "text": "As Mrs. Bridget's finger and thumb were upon the latch, the corporal did not knock as often as perhaps your honour's tailor does - certainly not as often as mine; for I owe him five and twenty pounds at least, and wonder at the man's patience.\n- But this is nothing to the world: only 'tis a cursed thing to be in debt, and there seems to be a fatality in the exchequer of our house; I'm persuaded there is no prince, pope, or potentate who more desires to keep straight with the world than I do - or who takes more likely means for it. I never give above half a guinea - or walk with boots - or cheapen tooth-picks - or pay a shilling for a band-box; and for the six months I'm in the countryside, I live on so small a scale that I outdo Rousseau - for I keep no man-servant, or horse, or cow, or dog, or cat, or anything that can eat or drink, except a thin poor piece of a Vestal housemaid (to keep my fire in), who has generally as bad an appetite as myself - but if you think this makes a philosopher of me - I would not give a rush for your judgments.\nTrue philosophy - but there is no treating the subject whilst my uncle is whistling Lillabullero.\n- Let us go into the house.",
        "paragraph_chars": [
            [
                0,
                244
            ],
            [
                244,
                1058
            ],
            [
                1058,
                1156
            ],
            [
                1156,
                1183
            ]
        ],
        "segment_chars": [
            [
                0,
                244
            ],
            [
                244,
                537
            ],
            [
                537,
                1058
            ],
            [
                1058,
                1156
            ],
            [
                1156,
                1183
            ]
        ],
        "overlap_chars": [
            [
                0,
                7
            ],
            [
                15,
                17
            ],
            [
                18,
                85
            ],
            [
                92,
                94
            ],
            [
                103,
                116
            ],
            [
                157,
                161
            ],
            [
                161,
                172
            ],
            [
                177,
                242
            ],
            [
                246,
                265
            ],
            [
                266,
                365
            ],
            [
                370,
                382
            ],
            [
                384,
                406
            ],
            [
                407,
                409
            ],
            [
                410,
                416
            ],
            [
                416,
                436
            ],
            [
                441,
                445
            ],
            [
                462,
                492
            ],
            [
                498,
                537
            ],
            [
                537,
                569
            ],
            [
                572,
                590
            ],
            [
                593,
                615
            ],
            [
                618,
                620
            ],
            [
                625,
                635
            ],
            [
                640,
                650
            ],
            [
                650,
                685
            ],
            [
                697,
                700
            ],
            [
                709,
                725
            ],
            [
                726,
                730
            ],
            [
                731,
                738
            ],
            [
                745,
                747
            ],
            [
                750,
                760
            ],
            [
                764,
                767
            ],
            [
                775,
                882
            ],
            [
                893,
                914
            ],
            [
                915,
                961
            ],
            [
                964,
                1011
            ],
            [
                1014,
                1025
            ],
            [
                1026,
                1058
            ],
            [
                1058,
                1073
            ],
            [
                1076,
                1156
            ],
            [
                1158,
                1183
            ]
        ],
        "row_chars": [
            [
                0,
                244
            ],
            [
                244,
                537
            ],
            [
                537,
                1058
            ],
            [
                1058,
                1156
            ],
            [
                1156,
                1183
            ]
        ]
    }
}