{
    "original": {
        "text": "Now there are such an infinitude of notes, tunes, cants, chants, airs, looks, and accents with which the word _fiddlestick_ may be pronounced in all such causes as this, every one of 'em impressing a sense and meaning as different from the other, as _dirt_ from _cleanliness_ --That Casuists (for it is an affair of conscience on that score) reckon up no less than fourteen thousand in which you may do either right or wrong.\nMrs. _Wadman_ hit upon the _fiddlestick_, which summoned up all my uncle _Toby's_ modest blood into his cheeks--so feeling within himself that he had somehow or other got beyond his depth, he stopt short; and without entering further either into the pains or pleasures of matrimony, he laid his hand upon his heart, and made an offer to take them as they were, and share them along with her.\nWhen my uncle _Toby_ had said this, he did not care to say it again; so casting his eye upon the Bible which Mrs. _Wadman_ had laid upon the table, he took it up; and popping, dear soul! upon a passage in it, of all others the most interesting to him--which was the siege of _Jericho_--he set himself to read it over--leaving his proposal of marriage, as he had done his declaration of love, to work with her after its own way. Now it wrought neither as an astringent or a loosener; nor like opium, or bark, or mercury, or buckthorn, or any one drug which nature had bestowed upon the world--in short, it work'd not at all in her; and the cause of that was, that there was something working there before ----Babbler that I am! I have anticipated what it was a dozen times; but there is fire still in the subject----allons.",
        "paragraph_chars": [
            [
                0,
                426
            ],
            [
                426,
                818
            ],
            [
                818,
                1640
            ]
        ],
        "segment_chars": [
            [
                0,
                426
            ],
            [
                426,
                818
            ],
            [
                818,
                1005
            ],
            [
                1005,
                1246
            ],
            [
                1246,
                1545
            ],
            [
                1545,
                1640
            ]
        ],
        "overlap_chars": [
            [
                0,
                13
            ],
            [
                36,
                48
            ],
            [
                55,
                109
            ],
            [
                111,
                122
            ],
            [
                124,
                141
            ],
            [
                168,
                186
            ],
            [
                198,
                199
            ],
            [
                210,
                249
            ],
            [
                257,
                261
            ],
            [
                263,
                274
            ],
            [
                278,
                291
            ],
            [
                342,
                382
            ],
            [
                424,
                426
            ],
            [
                426,
                430
            ],
            [
                432,
                438
            ],
            [
                440,
                452
            ],
            [
                454,
                465
            ],
            [
                468,
                482
            ],
            [
                486,
                498
            ],
            [
                504,
                506
            ],
            [
                508,
                536
            ],
            [
                541,
                548
            ],
            [
                564,
                617
            ],
            [
                624,
                801
            ],
            [
                808,
                818
            ],
            [
                818,
                831
            ],
            [
                839,
                931
            ],
            [
                933,
                939
            ],
            [
                941,
                1005
            ],
            [
                1005,
                1025
            ],
            [
                1070,
                1079
            ],
            [
                1045,
                1068
            ],
            [
                1080,
                1092
            ],
            [
                1094,
                1101
            ],
            [
                1104,
                1106
            ],
            [
                1119,
                1129
            ],
            [
                1144,
                1169
            ],
            [
                1185,
                1245
            ],
            [
                1250,
                1252
            ],
            [
                1430,
                1448
            ],
            [
                1481,
                1521
            ],
            [
                1526,
                1545
            ],
            [
                1545,
                1629
            ],
            [
                1633,
                1640
            ]
        ],
        "row_chars": [
            [
                0,
                426
            ],
            [
                426,
                818
            ],
            [
                818,
                1005
            ],
            [
                1005,
                1246
            ],
            [
                1246,
                1545
            ],
            [
                1545,
                1640
            ]
        ]
    },
    "abridged": {
        "text": "Now there are so many notes, tunes, chants, airs, looks, and accents with which the word fiddlestick may be pronounced, every one of 'em having a meaning as different from the other, as dirt from cleanliness - that Casuists reckon up no less than fourteen thousand.\nMrs. Wadman hit upon the fiddlestick which summoned all my uncle Toby's modest blood into his cheeks. Feeling that he had somehow or other got beyond his depth, he stopped short; and without entering further either into the pains or pleasures of matrimony, he laid his hand upon his heart, and made an offer to take them as they were, and share them with her.\nWhen my uncle Toby had said this, he did not care to say it again; so casting his eye upon the Bible which Mrs. Wadman had laid upon the table, he took it up; and popping, dear soul! upon a passage in it which was most interesting to him - the siege of Jericho - he began to read it - leaving his proposal of marriage, like his declaration of love, to work with her after its own way.\nBut it worked not at all in her; because there was something working there before - Babbler that I am! I have anticipated what it was a dozen times; but there is fire still in the subject. - Allons.",
        "paragraph_chars": [
            [
                0,
                266
            ],
            [
                266,
                626
            ],
            [
                626,
                1011
            ],
            [
                1011,
                1209
            ]
        ],
        "segment_chars": [
            [
                0,
                266
            ],
            [
                266,
                368
            ],
            [
                368,
                626
            ],
            [
                626,
                809
            ],
            [
                809,
                1011
            ],
            [
                1011,
                1114
            ],
            [
                1114,
                1200
            ],
            [
                1200,
                1209
            ]
        ],
        "overlap_chars": [
            [
                0,
                13
            ],
            [
                22,
                34
            ],
            [
                34,
                88
            ],
            [
                89,
                100
            ],
            [
                101,
                118
            ],
            [
                118,
                136
            ],
            [
                144,
                145
            ],
            [
                146,
                185
            ],
            [
                191,
                195
            ],
            [
                196,
                207
            ],
            [
                210,
                223
            ],
            [
                224,
                264
            ],
            [
                264,
                266
            ],
            [
                266,
                270
            ],
            [
                271,
                277
            ],
            [
                278,
                290
            ],
            [
                291,
                302
            ],
            [
                303,
                317
            ],
            [
                318,
                330
            ],
            [
                335,
                337
            ],
            [
                338,
                366
            ],
            [
                368,
                375
            ],
            [
                376,
                429
            ],
            [
                438,
                615
            ],
            [
                616,
                626
            ],
            [
                626,
                639
            ],
            [
                645,
                737
            ],
            [
                738,
                744
            ],
            [
                745,
                809
            ],
            [
                809,
                829
            ],
            [
                830,
                839
            ],
            [
                840,
                863
            ],
            [
                866,
                878
            ],
            [
                879,
                886
            ],
            [
                889,
                891
            ],
            [
                898,
                908
            ],
            [
                919,
                944
            ],
            [
                950,
                1010
            ],
            [
                1015,
                1017
            ],
            [
                1025,
                1043
            ],
            [
                1052,
                1092
            ],
            [
                1095,
                1114
            ],
            [
                1114,
                1198
            ],
            [
                1202,
                1209
            ]
        ],
        "row_chars": [
            [
                0,
                266
            ],
            [
                266,
                626
            ],
            [
                626,
                809
            ],
            [
                809,
                1011
            ],
            [
                1011,
                1114
            ],
            [
                1114,
                1209
            ]
        ]
    }
}