{
    "original": {
        "text": "----What can they be doing, brother? said my father. --I think, replied my uncle _Toby_, --taking, as I told you, his pipe from his mouth, and striking the ashes out of it as he began his sentence; ----I think, replied he, --it would not be amiss, brother, if we rung the bell.\nPray, what's all that racket over our heads, _Obadiah?_ ----quoth my father; ----my brother and I can scarce hear ourselves speak.\nSir, answered _Obadiah_, making a bow towards his left shoulder, --my Mistress is taken very badly. --And where's _Susannah_ running down the garden there, as if they were going to ravish her? ----Sir, she is running the shortest cut into the town, replied _Obadiah_, to fetch the old midwife. --Then saddle a horse, quoth my father, and do you go directly for Dr. _Slop_, the man-midwife, with all our services, ----and let him know your mistress is fallen into labour----and that I desire he will return with you with all speed.\nIt is very strange, says my father, addressing himself to my uncle _Toby_, as _Obadiah_ shut the door, ----as there is so expert an operator as Dr. _Slop_ so near, --that my wife should persist to the very last in this obstinate humour of hers, in trusting the life of my child, who has had one misfortune already, to the ignorance of an old woman; ----and not only the life of my child, brother, ----but her own life, and with it the lives of all the children I might, peradventure, have begot out of her hereafter.\nMayhap, brother, replied my uncle _Toby_, my sister does it to save the expense: --A pudding's end, --replied my father, ----the Doctor must be paid the same for inaction as action, ----if not better, --to keep him in temper.\n----Then it can be out of nothing in the whole world, quoth my uncle _Toby_, in the simplicity of his heart, --but MODESTY. --My sister, I dare say, added he, does not care to let a man come so near her ****. I will not say whether my uncle _Toby_ had completed the sentence or not; ----'tis for his advantage to suppose he had, ----as, I think, he could have added no ONE WORD which would have improved it.\nIf, on the contrary, my uncle _Toby_ had not fully arrived at the period's end, --then the world stands indebted to the sudden snapping of my father's tobacco-pipe for one of the neatest examples of that ornamental figure in oratory, which Rhetoricians stile the _Aposiopesis_. ----Just Heaven! how does the _Poco piu_ and the _Poco meno_ of the _Italian_ artists; --the insensible MORE OR LESS, determine the precise line of beauty in the sentence, as well as in the statute! How do the slight touches of the chisel, the pencil, the pen, the fiddle-stick, _et ctera_, --give the true swell, which gives the true pleasure! --O my countrymen; --be nice; --be cautious of your language; --and never, O! never let it be forgotten upon what small particles your eloquence and your fame depend.\n----\"My sister, mayhap,\" quoth my uncle _Toby_, \"does not choose to let a man come so near her ****.\" Make this dash, --'tis an Aposiopesis. --Take the dash away, and write _Backside_, ----'tis Bawdy. --Scratch Backside out, and put _Cover'd way_ in, 'tis a Metaphor; --and, I dare say, as fortification ran so much in my uncle _Toby's_ head, that if he had been left to have added one word to the sentence, ----that word was it.\nBut whether that was the case or not the case; --or whether the snapping of my father's tobacco-pipe, so critically, happened through accident or anger, will be seen in due time.",
        "paragraph_chars": [
            [
                0,
                278
            ],
            [
                278,
                409
            ],
            [
                409,
                940
            ],
            [
                940,
                1457
            ],
            [
                1457,
                1683
            ],
            [
                1683,
                2091
            ],
            [
                2091,
                2881
            ],
            [
                2881,
                3311
            ],
            [
                3311,
                3489
            ]
        ],
        "segment_chars": [
            [
                0,
                37
            ],
            [
                37,
                53
            ],
            [
                53,
                278
            ],
            [
                278,
                409
            ],
            [
                409,
                509
            ],
            [
                509,
                602
            ],
            [
                602,
                703
            ],
            [
                703,
                940
            ],
            [
                940,
                1457
            ],
            [
                1457,
                1683
            ],
            [
                1683,
                1807
            ],
            [
                1807,
                1892
            ],
            [
                1892,
                2091
            ],
            [
                2091,
                2369
            ],
            [
                2369,
                2386
            ],
            [
                2386,
                2568
            ],
            [
                2568,
                2714
            ],
            [
                2714,
                2792
            ],
            [
                2792,
                2881
            ],
            [
                2881,
                2983
            ],
            [
                2983,
                3022
            ],
            [
                3022,
                3082
            ],
            [
                3082,
                3311
            ],
            [
                3311,
                3489
            ]
        ],
        "overlap_chars": [
            [
                4,
                35
            ],
            [
                37,
                52
            ],
            [
                55,
                62
            ],
            [
                64,
                80
            ],
            [
                62,
                63
            ],
            [
                91,
                171
            ],
            [
                196,
                197
            ],
            [
                202,
                209
            ],
            [
                225,
                276
            ],
            [
                278,
                322
            ],
            [
                324,
                331
            ],
            [
                338,
                353
            ],
            [
                407,
                409
            ],
            [
                410,
                412
            ],
            [
                414,
                422
            ],
            [
                424,
                431
            ],
            [
                441,
                446
            ],
            [
                412,
                413
            ],
            [
                476,
                507
            ],
            [
                511,
                522
            ],
            [
                527,
                532
            ],
            [
                534,
                541
            ],
            [
                587,
                589
            ],
            [
                542,
                557
            ],
            [
                607,
                625
            ],
            [
                643,
                656
            ],
            [
                658,
                665
            ],
            [
                667,
                674
            ],
            [
                656,
                657
            ],
            [
                677,
                701
            ],
            [
                710,
                724
            ],
            [
                726,
                742
            ],
            [
                743,
                746
            ],
            [
                754,
                773
            ],
            [
                775,
                779
            ],
            [
                780,
                798
            ],
            [
                826,
                878
            ],
            [
                882,
                899
            ],
            [
                908,
                923
            ],
            [
                933,
                938
            ],
            [
                940,
                958
            ],
            [
                965,
                974
            ],
            [
                995,
                1006
            ],
            [
                1134,
                1136
            ],
            [
                1013,
                1017
            ],
            [
                1019,
                1026
            ],
            [
                1028,
                1042
            ],
            [
                1050,
                1058
            ],
            [
                1069,
                1071
            ],
            [
                1062,
                1068
            ],
            [
                1081,
                1087
            ],
            [
                1089,
                1093
            ],
            [
                1095,
                1103
            ],
            [
                1106,
                1133
            ],
            [
                1059,
                1061
            ],
            [
                1159,
                1163
            ],
            [
                1185,
                1217
            ],
            [
                1255,
                1288
            ],
            [
                1293,
                1327
            ],
            [
                1341,
                1408
            ],
            [
                1424,
                1428
            ],
            [
                1151,
                1153
            ],
            [
                1137,
                1140
            ],
            [
                1460,
                1472
            ],
            [
                1474,
                1490
            ],
            [
                1472,
                1473
            ],
            [
                1509,
                1536
            ],
            [
                1540,
                1555
            ],
            [
                1567,
                1576
            ],
            [
                1582,
                1638
            ],
            [
                1643,
                1649
            ],
            [
                1497,
                1498
            ],
            [
                1660,
                1671
            ],
            [
                1692,
                1698
            ],
            [
                1699,
                1708
            ],
            [
                1798,
                1805
            ],
            [
                1737,
                1751
            ],
            [
                1758,
                1790
            ],
            [
                1805,
                1807
            ],
            [
                1820,
                1830
            ],
            [
                1842,
                1890
            ],
            [
                1892,
                1923
            ],
            [
                1993,
                1995
            ],
            [
                1931,
                1965
            ],
            [
                2091,
                2093
            ],
            [
                2004,
                2006
            ],
            [
                2128,
                2152
            ],
            [
                2166,
                2170
            ],
            [
                2173,
                2324
            ],
            [
                2098,
                2101
            ],
            [
                2359,
                2366
            ],
            [
                2089,
                2090
            ],
            [
                2568,
                2571
            ],
            [
                2575,
                2647
            ],
            [
                2649,
                2653
            ],
            [
                2658,
                2659
            ],
            [
                2662,
                2666
            ],
            [
                2699,
                2714
            ],
            [
                2716,
                2731
            ],
            [
                2746,
                2775
            ],
            [
                2778,
                2792
            ],
            [
                2792,
                2797
            ],
            [
                2818,
                2881
            ],
            [
                2889,
                2903
            ],
            [
                2906,
                2920
            ],
            [
                2927,
                2928
            ],
            [
                2930,
                2980
            ],
            [
                2983,
                2992
            ],
            [
                2997,
                2998
            ],
            [
                3001,
                3022
            ],
            [
                3024,
                3028
            ],
            [
                3038,
                3053
            ],
            [
                3055,
                3063
            ],
            [
                3070,
                3082
            ],
            [
                3092,
                3100
            ],
            [
                3101,
                3113
            ],
            [
                3123,
                3126
            ],
            [
                3128,
                3148
            ],
            [
                3151,
                3208
            ],
            [
                3249,
                3251
            ],
            [
                3214,
                3216
            ],
            [
                3218,
                3228
            ],
            [
                3298,
                3306
            ],
            [
                3275,
                3278
            ],
            [
                3263,
                3266
            ],
            [
                3232,
                3234
            ],
            [
                3252,
                3262
            ],
            [
                3309,
                3311
            ],
            [
                3311,
                3343
            ],
            [
                3356,
                3357
            ],
            [
                3360,
                3411
            ],
            [
                3428,
                3489
            ]
        ],
        "row_chars": [
            [
                0,
                37
            ],
            [
                37,
                53
            ],
            [
                53,
                278
            ],
            [
                278,
                409
            ],
            [
                409,
                509
            ],
            [
                509,
                602
            ],
            [
                602,
                703
            ],
            [
                703,
                940
            ],
            [
                940,
                1457
            ],
            [
                1457,
                1683
            ],
            [
                1683,
                1807
            ],
            [
                1807,
                1892
            ],
            [
                1892,
                2369
            ],
            [
                2369,
                2386
            ],
            [
                2386,
                2568
            ],
            [
                2568,
                2714
            ],
            [
                2714,
                2792
            ],
            [
                2792,
                2881
            ],
            [
                2881,
                2983
            ],
            [
                2983,
                3022
            ],
            [
                3022,
                3082
            ],
            [
                3082,
                3311
            ],
            [
                3311,
                3489
            ]
        ]
    },
    "abridged": {
        "text": "'What can they be doing, brother?' said my father.\n'I think,' replied my uncle Toby, taking, as I told you, his pipe from his mouth, and striking the ashes out of it; - 'I think it would not be amiss, brother, if we rung the bell.'\n'Pray, what's all that racket over our heads, Obadiah?' quoth my father.\n'Sir,' answered Obadiah with a bow, 'my Mistress is taken very badly.'\n'And where's Susannah running to down the garden?'\n'Sir, she is running into the town,' replied Obadiah, 'to fetch the old midwife.'\n'Then saddle a horse,' quoth my father, 'and go directly for Dr. Slop, the man-midwife, and let him know your mistress is fallen into labour - and that I desire him to return with you speedily.'\n'It is very strange,' said my father to my uncle Toby, as Obadiah shut the door, - 'when there is an expert such as Dr. Slop so near, that my wife should persist so obstinately in trusting the life of my child to the ignorance of an old woman; - and not only the life of my child, but her own life, and with it the lives of all the children I might have in the future.'\n'Mayhap, brother,' replied my uncle Toby, 'she does it to save the expense.'\n'A pudding's end!' replied my father; 'the Doctor must be paid the same for inaction as action, - if not more, to keep him happy.'\n'Then it can only be out of Modesty,' quoth my uncle Toby, in the simplicity of his heart. 'I dare say she does not care to let a man come so near her ****.'\nI will not say whether my uncle Toby had completed the sentence or not; but if he had not fully arrived at its end, - then the world stands indebted to the sudden snapping of my father's tobacco-pipe for one of the neatest examples of that ornamental figure in oratory, the Aposiopesis. How the slight touches of the chisel, the pencil, the pen, the fiddle-stick, et cetera, give true pleasure! - O my countrymen - be cautious of your language; and never, O! never forget upon what small particles your eloquence and your fame depend.\n'My sister, mayhap,' quoth my uncle Toby, 'does not choose to let a man come so near her ****.' Make this row of stars, and 'tis an Aposiopesis. Take it away, and write 'Backside'; 'tis Bawdy. - Scratch 'Backside' out, and put 'Covered way' in, 'tis a Metaphor; - and, I dare say, as fortification ran so much in my uncle Toby's head, that word was the one he would have added.\nBut whether that was the case or no; - or whether the snapping of my father's tobacco-pipe happened through accident or anger, will be seen in due time.",
        "paragraph_chars": [
            [
                0,
                51
            ],
            [
                51,
                232
            ],
            [
                232,
                305
            ],
            [
                305,
                376
            ],
            [
                376,
                427
            ],
            [
                427,
                509
            ],
            [
                509,
                704
            ],
            [
                704,
                1074
            ],
            [
                1074,
                1151
            ],
            [
                1151,
                1282
            ],
            [
                1282,
                1440
            ],
            [
                1440,
                1975
            ],
            [
                1975,
                2353
            ],
            [
                2353,
                2505
            ]
        ],
        "segment_chars": [
            [
                0,
                35
            ],
            [
                35,
                51
            ],
            [
                51,
                232
            ],
            [
                232,
                288
            ],
            [
                288,
                305
            ],
            [
                305,
                376
            ],
            [
                376,
                427
            ],
            [
                427,
                509
            ],
            [
                509,
                704
            ],
            [
                704,
                1074
            ],
            [
                1074,
                1151
            ],
            [
                1151,
                1170
            ],
            [
                1170,
                1282
            ],
            [
                1282,
                1373
            ],
            [
                1373,
                1440
            ],
            [
                1440,
                1727
            ],
            [
                1727,
                1835
            ],
            [
                1835,
                1899
            ],
            [
                1899,
                1975
            ],
            [
                1975,
                2071
            ],
            [
                2071,
                2120
            ],
            [
                2120,
                2168
            ],
            [
                2168,
                2353
            ],
            [
                2353,
                2505
            ]
        ],
        "overlap_chars": [
            [
                1,
                32
            ],
            [
                35,
                50
            ],
            [
                52,
                59
            ],
            [
                62,
                78
            ],
            [
                83,
                84
            ],
            [
                85,
                165
            ],
            [
                165,
                166
            ],
            [
                170,
                177
            ],
            [
                178,
                229
            ],
            [
                233,
                277
            ],
            [
                278,
                285
            ],
            [
                288,
                303
            ],
            [
                303,
                305
            ],
            [
                307,
                309
            ],
            [
                312,
                320
            ],
            [
                321,
                328
            ],
            [
                334,
                339
            ],
            [
                339,
                340
            ],
            [
                342,
                373
            ],
            [
                377,
                388
            ],
            [
                392,
                397
            ],
            [
                398,
                405
            ],
            [
                406,
                408
            ],
            [
                409,
                424
            ],
            [
                429,
                447
            ],
            [
                448,
                461
            ],
            [
                464,
                471
            ],
            [
                472,
                479
            ],
            [
                479,
                480
            ],
            [
                482,
                506
            ],
            [
                515,
                529
            ],
            [
                532,
                548
            ],
            [
                550,
                553
            ],
            [
                554,
                573
            ],
            [
                574,
                578
            ],
            [
                578,
                596
            ],
            [
                597,
                649
            ],
            [
                652,
                669
            ],
            [
                677,
                692
            ],
            [
                693,
                698
            ],
            [
                705,
                723
            ],
            [
                731,
                740
            ],
            [
                741,
                752
            ],
            [
                753,
                755
            ],
            [
                757,
                761
            ],
            [
                762,
                769
            ],
            [
                770,
                784
            ],
            [
                793,
                801
            ],
            [
                802,
                804
            ],
            [
                805,
                811
            ],
            [
                817,
                823
            ],
            [
                824,
                828
            ],
            [
                829,
                837
            ],
            [
                838,
                865
            ],
            [
                866,
                868
            ],
            [
                869,
                873
            ],
            [
                881,
                913
            ],
            [
                914,
                947
            ],
            [
                950,
                984
            ],
            [
                985,
                1052
            ],
            [
                1053,
                1057
            ],
            [
                1058,
                1060
            ],
            [
                1061,
                1064
            ],
            [
                1078,
                1090
            ],
            [
                1093,
                1109
            ],
            [
                1114,
                1115
            ],
            [
                1121,
                1148
            ],
            [
                1152,
                1167
            ],
            [
                1178,
                1187
            ],
            [
                1190,
                1246
            ],
            [
                1249,
                1255
            ],
            [
                1260,
                1261
            ],
            [
                1262,
                1273
            ],
            [
                1288,
                1294
            ],
            [
                1300,
                1309
            ],
            [
                1310,
                1317
            ],
            [
                1320,
                1334
            ],
            [
                1339,
                1371
            ],
            [
                1371,
                1373
            ],
            [
                1374,
                1384
            ],
            [
                1389,
                1437
            ],
            [
                1440,
                1471
            ],
            [
                1472,
                1474
            ],
            [
                1477,
                1511
            ],
            [
                1516,
                1518
            ],
            [
                1519,
                1521
            ],
            [
                1522,
                1546
            ],
            [
                1551,
                1555
            ],
            [
                1558,
                1709
            ],
            [
                1710,
                1713
            ],
            [
                1718,
                1725
            ],
            [
                1725,
                1726
            ],
            [
                1727,
                1730
            ],
            [
                1731,
                1803
            ],
            [
                1804,
                1808
            ],
            [
                1813,
                1814
            ],
            [
                1815,
                1819
            ],
            [
                1820,
                1835
            ],
            [
                1837,
                1852
            ],
            [
                1855,
                1884
            ],
            [
                1885,
                1899
            ],
            [
                1899,
                1904
            ],
            [
                1912,
                1975
            ],
            [
                1979,
                1993
            ],
            [
                1996,
                2010
            ],
            [
                2015,
                2016
            ],
            [
                2018,
                2068
            ],
            [
                2071,
                2080
            ],
            [
                2093,
                2094
            ],
            [
                2099,
                2120
            ],
            [
                2120,
                2124
            ],
            [
                2128,
                2143
            ],
            [
                2145,
                2153
            ],
            [
                2156,
                2168
            ],
            [
                2179,
                2187
            ],
            [
                2189,
                2201
            ],
            [
                2211,
                2214
            ],
            [
                2216,
                2236
            ],
            [
                2239,
                2296
            ],
            [
                2297,
                2299
            ],
            [
                2301,
                2303
            ],
            [
                2304,
                2314
            ],
            [
                2315,
                2323
            ],
            [
                2324,
                2327
            ],
            [
                2328,
                2331
            ],
            [
                2332,
                2334
            ],
            [
                2341,
                2351
            ],
            [
                2351,
                2353
            ],
            [
                2353,
                2385
            ],
            [
                2388,
                2389
            ],
            [
                2392,
                2443
            ],
            [
                2444,
                2505
            ]
        ],
        "row_chars": [
            [
                0,
                35
            ],
            [
                35,
                51
            ],
            [
                51,
                232
            ],
            [
                232,
                305
            ],
            [
                305,
                376
            ],
            [
                376,
                427
            ],
            [
                427,
                509
            ],
            [
                509,
                704
            ],
            [
                704,
                1074
            ],
            [
                1074,
                1282
            ],
            [
                1282,
                1373
            ],
            [
                1373,
                1440
            ],
            [
                1440,
                1727
            ],
            [
                1727,
                1727
            ],
            [
                1727,
                1727
            ],
            [
                1727,
                1835
            ],
            [
                1835,
                1899
            ],
            [
                1899,
                1975
            ],
            [
                1975,
                2071
            ],
            [
                2071,
                2120
            ],
            [
                2120,
                2168
            ],
            [
                2168,
                2353
            ],
            [
                2353,
                2505
            ]
        ]
    }
}