{
    "original": {
        "text": "My uncle _Toby_ and the corporal had gone on separately with their operations the greatest part of the campaign, and as effectually cut off from all communication of what either the one or the other had been doing, as if they had been separated from each other by the _Maes_ or the _Sambre_.\nMy uncle _Toby_, on his side, had presented himself every afternoon in his red and silver, and blue and gold alternately, and sustained an infinity of attacks in them, without knowing them to be attacks--and so had nothing to communicate----\nThe corporal, on his side, in taking _Bridget_, by it had gain'd considerable advantages----and consequently had much to communicate----but what were the advantages----as well as what was the manner by which he had seiz'd them, required so nice an historian, that the corporal durst not venture upon it; and as sensible as he was of glory, would rather have been contented to have gone bareheaded and without laurels for ever, than torture his master's modesty for a single moment----\n----Best of honest and gallant servants! ----But I have apostrophiz'd thee, _Trim!_ once before----and could I apotheosize thee also (that is to say) with good company ----I would do it _without ceremony_ in the very next page.",
        "paragraph_chars": [
            [
                0,
                292
            ],
            [
                292,
                534
            ],
            [
                534,
                1019
            ],
            [
                1019,
                1246
            ]
        ],
        "segment_chars": [
            [
                0,
                292
            ],
            [
                292,
                534
            ],
            [
                534,
                1019
            ],
            [
                1019,
                1060
            ],
            [
                1060,
                1246
            ]
        ],
        "overlap_chars": [
            [
                0,
                8
            ],
            [
                16,
                77
            ],
            [
                96,
                116
            ],
            [
                199,
                202
            ],
            [
                132,
                139
            ],
            [
                145,
                162
            ],
            [
                245,
                260
            ],
            [
                117,
                119
            ],
            [
                215,
                244
            ],
            [
                261,
                267
            ],
            [
                269,
                273
            ],
            [
                186,
                192
            ],
            [
                283,
                289
            ],
            [
                292,
                300
            ],
            [
                307,
                494
            ],
            [
                496,
                529
            ],
            [
                534,
                570
            ],
            [
                580,
                581
            ],
            [
                588,
                591
            ],
            [
                599,
                622
            ],
            [
                626,
                666
            ],
            [
                670,
                673
            ],
            [
                684,
                698
            ],
            [
                791,
                792
            ],
            [
                838,
                841
            ],
            [
                722,
                748
            ],
            [
                756,
                773
            ],
            [
                793,
                810
            ],
            [
                817,
                820
            ],
            [
                585,
                587
            ],
            [
                864,
                873
            ],
            [
                857,
                859
            ],
            [
                874,
                891
            ],
            [
                915,
                919
            ],
            [
                935,
                1014
            ],
            [
                1023,
                1060
            ],
            [
                1122,
                1129
            ],
            [
                1089,
                1093
            ],
            [
                1093,
                1094
            ],
            [
                1191,
                1204
            ],
            [
                1224,
                1246
            ]
        ],
        "row_chars": [
            [
                0,
                292
            ],
            [
                292,
                534
            ],
            [
                534,
                1019
            ],
            [
                1019,
                1060
            ],
            [
                1060,
                1246
            ]
        ]
    },
    "abridged": {
        "text": "My uncle Toby and the corporal had gone on separately with their operations for most of the campaign, and had cut off all communication from each other as effectively as if they had been separated by the Maes or the Sambre.\nMy uncle Toby, on his side, had presented himself every afternoon in his red and silver, and blue and gold alternately, and sustained an infinity of attacks in them, without knowing them to be attacks - and so had nothing to communicate-\nThe corporal, on his side, in taking Bridget, had gained considerable advantages - and consequently had much to communicate - but the nature of the advantages, and the manner by which he had seized them, required so careful a telling that the corporal dared not try it. Though aware of glory, he would rather have gone without laurels for ever, than torture his master's modesty for a single moment-\nBest of honest and gallant servants! Could I raise thee amongst the gods, Trim - I would do it in the very next page.",
        "paragraph_chars": [
            [
                0,
                224
            ],
            [
                224,
                462
            ],
            [
                462,
                862
            ],
            [
                862,
                979
            ]
        ],
        "segment_chars": [
            [
                0,
                224
            ],
            [
                224,
                462
            ],
            [
                462,
                732
            ],
            [
                732,
                862
            ],
            [
                862,
                899
            ],
            [
                899,
                979
            ]
        ],
        "overlap_chars": [
            [
                0,
                8
            ],
            [
                14,
                75
            ],
            [
                85,
                105
            ],
            [
                106,
                109
            ],
            [
                110,
                117
            ],
            [
                118,
                135
            ],
            [
                136,
                151
            ],
            [
                152,
                154
            ],
            [
                167,
                196
            ],
            [
                197,
                203
            ],
            [
                204,
                208
            ],
            [
                209,
                215
            ],
            [
                216,
                222
            ],
            [
                224,
                232
            ],
            [
                237,
                424
            ],
            [
                427,
                460
            ],
            [
                462,
                498
            ],
            [
                506,
                507
            ],
            [
                508,
                511
            ],
            [
                519,
                542
            ],
            [
                545,
                585
            ],
            [
                588,
                591
            ],
            [
                606,
                620
            ],
            [
                620,
                621
            ],
            [
                622,
                625
            ],
            [
                626,
                652
            ],
            [
                660,
                677
            ],
            [
                696,
                713
            ],
            [
                720,
                723
            ],
            [
                728,
                730
            ],
            [
                745,
                754
            ],
            [
                755,
                757
            ],
            [
                758,
                775
            ],
            [
                776,
                780
            ],
            [
                781,
                860
            ],
            [
                862,
                899
            ],
            [
                899,
                906
            ],
            [
                913,
                917
            ],
            [
                934,
                935
            ],
            [
                943,
                956
            ],
            [
                957,
                979
            ]
        ],
        "row_chars": [
            [
                0,
                224
            ],
            [
                224,
                462
            ],
            [
                462,
                862
            ],
            [
                862,
                899
            ],
            [
                899,
                979
            ]
        ]
    }
}