{
    "original": {
        "text": "Now my uncle _Toby_ had one evening laid down his pipe upon the table, and was counting over to himself upon his finger ends (beginning at his thumb) all Mrs. _Wadman's_ perfections one by one; and happening two or three times together, either by omitting some, or counting others twice over, to puzzle himself sadly before he could get beyond his middle finger ----Prithee, _Trim!_ said he, taking up his pipe again, ----bring me a pen and ink: _Trim_ brought paper also.\nTake a full sheet----_Trim!_ said my uncle _Toby_, making a sign with his pipe at the same time to take a chair and sit down close by him at the table. The corporal obeyed----placed the paper directly before him----took a pen, and dipp'd it in the ink.\n--She has a thousand virtues, _Trim!_ said my uncle _Toby_----\nAm I to set them down, an' please your honour? quoth the corporal.\n----But they must be taken in their ranks, replied my uncle _Toby_; for of them all, _Trim_, that which wins me most, and which is a security for all the rest, is the compassionate turn and singular humanity of her character --I protest, added my uncle _Toby_, looking up, as he protested it, towards the top of the ceiling ----That was I her brother, _Trim_, a thousand fold, she could not make more constant or more tender enquiries after my sufferings----though now no more.\nThe corporal made no reply to my uncle _Toby's_ protestation, but by a short cough--he dipp'd the pen a second time into the inkhorn; and my uncle _Toby_, pointing with the end of his pipe as close to the top of the sheet at the left hand corner of it, as he could get it----the corporal wrote down the word HUMANITY - - - - thus.\nPrithee, corporal, said my uncle _Toby_, as soon as _Trim_ had done it------how often does Mrs. _Bridget_ enquire after the wound on the cap of thy knee, which thou received'st at the battle of _Landen?_\nShe never, an' please your honour, enquires after it at all.\nThat, corporal, said my uncle _Toby_, with all the triumph the goodness of his nature would permit ----That shews the difference in the character of the mistress and maid----had the fortune of war allotted the same mischance to me, Mrs. _Wadman_ would have enquired into every circumstance relating to it a hundred times ----She would have enquired, an' please your honour, ten times as often about your honour's groin ----The pain, _Trim_, is equally excruciating, ----and Compassion has as much to do with the one as the other----\n----God bless your honour! cried the corporal----what has a woman's compassion to do with a wound upon the cap of a man's knee? had your honour's been shot into ten thousand splinters at the affair of _Landen_, Mrs. _Wadman_ would have troubled her head as little about it as _Bridget_; because, added the corporal, lowering his voice, and speaking very distinctly, as he assigned his reason----\n\"The knee is such a distance from the main body----whereas the groin, your honour knows, is upon the very _curtain_ of the _place_.\"\nMy uncle _Toby_ gave a long whistle----but in a note which could scarce be heard across the table.\nThe corporal had advanced too far to retire----in three words he told the rest----\nMy uncle _Toby_ laid down his pipe as gently upon the fender, as if it had been spun from the unravellings of a spider's web----\n------Let us go to my brother _Shandy's_, said he.",
        "paragraph_chars": [
            [
                0,
                473
            ],
            [
                473,
                726
            ],
            [
                726,
                789
            ],
            [
                789,
                856
            ],
            [
                856,
                1334
            ],
            [
                1334,
                1665
            ],
            [
                1665,
                1869
            ],
            [
                1869,
                1930
            ],
            [
                1930,
                2463
            ],
            [
                2463,
                2859
            ],
            [
                2859,
                2992
            ],
            [
                2992,
                3091
            ],
            [
                3091,
                3174
            ],
            [
                3174,
                3303
            ],
            [
                3303,
                3353
            ]
        ],
        "segment_chars": [
            [
                0,
                473
            ],
            [
                473,
                625
            ],
            [
                625,
                726
            ],
            [
                726,
                789
            ],
            [
                789,
                836
            ],
            [
                836,
                856
            ],
            [
                856,
                1334
            ],
            [
                1334,
                1665
            ],
            [
                1665,
                1869
            ],
            [
                1869,
                1930
            ],
            [
                1930,
                2463
            ],
            [
                2463,
                2490
            ],
            [
                2490,
                2591
            ],
            [
                2591,
                2859
            ],
            [
                2859,
                2992
            ],
            [
                2992,
                3091
            ],
            [
                3091,
                3174
            ],
            [
                3174,
                3303
            ],
            [
                3303,
                3353
            ]
        ],
        "overlap_chars": [
            [
                0,
                12
            ],
            [
                293,
                295
            ],
            [
                20,
                112
            ],
            [
                150,
                158
            ],
            [
                160,
                168
            ],
            [
                170,
                197
            ],
            [
                237,
                292
            ],
            [
                303,
                361
            ],
            [
                235,
                236
            ],
            [
                366,
                374
            ],
            [
                383,
                417
            ],
            [
                422,
                444
            ],
            [
                453,
                473
            ],
            [
                478,
                490
            ],
            [
                502,
                515
            ],
            [
                569,
                571
            ],
            [
                604,
                606
            ],
            [
                522,
                551
            ],
            [
                589,
                597
            ],
            [
                611,
                625
            ],
            [
                625,
                644
            ],
            [
                648,
                664
            ],
            [
                674,
                684
            ],
            [
                695,
                698
            ],
            [
                714,
                716
            ],
            [
                721,
                726
            ],
            [
                732,
                755
            ],
            [
                764,
                777
            ],
            [
                814,
                815
            ],
            [
                789,
                811
            ],
            [
                823,
                834
            ],
            [
                836,
                856
            ],
            [
                860,
                897
            ],
            [
                899,
                915
            ],
            [
                922,
                923
            ],
            [
                924,
                940
            ],
            [
                947,
                972
            ],
            [
                1016,
                1080
            ],
            [
                1083,
                1092
            ],
            [
                1094,
                1108
            ],
            [
                1115,
                1128
            ],
            [
                1184,
                1188
            ],
            [
                1193,
                1207
            ],
            [
                1231,
                1310
            ],
            [
                1334,
                1363
            ],
            [
                1394,
                1399
            ],
            [
                1403,
                1404
            ],
            [
                1411,
                1416
            ],
            [
                1418,
                1420
            ],
            [
                1428,
                1449
            ],
            [
                1466,
                1471
            ],
            [
                1364,
                1372
            ],
            [
                1400,
                1402
            ],
            [
                1498,
                1522
            ],
            [
                1532,
                1555
            ],
            [
                1487,
                1488
            ],
            [
                1609,
                1656
            ],
            [
                1659,
                1665
            ],
            [
                1665,
                1682
            ],
            [
                1684,
                1697
            ],
            [
                1682,
                1683
            ],
            [
                1741,
                1760
            ],
            [
                1771,
                1797
            ],
            [
                1809,
                1812
            ],
            [
                1817,
                1858
            ],
            [
                1860,
                1866
            ],
            [
                1873,
                1878
            ],
            [
                1904,
                1928
            ],
            [
                1934,
                1944
            ],
            [
                1946,
                1959
            ],
            [
                2155,
                2157
            ],
            [
                1966,
                1988
            ],
            [
                2005,
                2008
            ],
            [
                1993,
                2001
            ],
            [
                2016,
                2028
            ],
            [
                1944,
                1945
            ],
            [
                2282,
                2283
            ],
            [
                1930,
                1934
            ],
            [
                2044,
                2095
            ],
            [
                1989,
                1992
            ],
            [
                2096,
                2100
            ],
            [
                2104,
                2111
            ],
            [
                2140,
                2144
            ],
            [
                2160,
                2166
            ],
            [
                2168,
                2174
            ],
            [
                2176,
                2250
            ],
            [
                2259,
                2279
            ],
            [
                2291,
                2348
            ],
            [
                2357,
                2362
            ],
            [
                2369,
                2395
            ],
            [
                2400,
                2414
            ],
            [
                2419,
                2426
            ],
            [
                2438,
                2458
            ],
            [
                2467,
                2488
            ],
            [
                2490,
                2508
            ],
            [
                2512,
                2565
            ],
            [
                2577,
                2584
            ],
            [
                2589,
                2591
            ],
            [
                2591,
                2608
            ],
            [
                2609,
                2646
            ],
            [
                2672,
                2678
            ],
            [
                2680,
                2686
            ],
            [
                2688,
                2738
            ],
            [
                2748,
                2757
            ],
            [
                2759,
                2834
            ],
            [
                2844,
                2854
            ],
            [
                2864,
                2871
            ],
            [
                2877,
                2906
            ],
            [
                2918,
                2964
            ],
            [
                2966,
                2969
            ],
            [
                2975,
                2981
            ],
            [
                2983,
                2988
            ],
            [
                2992,
                3000
            ],
            [
                3008,
                3019
            ],
            [
                3020,
                3027
            ],
            [
                3089,
                3091
            ],
            [
                3091,
                3134
            ],
            [
                3153,
                3169
            ],
            [
                3174,
                3182
            ],
            [
                3190,
                3234
            ],
            [
                3236,
                3244
            ],
            [
                3284,
                3298
            ],
            [
                3309,
                3332
            ],
            [
                3334,
                3342
            ],
            [
                3345,
                3353
            ]
        ],
        "row_chars": [
            [
                0,
                473
            ],
            [
                473,
                625
            ],
            [
                625,
                726
            ],
            [
                726,
                789
            ],
            [
                789,
                836
            ],
            [
                836,
                856
            ],
            [
                856,
                1334
            ],
            [
                1334,
                1665
            ],
            [
                1665,
                1869
            ],
            [
                1869,
                1930
            ],
            [
                1930,
                2463
            ],
            [
                2463,
                2490
            ],
            [
                2490,
                2591
            ],
            [
                2591,
                2859
            ],
            [
                2859,
                2992
            ],
            [
                2992,
                3091
            ],
            [
                3091,
                3174
            ],
            [
                3174,
                3303
            ],
            [
                3303,
                3353
            ]
        ]
    },
    "abridged": {
        "text": "Now my uncle Toby had one evening laid down his pipe upon the table, and was counting over to himself upon his fingers all Mrs. Wadman's perfections one by one; and either by omitting some, or counting others twice over, was puzzling himself sadly before he could get beyond his middle finger,\n'Prithee, Trim!' said he, taking up his pipe again, 'bring me a pen and ink.' Trim brought paper also.\n'Take a full sheet, Trim!' said my uncle Toby, making a sign with his pipe to sit down at the table. The corporal obeyed - placed the paper before him - dipped pen in ink.\n'She has a thousand virtues, Trim!' said my uncle Toby.\n'Am I to set them down, your honour?' quoth the corporal.\n'But they must be taken in their ranks,' replied my uncle Toby; 'for of them all, Trim, that which wins me most is the compassionate turn and singular humanity of her character - I protest,' added my uncle Toby, looking up, 'that were I her brother, Trim, she could not make more constant or more tender enquiries after my sufferings.'\nThe corporal made no reply to this, but a cough. He dipped the pen a second time; and when my uncle Toby pointed with the end of his pipe to the top of the sheet, the corporal wrote down the word Humanity - - - thus.\n'Prithee, corporal,' said my uncle, 'how often does Mrs. Bridget enquire after the wound on thy kneecap, which thou received'st at the battle of Landen?'\n'She never enquires after it at all.'\n'That, corporal,' said my uncle Toby, with all the triumph his goodness would permit, - 'That shows the difference in the character of the mistress and the maid. If I had the same wound, Mrs. Wadman would have enquired into every circumstance relating to it a hundred times.'\n'She would have enquired, your honour, ten times as often about your honour's groin.'\n'The pain, Trim, is equally excruciating, and Compassion cares as much about the one as the other-'\n'God bless your honour!' cried the corporal. 'What has a woman's compassion to do with a wound upon a man's kneecap? had your honour's knee been shot into ten thousand splinters, Mrs. Wadman would have troubled her head as little about it as Bridget; because,' added the corporal, lowering his voice, and speaking very distinctly, as he gave his reason-\n'The knee is a distance from the main body - whereas the groin, your honour knows, is upon the very curtin of the place.'\nMy uncle Toby gave a long, low whistle.\nThe corporal had advanced too far to retire - he told the rest.\nMy uncle Toby laid down his pipe as gently upon the fender as if it were a spider's web.\n- 'Let us go to my brother Shandy's,' said he.",
        "paragraph_chars": [
            [
                0,
                294
            ],
            [
                294,
                397
            ],
            [
                397,
                569
            ],
            [
                569,
                625
            ],
            [
                625,
                683
            ],
            [
                683,
                1019
            ],
            [
                1019,
                1236
            ],
            [
                1236,
                1390
            ],
            [
                1390,
                1428
            ],
            [
                1428,
                1704
            ],
            [
                1704,
                1790
            ],
            [
                1790,
                1890
            ],
            [
                1890,
                2244
            ],
            [
                2244,
                2366
            ],
            [
                2366,
                2406
            ],
            [
                2406,
                2470
            ],
            [
                2470,
                2559
            ],
            [
                2559,
                2605
            ]
        ],
        "segment_chars": [
            [
                0,
                294
            ],
            [
                294,
                311
            ],
            [
                311,
                372
            ],
            [
                372,
                397
            ],
            [
                397,
                424
            ],
            [
                424,
                498
            ],
            [
                498,
                569
            ],
            [
                569,
                605
            ],
            [
                605,
                625
            ],
            [
                625,
                663
            ],
            [
                663,
                683
            ],
            [
                683,
                1019
            ],
            [
                1019,
                1068
            ],
            [
                1068,
                1236
            ],
            [
                1236,
                1390
            ],
            [
                1390,
                1428
            ],
            [
                1428,
                1590
            ],
            [
                1590,
                1704
            ],
            [
                1704,
                1790
            ],
            [
                1790,
                1890
            ],
            [
                1890,
                1915
            ],
            [
                1915,
                1935
            ],
            [
                1935,
                2007
            ],
            [
                2007,
                2244
            ],
            [
                2244,
                2366
            ],
            [
                2366,
                2406
            ],
            [
                2406,
                2470
            ],
            [
                2470,
                2559
            ],
            [
                2559,
                2605
            ]
        ],
        "overlap_chars": [
            [
                0,
                12
            ],
            [
                13,
                15
            ],
            [
                18,
                110
            ],
            [
                119,
                127
            ],
            [
                128,
                136
            ],
            [
                137,
                164
            ],
            [
                165,
                220
            ],
            [
                234,
                292
            ],
            [
                292,
                293
            ],
            [
                295,
                303
            ],
            [
                311,
                345
            ],
            [
                347,
                369
            ],
            [
                377,
                397
            ],
            [
                403,
                415
            ],
            [
                424,
                437
            ],
            [
                438,
                440
            ],
            [
                440,
                442
            ],
            [
                442,
                471
            ],
            [
                475,
                483
            ],
            [
                484,
                498
            ],
            [
                498,
                517
            ],
            [
                520,
                536
            ],
            [
                537,
                547
            ],
            [
                557,
                560
            ],
            [
                561,
                563
            ],
            [
                564,
                569
            ],
            [
                574,
                597
            ],
            [
                605,
                618
            ],
            [
                625,
                626
            ],
            [
                626,
                648
            ],
            [
                649,
                660
            ],
            [
                663,
                683
            ],
            [
                684,
                721
            ],
            [
                724,
                740
            ],
            [
                745,
                746
            ],
            [
                748,
                764
            ],
            [
                769,
                794
            ],
            [
                795,
                859
            ],
            [
                862,
                871
            ],
            [
                874,
                888
            ],
            [
                893,
                906
            ],
            [
                908,
                912
            ],
            [
                918,
                932
            ],
            [
                937,
                1016
            ],
            [
                1019,
                1048
            ],
            [
                1053,
                1058
            ],
            [
                1059,
                1060
            ],
            [
                1061,
                1066
            ],
            [
                1068,
                1070
            ],
            [
                1078,
                1099
            ],
            [
                1099,
                1104
            ],
            [
                1110,
                1118
            ],
            [
                1121,
                1123
            ],
            [
                1132,
                1156
            ],
            [
                1157,
                1180
            ],
            [
                1180,
                1181
            ],
            [
                1182,
                1229
            ],
            [
                1230,
                1236
            ],
            [
                1237,
                1254
            ],
            [
                1257,
                1270
            ],
            [
                1270,
                1271
            ],
            [
                1273,
                1292
            ],
            [
                1301,
                1327
            ],
            [
                1328,
                1331
            ],
            [
                1339,
                1380
            ],
            [
                1381,
                1387
            ],
            [
                1395,
                1400
            ],
            [
                1401,
                1425
            ],
            [
                1433,
                1443
            ],
            [
                1446,
                1459
            ],
            [
                1460,
                1462
            ],
            [
                1464,
                1486
            ],
            [
                1487,
                1490
            ],
            [
                1491,
                1499
            ],
            [
                1500,
                1512
            ],
            [
                1512,
                1513
            ],
            [
                1516,
                1517
            ],
            [
                1517,
                1521
            ],
            [
                1528,
                1579
            ],
            [
                1580,
                1583
            ],
            [
                1584,
                1588
            ],
            [
                1595,
                1602
            ],
            [
                1603,
                1607
            ],
            [
                1613,
                1619
            ],
            [
                1620,
                1626
            ],
            [
                1627,
                1701
            ],
            [
                1709,
                1729
            ],
            [
                1730,
                1787
            ],
            [
                1795,
                1800
            ],
            [
                1805,
                1831
            ],
            [
                1832,
                1846
            ],
            [
                1853,
                1860
            ],
            [
                1867,
                1887
            ],
            [
                1891,
                1912
            ],
            [
                1915,
                1933
            ],
            [
                1936,
                1989
            ],
            [
                1990,
                1997
            ],
            [
                2005,
                2007
            ],
            [
                2007,
                2024
            ],
            [
                2030,
                2067
            ],
            [
                2067,
                2073
            ],
            [
                2074,
                2080
            ],
            [
                2081,
                2131
            ],
            [
                2139,
                2148
            ],
            [
                2151,
                2226
            ],
            [
                2232,
                2242
            ],
            [
                2249,
                2256
            ],
            [
                2257,
                2286
            ],
            [
                2297,
                2343
            ],
            [
                2344,
                2347
            ],
            [
                2351,
                2357
            ],
            [
                2358,
                2363
            ],
            [
                2366,
                2374
            ],
            [
                2380,
                2391
            ],
            [
                2397,
                2404
            ],
            [
                2404,
                2406
            ],
            [
                2406,
                2449
            ],
            [
                2452,
                2468
            ],
            [
                2470,
                2478
            ],
            [
                2484,
                2528
            ],
            [
                2529,
                2537
            ],
            [
                2543,
                2557
            ],
            [
                2562,
                2585
            ],
            [
                2586,
                2594
            ],
            [
                2597,
                2605
            ]
        ],
        "row_chars": [
            [
                0,
                397
            ],
            [
                397,
                498
            ],
            [
                498,
                569
            ],
            [
                569,
                625
            ],
            [
                625,
                663
            ],
            [
                663,
                683
            ],
            [
                683,
                1019
            ],
            [
                1019,
                1236
            ],
            [
                1236,
                1390
            ],
            [
                1390,
                1428
            ],
            [
                1428,
                1890
            ],
            [
                1890,
                1915
            ],
            [
                1915,
                2007
            ],
            [
                2007,
                2244
            ],
            [
                2244,
                2366
            ],
            [
                2366,
                2406
            ],
            [
                2406,
                2470
            ],
            [
                2470,
                2559
            ],
            [
                2559,
                2605
            ]
        ]
    }
}