{
    "original": {
        "text": "There will be just time, whilst my uncle _Toby_ and _Trim_ are walking to my father's, to inform you that Mrs. _Wadman_ had, some moons before this, made a confident of my mother; and that Mrs. _Bridget_, who had the burden of her own, as well as her mistress's secret to carry, had got happily delivered of both to _Susannah_ behind the garden-wall.\nAs for my mother, she saw nothing at all in it, to make the least bustle about----but _Susannah_ was sufficient by herself for all the ends and purposes you could possibly have, in exporting a family secret; for she instantly imparted it by signs to _Jonathan_----and _Jonathan_ by tokens to the cook as she was basting a loin of mutton; the cook sold it with some kitchen-fat to the postillion for a groat, who truck'd it with the dairy maid for something of about the same value----and though whisper'd in the hay-loft, FAME caught the notes with her brazen trumpet, and sounded them upon the house-top --In a word, not an old woman in the village or five miles round, who did not understand the difficulties of my uncle _Toby's_ siege, and what were the secret articles which had delayed the surrender.----\nMy father, whose way was to force every event in nature into an hypothesis, by which means never man crucified TRUTH at the rate he did----had but just heard of the report as my uncle _Toby_ set out; and catching fire suddenly at the trespass done his brother by it, was demonstrating to _Yorick_, notwithstanding my mother was sitting by----not only, \"That the devil was in women, and that the whole of the affair was lust;\" but that every evil and disorder in the world, of what kind or nature soever, from the first fall of _Adam_, down to my uncle _Toby's_ (inclusive), was owing one way or other to the same unruly appetite.\n_Yorick_ was just bringing my father's hypothesis to some temper, when my uncle _Toby_ entering the room with marks of infinite benevolence and forgiveness in his looks, my father's eloquence rekindled against the passion----and as he was not very nice in the choice of his words when he was wroth----as soon as my uncle _Toby_ was seated by the fire, and had filled his pipe, my father broke out in this manner.",
        "paragraph_chars": [
            [
                0,
                351
            ],
            [
                351,
                1161
            ],
            [
                1161,
                1791
            ],
            [
                1791,
                2203
            ]
        ],
        "segment_chars": [
            [
                0,
                351
            ],
            [
                351,
                1161
            ],
            [
                1161,
                1791
            ],
            [
                1791,
                2203
            ]
        ],
        "overlap_chars": [
            [
                0,
                40
            ],
            [
                48,
                51
            ],
            [
                59,
                110
            ],
            [
                112,
                118
            ],
            [
                120,
                129
            ],
            [
                136,
                148
            ],
            [
                169,
                193
            ],
            [
                203,
                234
            ],
            [
                247,
                315
            ],
            [
                320,
                325
            ],
            [
                327,
                351
            ],
            [
                351,
                384
            ],
            [
                392,
                397
            ],
            [
                399,
                406
            ],
            [
                671,
                672
            ],
            [
                424,
                429
            ],
            [
                433,
                436
            ],
            [
                441,
                446
            ],
            [
                448,
                451
            ],
            [
                407,
                410
            ],
            [
                598,
                600
            ],
            [
                542,
                588
            ],
            [
                605,
                610
            ],
            [
                397,
                398
            ],
            [
                491,
                494
            ],
            [
                623,
                628
            ],
            [
                640,
                651
            ],
            [
                687,
                762
            ],
            [
                771,
                831
            ],
            [
                835,
                845
            ],
            [
                856,
                955
            ],
            [
                958,
                968
            ],
            [
                659,
                662
            ],
            [
                969,
                1073
            ],
            [
                463,
                465
            ],
            [
                1079,
                1081
            ],
            [
                1083,
                1156
            ],
            [
                1161,
                1251
            ],
            [
                1258,
                1261
            ],
            [
                1659,
                1663
            ],
            [
                1262,
                1296
            ],
            [
                1300,
                1303
            ],
            [
                1308,
                1344
            ],
            [
                1421,
                1423
            ],
            [
                1352,
                1364
            ],
            [
                1428,
                1448
            ],
            [
                1450,
                1456
            ],
            [
                1426,
                1427
            ],
            [
                1475,
                1484
            ],
            [
                1489,
                1499
            ],
            [
                1503,
                1511
            ],
            [
                1514,
                1584
            ],
            [
                1587,
                1636
            ],
            [
                1642,
                1646
            ],
            [
                1663,
                1687
            ],
            [
                1696,
                1712
            ],
            [
                1718,
                1720
            ],
            [
                1457,
                1458
            ],
            [
                1735,
                1791
            ],
            [
                1792,
                1798
            ],
            [
                1800,
                1803
            ],
            [
                1841,
                1843
            ],
            [
                1818,
                1840
            ],
            [
                1849,
                1855
            ],
            [
                1855,
                1870
            ],
            [
                1887,
                1895
            ],
            [
                2047,
                2050
            ],
            [
                1910,
                2012
            ],
            [
                2016,
                2038
            ],
            [
                2044,
                2046
            ],
            [
                2061,
                2064
            ],
            [
                2051,
                2060
            ],
            [
                2065,
                2082
            ],
            [
                2141,
                2142
            ],
            [
                2092,
                2111
            ],
            [
                2119,
                2141
            ],
            [
                2166,
                2203
            ]
        ],
        "row_chars": [
            [
                0,
                351
            ],
            [
                351,
                1161
            ],
            [
                1161,
                1791
            ],
            [
                1791,
                2203
            ]
        ]
    },
    "abridged": {
        "text": "There will be just time, whilst my uncle Toby and Trim are walking to my father's, to inform you that Mrs. Wadman had, some months before this, confided in my mother; and that Mrs. Bridget, who had the burden of her own and her mistress's secret to carry, had got happily delivered of both to Susannah behind the garden-wall.\nAs for my mother, she saw nothing in it to make a fuss about - but Susannah was the perfect means to export a family secret; for she instantly imparted it to Jonathan, and Jonathan to the cook; the cook sold it with some kitchen-fat to the postillion for a groat, who traded it with the dairy maid for something of about the same value - and though whispered in the hay-loft, Fame caught the notes with her brazen trumpet, and sounded them upon the house-top.\nIn a word, there was not an old woman in the village or five miles round, who did not understand the difficulties of my uncle Toby's siege, and what were the secret articles which had delayed the surrender.\nMy father, whose way was to force every event in nature into an hypothesis, by which means no man ever crucified Truth at the rate he did - had just heard of the report as my uncle Toby set out; and was demonstrating to Yorick, despite my mother sitting by - not only 'That the devil was in women, and that the whole of the affair was lust;' but that every evil and disorder in the world, of whatever kind, from the first fall of Adam down to my uncle Toby's, was owing one way or other to the same unruly appetite.\nYorick was trying to make my father's hypothesis more temperate, when my uncle Toby entered the room. At the infinite benevolence and forgiveness in his looks, my father's eloquence rekindled against the passion - and as he was not very fastidious in his choice of words when he was angry, as soon as my uncle Toby was seated by the fire, my father broke out in this manner.",
        "paragraph_chars": [
            [
                0,
                326
            ],
            [
                326,
                786
            ],
            [
                786,
                993
            ],
            [
                993,
                1509
            ],
            [
                1509,
                1883
            ]
        ],
        "segment_chars": [
            [
                0,
                326
            ],
            [
                326,
                786
            ],
            [
                786,
                993
            ],
            [
                993,
                1509
            ],
            [
                1509,
                1611
            ],
            [
                1611,
                1883
            ]
        ],
        "overlap_chars": [
            [
                0,
                40
            ],
            [
                46,
                49
            ],
            [
                55,
                106
            ],
            [
                107,
                113
            ],
            [
                114,
                123
            ],
            [
                131,
                143
            ],
            [
                156,
                180
            ],
            [
                188,
                219
            ],
            [
                224,
                292
            ],
            [
                296,
                301
            ],
            [
                302,
                326
            ],
            [
                326,
                359
            ],
            [
                360,
                365
            ],
            [
                366,
                373
            ],
            [
                374,
                375
            ],
            [
                381,
                386
            ],
            [
                389,
                392
            ],
            [
                396,
                401
            ],
            [
                402,
                405
            ],
            [
                406,
                409
            ],
            [
                424,
                426
            ],
            [
                434,
                480
            ],
            [
                487,
                492
            ],
            [
                492,
                493
            ],
            [
                494,
                497
            ],
            [
                501,
                506
            ],
            [
                507,
                518
            ],
            [
                518,
                593
            ],
            [
                601,
                661
            ],
            [
                664,
                674
            ],
            [
                685,
                784
            ],
            [
                786,
                796
            ],
            [
                803,
                806
            ],
            [
                807,
                911
            ],
            [
                914,
                916
            ],
            [
                916,
                918
            ],
            [
                919,
                992
            ],
            [
                993,
                1083
            ],
            [
                1087,
                1090
            ],
            [
                1091,
                1095
            ],
            [
                1096,
                1130
            ],
            [
                1133,
                1136
            ],
            [
                1137,
                1173
            ],
            [
                1176,
                1178
            ],
            [
                1179,
                1191
            ],
            [
                1192,
                1212
            ],
            [
                1213,
                1219
            ],
            [
                1219,
                1220
            ],
            [
                1229,
                1238
            ],
            [
                1239,
                1249
            ],
            [
                1252,
                1260
            ],
            [
                1262,
                1332
            ],
            [
                1335,
                1384
            ],
            [
                1394,
                1398
            ],
            [
                1398,
                1422
            ],
            [
                1428,
                1444
            ],
            [
                1449,
                1451
            ],
            [
                1451,
                1452
            ],
            [
                1453,
                1509
            ],
            [
                1509,
                1515
            ],
            [
                1516,
                1519
            ],
            [
                1527,
                1529
            ],
            [
                1535,
                1557
            ],
            [
                1563,
                1569
            ],
            [
                1572,
                1587
            ],
            [
                1601,
                1609
            ],
            [
                1614,
                1617
            ],
            [
                1618,
                1720
            ],
            [
                1723,
                1745
            ],
            [
                1757,
                1759
            ],
            [
                1760,
                1763
            ],
            [
                1764,
                1773
            ],
            [
                1774,
                1791
            ],
            [
                1797,
                1798
            ],
            [
                1799,
                1818
            ],
            [
                1824,
                1846
            ],
            [
                1846,
                1883
            ]
        ],
        "row_chars": [
            [
                0,
                326
            ],
            [
                326,
                993
            ],
            [
                993,
                1509
            ],
            [
                1509,
                1883
            ]
        ]
    }
}