{
    "original": {
        "text": "It is about an hour and a half's tolerable good reading since my uncle _Toby_ rung the bell, when _Obadiah_ was ordered to saddle a horse, and go for Dr. _Slop_, the man-midwife; --so that no one can say, with reason, that I have not allowed _Obadiah_ time enough, poetically speaking, and considering the emergency too, both to go and come; ----though, morally and truly speaking, the man perhaps has scarce had time to get on his boots.\nIf the hypercritick will go upon this; and is resolved after all to take a pendulum, and measure the true distance betwixt the ringing of the bell, and the rap at the door; --and, after finding it to be no more than two minutes, thirteen seconds, and three fifths, --should take upon him to insult over me for such a breach in the unity, or rather probability of time; --I would remind him, that the idea of duration, and of its simple modes, is got merely from the train and succession of our ideas, ----and is the true scholastic pendulum, ----and by which, as a scholar, I will be tried in this matter, --abjuring and detesting the jurisdiction of all other pendulums whatever.\nI would therefore desire him to consider that it is but poor eight miles from _Shandy-Hall_ to Dr. _Slop_, the man-midwife's house; --and that whilst _Obadiah_ has been going those said miles and back, I have brought my uncle _Toby_ from _Namur_, quite across all _Flanders_, into _England_: --That I have had him ill upon my hands near four years; --and have since travelled him and Corporal _Trim_ in a chariot-and-four, a journey of near two hundred miles down into _Yorkshire_, ----all which put together, must have prepared the reader's imagination for the entrance of Dr. _Slop_ upon the stage, --as much, at least (I hope) as a dance, a song, or a concerto between the acts.\nIf my hypercritick is intractable, alledging, that two minutes and thirteen seconds are no more than two minutes and thirteen seconds, --when I have said all I can about them; and that this plea, though it might save me dramatically, will damn me biographically, rendering my book from this very moment, a professed ROMANCE, which, before, was a book apocryphal: ----If I am thus pressed --I then put an end to the whole objection and controversy about it all at once, ----by acquainting him, that _Obadiah_ had not got above threescore yards from the stable-yard before he met with Dr. _Slop_; --and indeed he gave a dirty proof that he had met with him, and was within an ace of giving a tragical one too.\nImagine to yourself; --but this had better begin a new chapter.",
        "paragraph_chars": [
            [
                0,
                439
            ],
            [
                439,
                1120
            ],
            [
                1120,
                1802
            ],
            [
                1802,
                2510
            ],
            [
                2510,
                2573
            ]
        ],
        "segment_chars": [
            [
                0,
                439
            ],
            [
                439,
                1120
            ],
            [
                1120,
                1802
            ],
            [
                1802,
                2510
            ],
            [
                2510,
                2573
            ]
        ],
        "overlap_chars": [
            [
                0,
                32
            ],
            [
                43,
                70
            ],
            [
                78,
                92
            ],
            [
                139,
                142
            ],
            [
                99,
                106
            ],
            [
                108,
                122
            ],
            [
                143,
                153
            ],
            [
                155,
                159
            ],
            [
                160,
                178
            ],
            [
                181,
                183
            ],
            [
                189,
                203
            ],
            [
                218,
                241
            ],
            [
                243,
                250
            ],
            [
                252,
                285
            ],
            [
                326,
                335
            ],
            [
                340,
                341
            ],
            [
                346,
                353
            ],
            [
                366,
                439
            ],
            [
                439,
                445
            ],
            [
                482,
                493
            ],
            [
                504,
                506
            ],
            [
                528,
                585
            ],
            [
                587,
                611
            ],
            [
                614,
                618
            ],
            [
                625,
                666
            ],
            [
                668,
                685
            ],
            [
                706,
                712
            ],
            [
                727,
                736
            ],
            [
                742,
                769
            ],
            [
                787,
                807
            ],
            [
                810,
                828
            ],
            [
                830,
                855
            ],
            [
                882,
                904
            ],
            [
                915,
                938
            ],
            [
                1118,
                1120
            ],
            [
                1120,
                1127
            ],
            [
                1145,
                1171
            ],
            [
                1181,
                1197
            ],
            [
                1199,
                1210
            ],
            [
                1212,
                1218
            ],
            [
                1220,
                1224
            ],
            [
                1242,
                1251
            ],
            [
                1254,
                1269
            ],
            [
                1271,
                1278
            ],
            [
                1280,
                1294
            ],
            [
                1312,
                1345
            ],
            [
                1353,
                1357
            ],
            [
                1362,
                1364
            ],
            [
                1225,
                1226
            ],
            [
                1373,
                1383
            ],
            [
                1394,
                1400
            ],
            [
                1402,
                1409
            ],
            [
                1410,
                1411
            ],
            [
                1234,
                1235
            ],
            [
                1414,
                1451
            ],
            [
                1457,
                1468
            ],
            [
                1532,
                1536
            ],
            [
                1475,
                1479
            ],
            [
                1496,
                1512
            ],
            [
                1543,
                1578
            ],
            [
                1584,
                1588
            ],
            [
                1590,
                1599
            ],
            [
                1365,
                1366
            ],
            [
                1606,
                1609
            ],
            [
                1610,
                1615
            ],
            [
                1630,
                1697
            ],
            [
                1699,
                1703
            ],
            [
                1705,
                1719
            ],
            [
                1800,
                1802
            ],
            [
                1802,
                1807
            ],
            [
                1821,
                1836
            ],
            [
                1848,
                1936
            ],
            [
                1978,
                1981
            ],
            [
                2036,
                2040
            ],
            [
                2075,
                2082
            ],
            [
                2106,
                2107
            ],
            [
                2118,
                2125
            ],
            [
                2360,
                2361
            ],
            [
                2169,
                2189
            ],
            [
                2192,
                2232
            ],
            [
                1846,
                1847
            ],
            [
                2275,
                2277
            ],
            [
                2290,
                2293
            ],
            [
                1982,
                1986
            ],
            [
                2301,
                2308
            ],
            [
                2310,
                2313
            ],
            [
                2318,
                2321
            ],
            [
                2339,
                2360
            ],
            [
                2366,
                2388
            ],
            [
                2390,
                2394
            ],
            [
                1976,
                1977
            ],
            [
                2399,
                2510
            ],
            [
                2510,
                2529
            ],
            [
                2533,
                2573
            ]
        ],
        "row_chars": [
            [
                0,
                439
            ],
            [
                439,
                1120
            ],
            [
                1120,
                1802
            ],
            [
                1802,
                2510
            ],
            [
                2510,
                2573
            ]
        ]
    },
    "abridged": {
        "text": "It is about an hour and a half's good reading since my uncle Toby rung the bell, and Obadiah was ordered to go for Dr. Slop, the man-midwife; so no one can say that I have not allowed Obadiah time enough, poetically speaking, to go and return; - though, truly speaking, the man perhaps has scarce had time to get on his boots.\nIf the critic is resolved to measure the true distance betwixt the ringing of the bell and the rap at the door; and, finding it to be no more than two minutes thirteen seconds, should decide to insult me for such a breach in the probability of time; - I would remind him that the idea of duration is got merely from the succession of our ideas.\nI would ask him to consider that it is only eight miles from Shandy-Hall to Dr. Slop's house; and that whilst Obadiah has been going there and back, I have brought my uncle Toby from Namur, across all Flanders, into England: - that I have had him ill upon my hands four years; - and have taken him and Corporal Trim a journey of near two hundred miles into Yorkshire, all of which must have prepared the reader's imagination for the entrance of Dr. Slop upon the stage.\nIf my critic is intractable, alleging that two minutes and thirteen seconds are no more than two minutes and thirteen seconds, and will render my book a Romance - if I am thus pressed - I then put an end to the whole objection, by informing him that Obadiah had got no more than sixty yards from the stable before he met with Dr. Slop; and indeed he gave a dirty proof that he had met with him, and was within an ace of giving a tragical one too.\nImagine to yourself - but this had better begin a new chapter.",
        "paragraph_chars": [
            [
                0,
                327
            ],
            [
                327,
                672
            ],
            [
                672,
                1142
            ],
            [
                1142,
                1589
            ],
            [
                1589,
                1651
            ]
        ],
        "segment_chars": [
            [
                0,
                327
            ],
            [
                327,
                672
            ],
            [
                672,
                1142
            ],
            [
                1142,
                1589
            ],
            [
                1589,
                1651
            ]
        ],
        "overlap_chars": [
            [
                0,
                32
            ],
            [
                33,
                60
            ],
            [
                66,
                80
            ],
            [
                81,
                84
            ],
            [
                85,
                92
            ],
            [
                93,
                107
            ],
            [
                108,
                118
            ],
            [
                119,
                123
            ],
            [
                123,
                141
            ],
            [
                142,
                144
            ],
            [
                145,
                159
            ],
            [
                160,
                183
            ],
            [
                184,
                191
            ],
            [
                192,
                225
            ],
            [
                226,
                235
            ],
            [
                242,
                243
            ],
            [
                246,
                253
            ],
            [
                254,
                327
            ],
            [
                327,
                333
            ],
            [
                341,
                352
            ],
            [
                353,
                355
            ],
            [
                356,
                413
            ],
            [
                414,
                438
            ],
            [
                439,
                443
            ],
            [
                444,
                485
            ],
            [
                486,
                503
            ],
            [
                504,
                510
            ],
            [
                518,
                527
            ],
            [
                528,
                555
            ],
            [
                556,
                576
            ],
            [
                579,
                597
            ],
            [
                598,
                623
            ],
            [
                624,
                646
            ],
            [
                647,
                670
            ],
            [
                670,
                672
            ],
            [
                672,
                679
            ],
            [
                684,
                710
            ],
            [
                716,
                732
            ],
            [
                733,
                744
            ],
            [
                745,
                751
            ],
            [
                752,
                756
            ],
            [
                756,
                765
            ],
            [
                766,
                781
            ],
            [
                782,
                789
            ],
            [
                790,
                804
            ],
            [
                811,
                844
            ],
            [
                850,
                854
            ],
            [
                858,
                860
            ],
            [
                860,
                861
            ],
            [
                862,
                872
            ],
            [
                881,
                887
            ],
            [
                888,
                895
            ],
            [
                895,
                896
            ],
            [
                897,
                898
            ],
            [
                899,
                936
            ],
            [
                937,
                948
            ],
            [
                949,
                954
            ],
            [
                955,
                959
            ],
            [
                966,
                982
            ],
            [
                988,
                1023
            ],
            [
                1024,
                1028
            ],
            [
                1029,
                1038
            ],
            [
                1038,
                1039
            ],
            [
                1040,
                1043
            ],
            [
                1047,
                1052
            ],
            [
                1053,
                1120
            ],
            [
                1121,
                1125
            ],
            [
                1126,
                1140
            ],
            [
                1140,
                1142
            ],
            [
                1142,
                1147
            ],
            [
                1155,
                1170
            ],
            [
                1180,
                1268
            ],
            [
                1269,
                1272
            ],
            [
                1273,
                1277
            ],
            [
                1285,
                1292
            ],
            [
                1293,
                1294
            ],
            [
                1295,
                1302
            ],
            [
                1303,
                1304
            ],
            [
                1305,
                1325
            ],
            [
                1328,
                1368
            ],
            [
                1368,
                1369
            ],
            [
                1370,
                1372
            ],
            [
                1383,
                1386
            ],
            [
                1387,
                1391
            ],
            [
                1392,
                1399
            ],
            [
                1400,
                1403
            ],
            [
                1404,
                1407
            ],
            [
                1427,
                1448
            ],
            [
                1449,
                1471
            ],
            [
                1472,
                1476
            ],
            [
                1476,
                1477
            ],
            [
                1478,
                1589
            ],
            [
                1589,
                1608
            ],
            [
                1611,
                1651
            ]
        ],
        "row_chars": [
            [
                0,
                327
            ],
            [
                327,
                672
            ],
            [
                672,
                1142
            ],
            [
                1142,
                1589
            ],
            [
                1589,
                1651
            ]
        ]
    }
}