{
    "original": {
        "text": "Imagine to yourself a little squat, uncourtly figure of a Doctor _Slop_, of about four feet and a half perpendicular height, with a breadth of back, and a sesquipedality of belly, which might have done honour to a serjeant in the horse-guards.\nSuch were the out-lines of Dr. _Slop's_ figure, which, --if you have read _Hogarth's_ analysis of beauty, and if you have not, I wish you would; ----you must know, may as certainly be caricatured, and conveyed to the mind by three strokes as three hundred.\nImagine such a one, ----for such, I say, were the outlines of Dr. _Slop's_ figure, coming slowly along, foot by foot, waddling thro' the dirt upon the vertebr of a little diminutive pony, of a pretty colour----but of strength, ----alack! ----scarce able to have made an amble of it, under such a fardel, had the roads been in an ambling condition. ----They were not. ----Imagine to yourself, _Obadiah_ mounted upon a strong monster of a coach-horse, pricked into a full gallop, and making all practicable speed the adverse way.\nPray, Sir, let me interest you a moment in this description.\nHad Dr. _Slop_ beheld _Obadiah_ a mile off, posting in a narrow lane directly towards him, at that monstrous rate, --splashing and plunging like a devil thro' thick and thin, as he approached, would not such a phnomenon, with such a vortex of mud and water moving along with it, round its axis, --have been a subject of juster apprehension to Dr. _Slop_ in his situation, than the _worst_ of _Whiston's_ comets? --To say nothing of the NUCLEUS; that is, of _Obadiah_ and the coach-horse. --In my idea, the vortex alone of 'em was enough to have involved and carried, if not the doctor, at least the doctor's pony, quite away with it. What then do you think must the terror and hydrophobia of Dr. _Slop_ have been, when you read (which you are just going to do) that he was advancing thus warily along towards _Shandy-Hall_, and had approached to within sixty yards of it, and within five yards of a sudden turn, made by an acute angle of the garden-wall, --and in the dirtiest part of a dirty lane, --when _Obadiah_ and his coach-horse turned the corner, rapid, furious, --pop, --full upon him! --Nothing, I think, in nature, can be supposed more terrible than such a rencounter, --so imprompt! so ill prepared to stand the shock of it as Dr. _Slop_ was.\nWhat could Dr. _Slop_ do? ----he crossed himself + --Pugh! --but the doctor, Sir, was a Papist. --No matter; he had better have kept hold of the pummel --He had so; --nay, as it happened, he had better have done nothing at all; for in crossing himself he let go his whip, ----and in attempting to save his whip betwixt his knee and his saddle's skirt, as it slipped, he lost his stirrup, ----in losing which he lost his seat; ----and in the multitude of all these losses (which, by the bye, shews what little advantage there is in crossing) the unfortunate doctor lost his presence of mind. So that without waiting for _Obadiah's_ onset, he left his pony to its destiny, tumbling off it diagonally, something in the stile and manner of a pack of wool, and without any other consequence from the fall, save that of being left (as it would have been) with the broadest part of him sunk about twelve inches deep in the mire.\n_Obadiah_ pull'd off his cap twice to Dr. _Slop_; --once as he was falling, --and then again when he saw him seated. ----Ill-timed complaisance; --had not the fellow better have stopped his horse, and got off and help'd him? --Sir, he did all that his situation would allow; --but the MOMENTUM of the coach-horse was so great, that _Obadiah_ could not do it all at once; he rode in a circle three times round Dr. _Slop_, before he could fully accomplish it any how; --and at the last, when he did stop his beast, 'twas done with such an explosion of mud, that _Obadiah_ had better have been a league off. In short, never was a Dr. _Slop_ so beluted, and so transubstantiated, since that affair came into fashion.",
        "paragraph_chars": [
            [
                0,
                244
            ],
            [
                244,
                501
            ],
            [
                501,
                1029
            ],
            [
                1029,
                1090
            ],
            [
                1090,
                2345
            ],
            [
                2345,
                3267
            ],
            [
                3267,
                3979
            ]
        ],
        "segment_chars": [
            [
                0,
                244
            ],
            [
                244,
                501
            ],
            [
                501,
                739
            ],
            [
                739,
                849
            ],
            [
                849,
                868
            ],
            [
                868,
                1029
            ],
            [
                1029,
                1090
            ],
            [
                1090,
                1502
            ],
            [
                1502,
                1578
            ],
            [
                1578,
                1724
            ],
            [
                1724,
                2185
            ],
            [
                2185,
                2285
            ],
            [
                2285,
                2345
            ],
            [
                2345,
                2371
            ],
            [
                2371,
                2404
            ],
            [
                2404,
                2441
            ],
            [
                2441,
                2936
            ],
            [
                2936,
                3267
            ],
            [
                3267,
                3384
            ],
            [
                3384,
                3492
            ],
            [
                3492,
                3872
            ],
            [
                3872,
                3979
            ]
        ],
        "overlap_chars": [
            [
                0,
                64
            ],
            [
                66,
                70
            ],
            [
                71,
                72
            ],
            [
                76,
                102
            ],
            [
                223,
                225
            ],
            [
                117,
                124
            ],
            [
                125,
                129
            ],
            [
                132,
                142
            ],
            [
                173,
                178
            ],
            [
                242,
                244
            ],
            [
                501,
                508
            ],
            [
                619,
                627
            ],
            [
                591,
                597
            ],
            [
                634,
                647
            ],
            [
                663,
                671
            ],
            [
                683,
                688
            ],
            [
                519,
                520
            ],
            [
                732,
                739
            ],
            [
                755,
                757
            ],
            [
                784,
                796
            ],
            [
                782,
                783
            ],
            [
                805,
                823
            ],
            [
                847,
                849
            ],
            [
                853,
                868
            ],
            [
                894,
                901
            ],
            [
                903,
                950
            ],
            [
                966,
                982
            ],
            [
                1012,
                1015
            ],
            [
                1024,
                1029
            ],
            [
                1029,
                1090
            ],
            [
                1094,
                1097
            ],
            [
                1099,
                1103
            ],
            [
                1090,
                1093
            ],
            [
                1105,
                1111
            ],
            [
                1113,
                1120
            ],
            [
                1122,
                1133
            ],
            [
                1142,
                1158
            ],
            [
                1179,
                1180
            ],
            [
                1159,
                1179
            ],
            [
                1181,
                1204
            ],
            [
                1207,
                1242
            ],
            [
                1249,
                1263
            ],
            [
                1265,
                1299
            ],
            [
                1309,
                1346
            ],
            [
                1369,
                1384
            ],
            [
                1387,
                1396
            ],
            [
                1430,
                1436
            ],
            [
                1438,
                1442
            ],
            [
                1462,
                1470
            ],
            [
                1472,
                1477
            ],
            [
                1407,
                1409
            ],
            [
                1307,
                1309
            ],
            [
                1490,
                1492
            ],
            [
                1494,
                1501
            ],
            [
                1504,
                1546
            ],
            [
                1548,
                1555
            ],
            [
                1557,
                1578
            ],
            [
                1580,
                1629
            ],
            [
                1655,
                1714
            ],
            [
                1722,
                1724
            ],
            [
                1724,
                1746
            ],
            [
                1782,
                1785
            ],
            [
                1787,
                1791
            ],
            [
                1756,
                1762
            ],
            [
                1747,
                1751
            ],
            [
                1793,
                1872
            ],
            [
                1891,
                1898
            ],
            [
                1900,
                1911
            ],
            [
                1912,
                1917
            ],
            [
                1966,
                1988
            ],
            [
                2019,
                2024
            ],
            [
                2051,
                2088
            ],
            [
                2038,
                2039
            ],
            [
                2091,
                2095
            ],
            [
                2097,
                2104
            ],
            [
                2106,
                2159
            ],
            [
                2163,
                2166
            ],
            [
                2170,
                2184
            ],
            [
                2345,
                2359
            ],
            [
                2361,
                2365
            ],
            [
                2367,
                2371
            ],
            [
                2375,
                2395
            ],
            [
                2410,
                2439
            ],
            [
                2454,
                2456
            ],
            [
                2461,
                2467
            ],
            [
                2468,
                2496
            ],
            [
                2512,
                2516
            ],
            [
                2547,
                2616
            ],
            [
                2621,
                2655
            ],
            [
                2710,
                2732
            ],
            [
                2737,
                2770
            ],
            [
                2775,
                2835
            ],
            [
                2842,
                2853
            ],
            [
                2864,
                2884
            ],
            [
                2884,
                2935
            ],
            [
                3016,
                3028
            ],
            [
                2991,
                2999
            ],
            [
                3081,
                3096
            ],
            [
                2983,
                2985
            ],
            [
                3194,
                3228
            ],
            [
                3235,
                3267
            ],
            [
                3600,
                3607
            ],
            [
                3853,
                3857
            ],
            [
                3497,
                3498
            ],
            [
                3735,
                3738
            ],
            [
                3548,
                3598
            ],
            [
                3638,
                3679
            ],
            [
                3681,
                3685
            ],
            [
                3686,
                3697
            ],
            [
                3769,
                3778
            ],
            [
                3540,
                3541
            ],
            [
                3780,
                3820
            ],
            [
                3510,
                3514
            ],
            [
                3499,
                3501
            ],
            [
                3837,
                3852
            ],
            [
                3515,
                3518
            ],
            [
                3870,
                3872
            ],
            [
                3882,
                3897
            ],
            [
                3899,
                3903
            ],
            [
                3905,
                3907
            ],
            [
                3915,
                3941
            ],
            [
                3966,
                3970
            ],
            [
                3978,
                3979
            ]
        ],
        "row_chars": [
            [
                0,
                244
            ],
            [
                244,
                501
            ],
            [
                501,
                739
            ],
            [
                739,
                849
            ],
            [
                849,
                868
            ],
            [
                868,
                1029
            ],
            [
                1029,
                1090
            ],
            [
                1090,
                1502
            ],
            [
                1502,
                1578
            ],
            [
                1578,
                1724
            ],
            [
                1724,
                2185
            ],
            [
                2185,
                2285
            ],
            [
                2285,
                2345
            ],
            [
                2345,
                2371
            ],
            [
                2371,
                2441
            ],
            [
                2441,
                2936
            ],
            [
                2936,
                3267
            ],
            [
                3267,
                3384
            ],
            [
                3384,
                3492
            ],
            [
                3492,
                3872
            ],
            [
                3872,
                3979
            ]
        ]
    },
    "abridged": {
        "text": "Imagine to yourself a little squat, uncourtly figure of a Doctor Slop, about four feet and a half in height, but with considerable breadth of belly.\nImagine him waddling slowly through the dirt upon a little pony, scarce able, alack! to walk under such a burden, even had the roads been good. - They were not. - Now imagine Obadiah mounted upon a strong monster of a coach-horse, in full gallop, and speeding the opposite way.\nPray, Sir, let me interest you a moment in this description.\nIf Dr. Slop had beheld Obadiah a mile off, in a narrow lane, heading directly towards him at that monstrous rate, splashing and plunging like a devil through thick and thin as he approached, would not such a phenomenon, with such a vortex of mud and water round its axis, have been more fearful to Dr. Slop than the worst of Whiston's comets?\n- To say nothing of the Nucleus; that is, of Obadiah and the coach-horse. - In my idea, the vortex alone of 'em was enough to carry, if not the doctor, at least the doctor's pony, quite away. What then do you think Dr. Slop's terror must have been, when you read (which you are just going to do) that he was advancing towards Shandy-Hall, and was within five yards of a sharp angle in the dirtiest part of a dirty lane, - when Obadiah and his coach-horse turned the corner, rapid, furious - pop - full upon him!\nWhat could Dr. Slop do? - he crossed himself + (for the doctor, Sir, was a Papist.) He would have done better to have kept hold of the pummel - nay, to have done nothing at all; for in crossing himself he let go his whip, and in attempting to save his whip, he lost his stirrup, - in losing which he lost his seat; - and in the multitude of all these losses (which, by the bye, shows what little point there is in crossing oneself) the unfortunate doctor lost his presence of mind.\nTumbling off his pony like a pack of wool, he landed with the broadest part of him sunk twelve inches deep in the mire.\nObadiah had been riding so fast, and the Momentum of the coach-horse was so great, that he rode in a circle three times round Dr. Slop, before he stopped his beast; and then 'twas done with such an explosion of mud that he had better have kept his distance. Never was a Dr. Slop so bespattered, and so transubstantiated into mud.",
        "paragraph_chars": [
            [
                0,
                149
            ],
            [
                149,
                427
            ],
            [
                427,
                488
            ],
            [
                488,
                831
            ],
            [
                831,
                1343
            ],
            [
                1343,
                1825
            ],
            [
                1825,
                1945
            ],
            [
                1945,
                2274
            ]
        ],
        "segment_chars": [
            [
                0,
                149
            ],
            [
                149,
                234
            ],
            [
                234,
                293
            ],
            [
                293,
                310
            ],
            [
                310,
                427
            ],
            [
                427,
                488
            ],
            [
                488,
                831
            ],
            [
                831,
                905
            ],
            [
                905,
                1023
            ],
            [
                1023,
                1343
            ],
            [
                1343,
                1367
            ],
            [
                1367,
                1427
            ],
            [
                1427,
                1825
            ],
            [
                1825,
                1945
            ],
            [
                1945,
                2203
            ],
            [
                2203,
                2274
            ]
        ],
        "overlap_chars": [
            [
                0,
                64
            ],
            [
                65,
                69
            ],
            [
                69,
                70
            ],
            [
                71,
                97
            ],
            [
                98,
                100
            ],
            [
                101,
                108
            ],
            [
                113,
                117
            ],
            [
                131,
                141
            ],
            [
                142,
                147
            ],
            [
                147,
                149
            ],
            [
                149,
                156
            ],
            [
                161,
                169
            ],
            [
                170,
                176
            ],
            [
                185,
                198
            ],
            [
                199,
                207
            ],
            [
                208,
                213
            ],
            [
                225,
                226
            ],
            [
                227,
                234
            ],
            [
                234,
                236
            ],
            [
                242,
                254
            ],
            [
                261,
                262
            ],
            [
                268,
                286
            ],
            [
                291,
                293
            ],
            [
                295,
                310
            ],
            [
                324,
                331
            ],
            [
                332,
                379
            ],
            [
                383,
                399
            ],
            [
                409,
                412
            ],
            [
                422,
                427
            ],
            [
                427,
                488
            ],
            [
                491,
                494
            ],
            [
                495,
                499
            ],
            [
                500,
                503
            ],
            [
                504,
                510
            ],
            [
                511,
                518
            ],
            [
                519,
                530
            ],
            [
                531,
                547
            ],
            [
                547,
                548
            ],
            [
                557,
                577
            ],
            [
                578,
                601
            ],
            [
                602,
                637
            ],
            [
                646,
                660
            ],
            [
                661,
                695
            ],
            [
                706,
                743
            ],
            [
                744,
                759
            ],
            [
                760,
                769
            ],
            [
                783,
                789
            ],
            [
                790,
                794
            ],
            [
                795,
                803
            ],
            [
                804,
                809
            ],
            [
                810,
                812
            ],
            [
                818,
                820
            ],
            [
                820,
                822
            ],
            [
                823,
                830
            ],
            [
                833,
                875
            ],
            [
                876,
                883
            ],
            [
                884,
                905
            ],
            [
                907,
                956
            ],
            [
                962,
                1021
            ],
            [
                1021,
                1023
            ],
            [
                1023,
                1045
            ],
            [
                1046,
                1049
            ],
            [
                1050,
                1054
            ],
            [
                1057,
                1063
            ],
            [
                1064,
                1068
            ],
            [
                1069,
                1148
            ],
            [
                1149,
                1156
            ],
            [
                1157,
                1168
            ],
            [
                1168,
                1173
            ],
            [
                1178,
                1200
            ],
            [
                1207,
                1212
            ],
            [
                1213,
                1250
            ],
            [
                1251,
                1252
            ],
            [
                1253,
                1257
            ],
            [
                1258,
                1265
            ],
            [
                1266,
                1319
            ],
            [
                1322,
                1325
            ],
            [
                1328,
                1342
            ],
            [
                1343,
                1357
            ],
            [
                1358,
                1362
            ],
            [
                1363,
                1367
            ],
            [
                1369,
                1389
            ],
            [
                1395,
                1424
            ],
            [
                1427,
                1429
            ],
            [
                1446,
                1452
            ],
            [
                1456,
                1484
            ],
            [
                1487,
                1491
            ],
            [
                1495,
                1564
            ],
            [
                1565,
                1599
            ],
            [
                1599,
                1621
            ],
            [
                1624,
                1657
            ],
            [
                1660,
                1720
            ],
            [
                1727,
                1738
            ],
            [
                1745,
                1765
            ],
            [
                1773,
                1824
            ],
            [
                1825,
                1837
            ],
            [
                1838,
                1846
            ],
            [
                1852,
                1867
            ],
            [
                1868,
                1870
            ],
            [
                1878,
                1912
            ],
            [
                1913,
                1945
            ],
            [
                1945,
                1952
            ],
            [
                1957,
                1961
            ],
            [
                1976,
                1977
            ],
            [
                1978,
                1981
            ],
            [
                1982,
                2032
            ],
            [
                2033,
                2074
            ],
            [
                2075,
                2079
            ],
            [
                2079,
                2090
            ],
            [
                2099,
                2108
            ],
            [
                2108,
                2109
            ],
            [
                2119,
                2159
            ],
            [
                2160,
                2164
            ],
            [
                2165,
                2167
            ],
            [
                2168,
                2183
            ],
            [
                2189,
                2192
            ],
            [
                2201,
                2203
            ],
            [
                2203,
                2218
            ],
            [
                2219,
                2223
            ],
            [
                2224,
                2226
            ],
            [
                2238,
                2264
            ],
            [
                2265,
                2269
            ],
            [
                2273,
                2274
            ]
        ],
        "row_chars": [
            [
                0,
                149
            ],
            [
                149,
                149
            ],
            [
                149,
                234
            ],
            [
                234,
                293
            ],
            [
                293,
                310
            ],
            [
                310,
                427
            ],
            [
                427,
                488
            ],
            [
                488,
                831
            ],
            [
                831,
                905
            ],
            [
                905,
                1023
            ],
            [
                1023,
                1343
            ],
            [
                1343,
                1343
            ],
            [
                1343,
                1343
            ],
            [
                1343,
                1367
            ],
            [
                1367,
                1427
            ],
            [
                1427,
                1825
            ],
            [
                1825,
                1945
            ],
            [
                1945,
                1945
            ],
            [
                1945,
                1945
            ],
            [
                1945,
                2203
            ],
            [
                2203,
                2274
            ]
        ]
    }
}