{
    "original": {
        "text": "I have dropped the curtain over this scene for a minute, ----to remind you of one thing, ----and to inform you of another.\nWhat I have to inform you, comes, I own, a little out of its due course; ----for it should have been told a hundred and fifty pages ago, but that I foresaw then 'twould come in pat hereafter, and be of more advantage here than elsewhere. --Writers had need look before them, to keep up the spirit and connection of what they have in hand.\nWhen these two things are done, --the curtain shall be drawn up again, and my uncle _Toby_, my father, and Dr. _Slop_, shall go on with their discourse, without any more interruption.\nFirst, then, the matter which I have to remind you of, is this; ----that from the specimens of singularity in my father's notions in the point of christian-names, and that other previous point thereto, --you was led, I think, into an opinion (and I am sure I said as much), that my father was a gentleman altogether as odd and whimsical in fifty other opinions. In truth, there was not a stage in the life of man, from the very first act of his begetting, ----down to the lean and slippered pantaloon in his second childishness, but he had some favourite notion to himself, springing out of it, as sceptical, and as far out of the highway of thinking, as these two which have been explained.\n--Mr. _Shandy_, my father, Sir, would see nothing in the light in which others placed it; --he placed things in his own light; --he would weigh nothing in common scales; --no, he was too refined a researcher to lie open to so gross an imposition. --To come at the exact weight of things in the scientific steel-yard, the fulcrum, he would say, should be almost invisible, to avoid all friction from popular tenets; --without this the minuti of philosophy, which would always turn the balance, will have no weight at all. Knowledge, like matter, he would affirm, was divisible _in infinitum_; ----that the grains and scruples were as much a part of it, as the gravitation of the whole world. --In a word, he would say, error was error, --no matter where it fell, ----whether in a fraction, --or a pound, --'twas alike fatal to truth, and she was kept down at the bottom of her well, as inevitably by a mistake in the dust of a butterfly's wings, ----as in the disk of the sun, the moon, and all the stars of heaven put together.\nHe would often lament that it was for want of considering this properly, and of applying it skilfully to civil matters, as well as to speculative truths, that so many things in this world were out of joint; ----that the political arch was giving way; ----and that the very foundations of our excellent constitution, in church and state, were so sapped as estimators had reported.\nYou cry out, he would say, we are a ruined, undone people. Why? he would ask, making use of the sorites or syllogism of _Zeno_ and _Chrysippus_, without knowing it belonged to them. --Why? why are we a ruined people? --Because we are corrupted. --Whence is it, dear Sir, that we are corrupted? ----Because we are needy; ----our poverty, and not our wills, consent. ----And wherefore, he would add, are we needy? --From the neglect, he would answer, of our pence and our halfpence: --Our bank notes, Sir, our guineas, --nay, our shillings take care of themselves.\n'Tis the same, he would say, throughout the whole circle of the sciences; --the great, the established points of them, are not to be broke in upon. --The laws of nature will defend themselves; --but error----(he would add, looking earnestly at my mother)----error, Sir, creeps in thro' the minute holes and small crevices which human nature leaves unguarded.\nThis turn of thinking in my father, is what I had to remind you of: --The point you are to be informed of, and which I have reserved for this place, is as follows.\nAmongst the many and excellent reasons, with which my father had urged my mother to accept of Dr. _Slop's_ assistance preferably to that of the old woman, ----there was one of a very singular nature; which, when he had done arguing the manner with her as a Christian, and came to argue it over again with her as a philosopher, he had put his whole strength to, depending indeed upon it as his sheet-anchor. ----It failed him; tho' from no defect in the argument itself; but that, do what he could, he was not able for his soul to make her comprehend the drift of it. ----Cursed luck! ----said he to himself, one afternoon, as he walked out of the room, after he had been stating it for an hour and a half to her, to no manner of purpose; --cursed luck! said he, biting his lip as he shut the door, ----for a man to be master of one of the finest chains of reasoning in nature, --and have a wife at the same time with such a headpiece, that he cannot hang up a single inference within side of it, to save his soul from destruction.\nThis argument, though it was entirely lost upon my mother, ----had more weight with him, than all his other arguments joined together: --I will therefore endeavour to do it justice, --and set it forth with all the perspicuity I am master of.\nMy father set out upon the strength of these two following axioms:\n_First_, That an ounce of a man's own wit, was worth a ton of other people's; and,\n_Secondly_ (Which by the bye, was the ground-work of the first axiom, ----tho' it comes last), That every man's wit must come from every man's own soul, ----and no other body's.\nNow, as it was plain to my father, that all souls were by nature equal, ----and that the great difference between the most acute and the most obtuse understanding----was from no original sharpness or bluntness of one thinking substance above or below another, ----but arose merely from the lucky or unlucky organisation of the body, in that part where the soul principally took up her residence, ----he had made it the subject of his enquiry to find out the identical place.\nNow, from the best accounts he had been able to get of this matter, he was satisfied it could not be where _Des Cartes_ had fixed it, upon the top of the _pineal_ gland of the brain; which, as he philosophized, formed a cushion for her about the size of a marrow pea; tho', to speak the truth, as so many nerves did terminate all in that one place, --'twas no bad conjecture; ----and my father had certainly fallen with that great philosopher plumb into the centre of the mistake, had it not been for my uncle _Toby_, who rescued him out of it, by a story he told him of a _Walloon_ officer at the battle of _Landen_, who had one part of his brain shot away by a musket-ball, --and another part of it taken out after by a _French_ surgeon; and after all, recovered, and did his duty very well without it.\nIf death, said my father, reasoning with himself, is nothing but the separation of the soul from the body; and if it is true that people can walk about and do their business without brains, --then certes the soul does not inhabit there. Q. E. D.\nAs for that certain, very thin, subtle and very fragrant juice which _Coglionissimo Borri_, the great _Milanese_ physician affirms, in a letter to _Bartholine_, to have discovered in the cellul of the occipital parts of the cerebellum, and which he likewise affirms to be the principal seat of the reasonable soul (for, you must know, in these latter and more enlightened ages, there are two souls in every man living, --the one, according to the great _Metheglingius_, being called the _Animus_, the other, the _Anima_;)--as for the opinion, I say, of _Borri_, --my father could never subscribe to it by any means; the very idea of so noble, so refined, so immaterial, and so exalted a being as the _Anima_, or even the _Animus_, taking up her residence, and sitting dabbling, like a tadpole all day long, both summer and winter, in a puddle, ----or in a liquid of any kind, how thick or thin soever, he would say, shocked his imagination; he would scarce give the doctrine a hearing.\nWhat, therefore, seemed the least liable to objections of any, was that the chief sensorium, or head-quarters of the soul, and to which place all intelligences were referred, and from whence all her mandates were issued, --was in, or near, the cerebellum, --or rather somewhere about the _medulla oblongata_, wherein it was generally agreed by _Dutch_ anatomists, that all the minute nerves from all the organs of the seven senses concentered, like streets and winding alleys, into a square.\nSo far there was nothing singular in my father's opinion, --he had the best of philosophers, of all ages and climates, to go along with him. ----But here he took a road of his own, setting up another _Shandean_ hypothesis upon these corner-stones they had laid for him; ----and which said hypothesis equally stood its ground; whether the subtilty and fineness of the soul depended upon the temperature and clearness of the said liquor, or of the finer network and texture in the cerebellum itself; which opinion he favoured.\nHe maintained, that next to the due care to be taken in the act of propagation of each individual, which required all the thought in the world, as it laid the foundation of this incomprehensible contexture, in which wit, memory, fancy, eloquence, and what is usually meant by the name of good natural parts, do consist; --that next to this and his christian-name, which were the two original and most efficacious causes of all; ----that the third cause, or rather what logicians call the _Causa sine qu non_, and without which all that was done was of no manner of significance, ----was the preservation of this delicate and fine-spun web, from the havock which was generally made in it by the violent compression and crush which the head was made to undergo, by the nonsensical method of bringing us into the world by that foremost.\n----This requires explanation.\nMy father, who dipped into all kinds of books, upon looking into _Lithopdus Senonesis de Partu difficili_,[2.1] published by _Adrianus Smelvgot_, had found out, that the lax and pliable state of a child's head in parturition, the bones of the cranium having no sutures at that time, was such, ----that by force of the woman's efforts, which, in strong labour-pains, was equal, upon an average, to the weight of 470 pounds averdupois acting perpendicularly upon it; --it so happened, that in 49 instances out of 50, the said head was compressed and moulded into the shape of an oblong conical piece of dough, such as a pastry-cook generally rolls up in order to make a pye of. --Good God! cried my father, what havock and destruction must this make in the infinitely fine and tender texture of the cerebellum! --Or if there is such a juice as _Borri_ pretends, --is it not enough to make the clearest liquid in the world both feculent and mothery?\nBut how great was his apprehension, when he farther understood, that this force acting upon the very vertex of the head, not only injured the brain itself, or cerebrum, --but that it necessarily squeezed and propelled the cerebrum towards the cerebellum, which was the immediate seat of the understanding! ----Angels and ministers of grace defend us! cried my father, ----can any soul withstand this shock? --No wonder the intellectual web is so rent and tattered as we see it; and that so many of our best heads are no better than a puzzled skein of silk, ----all perplexity, ----all confusion within-side.\nBut when my father read on, and was let into the secret, that when a child was turned topsy-turvy, which was easy for an operator to do, and was extracted by the feet; --that instead of the cerebrum being propelled towards the cerebellum, the cerebellum, on the contrary, was propelled simply towards the cerebrum, where it could do no manner of hurt: ----By heavens! cried he, the world is in conspiracy to drive out what little wit God has given us, ----and the professors of the obstetric art are lifted into the same conspiracy. --What is it to me which end of my son comes foremost into the world, provided all goes right after, and his cerebellum escapes uncrushed?\nIt is the nature of an hypothesis, when once a man has conceived it, that it assimilates every thing to itself, as proper nourishment; and, from the first moment of your begetting it, it generally grows the stronger by every thing you see, hear, read, or understand. This is of great use.\nWhen my father was gone with this about a month, there was scarce a phnomenon of stupidity or of genius, which he could not readily solve by it; --it accounted for the eldest son being the greatest blockhead in the family. ----Poor devil, he would say, --he made way for the capacity of his younger brothers. ----It unriddled the observations of drivellers and monstrous heads, ----shewing _ priori_, it could not be otherwise, ----unless **** I don't know what. It wonderfully explained and accounted for the acumen of the _Asiatic_ genius, and that sprightlier turn, and a more penetrating intuition of minds, in warmer climates; not from the loose and common-place solution of a clearer sky, and a more perpetual sunshine, &c. --which for aught he knew, might as well rarefy and dilute the faculties of the soul into nothing, by one extreme, --as they are condensed in colder climates by the other; ----but he traced the affair up to its spring-head; --shewed that, in warmer climates, nature had laid a lighter tax upon the fairest parts of the creation; --their pleasures more; --the necessity of their pains less, insomuch that the pressure and resistance upon the vertex was so slight, that the whole organisation of the cerebellum was preserved; ----nay, he did not believe, in natural births, that so much as a single thread of the net-work was broke or displaced, ----so that the soul might just act as she liked.\nWhen my father had got so far, ------what a blaze of light did the accounts of the _Csarian_ section, and of the towering geniuses who had come safe into the world by it, cast upon this hypothesis? Here you see, he would say, there was no injury done to the sensorium; --no pressure of the head against the pelvis; ----no propulsion of the cerebrum towards the cerebellum, either by the _os pubis_ on this side, or the _os coxygis_ on that; ------and pray, what were the happy consequences? Why, Sir, your _Julius Csar_, who gave the operation a name; --and your _Hermes Trismegistus_, who was born so before ever the operation had a name; ----your _Scipio Africanus_; your _Manlius Torquatus_; our _Edward_ the Sixth, --who, had he lived, would have done the same honour to the hypothesis: ----These, and many more who figured high in the annals of fame, --all came _side-way_, Sir, into the world.\nThe incision of the _abdomen_ and _uterus_ ran for six weeks together in my father's head; ----he had read, and was satisfied, that wounds in the _epigastrium_, and those in the _matrix_, were not mortal; --so that the belly of the mother might be opened extremely well to give a passage to the child. --He mentioned the thing one afternoon to my mother, ------merely as a matter of fact; but seeing her turn as pale as ashes at the very mention of it, as much as the operation flattered his hopes, --he thought it as well to say no more of it, ----contenting himself with admiring, --what he thought was to no purpose to propose.\nThis was my father Mr. _Shandy's_ hypothesis; concerning which I have only to add, that my brother _Bobby_ did as great honour to it (whatever he did to the family) as any one of the great heroes we spoke of: For happening not only to be christened, as I told you, but to be born too, when my father was at _Epsom_, ----being moreover my mother's _first_ child, --coming into the world with his head _foremost_, --and turning out afterwards a lad of wonderful slow parts, ----my father spelt all these together into his opinion: and as he had failed at one end, --he was determined to try the other.\nThis was not to be expected from one of the sisterhood, who are not easily to be put out of their way, ----and was therefore one of my father's great reasons in favour of a man of science, whom he could better deal with.\nOf all men in the world, Dr. _Slop_ was the fittest for my father's purpose; ----for though this new-invented forceps was the armour he had proved, and what he maintained to be the safest instrument of deliverance, yet, it seems, he had scattered a word or two in his book, in favour of the very thing which ran in my father's fancy; ----tho' not with a view to the soul's good in extracting by the feet, as was my father's system, --but for reasons merely obstetrical.\nThis will account for the coalition betwixt my father and Dr. _Slop_, in the ensuing discourse, which went a little hard against my uncle _Toby_. ----In what manner a plain man, with nothing but common sense, could bear up against two such allies in science, --is hard to conceive. --You may conjecture upon it, if you please, ----and whilst your imagination is in motion, you may encourage it to go on, and discover by what causes and effects in nature it could come to pass, that my uncle _Toby_ got his modesty by the wound he received upon his groin. --You may raise a system to account for the loss of my nose by marriage-articles, --and shew the world how it could happen, that I should have the misfortune to be called TRISTAM, in opposition to my father's hypothesis, and the wish of the whole family, Godfathers and Godmothers not excepted. --These, with fifty other points left yet unravelled, you may endeavour to solve if you have time; ----but I tell you beforehand it will be in vain, for not the sage _Alquife_, the magician in Don _Belianis_ of _Greece_, nor the no less famous _Urganda_, the sorceress his wife, (were they alive), could pretend to come within a league of the truth.\nThe reader will be content to wait for a full explanation of these matters till the next year, ----when a series of things will be laid open which he little expects.\n[Footnote 2.1: The author is here twice mistaken; for _Lithopdus_ should be wrote thus, _Lithopdii Senonensis Icon_. The second mistake is, that this _Lithopdus_ is not an author, but a drawing of a petrified child. The account of this, published by _Athosius_ 1580, may be seen at the end of _Cordus's_ works in _Spachius_. Mr. _Tristram Shandy_ has been led into this error, either from seeing _Lithopdus's_ name of late in a catalogue of learned writers in Dr. ----, or by mistaking _Lithopdus_ for _Trinecavellius_, ----from the too great similitude of the names.]",
        "paragraph_chars": [
            [
                0,
                123
            ],
            [
                123,
                462
            ],
            [
                462,
                646
            ],
            [
                646,
                1338
            ],
            [
                1338,
                2366
            ],
            [
                2366,
                2746
            ],
            [
                2746,
                3309
            ],
            [
                3309,
                3668
            ],
            [
                3668,
                3832
            ],
            [
                3832,
                4863
            ],
            [
                4863,
                5105
            ],
            [
                5105,
                5172
            ],
            [
                5172,
                5255
            ],
            [
                5255,
                5433
            ],
            [
                5433,
                5908
            ],
            [
                5908,
                6713
            ],
            [
                6713,
                6959
            ],
            [
                6959,
                7945
            ],
            [
                7945,
                8437
            ],
            [
                8437,
                8962
            ],
            [
                8962,
                9796
            ],
            [
                9796,
                9827
            ],
            [
                9827,
                10774
            ],
            [
                10774,
                11382
            ],
            [
                11382,
                12054
            ],
            [
                12054,
                12343
            ],
            [
                12343,
                13767
            ],
            [
                13767,
                14667
            ],
            [
                14667,
                15298
            ],
            [
                15298,
                15898
            ],
            [
                15898,
                16119
            ],
            [
                16119,
                16589
            ],
            [
                16589,
                17789
            ],
            [
                17789,
                17955
            ],
            [
                17955,
                18523
            ]
        ],
        "segment_chars": [
            [
                0,
                123
            ],
            [
                123,
                361
            ],
            [
                361,
                462
            ],
            [
                462,
                646
            ],
            [
                646,
                1008
            ],
            [
                1008,
                1338
            ],
            [
                1338,
                1585
            ],
            [
                1585,
                1859
            ],
            [
                1859,
                2029
            ],
            [
                2029,
                2366
            ],
            [
                2366,
                2746
            ],
            [
                2746,
                2805
            ],
            [
                2805,
                2810
            ],
            [
                2810,
                2928
            ],
            [
                2928,
                2935
            ],
            [
                2935,
                2963
            ],
            [
                2963,
                2991
            ],
            [
                2991,
                3040
            ],
            [
                3040,
                3111
            ],
            [
                3111,
                3158
            ],
            [
                3158,
                3309
            ],
            [
                3309,
                3457
            ],
            [
                3457,
                3668
            ],
            [
                3668,
                3832
            ],
            [
                3832,
                4239
            ],
            [
                4239,
                4399
            ],
            [
                4399,
                4416
            ],
            [
                4416,
                4585
            ],
            [
                4585,
                4863
            ],
            [
                4863,
                5105
            ],
            [
                5105,
                5172
            ],
            [
                5172,
                5255
            ],
            [
                5255,
                5433
            ],
            [
                5433,
                5908
            ],
            [
                5908,
                6713
            ],
            [
                6713,
                6950
            ],
            [
                6950,
                6959
            ],
            [
                6959,
                7945
            ],
            [
                7945,
                8437
            ],
            [
                8437,
                8578
            ],
            [
                8578,
                8962
            ],
            [
                8962,
                9796
            ],
            [
                9796,
                9827
            ],
            [
                9827,
                10503
            ],
            [
                10503,
                10515
            ],
            [
                10515,
                10636
            ],
            [
                10636,
                10774
            ],
            [
                10774,
                11080
            ],
            [
                11080,
                11125
            ],
            [
                11125,
                11181
            ],
            [
                11181,
                11382
            ],
            [
                11382,
                11750
            ],
            [
                11750,
                11915
            ],
            [
                11915,
                12054
            ],
            [
                12054,
                12321
            ],
            [
                12321,
                12343
            ],
            [
                12343,
                12566
            ],
            [
                12566,
                12652
            ],
            [
                12652,
                12806
            ],
            [
                12806,
                13767
            ],
            [
                13767,
                13965
            ],
            [
                13965,
                14258
            ],
            [
                14258,
                14667
            ],
            [
                14667,
                14969
            ],
            [
                14969,
                15298
            ],
            [
                15298,
                15898
            ],
            [
                15898,
                16119
            ],
            [
                16119,
                16589
            ],
            [
                16589,
                16735
            ],
            [
                16735,
                16871
            ],
            [
                16871,
                17144
            ],
            [
                17144,
                17439
            ],
            [
                17439,
                17789
            ],
            [
                17789,
                17955
            ],
            [
                17955,
                18072
            ],
            [
                18072,
                18171
            ],
            [
                18171,
                18280
            ],
            [
                18280,
                18523
            ]
        ],
        "overlap_chars": [
            [
                0,
                56
            ],
            [
                61,
                88
            ],
            [
                93,
                123
            ],
            [
                123,
                195
            ],
            [
                200,
                263
            ],
            [
                269,
                278
            ],
            [
                264,
                268
            ],
            [
                284,
                303
            ],
            [
                313,
                361
            ],
            [
                363,
                370
            ],
            [
                375,
                379
            ],
            [
                380,
                384
            ],
            [
                396,
                462
            ],
            [
                462,
                493
            ],
            [
                496,
                545
            ],
            [
                552,
                572
            ],
            [
                574,
                578
            ],
            [
                581,
                613
            ],
            [
                615,
                646
            ],
            [
                646,
                658
            ],
            [
                676,
                699
            ],
            [
                704,
                709
            ],
            [
                801,
                802
            ],
            [
                714,
                727
            ],
            [
                738,
                740
            ],
            [
                756,
                767
            ],
            [
                768,
                775
            ],
            [
                792,
                801
            ],
            [
                802,
                808
            ],
            [
                850,
                853
            ],
            [
                858,
                861
            ],
            [
                872,
                876
            ],
            [
                813,
                817
            ],
            [
                854,
                857
            ],
            [
                962,
                1008
            ],
            [
                1008,
                1064
            ],
            [
                1087,
                1100
            ],
            [
                1111,
                1146
            ],
            [
                1100,
                1101
            ],
            [
                1179,
                1181
            ],
            [
                1317,
                1321
            ],
            [
                1186,
                1207
            ],
            [
                1084,
                1086
            ],
            [
                1173,
                1174
            ],
            [
                1262,
                1296
            ],
            [
                1336,
                1338
            ],
            [
                1354,
                1369
            ],
            [
                1380,
                1427
            ],
            [
                1430,
                1463
            ],
            [
                1342,
                1343
            ],
            [
                1859,
                1913
            ],
            [
                1943,
                1962
            ],
            [
                1918,
                1927
            ],
            [
                2027,
                2029
            ],
            [
                2056,
                2071
            ],
            [
                2075,
                2099
            ],
            [
                2143,
                2148
            ],
            [
                2155,
                2170
            ],
            [
                2179,
                2218
            ],
            [
                2220,
                2282
            ],
            [
                2287,
                2341
            ],
            [
                2352,
                2366
            ],
            [
                2366,
                2399
            ],
            [
                2468,
                2470
            ],
            [
                2409,
                2411
            ],
            [
                2424,
                2428
            ],
            [
                2518,
                2572
            ],
            [
                2621,
                2633
            ],
            [
                2639,
                2657
            ],
            [
                2685,
                2701
            ],
            [
                2703,
                2707
            ],
            [
                2744,
                2746
            ],
            [
                2759,
                2772
            ],
            [
                2773,
                2788
            ],
            [
                2797,
                2805
            ],
            [
                2805,
                2808
            ],
            [
                2810,
                2823
            ],
            [
                2838,
                2841
            ],
            [
                2853,
                2865
            ],
            [
                2873,
                2876
            ],
            [
                2878,
                2888
            ],
            [
                2889,
                2928
            ],
            [
                2935,
                2945
            ],
            [
                2948,
                2954
            ],
            [
                2961,
                2963
            ],
            [
                2965,
                2991
            ],
            [
                3025,
                3028
            ],
            [
                3022,
                3024
            ],
            [
                3029,
                3040
            ],
            [
                3044,
                3064
            ],
            [
                3109,
                3111
            ],
            [
                3115,
                3118
            ],
            [
                3144,
                3158
            ],
            [
                3160,
                3176
            ],
            [
                3195,
                3207
            ],
            [
                3225,
                3226
            ],
            [
                3229,
                3249
            ],
            [
                3284,
                3309
            ],
            [
                3314,
                3322
            ],
            [
                3324,
                3337
            ],
            [
                3593,
                3594
            ],
            [
                3369,
                3382
            ],
            [
                3385,
                3394
            ],
            [
                3412,
                3418
            ],
            [
                3428,
                3455
            ],
            [
                3459,
                3500
            ],
            [
                3504,
                3513
            ],
            [
                3517,
                3563
            ],
            [
                3567,
                3572
            ],
            [
                3579,
                3588
            ],
            [
                3595,
                3615
            ],
            [
                3622,
                3666
            ],
            [
                3668,
                3672
            ],
            [
                3678,
                3734
            ],
            [
                3738,
                3832
            ],
            [
                3832,
                3922
            ],
            [
                3926,
                3929
            ],
            [
                3931,
                3937
            ],
            [
                3939,
                3949
            ],
            [
                3972,
                3985
            ],
            [
                3985,
                3986
            ],
            [
                3991,
                4004
            ],
            [
                4032,
                4037
            ],
            [
                4044,
                4046
            ],
            [
                4166,
                4191
            ],
            [
                4237,
                4239
            ],
            [
                4243,
                4252
            ],
            [
                4320,
                4328
            ],
            [
                4337,
                4340
            ],
            [
                4362,
                4381
            ],
            [
                4386,
                4391
            ],
            [
                4397,
                4398
            ],
            [
                4403,
                4414
            ],
            [
                4420,
                4483
            ],
            [
                4485,
                4490
            ],
            [
                4511,
                4536
            ],
            [
                4540,
                4550
            ],
            [
                4561,
                4569
            ],
            [
                4572,
                4583
            ],
            [
                4585,
                4608
            ],
            [
                4628,
                4629
            ],
            [
                4634,
                4708
            ],
            [
                4711,
                4726
            ],
            [
                4744,
                4760
            ],
            [
                4767,
                4781
            ],
            [
                4824,
                4844
            ],
            [
                4863,
                4921
            ],
            [
                4926,
                4950
            ],
            [
                4952,
                4980
            ],
            [
                4988,
                4997
            ],
            [
                5000,
                5016
            ],
            [
                5027,
                5043
            ],
            [
                5103,
                5105
            ],
            [
                5105,
                5114
            ],
            [
                5144,
                5153
            ],
            [
                5164,
                5172
            ],
            [
                5173,
                5178
            ],
            [
                5179,
                5213
            ],
            [
                5215,
                5248
            ],
            [
                5256,
                5264
            ],
            [
                5266,
                5292
            ],
            [
                5305,
                5324
            ],
            [
                5334,
                5342
            ],
            [
                5347,
                5385
            ],
            [
                5398,
                5407
            ],
            [
                5412,
                5418
            ],
            [
                5429,
                5433
            ],
            [
                5433,
                5437
            ],
            [
                5441,
                5466
            ],
            [
                5468,
                5487
            ],
            [
                5498,
                5504
            ],
            [
                5509,
                5521
            ],
            [
                5528,
                5595
            ],
            [
                5603,
                5607
            ],
            [
                5611,
                5649
            ],
            [
                5669,
                5692
            ],
            [
                5697,
                5722
            ],
            [
                5740,
                5793
            ],
            [
                5806,
                5827
            ],
            [
                5833,
                5839
            ],
            [
                5599,
                5602
            ],
            [
                5906,
                5908
            ],
            [
                5913,
                5938
            ],
            [
                5974,
                5978
            ],
            [
                5993,
                6014
            ],
            [
                6016,
                6026
            ],
            [
                6028,
                6061
            ],
            [
                6063,
                6069
            ],
            [
                6071,
                6090
            ],
            [
                5911,
                5912
            ],
            [
                6182,
                6219
            ],
            [
                6238,
                6245
            ],
            [
                6250,
                6256
            ],
            [
                6259,
                6271
            ],
            [
                6174,
                6175
            ],
            [
                6288,
                6301
            ],
            [
                6306,
                6315
            ],
            [
                6323,
                6350
            ],
            [
                6387,
                6417
            ],
            [
                5953,
                5955
            ],
            [
                6453,
                6455
            ],
            [
                6438,
                6441
            ],
            [
                6456,
                6463
            ],
            [
                5960,
                5962
            ],
            [
                6491,
                6515
            ],
            [
                6517,
                6523
            ],
            [
                6524,
                6583
            ],
            [
                6586,
                6618
            ],
            [
                6625,
                6629
            ],
            [
                6639,
                6651
            ],
            [
                6663,
                6713
            ],
            [
                6713,
                6737
            ],
            [
                6761,
                6902
            ],
            [
                6905,
                6909
            ],
            [
                6917,
                6950
            ],
            [
                6950,
                6959
            ],
            [
                6959,
                6970
            ],
            [
                6985,
                7001
            ],
            [
                7007,
                7027
            ],
            [
                7043,
                7048
            ],
            [
                7049,
                7060
            ],
            [
                7062,
                7070
            ],
            [
                7072,
                7081
            ],
            [
                6978,
                6979
            ],
            [
                7120,
                7141
            ],
            [
                7179,
                7207
            ],
            [
                7217,
                7234
            ],
            [
                7245,
                7256
            ],
            [
                7268,
                7272
            ],
            [
                7089,
                7090
            ],
            [
                7523,
                7538
            ],
            [
                7545,
                7557
            ],
            [
                7561,
                7573
            ],
            [
                7575,
                7600
            ],
            [
                7310,
                7313
            ],
            [
                7636,
                7658
            ],
            [
                7337,
                7342
            ],
            [
                7715,
                7735
            ],
            [
                7737,
                7765
            ],
            [
                7790,
                7802
            ],
            [
                7875,
                7882
            ],
            [
                7943,
                7945
            ],
            [
                7945,
                7972
            ],
            [
                8041,
                8067
            ],
            [
                8008,
                8011
            ],
            [
                8213,
                8232
            ],
            [
                8234,
                8251
            ],
            [
                8006,
                8007
            ],
            [
                8036,
                8037
            ],
            [
                8262,
                8288
            ],
            [
                8290,
                8295
            ],
            [
                8297,
                8308
            ],
            [
                8314,
                8340
            ],
            [
                8345,
                8355
            ],
            [
                8387,
                8420
            ],
            [
                8422,
                8437
            ],
            [
                8437,
                8493
            ],
            [
                8576,
                8578
            ],
            [
                8582,
                8636
            ],
            [
                8638,
                8646
            ],
            [
                8648,
                8683
            ],
            [
                8960,
                8962
            ],
            [
                8962,
                8975
            ],
            [
                8977,
                9028
            ],
            [
                9044,
                9060
            ],
            [
                9209,
                9212
            ],
            [
                9092,
                9094
            ],
            [
                8975,
                8976
            ],
            [
                9399,
                9408
            ],
            [
                9041,
                9043
            ],
            [
                9545,
                9600
            ],
            [
                9602,
                9610
            ],
            [
                9618,
                9642
            ],
            [
                9649,
                9675
            ],
            [
                9686,
                9704
            ],
            [
                9710,
                9777
            ],
            [
                9786,
                9796
            ],
            [
                9800,
                9827
            ],
            [
                9827,
                9891
            ],
            [
                9962,
                9970
            ],
            [
                9897,
                9931
            ],
            [
                9973,
                9986
            ],
            [
                9988,
                9996
            ],
            [
                10005,
                10036
            ],
            [
                10096,
                10098
            ],
            [
                10110,
                10119
            ],
            [
                10124,
                10208
            ],
            [
                10212,
                10248
            ],
            [
                10260,
                10290
            ],
            [
                9971,
                9972
            ],
            [
                10297,
                10299
            ],
            [
                10294,
                10296
            ],
            [
                10300,
                10308
            ],
            [
                10310,
                10320
            ],
            [
                10331,
                10345
            ],
            [
                10351,
                10400
            ],
            [
                10411,
                10456
            ],
            [
                10467,
                10475
            ],
            [
                10485,
                10494
            ],
            [
                10499,
                10502
            ],
            [
                10505,
                10513
            ],
            [
                10515,
                10531
            ],
            [
                10532,
                10536
            ],
            [
                10544,
                10569
            ],
            [
                10575,
                10581
            ],
            [
                10593,
                10634
            ],
            [
                10774,
                10836
            ],
            [
                10838,
                10853
            ],
            [
                10969,
                11042
            ],
            [
                11053,
                11060
            ],
            [
                11065,
                11079
            ],
            [
                11084,
                11090
            ],
            [
                11114,
                11123
            ],
            [
                11125,
                11141
            ],
            [
                11146,
                11181
            ],
            [
                11183,
                11219
            ],
            [
                11229,
                11237
            ],
            [
                11250,
                11290
            ],
            [
                11335,
                11349
            ],
            [
                11225,
                11228
            ],
            [
                11359,
                11375
            ],
            [
                11382,
                11385
            ],
            [
                11391,
                11413
            ],
            [
                11439,
                11549
            ],
            [
                11552,
                11556
            ],
            [
                11605,
                11619
            ],
            [
                11654,
                11717
            ],
            [
                11738,
                11748
            ],
            [
                11750,
                11759
            ],
            [
                11760,
                11832
            ],
            [
                11913,
                11915
            ],
            [
                11917,
                11993
            ],
            [
                12020,
                12052
            ],
            [
                12054,
                12108
            ],
            [
                12119,
                12130
            ],
            [
                12241,
                12256
            ],
            [
                12261,
                12269
            ],
            [
                12306,
                12308
            ],
            [
                12319,
                12320
            ],
            [
                12343,
                12357
            ],
            [
                12372,
                12376
            ],
            [
                12377,
                12410
            ],
            [
                12421,
                12436
            ],
            [
                12440,
                12446
            ],
            [
                12448,
                12487
            ],
            [
                12490,
                12506
            ],
            [
                12511,
                12565
            ],
            [
                12570,
                12580
            ],
            [
                12582,
                12595
            ],
            [
                12598,
                12650
            ],
            [
                12806,
                12830
            ],
            [
                12849,
                12866
            ],
            [
                13106,
                13108
            ],
            [
                12871,
                12875
            ],
            [
                12877,
                12910
            ],
            [
                12945,
                12953
            ],
            [
                12955,
                12987
            ],
            [
                12998,
                13041
            ],
            [
                12918,
                12922
            ],
            [
                13059,
                13071
            ],
            [
                13243,
                13244
            ],
            [
                13249,
                13255
            ],
            [
                13306,
                13310
            ],
            [
                13312,
                13376
            ],
            [
                12953,
                12954
            ],
            [
                13721,
                13732
            ],
            [
                13481,
                13489
            ],
            [
                13505,
                13513
            ],
            [
                13291,
                13295
            ],
            [
                13212,
                13214
            ],
            [
                13521,
                13524
            ],
            [
                13528,
                13535
            ],
            [
                13567,
                13595
            ],
            [
                12910,
                12915
            ],
            [
                13149,
                13157
            ],
            [
                13100,
                13105
            ],
            [
                13749,
                13755
            ],
            [
                13760,
                13767
            ],
            [
                13767,
                13797
            ],
            [
                13804,
                13849
            ],
            [
                13860,
                13964
            ],
            [
                13965,
                13977
            ],
            [
                13979,
                13992
            ],
            [
                13993,
                14017
            ],
            [
                14034,
                14035
            ],
            [
                14038,
                14081
            ],
            [
                14086,
                14115
            ],
            [
                14214,
                14258
            ],
            [
                14258,
                14267
            ],
            [
                14274,
                14280
            ],
            [
                14286,
                14318
            ],
            [
                14321,
                14324
            ],
            [
                14331,
                14350
            ],
            [
                14351,
                14352
            ],
            [
                14417,
                14433
            ],
            [
                14621,
                14622
            ],
            [
                14462,
                14465
            ],
            [
                14467,
                14473
            ],
            [
                14475,
                14485
            ],
            [
                14488,
                14522
            ],
            [
                14532,
                14556
            ],
            [
                14665,
                14666
            ],
            [
                14562,
                14582
            ],
            [
                14625,
                14633
            ],
            [
                14644,
                14665
            ],
            [
                14667,
                14686
            ],
            [
                14710,
                14727
            ],
            [
                14737,
                14757
            ],
            [
                14762,
                14773
            ],
            [
                14794,
                14812
            ],
            [
                14855,
                14870
            ],
            [
                14773,
                14774
            ],
            [
                14874,
                14968
            ],
            [
                14971,
                14983
            ],
            [
                14994,
                15021
            ],
            [
                15035,
                15119
            ],
            [
                15168,
                15204
            ],
            [
                15164,
                15165
            ],
            [
                15216,
                15248
            ],
            [
                15208,
                15210
            ],
            [
                15296,
                15298
            ],
            [
                15298,
                15320
            ],
            [
                15322,
                15330
            ],
            [
                15332,
                15396
            ],
            [
                15398,
                15403
            ],
            [
                15405,
                15411
            ],
            [
                15418,
                15430
            ],
            [
                15463,
                15505
            ],
            [
                15507,
                15520
            ],
            [
                15567,
                15577
            ],
            [
                15583,
                15604
            ],
            [
                15609,
                15611
            ],
            [
                15546,
                15547
            ],
            [
                15618,
                15644
            ],
            [
                15646,
                15651
            ],
            [
                15653,
                15659
            ],
            [
                15662,
                15683
            ],
            [
                15693,
                15697
            ],
            [
                15561,
                15562
            ],
            [
                15712,
                15757
            ],
            [
                15581,
                15582
            ],
            [
                15774,
                15783
            ],
            [
                15814,
                15859
            ],
            [
                15862,
                15898
            ],
            [
                15898,
                15930
            ],
            [
                15938,
                15941
            ],
            [
                15952,
                15953
            ],
            [
                16005,
                16041
            ],
            [
                16048,
                16119
            ],
            [
                16119,
                16147
            ],
            [
                16149,
                16153
            ],
            [
                16155,
                16195
            ],
            [
                16200,
                16240
            ],
            [
                16265,
                16266
            ],
            [
                16276,
                16289
            ],
            [
                16522,
                16523
            ],
            [
                16296,
                16405
            ],
            [
                16500,
                16510
            ],
            [
                16241,
                16244
            ],
            [
                16511,
                16513
            ],
            [
                16518,
                16522
            ],
            [
                16451,
                16452
            ],
            [
                16462,
                16465
            ],
            [
                16481,
                16496
            ],
            [
                16549,
                16550
            ],
            [
                16553,
                16589
            ],
            [
                16589,
                16650
            ],
            [
                16652,
                16656
            ],
            [
                16659,
                16726
            ],
            [
                16754,
                16765
            ],
            [
                16798,
                16847
            ],
            [
                16850,
                16870
            ],
            [
                16873,
                16915
            ],
            [
                16920,
                16985
            ],
            [
                16997,
                17005
            ],
            [
                17071,
                17079
            ],
            [
                17057,
                17059
            ],
            [
                17006,
                17008
            ],
            [
                17087,
                17115
            ],
            [
                17128,
                17144
            ],
            [
                17146,
                17153
            ],
            [
                17169,
                17225
            ],
            [
                17228,
                17231
            ],
            [
                17237,
                17250
            ],
            [
                17273,
                17274
            ],
            [
                17254,
                17259
            ],
            [
                17282,
                17320
            ],
            [
                17322,
                17372
            ],
            [
                17378,
                17397
            ],
            [
                17437,
                17438
            ],
            [
                17441,
                17519
            ],
            [
                17536,
                17537
            ],
            [
                17542,
                17556
            ],
            [
                17568,
                17591
            ],
            [
                17523,
                17526
            ],
            [
                17592,
                17595
            ],
            [
                17754,
                17789
            ],
            [
                17789,
                17799
            ],
            [
                17819,
                17868
            ],
            [
                17873,
                17883
            ],
            [
                17888,
                17904
            ],
            [
                17912,
                17954
            ]
        ],
        "row_chars": [
            [
                0,
                123
            ],
            [
                123,
                361
            ],
            [
                361,
                462
            ],
            [
                462,
                646
            ],
            [
                646,
                1008
            ],
            [
                1008,
                1338
            ],
            [
                1338,
                1585
            ],
            [
                1585,
                1859
            ],
            [
                1859,
                2029
            ],
            [
                2029,
                2366
            ],
            [
                2366,
                2746
            ],
            [
                2746,
                2805
            ],
            [
                2805,
                2810
            ],
            [
                2810,
                2928
            ],
            [
                2928,
                2935
            ],
            [
                2935,
                2963
            ],
            [
                2963,
                2991
            ],
            [
                2991,
                3040
            ],
            [
                3040,
                3111
            ],
            [
                3111,
                3158
            ],
            [
                3158,
                3309
            ],
            [
                3309,
                3668
            ],
            [
                3668,
                3832
            ],
            [
                3832,
                4239
            ],
            [
                4239,
                4399
            ],
            [
                4399,
                4416
            ],
            [
                4416,
                4585
            ],
            [
                4585,
                4863
            ],
            [
                4863,
                5105
            ],
            [
                5105,
                5172
            ],
            [
                5172,
                5255
            ],
            [
                5255,
                5433
            ],
            [
                5433,
                5908
            ],
            [
                5908,
                6713
            ],
            [
                6713,
                6950
            ],
            [
                6950,
                6959
            ],
            [
                6959,
                7945
            ],
            [
                7945,
                8437
            ],
            [
                8437,
                8578
            ],
            [
                8578,
                8962
            ],
            [
                8962,
                9796
            ],
            [
                9796,
                9827
            ],
            [
                9827,
                10503
            ],
            [
                10503,
                10515
            ],
            [
                10515,
                10636
            ],
            [
                10636,
                10774
            ],
            [
                10774,
                11080
            ],
            [
                11080,
                11125
            ],
            [
                11125,
                11181
            ],
            [
                11181,
                11382
            ],
            [
                11382,
                11750
            ],
            [
                11750,
                11915
            ],
            [
                11915,
                12054
            ],
            [
                12054,
                12321
            ],
            [
                12321,
                12343
            ],
            [
                12343,
                12566
            ],
            [
                12566,
                12652
            ],
            [
                12652,
                12806
            ],
            [
                12806,
                13767
            ],
            [
                13767,
                13965
            ],
            [
                13965,
                14258
            ],
            [
                14258,
                14667
            ],
            [
                14667,
                14969
            ],
            [
                14969,
                15298
            ],
            [
                15298,
                15898
            ],
            [
                15898,
                16119
            ],
            [
                16119,
                16589
            ],
            [
                16589,
                16735
            ],
            [
                16735,
                16871
            ],
            [
                16871,
                17144
            ],
            [
                17144,
                17439
            ],
            [
                17439,
                17789
            ],
            [
                17789,
                17955
            ],
            [
                17955,
                18072
            ],
            [
                18072,
                18171
            ],
            [
                18171,
                18280
            ],
            [
                18280,
                18523
            ]
        ]
    },
    "abridged": {
        "text": "I have dropped the curtain over this scene for a minute, to remind you of one thing, and to inform you of another.\nWhat I have to inform you, comes, I own, a little out of its due course; - for it should have been told a hundred and fifty pages ago, but I foresaw that 'twould come in pat, and be of more advantage here than elsewhere. Writers need to look ahead, to keep up the spirit and connection of what they have in hand.\nWhen these two things are done, the curtain shall be drawn up again, and my uncle Toby, my father, and Dr. Slop shall go on with their discourse without any more interruption.\nFirst, then, I have to remind you of this; - that from the example of my father's unusual notions about Christian names, you were led into assuming that he was just as odd and whimsical in fifty other opinions. In truth, there was not a stage in the life of man, from his begetting to the lean and slippered pantaloon, that he did not have some favourite notion of, far out of the highway of thinking.\nMy father, Sir, saw nothing in the light in which others placed it; he placed things in his own light.\nKnowledge, like matter, he would affirm, was divisible into grains and scruples ad infinitum. Error was error; no matter where it fell, 'twas fatal to truth, who was kept down at the bottom of her well as inevitably by a mistake in the dust of a butterfly's wings, as in the disk of the sun, the moon, and all the stars put together.\nHe would often lament that it was due to neglect of this truth, that so many things in this world were out of joint; - and that the foundations of our church and state were weakened.\nHe would say, 'We are a ruined people. Why?' he would ask, using the syllogism of Zeno and Chrysippus, without knowing it belonged to them. - 'Why are we ruined? Because we are corrupted. Why are we corrupted? Because we are needy. And why are we needy? From the neglect of our pence: our bank notes, Sir, take care of themselves.\n''Tis the same,' he would say, 'throughout all the sciences; the great points are not to be broke in upon - the laws of nature will defend themselves - but error' (he would add, looking earnestly at my mother) - 'error creeps in through the minute holes and crevices which human nature leaves unguarded.'\nThis style of thinking in my father, is what I had to remind you of.\n- The point you are to be informed of, and which I have reserved for this place, is as follows.\nAmongst the many and excellent reasons, with which my father had urged my mother to accept Dr. Slop's assistance rather than the old woman's, there was one particular reason which he put his whole strength to. - It failed because he could not make her comprehend its drift.\n'Cursed luck!' said he to himself, one afternoon, as he walked out of the room after arguing it for an hour and a half with her, to no purpose; 'Cursed luck!' said he, biting his lip, 'for a man to be master of one of the finest chains of reasoning in nature, and have a wife with such a head that he cannot make an impression on it, to save his soul.'\nThis argument, though it was entirely lost upon my mother, had more weight with him than all his other arguments together: I will therefore try to do it justice.\nMy father began with these two axioms:\nFirst, that an ounce of a man's own wit was worth a ton of other people's.\nSecondly (which by the bye, was the basis of the first axiom, though it comes after), that every man's wit must come from his own soul, and no one else's.\nNow, it was plain to my father that all souls were equal, and that the difference between the most acute and the most obtuse understanding came not from any original sharpness or bluntness of one mind above or below another, but arose merely from the organisation of the body, in that part where the soul took up her residence. He had therefore researched exactly where that was.\nFrom the best accounts he could find, he believed it could not be where Des Cartes had fixed it, upon the top of the pineal gland of the brain; though, to speak the truth, as so many nerves terminated in that place, 'twas no bad guess; and my father would have certainly agreed with that great philosopher, had it not been for my uncle Toby telling him a story of an officer at the battle of Landen, who had one part of his brain shot away by a musket-ball, and another part of it taken out by a French surgeon; and afterwards recovered, and did his duty very well without it.\nIf death, said my father, is nothing but the separation of the soul from the body; and if it is true that people can walk about and do their business without brains, then certainly the soul does not inhabit there. Q. E. D.\nAs for that thin, subtle and fragrant juice which Borri, the great Milanese physician, claims to have discovered in the cerebellum, and which he affirms to be the seat of the soul, my father could not subscribe to this theory by any means. The very idea of so noble and exalted a being as the soul residing there and sitting dabbling like a tadpole all day long, in a puddle, shocked him.\nWhat, therefore, seemed the most likely head-quarters of the soul, was somewhere about the medulla oblongata, where, it was generally agreed by Dutch anatomists, all the minute nerves from the organs converged, like streets and winding alleys into a square.\nSo far there was nothing singular in my father's opinion. - But here he took a road of his own, setting up another Shandean hypothesis upon these corner-stones.\nHe maintained that next to the due care to be taken in the act of begetting each individual, and in naming him, the third aim of a parent was the preservation of this delicate and fine-spun web from the havoc which was generally made by the violent compression which the head was forced to undergo, by the nonsensical method of bringing us into the world head foremost.\n- This requires explanation.\nMy father, who dipped into all kinds of books, upon looking into Smelvgot's Lithopdus Senonesis de Partu difficili had found out that the pliable state of a child's head at birth was such, that by force of the woman's efforts, which, in strong labour-pains, was equal, upon average, to the weight of 470 pounds acting perpendicularly upon it, - so it happened that in 49 cases out of 50, the child's head was compressed and moulded into the shape of a conical piece of dough, such as a pastry-cook rolls up to make a pie of.\n'Good God!' cried my father, 'what havoc and destruction must this cause in the fine and tender texture of the cerebellum!'\nBut how great was his apprehension, when he farther understood that this force squeezed and propelled the cerebrum towards the cerebellum, which was the seat of understanding!\n'Angels defend us!' cried my father, - 'can any soul withstand this shock? No wonder the intellectual web is so tattered; and that so many of our best heads are all perplexity and confusion within.'\nBut my father read on, and learned that when a child was turned topsy-turvy, which was easy for an operator to do, and was extracted by the feet; - that then the cerebellum was propelled simply towards the cerebrum, where it could do no harm.\n'By heavens!' cried he, 'the world is in conspiracy to drive out what little wit God has given us. What is it to me which end of my son comes foremost into the world, provided his cerebellum escapes uncrushed?'\nIt is the nature of an hypothesis, when once a man has created it, that it generally grows stronger with everything he hears or reads.\nWhen my father had held this hypothesis about a month, there was scarce a phenomenon of stupidity or genius which he could not readily solve by it; it accounted for his eldest son being the greatest blockhead in the family.\n'Poor devil,' he would say, 'he made way for the capacity of his younger brothers.' It wonderfully explained the acumen of the Asiatic genius, and that sprightlier turn of minds in warmer climates; not from the common-place solution of a clearer sky, and more sunshine, &c; but he affirmed that in warmer climates, nature had laid a lighter tax upon the fairer sex, so that the pressure upon the head in childbirth was slight, the cerebellum was preserved, and the soul might act as it liked.\nWhen my father had got so far, what a blaze of light did the accounts of the Caesarean section, and of the towering geniuses who had come safe into the world by it, cast upon this hypothesis?\n'Here you see,' he would say, 'there was no injury done; no pressure of the head against the pelvis; no propulsion of the cerebrum - and pray, what were the happy consequences? Why, Sir, Julius Caesar, who gave the operation a name; and Hermes Trismegistus, Scipio Africanus, and our Edward the Sixth, who, had he lived, would have done honour to the hypothesis. These, and many more famous men, all came sideways, Sir, into the world.'\nThe incision of the uterus ran for six weeks in my father's head; he had read that wounds in the abdomen were not mortal, so that the belly of the mother might be opened extremely well to give a passage to the child.\nHe mentioned this one afternoon to my mother, - merely as a matter of fact; but seeing her turn as pale as ashes at the very mention of it, he thought it as well to say no more, contenting himself with admiring it in silence.\nThis was my father Mr. Shandy's hypothesis; concerning which I have only to add, that my brother Bobby did as much honour to it as any one of the great heroes we spoke of. For happening to be born when my father was at Epsom, - being moreover my mother's first child, coming into the world head foremost, and turning out afterwards a lad of wonderful slowness, - my father was confirmed in his opinion: and as he had failed at one end, he was determined to try the other.\nThis was not to be expected from the midwife, - and was therefore one of my father's reasons in favour of a man of science, whom he could better deal with.\nOf all men in the world, Dr. Slop was the fittest for my father's purpose; for though this new-invented forceps was, he maintained, the safest instrument of deliverance, yet, it seems, he had scattered a word or two in his book, in favour of extracting the baby by its feet; though not for the soul's good, but for reasons merely obstetrical.\nThis will account for the coalition betwixt my father and Dr. Slop in the ensuing discourse, which went a little hard against my uncle Toby. How a plain man could bear up against two such allies in science, is hard to conceive.\nYou may conjecture upon it, if you please, - and whilst your imagination is in motion, you may encourage it to discover how my uncle Toby got his modesty by the wound upon his groin. You may try to account for the loss of my nose by marriage-articles, and show the world how I could have the misfortune to be called Tristram, in opposition to my father's hypothesis, and the wishes of the whole family.\nThese, with fifty other points left yet unravelled, you may endeavour to solve; but I tell you now it will be in vain, for you will not come within a league of the truth.\nThe reader must wait for a full explanation of these matters till next year, when a series of events will be laid open which he little expects.",
        "paragraph_chars": [
            [
                0,
                115
            ],
            [
                115,
                428
            ],
            [
                428,
                604
            ],
            [
                604,
                1006
            ],
            [
                1006,
                1109
            ],
            [
                1109,
                1443
            ],
            [
                1443,
                1626
            ],
            [
                1626,
                1957
            ],
            [
                1957,
                2262
            ],
            [
                2262,
                2331
            ],
            [
                2331,
                2427
            ],
            [
                2427,
                2701
            ],
            [
                2701,
                3054
            ],
            [
                3054,
                3216
            ],
            [
                3216,
                3255
            ],
            [
                3255,
                3330
            ],
            [
                3330,
                3485
            ],
            [
                3485,
                3865
            ],
            [
                3865,
                4442
            ],
            [
                4442,
                4665
            ],
            [
                4665,
                5054
            ],
            [
                5054,
                5312
            ],
            [
                5312,
                5473
            ],
            [
                5473,
                5843
            ],
            [
                5843,
                5872
            ],
            [
                5872,
                6397
            ],
            [
                6397,
                6521
            ],
            [
                6521,
                6697
            ],
            [
                6697,
                6896
            ],
            [
                6896,
                7139
            ],
            [
                7139,
                7350
            ],
            [
                7350,
                7485
            ],
            [
                7485,
                7709
            ],
            [
                7709,
                8202
            ],
            [
                8202,
                8394
            ],
            [
                8394,
                8831
            ],
            [
                8831,
                9048
            ],
            [
                9048,
                9274
            ],
            [
                9274,
                9746
            ],
            [
                9746,
                9902
            ],
            [
                9902,
                10245
            ],
            [
                10245,
                10473
            ],
            [
                10473,
                10876
            ],
            [
                10876,
                11047
            ],
            [
                11047,
                11190
            ]
        ],
        "segment_chars": [
            [
                0,
                115
            ],
            [
                115,
                336
            ],
            [
                336,
                428
            ],
            [
                428,
                604
            ],
            [
                604,
                815
            ],
            [
                815,
                1006
            ],
            [
                1006,
                1109
            ],
            [
                1109,
                1203
            ],
            [
                1203,
                1443
            ],
            [
                1443,
                1626
            ],
            [
                1626,
                1665
            ],
            [
                1665,
                1671
            ],
            [
                1671,
                1766
            ],
            [
                1766,
                1788
            ],
            [
                1788,
                1814
            ],
            [
                1814,
                1836
            ],
            [
                1836,
                1858
            ],
            [
                1858,
                1880
            ],
            [
                1880,
                1957
            ],
            [
                1957,
                2262
            ],
            [
                2262,
                2331
            ],
            [
                2331,
                2427
            ],
            [
                2427,
                2637
            ],
            [
                2637,
                2701
            ],
            [
                2701,
                2716
            ],
            [
                2716,
                2860
            ],
            [
                2860,
                3054
            ],
            [
                3054,
                3216
            ],
            [
                3216,
                3255
            ],
            [
                3255,
                3330
            ],
            [
                3330,
                3485
            ],
            [
                3485,
                3813
            ],
            [
                3813,
                3865
            ],
            [
                3865,
                4442
            ],
            [
                4442,
                4656
            ],
            [
                4656,
                4665
            ],
            [
                4665,
                4905
            ],
            [
                4905,
                5054
            ],
            [
                5054,
                5312
            ],
            [
                5312,
                5370
            ],
            [
                5370,
                5473
            ],
            [
                5473,
                5843
            ],
            [
                5843,
                5872
            ],
            [
                5872,
                6397
            ],
            [
                6397,
                6409
            ],
            [
                6409,
                6521
            ],
            [
                6521,
                6697
            ],
            [
                6697,
                6717
            ],
            [
                6717,
                6772
            ],
            [
                6772,
                6896
            ],
            [
                6896,
                7139
            ],
            [
                7139,
                7153
            ],
            [
                7153,
                7238
            ],
            [
                7238,
                7350
            ],
            [
                7350,
                7485
            ],
            [
                7485,
                7709
            ],
            [
                7709,
                7793
            ],
            [
                7793,
                8202
            ],
            [
                8202,
                8394
            ],
            [
                8394,
                8571
            ],
            [
                8571,
                8757
            ],
            [
                8757,
                8831
            ],
            [
                8831,
                9048
            ],
            [
                9048,
                9274
            ],
            [
                9274,
                9446
            ],
            [
                9446,
                9746
            ],
            [
                9746,
                9902
            ],
            [
                9902,
                10245
            ],
            [
                10245,
                10386
            ],
            [
                10386,
                10473
            ],
            [
                10473,
                10656
            ],
            [
                10656,
                10876
            ],
            [
                10876,
                11047
            ],
            [
                11047,
                11190
            ]
        ],
        "overlap_chars": [
            [
                0,
                56
            ],
            [
                57,
                84
            ],
            [
                85,
                115
            ],
            [
                115,
                187
            ],
            [
                190,
                253
            ],
            [
                254,
                263
            ],
            [
                264,
                268
            ],
            [
                269,
                288
            ],
            [
                288,
                336
            ],
            [
                336,
                343
            ],
            [
                344,
                348
            ],
            [
                352,
                356
            ],
            [
                362,
                428
            ],
            [
                428,
                459
            ],
            [
                460,
                509
            ],
            [
                514,
                534
            ],
            [
                535,
                539
            ],
            [
                540,
                572
            ],
            [
                573,
                604
            ],
            [
                604,
                616
            ],
            [
                617,
                640
            ],
            [
                641,
                646
            ],
            [
                647,
                648
            ],
            [
                649,
                662
            ],
            [
                671,
                673
            ],
            [
                674,
                685
            ],
            [
                694,
                701
            ],
            [
                708,
                717
            ],
            [
                718,
                724
            ],
            [
                725,
                728
            ],
            [
                734,
                737
            ],
            [
                738,
                742
            ],
            [
                752,
                756
            ],
            [
                760,
                763
            ],
            [
                769,
                815
            ],
            [
                815,
                871
            ],
            [
                872,
                885
            ],
            [
                886,
                921
            ],
            [
                921,
                922
            ],
            [
                928,
                930
            ],
            [
                939,
                943
            ],
            [
                944,
                965
            ],
            [
                966,
                968
            ],
            [
                968,
                969
            ],
            [
                970,
                1004
            ],
            [
                1004,
                1006
            ],
            [
                1006,
                1021
            ],
            [
                1026,
                1073
            ],
            [
                1074,
                1107
            ],
            [
                1107,
                1108
            ],
            [
                1109,
                1163
            ],
            [
                1169,
                1188
            ],
            [
                1192,
                1201
            ],
            [
                1201,
                1203
            ],
            [
                1203,
                1218
            ],
            [
                1220,
                1244
            ],
            [
                1245,
                1250
            ],
            [
                1251,
                1266
            ],
            [
                1271,
                1310
            ],
            [
                1311,
                1373
            ],
            [
                1374,
                1428
            ],
            [
                1429,
                1443
            ],
            [
                1443,
                1476
            ],
            [
                1481,
                1483
            ],
            [
                1492,
                1494
            ],
            [
                1495,
                1499
            ],
            [
                1505,
                1559
            ],
            [
                1562,
                1574
            ],
            [
                1575,
                1593
            ],
            [
                1594,
                1610
            ],
            [
                1611,
                1615
            ],
            [
                1624,
                1626
            ],
            [
                1626,
                1639
            ],
            [
                1641,
                1656
            ],
            [
                1657,
                1665
            ],
            [
                1665,
                1668
            ],
            [
                1671,
                1684
            ],
            [
                1691,
                1694
            ],
            [
                1695,
                1707
            ],
            [
                1713,
                1716
            ],
            [
                1717,
                1727
            ],
            [
                1727,
                1766
            ],
            [
                1769,
                1779
            ],
            [
                1780,
                1786
            ],
            [
                1786,
                1788
            ],
            [
                1788,
                1814
            ],
            [
                1818,
                1821
            ],
            [
                1822,
                1824
            ],
            [
                1825,
                1836
            ],
            [
                1836,
                1856
            ],
            [
                1856,
                1858
            ],
            [
                1858,
                1861
            ],
            [
                1866,
                1880
            ],
            [
                1880,
                1896
            ],
            [
                1897,
                1909
            ],
            [
                1909,
                1910
            ],
            [
                1911,
                1931
            ],
            [
                1932,
                1957
            ],
            [
                1963,
                1971
            ],
            [
                1974,
                1987
            ],
            [
                1988,
                1989
            ],
            [
                2004,
                2017
            ],
            [
                2018,
                2027
            ],
            [
                2028,
                2034
            ],
            [
                2035,
                2062
            ],
            [
                2065,
                2106
            ],
            [
                2109,
                2118
            ],
            [
                2120,
                2166
            ],
            [
                2170,
                2175
            ],
            [
                2176,
                2185
            ],
            [
                2194,
                2214
            ],
            [
                2215,
                2259
            ],
            [
                2262,
                2266
            ],
            [
                2273,
                2329
            ],
            [
                2333,
                2427
            ],
            [
                2427,
                2517
            ],
            [
                2518,
                2521
            ],
            [
                2522,
                2528
            ],
            [
                2529,
                2539
            ],
            [
                2552,
                2565
            ],
            [
                2567,
                2568
            ],
            [
                2569,
                2582
            ],
            [
                2601,
                2606
            ],
            [
                2607,
                2609
            ],
            [
                2610,
                2635
            ],
            [
                2635,
                2637
            ],
            [
                2639,
                2648
            ],
            [
                2657,
                2665
            ],
            [
                2666,
                2669
            ],
            [
                2670,
                2689
            ],
            [
                2694,
                2699
            ],
            [
                2699,
                2700
            ],
            [
                2702,
                2713
            ],
            [
                2716,
                2779
            ],
            [
                2780,
                2785
            ],
            [
                2794,
                2819
            ],
            [
                2825,
                2835
            ],
            [
                2836,
                2844
            ],
            [
                2846,
                2857
            ],
            [
                2860,
                2883
            ],
            [
                2883,
                2884
            ],
            [
                2886,
                2960
            ],
            [
                2961,
                2976
            ],
            [
                2977,
                2993
            ],
            [
                2994,
                3008
            ],
            [
                3031,
                3051
            ],
            [
                3054,
                3112
            ],
            [
                3113,
                3137
            ],
            [
                3138,
                3166
            ],
            [
                3167,
                3176
            ],
            [
                3177,
                3193
            ],
            [
                3198,
                3214
            ],
            [
                3214,
                3216
            ],
            [
                3216,
                3225
            ],
            [
                3237,
                3246
            ],
            [
                3247,
                3255
            ],
            [
                3255,
                3260
            ],
            [
                3260,
                3294
            ],
            [
                3295,
                3328
            ],
            [
                3330,
                3338
            ],
            [
                3339,
                3365
            ],
            [
                3372,
                3391
            ],
            [
                3399,
                3407
            ],
            [
                3413,
                3451
            ],
            [
                3456,
                3465
            ],
            [
                3466,
                3472
            ],
            [
                3481,
                3485
            ],
            [
                3485,
                3489
            ],
            [
                3490,
                3515
            ],
            [
                3516,
                3535
            ],
            [
                3536,
                3542
            ],
            [
                3543,
                3555
            ],
            [
                3556,
                3623
            ],
            [
                3633,
                3637
            ],
            [
                3642,
                3680
            ],
            [
                3686,
                3709
            ],
            [
                3710,
                3735
            ],
            [
                3736,
                3789
            ],
            [
                3790,
                3811
            ],
            [
                3813,
                3819
            ],
            [
                3860,
                3863
            ],
            [
                3863,
                3865
            ],
            [
                3865,
                3890
            ],
            [
                3901,
                3905
            ],
            [
                3915,
                3936
            ],
            [
                3937,
                3947
            ],
            [
                3948,
                3981
            ],
            [
                3982,
                3988
            ],
            [
                3989,
                4008
            ],
            [
                4015,
                4016
            ],
            [
                4017,
                4054
            ],
            [
                4066,
                4073
            ],
            [
                4074,
                4080
            ],
            [
                4081,
                4093
            ],
            [
                4099,
                4100
            ],
            [
                4101,
                4114
            ],
            [
                4126,
                4135
            ],
            [
                4143,
                4170
            ],
            [
                4170,
                4200
            ],
            [
                4201,
                4203
            ],
            [
                4203,
                4205
            ],
            [
                4214,
                4217
            ],
            [
                4218,
                4225
            ],
            [
                4226,
                4228
            ],
            [
                4232,
                4256
            ],
            [
                4257,
                4263
            ],
            [
                4263,
                4322
            ],
            [
                4323,
                4355
            ],
            [
                4356,
                4360
            ],
            [
                4368,
                4380
            ],
            [
                4392,
                4442
            ],
            [
                4442,
                4466
            ],
            [
                4466,
                4607
            ],
            [
                4608,
                4612
            ],
            [
                4623,
                4656
            ],
            [
                4656,
                4665
            ],
            [
                4665,
                4676
            ],
            [
                4677,
                4693
            ],
            [
                4694,
                4714
            ],
            [
                4715,
                4720
            ],
            [
                4720,
                4731
            ],
            [
                4732,
                4740
            ],
            [
                4741,
                4750
            ],
            [
                4750,
                4751
            ],
            [
                4759,
                4780
            ],
            [
                4781,
                4809
            ],
            [
                4810,
                4827
            ],
            [
                4828,
                4839
            ],
            [
                4840,
                4844
            ],
            [
                4844,
                4845
            ],
            [
                4846,
                4861
            ],
            [
                4866,
                4878
            ],
            [
                4891,
                4903
            ],
            [
                4905,
                4930
            ],
            [
                4931,
                4934
            ],
            [
                4935,
                4957
            ],
            [
                4972,
                4977
            ],
            [
                4978,
                4998
            ],
            [
                4999,
                5027
            ],
            [
                5028,
                5040
            ],
            [
                5041,
                5048
            ],
            [
                5052,
                5054
            ],
            [
                5054,
                5081
            ],
            [
                5094,
                5120
            ],
            [
                5121,
                5124
            ],
            [
                5125,
                5144
            ],
            [
                5145,
                5162
            ],
            [
                5162,
                5163
            ],
            [
                5169,
                5170
            ],
            [
                5171,
                5197
            ],
            [
                5198,
                5203
            ],
            [
                5204,
                5215
            ],
            [
                5216,
                5242
            ],
            [
                5243,
                5253
            ],
            [
                5263,
                5296
            ],
            [
                5297,
                5312
            ],
            [
                5312,
                5368
            ],
            [
                5368,
                5370
            ],
            [
                5372,
                5426
            ],
            [
                5427,
                5435
            ],
            [
                5436,
                5471
            ],
            [
                5471,
                5473
            ],
            [
                5473,
                5486
            ],
            [
                5487,
                5538
            ],
            [
                5549,
                5565
            ],
            [
                5566,
                5569
            ],
            [
                5570,
                5572
            ],
            [
                5583,
                5584
            ],
            [
                5585,
                5594
            ],
            [
                5599,
                5601
            ],
            [
                5611,
                5666
            ],
            [
                5667,
                5675
            ],
            [
                5682,
                5706
            ],
            [
                5707,
                5733
            ],
            [
                5734,
                5752
            ],
            [
                5760,
                5827
            ],
            [
                5833,
                5843
            ],
            [
                5845,
                5872
            ],
            [
                5872,
                5936
            ],
            [
                5937,
                5945
            ],
            [
                5952,
                5986
            ],
            [
                5987,
                6000
            ],
            [
                6001,
                6009
            ],
            [
                6010,
                6041
            ],
            [
                6042,
                6044
            ],
            [
                6051,
                6060
            ],
            [
                6061,
                6145
            ],
            [
                6146,
                6182
            ],
            [
                6183,
                6213
            ],
            [
                6213,
                6214
            ],
            [
                6217,
                6219
            ],
            [
                6220,
                6222
            ],
            [
                6223,
                6231
            ],
            [
                6232,
                6242
            ],
            [
                6249,
                6263
            ],
            [
                6272,
                6321
            ],
            [
                6324,
                6369
            ],
            [
                6370,
                6378
            ],
            [
                6379,
                6388
            ],
            [
                6393,
                6396
            ],
            [
                6398,
                6406
            ],
            [
                6409,
                6425
            ],
            [
                6427,
                6431
            ],
            [
                6438,
                6463
            ],
            [
                6470,
                6476
            ],
            [
                6477,
                6518
            ],
            [
                6521,
                6583
            ],
            [
                6584,
                6599
            ],
            [
                6600,
                6673
            ],
            [
                6674,
                6681
            ],
            [
                6682,
                6696
            ],
            [
                6698,
                6704
            ],
            [
                6705,
                6714
            ],
            [
                6717,
                6733
            ],
            [
                6737,
                6772
            ],
            [
                6772,
                6808
            ],
            [
                6809,
                6817
            ],
            [
                6817,
                6857
            ],
            [
                6858,
                6872
            ],
            [
                6873,
                6876
            ],
            [
                6877,
                6893
            ],
            [
                6896,
                6899
            ],
            [
                6900,
                6922
            ],
            [
                6931,
                7041
            ],
            [
                7044,
                7048
            ],
            [
                7054,
                7068
            ],
            [
                7069,
                7132
            ],
            [
                7140,
                7150
            ],
            [
                7153,
                7162
            ],
            [
                7164,
                7236
            ],
            [
                7236,
                7238
            ],
            [
                7238,
                7314
            ],
            [
                7315,
                7347
            ],
            [
                7350,
                7404
            ],
            [
                7413,
                7424
            ],
            [
                7425,
                7440
            ],
            [
                7441,
                7449
            ],
            [
                7475,
                7477
            ],
            [
                7483,
                7484
            ],
            [
                7485,
                7499
            ],
            [
                7509,
                7513
            ],
            [
                7525,
                7558
            ],
            [
                7570,
                7585
            ],
            [
                7586,
                7592
            ],
            [
                7593,
                7632
            ],
            [
                7633,
                7649
            ],
            [
                7654,
                7708
            ],
            [
                7710,
                7720
            ],
            [
                7723,
                7736
            ],
            [
                7738,
                7790
            ],
            [
                7793,
                7817
            ],
            [
                7818,
                7835
            ],
            [
                7836,
                7838
            ],
            [
                7839,
                7843
            ],
            [
                7844,
                7877
            ],
            [
                7878,
                7886
            ],
            [
                7887,
                7919
            ],
            [
                7920,
                7963
            ],
            [
                7964,
                7968
            ],
            [
                7969,
                7981
            ],
            [
                7981,
                7982
            ],
            [
                7983,
                7989
            ],
            [
                7999,
                8003
            ],
            [
                8004,
                8068
            ],
            [
                8073,
                8074
            ],
            [
                8075,
                8086
            ],
            [
                8087,
                8095
            ],
            [
                8096,
                8104
            ],
            [
                8105,
                8109
            ],
            [
                8110,
                8112
            ],
            [
                8124,
                8127
            ],
            [
                8128,
                8135
            ],
            [
                8136,
                8164
            ],
            [
                8164,
                8169
            ],
            [
                8170,
                8178
            ],
            [
                8179,
                8184
            ],
            [
                8185,
                8191
            ],
            [
                8195,
                8202
            ],
            [
                8202,
                8232
            ],
            [
                8233,
                8278
            ],
            [
                8289,
                8393
            ],
            [
                8395,
                8407
            ],
            [
                8410,
                8423
            ],
            [
                8425,
                8449
            ],
            [
                8449,
                8450
            ],
            [
                8451,
                8494
            ],
            [
                8495,
                8524
            ],
            [
                8527,
                8571
            ],
            [
                8571,
                8580
            ],
            [
                8581,
                8587
            ],
            [
                8594,
                8626
            ],
            [
                8627,
                8630
            ],
            [
                8631,
                8650
            ],
            [
                8650,
                8651
            ],
            [
                8652,
                8668
            ],
            [
                8668,
                8669
            ],
            [
                8674,
                8677
            ],
            [
                8678,
                8684
            ],
            [
                8685,
                8695
            ],
            [
                8696,
                8730
            ],
            [
                8731,
                8755
            ],
            [
                8755,
                8756
            ],
            [
                8757,
                8777
            ],
            [
                8790,
                8798
            ],
            [
                8807,
                8828
            ],
            [
                8831,
                8850
            ],
            [
                8858,
                8875
            ],
            [
                8876,
                8896
            ],
            [
                8897,
                8908
            ],
            [
                8909,
                8927
            ],
            [
                8936,
                8951
            ],
            [
                8951,
                8952
            ],
            [
                8953,
                9047
            ],
            [
                9048,
                9060
            ],
            [
                9066,
                9093
            ],
            [
                9103,
                9187
            ],
            [
                9188,
                9224
            ],
            [
                9224,
                9225
            ],
            [
                9226,
                9258
            ],
            [
                9259,
                9261
            ],
            [
                9272,
                9274
            ],
            [
                9274,
                9296
            ],
            [
                9297,
                9305
            ],
            [
                9306,
                9370
            ],
            [
                9371,
                9376
            ],
            [
                9377,
                9383
            ],
            [
                9389,
                9401
            ],
            [
                9402,
                9444
            ],
            [
                9446,
                9459
            ],
            [
                9460,
                9470
            ],
            [
                9471,
                9492
            ],
            [
                9496,
                9498
            ],
            [
                9498,
                9499
            ],
            [
                9502,
                9528
            ],
            [
                9529,
                9534
            ],
            [
                9535,
                9541
            ],
            [
                9542,
                9563
            ],
            [
                9564,
                9568
            ],
            [
                9577,
                9578
            ],
            [
                9579,
                9624
            ],
            [
                9633,
                9634
            ],
            [
                9637,
                9646
            ],
            [
                9664,
                9709
            ],
            [
                9710,
                9746
            ],
            [
                9746,
                9778
            ],
            [
                9779,
                9782
            ],
            [
                9790,
                9791
            ],
            [
                9794,
                9830
            ],
            [
                9831,
                9902
            ],
            [
                9902,
                9930
            ],
            [
                9931,
                9935
            ],
            [
                9936,
                9976
            ],
            [
                9977,
                10017
            ],
            [
                10017,
                10018
            ],
            [
                10019,
                10032
            ],
            [
                10032,
                10033
            ],
            [
                10034,
                10143
            ],
            [
                10144,
                10154
            ],
            [
                10155,
                10158
            ],
            [
                10164,
                10166
            ],
            [
                10171,
                10175
            ],
            [
                10175,
                10176
            ],
            [
                10184,
                10187
            ],
            [
                10192,
                10207
            ],
            [
                10207,
                10208
            ],
            [
                10209,
                10245
            ],
            [
                10245,
                10306
            ],
            [
                10307,
                10311
            ],
            [
                10312,
                10379
            ],
            [
                10390,
                10401
            ],
            [
                10402,
                10451
            ],
            [
                10452,
                10472
            ],
            [
                10473,
                10515
            ],
            [
                10518,
                10583
            ],
            [
                10584,
                10592
            ],
            [
                10597,
                10605
            ],
            [
                10606,
                10608
            ],
            [
                10608,
                10610
            ],
            [
                10611,
                10639
            ],
            [
                10640,
                10656
            ],
            [
                10656,
                10663
            ],
            [
                10668,
                10724
            ],
            [
                10725,
                10728
            ],
            [
                10734,
                10747
            ],
            [
                10748,
                10749
            ],
            [
                10750,
                10755
            ],
            [
                10756,
                10794
            ],
            [
                10797,
                10847
            ],
            [
                10855,
                10874
            ],
            [
                10874,
                10875
            ],
            [
                10876,
                10954
            ],
            [
                10954,
                10955
            ],
            [
                10956,
                10970
            ],
            [
                10975,
                10998
            ],
            [
                10999,
                11002
            ],
            [
                11008,
                11011
            ],
            [
                11012,
                11047
            ],
            [
                11047,
                11057
            ],
            [
                11063,
                11112
            ],
            [
                11113,
                11123
            ],
            [
                11124,
                11140
            ],
            [
                11148,
                11190
            ]
        ],
        "row_chars": [
            [
                0,
                115
            ],
            [
                115,
                336
            ],
            [
                336,
                428
            ],
            [
                428,
                604
            ],
            [
                604,
                815
            ],
            [
                815,
                1006
            ],
            [
                1006,
                1109
            ],
            [
                1109,
                1109
            ],
            [
                1109,
                1203
            ],
            [
                1203,
                1443
            ],
            [
                1443,
                1626
            ],
            [
                1626,
                1665
            ],
            [
                1665,
                1671
            ],
            [
                1671,
                1766
            ],
            [
                1766,
                1766
            ],
            [
                1766,
                1788
            ],
            [
                1788,
                1814
            ],
            [
                1814,
                1836
            ],
            [
                1836,
                1858
            ],
            [
                1858,
                1880
            ],
            [
                1880,
                1957
            ],
            [
                1957,
                2262
            ],
            [
                2262,
                2427
            ],
            [
                2427,
                2637
            ],
            [
                2637,
                2701
            ],
            [
                2701,
                2716
            ],
            [
                2716,
                2860
            ],
            [
                2860,
                3054
            ],
            [
                3054,
                3216
            ],
            [
                3216,
                3255
            ],
            [
                3255,
                3330
            ],
            [
                3330,
                3485
            ],
            [
                3485,
                3865
            ],
            [
                3865,
                4442
            ],
            [
                4442,
                4656
            ],
            [
                4656,
                4665
            ],
            [
                4665,
                5054
            ],
            [
                5054,
                5312
            ],
            [
                5312,
                5370
            ],
            [
                5370,
                5473
            ],
            [
                5473,
                5843
            ],
            [
                5843,
                5872
            ],
            [
                5872,
                6397
            ],
            [
                6397,
                6409
            ],
            [
                6409,
                6521
            ],
            [
                6521,
                6521
            ],
            [
                6521,
                6697
            ],
            [
                6697,
                6717
            ],
            [
                6717,
                6772
            ],
            [
                6772,
                6896
            ],
            [
                6896,
                7153
            ],
            [
                7153,
                7238
            ],
            [
                7238,
                7350
            ],
            [
                7350,
                7485
            ],
            [
                7485,
                7485
            ],
            [
                7485,
                7709
            ],
            [
                7709,
                7793
            ],
            [
                7793,
                7793
            ],
            [
                7793,
                8202
            ],
            [
                8202,
                8394
            ],
            [
                8394,
                8571
            ],
            [
                8571,
                8831
            ],
            [
                8831,
                9048
            ],
            [
                9048,
                9274
            ],
            [
                9274,
                9746
            ],
            [
                9746,
                9902
            ],
            [
                9902,
                10245
            ],
            [
                10245,
                10386
            ],
            [
                10386,
                10473
            ],
            [
                10473,
                10656
            ],
            [
                10656,
                10876
            ],
            [
                10876,
                11047
            ],
            [
                11047,
                11190
            ],
            [
                11190,
                11190
            ],
            [
                11190,
                11190
            ],
            [
                11190,
                11190
            ],
            [
                11190,
                11190
            ]
        ]
    }
}