{
    "original": {
        "text": "A man's body and his mind, with the utmost reverence to both I speak it, are exactly like a jerkin, and a jerkin's lining; --rumple the one, --you rumple the other. There is one certain exception however in this case, and that is, when you are so fortunate a fellow, as to have had your jerkin made of gum-taffeta, and the body-lining to it of a sarcenet, or thin persian.\n_Zeno_, _Cleanthes_, _Diogenes Babylonius_, _Dionysius_, _Heracleotes_, _Antipater_, _Pantius_, and _Posidonius_ amongst the _Greeks_; ----_Cato_ and _Varro_ and _Seneca_ amongst the _Romans_; ----_Pantonus_ and _Clemens Alexandrinus_ and _Montaigne_ amongst the Christians; and a score and a half of good, honest, unthinking _Shandean_ people as ever lived, whose names I can't recollect, --all pretended that their jerkins were made after this fashion, --you might have rumpled and crumpled, and doubled and creased, and fretted and fridged the outside of them all to pieces; ----in short, you might have played the very devil with them, and at the same time, not one of the insides of them would have been one button the worse, for all you had done to them.\nI believe in my conscience that mine is made up somewhat after this sort: ----for never poor jerkin has been tickled off at such a rate as it has been these last nine months together, ----and yet I declare, the lining to it, ------as far as I am a judge of the matter, ----is not a three-penny piece the worse; --pell-mell, helter-skelter, ding-dong, cut and thrust, back stroke and fore stroke, side way and long way, have they been trimming it for me: --had there been the least gumminess in my lining, --by heaven! it had all of it long ago been frayed and fretted to a thread.\n------You Messrs. the Monthly reviewers! ------how could you cut and slash my jerkin as you did? ----how did you know but you would cut my lining too?\nHeartily and from my soul, to the protection of that Being who will injure none of us, do I recommend you and your affairs, --so God bless you; --only next month, if any one of you should gnash his teeth, and storm and rage at me, as some of you did last MAY (in which I remember the weather was very hot)--don't be exasperated, if I pass it by again with good temper, --being determined as long as I live or write (which in my case means the same thing) never to give the honest gentleman a worse word or a worse wish than my uncle _Toby_ gave the fly which buzz'd about his nose all _dinner-time_, ------\"Go, --go, poor devil,\" quoth he, --\"get thee gone, --why should I hurt thee? This world is surely wide enough to hold both thee and me.\"",
        "paragraph_chars": [
            [
                0,
                373
            ],
            [
                373,
                1134
            ],
            [
                1134,
                1715
            ],
            [
                1715,
                1866
            ],
            [
                1866,
                2609
            ]
        ],
        "segment_chars": [
            [
                0,
                165
            ],
            [
                165,
                373
            ],
            [
                373,
                1134
            ],
            [
                1134,
                1652
            ],
            [
                1652,
                1715
            ],
            [
                1715,
                1756
            ],
            [
                1756,
                1812
            ],
            [
                1812,
                1866
            ],
            [
                1866,
                2550
            ],
            [
                2550,
                2609
            ]
        ],
        "overlap_chars": [
            [
                0,
                25
            ],
            [
                73,
                122
            ],
            [
                125,
                140
            ],
            [
                143,
                165
            ],
            [
                165,
                177
            ],
            [
                186,
                195
            ],
            [
                265,
                266
            ],
            [
                196,
                203
            ],
            [
                216,
                265
            ],
            [
                267,
                277
            ],
            [
                282,
                318
            ],
            [
                328,
                334
            ],
            [
                341,
                343
            ],
            [
                346,
                354
            ],
            [
                371,
                373
            ],
            [
                374,
                378
            ],
            [
                379,
                380
            ],
            [
                382,
                391
            ],
            [
                392,
                393
            ],
            [
                395,
                414
            ],
            [
                415,
                416
            ],
            [
                418,
                427
            ],
            [
                428,
                429
            ],
            [
                431,
                442
            ],
            [
                443,
                444
            ],
            [
                451,
                455
            ],
            [
                486,
                497
            ],
            [
                499,
                505
            ],
            [
                506,
                507
            ],
            [
                456,
                457
            ],
            [
                524,
                529
            ],
            [
                469,
                472
            ],
            [
                536,
                542
            ],
            [
                544,
                555
            ],
            [
                557,
                563
            ],
            [
                564,
                565
            ],
            [
                577,
                579
            ],
            [
                467,
                468
            ],
            [
                586,
                606
            ],
            [
                519,
                522
            ],
            [
                613,
                622
            ],
            [
                624,
                659
            ],
            [
                671,
                698
            ],
            [
                700,
                708
            ],
            [
                710,
                716
            ],
            [
                730,
                762
            ],
            [
                765,
                807
            ],
            [
                814,
                818
            ],
            [
                830,
                865
            ],
            [
                916,
                950
            ],
            [
                965,
                1012
            ],
            [
                1035,
                1057
            ],
            [
                1066,
                1102
            ],
            [
                1132,
                1134
            ],
            [
                1134,
                1143
            ],
            [
                1161,
                1173
            ],
            [
                1388,
                1390
            ],
            [
                1197,
                1201
            ],
            [
                1206,
                1207
            ],
            [
                1212,
                1221
            ],
            [
                1234,
                1237
            ],
            [
                1147,
                1149
            ],
            [
                1222,
                1233
            ],
            [
                1238,
                1307
            ],
            [
                1316,
                1317
            ],
            [
                1421,
                1422
            ],
            [
                1322,
                1340
            ],
            [
                1345,
                1351
            ],
            [
                1407,
                1409
            ],
            [
                1451,
                1500
            ],
            [
                1558,
                1562
            ],
            [
                1553,
                1557
            ],
            [
                1563,
                1587
            ],
            [
                1513,
                1516
            ],
            [
                1590,
                1638
            ],
            [
                1641,
                1652
            ],
            [
                1652,
                1654
            ],
            [
                1678,
                1715
            ],
            [
                1721,
                1724
            ],
            [
                1737,
                1756
            ],
            [
                1762,
                1775
            ],
            [
                1784,
                1812
            ],
            [
                1816,
                1832
            ],
            [
                1837,
                1846
            ],
            [
                1847,
                1866
            ],
            [
                1956,
                1957
            ],
            [
                1866,
                1874
            ],
            [
                1891,
                1892
            ],
            [
                1995,
                2009
            ],
            [
                2029,
                2035
            ],
            [
                2040,
                2053
            ],
            [
                2075,
                2124
            ],
            [
                2135,
                2136
            ],
            [
                2243,
                2253
            ],
            [
                1893,
                1895
            ],
            [
                2217,
                2233
            ],
            [
                1875,
                1878
            ],
            [
                2254,
                2319
            ],
            [
                2321,
                2334
            ],
            [
                2339,
                2368
            ],
            [
                2385,
                2398
            ],
            [
                2208,
                2210
            ],
            [
                2406,
                2429
            ],
            [
                2432,
                2450
            ],
            [
                2458,
                2463
            ],
            [
                2479,
                2493
            ],
            [
                2496,
                2504
            ],
            [
                2526,
                2550
            ],
            [
                2550,
                2563
            ],
            [
                2571,
                2607
            ]
        ],
        "row_chars": [
            [
                0,
                165
            ],
            [
                165,
                373
            ],
            [
                373,
                1134
            ],
            [
                1134,
                1652
            ],
            [
                1652,
                1715
            ],
            [
                1715,
                1756
            ],
            [
                1756,
                1812
            ],
            [
                1812,
                1866
            ],
            [
                1866,
                2550
            ],
            [
                2550,
                2609
            ]
        ]
    },
    "abridged": {
        "text": "A man's body and his mind are exactly like a jerkin, and a jerkin's lining; rumple the one, - you rumple the other. There is one exception, however, and that is, when you are so fortunate a fellow as to have your jerkin made of gum-taffeta, and its lining of sarcenet.\nZeno, Cleanthes, Diogenes Babylonius, Dionysius, Heracleotes, Antipater amongst the Greeks; Cato, Varro and Seneca amongst the Romans; Pantaeonus, Clemens Alexandrinus and Montaigne amongst the Christians; and a score of good, honest, unthinking Shandean people, whose names I can't recollect, - all pretended that their jerkins were made this way; - you might have rumpled and crumpled the outside of them all to pieces; you might have played the very devil with them, yet not one of the insides would have been one button the worse.\nI believe that mine is of this type: for never has my poor jerkin been tickled off at such a rate as it has been these last nine months, - and yet I declare, its lining is intact. Pell-mell, helter-skelter, ding-dong, cut and thrust, they have been trimming it for me: and had there been the least gumminess in my lining, - by heaven! it would have been frayed and fretted to a thread.\nYou Monthly reviewers! how could you slash my jerkin as you did? - how did you know you would not cut my lining too?\nI most heartily say, God bless you; - if any of you should storm and rage at me, as some of you did last May - I am determined to react with good temper; and as long as I live or write (which in my case means the same thing,) never to give an honest gentleman a worse word than my uncle Toby gave the fly which buzzed about his nose all dinner-time.\n- 'Go, poor devil,' quoth he; 'Why should I hurt thee? This world is wide enough to hold both thee and me.'",
        "paragraph_chars": [
            [
                0,
                269
            ],
            [
                269,
                804
            ],
            [
                804,
                1190
            ],
            [
                1190,
                1307
            ],
            [
                1307,
                1657
            ],
            [
                1657,
                1764
            ]
        ],
        "segment_chars": [
            [
                0,
                116
            ],
            [
                116,
                269
            ],
            [
                269,
                804
            ],
            [
                804,
                984
            ],
            [
                984,
                1139
            ],
            [
                1139,
                1190
            ],
            [
                1190,
                1213
            ],
            [
                1213,
                1255
            ],
            [
                1255,
                1307
            ],
            [
                1307,
                1657
            ],
            [
                1657,
                1712
            ],
            [
                1712,
                1764
            ]
        ],
        "overlap_chars": [
            [
                0,
                25
            ],
            [
                26,
                75
            ],
            [
                76,
                91
            ],
            [
                94,
                116
            ],
            [
                116,
                128
            ],
            [
                129,
                138
            ],
            [
                138,
                139
            ],
            [
                140,
                147
            ],
            [
                147,
                196
            ],
            [
                197,
                207
            ],
            [
                208,
                244
            ],
            [
                249,
                255
            ],
            [
                256,
                258
            ],
            [
                259,
                267
            ],
            [
                267,
                269
            ],
            [
                269,
                273
            ],
            [
                273,
                274
            ],
            [
                275,
                284
            ],
            [
                284,
                285
            ],
            [
                286,
                305
            ],
            [
                305,
                306
            ],
            [
                307,
                316
            ],
            [
                316,
                317
            ],
            [
                318,
                329
            ],
            [
                329,
                330
            ],
            [
                336,
                340
            ],
            [
                341,
                352
            ],
            [
                353,
                359
            ],
            [
                359,
                360
            ],
            [
                365,
                366
            ],
            [
                367,
                372
            ],
            [
                373,
                376
            ],
            [
                377,
                383
            ],
            [
                384,
                395
            ],
            [
                396,
                402
            ],
            [
                402,
                403
            ],
            [
                412,
                414
            ],
            [
                414,
                415
            ],
            [
                416,
                436
            ],
            [
                437,
                440
            ],
            [
                441,
                450
            ],
            [
                451,
                486
            ],
            [
                487,
                514
            ],
            [
                515,
                523
            ],
            [
                524,
                530
            ],
            [
                530,
                562
            ],
            [
                565,
                607
            ],
            [
                608,
                612
            ],
            [
                620,
                655
            ],
            [
                656,
                690
            ],
            [
                691,
                738
            ],
            [
                743,
                765
            ],
            [
                766,
                802
            ],
            [
                802,
                804
            ],
            [
                804,
                813
            ],
            [
                814,
                826
            ],
            [
                827,
                829
            ],
            [
                830,
                834
            ],
            [
                839,
                840
            ],
            [
                841,
                850
            ],
            [
                851,
                854
            ],
            [
                855,
                857
            ],
            [
                858,
                869
            ],
            [
                870,
                939
            ],
            [
                939,
                940
            ],
            [
                941,
                942
            ],
            [
                943,
                961
            ],
            [
                966,
                972
            ],
            [
                973,
                975
            ],
            [
                988,
                1037
            ],
            [
                1038,
                1042
            ],
            [
                1043,
                1047
            ],
            [
                1048,
                1072
            ],
            [
                1073,
                1076
            ],
            [
                1077,
                1125
            ],
            [
                1128,
                1139
            ],
            [
                1139,
                1141
            ],
            [
                1153,
                1190
            ],
            [
                1190,
                1193
            ],
            [
                1194,
                1213
            ],
            [
                1213,
                1226
            ],
            [
                1227,
                1255
            ],
            [
                1257,
                1273
            ],
            [
                1274,
                1283
            ],
            [
                1288,
                1307
            ],
            [
                1307,
                1308
            ],
            [
                1314,
                1322
            ],
            [
                1326,
                1327
            ],
            [
                1328,
                1342
            ],
            [
                1345,
                1351
            ],
            [
                1352,
                1365
            ],
            [
                1366,
                1415
            ],
            [
                1418,
                1419
            ],
            [
                1423,
                1433
            ],
            [
                1434,
                1436
            ],
            [
                1443,
                1459
            ],
            [
                1461,
                1464
            ],
            [
                1465,
                1530
            ],
            [
                1533,
                1546
            ],
            [
                1550,
                1579
            ],
            [
                1580,
                1593
            ],
            [
                1596,
                1598
            ],
            [
                1599,
                1622
            ],
            [
                1625,
                1643
            ],
            [
                1650,
                1655
            ],
            [
                1660,
                1674
            ],
            [
                1677,
                1685
            ],
            [
                1688,
                1712
            ],
            [
                1712,
                1725
            ],
            [
                1726,
                1762
            ]
        ],
        "row_chars": [
            [
                0,
                116
            ],
            [
                116,
                269
            ],
            [
                269,
                804
            ],
            [
                804,
                1139
            ],
            [
                1139,
                1190
            ],
            [
                1190,
                1213
            ],
            [
                1213,
                1255
            ],
            [
                1255,
                1307
            ],
            [
                1307,
                1712
            ],
            [
                1712,
                1764
            ]
        ]
    }
}