{
    "original": {
        "text": "\"By the authority of God Almighty, the Father, Son, and Holy Ghost, and of the holy canons, and of the undefiled Virgin _Mary_, mother and patroness of our Saviour.\" I think there is no necessity, quoth Dr. _Slop_, dropping the paper down to his knee, and addressing himself to my father----as you have read it over, Sir, so lately, to read it aloud----and as Captain _Shandy_ seems to have no great inclination to hear it ------I may as well read it to myself. That's contrary to treaty, replied my father: ------besides, there is something so whimsical, especially in the latter part of it, I should grieve to lose the pleasure of a second reading. Dr. _Slop_ did not altogether like it, ------but my uncle _Toby_ offering at that instant to give over whistling, and read it himself to them; ------Dr. _Slop_ thought he might as well read it under the cover of my uncle _Toby's_ whistling------as suffer my uncle _Toby_ to read it alone; ----so raising up the paper to his face, and holding it quite parallel to it, in order to hide his chagrin------he read it aloud as follows--------my uncle _Toby_ whistling _Lillabullero_, though not quite so loud as before.\n------Atque omnium clestium virtutum, angelorum, archangelorum, thronorum, dominationum, potestatuum, cherubin ac seraphin, & sanctorum patriarchum, prophetarum, & omnium apostolorum & evangelistarum, & sanctorum innocentum, qui in conspectu Agni soli digni inventi sunt canticum cantare novum, et sanctorum martyrum et sanctorum confessorum, et sanctarum virginum, atque omnium simul sanctorum et electorum _vel_ os Dei, ----Excommunicamus, et anathematizamus hunc s _vel_ os s furem, vel hunc malefactorem, N. N. et a liminibus sanct Dei _vel_ i n ecclesi sequestramus, et ternis suppliciis excruciandus, mancipetur, cum Dathan et Abiram, et cum his qui dixerunt Domino Deo, Recede nobis, scientiam viarum tuarum nolumus: et _vel_ eorum sicut aqu ignis extinguitur, sic extinguatur lucerna ejus in n n secula seculorum nisi resipuerit, et ad satisfactionem venerit. Amen.\n\"By the authority of God Almighty, the Father, Son, and Holy Ghost, and of the undefiled Virgin _Mary_, mother and patroness of our Saviour, and of all the celestial virtues, angels, archangels, thrones, dominions, powers, cherubins and seraphins, and of all the holy patriarchs, prophets, and of all the apostles and evangelists, and of the holy innocents, who in the sight of the Holy Lamb, are found worthy to sing the new song of the holy martyrs and holy confessors, and of the holy virgins, and of all the saints, together with the holy and elect of God, ----May he\" (_Obadiah_) \"be damn'd\" (for tying these knots)---- \"We excommunicate, and anathematize him, and from the thresholds of the holy church of God Almighty we sequester him, that he may be tormented, disposed, and delivered over with _Dathan_ and _Abiram_, and with those who say unto the Lord God, Depart from us, we desire none of thy ways. And as fire is quenched with water, so let the light of him be put out for evermore, unless it shall repent him\" (_Obadiah_, of the knots which he has tied) \"and make satisfaction\" (for them) \"Amen.\"\nos Maledicat illum Deus Pater qui hominem creavit. Maledicat os os illum Dei Filius qui pro homine passus est. Maledicat illum os Spiritus Sanctus qui in baptismo effusus est. Maledicat illum sancta crux, quam Christus pro nostr salute hostem triumphans ascendit.\n\"May the Father who created man, curse him. ----May the Son who suffered for us, curse him. ----May the Holy Ghost, who was given to us in baptism, curse him (_Obadiah_) ----May the holy cross which Christ, for our salvation triumphing over his enemies, ascended, curse him.\nos Maledicat illum sancta Dei genetrix et perpetua Virgo Maria. os Maledicat illum sanctus Michael, animarum susceptor sacrarum. os Maledicant illum omnes angeli et archangeli, principatus et potestates, omnisque militia clestis.\n\"May the holy and eternal Virgin _Mary_, mother of God, curse him. ------May St. _Michael_, the advocate of holy souls, curse him. ----May all the angels and archangels, principalities and powers, and all the heavenly armies, curse him.\" [Our armies swore terribly in _Flanders_, cried my uncle _Toby_, ------but nothing to this. ------For my own part I could not have a heart to curse my dog so.]\nos Maledicat illum patriarcharum et prophetarum laudabilis os numerus. Maledicat illum sanctus Johannes Prcusor et Baptista Christi, et sanctus Petrus, et sanctus Paulus, atque sanctus Andreas, omnesque Christi apostoli, simul et cteri discipuli, quatuor quoque evangelist, qui sua prdicatione os mundum universum converterunt. Maledicat illum cuneus martyrum et confessorum mirificus, qui Deo bonis operibus placitus inventus est.\n\"May St. John, the Prcursor, and St. John the Baptist, and St. Peter and St. Paul, and St. Andrew, and all other Christ's apostles, together curse him. And may the rest of his disciples and four evangelists, who by their preaching converted the universal world, and may the holy and wonderful company of martyrs and confessors who by their holy works are found pleasing to God Almighty, curse him\" (_Obadiah_).\nos Maledicant illum sacrarum virginum chori, qu mundi vana causa honoris Christi respuenda contempserunt. Maledicant os illum omnes sancti qui ab initio mundi usque in finem seculi Deo dilecti inveniuntur.\nos Maledicant illum cli et terra, et omnia sancta in eis manentia.\n\"May the holy choir of the holy virgins, who for the honour of Christ have despised the things of the world, damn him ----May all the saints, who from the beginning of the world to everlasting ages are found to be beloved of God, damn him ------May the heavens and earth, and all the holy things remaining therein, damn him\" (_Obadiah_) \"or her\" (or whoever else had a hand in tying these knots).\ni n n Maledictus sit ubicunque fuerit, sive in domo, sive in agro, sive in vi, sive in semit, sive in silv, sive in aqu, sive in ecclesi.\ni n Maledictus sit vivendo, moriendo, ---------------------------- ------ ------ ------ ------ ------ ------ ------ ------ ------ manducando, bibendo, esuriendo, sitiendo, jejunando, dormitando, dormiendo, vigilando, ambulando, stando, sedendo, jacendo, operando, quiescendo, mingendo, cacando, flebotomando.\n\"May he (_Obadiah_) be damn'd wherever he be----whether in the house or the stables, the garden or the field, or the highway, or in the path, or in the wood, or in the water, or in the church. ----May he be cursed in living, in dying.\" [Here my uncle _Toby_, taking the advantage of a _minim_ in the second bar of his tune, kept whistling one continued note to the end of the sentence. ----Dr. _Slop_, with his division of curses moving under him, like a running bass all the way.] \"May he be cursed in eating, and drinking, in being hungry, in being thirsty, in fasting, in sleeping, in slumbering, in walking, in standing, in sitting, in lying, in working, in resting, in pissing, in shitting, and in blood-letting!\"\ni n Maledictus sit in totis viribus corporis,\n\"May he\" (_Obadiah_) \"be cursed in all the faculties of his body!\ni n Maledictus sit intus et exterius.\ni n i n i Maledictus sit in capillis; maledictus sit in cerebro. Maledictus n sit in vertice, in temporibus, in fronte, in auriculis, in superciliis, in oculis, in genis, in maxillis, in naribus, in dentibus, mordacibus, sive molaribus, in labiis, in guttere, in humeris, in harnis, in brachiis, in manubus, in digitis, in pectore, in corde, et in omnibus interioribus stomacho tenus, in renibus, in inguinibus, in femore, in genitalibus, in coxis, in genubus, in cruribus, in pedibus, et in inguibus.\n\"May he be cursed inwardly and outwardly! ------May he be cursed in the hair of his head! ----May he be cursed in his brains, and in his vertex\" (that is a sad curse, quoth my father), \"in his temples, in his forehead, in his ears, in his eye-brows, in his cheeks, in his jaw-bones, in his nostrils, in his fore-teeth and grinders, in his lips, in his throat, in his shoulders, in his wrists, in his arms, in his hands, in his fingers!\n\"May he be damn'd in his mouth, in his breast, in his heart and purtenance, down to the very stomach!\n\"May he be cursed in his reins, and in his groin\" (God in heaven forbid! quoth my uncle _Toby_), \"in his thighs, in his genitals\" (my father shook his head), \"and in his hips, and in his knees, his legs, and feet, and toe-nails!\nMaledictus sit in totis compagibus membrorum, a vertice capitis, usque ad plantam pedis--non sit in eo sanitas.\n\"May he be cursed in all the joints and articulations of his members, from the top of his head to the sole of his foot! May there be no soundness in him!\nMaledicat illum Christus Filius Dei vivi toto su majestatis imperio.----\n\"May the Son of the living God, with all the glory of his Majesty\" ----[Here my uncle _Toby_, throwing back his head, gave a monstrous, long, loud Whew--w--w--------something betwixt the interjectional whistle of _Hay-day!_ and the word itself.------\n----By the golden beard of _Jupiter_--and of _Juno_ (if her majesty wore one) and by the beards of the rest of your heathen worships, which by the bye was no small number, since what with the beards of your celestial gods, and gods aerial and aquatick--to say nothing of the beards of town-gods and country-gods, or of the celestial goddesses your wives, or of the infernal goddesses your whores and concubines (that is in case they wore them)------all which beards, as _Varro_ tells me, upon his word and honour, when mustered up together, made no less than thirty thousand effective beards upon the Pagan establishment; ----every beard of which claimed the rights and privileges of being stroken and sworn by--by all these beards together then ----I vow and protest, that of the two bad cassocks I am worth in the world, I would have given the better of them, as freely as ever _Cid Hamet_ offered his----to have stood by, and heard my uncle _Toby's_ accompanyment.]\n----et insurgat adversus illum clum cum omnibus virtutibus qu in eo moventur ad _damnandum_ eum, nisi penituerit et ad satisfactionem venerit. Amen. Fiat, fiat. Amen.\n----\"curse him!\" continued Dr. _Slop_, --\"and may heaven, with all the powers which move therein, rise up against him, curse and damn him\" (_Obadiah_) \"unless he repent and make satisfaction! Amen. So be it, --so be it. Amen.\"\nI declare, quoth my uncle _Toby_, my heart would not let me curse the devil himself with so much bitterness. --He is the father of curses, replied Dr. _Slop_. ----So am not I, replied my uncle. ----But he is cursed, and damn'd already, to all eternity, replied Dr. _Slop_.\nI am sorry for it, quoth my uncle _Toby_.\nDr. _Slop_ drew up his mouth, and was just beginning to return my uncle _Toby_ the compliment of his Whu--u--u--or interjectional whistle----when the door hastily opening in the next chapter but one----put an end to the affair.\n[Footnote 3.2: As the genuineness of the consultation of the _Sorbonne_ upon the question of baptism, was doubted by some, and denied by others----'twas thought proper to print the original of this excommunication; for the copy of which Mr. _Shandy_ returns thanks to the chapter clerk of the dean and chapter of _Rochester_.]",
        "paragraph_chars": [
            [
                0,
                1165
            ],
            [
                1165,
                2039
            ],
            [
                2039,
                3151
            ],
            [
                3151,
                3415
            ],
            [
                3415,
                3690
            ],
            [
                3690,
                3920
            ],
            [
                3920,
                4318
            ],
            [
                4318,
                4750
            ],
            [
                4750,
                5161
            ],
            [
                5161,
                5367
            ],
            [
                5367,
                5434
            ],
            [
                5434,
                5831
            ],
            [
                5831,
                5969
            ],
            [
                5969,
                6278
            ],
            [
                6278,
                6997
            ],
            [
                6997,
                7043
            ],
            [
                7043,
                7109
            ],
            [
                7109,
                7147
            ],
            [
                7147,
                7649
            ],
            [
                7649,
                8085
            ],
            [
                8085,
                8187
            ],
            [
                8187,
                8416
            ],
            [
                8416,
                8528
            ],
            [
                8528,
                8682
            ],
            [
                8682,
                8755
            ],
            [
                8755,
                9006
            ],
            [
                9006,
                9975
            ],
            [
                9975,
                10142
            ],
            [
                10142,
                10369
            ],
            [
                10369,
                10642
            ],
            [
                10642,
                10684
            ],
            [
                10684,
                10912
            ],
            [
                10912,
                11238
            ]
        ],
        "segment_chars": [
            [
                0,
                166
            ],
            [
                166,
                462
            ],
            [
                462,
                651
            ],
            [
                651,
                1165
            ],
            [
                1165,
                2033
            ],
            [
                2033,
                2039
            ],
            [
                2039,
                2951
            ],
            [
                2951,
                3151
            ],
            [
                3151,
                3202
            ],
            [
                3202,
                3262
            ],
            [
                3262,
                3327
            ],
            [
                3327,
                3415
            ],
            [
                3415,
                3459
            ],
            [
                3459,
                3507
            ],
            [
                3507,
                3690
            ],
            [
                3690,
                3754
            ],
            [
                3754,
                3819
            ],
            [
                3819,
                3920
            ],
            [
                3920,
                3987
            ],
            [
                3987,
                4051
            ],
            [
                4051,
                4158
            ],
            [
                4158,
                4250
            ],
            [
                4250,
                4318
            ],
            [
                4318,
                4389
            ],
            [
                4389,
                4646
            ],
            [
                4646,
                4750
            ],
            [
                4750,
                4902
            ],
            [
                4902,
                5161
            ],
            [
                5161,
                5267
            ],
            [
                5267,
                5367
            ],
            [
                5367,
                5434
            ],
            [
                5434,
                5831
            ],
            [
                5831,
                5969
            ],
            [
                5969,
                6278
            ],
            [
                6278,
                6471
            ],
            [
                6471,
                6514
            ],
            [
                6514,
                6664
            ],
            [
                6664,
                6760
            ],
            [
                6760,
                6997
            ],
            [
                6997,
                7043
            ],
            [
                7043,
                7109
            ],
            [
                7109,
                7147
            ],
            [
                7147,
                7212
            ],
            [
                7212,
                7649
            ],
            [
                7649,
                7691
            ],
            [
                7691,
                7739
            ],
            [
                7739,
                8085
            ],
            [
                8085,
                8187
            ],
            [
                8187,
                8260
            ],
            [
                8260,
                8416
            ],
            [
                8416,
                8528
            ],
            [
                8528,
                8648
            ],
            [
                8648,
                8682
            ],
            [
                8682,
                8755
            ],
            [
                8755,
                9006
            ],
            [
                9006,
                9975
            ],
            [
                9975,
                10118
            ],
            [
                10118,
                10124
            ],
            [
                10124,
                10136
            ],
            [
                10136,
                10142
            ],
            [
                10142,
                10159
            ],
            [
                10159,
                10334
            ],
            [
                10334,
                10340
            ],
            [
                10340,
                10362
            ],
            [
                10362,
                10369
            ],
            [
                10369,
                10478
            ],
            [
                10478,
                10528
            ],
            [
                10528,
                10563
            ],
            [
                10563,
                10642
            ],
            [
                10642,
                10684
            ],
            [
                10684,
                10912
            ],
            [
                10912,
                11238
            ]
        ],
        "overlap_chars": [
            [
                1,
                119
            ],
            [
                126,
                134
            ],
            [
                149,
                166
            ],
            [
                166,
                185
            ],
            [
                333,
                340
            ],
            [
                344,
                349
            ],
            [
                197,
                206
            ],
            [
                208,
                212
            ],
            [
                275,
                287
            ],
            [
                213,
                233
            ],
            [
                239,
                251
            ],
            [
                291,
                310
            ],
            [
                322,
                332
            ],
            [
                317,
                320
            ],
            [
                460,
                461
            ],
            [
                429,
                460
            ],
            [
                489,
                506
            ],
            [
                523,
                601
            ],
            [
                633,
                649
            ],
            [
                651,
                654
            ],
            [
                656,
                660
            ],
            [
                662,
                688
            ],
            [
                792,
                793
            ],
            [
                696,
                699
            ],
            [
                700,
                708
            ],
            [
                785,
                787
            ],
            [
                741,
                784
            ],
            [
                688,
                689
            ],
            [
                800,
                803
            ],
            [
                805,
                809
            ],
            [
                811,
                871
            ],
            [
                877,
                879
            ],
            [
                881,
                890
            ],
            [
                938,
                939
            ],
            [
                944,
                954
            ],
            [
                958,
                979
            ],
            [
                1027,
                1046
            ],
            [
                979,
                980
            ],
            [
                1052,
                1079
            ],
            [
                1016,
                1017
            ],
            [
                906,
                914
            ],
            [
                922,
                924
            ],
            [
                1103,
                1112
            ],
            [
                1114,
                1126
            ],
            [
                1127,
                1165
            ],
            [
                2040,
                2134
            ],
            [
                2141,
                2149
            ],
            [
                2164,
                2204
            ],
            [
                2214,
                2328
            ],
            [
                2344,
                2396
            ],
            [
                2150,
                2153
            ],
            [
                2543,
                2557
            ],
            [
                2604,
                2610
            ],
            [
                2614,
                2621
            ],
            [
                2622,
                2623
            ],
            [
                2625,
                2627
            ],
            [
                2636,
                2658
            ],
            [
                2665,
                2681
            ],
            [
                2700,
                2806
            ],
            [
                2818,
                2841
            ],
            [
                2874,
                2883
            ],
            [
                2893,
                2905
            ],
            [
                2949,
                2951
            ],
            [
                2951,
                3042
            ],
            [
                3046,
                3058
            ],
            [
                3132,
                3133
            ],
            [
                3066,
                3073
            ],
            [
                3074,
                3106
            ],
            [
                3144,
                3148
            ],
            [
                3416,
                3459
            ],
            [
                3463,
                3507
            ],
            [
                3511,
                3572
            ],
            [
                3575,
                3582
            ],
            [
                3589,
                3620
            ],
            [
                3669,
                3690
            ],
            [
                3921,
                3952
            ],
            [
                3959,
                3987
            ],
            [
                4055,
                4088
            ],
            [
                4115,
                4157
            ],
            [
                4159,
                4187
            ],
            [
                4200,
                4214
            ],
            [
                4241,
                4243
            ],
            [
                4198,
                4199
            ],
            [
                4229,
                4232
            ],
            [
                4244,
                4250
            ],
            [
                4272,
                4283
            ],
            [
                4300,
                4315
            ],
            [
                4751,
                4763
            ],
            [
                4805,
                4856
            ],
            [
                4863,
                4880
            ],
            [
                4891,
                4902
            ],
            [
                4902,
                4913
            ],
            [
                4926,
                4939
            ],
            [
                4945,
                4994
            ],
            [
                5005,
                5028
            ],
            [
                5043,
                5080
            ],
            [
                5101,
                5146
            ],
            [
                5150,
                5157
            ],
            [
                5158,
                5161
            ],
            [
                5435,
                5456
            ],
            [
                5466,
                5551
            ],
            [
                5556,
                5574
            ],
            [
                5648,
                5672
            ],
            [
                5679,
                5729
            ],
            [
                5740,
                5757
            ],
            [
                5780,
                5781
            ],
            [
                5761,
                5768
            ],
            [
                5828,
                5831
            ],
            [
                6279,
                6285
            ],
            [
                6288,
                6295
            ],
            [
                6296,
                6300
            ],
            [
                6308,
                6322
            ],
            [
                6326,
                6403
            ],
            [
                6410,
                6419
            ],
            [
                6423,
                6438
            ],
            [
                6442,
                6471
            ],
            [
                6475,
                6513
            ],
            [
                6514,
                6528
            ],
            [
                6602,
                6620
            ],
            [
                6631,
                6662
            ],
            [
                6680,
                6684
            ],
            [
                6668,
                6671
            ],
            [
                6673,
                6677
            ],
            [
                6726,
                6759
            ],
            [
                6761,
                6788
            ],
            [
                6863,
                6865
            ],
            [
                6793,
                6861
            ],
            [
                6876,
                6997
            ],
            [
                7044,
                7050
            ],
            [
                7054,
                7061
            ],
            [
                7062,
                7063
            ],
            [
                7065,
                7109
            ],
            [
                7697,
                7739
            ],
            [
                7743,
                7774
            ],
            [
                7835,
                8085
            ],
            [
                8086,
                8095
            ],
            [
                8103,
                8148
            ],
            [
                8178,
                8187
            ],
            [
                8188,
                8211
            ],
            [
                8230,
                8235
            ],
            [
                8238,
                8241
            ],
            [
                8252,
                8258
            ],
            [
                8260,
                8274
            ],
            [
                8285,
                8315
            ],
            [
                8318,
                8342
            ],
            [
                8345,
                8362
            ],
            [
                8370,
                8416
            ],
            [
                8756,
                8821
            ],
            [
                8826,
                8840
            ],
            [
                9259,
                9261
            ],
            [
                9927,
                9929
            ],
            [
                8847,
                8906
            ],
            [
                8972,
                8973
            ],
            [
                8908,
                8909
            ],
            [
                8911,
                8912
            ],
            [
                8998,
                8999
            ],
            [
                9010,
                9032
            ],
            [
                9034,
                9041
            ],
            [
                8979,
                8982
            ],
            [
                9052,
                9056
            ],
            [
                9084,
                9108
            ],
            [
                9122,
                9129
            ],
            [
                9138,
                9177
            ],
            [
                9184,
                9228
            ],
            [
                9291,
                9318
            ],
            [
                9044,
                9047
            ],
            [
                9329,
                9348
            ],
            [
                9455,
                9458
            ],
            [
                8965,
                8967
            ],
            [
                9459,
                9472
            ],
            [
                9520,
                9524
            ],
            [
                9537,
                9597
            ],
            [
                9426,
                9428
            ],
            [
                9603,
                9626
            ],
            [
                9632,
                9671
            ],
            [
                9687,
                9695
            ],
            [
                9708,
                9716
            ],
            [
                9718,
                9746
            ],
            [
                9756,
                9761
            ],
            [
                9775,
                9866
            ],
            [
                9913,
                9920
            ],
            [
                9929,
                9949
            ],
            [
                9955,
                9957
            ],
            [
                9972,
                9975
            ],
            [
                10146,
                10159
            ],
            [
                10159,
                10172
            ],
            [
                10174,
                10178
            ],
            [
                10179,
                10180
            ],
            [
                10183,
                10208
            ],
            [
                10213,
                10219
            ],
            [
                10238,
                10279
            ],
            [
                10283,
                10290
            ],
            [
                10291,
                10292
            ],
            [
                10294,
                10334
            ],
            [
                10334,
                10338
            ],
            [
                10369,
                10378
            ],
            [
                10380,
                10394
            ],
            [
                10378,
                10379
            ],
            [
                10418,
                10421
            ],
            [
                10429,
                10452
            ],
            [
                10458,
                10460
            ],
            [
                10567,
                10588
            ],
            [
                10596,
                10620
            ],
            [
                10622,
                10633
            ],
            [
                10635,
                10639
            ],
            [
                10642,
                10659
            ],
            [
                10661,
                10675
            ],
            [
                10684,
                10687
            ],
            [
                10689,
                10693
            ],
            [
                10695,
                10755
            ],
            [
                10814,
                10821
            ],
            [
                10825,
                10882
            ],
            [
                10886,
                10911
            ]
        ],
        "row_chars": [
            [
                0,
                166
            ],
            [
                166,
                462
            ],
            [
                462,
                651
            ],
            [
                651,
                1165
            ],
            [
                1165,
                2033
            ],
            [
                2033,
                2039
            ],
            [
                2039,
                2951
            ],
            [
                2951,
                3151
            ],
            [
                3151,
                3202
            ],
            [
                3202,
                3262
            ],
            [
                3262,
                3327
            ],
            [
                3327,
                3415
            ],
            [
                3415,
                3459
            ],
            [
                3459,
                3507
            ],
            [
                3507,
                3690
            ],
            [
                3690,
                3754
            ],
            [
                3754,
                3819
            ],
            [
                3819,
                3920
            ],
            [
                3920,
                3987
            ],
            [
                3987,
                4051
            ],
            [
                4051,
                4158
            ],
            [
                4158,
                4250
            ],
            [
                4250,
                4318
            ],
            [
                4318,
                4389
            ],
            [
                4389,
                4646
            ],
            [
                4646,
                4750
            ],
            [
                4750,
                4902
            ],
            [
                4902,
                5161
            ],
            [
                5161,
                5267
            ],
            [
                5267,
                5367
            ],
            [
                5367,
                5434
            ],
            [
                5434,
                5831
            ],
            [
                5831,
                5969
            ],
            [
                5969,
                6278
            ],
            [
                6278,
                6471
            ],
            [
                6471,
                6514
            ],
            [
                6514,
                6760
            ],
            [
                6760,
                6997
            ],
            [
                6997,
                7043
            ],
            [
                7043,
                7109
            ],
            [
                7109,
                7147
            ],
            [
                7147,
                7212
            ],
            [
                7212,
                7649
            ],
            [
                7649,
                7691
            ],
            [
                7691,
                7739
            ],
            [
                7739,
                8085
            ],
            [
                8085,
                8187
            ],
            [
                8187,
                8260
            ],
            [
                8260,
                8416
            ],
            [
                8416,
                8528
            ],
            [
                8528,
                8648
            ],
            [
                8648,
                8682
            ],
            [
                8682,
                8755
            ],
            [
                8755,
                9975
            ],
            [
                9975,
                10118
            ],
            [
                10118,
                10124
            ],
            [
                10124,
                10136
            ],
            [
                10136,
                10142
            ],
            [
                10142,
                10159
            ],
            [
                10159,
                10334
            ],
            [
                10334,
                10340
            ],
            [
                10340,
                10362
            ],
            [
                10362,
                10369
            ],
            [
                10369,
                10478
            ],
            [
                10478,
                10528
            ],
            [
                10528,
                10563
            ],
            [
                10563,
                10642
            ],
            [
                10642,
                10684
            ],
            [
                10684,
                10912
            ],
            [
                10912,
                11238
            ]
        ]
    },
    "abridged": {
        "text": "'\"By the authority of God Almighty, the Father, Son, and Holy Ghost, and of the holy canons, and of the undefiled Virgin Mary, mother of our Saviour.\" I think there is no need to read aloud,' quoth Dr. Slop to my father, dropping the paper to his knee, 'as you have read it so lately, Sir. I may as well read it to myself.'\n'No,' replied my father; 'there is something so whimsical, especially in the latter part of it, I should enjoy a second reading.'\nDr. Slop did not altogether like it; but when my uncle Toby offered to give over whistling, and read it himself, Dr. Slop thought he might as well read it under the cover of my uncle's whistling; so raising the paper to his face to hide his chagrin, he read it aloud as follows, - my uncle Toby whistling Lillabullero, though not quite so loud as before.\n'\"By the authority of God Almighty, the Father, Son, and Holy Ghost, and of the undefiled Virgin Mary, mother of our Saviour, and of all the celestial angels, archangels, thrones, dominions, powers, cherubins and seraphins, and of all the holy patriarchs, prophets, apostles and evangelists, and of the holy innocents, and all the saints - May he (Obadiah) be damned (for tying these knots). We excommunicate him, and from the thresholds of the holy church of God Almighty we sequester him, that he may be tormented and delivered over with those who reject the Lord God. And as fire is quenched with water, so let the light of him be put out for evermore, unless he shall repent (Obadiah, of the knots which he has tied). Amen.\n'\"May the Father who created man, curse him. May the Son who suffered for us, curse him. May the Holy Ghost, who was given to us in baptism, curse him (Obadiah). May the holy cross which Christ ascended, curse him.\n'\"May the holy and eternal Virgin Mary, mother of God, curse him. May all the angels and archangels, and all the heavenly armies, curse him.\"' ['Our armies swore terribly in Flanders,' cried my uncle Toby, 'but not like this. I could not curse my dog so.']\n'\"May St. John and St. Peter and St. Paul, and St. Andrew, and all Christ's apostles curse him. And may the other disciples and evangelists, who by their preaching converted the world, and may the holy company of martyrs and confessors who are found pleasing to God Almighty, curse him (Obadiah).\n'\"May the holy choir of virgins, who for the honour of Christ have despised the things of the world, damn him. May all the saints beloved of God, damn him. May the heavens and earth, and all the holy things therein, damn him (Obadiah).\n'\"May he (Obadiah) be damned wherever he be - whether in the house or the stables, the garden or the field, or the highway, the path, in the wood, or the water, or in the church. May he be cursed in living, in dying.\"' [Here my uncle Toby kept whistling one long note to the end of the sentence - with Dr. Slop like a running bass all the way.]\n'\"May he be cursed in eating, in drinking, in being hungry, in being thirsty, in fasting, in sleeping, in walking, in standing, in sitting, in lying, in working, in resting, in pissing, in shitting, and in blood-letting!\"\n'\"May he (Obadiah) be cursed in all the faculties of his body!\n'\"May he be cursed in the hair of his head! May he be cursed in his brains, in his temples, in his forehead, in his ears, in his eye-brows, in his cheeks, in his jaw-bones, in his nostrils, in his fore-teeth and grinders, in his lips, in his throat, in his shoulders, in his wrists, in his arms, in his hands, in his fingers!\n'\"May he be damned in his mouth, in his breast, in his heart and stomach!\n'\"May he be cursed in his groin-\"' ['God forbid!' quoth my uncle Toby], '\"- in his thighs, in his genitals\"' [my father shook his head], '\"and in his hips, his knees, his legs, and feet, and toe-nails!\n'\"May the Son of the living God, with all the glory of his Majesty\"'-\n[Here my uncle Toby, throwing back his head, gave a monstrous, long, loud Whew - w - w. By the golden beard of Jupiter and Juno and by the beards of the other heathen deities, which by the bye was no small number, what with the beards of your celestial gods, town-gods and country-gods, and celestial goddesses - all of which beards, when counted together, made no less than thirty thousand effective beards in the Pagan establishment - every beard of which claimed the rights of being sworn by - by all these beards together - I vow that of the two bad cassocks I am worth in the world, I would have given the better of them to have been there, and heard my uncle Toby's accompaniment.]\n-'\"curse him!\" continued Dr. Slop, \"and may heaven, with all its powers, rise up against him, curse and damn him (Obadiah) unless he repent and make satisfaction! Amen.\"'\n'I declare,' quoth my uncle Toby, 'I could not curse the devil himself so bitterly.'\n'But he is cursed, and damned already, to all eternity,' replied Dr. Slop.\n'I am sorry for it,' quoth my uncle Toby.\nDr. Slop drew up his mouth, and was just beginning to return my uncle Toby's whistle - when the door hastily opening in the next chapter but one put an end to the affair.",
        "paragraph_chars": [
            [
                0,
                324
            ],
            [
                324,
                454
            ],
            [
                454,
                809
            ],
            [
                809,
                1537
            ],
            [
                1537,
                1752
            ],
            [
                1752,
                2009
            ],
            [
                2009,
                2306
            ],
            [
                2306,
                2542
            ],
            [
                2542,
                2887
            ],
            [
                2887,
                3109
            ],
            [
                3109,
                3172
            ],
            [
                3172,
                3498
            ],
            [
                3498,
                3572
            ],
            [
                3572,
                3774
            ],
            [
                3774,
                3844
            ],
            [
                3844,
                4532
            ],
            [
                4532,
                4703
            ],
            [
                4703,
                4788
            ],
            [
                4788,
                4863
            ],
            [
                4863,
                4905
            ],
            [
                4905,
                5075
            ]
        ],
        "segment_chars": [
            [
                0,
                151
            ],
            [
                151,
                290
            ],
            [
                290,
                324
            ],
            [
                324,
                454
            ],
            [
                454,
                809
            ],
            [
                809,
                1201
            ],
            [
                1201,
                1380
            ],
            [
                1380,
                1531
            ],
            [
                1531,
                1537
            ],
            [
                1537,
                1582
            ],
            [
                1582,
                1626
            ],
            [
                1626,
                1699
            ],
            [
                1699,
                1752
            ],
            [
                1752,
                1818
            ],
            [
                1818,
                1895
            ],
            [
                1895,
                1978
            ],
            [
                1978,
                2009
            ],
            [
                2009,
                2105
            ],
            [
                2105,
                2306
            ],
            [
                2306,
                2417
            ],
            [
                2417,
                2462
            ],
            [
                2462,
                2542
            ],
            [
                2542,
                2721
            ],
            [
                2721,
                2761
            ],
            [
                2761,
                2887
            ],
            [
                2887,
                3109
            ],
            [
                3109,
                3172
            ],
            [
                3172,
                3216
            ],
            [
                3216,
                3498
            ],
            [
                3498,
                3572
            ],
            [
                3572,
                3622
            ],
            [
                3622,
                3774
            ],
            [
                3774,
                3844
            ],
            [
                3844,
                4532
            ],
            [
                4532,
                4547
            ],
            [
                4547,
                4695
            ],
            [
                4695,
                4703
            ],
            [
                4703,
                4788
            ],
            [
                4788,
                4863
            ],
            [
                4863,
                4905
            ],
            [
                4905,
                5075
            ]
        ],
        "overlap_chars": [
            [
                2,
                120
            ],
            [
                125,
                133
            ],
            [
                134,
                151
            ],
            [
                151,
                170
            ],
            [
                176,
                183
            ],
            [
                184,
                189
            ],
            [
                192,
                201
            ],
            [
                202,
                206
            ],
            [
                207,
                219
            ],
            [
                219,
                239
            ],
            [
                240,
                252
            ],
            [
                254,
                273
            ],
            [
                274,
                284
            ],
            [
                285,
                288
            ],
            [
                288,
                289
            ],
            [
                290,
                321
            ],
            [
                330,
                347
            ],
            [
                350,
                428
            ],
            [
                435,
                451
            ],
            [
                454,
                457
            ],
            [
                458,
                462
            ],
            [
                463,
                489
            ],
            [
                489,
                490
            ],
            [
                491,
                494
            ],
            [
                500,
                508
            ],
            [
                509,
                511
            ],
            [
                522,
                565
            ],
            [
                565,
                566
            ],
            [
                567,
                570
            ],
            [
                571,
                575
            ],
            [
                576,
                636
            ],
            [
                636,
                638
            ],
            [
                639,
                648
            ],
            [
                648,
                649
            ],
            [
                650,
                660
            ],
            [
                661,
                682
            ],
            [
                683,
                702
            ],
            [
                702,
                703
            ],
            [
                704,
                731
            ],
            [
                731,
                732
            ],
            [
                735,
                743
            ],
            [
                744,
                746
            ],
            [
                749,
                758
            ],
            [
                759,
                771
            ],
            [
                771,
                809
            ],
            [
                811,
                905
            ],
            [
                910,
                918
            ],
            [
                919,
                959
            ],
            [
                960,
                1074
            ],
            [
                1075,
                1127
            ],
            [
                1128,
                1131
            ],
            [
                1132,
                1146
            ],
            [
                1149,
                1155
            ],
            [
                1157,
                1164
            ],
            [
                1164,
                1165
            ],
            [
                1166,
                1168
            ],
            [
                1176,
                1198
            ],
            [
                1201,
                1217
            ],
            [
                1218,
                1324
            ],
            [
                1325,
                1348
            ],
            [
                1349,
                1358
            ],
            [
                1366,
                1378
            ],
            [
                1378,
                1380
            ],
            [
                1380,
                1471
            ],
            [
                1475,
                1487
            ],
            [
                1488,
                1489
            ],
            [
                1489,
                1496
            ],
            [
                1496,
                1528
            ],
            [
                1531,
                1535
            ],
            [
                1539,
                1582
            ],
            [
                1582,
                1626
            ],
            [
                1626,
                1687
            ],
            [
                1689,
                1696
            ],
            [
                1699,
                1730
            ],
            [
                1731,
                1752
            ],
            [
                1754,
                1785
            ],
            [
                1790,
                1818
            ],
            [
                1818,
                1851
            ],
            [
                1851,
                1893
            ],
            [
                1897,
                1925
            ],
            [
                1937,
                1951
            ],
            [
                1952,
                1954
            ],
            [
                1956,
                1957
            ],
            [
                1959,
                1962
            ],
            [
                1972,
                1978
            ],
            [
                1978,
                1989
            ],
            [
                1990,
                2005
            ],
            [
                2011,
                2023
            ],
            [
                2024,
                2075
            ],
            [
                2076,
                2093
            ],
            [
                2094,
                2105
            ],
            [
                2105,
                2116
            ],
            [
                2123,
                2136
            ],
            [
                2137,
                2186
            ],
            [
                2187,
                2210
            ],
            [
                2211,
                2248
            ],
            [
                2249,
                2294
            ],
            [
                2296,
                2303
            ],
            [
                2303,
                2306
            ],
            [
                2308,
                2329
            ],
            [
                2330,
                2415
            ],
            [
                2417,
                2435
            ],
            [
                2436,
                2460
            ],
            [
                2462,
                2512
            ],
            [
                2513,
                2530
            ],
            [
                2531,
                2532
            ],
            [
                2532,
                2539
            ],
            [
                2539,
                2542
            ],
            [
                2544,
                2550
            ],
            [
                2552,
                2559
            ],
            [
                2559,
                2563
            ],
            [
                2571,
                2585
            ],
            [
                2588,
                2665
            ],
            [
                2666,
                2675
            ],
            [
                2676,
                2691
            ],
            [
                2692,
                2721
            ],
            [
                2721,
                2759
            ],
            [
                2761,
                2775
            ],
            [
                2781,
                2799
            ],
            [
                2805,
                2836
            ],
            [
                2839,
                2843
            ],
            [
                2844,
                2847
            ],
            [
                2848,
                2852
            ],
            [
                2853,
                2886
            ],
            [
                2889,
                2916
            ],
            [
                2917,
                2919
            ],
            [
                2920,
                2988
            ],
            [
                2988,
                3109
            ],
            [
                3111,
                3117
            ],
            [
                3119,
                3126
            ],
            [
                3126,
                3127
            ],
            [
                3128,
                3172
            ],
            [
                3174,
                3216
            ],
            [
                3216,
                3247
            ],
            [
                3248,
                3498
            ],
            [
                3500,
                3509
            ],
            [
                3517,
                3562
            ],
            [
                3563,
                3572
            ],
            [
                3574,
                3597
            ],
            [
                3598,
                3603
            ],
            [
                3609,
                3612
            ],
            [
                3613,
                3619
            ],
            [
                3622,
                3636
            ],
            [
                3648,
                3678
            ],
            [
                3682,
                3706
            ],
            [
                3710,
                3727
            ],
            [
                3728,
                3774
            ],
            [
                3776,
                3841
            ],
            [
                3844,
                3858
            ],
            [
                3859,
                3861
            ],
            [
                3861,
                3863
            ],
            [
                3863,
                3922
            ],
            [
                3923,
                3924
            ],
            [
                3925,
                3926
            ],
            [
                3929,
                3930
            ],
            [
                3930,
                3931
            ],
            [
                3932,
                3954
            ],
            [
                3955,
                3962
            ],
            [
                3963,
                3966
            ],
            [
                3967,
                3971
            ],
            [
                3972,
                3996
            ],
            [
                4003,
                4010
            ],
            [
                4018,
                4057
            ],
            [
                4058,
                4102
            ],
            [
                4103,
                4130
            ],
            [
                4131,
                4134
            ],
            [
                4135,
                4154
            ],
            [
                4157,
                4160
            ],
            [
                4161,
                4163
            ],
            [
                4164,
                4177
            ],
            [
                4178,
                4182
            ],
            [
                4191,
                4251
            ],
            [
                4252,
                4254
            ],
            [
                4255,
                4278
            ],
            [
                4281,
                4320
            ],
            [
                4321,
                4329
            ],
            [
                4330,
                4338
            ],
            [
                4341,
                4369
            ],
            [
                4372,
                4377
            ],
            [
                4378,
                4469
            ],
            [
                4470,
                4477
            ],
            [
                4488,
                4508
            ],
            [
                4513,
                4515
            ],
            [
                4529,
                4532
            ],
            [
                4534,
                4547
            ],
            [
                4547,
                4560
            ],
            [
                4561,
                4565
            ],
            [
                4565,
                4566
            ],
            [
                4567,
                4592
            ],
            [
                4597,
                4603
            ],
            [
                4603,
                4644
            ],
            [
                4646,
                4653
            ],
            [
                4653,
                4654
            ],
            [
                4655,
                4695
            ],
            [
                4695,
                4699
            ],
            [
                4704,
                4713
            ],
            [
                4716,
                4730
            ],
            [
                4735,
                4736
            ],
            [
                4746,
                4749
            ],
            [
                4750,
                4773
            ],
            [
                4774,
                4776
            ],
            [
                4789,
                4810
            ],
            [
                4818,
                4842
            ],
            [
                4845,
                4856
            ],
            [
                4857,
                4861
            ],
            [
                4864,
                4881
            ],
            [
                4884,
                4898
            ],
            [
                4905,
                4908
            ],
            [
                4909,
                4913
            ],
            [
                4914,
                4974
            ],
            [
                4982,
                4989
            ],
            [
                4992,
                5049
            ],
            [
                5050,
                5075
            ]
        ],
        "row_chars": [
            [
                0,
                151
            ],
            [
                151,
                324
            ],
            [
                324,
                454
            ],
            [
                454,
                809
            ],
            [
                809,
                809
            ],
            [
                809,
                809
            ],
            [
                809,
                1380
            ],
            [
                1380,
                1537
            ],
            [
                1537,
                1537
            ],
            [
                1537,
                1537
            ],
            [
                1537,
                1537
            ],
            [
                1537,
                1537
            ],
            [
                1537,
                1582
            ],
            [
                1582,
                1626
            ],
            [
                1626,
                1752
            ],
            [
                1752,
                1752
            ],
            [
                1752,
                1752
            ],
            [
                1752,
                1752
            ],
            [
                1752,
                1818
            ],
            [
                1818,
                1818
            ],
            [
                1818,
                1895
            ],
            [
                1895,
                1978
            ],
            [
                1978,
                2009
            ],
            [
                2009,
                2009
            ],
            [
                2009,
                2009
            ],
            [
                2009,
                2009
            ],
            [
                2009,
                2105
            ],
            [
                2105,
                2306
            ],
            [
                2306,
                2306
            ],
            [
                2306,
                2306
            ],
            [
                2306,
                2306
            ],
            [
                2306,
                2542
            ],
            [
                2542,
                2542
            ],
            [
                2542,
                2542
            ],
            [
                2542,
                2721
            ],
            [
                2721,
                2761
            ],
            [
                2761,
                2887
            ],
            [
                2887,
                3109
            ],
            [
                3109,
                3109
            ],
            [
                3109,
                3172
            ],
            [
                3172,
                3172
            ],
            [
                3172,
                3172
            ],
            [
                3172,
                3172
            ],
            [
                3172,
                3172
            ],
            [
                3172,
                3216
            ],
            [
                3216,
                3498
            ],
            [
                3498,
                3572
            ],
            [
                3572,
                3622
            ],
            [
                3622,
                3774
            ],
            [
                3774,
                3774
            ],
            [
                3774,
                3774
            ],
            [
                3774,
                3774
            ],
            [
                3774,
                3774
            ],
            [
                3774,
                4532
            ],
            [
                4532,
                4532
            ],
            [
                4532,
                4532
            ],
            [
                4532,
                4532
            ],
            [
                4532,
                4532
            ],
            [
                4532,
                4547
            ],
            [
                4547,
                4695
            ],
            [
                4695,
                4703
            ],
            [
                4703,
                4703
            ],
            [
                4703,
                4703
            ],
            [
                4703,
                4788
            ],
            [
                4788,
                4788
            ],
            [
                4788,
                4788
            ],
            [
                4788,
                4863
            ],
            [
                4863,
                4905
            ],
            [
                4905,
                5075
            ],
            [
                5075,
                5075
            ]
        ]
    }
}