{
    "original": {
        "text": "In the same village where my father and my mother dwelt, dwelt also a thin, upright, motherly, notable, good old body of a midwife, who with the help of a little plain good sense, and some years full employment in her business, in which she had all along trusted little to her own efforts, and a great deal to those of dame Nature, --had acquired, in her way, no small degree of reputation in the world: ----by which word _world_, need I in this place inform your worship, that I would be understood to mean no more of it, than a small circle described upon the circle of the great world, of four _English_ miles diameter, or thereabouts, of which the cottage where the good old woman lived, is supposed to be the centre? --She had been left, it seems, a widow in great distress, with three or four small children, in her forty-seventh year; and as she was at that time a person of decent carriage, --grave deportment, --a woman moreover of few words, and withal an object of compassion, whose distress, and silence under it, called out the louder for a friendly lift: the wife of the parson of the parish was touched with pity; and having often lamented an inconvenience, to which her husband's flock had for many years been exposed, inasmuch as there was no such thing as a midwife, of any kind or degree, to be got at, let the case have been never so urgent, within less than six or seven long miles riding; which seven said long miles in dark nights and dismal roads, the country thereabouts being nothing but a deep clay, was almost equal to fourteen; and that in effect was sometimes next to having no midwife at all; it came into her head, that it would be doing as seasonable a kindness to the whole parish, as to the poor creature herself, to get her a little instructed in some of the plain principles of the business, in order to set her up in it. As no woman thereabouts was better qualified to execute the plan she had formed than herself, the gentlewoman very charitably undertook it; and having great influence over the female part of the parish, she found no difficulty in effecting it to the utmost of her wishes. In truth, the parson join'd his interest with his wife's in the whole affair; and in order to do things as they should be, and give the poor soul as good a title by law to practise, as his wife had given by institution, --he chearfully paid the fees for the ordinary's licence himself, amounting in the whole, to the sum of eighteen shillings and four pence; so that betwixt them both, the good woman was fully invested in the real and corporal possession of her office, together with all its _rights, members, and appurtenances whatsoever_.\nThese last words, you must know, were not according to the old form in which such licences, faculties, and powers usually ran, which in like cases had heretofore been granted to the sisterhood. But it was according to a neat _Formula_ of _Didius_ his own devising, who having a particular turn for taking to pieces, and new framing over again, all kind of instruments in that way, not only hit upon this dainty amendment, but coaxed many of the old licensed matrons in the neighbourhood, to open their faculties afresh, in order to have this wham-wham of his inserted.\nI own I never could envy _Didius_ in these kinds of fancies of his: --But every man to his own taste. --Did not Dr. _Kunastrokius_, that great man, at his leisure hours, take the greatest delight imaginable in combing of asses tails, and plucking the dead hairs out with his teeth, though he had tweezers always in his pocket? Nay, if you come to that, Sir, have not the wisest of men in all ages, not excepting _Solomon_ himself, --have they not had their HOBBY-HORSES; --their running horses, --their coins and their cockle-shells, their drums and their trumpets, their fiddles, their pallets, --their maggots and their butterflies? --and so long as a man rides his HOBBY-HORSE peaceably and quietly along the King's highway, and neither compels you or me to get up behind him, --pray, Sir, what have either you or I to do with it?",
        "paragraph_chars": [
            [
                0,
                2673
            ],
            [
                2673,
                3242
            ],
            [
                3242,
                4075
            ]
        ],
        "segment_chars": [
            [
                0,
                722
            ],
            [
                722,
                1859
            ],
            [
                1859,
                2131
            ],
            [
                2131,
                2673
            ],
            [
                2673,
                2867
            ],
            [
                2867,
                3242
            ],
            [
                3242,
                3344
            ],
            [
                3344,
                3569
            ],
            [
                3569,
                3877
            ],
            [
                3877,
                4075
            ]
        ],
        "overlap_chars": [
            [
                0,
                6
            ],
            [
                12,
                56
            ],
            [
                685,
                690
            ],
            [
                68,
                93
            ],
            [
                102,
                135
            ],
            [
                93,
                94
            ],
            [
                136,
                194
            ],
            [
                200,
                240
            ],
            [
                255,
                331
            ],
            [
                334,
                346
            ],
            [
                379,
                403
            ],
            [
                408,
                410
            ],
            [
                558,
                561
            ],
            [
                417,
                421
            ],
            [
                582,
                588
            ],
            [
                436,
                437
            ],
            [
                503,
                507
            ],
            [
                528,
                542
            ],
            [
                376,
                378
            ],
            [
                592,
                596
            ],
            [
                598,
                605
            ],
            [
                607,
                622
            ],
            [
                666,
                684
            ],
            [
                652,
                659
            ],
            [
                714,
                720
            ],
            [
                724,
                741
            ],
            [
                753,
                763
            ],
            [
                770,
                856
            ],
            [
                870,
                871
            ],
            [
                901,
                906
            ],
            [
                952,
                955
            ],
            [
                882,
                888
            ],
            [
                923,
                928
            ],
            [
                938,
                951
            ],
            [
                1081,
                1091
            ],
            [
                1193,
                1195
            ],
            [
                1073,
                1077
            ],
            [
                1182,
                1185
            ],
            [
                1127,
                1154
            ],
            [
                860,
                864
            ],
            [
                1247,
                1259
            ],
            [
                1276,
                1283
            ],
            [
                1362,
                1368
            ],
            [
                1386,
                1409
            ],
            [
                1176,
                1181
            ],
            [
                1106,
                1109
            ],
            [
                1547,
                1555
            ],
            [
                1439,
                1471
            ],
            [
                1496,
                1501
            ],
            [
                1619,
                1622
            ],
            [
                1516,
                1525
            ],
            [
                1624,
                1669
            ],
            [
                1684,
                1714
            ],
            [
                1004,
                1007
            ],
            [
                1722,
                1759
            ],
            [
                1769,
                1782
            ],
            [
                1815,
                1828
            ],
            [
                1557,
                1560
            ],
            [
                1841,
                1858
            ],
            [
                2141,
                2151
            ],
            [
                2361,
                2388
            ],
            [
                2181,
                2187
            ],
            [
                2400,
                2407
            ],
            [
                2415,
                2426
            ],
            [
                2222,
                2224
            ],
            [
                2455,
                2623
            ],
            [
                2625,
                2670
            ],
            [
                2673,
                2763
            ],
            [
                2787,
                2798
            ],
            [
                2865,
                2867
            ],
            [
                2867,
                2870
            ],
            [
                2891,
                2897
            ],
            [
                2912,
                2918
            ],
            [
                2936,
                2977
            ],
            [
                2989,
                2992
            ],
            [
                3017,
                3040
            ],
            [
                3052,
                3159
            ],
            [
                3161,
                3242
            ],
            [
                3242,
                3266
            ],
            [
                3268,
                3274
            ],
            [
                3305,
                3308
            ],
            [
                3294,
                3301
            ],
            [
                3312,
                3344
            ],
            [
                3346,
                3357
            ],
            [
                3362,
                3371
            ],
            [
                3372,
                3437
            ],
            [
                3449,
                3459
            ],
            [
                3463,
                3468
            ],
            [
                3469,
                3522
            ],
            [
                3567,
                3568
            ],
            [
                3569,
                3572
            ],
            [
                3593,
                3619
            ],
            [
                3623,
                3639
            ],
            [
                3655,
                3662
            ],
            [
                3664,
                3671
            ],
            [
                3675,
                3712
            ],
            [
                3572,
                3573
            ],
            [
                3715,
                3720
            ],
            [
                3671,
                3672
            ],
            [
                3739,
                3754
            ],
            [
                3761,
                3791
            ],
            [
                3798,
                3832
            ],
            [
                3735,
                3736
            ],
            [
                3840,
                3877
            ],
            [
                3883,
                3931
            ],
            [
                3944,
                3973
            ],
            [
                3982,
                3989
            ],
            [
                3974,
                3981
            ],
            [
                3990,
                3993
            ],
            [
                3997,
                4020
            ],
            [
                4028,
                4044
            ],
            [
                4052,
                4075
            ]
        ],
        "row_chars": [
            [
                0,
                722
            ],
            [
                722,
                1859
            ],
            [
                1859,
                2131
            ],
            [
                2131,
                2673
            ],
            [
                2673,
                2867
            ],
            [
                2867,
                3242
            ],
            [
                3242,
                3344
            ],
            [
                3344,
                3569
            ],
            [
                3569,
                3877
            ],
            [
                3877,
                4075
            ]
        ]
    },
    "abridged": {
        "text": "In the village where my father and my mother dwelt, lived a thin, upright, motherly, good old body of a midwife, who, with the help of a little plain good sense, and some years employment in her business, in which she trusted little to her own efforts, and a great deal to those of dame Nature, had acquired a reputation in the world: - by the word world, I mean a small circle of about four English miles diameter, with the good old woman's cottage at its centre.\nShe had been left a widow in distress, with three or four small children, in her forty-seventh year; and as she was a grave and decent woman of few words, the parson's wife pitied her; and having often lamented that there was no midwife within seven long miles riding - which was more like fourteen in dark nights and dismal roads, our countryside being all deep clay - it came into her head, that it would be doing a kindness to the whole parish and the poor creature herself, to get her instructed in the business, and set her up in it.\nThe parson cheerfully paid the fees for the midwife's licence, amounting to eighteen shillings and four pence; so that betwixt them both, the good woman was fully invested in the real and corporal possession of her office, together with all its rights, members, and appurtenances whatsoever.\nThese last words, you must know, were not according to the old form in which such licences usually ran. But they follow a neat Formula devised by Didius, who having a particular turn for taking apart and re-framing all kind of instruments, not only hit upon this dainty amendment, but coaxed many of the old licensed matrons in the neighbourhood to open their faculties afresh, in order to have this wham-wham of his inserted.\nI own I never could envy Didius his fancies. But every man to his own taste. Did not Dr. Kunastrokius, that great man, at his leisure hours, take the greatest delight in combing asses' tails, and plucking the dead hairs out with his teeth?\nNay, Sir, have not the wisest men in all ages, even Solomon himself - have they not had their Hobby-Horses; - for example, their race-horses, their coins and cockle-shells, their drums and trumpets, their fiddles, their palettes, their maggots and their butterflies? So long as a man rides his Hobby-Horse peaceably along the King's highway, and compels neither you nor me to get up behind him - pray, Sir, what have you or I to do with it?",
        "paragraph_chars": [
            [
                0,
                465
            ],
            [
                465,
                1004
            ],
            [
                1004,
                1296
            ],
            [
                1296,
                1723
            ],
            [
                1723,
                1963
            ],
            [
                1963,
                2403
            ]
        ],
        "segment_chars": [
            [
                0,
                465
            ],
            [
                465,
                1004
            ],
            [
                1004,
                1296
            ],
            [
                1296,
                1400
            ],
            [
                1400,
                1723
            ],
            [
                1723,
                1768
            ],
            [
                1768,
                1800
            ],
            [
                1800,
                1963
            ],
            [
                1963,
                2230
            ],
            [
                2230,
                2403
            ]
        ],
        "overlap_chars": [
            [
                0,
                6
            ],
            [
                7,
                51
            ],
            [
                52,
                57
            ],
            [
                58,
                83
            ],
            [
                83,
                116
            ],
            [
                116,
                117
            ],
            [
                118,
                176
            ],
            [
                177,
                217
            ],
            [
                218,
                294
            ],
            [
                295,
                307
            ],
            [
                310,
                334
            ],
            [
                337,
                339
            ],
            [
                340,
                343
            ],
            [
                344,
                348
            ],
            [
                349,
                355
            ],
            [
                356,
                357
            ],
            [
                358,
                362
            ],
            [
                363,
                377
            ],
            [
                378,
                380
            ],
            [
                387,
                391
            ],
            [
                392,
                399
            ],
            [
                400,
                415
            ],
            [
                421,
                439
            ],
            [
                442,
                449
            ],
            [
                457,
                463
            ],
            [
                465,
                482
            ],
            [
                483,
                493
            ],
            [
                494,
                580
            ],
            [
                581,
                582
            ],
            [
                583,
                588
            ],
            [
                589,
                592
            ],
            [
                593,
                599
            ],
            [
                600,
                605
            ],
            [
                606,
                619
            ],
            [
                620,
                630
            ],
            [
                630,
                632
            ],
            [
                633,
                637
            ],
            [
                645,
                648
            ],
            [
                648,
                675
            ],
            [
                676,
                680
            ],
            [
                681,
                693
            ],
            [
                694,
                701
            ],
            [
                702,
                708
            ],
            [
                709,
                732
            ],
            [
                735,
                740
            ],
            [
                741,
                744
            ],
            [
                755,
                763
            ],
            [
                764,
                796
            ],
            [
                813,
                818
            ],
            [
                819,
                822
            ],
            [
                823,
                832
            ],
            [
                835,
                880
            ],
            [
                881,
                911
            ],
            [
                912,
                915
            ],
            [
                916,
                953
            ],
            [
                954,
                967
            ],
            [
                968,
                981
            ],
            [
                982,
                985
            ],
            [
                986,
                1003
            ],
            [
                1004,
                1014
            ],
            [
                1020,
                1047
            ],
            [
                1051,
                1057
            ],
            [
                1058,
                1065
            ],
            [
                1065,
                1076
            ],
            [
                1077,
                1079
            ],
            [
                1080,
                1248
            ],
            [
                1249,
                1294
            ],
            [
                1296,
                1386
            ],
            [
                1387,
                1398
            ],
            [
                1398,
                1400
            ],
            [
                1400,
                1403
            ],
            [
                1416,
                1422
            ],
            [
                1442,
                1448
            ],
            [
                1448,
                1489
            ],
            [
                1496,
                1499
            ],
            [
                1511,
                1534
            ],
            [
                1534,
                1641
            ],
            [
                1642,
                1723
            ],
            [
                1723,
                1747
            ],
            [
                1748,
                1754
            ],
            [
                1755,
                1758
            ],
            [
                1759,
                1766
            ],
            [
                1768,
                1800
            ],
            [
                1800,
                1811
            ],
            [
                1815,
                1824
            ],
            [
                1824,
                1889
            ],
            [
                1890,
                1900
            ],
            [
                1901,
                1906
            ],
            [
                1908,
                1961
            ],
            [
                1961,
                1962
            ],
            [
                1963,
                1966
            ],
            [
                1966,
                1992
            ],
            [
                1993,
                2009
            ],
            [
                2015,
                2022
            ],
            [
                2023,
                2030
            ],
            [
                2033,
                2070
            ],
            [
                2084,
                2085
            ],
            [
                2086,
                2091
            ],
            [
                2103,
                2104
            ],
            [
                2105,
                2120
            ],
            [
                2121,
                2151
            ],
            [
                2152,
                2186
            ],
            [
                2191,
                2192
            ],
            [
                2193,
                2230
            ],
            [
                2230,
                2278
            ],
            [
                2279,
                2308
            ],
            [
                2309,
                2316
            ],
            [
                2317,
                2324
            ],
            [
                2325,
                2328
            ],
            [
                2333,
                2356
            ],
            [
                2363,
                2379
            ],
            [
                2380,
                2403
            ]
        ],
        "row_chars": [
            [
                0,
                465
            ],
            [
                465,
                1004
            ],
            [
                1004,
                1004
            ],
            [
                1004,
                1296
            ],
            [
                1296,
                1400
            ],
            [
                1400,
                1723
            ],
            [
                1723,
                1800
            ],
            [
                1800,
                1963
            ],
            [
                1963,
                2230
            ],
            [
                2230,
                2403
            ]
        ]
    }
}