{
    "original": {
        "text": "It is two hours, and ten minutes--and no more--cried my father, looking at his watch, since Dr. _Slop_ and _Obadiah_ arrived--and I know not how it happens, brother _Toby_--but to my imagination it seems almost an age.\n----Here--pray, Sir, take hold of my cap--nay, take the bell along with it, and my pantoufles too.\nNow, Sir, they are all at your service; and I freely make you a present of 'em, on condition you give me all your attention to this chapter.\nThough my father said, \"_he knew not how it happen'd_,\" --yet he knew very well how it happen'd; ----and at the instant he spoke it, was pre-determined in his mind to give my uncle _Toby_ a clear account of the matter by a metaphysical dissertation upon the subject of _duration and its simple modes_, in order to shew my uncle _Toby_ by what mechanism and mensurations in the brain it came to pass, that the rapid succession of their ideas, and the eternal scampering of the discourse from one thing to another, since Dr. _Slop_ had come into the room, had lengthened out so short a period to so inconceivable an extent. ----\"I know not how it happens--cried my father, --but it seems an age.\"\n----'Tis owing entirely, quoth my uncle _Toby_, to the succession of our ideas.\nMy father, who had an itch, in common with all philosophers, of reasoning upon everything which happened, and accounting for it too--proposed infinite pleasure to himself in this, of the succession of ideas, and had not the least apprehension of having it snatch'd out of his hands by my uncle _Toby_, who (honest man!) generally took everything as it happened; ----and who, of all things in the world, troubled his brain the least with abstruse thinking; --the ideas of time and space--or how we came by those ideas--or of what stuff they were made----or whether they were born with us--or we picked them up afterwards as we went along--or whether we did it in frocks----or not till we had got into breeches--with a thousand other inquiries and disputes about INFINITY, PRESCIENCE, LIBERTY, NECESSITY, and so forth, upon whose desperate and unconquerable theories so many fine heads have been turned and cracked----never did my uncle _Toby's_ the least injury at all; my father knew it--and was no less surprized than he was disappointed, with my uncle's fortuitous solution.\nDo you understand the theory of that affair? replied my father.\nNot I, quoth my uncle.\n--But you have some ideas, said my father, of what you talk about?--\nNo more than my horse, replied my uncle _Toby_.\nGracious heaven! cried my father, looking upwards, and clasping his two hands together----there is a worth in thy honest ignorance, brother _Toby_----'twere almost a pity to exchange it for a knowledge. --But I'll tell thee.----\nTo understand what _time_ is aright, without which we never can comprehend _infinity_, insomuch as one is a portion of the other----we ought seriously to sit down and consider what idea it is we have of _duration_, so as to give a satisfactory account how we came by it. ----What is that to anybody? quoth my uncle _Toby_. [3.3]_For if you will turn your eyes inwards upon your mind_, continued my father, _and observe attentively, you will perceive, brother, that whilst you and I are talking together, and thinking, and smoking our pipes, or whilst we receive successively ideas in our minds, we know that we do exist, and so we estimate the existence, or the continuation of the existence of ourselves, or anything else, commensurate to the succession of any ideas in our minds, the duration of ourselves, or any such other thing co-existing with our thinking----and so according to that preconceived_ ------You puzzle me to death, cried my uncle _Toby_.\n------'Tis owing to this, replied my father, that in our computations of _time_, we are so used to minutes, hours, weeks, and months----and of clocks (I wish there was not a clock in the kingdom) to measure out their several portions to us, and to those who belong to us----that 'twill be well, if in time to come, the _succession of our ideas_ be of any use or service to us at all.\nNow, whether we observe it or no, continued my father, in every sound man's head, there is a regular succession of ideas of one sort or other, which follow each other in train just like ------A train of artillery? said my uncle _Toby_ ----A train of a fiddle-stick! --quoth my father--which follow and succeed one another in our minds at certain distances, just like the images in the inside of a lanthorn turned round by the heat of a candle. --I declare, quoth my uncle _Toby_, mine are more like a smoak-jack. ------Then, brother _Toby_, I have nothing more to say to you upon that subject, said my father.\n[Footnote 3.3: Vide Locke.]",
        "paragraph_chars": [
            [
                0,
                219
            ],
            [
                219,
                318
            ],
            [
                318,
                459
            ],
            [
                459,
                1154
            ],
            [
                1154,
                1234
            ],
            [
                1234,
                2311
            ],
            [
                2311,
                2375
            ],
            [
                2375,
                2398
            ],
            [
                2398,
                2467
            ],
            [
                2467,
                2515
            ],
            [
                2515,
                2744
            ],
            [
                2744,
                3702
            ],
            [
                3702,
                4086
            ],
            [
                4086,
                4696
            ],
            [
                4696,
                4723
            ]
        ],
        "segment_chars": [
            [
                0,
                219
            ],
            [
                219,
                318
            ],
            [
                318,
                459
            ],
            [
                459,
                1081
            ],
            [
                1081,
                1154
            ],
            [
                1154,
                1234
            ],
            [
                1234,
                1554
            ],
            [
                1554,
                2311
            ],
            [
                2311,
                2356
            ],
            [
                2356,
                2375
            ],
            [
                2375,
                2398
            ],
            [
                2398,
                2467
            ],
            [
                2467,
                2515
            ],
            [
                2515,
                2532
            ],
            [
                2532,
                2718
            ],
            [
                2718,
                2744
            ],
            [
                2744,
                3015
            ],
            [
                3015,
                3044
            ],
            [
                3044,
                3067
            ],
            [
                3067,
                3702
            ],
            [
                3702,
                4086
            ],
            [
                4086,
                4300
            ],
            [
                4300,
                4352
            ],
            [
                4352,
                4530
            ],
            [
                4530,
                4599
            ],
            [
                4599,
                4696
            ],
            [
                4696,
                4723
            ]
        ],
        "overlap_chars": [
            [
                0,
                32
            ],
            [
                53,
                85
            ],
            [
                86,
                95
            ],
            [
                97,
                101
            ],
            [
                34,
                37
            ],
            [
                108,
                115
            ],
            [
                117,
                124
            ],
            [
                126,
                164
            ],
            [
                173,
                203
            ],
            [
                211,
                217
            ],
            [
                223,
                227
            ],
            [
                233,
                244
            ],
            [
                253,
                259
            ],
            [
                293,
                301
            ],
            [
                275,
                279
            ],
            [
                264,
                265
            ],
            [
                316,
                317
            ],
            [
                362,
                441
            ],
            [
                445,
                459
            ],
            [
                459,
                481
            ],
            [
                484,
                502
            ],
            [
                517,
                545
            ],
            [
                554,
                555
            ],
            [
                599,
                600
            ],
            [
                560,
                591
            ],
            [
                623,
                639
            ],
            [
                850,
                852
            ],
            [
                647,
                716
            ],
            [
                729,
                737
            ],
            [
                725,
                727
            ],
            [
                738,
                745
            ],
            [
                753,
                758
            ],
            [
                759,
                772
            ],
            [
                778,
                786
            ],
            [
                794,
                811
            ],
            [
                829,
                844
            ],
            [
                859,
                934
            ],
            [
                945,
                970
            ],
            [
                1011,
                1055
            ],
            [
                1070,
                1080
            ],
            [
                1086,
                1111
            ],
            [
                1119,
                1129
            ],
            [
                1132,
                1151
            ],
            [
                1159,
                1177
            ],
            [
                1179,
                1193
            ],
            [
                1177,
                1178
            ],
            [
                1158,
                1159
            ],
            [
                1202,
                1232
            ],
            [
                1234,
                1243
            ],
            [
                1249,
                1252
            ],
            [
                1376,
                1412
            ],
            [
                1414,
                1489
            ],
            [
                1499,
                1527
            ],
            [
                1534,
                1554
            ],
            [
                1554,
                1563
            ],
            [
                1637,
                1655
            ],
            [
                1666,
                1679
            ],
            [
                1696,
                1719
            ],
            [
                2090,
                2098
            ],
            [
                1989,
                2050
            ],
            [
                2118,
                2122
            ],
            [
                2139,
                2146
            ],
            [
                2099,
                2117
            ],
            [
                1607,
                1608
            ],
            [
                2150,
                2168
            ],
            [
                1736,
                1738
            ],
            [
                2174,
                2176
            ],
            [
                2178,
                2194
            ],
            [
                2203,
                2220
            ],
            [
                1635,
                1636
            ],
            [
                2222,
                2237
            ],
            [
                2248,
                2272
            ],
            [
                2274,
                2289
            ],
            [
                2309,
                2311
            ],
            [
                2314,
                2347
            ],
            [
                2373,
                2375
            ],
            [
                2375,
                2380
            ],
            [
                2382,
                2398
            ],
            [
                2400,
                2417
            ],
            [
                2441,
                2463
            ],
            [
                2467,
                2488
            ],
            [
                2490,
                2506
            ],
            [
                2515,
                2530
            ],
            [
                2532,
                2548
            ],
            [
                2605,
                2654
            ],
            [
                2665,
                2704
            ],
            [
                2707,
                2718
            ],
            [
                2720,
                2739
            ],
            [
                2744,
                2762
            ],
            [
                2764,
                2768
            ],
            [
                2770,
                2772
            ],
            [
                2779,
                2818
            ],
            [
                2829,
                2830
            ],
            [
                2876,
                2929
            ],
            [
                2936,
                2946
            ],
            [
                2948,
                2956
            ],
            [
                2957,
                2958
            ],
            [
                2996,
                3013
            ],
            [
                3077,
                3126
            ],
            [
                3129,
                3149
            ],
            [
                3176,
                3215
            ],
            [
                3295,
                3297
            ],
            [
                3226,
                3237
            ],
            [
                3246,
                3284
            ],
            [
                3339,
                3354
            ],
            [
                3358,
                3606
            ],
            [
                3610,
                3647
            ],
            [
                3655,
                3677
            ],
            [
                3679,
                3693
            ],
            [
                3069,
                3070
            ],
            [
                4141,
                4149
            ],
            [
                4156,
                4206
            ],
            [
                4229,
                4271
            ],
            [
                4278,
                4298
            ],
            [
                4300,
                4313
            ],
            [
                4325,
                4350
            ],
            [
                4354,
                4369
            ],
            [
                4528,
                4529
            ],
            [
                4371,
                4420
            ],
            [
                4448,
                4482
            ],
            [
                4492,
                4528
            ],
            [
                4532,
                4541
            ],
            [
                4543,
                4557
            ],
            [
                4541,
                4542
            ],
            [
                4566,
                4586
            ],
            [
                4592,
                4597
            ],
            [
                4609,
                4618
            ],
            [
                4625,
                4665
            ],
            [
                4671,
                4678
            ],
            [
                4680,
                4695
            ]
        ],
        "row_chars": [
            [
                0,
                219
            ],
            [
                219,
                318
            ],
            [
                318,
                459
            ],
            [
                459,
                1081
            ],
            [
                1081,
                1154
            ],
            [
                1154,
                1234
            ],
            [
                1234,
                1554
            ],
            [
                1554,
                2311
            ],
            [
                2311,
                2356
            ],
            [
                2356,
                2375
            ],
            [
                2375,
                2398
            ],
            [
                2398,
                2467
            ],
            [
                2467,
                2515
            ],
            [
                2515,
                2532
            ],
            [
                2532,
                2718
            ],
            [
                2718,
                2744
            ],
            [
                2744,
                3015
            ],
            [
                3015,
                3044
            ],
            [
                3044,
                3067
            ],
            [
                3067,
                3702
            ],
            [
                3702,
                4086
            ],
            [
                4086,
                4300
            ],
            [
                4300,
                4352
            ],
            [
                4352,
                4530
            ],
            [
                4530,
                4599
            ],
            [
                4599,
                4696
            ],
            [
                4696,
                4723
            ]
        ]
    },
    "abridged": {
        "text": "'It is two hours, and ten minutes,' cried my father, looking at his watch, 'since Dr. Slop and Obadiah arrived - and I know not how it happens, brother Toby, but to my imagination it seems an age.'\n- Here - pray, Sir, take my cap, and my bell, and my slippers. I freely make you a present of 'em, on condition you give me all your attention in this chapter.\nThough my father said, 'he knew not how it happened,' yet he knew very well how it happened; - and at the instant he spoke it, decided to give my uncle Toby a clear account of the matter by a metaphysical dissertation upon the duration of time and its modes, in order to show my uncle by what mechanism in the brain it happened that the rapid succession of their ideas, and the eternal scampering of the discussion from one thing to another, had lengthened out so short a period to so great an extent.\n- 'I know not how it happens,' cried my father, 'but it seems an age.'\n''Tis owing entirely,' quoth my uncle Toby, 'to the succession of our ideas.'\nMy father had proposed infinite pleasure to himself in this argument of the succession of ideas, and had not the least apprehension of having it snatched out of his hands by my uncle Toby, who (honest man!) generally never troubled his brain with abstruse ideas of time and space. Theories about Infinity, Prescience, Liberty, Necessity, and so forth, which have cracked so many fine heads, never did my uncle Toby's head the least injury. My father knew it, and was no less surprised than he was disappointed with my uncle's answer.\n'Do you understand the theory of that?' he asked.\n'Not I,' quoth my uncle.\n'But you have some idea of what you talk about?'\n'No more than my horse,' replied my uncle Toby.\n'Gracious heaven!' cried my father, 'there is a worth in thy honest ignorance, brother Toby - 'twere almost a pity to exchange it for knowledge. - But I'll tell thee. To understand what time is, without which we never can comprehend infinity, - we ought seriously to sit down and consider what idea we have of duration, and how we came by it.'\n'Why?'\n'If you will turn your eyes inwards upon your mind,' continued my father, 'you will perceive, brother, that whilst we are talking, and thinking, and smoking our pipes, we know that we exist, and so we estimate the existence, or the continuation of the existence of ourselves, or anything else, commensurate to the succession of any ideas in our minds, the duration of ourselves, or any such other thing co-existing with our thinking - and so according to that preconceived-'\n'You puzzle me to death,' cried my uncle Toby.\n'In every man's head, there is a regular succession of ideas which follow each other in train just like-'\n'A train of artillery?' said my uncle Toby.\n'A train of a fiddle-stick!' quoth my father. '- which follow and succeed one another in our minds like the images in the inside of a lantern turned round by the heat of a candle.'\n'I declare,' quoth my uncle, 'mine are more like a smoke-jack that turns a spit in a chimney.'\n'Then, brother Toby, I have nothing more to say to you upon the subject,' said my father.",
        "paragraph_chars": [
            [
                0,
                198
            ],
            [
                198,
                358
            ],
            [
                358,
                860
            ],
            [
                860,
                931
            ],
            [
                931,
                1009
            ],
            [
                1009,
                1543
            ],
            [
                1543,
                1593
            ],
            [
                1593,
                1618
            ],
            [
                1618,
                1667
            ],
            [
                1667,
                1715
            ],
            [
                1715,
                2059
            ],
            [
                2059,
                2066
            ],
            [
                2066,
                2541
            ],
            [
                2541,
                2588
            ],
            [
                2588,
                2694
            ],
            [
                2694,
                2738
            ],
            [
                2738,
                2919
            ],
            [
                2919,
                3014
            ],
            [
                3014,
                3103
            ]
        ],
        "segment_chars": [
            [
                0,
                198
            ],
            [
                198,
                261
            ],
            [
                261,
                358
            ],
            [
                358,
                860
            ],
            [
                860,
                931
            ],
            [
                931,
                1009
            ],
            [
                1009,
                1216
            ],
            [
                1216,
                1290
            ],
            [
                1290,
                1449
            ],
            [
                1449,
                1543
            ],
            [
                1543,
                1583
            ],
            [
                1583,
                1593
            ],
            [
                1593,
                1618
            ],
            [
                1618,
                1667
            ],
            [
                1667,
                1715
            ],
            [
                1715,
                1734
            ],
            [
                1734,
                1860
            ],
            [
                1860,
                1882
            ],
            [
                1882,
                2059
            ],
            [
                2059,
                2066
            ],
            [
                2066,
                2541
            ],
            [
                2541,
                2588
            ],
            [
                2588,
                2694
            ],
            [
                2694,
                2718
            ],
            [
                2718,
                2738
            ],
            [
                2738,
                2767
            ],
            [
                2767,
                2784
            ],
            [
                2784,
                2919
            ],
            [
                2919,
                3014
            ],
            [
                3014,
                3103
            ]
        ],
        "overlap_chars": [
            [
                1,
                33
            ],
            [
                42,
                74
            ],
            [
                76,
                85
            ],
            [
                86,
                90
            ],
            [
                91,
                94
            ],
            [
                95,
                102
            ],
            [
                103,
                110
            ],
            [
                113,
                151
            ],
            [
                158,
                188
            ],
            [
                189,
                195
            ],
            [
                200,
                204
            ],
            [
                211,
                222
            ],
            [
                223,
                229
            ],
            [
                229,
                237
            ],
            [
                238,
                242
            ],
            [
                242,
                243
            ],
            [
                259,
                260
            ],
            [
                261,
                340
            ],
            [
                344,
                358
            ],
            [
                358,
                380
            ],
            [
                382,
                400
            ],
            [
                412,
                440
            ],
            [
                449,
                450
            ],
            [
                451,
                452
            ],
            [
                453,
                484
            ],
            [
                493,
                509
            ],
            [
                510,
                512
            ],
            [
                515,
                584
            ],
            [
                585,
                593
            ],
            [
                594,
                596
            ],
            [
                602,
                609
            ],
            [
                610,
                615
            ],
            [
                615,
                628
            ],
            [
                634,
                642
            ],
            [
                643,
                660
            ],
            [
                661,
                676
            ],
            [
                686,
                761
            ],
            [
                773,
                798
            ],
            [
                798,
                842
            ],
            [
                849,
                859
            ],
            [
                863,
                888
            ],
            [
                897,
                907
            ],
            [
                909,
                928
            ],
            [
                933,
                951
            ],
            [
                954,
                968
            ],
            [
                973,
                974
            ],
            [
                975,
                976
            ],
            [
                976,
                1006
            ],
            [
                1009,
                1018
            ],
            [
                1019,
                1022
            ],
            [
                1032,
                1068
            ],
            [
                1078,
                1153
            ],
            [
                1163,
                1191
            ],
            [
                1196,
                1216
            ],
            [
                1216,
                1225
            ],
            [
                1232,
                1250
            ],
            [
                1251,
                1264
            ],
            [
                1265,
                1288
            ],
            [
                1290,
                1298
            ],
            [
                1299,
                1360
            ],
            [
                1367,
                1371
            ],
            [
                1372,
                1379
            ],
            [
                1380,
                1398
            ],
            [
                1398,
                1399
            ],
            [
                1400,
                1418
            ],
            [
                1421,
                1423
            ],
            [
                1423,
                1425
            ],
            [
                1431,
                1447
            ],
            [
                1449,
                1466
            ],
            [
                1466,
                1467
            ],
            [
                1468,
                1483
            ],
            [
                1494,
                1518
            ],
            [
                1519,
                1534
            ],
            [
                1541,
                1543
            ],
            [
                1547,
                1580
            ],
            [
                1591,
                1593
            ],
            [
                1594,
                1599
            ],
            [
                1602,
                1618
            ],
            [
                1619,
                1636
            ],
            [
                1642,
                1664
            ],
            [
                1668,
                1689
            ],
            [
                1692,
                1708
            ],
            [
                1716,
                1731
            ],
            [
                1734,
                1750
            ],
            [
                1752,
                1801
            ],
            [
                1809,
                1848
            ],
            [
                1849,
                1860
            ],
            [
                1862,
                1881
            ],
            [
                1882,
                1900
            ],
            [
                1901,
                1905
            ],
            [
                1906,
                1908
            ],
            [
                1908,
                1947
            ],
            [
                1956,
                1957
            ],
            [
                1960,
                2013
            ],
            [
                2014,
                2024
            ],
            [
                2025,
                2033
            ],
            [
                2033,
                2034
            ],
            [
                2039,
                2056
            ],
            [
                2067,
                2116
            ],
            [
                2119,
                2139
            ],
            [
                2141,
                2180
            ],
            [
                2181,
                2183
            ],
            [
                2184,
                2195
            ],
            [
                2195,
                2233
            ],
            [
                2234,
                2249
            ],
            [
                2250,
                2498
            ],
            [
                2501,
                2538
            ],
            [
                2542,
                2564
            ],
            [
                2567,
                2581
            ],
            [
                2586,
                2587
            ],
            [
                2589,
                2597
            ],
            [
                2598,
                2648
            ],
            [
                2649,
                2691
            ],
            [
                2695,
                2715
            ],
            [
                2718,
                2731
            ],
            [
                2739,
                2764
            ],
            [
                2767,
                2782
            ],
            [
                2782,
                2783
            ],
            [
                2787,
                2836
            ],
            [
                2837,
                2871
            ],
            [
                2880,
                2916
            ],
            [
                2920,
                2929
            ],
            [
                2932,
                2946
            ],
            [
                2946,
                2947
            ],
            [
                2949,
                2969
            ],
            [
                2975,
                2980
            ],
            [
                3019,
                3028
            ],
            [
                3033,
                3073
            ],
            [
                3078,
                3085
            ],
            [
                3088,
                3103
            ]
        ],
        "row_chars": [
            [
                0,
                198
            ],
            [
                198,
                261
            ],
            [
                261,
                358
            ],
            [
                358,
                860
            ],
            [
                860,
                931
            ],
            [
                931,
                1009
            ],
            [
                1009,
                1216
            ],
            [
                1216,
                1543
            ],
            [
                1543,
                1583
            ],
            [
                1583,
                1593
            ],
            [
                1593,
                1618
            ],
            [
                1618,
                1667
            ],
            [
                1667,
                1715
            ],
            [
                1715,
                1734
            ],
            [
                1734,
                1860
            ],
            [
                1860,
                1882
            ],
            [
                1882,
                2059
            ],
            [
                2059,
                2066
            ],
            [
                2066,
                2066
            ],
            [
                2066,
                2588
            ],
            [
                2588,
                2588
            ],
            [
                2588,
                2718
            ],
            [
                2718,
                2767
            ],
            [
                2767,
                2919
            ],
            [
                2919,
                3014
            ],
            [
                3014,
                3103
            ],
            [
                3103,
                3103
            ]
        ]
    }
}