{
    "original": {
        "text": "The draw-bridge being held irreparable, _Trim_ was ordered directly to set about another------but not upon the same model: for cardinal _Alberoni's_ intrigues at that time being discovered, and my uncle _Toby_ rightly foreseeing that a flame would inevitably break out betwixt _Spain_ and the Empire, and that the operations of the ensuing campaign must in all likelihood be either in _Naples_ or _Sicily_----he determined upon an _Italian_ bridge--(my uncle _Toby_, by the bye, was not far out of his conjectures)----but my father, who was infinitely the better politician, and took the lead as far of my uncle _Toby_ in the cabinet, as my uncle _Toby_ took it of him in the field------convinced him, that if the king of _Spain_ and the Emperor went together by the ears, _England_ and _France_ and _Holland_ must, by force of their pre-engagements, all enter the lists too; ----and if so, he would say, the combatants, brother _Toby_, as sure as we are alive, will fall to it again, pell-mell, upon the old prizefighting stage of _Flanders_; --then what will you do with your _Italian_ bridge?\n--We will go on with it then upon the old model, cried my uncle _Toby_.\nWhen Corporal _Trim_ had about half finished it in that style----my uncle _Toby_ found out a capital defect in it, which he had never thoroughly considered before. It turned, it seems, upon hinges at both ends of it, opening in the middle, one half of which turning to one side of the fosse, and the other to the other; the advantage of which was this, that by dividing the weight of the bridge into two equal portions, it impowered my uncle _Toby_ to raise it up or let it down with the end of his crutch, and with one hand, which, as his garrison was weak, was as much as he could well spare--but the disadvantages of such a construction were insurmountable; ----for by this means, he would say, I leave one half of my bridge in my enemy's possession----and pray of what use is the other?\nThe natural remedy for this was, no doubt, to have his bridge fast only at one end with hinges, so that the whole might be lifted up together, and stand bolt upright------but that was rejected for the reason given above.\nFor a whole week after he was determined in his mind to have one of that particular construction which is made to draw back horizontally, to hinder a passage; and to thrust forwards again to gain a passage--of which sorts your worship might have seen three famous ones at _Spires_ before its destruction--and one now at _Brisac_, if I mistake not; --but my father advising my uncle _Toby_, with great earnestness, to have nothing more to do with thrusting bridges--and my uncle foreseeing moreover that it would but perpetuate the memory of the Corporal's misfortune--he changed his mind for that of the marquis _d'Hpital's_ invention, which the younger _Bernouilli_ has so well and learnedly described, as your worships may see------_Act. Erud. Lips._ an. 1695--to these a lead weight is an eternal balance, and keeps watch as well as a couple of centinels, inasmuch as the construction of them was a curve line approximating to a cycloid------if not a cycloid itself.\nMy uncle _Toby_ understood the nature of a parabola as well as any man in _England_--but was not quite such a master of the cycloid; ----he talked however about it every day----the bridge went not forwards. ----We'll ask somebody about it, cried my uncle _Toby_ to _Trim_.",
        "paragraph_chars": [
            [
                0,
                1096
            ],
            [
                1096,
                1168
            ],
            [
                1168,
                1959
            ],
            [
                1959,
                2180
            ],
            [
                2180,
                3150
            ],
            [
                3150,
                3422
            ]
        ],
        "segment_chars": [
            [
                0,
                1096
            ],
            [
                1096,
                1168
            ],
            [
                1168,
                1332
            ],
            [
                1332,
                1959
            ],
            [
                1959,
                2180
            ],
            [
                2180,
                2920
            ],
            [
                2920,
                2926
            ],
            [
                2926,
                2937
            ],
            [
                2937,
                3150
            ],
            [
                3150,
                3357
            ],
            [
                3357,
                3422
            ]
        ],
        "overlap_chars": [
            [
                0,
                21
            ],
            [
                27,
                39
            ],
            [
                47,
                58
            ],
            [
                68,
                70
            ],
            [
                81,
                88
            ],
            [
                837,
                838
            ],
            [
                94,
                126
            ],
            [
                194,
                202
            ],
            [
                972,
                974
            ],
            [
                467,
                469
            ],
            [
                210,
                233
            ],
            [
                242,
                247
            ],
            [
                259,
                276
            ],
            [
                278,
                283
            ],
            [
                285,
                313
            ],
            [
                340,
                374
            ],
            [
                382,
                384
            ],
            [
                386,
                392
            ],
            [
                394,
                396
            ],
            [
                401,
                404
            ],
            [
                188,
                189
            ],
            [
                409,
                430
            ],
            [
                659,
                661
            ],
            [
                441,
                447
            ],
            [
                1168,
                1181
            ],
            [
                1189,
                1215
            ],
            [
                1281,
                1282
            ],
            [
                1233,
                1241
            ],
            [
                1249,
                1254
            ],
            [
                1259,
                1260
            ],
            [
                1269,
                1275
            ],
            [
                1283,
                1301
            ],
            [
                1313,
                1332
            ],
            [
                1335,
                1341
            ],
            [
                1353,
                1377
            ],
            [
                1383,
                1416
            ],
            [
                1426,
                1486
            ],
            [
                1488,
                1504
            ],
            [
                1515,
                1519
            ],
            [
                1511,
                1514
            ],
            [
                1519,
                1590
            ],
            [
                1601,
                1609
            ],
            [
                1617,
                1673
            ],
            [
                1486,
                1487
            ],
            [
                1763,
                1784
            ],
            [
                1808,
                1812
            ],
            [
                1833,
                1850
            ],
            [
                1852,
                1865
            ],
            [
                1866,
                1920
            ],
            [
                1341,
                1342
            ],
            [
                1924,
                1957
            ],
            [
                1959,
                1990
            ],
            [
                2002,
                2025
            ],
            [
                2026,
                2124
            ],
            [
                2130,
                2138
            ],
            [
                2178,
                2180
            ],
            [
                2180,
                2196
            ],
            [
                2508,
                2509
            ],
            [
                2553,
                2561
            ],
            [
                2943,
                2945
            ],
            [
                2206,
                2220
            ],
            [
                2233,
                2244
            ],
            [
                2291,
                2385
            ],
            [
                2530,
                2533
            ],
            [
                2534,
                2552
            ],
            [
                2581,
                2588
            ],
            [
                2870,
                2872
            ],
            [
                2594,
                2643
            ],
            [
                2568,
                2569
            ],
            [
                2748,
                2791
            ],
            [
                2793,
                2803
            ],
            [
                2805,
                2814
            ],
            [
                2570,
                2574
            ],
            [
                2952,
                2965
            ],
            [
                2884,
                2886
            ],
            [
                2969,
                2988
            ],
            [
                2221,
                2223
            ],
            [
                3080,
                3087
            ],
            [
                3093,
                3119
            ],
            [
                3125,
                3150
            ],
            [
                3150,
                3158
            ],
            [
                3166,
                3223
            ],
            [
                3225,
                3232
            ],
            [
                3235,
                3281
            ],
            [
                3355,
                3356
            ],
            [
                3361,
                3388
            ],
            [
                3390,
                3395
            ],
            [
                3412,
                3414
            ]
        ],
        "row_chars": [
            [
                0,
                1096
            ],
            [
                1096,
                1168
            ],
            [
                1168,
                1332
            ],
            [
                1332,
                1959
            ],
            [
                1959,
                2180
            ],
            [
                2180,
                3150
            ],
            [
                3150,
                3357
            ],
            [
                3357,
                3422
            ]
        ]
    },
    "abridged": {
        "text": "The draw-bridge being irreparable, Trim was ordered to start another - but not upon the same model: for my uncle Toby rightly foreseeing that warfare would break out betwixt Spain and the Empire, and that the campaign must in all likelihood be in Naples or Sicily, he determined upon an Italian bridge.\nWhen Corporal Trim had about half finished it, my uncle Toby found a defect which he had never considered before. The draw-bridge turned upon hinges at both ends, opening in the middle, one half turning to one side of the fosse, and the other to the other.\nThe advantage of this was, that by dividing the weight of the bridge into two equal portions, it allowed my uncle to raise it up or let it down with the end of his crutch; but the disadvantages were great - 'for by this means,' he would say, 'I leave one half of my bridge in my enemy's possession, and pray of what use is the other?'\nThe natural remedy for this was to have his bridge fastened only at one end with hinges, so that the whole might be lifted up together, and stand bolt upright - but that would require too much strength to operate.\nFor a whole week, my uncle Toby was determined to have one constructed to draw back horizontally, to hinder a passage; and to thrust forwards again to gain a passage - but on my father advising him earnestly to have nothing more to do with thrusting bridges, he changed his mind for that of the marquis d'Hpital's invention: with a lead weight as an eternal balance, constructed in a curve approximating to a cycloid - if not a cycloid itself.\nMy uncle Toby understood the nature of a parabola as well as any man in England, but was not quite such a master of the cycloid.\n'We'll ask somebody about it,' he cried to Trim.",
        "paragraph_chars": [
            [
                0,
                303
            ],
            [
                303,
                560
            ],
            [
                560,
                895
            ],
            [
                895,
                1109
            ],
            [
                1109,
                1553
            ],
            [
                1553,
                1682
            ],
            [
                1682,
                1730
            ]
        ],
        "segment_chars": [
            [
                0,
                303
            ],
            [
                303,
                417
            ],
            [
                417,
                560
            ],
            [
                560,
                895
            ],
            [
                895,
                1109
            ],
            [
                1109,
                1553
            ],
            [
                1553,
                1682
            ],
            [
                1682,
                1730
            ]
        ],
        "overlap_chars": [
            [
                0,
                21
            ],
            [
                22,
                34
            ],
            [
                40,
                51
            ],
            [
                52,
                54
            ],
            [
                61,
                68
            ],
            [
                69,
                70
            ],
            [
                71,
                103
            ],
            [
                104,
                112
            ],
            [
                113,
                115
            ],
            [
                115,
                117
            ],
            [
                118,
                141
            ],
            [
                150,
                155
            ],
            [
                156,
                173
            ],
            [
                174,
                179
            ],
            [
                180,
                208
            ],
            [
                209,
                243
            ],
            [
                244,
                246
            ],
            [
                247,
                253
            ],
            [
                254,
                256
            ],
            [
                260,
                263
            ],
            [
                263,
                264
            ],
            [
                265,
                286
            ],
            [
                287,
                289
            ],
            [
                295,
                301
            ],
            [
                303,
                316
            ],
            [
                322,
                348
            ],
            [
                348,
                349
            ],
            [
                350,
                358
            ],
            [
                364,
                369
            ],
            [
                370,
                371
            ],
            [
                372,
                378
            ],
            [
                379,
                397
            ],
            [
                398,
                417
            ],
            [
                433,
                439
            ],
            [
                440,
                464
            ],
            [
                464,
                497
            ],
            [
                498,
                558
            ],
            [
                560,
                576
            ],
            [
                577,
                581
            ],
            [
                582,
                585
            ],
            [
                585,
                656
            ],
            [
                665,
                673
            ],
            [
                674,
                730
            ],
            [
                730,
                731
            ],
            [
                732,
                753
            ],
            [
                754,
                758
            ],
            [
                768,
                785
            ],
            [
                788,
                801
            ],
            [
                803,
                857
            ],
            [
                857,
                858
            ],
            [
                859,
                892
            ],
            [
                895,
                926
            ],
            [
                927,
                950
            ],
            [
                955,
                1053
            ],
            [
                1056,
                1064
            ],
            [
                1107,
                1109
            ],
            [
                1109,
                1125
            ],
            [
                1125,
                1126
            ],
            [
                1127,
                1135
            ],
            [
                1136,
                1138
            ],
            [
                1141,
                1155
            ],
            [
                1156,
                1167
            ],
            [
                1180,
                1274
            ],
            [
                1277,
                1280
            ],
            [
                1284,
                1302
            ],
            [
                1307,
                1314
            ],
            [
                1314,
                1316
            ],
            [
                1317,
                1366
            ],
            [
                1366,
                1367
            ],
            [
                1368,
                1411
            ],
            [
                1412,
                1422
            ],
            [
                1423,
                1432
            ],
            [
                1434,
                1438
            ],
            [
                1439,
                1452
            ],
            [
                1453,
                1455
            ],
            [
                1456,
                1475
            ],
            [
                1488,
                1490
            ],
            [
                1491,
                1498
            ],
            [
                1499,
                1525
            ],
            [
                1528,
                1553
            ],
            [
                1553,
                1561
            ],
            [
                1567,
                1624
            ],
            [
                1625,
                1632
            ],
            [
                1634,
                1680
            ],
            [
                1680,
                1681
            ],
            [
                1683,
                1710
            ],
            [
                1716,
                1721
            ],
            [
                1722,
                1724
            ]
        ],
        "row_chars": [
            [
                0,
                303
            ],
            [
                303,
                303
            ],
            [
                303,
                417
            ],
            [
                417,
                895
            ],
            [
                895,
                1109
            ],
            [
                1109,
                1553
            ],
            [
                1553,
                1682
            ],
            [
                1682,
                1730
            ]
        ]
    }
}