{
    "original": {
        "text": "--_De gustibus non est disputandum_; --that is, there is no disputing against HOBBY-HORSES; and for my part, I seldom do; nor could I with any sort of grace, had I been an enemy to them at the bottom; for happening, at certain intervals and changes of the moon, to be both fidler and painter, according as the fly stings: --Be it known to you, that I keep a couple of pads myself, upon which, in their turns, (nor do I care who knows it) I frequently ride out and take the air; --though sometimes, to my shame be it spoken, I take somewhat longer journies than what a wise man would think altogether right. --But the truth is, --I am not a wise man; --and besides am a mortal of so little consequence in the world, it is not much matter what I do: so I seldom fret or fume at all about it: Nor does it much disturb my rest, when I see such great Lords and tall Personages as hereafter follow; --such, for instance, as my Lord A, B, C, D, E, F, G, H, I, K, L, M, N, O, P, Q, and so on, all of a row, mounted upon their several horses; --some with large stirrups, getting on in a more grave and sober pace; ----others on the contrary, tucked up to their very chins, with whips across their mouths, scouring and scampering it away like so many little party-coloured devils astride a mortgage, --and as if some of them were resolved to break their necks. ----So much the better--say I to myself; --for in case the worst should happen, the world will make a shift to do excellently well without them; and for the rest, ----why ----God speed them----e'en let them ride on without opposition from me; for were their lordships unhorsed this very night--'tis ten to one but that many of them would be worse mounted by one half before to-morrow morning.\nNot one of these instances therefore can be said to break in upon my rest. ----But there is an instance, which I own puts me off my guard, and that is, when I see one born for great actions, and what is still more for his honour, whose nature ever inclines him to good ones; --when I behold such a one, my Lord, like yourself, whose principles and conduct are as generous and noble as his blood, and whom, for that reason, a corrupt world cannot spare one moment; --when I see such a one, my Lord, mounted, though it is but for a minute beyond the time which my love to my country has prescribed to him, and my zeal for his glory wishes, --then, my Lord, I cease to be a philosopher, and in the first transport of an honest impatience, I wish the HOBBY-HORSE, with all his fraternity, at the Devil.\n\"MY LORD,\n\"I maintain this to be a dedication, notwithstanding its singularity in the three great essentials of matter, form, and place: I beg, therefore, you will accept it as such, and that you will permit me to lay it, with the most respectful humility, at your Lordship's feet, --when you are upon them, --which you can be when you please; --and that is, my Lord, whenever there is occasion for it, and I will add, to the best purposes too. I have the honour to be,\n\"_My Lord, Your Lordship's most obedient, and most devoted, and most humble servant_,\nTRISTRAM SHANDY.\"",
        "paragraph_chars": [
            [
                0,
                1744
            ],
            [
                1744,
                2543
            ],
            [
                2543,
                2553
            ],
            [
                2553,
                3013
            ],
            [
                3013,
                3099
            ],
            [
                3099,
                3116
            ]
        ],
        "segment_chars": [
            [
                0,
                607
            ],
            [
                607,
                1351
            ],
            [
                1351,
                1744
            ],
            [
                1744,
                1819
            ],
            [
                1819,
                2543
            ],
            [
                2543,
                2553
            ],
            [
                2553,
                2988
            ],
            [
                2988,
                3013
            ],
            [
                3013,
                3099
            ],
            [
                3099,
                3116
            ]
        ],
        "overlap_chars": [
            [
                3,
                34
            ],
            [
                35,
                36
            ],
            [
                39,
                59
            ],
            [
                78,
                90
            ],
            [
                96,
                142
            ],
            [
                151,
                157
            ],
            [
                162,
                163
            ],
            [
                214,
                226
            ],
            [
                249,
                272
            ],
            [
                280,
                291
            ],
            [
                291,
                292
            ],
            [
                349,
                367
            ],
            [
                373,
                391
            ],
            [
                409,
                410
            ],
            [
                92,
                95
            ],
            [
                417,
                418
            ],
            [
                414,
                416
            ],
            [
                419,
                477
            ],
            [
                480,
                496
            ],
            [
                540,
                546
            ],
            [
                556,
                560
            ],
            [
                566,
                588
            ],
            [
                600,
                607
            ],
            [
                609,
                626
            ],
            [
                629,
                649
            ],
            [
                652,
                666
            ],
            [
                676,
                700
            ],
            [
                713,
                717
            ],
            [
                721,
                724
            ],
            [
                730,
                764
            ],
            [
                780,
                788
            ],
            [
                790,
                834
            ],
            [
                840,
                871
            ],
            [
                899,
                900
            ],
            [
                835,
                839
            ],
            [
                915,
                920
            ],
            [
                926,
                964
            ],
            [
                974,
                1017
            ],
            [
                891,
                892
            ],
            [
                1036,
                1061
            ],
            [
                1083,
                1088
            ],
            [
                1032,
                1033
            ],
            [
                1209,
                1289
            ],
            [
                1296,
                1301
            ],
            [
                1315,
                1351
            ],
            [
                1355,
                1373
            ],
            [
                1375,
                1380
            ],
            [
                1592,
                1597
            ],
            [
                1406,
                1445
            ],
            [
                1465,
                1513
            ],
            [
                1518,
                1521
            ],
            [
                1549,
                1565
            ],
            [
                1390,
                1391
            ],
            [
                1394,
                1397
            ],
            [
                1603,
                1618
            ],
            [
                1598,
                1602
            ],
            [
                1619,
                1643
            ],
            [
                1650,
                1660
            ],
            [
                1683,
                1705
            ],
            [
                1718,
                1724
            ],
            [
                1735,
                1744
            ],
            [
                1752,
                1770
            ],
            [
                1817,
                1819
            ],
            [
                1823,
                1933
            ],
            [
                2035,
                2055
            ],
            [
                2061,
                2138
            ],
            [
                2210,
                2250
            ],
            [
                2384,
                2388
            ],
            [
                2399,
                2431
            ],
            [
                2504,
                2508
            ],
            [
                2461,
                2478
            ],
            [
                2480,
                2502
            ],
            [
                2529,
                2543
            ],
            [
                2547,
                2553
            ],
            [
                2554,
                2589
            ],
            [
                2606,
                2609
            ],
            [
                2655,
                2823
            ],
            [
                2827,
                2850
            ],
            [
                2853,
                2885
            ],
            [
                2889,
                2944
            ],
            [
                2986,
                2988
            ],
            [
                2988,
                3013
            ],
            [
                3015,
                3023
            ],
            [
                3024,
                3054
            ],
            [
                3055,
                3072
            ],
            [
                3073,
                3096
            ],
            [
                3097,
                3099
            ],
            [
                3099,
                3114
            ]
        ],
        "row_chars": [
            [
                0,
                607
            ],
            [
                607,
                1351
            ],
            [
                1351,
                1744
            ],
            [
                1744,
                1819
            ],
            [
                1819,
                2543
            ],
            [
                2543,
                2553
            ],
            [
                2553,
                2988
            ],
            [
                2988,
                3013
            ],
            [
                3013,
                3099
            ],
            [
                3099,
                3116
            ]
        ]
    },
    "abridged": {
        "text": "De gustibus non est disputandum; that is, there is no arguing with Hobby-Horses. For my part, I seldom do; nor could I with any grace, since I happen, at certain phases of the moon, to be both fiddler and painter. Indeed, I keep a couple of nags myself, upon which (and I do not care who knows it) I frequently ride out and take the air; though sometimes on longer journeys than a wise man would think right. But the truth is, I am not a wise man; - and besides am of so little consequence, it does not matter what I do: so I seldom fret about it.\nNor does it much disturb my rest, when I see great Lords and tall Personages, such as my Lords A, B, C, D, E, F, G, H, I, K, L, M, N, and so on, all of a row, mounted upon their hobby-horses; - some with large stirrups, stepping gravely; others scampering it away like so many little party-coloured devils astride a mortgage, as if they were resolved to break their necks. So much the better, say I; for if the worst should happen, the world will manage excellently well without them; and for the rest, why, let them ride on; for if their lordships were unhorsed this very night, ten to one they would be worse mounted before tomorrow morning.\nNone of these instances disturbs me. But there is an instance, which I own puts me off my guard, and that is, when I see one born for great actions - such a one, my Lord, as yourself, whose principles and conduct are as generous and noble as his blood - when I see such a one, my Lord, mounted, then I cease to be a philosopher, and with honest impatience I wish the Hobby-Horse at the Devil.\n'My Lord,\n'I maintain this to be a dedication, despite its unusual matter, form, and place: I beg, therefore, you will accept it as such, and that you will permit me to lay it, with the most respectful humility, at your Lordship's feet - when you are upon them, which you can be when you please - and that is, my Lord, whenever there is occasion for it. I have the honour to be,\nMy Lord,\nYour Lordship's most obedient,\nand most devoted,\nand most humble servant,\nTRISTRAM SHANDY.",
        "paragraph_chars": [
            [
                0,
                548
            ],
            [
                548,
                1192
            ],
            [
                1192,
                1585
            ],
            [
                1585,
                1595
            ],
            [
                1595,
                1964
            ],
            [
                1964,
                1973
            ],
            [
                1973,
                2004
            ],
            [
                2004,
                2022
            ],
            [
                2022,
                2047
            ],
            [
                2047,
                2063
            ]
        ],
        "segment_chars": [
            [
                0,
                81
            ],
            [
                81,
                214
            ],
            [
                214,
                409
            ],
            [
                409,
                548
            ],
            [
                548,
                921
            ],
            [
                921,
                1192
            ],
            [
                1192,
                1229
            ],
            [
                1229,
                1585
            ],
            [
                1585,
                1595
            ],
            [
                1595,
                1939
            ],
            [
                1939,
                1964
            ],
            [
                1964,
                1973
            ],
            [
                1973,
                2004
            ],
            [
                2004,
                2022
            ],
            [
                2022,
                2047
            ],
            [
                2047,
                2063
            ]
        ],
        "overlap_chars": [
            [
                0,
                31
            ],
            [
                31,
                32
            ],
            [
                33,
                53
            ],
            [
                67,
                79
            ],
            [
                81,
                127
            ],
            [
                128,
                134
            ],
            [
                141,
                142
            ],
            [
                149,
                161
            ],
            [
                169,
                192
            ],
            [
                201,
                212
            ],
            [
                220,
                221
            ],
            [
                222,
                240
            ],
            [
                246,
                264
            ],
            [
                265,
                266
            ],
            [
                266,
                269
            ],
            [
                270,
                271
            ],
            [
                272,
                274
            ],
            [
                279,
                337
            ],
            [
                338,
                354
            ],
            [
                358,
                364
            ],
            [
                374,
                378
            ],
            [
                379,
                401
            ],
            [
                402,
                409
            ],
            [
                409,
                426
            ],
            [
                427,
                447
            ],
            [
                450,
                464
            ],
            [
                465,
                489
            ],
            [
                489,
                493
            ],
            [
                499,
                502
            ],
            [
                503,
                537
            ],
            [
                538,
                546
            ],
            [
                548,
                592
            ],
            [
                593,
                624
            ],
            [
                624,
                625
            ],
            [
                626,
                630
            ],
            [
                631,
                636
            ],
            [
                643,
                681
            ],
            [
                682,
                725
            ],
            [
                738,
                739
            ],
            [
                742,
                767
            ],
            [
                777,
                782
            ],
            [
                784,
                785
            ],
            [
                793,
                873
            ],
            [
                874,
                879
            ],
            [
                885,
                921
            ],
            [
                921,
                939
            ],
            [
                941,
                946
            ],
            [
                946,
                951
            ],
            [
                955,
                994
            ],
            [
                1002,
                1050
            ],
            [
                1051,
                1054
            ],
            [
                1056,
                1072
            ],
            [
                1072,
                1073
            ],
            [
                1074,
                1077
            ],
            [
                1081,
                1096
            ],
            [
                1097,
                1101
            ],
            [
                1102,
                1126
            ],
            [
                1128,
                1138
            ],
            [
                1144,
                1166
            ],
            [
                1167,
                1173
            ],
            [
                1183,
                1192
            ],
            [
                1197,
                1215
            ],
            [
                1227,
                1229
            ],
            [
                1229,
                1339
            ],
            [
                1342,
                1362
            ],
            [
                1366,
                1443
            ],
            [
                1446,
                1486
            ],
            [
                1487,
                1491
            ],
            [
                1492,
                1524
            ],
            [
                1525,
                1529
            ],
            [
                1530,
                1547
            ],
            [
                1548,
                1570
            ],
            [
                1571,
                1585
            ],
            [
                1589,
                1595
            ],
            [
                1596,
                1631
            ],
            [
                1640,
                1643
            ],
            [
                1652,
                1820
            ],
            [
                1823,
                1846
            ],
            [
                1847,
                1879
            ],
            [
                1882,
                1937
            ],
            [
                1937,
                1939
            ],
            [
                1939,
                1964
            ],
            [
                1964,
                1972
            ],
            [
                1973,
                2003
            ],
            [
                2004,
                2021
            ],
            [
                2022,
                2045
            ],
            [
                2045,
                2047
            ],
            [
                2047,
                2062
            ]
        ],
        "row_chars": [
            [
                0,
                409
            ],
            [
                409,
                921
            ],
            [
                921,
                1192
            ],
            [
                1192,
                1229
            ],
            [
                1229,
                1585
            ],
            [
                1585,
                1595
            ],
            [
                1595,
                1939
            ],
            [
                1939,
                1964
            ],
            [
                1964,
                2047
            ],
            [
                2047,
                2063
            ]
        ]
    }
}