{
    "original": {
        "text": "From the first moment I sat down to write my life for the amusement of the world, and my opinions for its instruction, has a cloud insensibly been gathering over my father. ----A tide of little evils and distresses has been setting in against him. --Not one thing, as he observed himself, has gone right: and now is the storm thicken'd and going to break, and pour down full upon his head.\nI enter upon this part of my story in the most pensive and melancholy frame of mind that ever sympathetic breast was touched with. ----My nerves relax as I tell it. ----Every line I write, I feel an abatement of the quickness of my pulse, and of that careless alacrity with it, which every day of my life prompts me to say and write a thousand things I should not. ----And this moment that I last dipp'd my pen into my ink, I could not help taking notice what a cautious air of sad composure and solemnity there appear'd in my manner of doing it. ----Lord! how different from the rash jerks and hair-brain'd squirts thou art wont, _Tristram_, to transact it with in other humours--dropping thy pen----spurting thy ink about thy table and thy books--as if thy pen and thy ink, thy books and furniture cost thee nothing!",
        "paragraph_chars": [
            [
                0,
                390
            ],
            [
                390,
                1208
            ]
        ],
        "segment_chars": [
            [
                0,
                173
            ],
            [
                173,
                248
            ],
            [
                248,
                390
            ],
            [
                390,
                521
            ],
            [
                521,
                555
            ],
            [
                555,
                755
            ],
            [
                755,
                937
            ],
            [
                937,
                947
            ],
            [
                947,
                1208
            ]
        ],
        "overlap_chars": [
            [
                0,
                41
            ],
            [
                50,
                67
            ],
            [
                82,
                85
            ],
            [
                106,
                117
            ],
            [
                68,
                81
            ],
            [
                123,
                130
            ],
            [
                119,
                122
            ],
            [
                142,
                146
            ],
            [
                147,
                173
            ],
            [
                177,
                248
            ],
            [
                250,
                279
            ],
            [
                287,
                325
            ],
            [
                340,
                354
            ],
            [
                356,
                390
            ],
            [
                390,
                427
            ],
            [
                432,
                473
            ],
            [
                519,
                521
            ],
            [
                780,
                781
            ],
            [
                794,
                830
            ],
            [
                845,
                860
            ],
            [
                868,
                871
            ],
            [
                882,
                892
            ],
            [
                861,
                864
            ],
            [
                933,
                937
            ],
            [
                941,
                947
            ],
            [
                947,
                974
            ],
            [
                981,
                990
            ],
            [
                998,
                1020
            ],
            [
                1027,
                1030
            ],
            [
                1031,
                1035
            ],
            [
                1053,
                1061
            ],
            [
                1071,
                1087
            ],
            [
                1095,
                1127
            ],
            [
                1132,
                1137
            ],
            [
                1139,
                1144
            ],
            [
                1190,
                1208
            ]
        ],
        "row_chars": [
            [
                0,
                173
            ],
            [
                173,
                248
            ],
            [
                248,
                390
            ],
            [
                390,
                521
            ],
            [
                521,
                555
            ],
            [
                555,
                755
            ],
            [
                755,
                937
            ],
            [
                937,
                947
            ],
            [
                947,
                1208
            ]
        ]
    },
    "abridged": {
        "text": "From the first moment I sat down to write this for the amusement and instruction of the world, a cloud has been slowly gathering over my father. A tide of little evils and distresses has been setting in against him. - Not one thing, as he observed, has gone right: and now is the storm going to break and pour down full upon his head.\nI enter upon this part of my story in a most pensive and melancholy frame of mind. Just now, when I dipped my pen into my ink, I could not help noticing with what a cautious, sad and solemn air I did it. - Lord! how different from the rash and hair-brained squirts thou art wont, Tristram, to use in other moods - dropping thy pen - spurting thy ink about thy table and books - as if they cost thee nothing!",
        "paragraph_chars": [
            [
                0,
                335
            ],
            [
                335,
                742
            ]
        ],
        "segment_chars": [
            [
                0,
                145
            ],
            [
                145,
                216
            ],
            [
                216,
                335
            ],
            [
                335,
                418
            ],
            [
                418,
                539
            ],
            [
                539,
                547
            ],
            [
                547,
                742
            ]
        ],
        "overlap_chars": [
            [
                0,
                41
            ],
            [
                47,
                64
            ],
            [
                65,
                68
            ],
            [
                69,
                80
            ],
            [
                81,
                94
            ],
            [
                95,
                102
            ],
            [
                103,
                106
            ],
            [
                107,
                111
            ],
            [
                119,
                145
            ],
            [
                145,
                216
            ],
            [
                218,
                247
            ],
            [
                247,
                285
            ],
            [
                286,
                300
            ],
            [
                301,
                335
            ],
            [
                335,
                372
            ],
            [
                375,
                416
            ],
            [
                416,
                418
            ],
            [
                433,
                434
            ],
            [
                442,
                478
            ],
            [
                493,
                508
            ],
            [
                510,
                513
            ],
            [
                514,
                524
            ],
            [
                525,
                528
            ],
            [
                535,
                539
            ],
            [
                541,
                547
            ],
            [
                547,
                574
            ],
            [
                575,
                584
            ],
            [
                592,
                614
            ],
            [
                620,
                623
            ],
            [
                623,
                627
            ],
            [
                632,
                640
            ],
            [
                649,
                665
            ],
            [
                672,
                704
            ],
            [
                705,
                710
            ],
            [
                713,
                718
            ],
            [
                724,
                742
            ]
        ],
        "row_chars": [
            [
                0,
                145
            ],
            [
                145,
                216
            ],
            [
                216,
                335
            ],
            [
                335,
                418
            ],
            [
                418,
                418
            ],
            [
                418,
                418
            ],
            [
                418,
                539
            ],
            [
                539,
                547
            ],
            [
                547,
                742
            ]
        ]
    }
}