{
    "original": {
        "text": "----I won't go about to argue the point with you--'tis so----and I am persuaded of it, madam, as much as can be, \"That both man and woman bear pain or sorrow (and, for aught I know, pleasure too) best in a horizontal position.\"\nThe moment my father got up into his chamber, he threw himself prostrate across the bed in the wildest disorder imaginable, but at the same time in the most lamentable attitude of a man borne down with sorrows, that ever the eye of pity dropp'd a tear for. ----The palm of his right hand, as he fell upon the bed, receiving his forehead, and covering the greatest part of both his eyes, gently sunk down with his head (his elbow giving way backwards) till his nose touch'd the quilt; ----his left arm hung insensible over the side of the bed, his knuckles reclining upon the handle of the chamber-pot, which peep'd out beyond the valance--his right leg (his left being drawn up towards his body) hung half over the side of the bed, the edge of it pressing upon his shin-bone --He felt it not. A fix'd, inflexible sorrow took possession of every line of his face. --He sigh'd once----heaved his breast often--but uttered not a word.\nAn old set-stitch'd chair, valanced and fringed around with party-coloured worsted bobs, stood at the bed's head, opposite to the side where my father's head reclined. --My uncle _Toby_ sat him down in it.\nBefore an affliction is digested--consolation ever comes too soon; --and after it is digested--it comes too late: so that you see, madam, there is but a mark between these two, as fine almost as a hair, for a comforter to take aim at: my uncle _Toby_ was always either on this side, or on that of it, and would often say, he believed in his heart he could as soon hit the longitude; for this reason, when he sat down in the chair, he drew the curtain a little forwards, and having a tear at every one's service----he pull'd out a cambrick handkerchief----gave a low sigh----but held his peace.",
        "paragraph_chars": [
            [
                0,
                228
            ],
            [
                228,
                1160
            ],
            [
                1160,
                1366
            ],
            [
                1366,
                1959
            ]
        ],
        "segment_chars": [
            [
                0,
                228
            ],
            [
                228,
                485
            ],
            [
                485,
                1021
            ],
            [
                1021,
                1091
            ],
            [
                1091,
                1160
            ],
            [
                1160,
                1328
            ],
            [
                1328,
                1366
            ],
            [
                1366,
                1959
            ]
        ],
        "overlap_chars": [
            [
                65,
                79
            ],
            [
                85,
                93
            ],
            [
                50,
                51
            ],
            [
                114,
                225
            ],
            [
                228,
                252
            ],
            [
                256,
                276
            ],
            [
                277,
                322
            ],
            [
                396,
                437
            ],
            [
                483,
                485
            ],
            [
                489,
                515
            ],
            [
                570,
                578
            ],
            [
                600,
                614
            ],
            [
                520,
                522
            ],
            [
                615,
                631
            ],
            [
                679,
                692
            ],
            [
                701,
                711
            ],
            [
                716,
                733
            ],
            [
                745,
                828
            ],
            [
                867,
                880
            ],
            [
                929,
                938
            ],
            [
                951,
                983
            ],
            [
                989,
                1002
            ],
            [
                1005,
                1021
            ],
            [
                1048,
                1091
            ],
            [
                1093,
                1095
            ],
            [
                1103,
                1107
            ],
            [
                1118,
                1134
            ],
            [
                1136,
                1160
            ],
            [
                1160,
                1166
            ],
            [
                1180,
                1186
            ],
            [
                1200,
                1207
            ],
            [
                1215,
                1219
            ],
            [
                1243,
                1272
            ],
            [
                1326,
                1328
            ],
            [
                1330,
                1338
            ],
            [
                1346,
                1349
            ],
            [
                1354,
                1366
            ],
            [
                1366,
                1398
            ],
            [
                1541,
                1542
            ],
            [
                1417,
                1432
            ],
            [
                1435,
                1459
            ],
            [
                1461,
                1512
            ],
            [
                1517,
                1541
            ],
            [
                1543,
                1550
            ],
            [
                1558,
                1599
            ],
            [
                1601,
                1609
            ],
            [
                1617,
                1670
            ],
            [
                1713,
                1721
            ],
            [
                1730,
                1737
            ],
            [
                1747,
                1748
            ],
            [
                1764,
                1782
            ],
            [
                1795,
                1825
            ],
            [
                1686,
                1687
            ],
            [
                1890,
                1895
            ],
            [
                1905,
                1917
            ],
            [
                1926,
                1936
            ],
            [
                1940,
                1959
            ]
        ],
        "row_chars": [
            [
                0,
                228
            ],
            [
                228,
                485
            ],
            [
                485,
                1021
            ],
            [
                1021,
                1091
            ],
            [
                1091,
                1160
            ],
            [
                1160,
                1328
            ],
            [
                1328,
                1366
            ],
            [
                1366,
                1959
            ]
        ]
    },
    "abridged": {
        "text": "I am persuaded, madam, 'That both man and woman bear pain or sorrow (and, for aught I know, pleasure too) best in a horizontal position.'\nThe moment my father got into his chamber, he wildly threw himself prostrate across the bed in the attitude of a man borne down with sorrows. - The palm of his right hand covering both his eyes, he gently sunk down till his nose touched the quilt; his left arm hung over the side of the bed, his knuckles reclining upon the handle of the chamber-pot - his right leg dangled half over the bed, the edge of it pressing on his shin-bone.\n- He felt it not. Sorrow took possession of every line of his face. He sighed once - heaved his breast often - but uttered not a word.\nAn old chair, fringed with woollen bobs, stood at the bed's head. My uncle Toby sat down in it.\nBefore an affliction is digested, consolation always comes too soon; and after it is digested - it comes too late: so that you see, madam, there is only a mark between these two as fine as a hair, for a comforter to take aim at. My uncle Toby was always either on this side, or on that of it, and did not believe he could hit the mark; therefore, when he sat down, he drew the curtain a little, pulled out a handkerchief - gave a low sigh - but held his peace.",
        "paragraph_chars": [
            [
                0,
                138
            ],
            [
                138,
                573
            ],
            [
                573,
                708
            ],
            [
                708,
                804
            ],
            [
                804,
                1264
            ]
        ],
        "segment_chars": [
            [
                0,
                138
            ],
            [
                138,
                280
            ],
            [
                280,
                573
            ],
            [
                573,
                591
            ],
            [
                591,
                641
            ],
            [
                641,
                708
            ],
            [
                708,
                774
            ],
            [
                774,
                804
            ],
            [
                804,
                1033
            ],
            [
                1033,
                1264
            ]
        ],
        "overlap_chars": [
            [
                0,
                14
            ],
            [
                14,
                22
            ],
            [
                23,
                24
            ],
            [
                24,
                135
            ],
            [
                138,
                162
            ],
            [
                163,
                183
            ],
            [
                191,
                236
            ],
            [
                237,
                278
            ],
            [
                278,
                280
            ],
            [
                282,
                308
            ],
            [
                309,
                317
            ],
            [
                318,
                332
            ],
            [
                333,
                335
            ],
            [
                336,
                352
            ],
            [
                353,
                366
            ],
            [
                375,
                385
            ],
            [
                386,
                403
            ],
            [
                404,
                487
            ],
            [
                490,
                503
            ],
            [
                512,
                521
            ],
            [
                522,
                554
            ],
            [
                558,
                571
            ],
            [
                575,
                591
            ],
            [
                598,
                641
            ],
            [
                641,
                643
            ],
            [
                651,
                655
            ],
            [
                665,
                681
            ],
            [
                684,
                708
            ],
            [
                708,
                714
            ],
            [
                715,
                721
            ],
            [
                722,
                729
            ],
            [
                730,
                734
            ],
            [
                743,
                772
            ],
            [
                772,
                774
            ],
            [
                774,
                782
            ],
            [
                788,
                791
            ],
            [
                792,
                804
            ],
            [
                804,
                836
            ],
            [
                836,
                837
            ],
            [
                857,
                872
            ],
            [
                873,
                897
            ],
            [
                900,
                951
            ],
            [
                957,
                981
            ],
            [
                982,
                989
            ],
            [
                990,
                1031
            ],
            [
                1033,
                1041
            ],
            [
                1047,
                1100
            ],
            [
                1117,
                1125
            ],
            [
                1126,
                1133
            ],
            [
                1138,
                1139
            ],
            [
                1149,
                1167
            ],
            [
                1167,
                1197
            ],
            [
                1197,
                1198
            ],
            [
                1206,
                1211
            ],
            [
                1212,
                1224
            ],
            [
                1232,
                1242
            ],
            [
                1245,
                1264
            ]
        ],
        "row_chars": [
            [
                0,
                138
            ],
            [
                138,
                280
            ],
            [
                280,
                591
            ],
            [
                591,
                641
            ],
            [
                641,
                708
            ],
            [
                708,
                774
            ],
            [
                774,
                804
            ],
            [
                804,
                1264
            ]
        ]
    }
}