{
    "original": {
        "text": "----I think it a very unreasonable demand--cried my great-grandfather, twisting up the paper, and throwing it upon the table. ----By this account, madam, you have but two thousand pounds fortune, and not a shilling more--and you insist upon having three hundred pounds a year jointure for it.------\n--\"Because,\" replied my great-grandmother, \"you have little or no nose, Sir.\"--\nNow before I venture to make use of the word _Nose_ a second time--to avoid all confusion in what will be said upon it, in this interesting part of my story, it may not be amiss to explain my own meaning, and define, with all possible exactness and precision, what I would willingly be understood to mean by the term: being of opinion, that 'tis owing to the negligence and perverseness of writers in despising this precaution, and to nothing else----that all the polemical writings in divinity are not as clear and demonstrative as those upon _a Will o' the Wisp_, or any other sound part of philosophy, and natural pursuit; in order to which, what have you to do, before you set out, unless you intend to go puzzling on to the day of judgment----but to give the world a good definition, and stand to it, of the main word you have most occasion for----changing it, Sir, as you would a guinea, into small coin? --which done--let the father of confusion puzzle you, if he can; or put a different idea either into your head, or your reader's head, if he knows how.\nIn books of strict morality and close reasoning, such as this I am engaged in--the neglect is inexcusable; and Heaven is witness, how the world has revenged itself upon me for leaving so many openings to equivocal strictures--and for depending so much as I have done, all along, upon the cleanliness of my readers' imaginations.\n----Here are two senses, cried _Eugenius_, as we walk'd along, pointing with the forefinger of his right hand to the word _Crevice_, in the one hundred and seventy-eighth page of the first volume of this book of books; ------here are two senses--quoth he --And here are two roads, replied I, turning short upon him----a dirty and a clean one----which shall we take? --The clean, by all means, replied _Eugenius_. _Eugenius_, said I, stepping before him, and laying my hand upon his breast----to define--is to distrust. ----Thus I triumph'd over _Eugenius_; but I triumph'd over him as I always do, like a fool. ----'Tis my comfort, however, I am not an obstinate one: therefore\nI define a nose as follows--intreating only beforehand, and beseeching my readers, both male and female, of what age, complexion, and condition soever, for the love of God and their own souls, to guard against the temptations and suggestions of the devil, and suffer him by no art or wile to put any other ideas into their minds, than what I put into my definition --For by the word _Nose_, throughout all this long chapter of noses, and in every other part of my work, where the word _Nose_ occurs --I declare, by that word I mean a nose, and nothing more, or less.",
        "paragraph_chars": [
            [
                0,
                299
            ],
            [
                299,
                379
            ],
            [
                379,
                1442
            ],
            [
                1442,
                1771
            ],
            [
                1771,
                2449
            ],
            [
                2449,
                3015
            ]
        ],
        "segment_chars": [
            [
                0,
                126
            ],
            [
                126,
                299
            ],
            [
                299,
                379
            ],
            [
                379,
                1290
            ],
            [
                1290,
                1442
            ],
            [
                1442,
                1771
            ],
            [
                1771,
                2137
            ],
            [
                2137,
                2184
            ],
            [
                2184,
                2290
            ],
            [
                2290,
                2382
            ],
            [
                2382,
                2449
            ],
            [
                2449,
                3015
            ]
        ],
        "overlap_chars": [
            [
                4,
                41
            ],
            [
                49,
                126
            ],
            [
                130,
                162
            ],
            [
                167,
                194
            ],
            [
                196,
                199
            ],
            [
                225,
                284
            ],
            [
                302,
                309
            ],
            [
                312,
                341
            ],
            [
                343,
                374
            ],
            [
                379,
                391
            ],
            [
                408,
                411
            ],
            [
                415,
                423
            ],
            [
                446,
                468
            ],
            [
                499,
                536
            ],
            [
                588,
                594
            ],
            [
                639,
                645
            ],
            [
                679,
                705
            ],
            [
                734,
                737
            ],
            [
                706,
                713
            ],
            [
                715,
                719
            ],
            [
                769,
                776
            ],
            [
                790,
                805
            ],
            [
                403,
                407
            ],
            [
                882,
                890
            ],
            [
                909,
                911
            ],
            [
                924,
                942
            ],
            [
                1005,
                1028
            ],
            [
                1034,
                1037
            ],
            [
                1029,
                1033
            ],
            [
                1038,
                1123
            ],
            [
                1127,
                1228
            ],
            [
                1232,
                1290
            ],
            [
                1292,
                1302
            ],
            [
                1304,
                1442
            ],
            [
                1442,
                1503
            ],
            [
                1708,
                1709
            ],
            [
                1525,
                1532
            ],
            [
                1533,
                1655
            ],
            [
                1668,
                1693
            ],
            [
                1721,
                1771
            ],
            [
                1775,
                1787
            ],
            [
                1796,
                1801
            ],
            [
                1803,
                1811
            ],
            [
                1832,
                1847
            ],
            [
                1866,
                1869
            ],
            [
                1852,
                1862
            ],
            [
                1884,
                1892
            ],
            [
                1894,
                1901
            ],
            [
                1902,
                1979
            ],
            [
                2028,
                2050
            ],
            [
                2052,
                2062
            ],
            [
                2089,
                2112
            ],
            [
                2116,
                2135
            ],
            [
                2143,
                2148
            ],
            [
                2164,
                2171
            ],
            [
                2173,
                2181
            ],
            [
                2185,
                2193
            ],
            [
                2196,
                2224
            ],
            [
                2263,
                2272
            ],
            [
                2274,
                2288
            ],
            [
                2294,
                2300
            ],
            [
                2311,
                2315
            ],
            [
                2317,
                2325
            ],
            [
                2326,
                2333
            ],
            [
                2344,
                2352
            ],
            [
                2369,
                2382
            ],
            [
                2410,
                2448
            ],
            [
                2449,
                2475
            ],
            [
                2488,
                2492
            ],
            [
                2509,
                2553
            ],
            [
                2601,
                2620
            ],
            [
                2642,
                2662
            ],
            [
                2679,
                2708
            ],
            [
                2716,
                2719
            ],
            [
                2738,
                2783
            ],
            [
                2816,
                2831
            ],
            [
                2838,
                2933
            ],
            [
                2941,
                2947
            ],
            [
                2950,
                3015
            ]
        ],
        "row_chars": [
            [
                0,
                126
            ],
            [
                126,
                299
            ],
            [
                299,
                379
            ],
            [
                379,
                1290
            ],
            [
                1290,
                1442
            ],
            [
                1442,
                1771
            ],
            [
                1771,
                2137
            ],
            [
                2137,
                2184
            ],
            [
                2184,
                2290
            ],
            [
                2290,
                2382
            ],
            [
                2382,
                2449
            ],
            [
                2449,
                3015
            ]
        ]
    },
    "abridged": {
        "text": "'I think it a very unreasonable demand,' cried my great-grandfather, twisting up the paper, and throwing it upon the table. 'By this account, madam, you have only two thousand pounds fortune - and yet you insist upon having three hundred pounds a year jointure after my death.'\n'Because,' replied my great-grandmother, 'you have little or no nose, Sir.'\nNow before I use the word Nose again - to avoid all confusion in this interesting part of my story, I shall define exactly what I mean by the term: being of the opinion that negligent writers who despise this precaution make themselves as clear as a Will o' the Wisp: in order to which, what you have to do, before you set out, unless you intend to go puzzling on to the day of judgment - but to give the world a good definition, and stand to it, of the main word you have most occasion for - changing it, Sir, as you would a guinea, into small coin? which done - let the father of confusion puzzle you, if he can; or put a different idea either into your head, or your reader's head, if he knows how.\nIn books of strict morality and close reasoning, such as this one, neglecting to make yourself clear is inexcusable; and Heaven is witness, how the world has revenged itself upon me for leaving so many openings to equivocal meanings - and for depending so much upon the cleanliness of my readers' imaginations.\n'Here are two meanings,' cried Eugenius, pointing with his forefinger at the word Crevice, in the one hundred and seventy-eighth page of the first volume of this book.\n'And here are two roads,' replied I, 'a dirty and a clean one - which shall we take?'\n'The clean,' replied Eugenius.\n'Eugenius', said I, stepping before him, 'to define is to distrust.' Thus I triumphed over Eugenius; but I triumphed over him like a fool. However, I am not an obstinate one: therefore-\nI define a nose as follows - only beseeching my readers, both male and female, for the love of God to guard against the suggestions of the devil, and not to allow him to put any other ideas into their minds, than this.\nFor by the word Nose, throughout all this long chapter of noses, and in every other part of my work, where the word Nose occurs - I declare, by that word I mean a nose, and nothing more, or less.",
        "paragraph_chars": [
            [
                0,
                278
            ],
            [
                278,
                354
            ],
            [
                354,
                1056
            ],
            [
                1056,
                1367
            ],
            [
                1367,
                1535
            ],
            [
                1535,
                1621
            ],
            [
                1621,
                1652
            ],
            [
                1652,
                1838
            ],
            [
                1838,
                2057
            ],
            [
                2057,
                2252
            ]
        ],
        "segment_chars": [
            [
                0,
                124
            ],
            [
                124,
                278
            ],
            [
                278,
                354
            ],
            [
                354,
                905
            ],
            [
                905,
                1056
            ],
            [
                1056,
                1367
            ],
            [
                1367,
                1535
            ],
            [
                1535,
                1621
            ],
            [
                1621,
                1652
            ],
            [
                1652,
                1721
            ],
            [
                1721,
                1791
            ],
            [
                1791,
                1838
            ],
            [
                1838,
                2057
            ],
            [
                2057,
                2252
            ]
        ],
        "overlap_chars": [
            [
                1,
                38
            ],
            [
                47,
                124
            ],
            [
                125,
                157
            ],
            [
                163,
                190
            ],
            [
                193,
                196
            ],
            [
                201,
                260
            ],
            [
                279,
                286
            ],
            [
                289,
                318
            ],
            [
                320,
                351
            ],
            [
                354,
                366
            ],
            [
                367,
                370
            ],
            [
                371,
                379
            ],
            [
                393,
                415
            ],
            [
                416,
                453
            ],
            [
                462,
                468
            ],
            [
                477,
                483
            ],
            [
                484,
                510
            ],
            [
                511,
                514
            ],
            [
                515,
                522
            ],
            [
                523,
                527
            ],
            [
                538,
                545
            ],
            [
                558,
                573
            ],
            [
                574,
                578
            ],
            [
                590,
                598
            ],
            [
                599,
                601
            ],
            [
                602,
                620
            ],
            [
                622,
                645
            ],
            [
                646,
                649
            ],
            [
                650,
                654
            ],
            [
                655,
                740
            ],
            [
                743,
                844
            ],
            [
                847,
                905
            ],
            [
                905,
                915
            ],
            [
                918,
                1056
            ],
            [
                1056,
                1117
            ],
            [
                1121,
                1122
            ],
            [
                1123,
                1130
            ],
            [
                1157,
                1279
            ],
            [
                1291,
                1316
            ],
            [
                1317,
                1367
            ],
            [
                1368,
                1380
            ],
            [
                1392,
                1397
            ],
            [
                1398,
                1406
            ],
            [
                1406,
                1421
            ],
            [
                1422,
                1425
            ],
            [
                1426,
                1436
            ],
            [
                1440,
                1448
            ],
            [
                1449,
                1456
            ],
            [
                1456,
                1533
            ],
            [
                1536,
                1558
            ],
            [
                1561,
                1571
            ],
            [
                1573,
                1596
            ],
            [
                1599,
                1618
            ],
            [
                1626,
                1631
            ],
            [
                1634,
                1641
            ],
            [
                1642,
                1650
            ],
            [
                1653,
                1661
            ],
            [
                1664,
                1692
            ],
            [
                1694,
                1703
            ],
            [
                1704,
                1718
            ],
            [
                1721,
                1727
            ],
            [
                1738,
                1742
            ],
            [
                1743,
                1751
            ],
            [
                1751,
                1758
            ],
            [
                1769,
                1777
            ],
            [
                1778,
                1791
            ],
            [
                1798,
                1836
            ],
            [
                1838,
                1864
            ],
            [
                1867,
                1871
            ],
            [
                1872,
                1916
            ],
            [
                1917,
                1936
            ],
            [
                1937,
                1957
            ],
            [
                1958,
                1987
            ],
            [
                2001,
                2004
            ],
            [
                2005,
                2050
            ],
            [
                2057,
                2072
            ],
            [
                2077,
                2172
            ],
            [
                2178,
                2184
            ],
            [
                2187,
                2252
            ]
        ],
        "row_chars": [
            [
                0,
                124
            ],
            [
                124,
                278
            ],
            [
                278,
                354
            ],
            [
                354,
                905
            ],
            [
                905,
                1056
            ],
            [
                1056,
                1367
            ],
            [
                1367,
                1621
            ],
            [
                1621,
                1652
            ],
            [
                1652,
                1721
            ],
            [
                1721,
                1791
            ],
            [
                1791,
                1838
            ],
            [
                1838,
                2252
            ]
        ]
    }
}