{
    "original": {
        "text": "----What an unconscionable jointure, my dear, do we pay out of this small estate of ours, quoth my grandmother to my grandfather.\nMy father, replied my grandfather, had no more nose, my dear, saving the mark, than there is upon the back of my hand.\n--Now, you must know, that my great-grandmother outlived my grandfather twelve years; so that my father had the jointure to pay, a hundred and fifty pounds half-yearly--(on _Michaelmas_ and _Lady-day_), --during all that time.\nNo man discharged pecuniary obligations with a better grace than my father. ------And as far as a hundred pounds went, he would fling it upon the table, guinea by guinea, with that spirited jerk of an honest welcome, which generous souls, and generous souls only, are able to fling down money: but as soon as ever he enter'd upon the odd fifty--he generally gave a loud _Hem!_ rubb'd the side of his nose leisurely with the flat part of his fore finger----inserted his hand cautiously betwixt his head and the cawl of his wig--look'd at both sides of every guinea as he parted with it----and seldom could get to the end of the fifty pounds, without pulling out his handkerchief, and wiping his temples.\nDefend me, gracious Heaven! from those persecuting spirits who make no allowances for these workings within us. --Never --O never may I lay down in their tents, who cannot relax the engine, and feel pity for the force of education, and the prevalence of opinions long derived from ancestors!\nFor three generations at least this _tenet_ in favour of long noses had gradually been taking root in our family. ------TRADITION was all along on its side, and INTEREST was every half-year stepping in to strengthen it; so that the whimsicality of my father's brain was far from having the whole honour of this, as it had of almost all his other strange notions. --For in a great measure he might be said to have suck'd this in with his mother's milk. He did his part however. ----If education planted the mistake (in case it was one) my father watered it, and ripened it to perfection.\nHe would often declare, in speaking his thoughts upon the subject, that he did not conceive how the greatest family in _England_ could stand it out against an uninterrupted succession of six or seven short noses. --And for the contrary reason, he would generally add, That it must be one of the greatest problems in civil life, where the same number of long and jolly noses, following one another in a direct line, did not raise and hoist it up into the best vacancies in the kingdom. ------He would often boast that the _Shandy_ family rank'd very high in King _Harry_ the VIIIth's time, but owed its rise to no state engine--he would say--but to that only; ----but that, like other families, he would add----it had felt the turn of the wheel, and had never recovered the blow of my great-grandfather's nose. ----It was an ace of clubs indeed, he would cry, shaking his head--and as vile a one for an unfortunate family as ever turn'd up trumps.\n------Fair and softly, gentle reader! ------where is thy fancy carrying thee? ----If there is truth in man, by my great-grandfather's nose, I mean the external organ of smelling, or that part of man which stands prominent in his face----and which painters say, in good jolly noses and well-proportioned faces, should comprehend a full third----that is, measured downwards from the setting on of the hair.----\n----What a life of it has an author, at this pass!",
        "paragraph_chars": [
            [
                0,
                130
            ],
            [
                130,
                249
            ],
            [
                249,
                476
            ],
            [
                476,
                1179
            ],
            [
                1179,
                1471
            ],
            [
                1471,
                2058
            ],
            [
                2058,
                3005
            ],
            [
                3005,
                3414
            ],
            [
                3414,
                3464
            ]
        ],
        "segment_chars": [
            [
                0,
                130
            ],
            [
                130,
                249
            ],
            [
                249,
                476
            ],
            [
                476,
                552
            ],
            [
                552,
                1179
            ],
            [
                1179,
                1207
            ],
            [
                1207,
                1291
            ],
            [
                1291,
                1471
            ],
            [
                1471,
                1585
            ],
            [
                1585,
                1834
            ],
            [
                1834,
                1923
            ],
            [
                1923,
                1948
            ],
            [
                1948,
                2058
            ],
            [
                2058,
                2271
            ],
            [
                2271,
                2543
            ],
            [
                2543,
                2868
            ],
            [
                2868,
                3005
            ],
            [
                3005,
                3043
            ],
            [
                3043,
                3083
            ],
            [
                3083,
                3414
            ],
            [
                3414,
                3464
            ]
        ],
        "overlap_chars": [
            [
                4,
                11
            ],
            [
                27,
                45
            ],
            [
                49,
                88
            ],
            [
                90,
                130
            ],
            [
                133,
                139
            ],
            [
                141,
                164
            ],
            [
                165,
                190
            ],
            [
                207,
                247
            ],
            [
                251,
                269
            ],
            [
                271,
                416
            ],
            [
                269,
                270
            ],
            [
                454,
                476
            ],
            [
                476,
                482
            ],
            [
                516,
                552
            ],
            [
                562,
                627
            ],
            [
                647,
                651
            ],
            [
                699,
                707
            ],
            [
                770,
                773
            ],
            [
                891,
                895
            ],
            [
                652,
                656
            ],
            [
                627,
                628
            ],
            [
                790,
                792
            ],
            [
                834,
                845
            ],
            [
                847,
                851
            ],
            [
                872,
                880
            ],
            [
                645,
                646
            ],
            [
                969,
                977
            ],
            [
                691,
                692
            ],
            [
                1010,
                1060
            ],
            [
                558,
                561
            ],
            [
                1075,
                1080
            ],
            [
                1068,
                1074
            ],
            [
                1081,
                1179
            ],
            [
                1179,
                1207
            ],
            [
                1207,
                1289
            ],
            [
                1367,
                1372
            ],
            [
                1383,
                1386
            ],
            [
                1433,
                1441
            ],
            [
                1447,
                1459
            ],
            [
                1460,
                1471
            ],
            [
                1471,
                1506
            ],
            [
                1515,
                1583
            ],
            [
                1689,
                1693
            ],
            [
                1719,
                1730
            ],
            [
                1703,
                1712
            ],
            [
                1731,
                1756
            ],
            [
                1777,
                1792
            ],
            [
                1796,
                1834
            ],
            [
                1859,
                1883
            ],
            [
                1891,
                1923
            ],
            [
                1952,
                1984
            ],
            [
                2006,
                2058
            ],
            [
                2058,
                2080
            ],
            [
                2125,
                2140
            ],
            [
                2150,
                2176
            ],
            [
                2178,
                2185
            ],
            [
                2187,
                2271
            ],
            [
                2273,
                2276
            ],
            [
                2300,
                2310
            ],
            [
                2321,
                2325
            ],
            [
                2331,
                2341
            ],
            [
                2392,
                2459
            ],
            [
                2467,
                2486
            ],
            [
                2281,
                2284
            ],
            [
                2500,
                2542
            ],
            [
                2549,
                2578
            ],
            [
                2580,
                2586
            ],
            [
                2588,
                2594
            ],
            [
                2602,
                2619
            ],
            [
                2628,
                2646
            ],
            [
                2665,
                2667
            ],
            [
                2656,
                2659
            ],
            [
                2715,
                2716
            ],
            [
                2721,
                2729
            ],
            [
                2768,
                2770
            ],
            [
                2807,
                2826
            ],
            [
                2827,
                2868
            ],
            [
                2872,
                2901
            ],
            [
                2903,
                2933
            ],
            [
                2901,
                2902
            ],
            [
                2935,
                2986
            ],
            [
                2994,
                3003
            ],
            [
                3026,
                3043
            ],
            [
                3049,
                3083
            ],
            [
                3113,
                3182
            ],
            [
                3294,
                3295
            ],
            [
                3242,
                3265
            ],
            [
                3315,
                3321
            ],
            [
                3333,
                3345
            ],
            [
                3397,
                3403
            ],
            [
                3234,
                3238
            ],
            [
                3358,
                3385
            ],
            [
                3404,
                3408
            ],
            [
                3408,
                3409
            ],
            [
                3418,
                3429
            ],
            [
                3440,
                3449
            ],
            [
                3436,
                3439
            ],
            [
                3463,
                3464
            ]
        ],
        "row_chars": [
            [
                0,
                130
            ],
            [
                130,
                249
            ],
            [
                249,
                476
            ],
            [
                476,
                552
            ],
            [
                552,
                1179
            ],
            [
                1179,
                1207
            ],
            [
                1207,
                1471
            ],
            [
                1471,
                1834
            ],
            [
                1834,
                1923
            ],
            [
                1923,
                1948
            ],
            [
                1948,
                2058
            ],
            [
                2058,
                2271
            ],
            [
                2271,
                2543
            ],
            [
                2543,
                2868
            ],
            [
                2868,
                3005
            ],
            [
                3005,
                3043
            ],
            [
                3043,
                3083
            ],
            [
                3083,
                3414
            ],
            [
                3414,
                3464
            ]
        ]
    },
    "abridged": {
        "text": "'What an excessive jointure, my dear, we pay out of this small estate of ours,' quoth my grandmother to my grandfather.\n'My father,' replied my grandfather, 'had no more nose, my dear, than there is upon the back of my hand.'\nNow, you must know that my great-grandmother outlived my grandfather twelve years; so that my father had the jointure to pay, a hundred and fifty pounds half-yearly, during all that time.\nNo man paid his bills with a better grace than my father. As far as a hundred pounds went, he would fling it upon the table with a generous spirit; but faced with half that amount, he gave a loud 'Hem!', rubbed his nose, scratched his head, looked at both sides of every guinea as he parted with it - and could seldom get to the end of the fifty pounds, without pulling out his handkerchief, and wiping his temples.\nDefend me, gracious Heaven! from those persecuting spirits who make no allowances for these workings within us, and for opinions derived from our ancestors!\nFor three generations at least this opinion in favour of long noses had gradually been taking root in our family; so my father's whimsical brain was far from having devised this, as it had almost all his other strange notions. He might be said to have sucked this in with his mother's milk. However, if education planted the mistake, my father watered it, and ripened it to perfection.\nHe would often declare that he did not see how the greatest family in England could stand it out against an uninterrupted succession of six or seven short noses. And conversely, he would add, it must be a great problem when the same number of long and jolly noses, following one another in a line, did not raise the family up into the best vacancies in the kingdom.\nHe would often boast that the Shandy family ranked very high in King Harry the VIIIth's time, owing to its noses; - but that it had never recovered from the blow of my great-grandfather's nose. 'It was an ace of clubs indeed,' he would cry, shaking his head, 'and as vile a one for an unfortunate family as ever turned up trumps.'\n-Softly, gentle reader! where is thy fancy carrying thee? By my great-grandfather's nose, I mean the external organ of smelling - and which painters say, should take up a full third of the face measured downwards from the hairline.\nWhat a life an author has!",
        "paragraph_chars": [
            [
                0,
                120
            ],
            [
                120,
                226
            ],
            [
                226,
                414
            ],
            [
                414,
                830
            ],
            [
                830,
                987
            ],
            [
                987,
                1373
            ],
            [
                1373,
                1739
            ],
            [
                1739,
                2070
            ],
            [
                2070,
                2302
            ],
            [
                2302,
                2328
            ]
        ],
        "segment_chars": [
            [
                0,
                120
            ],
            [
                120,
                226
            ],
            [
                226,
                414
            ],
            [
                414,
                472
            ],
            [
                472,
                615
            ],
            [
                615,
                830
            ],
            [
                830,
                858
            ],
            [
                858,
                987
            ],
            [
                987,
                1214
            ],
            [
                1214,
                1278
            ],
            [
                1278,
                1373
            ],
            [
                1373,
                1535
            ],
            [
                1535,
                1739
            ],
            [
                1739,
                1933
            ],
            [
                1933,
                2070
            ],
            [
                2070,
                2094
            ],
            [
                2094,
                2128
            ],
            [
                2128,
                2302
            ],
            [
                2302,
                2328
            ]
        ],
        "overlap_chars": [
            [
                1,
                8
            ],
            [
                19,
                37
            ],
            [
                38,
                77
            ],
            [
                80,
                120
            ],
            [
                124,
                130
            ],
            [
                133,
                156
            ],
            [
                158,
                183
            ],
            [
                183,
                223
            ],
            [
                226,
                244
            ],
            [
                245,
                390
            ],
            [
                390,
                391
            ],
            [
                392,
                414
            ],
            [
                414,
                420
            ],
            [
                436,
                472
            ],
            [
                472,
                537
            ],
            [
                538,
                542
            ],
            [
                545,
                553
            ],
            [
                562,
                565
            ],
            [
                572,
                576
            ],
            [
                582,
                586
            ],
            [
                593,
                594
            ],
            [
                595,
                597
            ],
            [
                598,
                609
            ],
            [
                611,
                615
            ],
            [
                625,
                633
            ],
            [
                633,
                634
            ],
            [
                645,
                653
            ],
            [
                653,
                654
            ],
            [
                662,
                712
            ],
            [
                715,
                718
            ],
            [
                719,
                724
            ],
            [
                725,
                731
            ],
            [
                732,
                830
            ],
            [
                830,
                858
            ],
            [
                858,
                940
            ],
            [
                940,
                945
            ],
            [
                946,
                949
            ],
            [
                950,
                958
            ],
            [
                959,
                971
            ],
            [
                976,
                987
            ],
            [
                987,
                1022
            ],
            [
                1031,
                1099
            ],
            [
                1099,
                1103
            ],
            [
                1104,
                1115
            ],
            [
                1116,
                1125
            ],
            [
                1126,
                1151
            ],
            [
                1160,
                1175
            ],
            [
                1176,
                1214
            ],
            [
                1214,
                1238
            ],
            [
                1246,
                1278
            ],
            [
                1287,
                1319
            ],
            [
                1321,
                1373
            ],
            [
                1373,
                1395
            ],
            [
                1396,
                1411
            ],
            [
                1416,
                1442
            ],
            [
                1443,
                1450
            ],
            [
                1451,
                1535
            ],
            [
                1535,
                1538
            ],
            [
                1549,
                1559
            ],
            [
                1560,
                1564
            ],
            [
                1565,
                1575
            ],
            [
                1597,
                1664
            ],
            [
                1665,
                1684
            ],
            [
                1685,
                1688
            ],
            [
                1696,
                1738
            ],
            [
                1739,
                1768
            ],
            [
                1769,
                1775
            ],
            [
                1776,
                1782
            ],
            [
                1790,
                1807
            ],
            [
                1814,
                1832
            ],
            [
                1839,
                1841
            ],
            [
                1842,
                1845
            ],
            [
                1851,
                1852
            ],
            [
                1855,
                1863
            ],
            [
                1864,
                1866
            ],
            [
                1867,
                1886
            ],
            [
                1892,
                1933
            ],
            [
                1934,
                1963
            ],
            [
                1966,
                1996
            ],
            [
                1996,
                1997
            ],
            [
                1999,
                2050
            ],
            [
                2058,
                2067
            ],
            [
                2077,
                2094
            ],
            [
                2094,
                2128
            ],
            [
                2128,
                2197
            ],
            [
                2198,
                2199
            ],
            [
                2200,
                2223
            ],
            [
                2224,
                2230
            ],
            [
                2239,
                2251
            ],
            [
                2252,
                2258
            ],
            [
                2259,
                2263
            ],
            [
                2264,
                2291
            ],
            [
                2292,
                2296
            ],
            [
                2300,
                2301
            ],
            [
                2302,
                2313
            ],
            [
                2314,
                2323
            ],
            [
                2324,
                2327
            ],
            [
                2327,
                2328
            ]
        ],
        "row_chars": [
            [
                0,
                120
            ],
            [
                120,
                226
            ],
            [
                226,
                414
            ],
            [
                414,
                472
            ],
            [
                472,
                830
            ],
            [
                830,
                858
            ],
            [
                858,
                987
            ],
            [
                987,
                1214
            ],
            [
                1214,
                1278
            ],
            [
                1278,
                1278
            ],
            [
                1278,
                1373
            ],
            [
                1373,
                1535
            ],
            [
                1535,
                1739
            ],
            [
                1739,
                1933
            ],
            [
                1933,
                2070
            ],
            [
                2070,
                2094
            ],
            [
                2094,
                2128
            ],
            [
                2128,
                2302
            ],
            [
                2302,
                2328
            ]
        ]
    }
}