{
    "original": {
        "text": "There was not any one scene more entertaining in our family--and to do it justice in this point; ----and I here put off my cap and lay it upon the table close beside my ink-horn, on purpose to make my declaration to the world concerning this one article the more solemn----that I believe in my soul (unless my love and partiality to my understanding blinds me) the hand of the supreme Maker and first Designer of all things never made or put a family together (in that period at least of it which I have sat down to write the story of)----where the characters of it were cast or contrasted with so dramatick a felicity as ours was, for this end; or in which the capacities of affording such exquisite scenes, and the powers of shifting them perpetually from morning to night, were lodged and intrusted with so unlimited a confidence, as in the SHANDY FAMILY.\nNot any one of these was more diverting, I say, in this whimsical theatre of ours----than what frequently arose out of this self-same chapter of long noses------especially when my father's imagination was heated with the enquiry, and nothing would serve him but to heat my uncle _Toby's_ too.\nMy uncle _Toby_ would give my father all possible fair play in this attempt; and with infinite patience would sit smoaking his pipe for whole hours together, whilst my father was practising upon his head, and trying every accessible avenue to drive _Prignitz_ and _Scroderus's_ solutions into it.\nWhether they were above my uncle _Toby's_ reason------or contrary to it------or that his brain was like _damp_ timber, and no spark could possibly take hold----or that it was so full of saps, mines, blinds, curtins, and such military disqualifications to his seeing clearly into _Prignitz_ and _Scroderus's_ doctrines ----I say not--let schoolmen--scullions, anatomists, and engineers, fight for it among themselves----\n'Twas some misfortune, I make no doubt, in this affair, that my father had every word of it to translate for the benefit of my uncle _Toby_, and render out of _Slawkenbergius's_ _Latin_, of which, as he was no great master, his translation was not always of the purest----and generally least so where 'twas most wanted. --This naturally open'd a door to a second misfortune; ----that in the warmer paroxysms of his zeal to open my uncle _Toby's_ eyes------my father's ideas ran on as much faster than the translation, as the translation outmoved my uncle _Toby's_------ neither the one or the other added much to the perspicuity of my father's lecture.",
        "paragraph_chars": [
            [
                0,
                859
            ],
            [
                859,
                1152
            ],
            [
                1152,
                1449
            ],
            [
                1449,
                1869
            ],
            [
                1869,
                2521
            ]
        ],
        "segment_chars": [
            [
                0,
                859
            ],
            [
                859,
                1152
            ],
            [
                1152,
                1449
            ],
            [
                1449,
                1869
            ],
            [
                1869,
                2189
            ],
            [
                2189,
                2521
            ]
        ],
        "overlap_chars": [
            [
                0,
                9
            ],
            [
                22,
                59
            ],
            [
                172,
                173
            ],
            [
                101,
                106
            ],
            [
                280,
                287
            ],
            [
                373,
                390
            ],
            [
                424,
                429
            ],
            [
                438,
                459
            ],
            [
                549,
                559
            ],
            [
                566,
                570
            ],
            [
                579,
                597
            ],
            [
                608,
                626
            ],
            [
                644,
                648
            ],
            [
                491,
                496
            ],
            [
                686,
                707
            ],
            [
                832,
                859
            ],
            [
                871,
                940
            ],
            [
                987,
                988
            ],
            [
                944,
                982
            ],
            [
                993,
                1014
            ],
            [
                1020,
                1137
            ],
            [
                1143,
                1145
            ],
            [
                1147,
                1152
            ],
            [
                1152,
                1160
            ],
            [
                1355,
                1356
            ],
            [
                1233,
                1255
            ],
            [
                1256,
                1265
            ],
            [
                1275,
                1287
            ],
            [
                1294,
                1299
            ],
            [
                1308,
                1330
            ],
            [
                1361,
                1373
            ],
            [
                1392,
                1400
            ],
            [
                1402,
                1410
            ],
            [
                1229,
                1232
            ],
            [
                1417,
                1426
            ],
            [
                1440,
                1444
            ],
            [
                1347,
                1355
            ],
            [
                1447,
                1449
            ],
            [
                1449,
                1481
            ],
            [
                1515,
                1517
            ],
            [
                1487,
                1489
            ],
            [
                1491,
                1497
            ],
            [
                1503,
                1505
            ],
            [
                1534,
                1552
            ],
            [
                1560,
                1567
            ],
            [
                1572,
                1605
            ],
            [
                1609,
                1647
            ],
            [
                1656,
                1682
            ],
            [
                1654,
                1655
            ],
            [
                1771,
                1780
            ],
            [
                1869,
                1874
            ],
            [
                1890,
                1891
            ],
            [
                1899,
                1907
            ],
            [
                1923,
                1943
            ],
            [
                1961,
                1973
            ],
            [
                1944,
                1954
            ],
            [
                1974,
                1977
            ],
            [
                1993,
                2001
            ],
            [
                2043,
                2045
            ],
            [
                1982,
                1989
            ],
            [
                2010,
                2013
            ],
            [
                2066,
                2068
            ],
            [
                2072,
                2091
            ],
            [
                1955,
                1957
            ],
            [
                1909,
                1911
            ],
            [
                2091,
                2108
            ],
            [
                1990,
                1992
            ],
            [
                2033,
                2043
            ],
            [
                2109,
                2137
            ],
            [
                2187,
                2189
            ],
            [
                2191,
                2205
            ],
            [
                2213,
                2243
            ],
            [
                2248,
                2255
            ],
            [
                2280,
                2291
            ],
            [
                2297,
                2305
            ],
            [
                2325,
                2409
            ],
            [
                2415,
                2423
            ],
            [
                2468,
                2473
            ],
            [
                2479,
                2485
            ],
            [
                2498,
                2521
            ]
        ],
        "row_chars": [
            [
                0,
                859
            ],
            [
                859,
                1152
            ],
            [
                1152,
                1449
            ],
            [
                1449,
                1869
            ],
            [
                1869,
                2189
            ],
            [
                2189,
                2521
            ]
        ]
    },
    "abridged": {
        "text": "There was no scene more entertaining in our family - and I believe the supreme Maker never put a family together whose characters were contrasted with so dramatic a felicity as ours; or which afforded such exquisite scenes, as in the Shandy Family.\nNone of these was more diverting, I say, in this whimsical theatre of ours - than what frequently arose out of this chapter of long noses - especially when my father's imagination was heated with the enquiry, and nothing would serve him but to heat my uncle Toby's too.\nMy uncle Toby, with infinite patience, would sit smoking his pipe for hours, whilst my father was trying every way to drive Prignitz and Scroderus into his head.\nWhether they were above my uncle Toby's reason - or whether his brain was like damp timber, where no spark could possibly take hold - or that it was so full of saps, mines, curtins, and such military obstacles, I say not.\n'Twas unfortunate, no doubt, that my father had to translate every word for my uncle's benefit; and as my father was no great master of Latin, his translation of Slawkenbergius was not always of the purest. This naturally opened a door to a second misfortune; that in his zeal to persuade my uncle Toby, my father's ideas ran on as much faster than the translation, as the translation outran my uncle Toby: which added little to the clarity of my father's lecture.",
        "paragraph_chars": [
            [
                0,
                249
            ],
            [
                249,
                519
            ],
            [
                519,
                681
            ],
            [
                681,
                903
            ],
            [
                903,
                1367
            ]
        ],
        "segment_chars": [
            [
                0,
                249
            ],
            [
                249,
                519
            ],
            [
                519,
                681
            ],
            [
                681,
                903
            ],
            [
                903,
                1110
            ],
            [
                1110,
                1367
            ]
        ],
        "overlap_chars": [
            [
                0,
                9
            ],
            [
                13,
                50
            ],
            [
                51,
                52
            ],
            [
                53,
                58
            ],
            [
                59,
                66
            ],
            [
                67,
                84
            ],
            [
                85,
                90
            ],
            [
                91,
                112
            ],
            [
                119,
                129
            ],
            [
                130,
                134
            ],
            [
                135,
                153
            ],
            [
                163,
                181
            ],
            [
                181,
                185
            ],
            [
                186,
                191
            ],
            [
                201,
                222
            ],
            [
                222,
                249
            ],
            [
                254,
                323
            ],
            [
                324,
                325
            ],
            [
                326,
                364
            ],
            [
                365,
                386
            ],
            [
                389,
                506
            ],
            [
                511,
                513
            ],
            [
                514,
                519
            ],
            [
                519,
                527
            ],
            [
                532,
                533
            ],
            [
                534,
                556
            ],
            [
                558,
                567
            ],
            [
                576,
                588
            ],
            [
                589,
                594
            ],
            [
                594,
                616
            ],
            [
                617,
                629
            ],
            [
                634,
                642
            ],
            [
                643,
                651
            ],
            [
                652,
                655
            ],
            [
                656,
                665
            ],
            [
                666,
                670
            ],
            [
                671,
                679
            ],
            [
                679,
                681
            ],
            [
                681,
                713
            ],
            [
                714,
                716
            ],
            [
                718,
                720
            ],
            [
                721,
                727
            ],
            [
                730,
                732
            ],
            [
                741,
                759
            ],
            [
                765,
                772
            ],
            [
                779,
                812
            ],
            [
                815,
                853
            ],
            [
                854,
                880
            ],
            [
                890,
                891
            ],
            [
                892,
                901
            ],
            [
                903,
                908
            ],
            [
                920,
                921
            ],
            [
                922,
                930
            ],
            [
                930,
                950
            ],
            [
                951,
                963
            ],
            [
                964,
                974
            ],
            [
                975,
                978
            ],
            [
                979,
                987
            ],
            [
                987,
                989
            ],
            [
                990,
                997
            ],
            [
                999,
                1002
            ],
            [
                1003,
                1005
            ],
            [
                1016,
                1035
            ],
            [
                1036,
                1038
            ],
            [
                1042,
                1044
            ],
            [
                1044,
                1061
            ],
            [
                1062,
                1064
            ],
            [
                1069,
                1079
            ],
            [
                1080,
                1108
            ],
            [
                1108,
                1110
            ],
            [
                1110,
                1124
            ],
            [
                1132,
                1162
            ],
            [
                1163,
                1170
            ],
            [
                1171,
                1182
            ],
            [
                1192,
                1200
            ],
            [
                1207,
                1291
            ],
            [
                1295,
                1303
            ],
            [
                1316,
                1321
            ],
            [
                1329,
                1335
            ],
            [
                1344,
                1367
            ]
        ],
        "row_chars": [
            [
                0,
                249
            ],
            [
                249,
                519
            ],
            [
                519,
                681
            ],
            [
                681,
                903
            ],
            [
                903,
                1110
            ],
            [
                1110,
                1367
            ]
        ]
    }
}