{
    "original": {
        "text": "'Tis a pity, cried my father one winter's night, after a three hours' painful translation of _Slawkenbergius_----'tis a pity, cried my father, putting my mother's thread-paper into the book for a mark, as he spoke----that truth, brother _Toby_, should shut herself up in such impregnable fastnesses, and be so obstinate as not to surrender herself sometimes up upon the closest siege.----\nNow it happened then, as indeed it had often done before, that my uncle _Toby's_ fancy, during the time of my father's explanation of _Prignitz_ to him------having nothing to stay it there, had taken a short flight to the bowling-green! ------his body might as well have taken a turn there too--so that with all the semblance of a deep school-man intent upon the _medius terminus_------my uncle _Toby_ was in fact as ignorant of the whole lecture, and all its pros and cons, as if my father had been translating _Hafen Slawkenbergius_ from the _Latin_ tongue into the _Cherokee_. But the word _siege_, like a talismanic power, in my father's metaphor, wafting back my uncle _Toby's_ fancy, quick as a note could follow the touch--he open'd his ears----and my father observing that he took his pipe out of his mouth, and shuffled his chair nearer the table, as with a desire to profit--my father with great pleasure began his sentence again----changing only the plan, and dropping the metaphor of the siege of it, to keep clear of some dangers my father apprehended from it.\n'Tis a pity, said my father, that truth can only be on one side, brother _Toby_------considering what ingenuity these learned men have all shewn in their solutions of noses. ----Can noses be dissolved? replied my uncle _Toby_.\n------My father thrust back his chair------rose up--put on his hat------took four long strides to the door------jerked it open----thrust his head half way out----shut the door again----took no notice of the bad hinge----returned to the table--pluck'd my mother's thread-paper out of _Slawkenbergius's_ book------went hastily to his bureau--walked slowly back--twisted my mother's thread-paper about his thumb--unbutton'd his waistcoat--threw my mother's thread-paper into the fire----bit her sattin pin-cushion in two, fill'd his mouth with bran--confounded it; --but mark! --the oath of confusion was levell'd at my uncle _Toby's_ brain--which was e'en confused enough already----the curse came charged only with the bran--the bran, may it please your honours, was no more than powder to the ball.\n'Twas well my father's passions lasted not long; for so long as they did last, they led him a busy life on't; and it is one of the most unaccountable problems that ever I met with in my observations of human nature, that nothing should prove my father's mettle so much, or make his passions go off so like gunpowder, as the unexpected strokes his science met with from the quaint simplicity of my uncle _Toby's_ questions. ----Had ten dozen of hornets stung him behind in so many different places all at one time--he could not have exerted more mechanical functions in fewer seconds------or started half so much, as with one single _qure_ of three words unseasonably popping in full upon him in his hobby-horsical career.\n'Twas all one to my uncle _Toby_------he smoaked his pipe on with unvaried composure----his heart never intended offence to his brother--and as his head could seldom find out where the sting of it lay----he always gave my father the credit of cooling by himself. ----He was five minutes and thirty-five seconds about it in the present case.\nBy all that's good! said my father, swearing, as he came to himself, and taking the oath out of _Ernulphus's_ digest of curses----(though to do my father justice it was a fault (as he told Dr. _Slop_ in the affair of _Ernulphus_) which he as seldom committed as any man upon earth) ------By all that's good and great! brother _Toby_, said my father, if it was not for the aids of philosophy, which befriend one so much as they do--you would put a man beside all temper. ----Why, by the _solutions_ of noses, of which I was telling you, I meant, as you might have known, had you favoured me with one grain of attention, the various accounts which learned men of different kinds of knowledge have given the world of the causes of short and long noses. ----There is no cause but one, replied my uncle _Toby_----why one man's nose is longer than another's, but because that God pleases to have it so. ----That is _Grangousier's_ solution, said my father. --'Tis he, continued my uncle _Toby_, looking up, and not regarding my father's interruption, who makes us all, and frames and puts us together in such forms and proportions, and for such ends, as is agreeable to his infinite wisdom. ----'Tis a pious account, cried my father, but not philosophical----there is more religion in it than sound science. 'Twas no inconsistent part of my uncle _Toby's_ character----that he feared God, and reverenced religion. ----So the moment my father finished his remark----my uncle _Toby_ fell a whistling _Lillabullero_ with more zeal (though more out of tune) than usual.--\nWhat is become of my wife's thread-paper?",
        "paragraph_chars": [
            [
                0,
                389
            ],
            [
                389,
                1463
            ],
            [
                1463,
                1690
            ],
            [
                1690,
                2489
            ],
            [
                2489,
                3211
            ],
            [
                3211,
                3552
            ],
            [
                3552,
                5114
            ],
            [
                5114,
                5155
            ]
        ],
        "segment_chars": [
            [
                0,
                389
            ],
            [
                389,
                626
            ],
            [
                626,
                969
            ],
            [
                969,
                1463
            ],
            [
                1463,
                1637
            ],
            [
                1637,
                1665
            ],
            [
                1665,
                1690
            ],
            [
                1690,
                2264
            ],
            [
                2264,
                2489
            ],
            [
                2489,
                2912
            ],
            [
                2912,
                3211
            ],
            [
                3211,
                3474
            ],
            [
                3474,
                3552
            ],
            [
                3552,
                3572
            ],
            [
                3572,
                3870
            ],
            [
                3870,
                4022
            ],
            [
                4022,
                4302
            ],
            [
                4302,
                4449
            ],
            [
                4449,
                4503
            ],
            [
                4503,
                4737
            ],
            [
                4737,
                4854
            ],
            [
                4854,
                4960
            ],
            [
                4960,
                5114
            ],
            [
                5114,
                5155
            ]
        ],
        "overlap_chars": [
            [
                114,
                124
            ],
            [
                13,
                54
            ],
            [
                57,
                92
            ],
            [
                98,
                108
            ],
            [
                169,
                170
            ],
            [
                5,
                11
            ],
            [
                217,
                236
            ],
            [
                327,
                329
            ],
            [
                243,
                287
            ],
            [
                298,
                303
            ],
            [
                323,
                326
            ],
            [
                330,
                339
            ],
            [
                366,
                383
            ],
            [
                389,
                460
            ],
            [
                534,
                536
            ],
            [
                466,
                468
            ],
            [
                475,
                483
            ],
            [
                496,
                522
            ],
            [
                524,
                532
            ],
            [
                577,
                626
            ],
            [
                632,
                682
            ],
            [
                731,
                732
            ],
            [
                692,
                704
            ],
            [
                715,
                717
            ],
            [
                736,
                742
            ],
            [
                748,
                751
            ],
            [
                835,
                836
            ],
            [
                775,
                783
            ],
            [
                791,
                835
            ],
            [
                864,
                900
            ],
            [
                908,
                922
            ],
            [
                924,
                928
            ],
            [
                948,
                952
            ],
            [
                958,
                966
            ],
            [
                969,
                981
            ],
            [
                989,
                1015
            ],
            [
                1041,
                1045
            ],
            [
                1054,
                1062
            ],
            [
                1263,
                1265
            ],
            [
                1028,
                1030
            ],
            [
                1072,
                1077
            ],
            [
                1119,
                1121
            ],
            [
                1129,
                1137
            ],
            [
                1141,
                1154
            ],
            [
                1039,
                1040
            ],
            [
                1155,
                1245
            ],
            [
                1274,
                1328
            ],
            [
                1077,
                1078
            ],
            [
                1341,
                1345
            ],
            [
                1360,
                1394
            ],
            [
                1400,
                1431
            ],
            [
                1454,
                1463
            ],
            [
                1468,
                1474
            ],
            [
                1476,
                1491
            ],
            [
                1492,
                1535
            ],
            [
                1474,
                1475
            ],
            [
                1560,
                1601
            ],
            [
                1608,
                1635
            ],
            [
                1663,
                1664
            ],
            [
                1641,
                1644
            ],
            [
                1645,
                1663
            ],
            [
                1665,
                1681
            ],
            [
                1696,
                1727
            ],
            [
                1959,
                1960
            ],
            [
                1733,
                1740
            ],
            [
                2076,
                2077
            ],
            [
                1767,
                1796
            ],
            [
                2150,
                2151
            ],
            [
                1802,
                1816
            ],
            [
                1852,
                1856
            ],
            [
                1866,
                1871
            ],
            [
                2002,
                2028
            ],
            [
                2037,
                2048
            ],
            [
                1749,
                1752
            ],
            [
                2157,
                2170
            ],
            [
                2174,
                2177
            ],
            [
                1941,
                1952
            ],
            [
                2186,
                2208
            ],
            [
                2216,
                2235
            ],
            [
                2237,
                2250
            ],
            [
                2254,
                2264
            ],
            [
                2266,
                2291
            ],
            [
                2301,
                2312
            ],
            [
                2476,
                2478
            ],
            [
                2318,
                2320
            ],
            [
                2322,
                2327
            ],
            [
                2422,
                2423
            ],
            [
                2329,
                2338
            ],
            [
                2344,
                2367
            ],
            [
                2487,
                2489
            ],
            [
                2489,
                2592
            ],
            [
                2597,
                2602
            ],
            [
                2710,
                2717
            ],
            [
                2767,
                2823
            ],
            [
                2832,
                2891
            ],
            [
                2740,
                2742
            ],
            [
                2901,
                2912
            ],
            [
                2916,
                2929
            ],
            [
                2933,
                2950
            ],
            [
                2986,
                2992
            ],
            [
                3100,
                3101
            ],
            [
                3006,
                3020
            ],
            [
                3088,
                3100
            ],
            [
                3102,
                3104
            ],
            [
                3110,
                3120
            ],
            [
                3143,
                3211
            ],
            [
                3211,
                3236
            ],
            [
                3249,
                3251
            ],
            [
                3260,
                3295
            ],
            [
                3309,
                3346
            ],
            [
                3348,
                3354
            ],
            [
                3364,
                3401
            ],
            [
                3408,
                3411
            ],
            [
                3415,
                3443
            ],
            [
                3451,
                3474
            ],
            [
                3485,
                3521
            ],
            [
                3550,
                3552
            ],
            [
                3552,
                3570
            ],
            [
                3586,
                3587
            ],
            [
                3870,
                3877
            ],
            [
                3609,
                3611
            ],
            [
                3840,
                3842
            ],
            [
                3572,
                3576
            ],
            [
                3601,
                3603
            ],
            [
                3596,
                3597
            ],
            [
                4020,
                4022
            ],
            [
                4026,
                4037
            ],
            [
                4050,
                4058
            ],
            [
                4086,
                4209
            ],
            [
                4263,
                4300
            ],
            [
                4312,
                4331
            ],
            [
                4333,
                4349
            ],
            [
                4331,
                4332
            ],
            [
                4360,
                4403
            ],
            [
                4409,
                4416
            ],
            [
                4422,
                4447
            ],
            [
                4458,
                4460
            ],
            [
                4462,
                4475
            ],
            [
                4477,
                4485
            ],
            [
                4487,
                4502
            ],
            [
                4506,
                4512
            ],
            [
                4514,
                4532
            ],
            [
                4512,
                4513
            ],
            [
                4505,
                4506
            ],
            [
                4597,
                4618
            ],
            [
                4630,
                4654
            ],
            [
                4665,
                4676
            ],
            [
                4697,
                4735
            ],
            [
                4742,
                4761
            ],
            [
                4763,
                4779
            ],
            [
                4741,
                4742
            ],
            [
                4780,
                4801
            ],
            [
                4805,
                4838
            ],
            [
                4845,
                4852
            ],
            [
                4884,
                4892
            ],
            [
                4923,
                4960
            ],
            [
                4964,
                5007
            ],
            [
                5011,
                5019
            ],
            [
                5027,
                5033
            ],
            [
                5039,
                5043
            ],
            [
                5045,
                5057
            ],
            [
                5059,
                5110
            ]
        ],
        "row_chars": [
            [
                0,
                389
            ],
            [
                389,
                626
            ],
            [
                626,
                969
            ],
            [
                969,
                1463
            ],
            [
                1463,
                1637
            ],
            [
                1637,
                1665
            ],
            [
                1665,
                1690
            ],
            [
                1690,
                2264
            ],
            [
                2264,
                2489
            ],
            [
                2489,
                2912
            ],
            [
                2912,
                3211
            ],
            [
                3211,
                3474
            ],
            [
                3474,
                3552
            ],
            [
                3552,
                4022
            ],
            [
                4022,
                4302
            ],
            [
                4302,
                4449
            ],
            [
                4449,
                4503
            ],
            [
                4503,
                4737
            ],
            [
                4737,
                4854
            ],
            [
                4854,
                4960
            ],
            [
                4960,
                5114
            ],
            [
                5114,
                5155
            ]
        ]
    },
    "abridged": {
        "text": "''Tis a pity,' cried my father one winter's night, after three hours' painful translation of Slawkenbergius - ''tis a pity that truth, brother Toby, should shut herself up in such impregnable fortresses, and not surrender under the closest siege.'\nNow it happened then, as indeed it had often done before, that my uncle Toby's thoughts, during my father's explanation of Prignitz, had taken a short flight to the bowling-green! His body might as well have taken a turn there too - for with all the appearance of being intent on the argument, my uncle Toby was in fact as ignorant of the whole lecture as if my father had been translating Slawkenbergius from Latin into Cherokee.\nBut the word siege, like a talismanic power, wafted through my uncle Toby's fancy - he opened his ears - and my father, observing that he took his pipe out of his mouth, and shuffled his chair nearer the table, - my father with great pleasure began his sentence again, only dropping the metaphor of the siege, to keep clear of some dangers he foresaw from it.\n''Tis a pity,' said my father, 'that truth can only be on one side, brother, considering what ingenuity these learned men have all shown in their solutions of noses.'\n'Solutions? Can then noses be dissolved?' replied my uncle Toby.\nMy father thrust back his chair - rose up - took four long strides to the door - jerked it open - shut it again - went hastily to his bureau - walked slowly back - threw his bookmark into the fire - bit my mother's satin pin-cushion in two, filling his mouth with bran - confounded it - but mark! the oath of confusion was levelled at my uncle Toby's brain, which was confused enough already.\n'Twas well my father's passions lasted not long; for so long as they did last, they led him a busy life; and nothing made his passions go off so like gunpowder, as the unexpected blows his science met with from the quaint simplicity of my uncle Toby's questions. Had ten dozen hornets stung him all at once, they could not have startled him half so much as one single query unseasonably popping in full upon him in his hobby-horsical career.\n'Twas all one to my uncle Toby - he smoked his pipe on with unvaried composure - he never intended offence to his brother - and as he could seldom find out where the sting lay, he always gave my father the chance of cooling by himself. My father took five minutes and thirty-five seconds on this occasion.\n'By all that's good, brother Toby!' said he, eventually. 'Why, by the solutions of noses, I meant, as you might have known, had you favoured me with one grain of attention, the various accounts which learned men give of the causes of short and long noses.'\n'There is no cause but one,' replied my uncle, 'why one man's nose is longer than another's: because God pleases to have it so.'\n'That is Grangousier's solution,' said my father.\n''Tis he,' continued my uncle Toby, 'who makes us all, and puts us together in such proportions as is agreeable to his infinite wisdom.'\n''Tis a pious account,' cried my father, 'but not philosophical - there is more religion in it than science.'\nNow my uncle Toby feared God, and reverenced religion. So the moment my father finished his remark, my uncle Toby fell a-whistling Lillabullero with more zeal (though more out of tune) than usual.",
        "paragraph_chars": [
            [
                0,
                248
            ],
            [
                248,
                679
            ],
            [
                679,
                1039
            ],
            [
                1039,
                1206
            ],
            [
                1206,
                1271
            ],
            [
                1271,
                1664
            ],
            [
                1664,
                2106
            ],
            [
                2106,
                2412
            ],
            [
                2412,
                2669
            ],
            [
                2669,
                2798
            ],
            [
                2798,
                2848
            ],
            [
                2848,
                2985
            ],
            [
                2985,
                3095
            ],
            [
                3095,
                3291
            ]
        ],
        "segment_chars": [
            [
                0,
                248
            ],
            [
                248,
                428
            ],
            [
                428,
                679
            ],
            [
                679,
                1039
            ],
            [
                1039,
                1206
            ],
            [
                1206,
                1218
            ],
            [
                1218,
                1248
            ],
            [
                1248,
                1271
            ],
            [
                1271,
                1568
            ],
            [
                1568,
                1664
            ],
            [
                1664,
                1927
            ],
            [
                1927,
                2106
            ],
            [
                2106,
                2342
            ],
            [
                2342,
                2412
            ],
            [
                2412,
                2448
            ],
            [
                2448,
                2469
            ],
            [
                2469,
                2669
            ],
            [
                2669,
                2798
            ],
            [
                2798,
                2848
            ],
            [
                2848,
                2985
            ],
            [
                2985,
                3095
            ],
            [
                3095,
                3150
            ],
            [
                3150,
                3291
            ]
        ],
        "overlap_chars": [
            [
                2,
                12
            ],
            [
                15,
                56
            ],
            [
                57,
                92
            ],
            [
                97,
                107
            ],
            [
                108,
                109
            ],
            [
                116,
                122
            ],
            [
                123,
                142
            ],
            [
                143,
                145
            ],
            [
                147,
                191
            ],
            [
                202,
                207
            ],
            [
                208,
                211
            ],
            [
                212,
                221
            ],
            [
                228,
                245
            ],
            [
                248,
                319
            ],
            [
                320,
                322
            ],
            [
                324,
                326
            ],
            [
                335,
                343
            ],
            [
                344,
                370
            ],
            [
                371,
                379
            ],
            [
                379,
                428
            ],
            [
                428,
                478
            ],
            [
                479,
                480
            ],
            [
                485,
                497
            ],
            [
                509,
                511
            ],
            [
                518,
                524
            ],
            [
                528,
                531
            ],
            [
                540,
                541
            ],
            [
                542,
                550
            ],
            [
                556,
                600
            ],
            [
                601,
                637
            ],
            [
                638,
                652
            ],
            [
                653,
                657
            ],
            [
                664,
                668
            ],
            [
                669,
                677
            ],
            [
                679,
                691
            ],
            [
                697,
                723
            ],
            [
                724,
                728
            ],
            [
                739,
                747
            ],
            [
                748,
                750
            ],
            [
                752,
                754
            ],
            [
                755,
                760
            ],
            [
                763,
                765
            ],
            [
                773,
                781
            ],
            [
                784,
                797
            ],
            [
                797,
                798
            ],
            [
                799,
                889
            ],
            [
                892,
                946
            ],
            [
                946,
                947
            ],
            [
                948,
                952
            ],
            [
                953,
                987
            ],
            [
                987,
                1018
            ],
            [
                1030,
                1039
            ],
            [
                1045,
                1051
            ],
            [
                1054,
                1069
            ],
            [
                1071,
                1114
            ],
            [
                1114,
                1115
            ],
            [
                1128,
                1169
            ],
            [
                1176,
                1203
            ],
            [
                1216,
                1217
            ],
            [
                1218,
                1221
            ],
            [
                1227,
                1245
            ],
            [
                1248,
                1264
            ],
            [
                1271,
                1302
            ],
            [
                1303,
                1304
            ],
            [
                1305,
                1312
            ],
            [
                1313,
                1314
            ],
            [
                1320,
                1349
            ],
            [
                1350,
                1351
            ],
            [
                1352,
                1366
            ],
            [
                1369,
                1373
            ],
            [
                1377,
                1382
            ],
            [
                1385,
                1411
            ],
            [
                1421,
                1432
            ],
            [
                1441,
                1444
            ],
            [
                1454,
                1467
            ],
            [
                1470,
                1473
            ],
            [
                1474,
                1485
            ],
            [
                1489,
                1511
            ],
            [
                1520,
                1539
            ],
            [
                1542,
                1555
            ],
            [
                1558,
                1568
            ],
            [
                1568,
                1593
            ],
            [
                1603,
                1614
            ],
            [
                1615,
                1617
            ],
            [
                1619,
                1621
            ],
            [
                1622,
                1627
            ],
            [
                1627,
                1628
            ],
            [
                1629,
                1638
            ],
            [
                1639,
                1662
            ],
            [
                1662,
                1664
            ],
            [
                1664,
                1767
            ],
            [
                1767,
                1772
            ],
            [
                1773,
                1780
            ],
            [
                1786,
                1842
            ],
            [
                1849,
                1908
            ],
            [
                1913,
                1915
            ],
            [
                1916,
                1927
            ],
            [
                1927,
                1940
            ],
            [
                1941,
                1958
            ],
            [
                1959,
                1965
            ],
            [
                1970,
                1971
            ],
            [
                1977,
                1991
            ],
            [
                2005,
                2017
            ],
            [
                2018,
                2020
            ],
            [
                2021,
                2031
            ],
            [
                2038,
                2106
            ],
            [
                2106,
                2131
            ],
            [
                2139,
                2141
            ],
            [
                2149,
                2184
            ],
            [
                2190,
                2227
            ],
            [
                2230,
                2236
            ],
            [
                2240,
                2277
            ],
            [
                2278,
                2281
            ],
            [
                2283,
                2311
            ],
            [
                2319,
                2342
            ],
            [
                2357,
                2393
            ],
            [
                2410,
                2412
            ],
            [
                2413,
                2431
            ],
            [
                2431,
                2432
            ],
            [
                2433,
                2440
            ],
            [
                2441,
                2443
            ],
            [
                2443,
                2445
            ],
            [
                2448,
                2452
            ],
            [
                2453,
                2455
            ],
            [
                2455,
                2456
            ],
            [
                2467,
                2469
            ],
            [
                2470,
                2481
            ],
            [
                2492,
                2500
            ],
            [
                2500,
                2623
            ],
            [
                2629,
                2666
            ],
            [
                2676,
                2695
            ],
            [
                2698,
                2714
            ],
            [
                2714,
                2715
            ],
            [
                2717,
                2760
            ],
            [
                2762,
                2769
            ],
            [
                2770,
                2795
            ],
            [
                2804,
                2806
            ],
            [
                2807,
                2820
            ],
            [
                2821,
                2829
            ],
            [
                2832,
                2847
            ],
            [
                2850,
                2856
            ],
            [
                2859,
                2877
            ],
            [
                2882,
                2883
            ],
            [
                2884,
                2885
            ],
            [
                2885,
                2906
            ],
            [
                2907,
                2931
            ],
            [
                2932,
                2943
            ],
            [
                2944,
                2982
            ],
            [
                2987,
                3006
            ],
            [
                3009,
                3025
            ],
            [
                3026,
                3027
            ],
            [
                3027,
                3048
            ],
            [
                3051,
                3084
            ],
            [
                3085,
                3092
            ],
            [
                3099,
                3107
            ],
            [
                3113,
                3150
            ],
            [
                3150,
                3193
            ],
            [
                3195,
                3203
            ],
            [
                3209,
                3215
            ],
            [
                3221,
                3225
            ],
            [
                3226,
                3238
            ],
            [
                3239,
                3290
            ]
        ],
        "row_chars": [
            [
                0,
                248
            ],
            [
                248,
                428
            ],
            [
                428,
                679
            ],
            [
                679,
                1039
            ],
            [
                1039,
                1206
            ],
            [
                1206,
                1248
            ],
            [
                1248,
                1271
            ],
            [
                1271,
                1568
            ],
            [
                1568,
                1664
            ],
            [
                1664,
                1927
            ],
            [
                1927,
                2106
            ],
            [
                2106,
                2342
            ],
            [
                2342,
                2412
            ],
            [
                2412,
                2469
            ],
            [
                2469,
                2669
            ],
            [
                2669,
                2798
            ],
            [
                2798,
                2848
            ],
            [
                2848,
                2985
            ],
            [
                2985,
                3095
            ],
            [
                3095,
                3150
            ],
            [
                3150,
                3291
            ],
            [
                3291,
                3291
            ]
        ]
    }
}