{
    "original": {
        "text": "My father lay stretched across the bed as still as if the hand of death had pushed him down, for a full hour and a half before he began to play upon the floor with the toe of that foot which hung over the bed-side; my uncle _Toby's_ heart was a pound lighter for it. ------In a few moments, his left-hand, the knuckles of which had all the time reclined upon the handle of the chamber-pot, came to its feeling--he thrust it a little more within the valance--drew up his hand, when he had done, into his bosom--gave a hem! My good uncle _Toby_, with infinite pleasure, answered it; and full gladly would have ingrafted a sentence of consolation upon the opening it afforded: but having no talents, as I said, that way, and fearing moreover that he might set out with something which might make a bad matter worse, he contented himself with resting his chin placidly upon the cross of his crutch.\nNow whether the compression shortened my uncle _Toby's_ face into a more pleasurable oval--or that the philanthropy of his heart, in seeing his brother beginning to emerge out of the sea of his afflictions, had braced up his muscles----so that the compression upon his chin only doubled the benignity which was there before, is not hard to decide. ----My father, in turning his eyes, was struck with such a gleam of sunshine in his face, as melted down the sullenness of his grief in a moment.\nHe broke silence as follows.",
        "paragraph_chars": [
            [
                0,
                895
            ],
            [
                895,
                1389
            ],
            [
                1389,
                1417
            ]
        ],
        "segment_chars": [
            [
                0,
                267
            ],
            [
                267,
                522
            ],
            [
                522,
                895
            ],
            [
                895,
                1243
            ],
            [
                1243,
                1389
            ],
            [
                1389,
                1417
            ]
        ],
        "overlap_chars": [
            [
                0,
                119
            ],
            [
                120,
                167
            ],
            [
                180,
                223
            ],
            [
                229,
                231
            ],
            [
                233,
                242
            ],
            [
                251,
                266
            ],
            [
                273,
                305
            ],
            [
                322,
                389
            ],
            [
                414,
                437
            ],
            [
                306,
                309
            ],
            [
                411,
                413
            ],
            [
                463,
                474
            ],
            [
                515,
                522
            ],
            [
                522,
                535
            ],
            [
                542,
                584
            ],
            [
                590,
                607
            ],
            [
                618,
                643
            ],
            [
                672,
                695
            ],
            [
                708,
                729
            ],
            [
                739,
                752
            ],
            [
                766,
                775
            ],
            [
                788,
                895
            ],
            [
                895,
                941
            ],
            [
                1057,
                1059
            ],
            [
                947,
                949
            ],
            [
                951,
                984
            ],
            [
                986,
                988
            ],
            [
                994,
                1023
            ],
            [
                1106,
                1127
            ],
            [
                1023,
                1024
            ],
            [
                1182,
                1243
            ],
            [
                1247,
                1342
            ],
            [
                1348,
                1389
            ],
            [
                1389,
                1417
            ]
        ],
        "row_chars": [
            [
                0,
                267
            ],
            [
                267,
                522
            ],
            [
                522,
                895
            ],
            [
                895,
                1243
            ],
            [
                1243,
                1389
            ],
            [
                1389,
                1417
            ]
        ]
    },
    "abridged": {
        "text": "My father lay stretched across the bed as still as if the hand of death had pushed him down, for a full hour and a half, before he began to play upon the floor with the foot which hung over the bed-side; my uncle Toby's heart was lighter for it.\nIn a few moments, his left-hand, which had all the time reclined upon the handle of the chamber-pot, thrust it a little more under the bed - he drew up his hand - gave a hem! My good uncle Toby, with infinite pleasure, answered it; and gladly would have added a sentence of consolation: but having no talents that way, and fearing that he might say something to make a bad matter worse, he contented himself with resting his chin placidly upon the cross of his crutch.\nNow whether the compression shortened my uncle Toby's face into a more pleasurable oval - or whether the philanthropy of his heart braced up his muscles, doubling the benignity which was there before, is not hard to decide. My father, in turning his eyes, was struck with such a gleam of sunshine in his face, as melted the sullenness of his grief in a moment.\nHe broke silence as follows.",
        "paragraph_chars": [
            [
                0,
                246
            ],
            [
                246,
                715
            ],
            [
                715,
                1076
            ],
            [
                1076,
                1104
            ]
        ],
        "segment_chars": [
            [
                0,
                246
            ],
            [
                246,
                421
            ],
            [
                421,
                715
            ],
            [
                715,
                939
            ],
            [
                939,
                1076
            ],
            [
                1076,
                1104
            ]
        ],
        "overlap_chars": [
            [
                0,
                119
            ],
            [
                121,
                168
            ],
            [
                169,
                212
            ],
            [
                217,
                219
            ],
            [
                220,
                229
            ],
            [
                230,
                245
            ],
            [
                246,
                278
            ],
            [
                279,
                346
            ],
            [
                347,
                370
            ],
            [
                377,
                380
            ],
            [
                387,
                389
            ],
            [
                395,
                406
            ],
            [
                414,
                421
            ],
            [
                421,
                434
            ],
            [
                439,
                481
            ],
            [
                482,
                499
            ],
            [
                506,
                531
            ],
            [
                531,
                554
            ],
            [
                555,
                576
            ],
            [
                577,
                590
            ],
            [
                595,
                604
            ],
            [
                608,
                715
            ],
            [
                715,
                761
            ],
            [
                762,
                764
            ],
            [
                766,
                768
            ],
            [
                769,
                802
            ],
            [
                805,
                807
            ],
            [
                816,
                845
            ],
            [
                846,
                867
            ],
            [
                867,
                868
            ],
            [
                878,
                939
            ],
            [
                939,
                1034
            ],
            [
                1035,
                1076
            ],
            [
                1076,
                1104
            ]
        ],
        "row_chars": [
            [
                0,
                246
            ],
            [
                246,
                421
            ],
            [
                421,
                715
            ],
            [
                715,
                939
            ],
            [
                939,
                1076
            ],
            [
                1076,
                1104
            ]
        ]
    }
}