{
    "original": {
        "text": "Whatever degree of small merit the act of benignity in favour of the midwife might justly claim, or in whom that claim truly rested, --at first sight seems not very material to this history; ----certain however it was, that the gentlewoman, the parson's wife, did run away at that time with the whole of it: And yet, for my life, I cannot help thinking but that the parson himself, though he had not the good fortune to hit upon the design first, --yet, as he heartily concurred in it the moment it was laid before him, and as heartily parted with his money to carry it into execution, had a claim to some share of it, --if not to a full half of whatever honour was due to it.\nThe world at that time was pleased to determine the matter otherwise.\nLay down the book, and I will allow you half a day to give a probable guess at the grounds of this procedure.\nBe it known then, that, for about five years before the date of the midwife's licence, of which you have had so circumstantial an account, --the parson we have to do with had made himself a country-talk by a breach of all decorum, which he had committed against himself, his station, and his office; --and that was in never appearing better, or otherwise mounted, than upon a lean, sorry, jack-ass of a horse, value about one pound fifteen shillings; who, to shorten all description of him, was full brother to _Rosinante_, as far as similitude congenial could make him; for he answered his description to a hair-breadth in every thing, --except that I do not remember 'tis any where said, that _Rosinante_ was broken-winded; and that, moreover, _Rosinante_, as is the happiness of most _Spanish_ horses, fat or lean, --was undoubtedly a horse at all points.\nI know very well that the HERO'S horse was a horse of chaste deportment, which may have given grounds for the contrary opinion: But it is as certain at the same time, that _Rosinante's_ continency (as may be demonstrated from the adventure of the _Yanguesian_ carriers) proceeded from no bodily defect or cause whatsoever, but from the temperance and orderly current of his blood. --And let me tell you, Madam, there is a great deal of very good chastity in the world, in behalf of which you could not say more for your life.\nLet that be as it may, as my purpose is to do extra justice to every creature brought upon the stage of this dramatic work, --I could not stifle this distinction in favour of Don _Quixote's_ horse; ----in all other points, the parson's horse, I say, was just such another, --for he was as lean, and as lank, and as sorry a jade, as HUMILITY herself could have bestrided.\nIn the estimation of here and there a man of weak judgment, it was greatly in the parson's power to have helped the figure of this horse of his, --for he was master of a very handsome demi-peak'd saddle, quilted on the seat with green plush, garnished with a double row of silver-headed studs, and a noble pair of shining brass stirrups, with a housing altogether suitable, of grey superfine cloth, with an edging of black lace, terminating in a deep, black, silk fringe, _poudr d'or_, --all which he had purchased in the pride and prime of his life, together with a grand embossed bridle, ornamented at all points as it should be. ----But not caring to banter his beast, he had hung all these up behind his study door: --and, in lieu of them, had seriously befitted him with just such a bridle and such a saddle, as the figure and value of such a steed might well and truly deserve.\nIn the several sallies about his parish, and in the neighbouring visits to the gentry who lived around him, --you will easily comprehend, that the parson, so appointed, would both hear and see enough to keep his philosophy from rusting. To speak the truth, he never could enter a village, but he caught the attention of both old and young. ----Labour stood still as he pass'd----the bucket hung suspended in the middle of the well, ----the spinning-wheel forgot its round, ----even chuck-farthing and shuffle-cap themselves stood gaping till he had got out of sight; and as his movement was not of the quickest, he had generally time enough upon his hands to make his observations, --to hear the groans of the serious, --and the laughter of the light-hearted; --all which he bore with excellent tranquillity. --His character was, --he loved a jest in his heart--and as he saw himself in the true point of ridicule, he would say he could not be angry with others for seeing him in a light, in which he so strongly saw himself: So that to his friends, who knew his foible was not the love of money, and who therefore made the less scruple in bantering the extravagance of his humour, --instead of giving the true cause, --he chose rather to join in the laugh against himself; and as he never carried one single ounce of flesh upon his own bones, being altogether as spare a figure as his beast, --he would sometimes insist upon it, that the horse was as good as the rider deserved; --that they were, centaur-like, --both of a piece. At other times, and in other moods, when his spirits were above the temptation of false wit, --he would say, he found himself going off fast in a consumption; and, with great gravity, would pretend, he could not bear the sight of a fat horse, without a dejection of heart, and a sensible alteration in his pulse; and that he had made choice of the lean one he rode upon, not only to keep himself in countenance, but in spirits.\nAt different times he would give fifty humorous and apposite reasons for riding a meek-spirited jade of a broken-winded horse, preferably to one of mettle; --for on such a one he could sit mechanically, and meditate as delightfully _de vanitate mundi et fug sculi_, as with the advantage of a death's-head before him; --that, in all other exercitations, he could spend his time, as he rode slowly along, --to as much account as in his study; --that he could draw up an argument in his sermon, --or a hole in his breeches, as steadily on the one as in the other; --that brisk trotting and slow argumentation, like wit and judgment, were two incompatible movements. --But that upon his steed--he could unite and reconcile every thing, --he could compose his sermon--he could compose his cough, ----and, in case nature gave a call that way, he could likewise compose himself to sleep. --In short, the parson upon such encounters would assign any cause but the true cause, --and he with-held the true one, only out of a nicety of temper, because he thought it did honour to him.\nBut the truth of the story was as follows: In the first years of this gentleman's life, and about the time when the superb saddle and bridle were purchased by him, it had been his manner, or vanity, or call it what you will, --to run into the opposite extreme. --In the language of the county where he dwelt, he was said to have loved a good horse, and generally had one of the best in the whole parish standing in his stable always ready for saddling; and as the nearest midwife, as I told you, did not live nearer to the village than seven miles, and in a vile country, --it so fell out that the poor gentleman was scarce a whole week together without some piteous application for his beast; and as he was not an unkind-hearted man, and every case was more pressing and more distressful than the last, --as much as he loved his beast, he had never a heart to refuse him; the upshot of which was generally this, that his horse was either clapp'd, or spavin'd, or greaz'd; --or he was twitter-bon'd, or broken-winded, or something, in short, or other had befallen him, which would let him carry no flesh; --so that he had every nine or ten months a bad horse to get rid of, --and a good horse to purchase in his stead.\nWhat the loss on such a balance might amount to, _communibus annis_, I would leave to a special jury of sufferers in the same traffick, to determine; --but let it be what it would, the honest gentleman bore it for many years without a murmur, till at length, by repeated ill accidents of the kind, he found it necessary to take the thing under consideration; and upon weighing the whole, and summing it up in his mind, he found it not only disproportioned to his other expences, but withal so heavy an article in itself, as to disable him from any other act of generosity in his parish: Besides this, he considered that with half the sum thus galloped away, he could do ten times as much good; --and what still weighed more with him than all other considerations put together, was this, that it confined all his charity into one particular channel, and where, as he fancied, it was the least wanted, namely, to the child-bearing and child-getting part of his parish; reserving nothing for the impotent, --nothing for the aged, --nothing for the many comfortless scenes he was hourly called forth to visit, where poverty, and sickness, and affliction dwelt together.\nFor these reasons he resolved to discontinue the expence; and there appeared but two possible ways to extricate him clearly out of it; --and these were, either to make it an irrevocable law never more to lend his steed upon any application whatever, --or else be content to ride the last poor devil, such as they had made him, with all his aches and infirmities, to the very end of the chapter.\nAs he dreaded his own constancy in the first--he very chearfully betook himself to the second; and though he could very well have explained it, as I said, to his honour, --yet, for that very reason, he had a spirit above it; choosing rather to bear the contempt of his enemies, and the laughter of his friends, than undergo the pain of telling a story, which might seem a panegyrick upon himself.\nI have the highest idea of the spiritual and refined sentiments of this reverend gentleman, from this single stroke in his character, which I think comes up to any of the honest refinements of the peerless knight of _La Mancha_, whom, by the bye, with all his follies, I love more, and would actually have gone farther to have paid a visit to, than the greatest hero of antiquity.\nBut this is not the moral of my story: The thing I had in view was to shew the temper of the world in the whole of this affair. --For you must know, that so long as this explanation would have done the parson credit, --the devil a soul could find it out, --I suppose his enemies would not, and that his friends could not. ----But no sooner did he bestir himself in behalf of the midwife, and pay the expences of the ordinary's licence to set her up, --but the whole secret came out; every horse he had lost, and two horses more than ever he had lost, with all the circumstances of their destruction, were known and distinctly remembered. --The story ran like wild-fire-- \"The parson had a returning fit of pride which had just seized him; and he was going to be well mounted once again in his life; and if it was so, 'twas plain as the sun at noon-day, he would pocket the expence of the licence, ten times told, the very first year: --So that every body was left to judge what were his views in this act of charity.\"\nWhat were his views in this, and in every other action of his life, --or rather what were the opinions which floated in the brains of other people concerning it, was a thought which too much floated in his own, and too often broke in upon his rest, when he should have been sound asleep.\nAbout ten years ago this gentleman had the good fortune to be made entirely easy upon that score, --it being just so long since he left his parish, --and the whole world at the same time behind him, --and stands accountable to a Judge of whom he will have no cause to complain.\nBut there is a fatality attends the actions of some men: Order them as they will, they pass thro' a certain medium, which so twists and refracts them from their true directions----that, with all the titles to praise which a rectitude of heart can give, the doers of them are nevertheless forced to live and die without it.\nOf the truth of which, this gentleman was a painful example. ----But to know by what means this came to pass, --and to make that knowledge of use to you, I insist upon it that you read the two following chapters, which contain such a sketch of his life and conversation, as will carry its moral along with it. --When this is done, if nothing stops us in our way, we will go on with the midwife.",
        "paragraph_chars": [
            [
                0,
                677
            ],
            [
                677,
                747
            ],
            [
                747,
                857
            ],
            [
                857,
                1716
            ],
            [
                1716,
                2242
            ],
            [
                2242,
                2613
            ],
            [
                2613,
                3497
            ],
            [
                3497,
                5456
            ],
            [
                5456,
                6531
            ],
            [
                6531,
                7750
            ],
            [
                7750,
                8916
            ],
            [
                8916,
                9311
            ],
            [
                9311,
                9708
            ],
            [
                9708,
                10089
            ],
            [
                10089,
                11107
            ],
            [
                11107,
                11395
            ],
            [
                11395,
                11673
            ],
            [
                11673,
                11996
            ],
            [
                11996,
                12390
            ]
        ],
        "segment_chars": [
            [
                0,
                677
            ],
            [
                677,
                747
            ],
            [
                747,
                857
            ],
            [
                857,
                1716
            ],
            [
                1716,
                2097
            ],
            [
                2097,
                2242
            ],
            [
                2242,
                2613
            ],
            [
                2613,
                3245
            ],
            [
                3245,
                3497
            ],
            [
                3497,
                3734
            ],
            [
                3734,
                3837
            ],
            [
                3837,
                4306
            ],
            [
                4306,
                5028
            ],
            [
                5028,
                5456
            ],
            [
                5456,
                6120
            ],
            [
                6120,
                6338
            ],
            [
                6338,
                6531
            ],
            [
                6531,
                6792
            ],
            [
                6792,
                7750
            ],
            [
                7750,
                8916
            ],
            [
                8916,
                9311
            ],
            [
                9311,
                9708
            ],
            [
                9708,
                10089
            ],
            [
                10089,
                10217
            ],
            [
                10217,
                10411
            ],
            [
                10411,
                10727
            ],
            [
                10727,
                11107
            ],
            [
                11107,
                11395
            ],
            [
                11395,
                11673
            ],
            [
                11673,
                11996
            ],
            [
                11996,
                12057
            ],
            [
                12057,
                12306
            ],
            [
                12306,
                12390
            ]
        ],
        "overlap_chars": [
            [
                0,
                8
            ],
            [
                25,
                30
            ],
            [
                108,
                112
            ],
            [
                42,
                48
            ],
            [
                35,
                38
            ],
            [
                417,
                419
            ],
            [
                65,
                82
            ],
            [
                95,
                96
            ],
            [
                135,
                164
            ],
            [
                174,
                190
            ],
            [
                211,
                217
            ],
            [
                195,
                202
            ],
            [
                131,
                132
            ],
            [
                203,
                210
            ],
            [
                217,
                223
            ],
            [
                241,
                258
            ],
            [
                301,
                306
            ],
            [
                308,
                315
            ],
            [
                330,
                352
            ],
            [
                357,
                380
            ],
            [
                382,
                391
            ],
            [
                260,
                263
            ],
            [
                396,
                399
            ],
            [
                420,
                432
            ],
            [
                239,
                240
            ],
            [
                449,
                452
            ],
            [
                460,
                468
            ],
            [
                286,
                290
            ],
            [
                482,
                484
            ],
            [
                518,
                560
            ],
            [
                496,
                498
            ],
            [
                586,
                614
            ],
            [
                31,
                34
            ],
            [
                655,
                661
            ],
            [
                675,
                677
            ],
            [
                677,
                714
            ],
            [
                736,
                747
            ],
            [
                747,
                800
            ],
            [
                817,
                829
            ],
            [
                841,
                845
            ],
            [
                855,
                857
            ],
            [
                857,
                879
            ],
            [
                885,
                943
            ],
            [
                1002,
                1008
            ],
            [
                1028,
                1044
            ],
            [
                998,
                1001
            ],
            [
                1055,
                1059
            ],
            [
                944,
                946
            ],
            [
                1622,
                1625
            ],
            [
                1047,
                1054
            ],
            [
                1060,
                1086
            ],
            [
                1054,
                1055
            ],
            [
                1088,
                1110
            ],
            [
                1181,
                1190
            ],
            [
                1212,
                1219
            ],
            [
                1226,
                1311
            ],
            [
                1348,
                1367
            ],
            [
                1374,
                1378
            ],
            [
                879,
                880
            ],
            [
                1432,
                1434
            ],
            [
                1444,
                1459
            ],
            [
                1172,
                1174
            ],
            [
                994,
                995
            ],
            [
                1496,
                1525
            ],
            [
                1163,
                1167
            ],
            [
                1558,
                1562
            ],
            [
                1564,
                1586
            ],
            [
                1591,
                1602
            ],
            [
                1609,
                1613
            ],
            [
                1677,
                1715
            ],
            [
                2465,
                2483
            ],
            [
                2524,
                2601
            ],
            [
                2611,
                2613
            ],
            [
                2671,
                2672
            ],
            [
                2691,
                2701
            ],
            [
                2781,
                2802
            ],
            [
                2809,
                2824
            ],
            [
                2837,
                2949
            ],
            [
                2951,
                2965
            ],
            [
                2987,
                3011
            ],
            [
                3017,
                3040
            ],
            [
                2639,
                2642
            ],
            [
                2649,
                2650
            ],
            [
                3065,
                3070
            ],
            [
                3072,
                3084
            ],
            [
                3101,
                3201
            ],
            [
                3243,
                3245
            ],
            [
                3249,
                3252
            ],
            [
                3285,
                3332
            ],
            [
                3335,
                3339
            ],
            [
                3283,
                3284
            ],
            [
                3389,
                3411
            ],
            [
                3419,
                3425
            ],
            [
                3427,
                3429
            ],
            [
                3274,
                3277
            ],
            [
                3461,
                3466
            ],
            [
                3482,
                3487
            ],
            [
                3495,
                3497
            ],
            [
                3497,
                3499
            ],
            [
                3520,
                3537
            ],
            [
                3640,
                3650
            ],
            [
                3757,
                3784
            ],
            [
                3800,
                3837
            ],
            [
                3860,
                3865
            ],
            [
                3876,
                3927
            ],
            [
                3933,
                3968
            ],
            [
                3974,
                4009
            ],
            [
                4021,
                4041
            ],
            [
                4050,
                4091
            ],
            [
                4107,
                4115
            ],
            [
                4126,
                4130
            ],
            [
                4181,
                4215
            ],
            [
                4218,
                4256
            ],
            [
                4259,
                4306
            ],
            [
                4329,
                4344
            ],
            [
                4359,
                4380
            ],
            [
                4775,
                4777
            ],
            [
                4410,
                4476
            ],
            [
                4384,
                4387
            ],
            [
                4479,
                4484
            ],
            [
                4498,
                4500
            ],
            [
                4531,
                4546
            ],
            [
                4717,
                4774
            ],
            [
                4495,
                4497
            ],
            [
                4322,
                4325
            ],
            [
                4858,
                4860
            ],
            [
                4876,
                4889
            ],
            [
                4892,
                4917
            ],
            [
                4927,
                4976
            ],
            [
                4979,
                5008
            ],
            [
                5011,
                5027
            ],
            [
                5028,
                5063
            ],
            [
                5123,
                5135
            ],
            [
                5137,
                5225
            ],
            [
                5227,
                5269
            ],
            [
                5339,
                5356
            ],
            [
                5372,
                5384
            ],
            [
                5408,
                5426
            ],
            [
                5447,
                5456
            ],
            [
                5456,
                5503
            ],
            [
                5517,
                5551
            ],
            [
                5581,
                5582
            ],
            [
                5562,
                5581
            ],
            [
                5776,
                5780
            ],
            [
                5618,
                5644
            ],
            [
                5659,
                5671
            ],
            [
                5610,
                5611
            ],
            [
                5810,
                5859
            ],
            [
                5672,
                5674
            ],
            [
                5682,
                5687
            ],
            [
                5881,
                5897
            ],
            [
                5900,
                5921
            ],
            [
                5560,
                5561
            ],
            [
                5925,
                5947
            ],
            [
                6020,
                6039
            ],
            [
                6118,
                6120
            ],
            [
                6131,
                6145
            ],
            [
                6191,
                6218
            ],
            [
                6187,
                6188
            ],
            [
                6162,
                6165
            ],
            [
                6312,
                6337
            ],
            [
                6340,
                6360
            ],
            [
                6382,
                6387
            ],
            [
                6395,
                6417
            ],
            [
                6453,
                6457
            ],
            [
                6431,
                6433
            ],
            [
                6463,
                6469
            ],
            [
                6529,
                6531
            ],
            [
                6531,
                6538
            ],
            [
                6552,
                6561
            ],
            [
                6596,
                6600
            ],
            [
                6572,
                6580
            ],
            [
                6601,
                6612
            ],
            [
                6617,
                6618
            ],
            [
                6638,
                6642
            ],
            [
                6643,
                6671
            ],
            [
                6693,
                6755
            ],
            [
                6758,
                6760
            ],
            [
                6770,
                6792
            ],
            [
                6840,
                6933
            ],
            [
                6943,
                6956
            ],
            [
                6988,
                7026
            ],
            [
                7067,
                7078
            ],
            [
                7050,
                7061
            ],
            [
                6838,
                6839
            ],
            [
                7270,
                7275
            ],
            [
                7163,
                7167
            ],
            [
                7125,
                7143
            ],
            [
                7185,
                7242
            ],
            [
                7246,
                7252
            ],
            [
                7366,
                7380
            ],
            [
                6797,
                6800
            ],
            [
                7383,
                7398
            ],
            [
                7404,
                7414
            ],
            [
                7428,
                7437
            ],
            [
                7144,
                7147
            ],
            [
                7442,
                7472
            ],
            [
                7477,
                7484
            ],
            [
                7490,
                7494
            ],
            [
                6982,
                6983
            ],
            [
                7506,
                7527
            ],
            [
                7529,
                7561
            ],
            [
                7573,
                7581
            ],
            [
                7402,
                7403
            ],
            [
                7638,
                7645
            ],
            [
                6813,
                6816
            ],
            [
                7649,
                7704
            ],
            [
                7707,
                7726
            ],
            [
                7736,
                7750
            ],
            [
                7755,
                7758
            ],
            [
                7851,
                7853
            ],
            [
                8345,
                8349
            ],
            [
                7929,
                8008
            ],
            [
                8012,
                8037
            ],
            [
                8531,
                8535
            ],
            [
                8042,
                8072
            ],
            [
                7867,
                7870
            ],
            [
                8113,
                8126
            ],
            [
                8153,
                8155
            ],
            [
                8127,
                8136
            ],
            [
                8167,
                8180
            ],
            [
                8240,
                8248
            ],
            [
                7772,
                7773
            ],
            [
                8271,
                8335
            ],
            [
                8351,
                8443
            ],
            [
                7902,
                7905
            ],
            [
                8610,
                8612
            ],
            [
                8625,
                8631
            ],
            [
                7797,
                7798
            ],
            [
                8542,
                8557
            ],
            [
                8562,
                8574
            ],
            [
                8661,
                8678
            ],
            [
                8697,
                8715
            ],
            [
                8854,
                8861
            ],
            [
                8613,
                8623
            ],
            [
                7910,
                7912
            ],
            [
                8527,
                8530
            ],
            [
                8636,
                8641
            ],
            [
                7898,
                7899
            ],
            [
                8755,
                8776
            ],
            [
                7817,
                7818
            ],
            [
                8914,
                8916
            ],
            [
                8978,
                9031
            ],
            [
                8972,
                8973
            ],
            [
                9069,
                9086
            ],
            [
                8946,
                8948
            ],
            [
                9106,
                9111
            ],
            [
                9120,
                9124
            ],
            [
                9040,
                9043
            ],
            [
                9125,
                9134
            ],
            [
                9168,
                9175
            ],
            [
                9117,
                9119
            ],
            [
                9176,
                9214
            ],
            [
                9241,
                9311
            ],
            [
                9314,
                9316
            ],
            [
                9370,
                9375
            ],
            [
                9398,
                9404
            ],
            [
                9404,
                9425
            ],
            [
                9436,
                9453
            ],
            [
                9473,
                9480
            ],
            [
                9483,
                9486
            ],
            [
                9644,
                9646
            ],
            [
                9357,
                9359
            ],
            [
                9545,
                9626
            ],
            [
                9346,
                9349
            ],
            [
                9657,
                9662
            ],
            [
                9706,
                9708
            ],
            [
                9708,
                9738
            ],
            [
                9761,
                9798
            ],
            [
                9800,
                9809
            ],
            [
                9817,
                9900
            ],
            [
                9935,
                10050
            ],
            [
                10052,
                10089
            ],
            [
                10089,
                10126
            ],
            [
                10138,
                10139
            ],
            [
                10156,
                10158
            ],
            [
                10128,
                10131
            ],
            [
                10175,
                10190
            ],
            [
                10204,
                10217
            ],
            [
                10219,
                10222
            ],
            [
                10243,
                10305
            ],
            [
                10325,
                10342
            ],
            [
                10409,
                10411
            ],
            [
                10415,
                10450
            ],
            [
                10454,
                10488
            ],
            [
                10498,
                10500
            ],
            [
                10531,
                10534
            ],
            [
                10516,
                10523
            ],
            [
                10537,
                10538
            ],
            [
                10617,
                10621
            ],
            [
                10545,
                10595
            ],
            [
                10704,
                10726
            ],
            [
                10729,
                10757
            ],
            [
                10936,
                10937
            ],
            [
                10906,
                10907
            ],
            [
                10761,
                10775
            ],
            [
                10816,
                10822
            ],
            [
                10776,
                10777
            ],
            [
                10788,
                10800
            ],
            [
                10904,
                10905
            ],
            [
                10828,
                10874
            ],
            [
                10886,
                10891
            ],
            [
                10942,
                10961
            ],
            [
                10970,
                10984
            ],
            [
                10986,
                10995
            ],
            [
                11000,
                11021
            ],
            [
                11197,
                11209
            ],
            [
                11238,
                11264
            ],
            [
                11130,
                11134
            ],
            [
                11326,
                11331
            ],
            [
                11346,
                11354
            ],
            [
                11393,
                11394
            ],
            [
                11395,
                11492
            ],
            [
                11596,
                11673
            ],
            [
                11677,
                11759
            ],
            [
                11823,
                11849
            ],
            [
                11994,
                11995
            ],
            [
                11996,
                11998
            ],
            [
                12019,
                12023
            ],
            [
                12017,
                12018
            ],
            [
                11999,
                12002
            ],
            [
                12034,
                12056
            ],
            [
                12061,
                12072
            ],
            [
                12087,
                12105
            ],
            [
                12150,
                12158
            ],
            [
                12167,
                12265
            ],
            [
                12267,
                12274
            ],
            [
                12281,
                12290
            ],
            [
                12304,
                12306
            ],
            [
                12308,
                12390
            ]
        ],
        "row_chars": [
            [
                0,
                677
            ],
            [
                677,
                747
            ],
            [
                747,
                857
            ],
            [
                857,
                1716
            ],
            [
                1716,
                2097
            ],
            [
                2097,
                2242
            ],
            [
                2242,
                2613
            ],
            [
                2613,
                3245
            ],
            [
                3245,
                3497
            ],
            [
                3497,
                3837
            ],
            [
                3837,
                4306
            ],
            [
                4306,
                5028
            ],
            [
                5028,
                5456
            ],
            [
                5456,
                6120
            ],
            [
                6120,
                6338
            ],
            [
                6338,
                6531
            ],
            [
                6531,
                6792
            ],
            [
                6792,
                7750
            ],
            [
                7750,
                8916
            ],
            [
                8916,
                9311
            ],
            [
                9311,
                9708
            ],
            [
                9708,
                10089
            ],
            [
                10089,
                10217
            ],
            [
                10217,
                10411
            ],
            [
                10411,
                10727
            ],
            [
                10727,
                11107
            ],
            [
                11107,
                11395
            ],
            [
                11395,
                11673
            ],
            [
                11673,
                11996
            ],
            [
                11996,
                12057
            ],
            [
                12057,
                12306
            ],
            [
                12306,
                12390
            ]
        ]
    },
    "abridged": {
        "text": "Whatever merit that benign act to the midwife might have, at first sight seems not very relevant to this history; it was certain, however, that the parson's wife gained all of it. And yet I cannot help thinking that the parson himself - though he did not hit upon the idea, yet heartily agreed with it, and as heartily parted with his money to see it carried out - had a claim to some share of the honour.\nThe world at that time was pleased to decide otherwise.\nLay down the book, and I will allow you half a day to guess at the reason for this.\nBe it known then, that about five years before the date of the midwife's licence, this very parson had made himself the talk of the country by a breach of all decorum - which he had committed by appearing mounted upon a lean, sorry, jack-ass of a horse, value about one pound fifteen shillings; who was full brother to Rosinante, Don Quixote's old nag. He matched his description in everything, except that I do not remember that Rosinante was broken-winded; and, moreover, Rosinante was undoubtedly a horse at all points. The parson's horse was as lean, and as lank, and as sorry a jade, as Humility herself could have ridden.\nNow, the parson owned a very handsome demi-peaked saddle, quilted with green plush, garnished with a double row of silver-headed studs, and a noble pair of shining brass stirrups; with a housing of grey superfine cloth, an edging of black lace and a black silk fringe, - all which he had purchased in the pride and prime of his life, together with a grand embossed bridle. But he had hung all these up behind his study door: and, instead, he used just such a bridle and saddle as his steed truly deserved.\nIn riding about his parish, the parson never could enter a village without catching the attention of both old and young. Work ceased as he passed - the bucket hung suspended in the middle of the well - the spinning-wheel forgot its round - even chuck-farthing and shuffle-cap players stood gaping till he rode out of sight; and as his movement was not quick, he had time to hear the groans of the serious, and the laughter of the light-hearted; all which he bore with excellent tranquillity. He loved a jest - and as he saw himself as ridiculous, he would say he could not be angry with others for seeing him in the same light.\nSo to his friends, he chose rather to join in the laugh against himself; and since he was as thin as his beast, he would sometimes insist that the horse was as good as the rider deserved; that they were, centaur-like, both of a piece.\nAt other times, and in other moods, he would say that he found himself going off fast in a consumption; and, with great gravity, would pretend he could not bear the sight of a fat horse; and that he had chosen the lean one to keep himself in spirits.\nAt different times he would give fifty humorous reasons for riding a meek-spirited, broken-winded horse: that on such a one he could sit and meditate; that he could spend his time, as he rode slowly along, as usefully as in his study; that he could draw up a long argument in his sermon that brisk trotting would not allow. Upon his steed he could compose his sermon, and even compose himself to sleep.\nIn short, the parson would name any cause but the true one, which he withheld out of modesty.\nBut the true story was this: in the gentleman's youth, when he bought the superb saddle and bridle, it had been his manner, or vanity, or call it what you will, to go to the opposite extreme. He was said to have loved a good horse, and generally had one of the best in the whole parish in his stable. As the nearest midwife, as I told you, lived seven miles distant from the village, every week the poor gentleman received some piteous application for his beast; and as he was not unkind, he had never the heart to refuse.\nThe upshot generally was, that his horse was either clapped, or spavined, or lamed; or he was twitter-boned, or broken-winded, or something or other; so that the parson had every nine or ten months a bad horse to get rid of, and a good horse to buy in his stead.\nDespite the cost of this, the honest gentleman bore it for many years without a murmur, till at length, after repeated ill accidents of this kind, he found it necessary to consider the matter. Upon weighing up the whole, he found it so heavy a cost as to disable him from any other act of generosity in his parish. He considered that with half the sum thus galloped away, he could do ten times as much good; but as it was, it confined all charity into the child-bearing part of his parish, where he fancied it was least needed; leaving nothing for the aged, or poor, or sick.\nThere appeared but two possible ways to extricate him from this expense; either to make it a rule to never lend out his steed again - or else to be content to ride the last poor devil, with all his aches and infirmities, to the very end of the chapter.\nHe cheerfully took this second path; and though he could easily have explained it with honour, yet out of humility he chose rather to bear the contempt of his enemies, and the laughter of his friends, than tell the story.\nI have the highest idea of the sentiments of this reverend gentleman from this stroke in his character, which I think comes up to any of the honest refinements of Don Quixote himself, whom, by the bye, with all his follies, I love more, and would actually have gone farther to have paid a visit to than the greatest hero of antiquity.\nBut this is not the moral of my story. I wished to show the nature of the world in this affair. For so long as this explanation would have done the parson credit, nobody could find it out. But no sooner did he bestir himself on behalf of the midwife, and pay the expenses of her licence, than the whole secret came out; every horse he had lost was distinctly remembered.\nThe story ran like wild-fire - 'The parson had been seized by a fit of pride, and he was going to be well mounted once again; and he would pocket the expense of the licence ten times over, the very first year.' The opinions of other people concerning this often disturbed his rest. But about ten years ago this gentleman had the good fortune to be made entirely easy upon that score, and stands accountable to a Judge of whom he will have no cause to complain.\nThere is a fatality attends the actions of some men: order them as they will, they become twisted from their true directions. Of this, the parson was a painful example.\nBut to know how this came to pass, I insist that you read the two following chapters, which contain such a sketch of his life and conversation as will prove its moral. - When this is done, if nothing stops us in our way, we will go on with the midwife.",
        "paragraph_chars": [
            [
                0,
                406
            ],
            [
                406,
                462
            ],
            [
                462,
                546
            ],
            [
                546,
                1174
            ],
            [
                1174,
                1680
            ],
            [
                1680,
                2308
            ],
            [
                2308,
                2543
            ],
            [
                2543,
                2794
            ],
            [
                2794,
                3197
            ],
            [
                3197,
                3291
            ],
            [
                3291,
                3814
            ],
            [
                3814,
                4077
            ],
            [
                4077,
                4653
            ],
            [
                4653,
                4906
            ],
            [
                4906,
                5128
            ],
            [
                5128,
                5463
            ],
            [
                5463,
                5834
            ],
            [
                5834,
                6295
            ],
            [
                6295,
                6464
            ],
            [
                6464,
                6716
            ]
        ],
        "segment_chars": [
            [
                0,
                180
            ],
            [
                180,
                406
            ],
            [
                406,
                462
            ],
            [
                462,
                546
            ],
            [
                546,
                899
            ],
            [
                899,
                1069
            ],
            [
                1069,
                1174
            ],
            [
                1174,
                1547
            ],
            [
                1547,
                1680
            ],
            [
                1680,
                1801
            ],
            [
                1801,
                2172
            ],
            [
                2172,
                2308
            ],
            [
                2308,
                2543
            ],
            [
                2543,
                2794
            ],
            [
                2794,
                3118
            ],
            [
                3118,
                3197
            ],
            [
                3197,
                3291
            ],
            [
                3291,
                3483
            ],
            [
                3483,
                3592
            ],
            [
                3592,
                3814
            ],
            [
                3814,
                4077
            ],
            [
                4077,
                4270
            ],
            [
                4270,
                4392
            ],
            [
                4392,
                4653
            ],
            [
                4653,
                4906
            ],
            [
                4906,
                5128
            ],
            [
                5128,
                5463
            ],
            [
                5463,
                5502
            ],
            [
                5502,
                5559
            ],
            [
                5559,
                5652
            ],
            [
                5652,
                5834
            ],
            [
                5834,
                6045
            ],
            [
                6045,
                6116
            ],
            [
                6116,
                6295
            ],
            [
                6295,
                6421
            ],
            [
                6421,
                6464
            ],
            [
                6464,
                6632
            ],
            [
                6632,
                6716
            ]
        ],
        "overlap_chars": [
            [
                0,
                8
            ],
            [
                9,
                14
            ],
            [
                15,
                19
            ],
            [
                20,
                26
            ],
            [
                27,
                30
            ],
            [
                31,
                33
            ],
            [
                34,
                51
            ],
            [
                56,
                57
            ],
            [
                58,
                87
            ],
            [
                97,
                113
            ],
            [
                114,
                120
            ],
            [
                121,
                128
            ],
            [
                128,
                129
            ],
            [
                130,
                137
            ],
            [
                137,
                143
            ],
            [
                144,
                161
            ],
            [
                173,
                178
            ],
            [
                180,
                187
            ],
            [
                188,
                210
            ],
            [
                211,
                234
            ],
            [
                237,
                246
            ],
            [
                247,
                250
            ],
            [
                251,
                254
            ],
            [
                255,
                267
            ],
            [
                272,
                273
            ],
            [
                274,
                277
            ],
            [
                278,
                286
            ],
            [
                294,
                298
            ],
            [
                299,
                301
            ],
            [
                301,
                343
            ],
            [
                348,
                350
            ],
            [
                365,
                393
            ],
            [
                394,
                397
            ],
            [
                398,
                404
            ],
            [
                404,
                406
            ],
            [
                406,
                443
            ],
            [
                451,
                462
            ],
            [
                462,
                515
            ],
            [
                516,
                528
            ],
            [
                540,
                544
            ],
            [
                544,
                546
            ],
            [
                546,
                568
            ],
            [
                569,
                627
            ],
            [
                638,
                644
            ],
            [
                645,
                661
            ],
            [
                662,
                665
            ],
            [
                666,
                670
            ],
            [
                671,
                673
            ],
            [
                674,
                677
            ],
            [
                678,
                685
            ],
            [
                686,
                712
            ],
            [
                713,
                714
            ],
            [
                715,
                737
            ],
            [
                741,
                750
            ],
            [
                751,
                758
            ],
            [
                759,
                844
            ],
            [
                845,
                864
            ],
            [
                870,
                874
            ],
            [
                874,
                875
            ],
            [
                899,
                901
            ],
            [
                910,
                925
            ],
            [
                926,
                928
            ],
            [
                939,
                940
            ],
            [
                941,
                970
            ],
            [
                971,
                975
            ],
            [
                981,
                985
            ],
            [
                986,
                1008
            ],
            [
                1008,
                1019
            ],
            [
                1025,
                1029
            ],
            [
                1030,
                1068
            ],
            [
                1069,
                1087
            ],
            [
                1088,
                1165
            ],
            [
                1172,
                1174
            ],
            [
                1177,
                1178
            ],
            [
                1179,
                1189
            ],
            [
                1196,
                1217
            ],
            [
                1224,
                1239
            ],
            [
                1240,
                1352
            ],
            [
                1354,
                1368
            ],
            [
                1369,
                1393
            ],
            [
                1394,
                1417
            ],
            [
                1418,
                1421
            ],
            [
                1422,
                1423
            ],
            [
                1424,
                1429
            ],
            [
                1430,
                1442
            ],
            [
                1445,
                1545
            ],
            [
                1545,
                1547
            ],
            [
                1547,
                1550
            ],
            [
                1551,
                1598
            ],
            [
                1599,
                1603
            ],
            [
                1611,
                1612
            ],
            [
                1621,
                1643
            ],
            [
                1644,
                1650
            ],
            [
                1651,
                1653
            ],
            [
                1654,
                1657
            ],
            [
                1658,
                1663
            ],
            [
                1664,
                1669
            ],
            [
                1678,
                1680
            ],
            [
                1680,
                1682
            ],
            [
                1690,
                1707
            ],
            [
                1708,
                1718
            ],
            [
                1719,
                1746
            ],
            [
                1764,
                1801
            ],
            [
                1813,
                1818
            ],
            [
                1828,
                1879
            ],
            [
                1882,
                1917
            ],
            [
                1920,
                1955
            ],
            [
                1964,
                1984
            ],
            [
                1990,
                2031
            ],
            [
                2037,
                2045
            ],
            [
                2046,
                2050
            ],
            [
                2051,
                2085
            ],
            [
                2086,
                2124
            ],
            [
                2125,
                2172
            ],
            [
                2172,
                2187
            ],
            [
                2190,
                2211
            ],
            [
                2212,
                2214
            ],
            [
                2225,
                2291
            ],
            [
                2292,
                2295
            ],
            [
                2301,
                2306
            ],
            [
                2308,
                2310
            ],
            [
                2311,
                2326
            ],
            [
                2327,
                2384
            ],
            [
                2391,
                2393
            ],
            [
                2394,
                2397
            ],
            [
                2398,
                2400
            ],
            [
                2406,
                2419
            ],
            [
                2420,
                2445
            ],
            [
                2446,
                2495
            ],
            [
                2496,
                2525
            ],
            [
                2526,
                2542
            ],
            [
                2543,
                2578
            ],
            [
                2579,
                2591
            ],
            [
                2597,
                2685
            ],
            [
                2686,
                2728
            ],
            [
                2728,
                2745
            ],
            [
                2753,
                2765
            ],
            [
                2766,
                2784
            ],
            [
                2785,
                2794
            ],
            [
                2794,
                2841
            ],
            [
                2842,
                2876
            ],
            [
                2876,
                2877
            ],
            [
                2878,
                2897
            ],
            [
                2899,
                2903
            ],
            [
                2904,
                2930
            ],
            [
                2931,
                2943
            ],
            [
                2943,
                2944
            ],
            [
                2950,
                2999
            ],
            [
                3000,
                3002
            ],
            [
                3006,
                3011
            ],
            [
                3012,
                3028
            ],
            [
                3029,
                3050
            ],
            [
                3051,
                3052
            ],
            [
                3058,
                3080
            ],
            [
                3081,
                3100
            ],
            [
                3116,
                3118
            ],
            [
                3118,
                3132
            ],
            [
                3133,
                3160
            ],
            [
                3160,
                3161
            ],
            [
                3162,
                3165
            ],
            [
                3171,
                3196
            ],
            [
                3197,
                3217
            ],
            [
                3218,
                3223
            ],
            [
                3229,
                3251
            ],
            [
                3252,
                3256
            ],
            [
                3263,
                3265
            ],
            [
                3275,
                3281
            ],
            [
                3289,
                3291
            ],
            [
                3291,
                3298
            ],
            [
                3304,
                3313
            ],
            [
                3314,
                3318
            ],
            [
                3318,
                3326
            ],
            [
                3327,
                3338
            ],
            [
                3344,
                3345
            ],
            [
                3346,
                3350
            ],
            [
                3361,
                3389
            ],
            [
                3389,
                3451
            ],
            [
                3452,
                3454
            ],
            [
                3461,
                3483
            ],
            [
                3483,
                3576
            ],
            [
                3577,
                3590
            ],
            [
                3592,
                3630
            ],
            [
                3637,
                3648
            ],
            [
                3662,
                3673
            ],
            [
                3673,
                3674
            ],
            [
                3675,
                3680
            ],
            [
                3681,
                3685
            ],
            [
                3686,
                3704
            ],
            [
                3714,
                3771
            ],
            [
                3772,
                3778
            ],
            [
                3778,
                3792
            ],
            [
                3793,
                3796
            ],
            [
                3797,
                3812
            ],
            [
                3814,
                3824
            ],
            [
                3825,
                3834
            ],
            [
                3835,
                3838
            ],
            [
                3838,
                3868
            ],
            [
                3873,
                3880
            ],
            [
                3886,
                3890
            ],
            [
                3896,
                3897
            ],
            [
                3898,
                3919
            ],
            [
                3921,
                3953
            ],
            [
                3954,
                3962
            ],
            [
                3962,
                3963
            ],
            [
                3964,
                3971
            ],
            [
                3972,
                3975
            ],
            [
                3983,
                4038
            ],
            [
                4039,
                4058
            ],
            [
                4063,
                4077
            ],
            [
                4085,
                4088
            ],
            [
                4094,
                4096
            ],
            [
                4097,
                4101
            ],
            [
                4101,
                4180
            ],
            [
                4187,
                4212
            ],
            [
                4213,
                4217
            ],
            [
                4218,
                4248
            ],
            [
                4258,
                4261
            ],
            [
                4270,
                4283
            ],
            [
                4284,
                4286
            ],
            [
                4287,
                4296
            ],
            [
                4296,
                4309
            ],
            [
                4310,
                4318
            ],
            [
                4319,
                4320
            ],
            [
                4326,
                4390
            ],
            [
                4392,
                4484
            ],
            [
                4485,
                4488
            ],
            [
                4489,
                4491
            ],
            [
                4492,
                4498
            ],
            [
                4498,
                4499
            ],
            [
                4500,
                4515
            ],
            [
                4516,
                4528
            ],
            [
                4529,
                4546
            ],
            [
                4547,
                4565
            ],
            [
                4565,
                4572
            ],
            [
                4573,
                4583
            ],
            [
                4584,
                4586
            ],
            [
                4587,
                4590
            ],
            [
                4591,
                4596
            ],
            [
                4603,
                4604
            ],
            [
                4613,
                4634
            ],
            [
                4642,
                4643
            ],
            [
                4651,
                4653
            ],
            [
                4653,
                4706
            ],
            [
                4724,
                4725
            ],
            [
                4726,
                4743
            ],
            [
                4751,
                4753
            ],
            [
                4754,
                4759
            ],
            [
                4760,
                4764
            ],
            [
                4765,
                4768
            ],
            [
                4769,
                4778
            ],
            [
                4787,
                4794
            ],
            [
                4795,
                4797
            ],
            [
                4798,
                4836
            ],
            [
                4836,
                4906
            ],
            [
                4906,
                4908
            ],
            [
                4914,
                4919
            ],
            [
                4930,
                4936
            ],
            [
                4941,
                4962
            ],
            [
                4970,
                4987
            ],
            [
                4993,
                5000
            ],
            [
                5001,
                5004
            ],
            [
                5009,
                5011
            ],
            [
                5021,
                5023
            ],
            [
                5030,
                5111
            ],
            [
                5117,
                5120
            ],
            [
                5121,
                5126
            ],
            [
                5126,
                5128
            ],
            [
                5128,
                5158
            ],
            [
                5159,
                5196
            ],
            [
                5197,
                5206
            ],
            [
                5207,
                5290
            ],
            [
                5310,
                5425
            ],
            [
                5426,
                5463
            ],
            [
                5463,
                5500
            ],
            [
                5502,
                5503
            ],
            [
                5511,
                5513
            ],
            [
                5519,
                5522
            ],
            [
                5530,
                5545
            ],
            [
                5546,
                5559
            ],
            [
                5559,
                5562
            ],
            [
                5563,
                5625
            ],
            [
                5633,
                5650
            ],
            [
                5650,
                5652
            ],
            [
                5652,
                5687
            ],
            [
                5691,
                5725
            ],
            [
                5735,
                5737
            ],
            [
                5738,
                5741
            ],
            [
                5742,
                5749
            ],
            [
                5749,
                5750
            ],
            [
                5751,
                5755
            ],
            [
                5756,
                5806
            ],
            [
                5811,
                5833
            ],
            [
                5834,
                5862
            ],
            [
                5863,
                5864
            ],
            [
                5865,
                5866
            ],
            [
                5866,
                5880
            ],
            [
                5886,
                5892
            ],
            [
                5896,
                5897
            ],
            [
                5898,
                5910
            ],
            [
                5910,
                5911
            ],
            [
                5912,
                5958
            ],
            [
                5958,
                5963
            ],
            [
                5964,
                5983
            ],
            [
                5992,
                6006
            ],
            [
                6007,
                6016
            ],
            [
                6021,
                6042
            ],
            [
                6045,
                6057
            ],
            [
                6058,
                6084
            ],
            [
                6085,
                6089
            ],
            [
                6090,
                6095
            ],
            [
                6106,
                6114
            ],
            [
                6114,
                6115
            ],
            [
                6120,
                6217
            ],
            [
                6218,
                6295
            ],
            [
                6295,
                6377
            ],
            [
                6393,
                6419
            ],
            [
                6419,
                6420
            ],
            [
                6421,
                6423
            ],
            [
                6424,
                6428
            ],
            [
                6428,
                6429
            ],
            [
                6430,
                6433
            ],
            [
                6441,
                6463
            ],
            [
                6464,
                6475
            ],
            [
                6480,
                6498
            ],
            [
                6499,
                6507
            ],
            [
                6508,
                6606
            ],
            [
                6607,
                6614
            ],
            [
                6621,
                6630
            ],
            [
                6630,
                6632
            ],
            [
                6634,
                6716
            ]
        ],
        "row_chars": [
            [
                0,
                406
            ],
            [
                406,
                462
            ],
            [
                462,
                546
            ],
            [
                546,
                1069
            ],
            [
                1069,
                1069
            ],
            [
                1069,
                1069
            ],
            [
                1069,
                1174
            ],
            [
                1174,
                1547
            ],
            [
                1547,
                1680
            ],
            [
                1680,
                1801
            ],
            [
                1801,
                2172
            ],
            [
                2172,
                2543
            ],
            [
                2543,
                2794
            ],
            [
                2794,
                3118
            ],
            [
                3118,
                3197
            ],
            [
                3197,
                3291
            ],
            [
                3291,
                3483
            ],
            [
                3483,
                4077
            ],
            [
                4077,
                4653
            ],
            [
                4653,
                4906
            ],
            [
                4906,
                5128
            ],
            [
                5128,
                5463
            ],
            [
                5463,
                5559
            ],
            [
                5559,
                5652
            ],
            [
                5652,
                5834
            ],
            [
                5834,
                6045
            ],
            [
                6045,
                6116
            ],
            [
                6116,
                6295
            ],
            [
                6295,
                6421
            ],
            [
                6421,
                6464
            ],
            [
                6464,
                6632
            ],
            [
                6632,
                6716
            ]
        ]
    }
}