{
    "original": {
        "text": "Is it not a shame to make two chapters of what passed in going down one pair of stairs? for we are got no farther yet than to the first landing, and there are fifteen more steps down to the bottom; and for aught I know, as my father and my uncle _Toby_ are in a talking humour, there may be as many chapters as steps: ----let that be as it will, Sir, I can no more help it than my destiny: --A sudden impulse comes across me----drop the curtain, _Shandy_ ----I drop it --Strike a line here across the paper, _Tristram_ --I strike it--and hey for a new chapter.\nThe deuce of any other rule have I to govern myself by in this affair--and if I had one--as I do all things out of all rule --I would twist it and tear it to pieces, and throw it into the fire when I had done --Am I warm? I am, and the cause demands it----a pretty story! is a man to follow rules------or rules to follow him?\nNow this, you must know, being my chapter upon chapters, which I promised to write before I went to sleep, I thought it meet to ease my conscience entirely before I laid down, by telling the world all I knew about the matter at once: Is not this ten times better than to set out dogmatically with a sententious parade of wisdom, and telling the world a story of a roasted horse----that chapters relieve the mind--that they assist--or impose upon the imagination--and that in a work of this dramatic cast they are as necessary as the shifting of scenes----with fifty other cold conceits, enough to extinguish the fire which roasted him? --O! but to understand this, which is a puff at the fire of _Diana's_ temple--you must read _Longinus_--read away--if you are not a jot the wiser by reading him the first time over--never fear--read him again--_Avicenna_ and _Licetus_ read _Aristotle's_ metaphysicks forty times through apiece, and never understood a single word. --But mark the consequence--_Avicenna_ turned out a desperate writer at all kinds of writing--for he wrote books _de omni scribili_; and for _Licetus_ (_Fortunio_) though all the world knows he was born a ftus,[4.6] of no more than five inches and a half in length, yet he grew to that astonishing height in literature, as to write a book with a title as long as himself------the learned know I mean his _Gonopsychanthropologia_, upon the origin of the human soul.\nSo much for my chapter upon chapters, which I hold to be the best chapter in my whole work; and take my word, whoever reads it, is full as well employed, as in picking straws.\n[Footnote 4.6: _Ce Ftus_ n'toit pas plus grand que la paume de la main; mais son pere l'ayant xamin en qualit de Mdecin, & ayant trouv que c'etoit qulque chose de plus qu'un Embryon, le fit transporter tout vivant Rapallo, ou il le fit voir Jerme Bardi & d'autres Mdecins du lieu. On trouva qu'il ne lui manquoit rien d'essentiel la vie; & son pere pour faire voir un essai de son experience, entreprit d'achever l'ouvrage de la Nature, & de travailler la formation de l'Enfant avec le mme artifice que celui dont on se sert pour faire cclorre les Poulets en Egypte. Il instruisit une Nourisse de tout ce qu'elle avoit faire, & ayant fait mettre son fils dans un pour proprement accommod, il reussit l'lever & lui faire prendre ses accroissemens necessaires, par l'uniformit d'une chaleur trangere mesure xactement sur les dgrs d'un Thermomtre, ou d'un autre instrument quivalent. (Vide Mich. Giustinian, ne gli Scritt. Liguri Cart. 223. 488.)\nOn auroit toujours t trs satisfait de l'industrie d'un pere si experiment dans l'Art de la Generation, quand il n'auroit p prolonger la vie son fils que pour quelques mois, ou pour peu d'annes.\nMais quand on se represente que l'Enfant a vecu prs de quatre-vingts ans, & qu'il a compos quatre-vingts Ouvrages differents tous fruits d'une longue lecture--il faut convenir que tout ce qui est incroyable n'est pas toujours faux, & que la _Vraisemblance n'est pas toujours du ct de la Verit_.\nIl n'avoit que dix neuf ans lorsqu'il composa Gonopsychanthropologia de Origine Anim human.\n(Les Enfans celebres, revs & corrigs par M. de la Monnoye de l'Academie Franoise.)]",
        "paragraph_chars": [
            [
                0,
                561
            ],
            [
                561,
                887
            ],
            [
                887,
                2319
            ],
            [
                2319,
                2495
            ],
            [
                2495,
                3439
            ],
            [
                3439,
                3633
            ],
            [
                3633,
                3928
            ],
            [
                3928,
                4020
            ],
            [
                4020,
                4103
            ]
        ],
        "segment_chars": [
            [
                0,
                88
            ],
            [
                88,
                561
            ],
            [
                561,
                783
            ],
            [
                783,
                833
            ],
            [
                833,
                887
            ],
            [
                887,
                1523
            ],
            [
                1523,
                1528
            ],
            [
                1528,
                1854
            ],
            [
                1854,
                2319
            ],
            [
                2319,
                2495
            ],
            [
                2495,
                2776
            ],
            [
                2776,
                3062
            ],
            [
                3062,
                3376
            ],
            [
                3376,
                3415
            ],
            [
                3415,
                3428
            ],
            [
                3428,
                3433
            ],
            [
                3433,
                3439
            ],
            [
                3439,
                3633
            ],
            [
                3633,
                3928
            ],
            [
                3928,
                4020
            ],
            [
                4020,
                4103
            ]
        ],
        "overlap_chars": [
            [
                0,
                88
            ],
            [
                88,
                122
            ],
            [
                126,
                245
            ],
            [
                123,
                125
            ],
            [
                253,
                269
            ],
            [
                276,
                316
            ],
            [
                392,
                424
            ],
            [
                428,
                445
            ],
            [
                447,
                453
            ],
            [
                459,
                468
            ],
            [
                534,
                561
            ],
            [
                636,
                644
            ],
            [
                584,
                588
            ],
            [
                596,
                605
            ],
            [
                619,
                630
            ],
            [
                650,
                675
            ],
            [
                680,
                684
            ],
            [
                687,
                694
            ],
            [
                708,
                753
            ],
            [
                833,
                857
            ],
            [
                863,
                865
            ],
            [
                866,
                887
            ],
            [
                887,
                1003
            ],
            [
                1050,
                1051
            ],
            [
                1015,
                1033
            ],
            [
                1063,
                1119
            ],
            [
                1121,
                1154
            ],
            [
                1162,
                1165
            ],
            [
                1179,
                1185
            ],
            [
                1198,
                1219
            ],
            [
                1268,
                1298
            ],
            [
                1310,
                1316
            ],
            [
                1228,
                1231
            ],
            [
                1350,
                1419
            ],
            [
                1521,
                1522
            ],
            [
                1525,
                1528
            ],
            [
                1528,
                1551
            ],
            [
                1601,
                1614
            ],
            [
                1616,
                1624
            ],
            [
                1638,
                1648
            ],
            [
                1663,
                1668
            ],
            [
                1705,
                1715
            ],
            [
                1717,
                1731
            ],
            [
                1734,
                1742
            ],
            [
                1744,
                1747
            ],
            [
                1749,
                1756
            ],
            [
                1627,
                1631
            ],
            [
                1764,
                1775
            ],
            [
                1777,
                1783
            ],
            [
                1790,
                1801
            ],
            [
                1816,
                1854
            ],
            [
                1856,
                1880
            ],
            [
                1883,
                1891
            ],
            [
                1893,
                1922
            ],
            [
                1985,
                1990
            ],
            [
                1948,
                1951
            ],
            [
                1996,
                2003
            ],
            [
                2172,
                2173
            ],
            [
                2018,
                2058
            ],
            [
                1936,
                1938
            ],
            [
                2086,
                2134
            ],
            [
                2140,
                2172
            ],
            [
                2174,
                2224
            ],
            [
                2230,
                2257
            ],
            [
                2259,
                2281
            ],
            [
                2282,
                2319
            ],
            [
                2319,
                2409
            ],
            [
                2493,
                2494
            ]
        ],
        "row_chars": [
            [
                0,
                88
            ],
            [
                88,
                561
            ],
            [
                561,
                783
            ],
            [
                783,
                833
            ],
            [
                833,
                887
            ],
            [
                887,
                1523
            ],
            [
                1523,
                1528
            ],
            [
                1528,
                1854
            ],
            [
                1854,
                2319
            ],
            [
                2319,
                2495
            ],
            [
                2495,
                2776
            ],
            [
                2776,
                3062
            ],
            [
                3062,
                3376
            ],
            [
                3376,
                3415
            ],
            [
                3415,
                3428
            ],
            [
                3428,
                3433
            ],
            [
                3433,
                3439
            ],
            [
                3439,
                3633
            ],
            [
                3633,
                3928
            ],
            [
                3928,
                4020
            ],
            [
                4020,
                4103
            ]
        ]
    },
    "abridged": {
        "text": "Is it not a shame to make two chapters of what passed in going down one pair of stairs? for we are got no farther yet than the first landing, and there are fifteen more steps down to the bottom; and for aught I know, as my father and my uncle Toby are in a talking mood, there may be as many chapters as steps.\n- A sudden impulse comes across me - drop the curtain, Shandy - I drop it - and hey for a new chapter.\nIf I had a rule to govern this affair - as I do all things out of rule, I would tear it to pieces, and throw it into the fire. Is a man to follow rules - or are rules to follow him?\nNow this, you must know, being my chapter upon chapters, which I promised to write before I went to sleep, I thought I should ease my conscience by telling the world all I knew about the matter at once. Is not this ten times better than setting out with a parade of wisdom, and saying that chapters relieve the mind - assist the reader - and that in a work of this dramatic cast they are as necessary as the scene-shifting?\nO! but to understand this, you must read Longinus - if you are no wiser after that, never fear, read him again - Avicenna and Licetus read Aristotle's metaphysics forty times, and never understood a single word. But mark the consequence - Avicenna turned out a desperate writer; and as for Licetus, though all the world knows he was born a foetus of only five inches and a half in length, yet he grew to such astonishing height in literature as to write a book with a title as long as himself - the learned know I mean his Gonopsychanthropologia, upon the origin of the human soul.\nSo much for my chapter upon chapters, which I hold to be the best chapter in my whole work.",
        "paragraph_chars": [
            [
                0,
                311
            ],
            [
                311,
                414
            ],
            [
                414,
                596
            ],
            [
                596,
                1020
            ],
            [
                1020,
                1602
            ],
            [
                1602,
                1693
            ]
        ],
        "segment_chars": [
            [
                0,
                88
            ],
            [
                88,
                311
            ],
            [
                311,
                414
            ],
            [
                414,
                541
            ],
            [
                541,
                596
            ],
            [
                596,
                799
            ],
            [
                799,
                1020
            ],
            [
                1020,
                1023
            ],
            [
                1023,
                1232
            ],
            [
                1232,
                1602
            ],
            [
                1602,
                1693
            ]
        ],
        "overlap_chars": [
            [
                0,
                88
            ],
            [
                88,
                122
            ],
            [
                123,
                242
            ],
            [
                243,
                245
            ],
            [
                248,
                264
            ],
            [
                269,
                309
            ],
            [
                313,
                345
            ],
            [
                348,
                365
            ],
            [
                366,
                372
            ],
            [
                375,
                384
            ],
            [
                387,
                414
            ],
            [
                414,
                422
            ],
            [
                425,
                429
            ],
            [
                430,
                439
            ],
            [
                440,
                451
            ],
            [
                454,
                479
            ],
            [
                480,
                484
            ],
            [
                486,
                493
            ],
            [
                494,
                539
            ],
            [
                541,
                565
            ],
            [
                568,
                570
            ],
            [
                575,
                596
            ],
            [
                596,
                712
            ],
            [
                713,
                714
            ],
            [
                722,
                740
            ],
            [
                741,
                797
            ],
            [
                799,
                832
            ],
            [
                841,
                844
            ],
            [
                845,
                851
            ],
            [
                852,
                873
            ],
            [
                881,
                911
            ],
            [
                914,
                920
            ],
            [
                921,
                924
            ],
            [
                934,
                1003
            ],
            [
                1018,
                1019
            ],
            [
                1020,
                1023
            ],
            [
                1023,
                1046
            ],
            [
                1047,
                1060
            ],
            [
                1061,
                1069
            ],
            [
                1072,
                1082
            ],
            [
                1086,
                1091
            ],
            [
                1104,
                1114
            ],
            [
                1116,
                1130
            ],
            [
                1133,
                1141
            ],
            [
                1142,
                1145
            ],
            [
                1146,
                1153
            ],
            [
                1154,
                1158
            ],
            [
                1159,
                1170
            ],
            [
                1171,
                1177
            ],
            [
                1183,
                1194
            ],
            [
                1194,
                1232
            ],
            [
                1232,
                1256
            ],
            [
                1259,
                1267
            ],
            [
                1268,
                1297
            ],
            [
                1297,
                1302
            ],
            [
                1306,
                1309
            ],
            [
                1310,
                1317
            ],
            [
                1317,
                1318
            ],
            [
                1319,
                1359
            ],
            [
                1367,
                1369
            ],
            [
                1375,
                1423
            ],
            [
                1429,
                1461
            ],
            [
                1462,
                1512
            ],
            [
                1515,
                1542
            ],
            [
                1543,
                1565
            ],
            [
                1565,
                1602
            ],
            [
                1602,
                1692
            ],
            [
                1692,
                1693
            ]
        ],
        "row_chars": [
            [
                0,
                88
            ],
            [
                88,
                414
            ],
            [
                414,
                541
            ],
            [
                541,
                541
            ],
            [
                541,
                596
            ],
            [
                596,
                1020
            ],
            [
                1020,
                1023
            ],
            [
                1023,
                1232
            ],
            [
                1232,
                1602
            ],
            [
                1602,
                1693
            ],
            [
                1693,
                1693
            ],
            [
                1693,
                1693
            ],
            [
                1693,
                1693
            ],
            [
                1693,
                1693
            ],
            [
                1693,
                1693
            ],
            [
                1693,
                1693
            ],
            [
                1693,
                1693
            ],
            [
                1693,
                1693
            ],
            [
                1693,
                1693
            ],
            [
                1693,
                1693
            ],
            [
                1693,
                1693
            ]
        ]
    }
}