{
    "original": {
        "text": "Holla! ----you, chairman! ----here's sixpence----do step into that bookseller's shop, and call me a _day-tall_ critick. I am very willing to give any one of 'em a crown to help me with his tackling, to get my father and my uncle _Toby_ off the stairs, and to put them to bed.\n--'Tis even high time; for except a short nap, which they both got whilst _Trim_ was boring the jack-boots--and which, by the bye, did my father no sort of good, upon the score of the bad hinge--they have not else shut their eyes, since nine hours before the time that Dr. _Slop_ was led into the back parlour in that dirty pickle by _Obadiah_.\nWas every day of my life to be as busy a day as this--and to take up --Truce.\nI will not finish that sentence till I have made an observation upon the strange state of affairs between the reader and myself, just as things stand at present--an observation never applicable before to any one biographical writer since the creation of the world, but to myself--and I believe, will never hold good to any other, until its final destruction--and therefore, for the very novelty of it alone, it must be worth your worships attending to.\nI am this month one whole year older than I was this time twelve-month; and having got, as you perceive, almost into the middle of my fourth volume[4.7]--and no farther than to my first day's life--'tis demonstrative that I have three hundred and sixty-four days more life to write just now, than when I first set out; so that instead of advancing, as a common writer, in my work with what I have been doing at it--on the contrary, I am just thrown so many volumes back--was every day of my life to be as busy a day as this --And why not? ----and the transactions and opinions of it to take up as much description --And for what reason should they be cut short? as at this rate I should just live 364 times faster than I should write --It must follow, an' please your worships, that the more I write, the more I shall have to write--and consequently, the more your worships read, the more your worships will have to read.\nWill this be good for your worships' eyes?\nIt will do well for mine; and, was it not that my OPINIONS will be the death of me, I perceive I shall lead a fine life of it out of this self-same life of mine; or, in other words, shall lead a couple of fine lives together.\nAs for the proposal of twelve volumes a year, or a volume a month, it no way alters my prospect--write as I will, and rush as I may into the middle of things, as _Horace_ advises --I shall never overtake myself whipp'd and driven to the last pinch; at the worst I shall have one day the start of my pen--and one day is enough for two volumes----and two volumes will be enough for one year.--\nHeaven prosper the manufacturers of paper under this propitious reign, which is now opened to us----as I trust its providence will prosper everything else in it that is taken in hand.----\nAs for the propagation of Geese --I give myself no concern --Nature is all bountiful --I shall never want tools to work with.\n--So then, friend! you have got my father and my uncle _Toby_ off the stairs, and seen them to bed? ------And how did you manage it? ----You dropp'd a curtain at the stair-foot --I thought you had no other way for it ------Here's a crown for your trouble.\n[Footnote 4.7: According to the original Editions.]",
        "paragraph_chars": [
            [
                0,
                276
            ],
            [
                276,
                621
            ],
            [
                621,
                699
            ],
            [
                699,
                1152
            ],
            [
                1152,
                2074
            ],
            [
                2074,
                2117
            ],
            [
                2117,
                2343
            ],
            [
                2343,
                2735
            ],
            [
                2735,
                2923
            ],
            [
                2923,
                3049
            ],
            [
                3049,
                3305
            ],
            [
                3305,
                3356
            ]
        ],
        "segment_chars": [
            [
                0,
                7
            ],
            [
                7,
                26
            ],
            [
                26,
                120
            ],
            [
                120,
                276
            ],
            [
                276,
                621
            ],
            [
                621,
                699
            ],
            [
                699,
                1152
            ],
            [
                1152,
                1691
            ],
            [
                1691,
                1814
            ],
            [
                1814,
                2074
            ],
            [
                2074,
                2117
            ],
            [
                2117,
                2343
            ],
            [
                2343,
                2735
            ],
            [
                2735,
                2923
            ],
            [
                2923,
                3049
            ],
            [
                3049,
                3068
            ],
            [
                3068,
                3149
            ],
            [
                3149,
                3182
            ],
            [
                3182,
                3305
            ],
            [
                3305,
                3356
            ]
        ],
        "overlap_chars": [
            [
                0,
                7
            ],
            [
                30,
                45
            ],
            [
                49,
                89
            ],
            [
                95,
                99
            ],
            [
                101,
                109
            ],
            [
                118,
                120
            ],
            [
                120,
                179
            ],
            [
                202,
                228
            ],
            [
                199,
                201
            ],
            [
                236,
                255
            ],
            [
                259,
                276
            ],
            [
                288,
                309
            ],
            [
                310,
                333
            ],
            [
                343,
                349
            ],
            [
                357,
                382
            ],
            [
                388,
                393
            ],
            [
                393,
                423
            ],
            [
                432,
                437
            ],
            [
                453,
                469
            ],
            [
                471,
                484
            ],
            [
                490,
                505
            ],
            [
                507,
                530
            ],
            [
                545,
                548
            ],
            [
                550,
                554
            ],
            [
                556,
                585
            ],
            [
                607,
                609
            ],
            [
                611,
                618
            ],
            [
                621,
                659
            ],
            [
                666,
                673
            ],
            [
                697,
                699
            ],
            [
                699,
                826
            ],
            [
                861,
                875
            ],
            [
                876,
                881
            ],
            [
                893,
                906
            ],
            [
                911,
                930
            ],
            [
                953,
                967
            ],
            [
                1058,
                1076
            ],
            [
                1035,
                1038
            ],
            [
                1086,
                1093
            ],
            [
                1100,
                1152
            ],
            [
                1152,
                1216
            ],
            [
                1222,
                1246
            ],
            [
                1255,
                1299
            ],
            [
                1306,
                1325
            ],
            [
                1329,
                1341
            ],
            [
                1729,
                1731
            ],
            [
                1344,
                1348
            ],
            [
                1216,
                1217
            ],
            [
                1374,
                1433
            ],
            [
                1439,
                1531
            ],
            [
                1567,
                1621
            ],
            [
                1301,
                1302
            ],
            [
                1627,
                1647
            ],
            [
                1623,
                1626
            ],
            [
                1654,
                1661
            ],
            [
                1668,
                1675
            ],
            [
                1695,
                1698
            ],
            [
                1720,
                1728
            ],
            [
                1735,
                1765
            ],
            [
                1678,
                1685
            ],
            [
                1788,
                1814
            ],
            [
                1817,
                1872
            ],
            [
                1880,
                1885
            ],
            [
                1888,
                1902
            ],
            [
                1930,
                1983
            ],
            [
                1985,
                2074
            ],
            [
                2148,
                2202
            ],
            [
                2214,
                2236
            ],
            [
                2243,
                2254
            ],
            [
                2265,
                2282
            ],
            [
                2299,
                2343
            ],
            [
                2343,
                2388
            ],
            [
                2410,
                2438
            ],
            [
                2461,
                2474
            ],
            [
                2408,
                2409
            ],
            [
                2524,
                2553
            ],
            [
                2590,
                2625
            ],
            [
                2630,
                2645
            ],
            [
                2647,
                2684
            ],
            [
                2688,
                2731
            ],
            [
                2735,
                2804
            ],
            [
                2917,
                2918
            ],
            [
                2923,
                2929
            ],
            [
                2949,
                2954
            ],
            [
                2957,
                2958
            ],
            [
                2971,
                2981
            ],
            [
                2984,
                2993
            ],
            [
                2998,
                3007
            ],
            [
                3010,
                3023
            ],
            [
                3029,
                3049
            ],
            [
                3051,
                3068
            ],
            [
                3068,
                3103
            ],
            [
                3111,
                3149
            ],
            [
                3159,
                3182
            ],
            [
                3186,
                3189
            ],
            [
                3198,
                3225
            ],
            [
                3272,
                3304
            ]
        ],
        "row_chars": [
            [
                0,
                7
            ],
            [
                7,
                26
            ],
            [
                26,
                120
            ],
            [
                120,
                276
            ],
            [
                276,
                621
            ],
            [
                621,
                699
            ],
            [
                699,
                1152
            ],
            [
                1152,
                1814
            ],
            [
                1814,
                2074
            ],
            [
                2074,
                2117
            ],
            [
                2117,
                2343
            ],
            [
                2343,
                2735
            ],
            [
                2735,
                2923
            ],
            [
                2923,
                3049
            ],
            [
                3049,
                3068
            ],
            [
                3068,
                3149
            ],
            [
                3149,
                3182
            ],
            [
                3182,
                3305
            ],
            [
                3305,
                3356
            ]
        ]
    },
    "abridged": {
        "text": "Holla! here's sixpence - do step into that bookseller's shop, and get me a day-tall critic. I am very willing to give any one of 'em a crown to help me get my father and my uncle Toby off the stairs, and put them to bed.\n'Tis high time; for except for a short nap, which they had whilst Trim was boring the jack-boots - which nap, by the bye, did my father no good, because of the bad hinge - they have not shut their eyes since nine hours before Dr. Slop was led into the back parlour by Obadiah.\nWas every day of my life to be as busy as this - Truce.\nI will not finish that sentence till I have made an observation upon the strange state of affairs between the reader and myself - an observation that never applied before to any biographical writer in the world, but me - and therefore, for its novelty alone, it must be worth your worships attending to.\nI am this month one whole year older than I was this time twelve months ago; and having got, as you see, almost into the middle of my fourth volume, and no farther than my first day of life - therefore I have three hundred and sixty-four days more life to write now, than when I first set out; so that instead of advancing, as a common writer, in my work - on the contrary, I am just thrown so many volumes back.\nIf every day of my life was as busy as this - and my opinions were to take up as much description - and why should they be cut short? - at this rate I should just live 364 times faster than I write. It must follow that the more I write, the more I shall have to write - and consequently, the more your worships read, the more your worships will have to read.\nWas it not that my Opinions will be the death of me, I shall lead a fine life out of this life of mine; or, rather shall lead a couple of fine lives together.\nAs for the proposal of twelve volumes a year, it no way alters my prospect - rush as I may, I shall never overtake myself; at the worst I shall have one day's head start of my pen - and one day is enough for two volumes - and two volumes will be enough for one year.\nHeaven prosper the manufacturers of paper under this propitious reign.\nAs for Geese and their quills - I have no concern. Nature is bountiful - I shall never lack tools to work with.\nSo then, friend! you have got my father and my uncle off the stairs, and seen them to bed? How did you manage it? You dropped a curtain at the stair-foot. - Here's a crown for your trouble.",
        "paragraph_chars": [
            [
                0,
                221
            ],
            [
                221,
                498
            ],
            [
                498,
                554
            ],
            [
                554,
                858
            ],
            [
                858,
                1271
            ],
            [
                1271,
                1630
            ],
            [
                1630,
                1789
            ],
            [
                1789,
                2056
            ],
            [
                2056,
                2127
            ],
            [
                2127,
                2239
            ],
            [
                2239,
                2428
            ]
        ],
        "segment_chars": [
            [
                0,
                7
            ],
            [
                7,
                92
            ],
            [
                92,
                221
            ],
            [
                221,
                498
            ],
            [
                498,
                554
            ],
            [
                554,
                858
            ],
            [
                858,
                1271
            ],
            [
                1271,
                1405
            ],
            [
                1405,
                1470
            ],
            [
                1470,
                1630
            ],
            [
                1630,
                1789
            ],
            [
                1789,
                2056
            ],
            [
                2056,
                2127
            ],
            [
                2127,
                2178
            ],
            [
                2178,
                2239
            ],
            [
                2239,
                2256
            ],
            [
                2256,
                2330
            ],
            [
                2330,
                2353
            ],
            [
                2353,
                2394
            ],
            [
                2394,
                2428
            ]
        ],
        "overlap_chars": [
            [
                0,
                7
            ],
            [
                7,
                22
            ],
            [
                25,
                65
            ],
            [
                70,
                74
            ],
            [
                75,
                83
            ],
            [
                90,
                92
            ],
            [
                92,
                151
            ],
            [
                152,
                178
            ],
            [
                179,
                181
            ],
            [
                184,
                203
            ],
            [
                204,
                221
            ],
            [
                226,
                247
            ],
            [
                252,
                275
            ],
            [
                280,
                286
            ],
            [
                292,
                317
            ],
            [
                320,
                325
            ],
            [
                329,
                359
            ],
            [
                360,
                365
            ],
            [
                374,
                390
            ],
            [
                393,
                406
            ],
            [
                407,
                422
            ],
            [
                423,
                446
            ],
            [
                447,
                450
            ],
            [
                451,
                455
            ],
            [
                456,
                485
            ],
            [
                486,
                488
            ],
            [
                489,
                496
            ],
            [
                498,
                536
            ],
            [
                537,
                544
            ],
            [
                552,
                554
            ],
            [
                554,
                681
            ],
            [
                684,
                698
            ],
            [
                704,
                709
            ],
            [
                718,
                731
            ],
            [
                732,
                751
            ],
            [
                755,
                769
            ],
            [
                775,
                793
            ],
            [
                794,
                797
            ],
            [
                798,
                805
            ],
            [
                806,
                858
            ],
            [
                858,
                922
            ],
            [
                933,
                957
            ],
            [
                961,
                1005
            ],
            [
                1007,
                1026
            ],
            [
                1027,
                1039
            ],
            [
                1040,
                1042
            ],
            [
                1043,
                1047
            ],
            [
                1048,
                1049
            ],
            [
                1060,
                1119
            ],
            [
                1120,
                1212
            ],
            [
                1215,
                1269
            ],
            [
                1269,
                1270
            ],
            [
                1274,
                1294
            ],
            [
                1295,
                1298
            ],
            [
                1299,
                1306
            ],
            [
                1307,
                1314
            ],
            [
                1317,
                1320
            ],
            [
                1324,
                1332
            ],
            [
                1338,
                1368
            ],
            [
                1371,
                1378
            ],
            [
                1379,
                1405
            ],
            [
                1407,
                1462
            ],
            [
                1463,
                1468
            ],
            [
                1470,
                1484
            ],
            [
                1485,
                1538
            ],
            [
                1541,
                1630
            ],
            [
                1630,
                1684
            ],
            [
                1685,
                1707
            ],
            [
                1708,
                1719
            ],
            [
                1720,
                1737
            ],
            [
                1745,
                1789
            ],
            [
                1789,
                1834
            ],
            [
                1835,
                1863
            ],
            [
                1866,
                1879
            ],
            [
                1879,
                1880
            ],
            [
                1881,
                1910
            ],
            [
                1910,
                1945
            ],
            [
                1953,
                1968
            ],
            [
                1971,
                2008
            ],
            [
                2011,
                2054
            ],
            [
                2056,
                2125
            ],
            [
                2125,
                2126
            ],
            [
                2127,
                2133
            ],
            [
                2134,
                2139
            ],
            [
                2159,
                2160
            ],
            [
                2166,
                2176
            ],
            [
                2178,
                2187
            ],
            [
                2188,
                2197
            ],
            [
                2200,
                2213
            ],
            [
                2219,
                2239
            ],
            [
                2239,
                2256
            ],
            [
                2256,
                2291
            ],
            [
                2292,
                2330
            ],
            [
                2330,
                2353
            ],
            [
                2353,
                2356
            ],
            [
                2365,
                2392
            ],
            [
                2396,
                2428
            ]
        ],
        "row_chars": [
            [
                0,
                7
            ],
            [
                7,
                7
            ],
            [
                7,
                92
            ],
            [
                92,
                221
            ],
            [
                221,
                498
            ],
            [
                498,
                554
            ],
            [
                554,
                858
            ],
            [
                858,
                1405
            ],
            [
                1405,
                1630
            ],
            [
                1630,
                1630
            ],
            [
                1630,
                1789
            ],
            [
                1789,
                2056
            ],
            [
                2056,
                2127
            ],
            [
                2127,
                2239
            ],
            [
                2239,
                2256
            ],
            [
                2256,
                2330
            ],
            [
                2330,
                2353
            ],
            [
                2353,
                2428
            ],
            [
                2428,
                2428
            ]
        ]
    }
}