{
    "original": {
        "text": "\"Well--I suppose we must.\" FRIENDS IN COUNCIL.\nMr. Thornton had had some difficulty in working up his mother to the desired point of civility. She did not often make calls; and when she did, it was in heavy state that she went through her duties. Her son had given her a carriage; but she refused to let him keep horses for it; they were hired for the solemn occasions, when she paid morning or evening visits. She had had horses for three days, not a fortnight before, and had comfortably \"killed off\" all her acquaintances, who might now put themselves to trouble and expense in their turn. Yet Crampton was too far off for her to walk; and she had repeatedly questioned her son as to whether his wish that she should call on the Hales was strong enough to bear the expense of cab-hire. She would have been thankful if it had not; for, as she said, \"she saw no use in making up friendships and intimacies with all the teachers and masters in Milton; why, he would be wanting her to call on Fanny's dancing-master's wife, the next thing!\"\n\"And so I would, mother, if Mr. Mason and his wife were friendless in a strange place, like the Hales.\"\n\"Oh! you need not speak so hastily. I am going to-morrow. I only wanted you exactly to understand about it.\"\n\"If you are going to-morrow, I shall order horses.\"\n\"Nonsense, John. One would think you were made of money.\"\n\"Not quite, yet. But about the horses I'm determined. The last time you were out in a cab, you came home with a headache from the jolting.\"\n\"I never complained of it, I'm sure.\"\n\"No! my mother is not given to complaints,\" said he, a little proudly. \"But so much the more I have to watch over you. Now, as for Fanny there, a little hardship would do her good.\"\n\"She is not made of the same stuff as you are, John. She could not bear it.\"\nMrs. Thornton was silent after this; for her last words bore relation to a subject which mortified her. She had an unconscious contempt for a weak character; and Fanny was weak in the very points in which her mother and brother were strong. Mrs. Thornton was not a woman much given to reasoning; her quick judgment and firm resolution served her in good stead of any long arguments and discussions with herself; she felt instinctively that nothing could strengthen Fanny to endure hardships patiently, or face difficulties bravely; and though she winced as she made this acknowledgment to herself about her daughter, it only gave her a kind of pitying tenderness of manner towards her; much of the same description of demeanour with which mothers are wont to treat their weak and sickly children. A stranger, a careless observer might have considered that Mrs. Thornton's manner to her children betokened far more love to Fanny than to John. But such a one would have been deeply mistaken. The very daringness with which mother and son spoke out unpalatable truths, the one to the other, showed a reliance on the firm centre of each other's souls, which the uneasy tenderness of Mrs. Thornton's manner to her daughter, the shame with which she thought to hide the poverty of her child in all the grand qualities which she herself possessed unconsciously, and which she set so high a value upon in others--this shame, I say, betrayed the want of a secure resting-place for her affection. She never called her son by any name but John; \"love,\" and \"dear,\" and such like terms, were reserved for Fanny. But her heart gave thanks for him day and night; and she walked proudly among women for his sake.\n\"Fanny dear! I shall have horses to the carriage to-day, to go and call on these Hales. Should not you go and see nurse? It's in the same direction, and she's always so glad to see you. You could go on there while I am at Mrs. Hale's.\"\n\"Oh! mamma, it's such a long way, and I am so tired.\"\n\"With what?\" asked Mrs. Thornton, her brow slightly contracting.\n\"I don't know--the weather, I think. It is so relaxing. Couldn't you bring nurse here, mamma? The carriage could fetch her, and she could spend the rest of the day here, which I know she would like.\"\nMrs. Thornton did not speak; but she laid her work on the table, and seemed to think.\n\"It will be a long way for her to walk back at night!\" she remarked, at last.\n\"Oh, but I will send her home in a cab. I never thought of her walking.\"\nAt this point, Mr. Thornton came in, just before going to the mill.\n\"Mother! I need hardly say, that if there is any little thing that could serve Mrs. Hale as an invalid, you will offer it, I'm sure.\"\n\"If I can find it out, I will. But I have never been ill myself, so I am not much up to invalids' fancies.\"\n\"Well! here is Fanny then, who is seldom without an ailment. She will be able to suggest something, perhaps--won't you, Fan?\"\n\"I have not always an ailment,\" said Fanny, pettishly; \"and I am not going with mamma. I have a headache to-day, and I shan't go out.\"\nMr. Thornton looked annoyed. His mother's eyes were bent on her work, at which she was now stitching away busily.\n\"Fanny! I wish you to go,\" said he, authoritatively. \"It will do you good, instead of harm. You will oblige me by going, without my saying anything more about it.\"\nHe went abruptly out of the room after saying this.\nIf he had stayed a minute longer, Fanny would have cried at his tone of command, even when he used the words, \"You will oblige me.\" As it was, she grumbled.\n\"John always speaks as if I fancied I was ill, and I am sure I never do fancy any such thing. Who are these Hales that he makes such a fuss about?\"\n\"Fanny, don't speak so of your brother. He has good reasons of some kind or other, or he would not wish us to go. Make haste and put your things on.\"\nBut the little altercation between her son and her daughter did not incline Mrs. Thornton more favourably towards \"these Hales.\" Her jealous heart repeated her daughter's question, \"Who are they, that he is so anxious we should pay them all this attention?\" It came up like a burden to a song, long after Fanny had forgotten all about it in the pleasant excitement of seeing the effect of a new bonnet in the looking-glass.\nMrs. Thornton was shy. It was only of late years that she had had leisure enough in her life to go into society; and as society she did not enjoy it. As dinner-giving, and as criticising other people's dinners, she took satisfaction in it. But this going to make acquaintance with strangers was a very different thing. She was ill at ease, and looked more than usually stern and forbidding as she entered the Hales' little drawing-room.\nMargaret was busy embroidering a small piece of cambric for some little article of dress for Edith's expected baby--\"Flimsy, useless work,\" as Mrs. Thornton observed to herself. She liked Mrs. Hale's double knitting far better; that was sensible of its kind. The room altogether was full of knick-knacks, which must take a long time to dust; and time to people of limited income was money.\nShe made all these reflections as she was talking in her stately way to Mrs. Hale, and uttering all the stereotyped commonplaces that most people can find to say with their senses blindfolded. Mrs. Hale was making rather more exertion in her answers, captivated by some real old lace which Mrs. Thornton wore; \"lace,\" as she afterwards observed to Dixon, \"of that old English point which has not been made for this seventy years, and which cannot be bought. It must have been an heir-loom, and shows that she had ancestors.\" So the owner of the ancestral lace became worthy of something more than the languid exertion to be agreeable to a visitor, by which Mrs. Hale's efforts at conversation would have been otherwise bounded. And presently, Margaret, racking her brain to talk to Fanny, heard her mother and Mrs. Thornton plunge into the interminable subject of servants.\n\"I suppose you are not musical,\" said Fanny, \"as I see no piano.\"\n\"I am fond of hearing good music; I cannot play well myself; and papa and mamma don't care much about it; so we sold our old piano when we came here.\"\n\"I wonder how you can exist without one. It almost seems to me a necessary of life.\"\n\"Fifteen shillings a week, and three saved out of them!\" thought Margaret to herself. \"But she must have been very young. She probably has forgotten her own personal experience. But she must know of those days.\" Margaret's manner had an extra tinge of coldness in it when she next spoke.\n\"You have good concerts here, I believe.\"\n\"Oh, yes! Delicious! Too crowded, that is the worst. The directors admit so indiscriminately. But one is sure to hear the newest music there. I always have a large order to give to Johnson's, the day after a concert.\"\n\"Do you like new music simply for its newness, then?\"\n\"Oh; one knows it is the fashion in London, or else the singers would not bring it down here. You have been in London, of course.\"\n\"Yes,\" said Margaret, \"I have lived there for several years.\"\n\"Oh! London and the Alhambra are the two places I long to see!\"\n\"London and the Alhambra!\"\n\"Yes! ever since I read the Tales of the Alhambra. Don't you know them?\"\n\"I don't think I do. But surely, it is a very easy journey to London.\"\n\"Yes; but somehow,\" said Fanny, lowering her voice, \"mamma has never been to London herself, and can't understand my longing. She is very proud of Milton; dirty, smoky place as I feel it to be. I believe she admires it the more for those very qualities.\"\n\"If it has been Mrs. Thornton's home for some years, I can well understand her loving it,\" said Margaret, in her clear, bell-like voice.\n\"What are you saying about me, Miss Hale? May I inquire?\"\nMargaret had not the words ready for an answer to this question, which took her a little by surprise, so Miss Thornton replied:\n\"Oh, mamma! we are only trying to account for your being so fond of Milton.\"\n\"Thank you,\" said Mrs. Thornton. \"I do not feel that my very natural liking for the place where I was born and brought up,--and which has since been my residence for some years, requires any accounting for.\"\nMargaret was vexed. As Fanny had put it, it did seem as if they had been impertinently discussing Mrs. Thornton's feelings; but she also rose up against that lady's manner of showing that she was offended.\nMrs. Thornton went on after a moment's pause:\n\"Do you know anything of Milton, Miss Hale? Have you seen any of our factories? our magnificent warehouses?\"\n\"No!\" said Margaret. \"I have not seen anything of that description as yet.\"\nThen she felt that, by concealing her utter indifference to all such places, she was hardly speaking with truth; so she went on:\n\"I dare say, papa would have taken me before now if I had cared. But I really do not find much pleasure in going over manufactories.\"\n\"They are very curious places,\" said Mrs. Hale, \"but there is so much noise and dirt always. I remember once going in a lilac silk to see candles made, and my gown was utterly ruined.\"\n\"Very probably,\" said Mrs. Thornton, in a short displeased manner. \"I merely thought, that as strangers newly come to reside in a town which has risen to eminence in the country, from the character and progress of its peculiar business, you might have cared to visit some of the places where it is carried on; places unique in the kingdom, I am informed. If Miss Hale changes her mind and condescends to be curious as to the manufactures of Milton, I can only say I shall be glad to procure her admission to print-works, or reed-making, or the more simple operations of spinning carried on in my son's mill. Every improvement of machinery is, I believe, to be seen there, in its highest perfection.\"\n\"I am so glad you don't like mills and manufactories, and all those kind of things,\" said Fanny, in a half-whisper, as she rose to accompany her mother, who was taking leave of Mrs. Hale with rustling dignity.\n\"I think I should like to know all about them, if I were you,\" replied Margaret quietly.\n\"Fanny!\" said her mother, as they drove away, \"we will be civil to these Hales: but don't form one of your hasty friendships with the daughter. She will do you no good, I see. The mother looks very ill, and seems a nice, quiet kind of person.\"\n\"I don't want to form any friendship with Miss Hale, mamma,\" said Fanny, pouting. \"I thought I was doing my duty by talking to her, and trying to amuse her.\"\n\"Well! at any rate John must be satisfied now.\"",
        "paragraph_chars": [
            [
                0,
                47
            ],
            [
                47,
                1040
            ],
            [
                1040,
                1144
            ],
            [
                1144,
                1253
            ],
            [
                1253,
                1305
            ],
            [
                1305,
                1363
            ],
            [
                1363,
                1503
            ],
            [
                1503,
                1541
            ],
            [
                1541,
                1723
            ],
            [
                1723,
                1800
            ],
            [
                1800,
                3498
            ],
            [
                3498,
                3734
            ],
            [
                3734,
                3788
            ],
            [
                3788,
                3853
            ],
            [
                3853,
                4053
            ],
            [
                4053,
                4139
            ],
            [
                4139,
                4217
            ],
            [
                4217,
                4290
            ],
            [
                4290,
                4358
            ],
            [
                4358,
                4492
            ],
            [
                4492,
                4600
            ],
            [
                4600,
                4726
            ],
            [
                4726,
                4861
            ],
            [
                4861,
                4975
            ],
            [
                4975,
                5139
            ],
            [
                5139,
                5191
            ],
            [
                5191,
                5348
            ],
            [
                5348,
                5496
            ],
            [
                5496,
                5646
            ],
            [
                5646,
                6070
            ],
            [
                6070,
                6507
            ],
            [
                6507,
                6897
            ],
            [
                6897,
                7771
            ],
            [
                7771,
                7837
            ],
            [
                7837,
                7988
            ],
            [
                7988,
                8073
            ],
            [
                8073,
                8361
            ],
            [
                8361,
                8403
            ],
            [
                8403,
                8621
            ],
            [
                8621,
                8675
            ],
            [
                8675,
                8806
            ],
            [
                8806,
                8868
            ],
            [
                8868,
                8932
            ],
            [
                8932,
                8959
            ],
            [
                8959,
                9032
            ],
            [
                9032,
                9103
            ],
            [
                9103,
                9358
            ],
            [
                9358,
                9495
            ],
            [
                9495,
                9553
            ],
            [
                9553,
                9681
            ],
            [
                9681,
                9758
            ],
            [
                9758,
                9966
            ],
            [
                9966,
                10172
            ],
            [
                10172,
                10218
            ],
            [
                10218,
                10327
            ],
            [
                10327,
                10403
            ],
            [
                10403,
                10532
            ],
            [
                10532,
                10666
            ],
            [
                10666,
                10851
            ],
            [
                10851,
                11551
            ],
            [
                11551,
                11761
            ],
            [
                11761,
                11850
            ],
            [
                11850,
                12094
            ],
            [
                12094,
                12252
            ],
            [
                12252,
                12299
            ]
        ],
        "segment_chars": [
            [
                0,
                27
            ],
            [
                27,
                47
            ],
            [
                47,
                143
            ],
            [
                143,
                247
            ],
            [
                247,
                411
            ],
            [
                411,
                593
            ],
            [
                593,
                789
            ],
            [
                789,
                1040
            ],
            [
                1040,
                1144
            ],
            [
                1144,
                1149
            ],
            [
                1149,
                1180
            ],
            [
                1180,
                1202
            ],
            [
                1202,
                1253
            ],
            [
                1253,
                1305
            ],
            [
                1305,
                1322
            ],
            [
                1322,
                1363
            ],
            [
                1363,
                1380
            ],
            [
                1380,
                1417
            ],
            [
                1417,
                1503
            ],
            [
                1503,
                1541
            ],
            [
                1541,
                1546
            ],
            [
                1546,
                1612
            ],
            [
                1612,
                1660
            ],
            [
                1660,
                1723
            ],
            [
                1723,
                1776
            ],
            [
                1776,
                1800
            ],
            [
                1800,
                1904
            ],
            [
                1904,
                2041
            ],
            [
                2041,
                2597
            ],
            [
                2597,
                2742
            ],
            [
                2742,
                2790
            ],
            [
                2790,
                3287
            ],
            [
                3287,
                3400
            ],
            [
                3400,
                3498
            ],
            [
                3498,
                3511
            ],
            [
                3511,
                3586
            ],
            [
                3586,
                3619
            ],
            [
                3619,
                3684
            ],
            [
                3684,
                3734
            ],
            [
                3734,
                3739
            ],
            [
                3739,
                3788
            ],
            [
                3788,
                3801
            ],
            [
                3801,
                3853
            ],
            [
                3853,
                3890
            ],
            [
                3890,
                3909
            ],
            [
                3909,
                3947
            ],
            [
                3947,
                4053
            ],
            [
                4053,
                4139
            ],
            [
                4139,
                4194
            ],
            [
                4194,
                4217
            ],
            [
                4217,
                4257
            ],
            [
                4257,
                4290
            ],
            [
                4290,
                4358
            ],
            [
                4358,
                4367
            ],
            [
                4367,
                4492
            ],
            [
                4492,
                4523
            ],
            [
                4523,
                4600
            ],
            [
                4600,
                4607
            ],
            [
                4607,
                4661
            ],
            [
                4661,
                4726
            ],
            [
                4726,
                4813
            ],
            [
                4813,
                4861
            ],
            [
                4861,
                4890
            ],
            [
                4890,
                4975
            ],
            [
                4975,
                4983
            ],
            [
                4983,
                5028
            ],
            [
                5028,
                5067
            ],
            [
                5067,
                5139
            ],
            [
                5139,
                5191
            ],
            [
                5191,
                5323
            ],
            [
                5323,
                5348
            ],
            [
                5348,
                5442
            ],
            [
                5442,
                5496
            ],
            [
                5496,
                5536
            ],
            [
                5536,
                5610
            ],
            [
                5610,
                5646
            ],
            [
                5646,
                5775
            ],
            [
                5775,
                5904
            ],
            [
                5904,
                6070
            ],
            [
                6070,
                6093
            ],
            [
                6093,
                6220
            ],
            [
                6220,
                6310
            ],
            [
                6310,
                6389
            ],
            [
                6389,
                6507
            ],
            [
                6507,
                6685
            ],
            [
                6685,
                6766
            ],
            [
                6766,
                6897
            ],
            [
                6897,
                7090
            ],
            [
                7090,
                7355
            ],
            [
                7355,
                7422
            ],
            [
                7422,
                7625
            ],
            [
                7625,
                7771
            ],
            [
                7771,
                7837
            ],
            [
                7837,
                7988
            ],
            [
                7988,
                8029
            ],
            [
                8029,
                8073
            ],
            [
                8073,
                8130
            ],
            [
                8130,
                8159
            ],
            [
                8159,
                8195
            ],
            [
                8195,
                8251
            ],
            [
                8251,
                8285
            ],
            [
                8285,
                8361
            ],
            [
                8361,
                8403
            ],
            [
                8403,
                8413
            ],
            [
                8413,
                8424
            ],
            [
                8424,
                8456
            ],
            [
                8456,
                8497
            ],
            [
                8497,
                8545
            ],
            [
                8545,
                8621
            ],
            [
                8621,
                8675
            ],
            [
                8675,
                8769
            ],
            [
                8769,
                8806
            ],
            [
                8806,
                8868
            ],
            [
                8868,
                8873
            ],
            [
                8873,
                8932
            ],
            [
                8932,
                8959
            ],
            [
                8959,
                8965
            ],
            [
                8965,
                9010
            ],
            [
                9010,
                9032
            ],
            [
                9032,
                9053
            ],
            [
                9053,
                9103
            ],
            [
                9103,
                9229
            ],
            [
                9229,
                9297
            ],
            [
                9297,
                9358
            ],
            [
                9358,
                9495
            ],
            [
                9495,
                9537
            ],
            [
                9537,
                9553
            ],
            [
                9553,
                9681
            ],
            [
                9681,
                9693
            ],
            [
                9693,
                9758
            ],
            [
                9758,
                9791
            ],
            [
                9791,
                9966
            ],
            [
                9966,
                9986
            ],
            [
                9986,
                10172
            ],
            [
                10172,
                10218
            ],
            [
                10218,
                10262
            ],
            [
                10262,
                10298
            ],
            [
                10298,
                10327
            ],
            [
                10327,
                10333
            ],
            [
                10333,
                10348
            ],
            [
                10348,
                10403
            ],
            [
                10403,
                10532
            ],
            [
                10532,
                10597
            ],
            [
                10597,
                10666
            ],
            [
                10666,
                10759
            ],
            [
                10759,
                10851
            ],
            [
                10851,
                10918
            ],
            [
                10918,
                11206
            ],
            [
                11206,
                11459
            ],
            [
                11459,
                11551
            ],
            [
                11551,
                11761
            ],
            [
                11761,
                11850
            ],
            [
                11850,
                11859
            ],
            [
                11859,
                11994
            ],
            [
                11994,
                12026
            ],
            [
                12026,
                12094
            ],
            [
                12094,
                12176
            ],
            [
                12176,
                12252
            ],
            [
                12252,
                12259
            ],
            [
                12259,
                12299
            ]
        ],
        "overlap_chars": [
            [
                47,
                86
            ],
            [
                98,
                111
            ],
            [
                141,
                143
            ],
            [
                143,
                197
            ],
            [
                245,
                247
            ],
            [
                247,
                279
            ],
            [
                368,
                369
            ],
            [
                281,
                299
            ],
            [
                308,
                319
            ],
            [
                326,
                347
            ],
            [
                352,
                368
            ],
            [
                409,
                411
            ],
            [
                601,
                637
            ],
            [
                639,
                646
            ],
            [
                673,
                680
            ],
            [
                687,
                694
            ],
            [
                728,
                731
            ],
            [
                738,
                741
            ],
            [
                764,
                789
            ],
            [
                838,
                850
            ],
            [
                852,
                876
            ],
            [
                880,
                891
            ],
            [
                907,
                928
            ],
            [
                941,
                950
            ],
            [
                1136,
                1141
            ],
            [
                1096,
                1126
            ],
            [
                1057,
                1063
            ],
            [
                1145,
                1149
            ],
            [
                1149,
                1180
            ],
            [
                1180,
                1190
            ],
            [
                1282,
                1302
            ],
            [
                1306,
                1322
            ],
            [
                1322,
                1360
            ],
            [
                1421,
                1500
            ],
            [
                1504,
                1538
            ],
            [
                1542,
                1544
            ],
            [
                1559,
                1582
            ],
            [
                1585,
                1612
            ],
            [
                1613,
                1616
            ],
            [
                1634,
                1660
            ],
            [
                1660,
                1663
            ],
            [
                1665,
                1720
            ],
            [
                1728,
                1774
            ],
            [
                1800,
                1813
            ],
            [
                1818,
                1824
            ],
            [
                1902,
                1904
            ],
            [
                1904,
                1961
            ],
            [
                1962,
                2040
            ],
            [
                2041,
                2145
            ],
            [
                2160,
                2181
            ],
            [
                2198,
                2300
            ],
            [
                2302,
                2304
            ],
            [
                2323,
                2330
            ],
            [
                2595,
                2596
            ],
            [
                2336,
                2360
            ],
            [
                2366,
                2370
            ],
            [
                2415,
                2419
            ],
            [
                2425,
                2462
            ],
            [
                2473,
                2480
            ],
            [
                2300,
                2301
            ],
            [
                2580,
                2586
            ],
            [
                2597,
                2607
            ],
            [
                2629,
                2669
            ],
            [
                2705,
                2742
            ],
            [
                2742,
                2745
            ],
            [
                2757,
                2762
            ],
            [
                2780,
                2790
            ],
            [
                2790,
                2864
            ],
            [
                2874,
                2876
            ],
            [
                2881,
                2946
            ],
            [
                2979,
                2994
            ],
            [
                2958,
                2975
            ],
            [
                3002,
                3017
            ],
            [
                3029,
                3033
            ],
            [
                3023,
                3028
            ],
            [
                3040,
                3059
            ],
            [
                3075,
                3084
            ],
            [
                3064,
                3071
            ],
            [
                3085,
                3139
            ],
            [
                2864,
                2865
            ],
            [
                3205,
                3215
            ],
            [
                3224,
                3287
            ],
            [
                3287,
                3333
            ],
            [
                3335,
                3339
            ],
            [
                3342,
                3345
            ],
            [
                3347,
                3351
            ],
            [
                3375,
                3400
            ],
            [
                3400,
                3456
            ],
            [
                3496,
                3498
            ],
            [
                3499,
                3504
            ],
            [
                3505,
                3509
            ],
            [
                3511,
                3518
            ],
            [
                3534,
                3546
            ],
            [
                3553,
                3586
            ],
            [
                3586,
                3619
            ],
            [
                3619,
                3684
            ],
            [
                3684,
                3731
            ],
            [
                3735,
                3739
            ],
            [
                3739,
                3785
            ],
            [
                3789,
                3798
            ],
            [
                3801,
                3830
            ],
            [
                3840,
                3853
            ],
            [
                3854,
                3866
            ],
            [
                3868,
                3890
            ],
            [
                3909,
                3947
            ],
            [
                3947,
                4000
            ],
            [
                4013,
                4050
            ],
            [
                4053,
                4066
            ],
            [
                4090,
                4139
            ],
            [
                4140,
                4191
            ],
            [
                4194,
                4217
            ],
            [
                4218,
                4221
            ],
            [
                4226,
                4255
            ],
            [
                4290,
                4326
            ],
            [
                4345,
                4357
            ],
            [
                4365,
                4367
            ],
            [
                4391,
                4430
            ],
            [
                4437,
                4446
            ],
            [
                4384,
                4385
            ],
            [
                4447,
                4489
            ],
            [
                4493,
                4501
            ],
            [
                4513,
                4523
            ],
            [
                4523,
                4597
            ],
            [
                4601,
                4607
            ],
            [
                4607,
                4620
            ],
            [
                4625,
                4661
            ],
            [
                4661,
                4698
            ],
            [
                4709,
                4723
            ],
            [
                4727,
                4755
            ],
            [
                4758,
                4780
            ],
            [
                4782,
                4813
            ],
            [
                4813,
                4830
            ],
            [
                4837,
                4858
            ],
            [
                4861,
                4890
            ],
            [
                4890,
                4924
            ],
            [
                4925,
                4929
            ],
            [
                4973,
                4975
            ],
            [
                4976,
                4983
            ],
            [
                4983,
                4999
            ],
            [
                5002,
                5028
            ],
            [
                5029,
                5048
            ],
            [
                5065,
                5067
            ],
            [
                5067,
                5136
            ],
            [
                5139,
                5171
            ],
            [
                5189,
                5191
            ],
            [
                5349,
                5393
            ],
            [
                5393,
                5394
            ],
            [
                5395,
                5416
            ],
            [
                5420,
                5442
            ],
            [
                5442,
                5493
            ],
            [
                5497,
                5536
            ],
            [
                5610,
                5643
            ],
            [
                5646,
                5672
            ],
            [
                5706,
                5713
            ],
            [
                5722,
                5735
            ],
            [
                5741,
                5751
            ],
            [
                5761,
                5772
            ],
            [
                5775,
                5826
            ],
            [
                5828,
                5846
            ],
            [
                5864,
                5901
            ],
            [
                6070,
                6093
            ],
            [
                6198,
                6215
            ],
            [
                6169,
                6181
            ],
            [
                6218,
                6220
            ],
            [
                6281,
                6305
            ],
            [
                6223,
                6241
            ],
            [
                6245,
                6279
            ],
            [
                6310,
                6313
            ],
            [
                6319,
                6327
            ],
            [
                6351,
                6389
            ],
            [
                6389,
                6507
            ],
            [
                6507,
                6545
            ],
            [
                6579,
                6621
            ],
            [
                6624,
                6644
            ],
            [
                6647,
                6685
            ],
            [
                6685,
                6766
            ],
            [
                6766,
                6774
            ],
            [
                6786,
                6847
            ],
            [
                6895,
                6896
            ],
            [
                6897,
                6905
            ],
            [
                6910,
                7000
            ],
            [
                7013,
                7046
            ],
            [
                7055,
                7058
            ],
            [
                7077,
                7089
            ],
            [
                7090,
                7110
            ],
            [
                7118,
                7122
            ],
            [
                7146,
                7166
            ],
            [
                7172,
                7205
            ],
            [
                7279,
                7284
            ],
            [
                7215,
                7251
            ],
            [
                7289,
                7306
            ],
            [
                7312,
                7330
            ],
            [
                7337,
                7355
            ],
            [
                7355,
                7375
            ],
            [
                7382,
                7385
            ],
            [
                7422,
                7473
            ],
            [
                7566,
                7589
            ],
            [
                7623,
                7625
            ],
            [
                7640,
                7771
            ],
            [
                7772,
                7801
            ],
            [
                7804,
                7815
            ],
            [
                7817,
                7834
            ],
            [
                7838,
                7870
            ],
            [
                7871,
                7896
            ],
            [
                7898,
                7901
            ],
            [
                7946,
                7985
            ],
            [
                7989,
                8029
            ],
            [
                8029,
                8070
            ],
            [
                8074,
                8127
            ],
            [
                8130,
                8146
            ],
            [
                8157,
                8159
            ],
            [
                8160,
                8195
            ],
            [
                8195,
                8198
            ],
            [
                8208,
                8211
            ],
            [
                8199,
                8207
            ],
            [
                8212,
                8221
            ],
            [
                8249,
                8251
            ],
            [
                8255,
                8271
            ],
            [
                8285,
                8333
            ],
            [
                8340,
                8348
            ],
            [
                8354,
                8361
            ],
            [
                8362,
                8400
            ],
            [
                8404,
                8413
            ],
            [
                8413,
                8424
            ],
            [
                8424,
                8456
            ],
            [
                8497,
                8537
            ],
            [
                8543,
                8545
            ],
            [
                8545,
                8618
            ],
            [
                8625,
                8672
            ],
            [
                8676,
                8717
            ],
            [
                8767,
                8769
            ],
            [
                8769,
                8803
            ],
            [
                8807,
                8810
            ],
            [
                8813,
                8826
            ],
            [
                8829,
                8830
            ],
            [
                8836,
                8865
            ],
            [
                8869,
                8873
            ],
            [
                8873,
                8929
            ],
            [
                8933,
                8956
            ],
            [
                8960,
                8965
            ],
            [
                8965,
                9010
            ],
            [
                9010,
                9029
            ],
            [
                9033,
                9053
            ],
            [
                9053,
                9100
            ],
            [
                9104,
                9120
            ],
            [
                9123,
                9154
            ],
            [
                9156,
                9186
            ],
            [
                9194,
                9229
            ],
            [
                9229,
                9256
            ],
            [
                9263,
                9264
            ],
            [
                9258,
                9263
            ],
            [
                9265,
                9270
            ],
            [
                9277,
                9279
            ],
            [
                9287,
                9289
            ],
            [
                9295,
                9297
            ],
            [
                9297,
                9321
            ],
            [
                9331,
                9355
            ],
            [
                9359,
                9416
            ],
            [
                9422,
                9446
            ],
            [
                9449,
                9476
            ],
            [
                9488,
                9495
            ],
            [
                9496,
                9537
            ],
            [
                9537,
                9550
            ],
            [
                9658,
                9680
            ],
            [
                9682,
                9693
            ],
            [
                9693,
                9755
            ],
            [
                9765,
                9768
            ],
            [
                9771,
                9791
            ],
            [
                9792,
                9879
            ],
            [
                9936,
                9963
            ],
            [
                9966,
                9986
            ],
            [
                9989,
                9994
            ],
            [
                10003,
                10005
            ],
            [
                10019,
                10102
            ],
            [
                10119,
                10137
            ],
            [
                10170,
                10172
            ],
            [
                10172,
                10193
            ],
            [
                10216,
                10217
            ],
            [
                10219,
                10262
            ],
            [
                10262,
                10298
            ],
            [
                10298,
                10324
            ],
            [
                10328,
                10330
            ],
            [
                10356,
                10359
            ],
            [
                10397,
                10400
            ],
            [
                10333,
                10347
            ],
            [
                10460,
                10462
            ],
            [
                10421,
                10422
            ],
            [
                10519,
                10531
            ],
            [
                10533,
                10597
            ],
            [
                10597,
                10649
            ],
            [
                10672,
                10695
            ],
            [
                10698,
                10713
            ],
            [
                10715,
                10757
            ],
            [
                10857,
                10865
            ],
            [
                10868,
                10898
            ],
            [
                10899,
                10918
            ],
            [
                10919,
                10954
            ],
            [
                10961,
                10980
            ],
            [
                10955,
                10960
            ],
            [
                10981,
                10985
            ],
            [
                11086,
                11142
            ],
            [
                11065,
                11068
            ],
            [
                11078,
                11086
            ],
            [
                11146,
                11189
            ],
            [
                11204,
                11206
            ],
            [
                11206,
                11265
            ],
            [
                11272,
                11299
            ],
            [
                11315,
                11394
            ],
            [
                11421,
                11459
            ],
            [
                11459,
                11521
            ],
            [
                11523,
                11548
            ],
            [
                11552,
                11589
            ],
            [
                11636,
                11761
            ],
            [
                11762,
                11821
            ],
            [
                11824,
                11850
            ],
            [
                11851,
                11856
            ],
            [
                11859,
                11895
            ],
            [
                11897,
                11994
            ],
            [
                11994,
                12017
            ],
            [
                12024,
                12026
            ],
            [
                12026,
                12036
            ],
            [
                12057,
                12091
            ],
            [
                12095,
                12152
            ],
            [
                12155,
                12176
            ],
            [
                12177,
                12224
            ],
            [
                12253,
                12259
            ],
            [
                12259,
                12270
            ],
            [
                12271,
                12297
            ]
        ],
        "row_chars": [
            [
                0,
                27
            ],
            [
                27,
                47
            ],
            [
                47,
                143
            ],
            [
                143,
                247
            ],
            [
                247,
                411
            ],
            [
                411,
                593
            ],
            [
                593,
                789
            ],
            [
                789,
                1040
            ],
            [
                1040,
                1144
            ],
            [
                1144,
                1149
            ],
            [
                1149,
                1180
            ],
            [
                1180,
                1202
            ],
            [
                1202,
                1253
            ],
            [
                1253,
                1305
            ],
            [
                1305,
                1322
            ],
            [
                1322,
                1363
            ],
            [
                1363,
                1380
            ],
            [
                1380,
                1417
            ],
            [
                1417,
                1503
            ],
            [
                1503,
                1541
            ],
            [
                1541,
                1546
            ],
            [
                1546,
                1612
            ],
            [
                1612,
                1660
            ],
            [
                1660,
                1723
            ],
            [
                1723,
                1776
            ],
            [
                1776,
                1800
            ],
            [
                1800,
                1904
            ],
            [
                1904,
                2041
            ],
            [
                2041,
                2597
            ],
            [
                2597,
                2742
            ],
            [
                2742,
                2790
            ],
            [
                2790,
                3287
            ],
            [
                3287,
                3400
            ],
            [
                3400,
                3498
            ],
            [
                3498,
                3586
            ],
            [
                3586,
                3619
            ],
            [
                3619,
                3684
            ],
            [
                3684,
                3734
            ],
            [
                3734,
                3739
            ],
            [
                3739,
                3788
            ],
            [
                3788,
                3801
            ],
            [
                3801,
                3853
            ],
            [
                3853,
                3890
            ],
            [
                3890,
                3909
            ],
            [
                3909,
                3947
            ],
            [
                3947,
                4053
            ],
            [
                4053,
                4139
            ],
            [
                4139,
                4194
            ],
            [
                4194,
                4217
            ],
            [
                4217,
                4257
            ],
            [
                4257,
                4290
            ],
            [
                4290,
                4358
            ],
            [
                4358,
                4367
            ],
            [
                4367,
                4492
            ],
            [
                4492,
                4523
            ],
            [
                4523,
                4600
            ],
            [
                4600,
                4607
            ],
            [
                4607,
                4661
            ],
            [
                4661,
                4726
            ],
            [
                4726,
                4813
            ],
            [
                4813,
                4861
            ],
            [
                4861,
                4890
            ],
            [
                4890,
                4975
            ],
            [
                4975,
                4983
            ],
            [
                4983,
                5028
            ],
            [
                5028,
                5067
            ],
            [
                5067,
                5139
            ],
            [
                5139,
                5191
            ],
            [
                5191,
                5323
            ],
            [
                5323,
                5348
            ],
            [
                5348,
                5442
            ],
            [
                5442,
                5496
            ],
            [
                5496,
                5536
            ],
            [
                5536,
                5610
            ],
            [
                5610,
                5646
            ],
            [
                5646,
                5775
            ],
            [
                5775,
                5904
            ],
            [
                5904,
                6070
            ],
            [
                6070,
                6093
            ],
            [
                6093,
                6220
            ],
            [
                6220,
                6389
            ],
            [
                6389,
                6507
            ],
            [
                6507,
                6685
            ],
            [
                6685,
                6766
            ],
            [
                6766,
                6897
            ],
            [
                6897,
                7090
            ],
            [
                7090,
                7355
            ],
            [
                7355,
                7422
            ],
            [
                7422,
                7625
            ],
            [
                7625,
                7771
            ],
            [
                7771,
                7837
            ],
            [
                7837,
                7988
            ],
            [
                7988,
                8029
            ],
            [
                8029,
                8073
            ],
            [
                8073,
                8130
            ],
            [
                8130,
                8159
            ],
            [
                8159,
                8195
            ],
            [
                8195,
                8251
            ],
            [
                8251,
                8285
            ],
            [
                8285,
                8361
            ],
            [
                8361,
                8403
            ],
            [
                8403,
                8413
            ],
            [
                8413,
                8424
            ],
            [
                8424,
                8456
            ],
            [
                8456,
                8497
            ],
            [
                8497,
                8545
            ],
            [
                8545,
                8621
            ],
            [
                8621,
                8675
            ],
            [
                8675,
                8769
            ],
            [
                8769,
                8806
            ],
            [
                8806,
                8868
            ],
            [
                8868,
                8873
            ],
            [
                8873,
                8932
            ],
            [
                8932,
                8959
            ],
            [
                8959,
                8965
            ],
            [
                8965,
                9010
            ],
            [
                9010,
                9032
            ],
            [
                9032,
                9053
            ],
            [
                9053,
                9103
            ],
            [
                9103,
                9229
            ],
            [
                9229,
                9297
            ],
            [
                9297,
                9358
            ],
            [
                9358,
                9495
            ],
            [
                9495,
                9537
            ],
            [
                9537,
                9553
            ],
            [
                9553,
                9693
            ],
            [
                9693,
                9758
            ],
            [
                9758,
                9791
            ],
            [
                9791,
                9966
            ],
            [
                9966,
                9986
            ],
            [
                9986,
                10172
            ],
            [
                10172,
                10262
            ],
            [
                10262,
                10298
            ],
            [
                10298,
                10327
            ],
            [
                10327,
                10333
            ],
            [
                10333,
                10403
            ],
            [
                10403,
                10597
            ],
            [
                10597,
                10666
            ],
            [
                10666,
                10759
            ],
            [
                10759,
                10851
            ],
            [
                10851,
                10918
            ],
            [
                10918,
                11206
            ],
            [
                11206,
                11459
            ],
            [
                11459,
                11551
            ],
            [
                11551,
                11761
            ],
            [
                11761,
                11850
            ],
            [
                11850,
                11859
            ],
            [
                11859,
                11994
            ],
            [
                11994,
                12026
            ],
            [
                12026,
                12094
            ],
            [
                12094,
                12176
            ],
            [
                12176,
                12252
            ],
            [
                12252,
                12259
            ],
            [
                12259,
                12299
            ]
        ]
    },
    "abridged": {
        "text": "Mr. Thornton had had some difficulty in persuading his mother to visit. She did not often make calls; and when she did, it was with reluctance. Her son had given her a carriage, but she refused to keep horses; they were hired for solemn occasions. Crampton was too far off for her to walk, and she asked her son whether the visit was worth the expense of cab-hire. As she said, 'she saw no use in making friendships with all the teachers in Milton.'\n'The Hales are friendless in a strange place, Mother.'\n'Oh! you need not speak so hastily. I am going tomorrow.'\n'Then I shall order horses.'\n'Nonsense, John. One would think you were made of money.'\n'The last time you were out in a cab, you came home with a headache from the jolting.'\n'I never complained of it, I'm sure.'\n'No. You are not given to complaints,' said he, a little proudly. 'But I have to watch over you. Now as for Fanny there, a little hardship would do her good.'\n'She is not made of the same stuff as you are, John.' Mrs. Thornton fell silent. She had an unconscious contempt for a weak character; and her daughter Fanny was weak in the very points in which her mother and brother were strong.\nMrs. Thornton was not a woman much given to reasoning; her quick judgment and firm resolution served her instead of any long arguments with herself; she felt instinctively that nothing could strengthen Fanny to endure hardships patiently or bravely. Though she winced as she acknowledged this, it gave her a kind of pitying tenderness towards Fanny, as if she were a sickly child.\nA stranger might have considered that Mrs. Thornton showed far more love to Fanny than to John. But this view would be mistaken. The very daringness with which mother and son spoke out unpalatable truths to each other, showed a reliance on the firm centre of each other's souls. Mrs. Thornton's uneasy tenderness to her daughter went side-by-side with shame; she thought to hide her child's poverty in all the grand qualities which she herself possessed, but this shame betrayed the want of a secure resting-place for her affection. She never called her son by any name but John; 'love' and 'dear' were reserved for Fanny. But her heart gave thanks for him day and night; and she was proud of him.\n'Fanny, dear, I shall take the carriage today, to go and call on these Hales. Should not you go and see nurse? It's in the same direction, and she's always so glad to see you. You could go on there while I am at Mrs. Hale's.'\n'Oh! mamma, it's such a long way, and I am so tired.'\n'With what?' asked Mrs. Thornton, her brow contracting.\n'I don't know - the weather, I think. Couldn't you bring nurse here, mamma? The carriage could fetch her, and she could spend the day here, which I know she would like.'\nMrs. Thornton laid her work on the table, and seemed to think.\n'It will be a long way for her to walk back at night!' she remarked, at last.\n'Oh, I will send her home in a cab.'\nAt this point, Mr. Thornton came in, on his way to the mill. 'Mother! If there is any little thing that could help Mrs. Hale, as an invalid, you will offer it, I'm sure.'\n'If I can, I will. But I have never been ill myself, so I am not much up to invalids' fancies.'\n'Well! here is Fanny, who is seldom without an ailment. She will be able to suggest something - won't you, Fan?'\n'I have not always an ailment,' said Fanny, pettishly; 'and I am not going with mamma. I have a headache today, and I shan't go out.'\nMr. Thornton looked annoyed. His mother's eyes were bent on her needlework.\n'Fanny! I wish you to go,' said he, authoritatively. 'It will do you good. You will oblige me by going, without my saying anything more about it.' He went abruptly out of the room.\n'John always speaks as if I fancied I was ill,' grumbled Fanny, 'and I am sure I never fancy any such thing. Who are these Hales that he makes such a fuss about?'\n'Fanny, don't speak so of your brother. Make haste and put your things on.'\nBut the little altercation did not make Mrs. Thornton think favourably of 'these Hales.' Her jealous heart repeated her daughter's question, 'Who are they, that we should pay them all this attention?'\nMrs. Thornton was shy. She did not enjoy going into society. She took satisfaction in dinner-giving, and criticising other people's dinners; but going to visit strangers was a very different thing. She was ill at ease, and looked more than usually stern and forbidding as she entered the Hales' little drawing-room.\nMargaret was busy embroidering a small article of dress for Edith's expected baby - 'Flimsy, useless work,' as Mrs. Thornton observed to herself. She liked Mrs. Hale's double knitting far better; that was sensible of its kind. The room was full of knick-knacks, which must take a long time to dust. She made these reflections as she was talking in her stately way to Mrs. Hale, and uttering all the commonplaces that most people can say blindfolded.\nMrs. Hale was making more effort to answer, captivated by some old lace which Mrs. Thornton wore, and which, as she afterwards observed to Dixon, 'had not been made for seventy years, and cannot be bought. It must have been an heirloom.' So the owner of the ancestral lace became worthy of greater efforts at conversation. Margaret, racking her brain to talk to Fanny, heard her mother and Mrs. Thornton plunge into the interminable subject of servants.\n'I suppose you are not musical,' said Fanny, 'as I see no piano.'\n'I am fond of hearing good music; but I cannot play well myself, and we sold our old piano when we came here.'\n'I wonder how you can exist without one. It almost seems to me a necessary of life.'\n'Fifteen shillings a week, and three saved out of them!' thought Margaret. 'But she must have been very young. She has probably forgotten those days. Yet she must know of them.' Margaret's manner had an extra tinge of coldness when she spoke.\n'You have good concerts here, I believe.'\n'Oh, yes! Delicious! Too crowded, that is the worst. But one is sure to hear the newest music. I always have a large order to give to Johnson's, the day after a concert.'\n'Do you like new music simply for its newness, then?'\n'Oh; one knows it is the fashion in London. You have been in London, of course.'\n'Yes,' said Margaret; 'I lived there for several years.'\n'Oh! London and the Alhambra are the two places I long to see!'\n'London and the Alhambra!'\n'Yes! ever since I read the Tales of the Alhambra. Don't you know them?'\n'I don't think I do. But surely, it is a very easy journey to London.'\n'Yes; but somehow,' said Fanny, lowering her voice, 'mamma has never been to London, and can't understand my longing. She is very proud of Milton, dirty and smoky as it is. I believe she admires it for those very qualities.'\n'If it has been Mrs. Thornton's home for some years, I can understand her loving it,' said Margaret, in her clear voice.\n'What are you saying about me, Miss Hale? May I inquire?'\nMiss Thornton replied: 'Oh, mamma! we are only trying to account for your being so fond of Milton.'\n'Thank you,' said Mrs. Thornton. 'I do not feel that my very natural liking for the place where I was born and brought up requires any accounting for.'\nMargaret was vexed. Fanny made it sound as if they had been impertinently discussing Mrs. Thornton's feelings; but she also resented that lady's manner.\nMrs. Thornton went on: 'Do you know anything of Milton, Miss Hale? Have you seen any of our factories? our magnificent warehouses?'\n'No! Not yet,' said Margaret. Trying to be honest, she went on: 'I dare say, papa would have taken me before now if I had cared. But I really do not find much pleasure in going over factories.'\n'They are very curious places,' said Mrs. Hale, 'but there is so much noise and dirt always.'\n'Very probably,' said Mrs. Thornton, in a short, displeased manner. 'I merely thought, that as strangers come to reside in a newly eminent town, you might have cared to visit some of the places where its business is carried on; places unique in the kingdom. If Miss Hale changes her mind and condescends to be curious about the manufactures of Milton, I shall be glad to procure her admission to print-works, or reed-making, or the spinning carried on in my son's mill. Every improvement of machinery is, I believe, to be seen there in its highest perfection.'\n'I am so glad you don't like mills and factories,' said Fanny, in a half-whisper, as she rose to accompany her mother, who was taking leave of Mrs. Hale with rustling dignity.\n'I think I should like to know all about them, if I were you,' replied Margaret quietly.\n'Fanny!' said her mother, as they drove away, 'we will be civil to these Hales: but don't form one of your hasty friendships with the daughter. She will do you no good. The mother seems a nice, quiet kind of person.'\n'I don't want to form any friendship with Miss Hale, mamma,' said Fanny, pouting. 'I thought I was doing my duty by talking to her.'\n'Well! at any rate, John must be satisfied now.'",
        "paragraph_chars": [
            [
                0,
                450
            ],
            [
                450,
                505
            ],
            [
                505,
                563
            ],
            [
                563,
                592
            ],
            [
                592,
                650
            ],
            [
                650,
                737
            ],
            [
                737,
                775
            ],
            [
                775,
                934
            ],
            [
                934,
                1165
            ],
            [
                1165,
                1546
            ],
            [
                1546,
                2244
            ],
            [
                2244,
                2470
            ],
            [
                2470,
                2524
            ],
            [
                2524,
                2580
            ],
            [
                2580,
                2750
            ],
            [
                2750,
                2813
            ],
            [
                2813,
                2891
            ],
            [
                2891,
                2928
            ],
            [
                2928,
                3099
            ],
            [
                3099,
                3195
            ],
            [
                3195,
                3308
            ],
            [
                3308,
                3442
            ],
            [
                3442,
                3518
            ],
            [
                3518,
                3699
            ],
            [
                3699,
                3862
            ],
            [
                3862,
                3938
            ],
            [
                3938,
                4139
            ],
            [
                4139,
                4455
            ],
            [
                4455,
                4905
            ],
            [
                4905,
                5359
            ],
            [
                5359,
                5425
            ],
            [
                5425,
                5536
            ],
            [
                5536,
                5621
            ],
            [
                5621,
                5864
            ],
            [
                5864,
                5906
            ],
            [
                5906,
                6077
            ],
            [
                6077,
                6131
            ],
            [
                6131,
                6212
            ],
            [
                6212,
                6269
            ],
            [
                6269,
                6333
            ],
            [
                6333,
                6360
            ],
            [
                6360,
                6433
            ],
            [
                6433,
                6504
            ],
            [
                6504,
                6729
            ],
            [
                6729,
                6850
            ],
            [
                6850,
                6908
            ],
            [
                6908,
                7008
            ],
            [
                7008,
                7160
            ],
            [
                7160,
                7313
            ],
            [
                7313,
                7445
            ],
            [
                7445,
                7639
            ],
            [
                7639,
                7733
            ],
            [
                7733,
                8294
            ],
            [
                8294,
                8470
            ],
            [
                8470,
                8559
            ],
            [
                8559,
                8776
            ],
            [
                8776,
                8909
            ],
            [
                8909,
                8957
            ]
        ],
        "segment_chars": [
            [
                0,
                72
            ],
            [
                72,
                144
            ],
            [
                144,
                248
            ],
            [
                248,
                365
            ],
            [
                365,
                450
            ],
            [
                450,
                505
            ],
            [
                505,
                510
            ],
            [
                510,
                541
            ],
            [
                541,
                563
            ],
            [
                563,
                592
            ],
            [
                592,
                609
            ],
            [
                609,
                650
            ],
            [
                650,
                737
            ],
            [
                737,
                775
            ],
            [
                775,
                780
            ],
            [
                780,
                841
            ],
            [
                841,
                872
            ],
            [
                872,
                934
            ],
            [
                934,
                988
            ],
            [
                988,
                1015
            ],
            [
                1015,
                1165
            ],
            [
                1165,
                1415
            ],
            [
                1415,
                1546
            ],
            [
                1546,
                1642
            ],
            [
                1642,
                1675
            ],
            [
                1675,
                1825
            ],
            [
                1825,
                2079
            ],
            [
                2079,
                2169
            ],
            [
                2169,
                2244
            ],
            [
                2244,
                2322
            ],
            [
                2322,
                2355
            ],
            [
                2355,
                2420
            ],
            [
                2420,
                2470
            ],
            [
                2470,
                2475
            ],
            [
                2475,
                2524
            ],
            [
                2524,
                2537
            ],
            [
                2537,
                2580
            ],
            [
                2580,
                2618
            ],
            [
                2618,
                2656
            ],
            [
                2656,
                2750
            ],
            [
                2750,
                2813
            ],
            [
                2813,
                2868
            ],
            [
                2868,
                2891
            ],
            [
                2891,
                2928
            ],
            [
                2928,
                2989
            ],
            [
                2989,
                2998
            ],
            [
                2998,
                3099
            ],
            [
                3099,
                3118
            ],
            [
                3118,
                3195
            ],
            [
                3195,
                3202
            ],
            [
                3202,
                3251
            ],
            [
                3251,
                3308
            ],
            [
                3308,
                3395
            ],
            [
                3395,
                3442
            ],
            [
                3442,
                3471
            ],
            [
                3471,
                3518
            ],
            [
                3518,
                3526
            ],
            [
                3526,
                3571
            ],
            [
                3571,
                3593
            ],
            [
                3593,
                3665
            ],
            [
                3665,
                3699
            ],
            [
                3699,
                3808
            ],
            [
                3808,
                3862
            ],
            [
                3862,
                3902
            ],
            [
                3902,
                3938
            ],
            [
                3938,
                4027
            ],
            [
                4027,
                4139
            ],
            [
                4139,
                4162
            ],
            [
                4162,
                4200
            ],
            [
                4200,
                4337
            ],
            [
                4337,
                4455
            ],
            [
                4455,
                4601
            ],
            [
                4601,
                4682
            ],
            [
                4682,
                4754
            ],
            [
                4754,
                4905
            ],
            [
                4905,
                5111
            ],
            [
                5111,
                5143
            ],
            [
                5143,
                5228
            ],
            [
                5228,
                5359
            ],
            [
                5359,
                5425
            ],
            [
                5425,
                5536
            ],
            [
                5536,
                5577
            ],
            [
                5577,
                5621
            ],
            [
                5621,
                5678
            ],
            [
                5678,
                5696
            ],
            [
                5696,
                5732
            ],
            [
                5732,
                5771
            ],
            [
                5771,
                5799
            ],
            [
                5799,
                5864
            ],
            [
                5864,
                5906
            ],
            [
                5906,
                5916
            ],
            [
                5916,
                5927
            ],
            [
                5927,
                5959
            ],
            [
                5959,
                6001
            ],
            [
                6001,
                6077
            ],
            [
                6077,
                6131
            ],
            [
                6131,
                6175
            ],
            [
                6175,
                6212
            ],
            [
                6212,
                6269
            ],
            [
                6269,
                6274
            ],
            [
                6274,
                6333
            ],
            [
                6333,
                6360
            ],
            [
                6360,
                6366
            ],
            [
                6366,
                6411
            ],
            [
                6411,
                6433
            ],
            [
                6433,
                6454
            ],
            [
                6454,
                6504
            ],
            [
                6504,
                6622
            ],
            [
                6622,
                6677
            ],
            [
                6677,
                6729
            ],
            [
                6729,
                6850
            ],
            [
                6850,
                6892
            ],
            [
                6892,
                6908
            ],
            [
                6908,
                6943
            ],
            [
                6943,
                7008
            ],
            [
                7008,
                7041
            ],
            [
                7041,
                7160
            ],
            [
                7160,
                7180
            ],
            [
                7180,
                7313
            ],
            [
                7313,
                7380
            ],
            [
                7380,
                7416
            ],
            [
                7416,
                7445
            ],
            [
                7445,
                7450
            ],
            [
                7450,
                7475
            ],
            [
                7475,
                7574
            ],
            [
                7574,
                7639
            ],
            [
                7639,
                7733
            ],
            [
                7733,
                7801
            ],
            [
                7801,
                7991
            ],
            [
                7991,
                8203
            ],
            [
                8203,
                8294
            ],
            [
                8294,
                8470
            ],
            [
                8470,
                8559
            ],
            [
                8559,
                8568
            ],
            [
                8568,
                8703
            ],
            [
                8703,
                8728
            ],
            [
                8728,
                8776
            ],
            [
                8776,
                8858
            ],
            [
                8858,
                8909
            ],
            [
                8909,
                8916
            ],
            [
                8916,
                8957
            ]
        ],
        "overlap_chars": [
            [
                0,
                39
            ],
            [
                51,
                64
            ],
            [
                70,
                72
            ],
            [
                72,
                126
            ],
            [
                142,
                144
            ],
            [
                144,
                176
            ],
            [
                176,
                177
            ],
            [
                178,
                196
            ],
            [
                197,
                208
            ],
            [
                208,
                229
            ],
            [
                230,
                246
            ],
            [
                246,
                248
            ],
            [
                252,
                288
            ],
            [
                290,
                297
            ],
            [
                304,
                311
            ],
            [
                312,
                319
            ],
            [
                320,
                323
            ],
            [
                330,
                333
            ],
            [
                340,
                365
            ],
            [
                365,
                377
            ],
            [
                379,
                403
            ],
            [
                404,
                415
            ],
            [
                416,
                437
            ],
            [
                438,
                447
            ],
            [
                455,
                460
            ],
            [
                465,
                495
            ],
            [
                496,
                502
            ],
            [
                506,
                510
            ],
            [
                510,
                541
            ],
            [
                541,
                551
            ],
            [
                569,
                589
            ],
            [
                593,
                609
            ],
            [
                609,
                647
            ],
            [
                655,
                734
            ],
            [
                738,
                772
            ],
            [
                776,
                778
            ],
            [
                788,
                811
            ],
            [
                814,
                841
            ],
            [
                842,
                845
            ],
            [
                846,
                872
            ],
            [
                872,
                875
            ],
            [
                876,
                931
            ],
            [
                939,
                985
            ],
            [
                988,
                1001
            ],
            [
                1007,
                1013
            ],
            [
                1013,
                1015
            ],
            [
                1015,
                1072
            ],
            [
                1086,
                1164
            ],
            [
                1165,
                1269
            ],
            [
                1278,
                1299
            ],
            [
                1300,
                1402
            ],
            [
                1403,
                1405
            ],
            [
                1406,
                1413
            ],
            [
                1413,
                1414
            ],
            [
                1415,
                1439
            ],
            [
                1453,
                1457
            ],
            [
                1457,
                1461
            ],
            [
                1462,
                1499
            ],
            [
                1500,
                1507
            ],
            [
                1513,
                1514
            ],
            [
                1532,
                1538
            ],
            [
                1546,
                1556
            ],
            [
                1557,
                1597
            ],
            [
                1605,
                1642
            ],
            [
                1642,
                1645
            ],
            [
                1656,
                1661
            ],
            [
                1665,
                1675
            ],
            [
                1675,
                1749
            ],
            [
                1750,
                1752
            ],
            [
                1758,
                1823
            ],
            [
                1825,
                1840
            ],
            [
                1841,
                1858
            ],
            [
                1859,
                1874
            ],
            [
                1893,
                1897
            ],
            [
                1898,
                1903
            ],
            [
                1905,
                1924
            ],
            [
                1925,
                1934
            ],
            [
                1937,
                1944
            ],
            [
                1945,
                1999
            ],
            [
                1999,
                2000
            ],
            [
                2005,
                2015
            ],
            [
                2016,
                2079
            ],
            [
                2079,
                2125
            ],
            [
                2127,
                2131
            ],
            [
                2133,
                2136
            ],
            [
                2138,
                2142
            ],
            [
                2144,
                2169
            ],
            [
                2169,
                2225
            ],
            [
                2242,
                2244
            ],
            [
                2245,
                2250
            ],
            [
                2252,
                2256
            ],
            [
                2258,
                2265
            ],
            [
                2271,
                2283
            ],
            [
                2289,
                2322
            ],
            [
                2322,
                2355
            ],
            [
                2355,
                2420
            ],
            [
                2420,
                2467
            ],
            [
                2471,
                2475
            ],
            [
                2475,
                2521
            ],
            [
                2525,
                2534
            ],
            [
                2537,
                2566
            ],
            [
                2567,
                2580
            ],
            [
                2581,
                2593
            ],
            [
                2596,
                2618
            ],
            [
                2618,
                2656
            ],
            [
                2656,
                2709
            ],
            [
                2710,
                2747
            ],
            [
                2750,
                2763
            ],
            [
                2764,
                2813
            ],
            [
                2814,
                2865
            ],
            [
                2868,
                2891
            ],
            [
                2892,
                2895
            ],
            [
                2896,
                2925
            ],
            [
                2928,
                2964
            ],
            [
                2976,
                2988
            ],
            [
                2996,
                2998
            ],
            [
                2998,
                3037
            ],
            [
                3043,
                3052
            ],
            [
                3052,
                3053
            ],
            [
                3054,
                3096
            ],
            [
                3100,
                3108
            ],
            [
                3108,
                3118
            ],
            [
                3118,
                3192
            ],
            [
                3196,
                3202
            ],
            [
                3202,
                3215
            ],
            [
                3215,
                3251
            ],
            [
                3251,
                3288
            ],
            [
                3291,
                3305
            ],
            [
                3309,
                3337
            ],
            [
                3340,
                3362
            ],
            [
                3364,
                3395
            ],
            [
                3395,
                3412
            ],
            [
                3418,
                3439
            ],
            [
                3442,
                3471
            ],
            [
                3471,
                3505
            ],
            [
                3512,
                3516
            ],
            [
                3516,
                3518
            ],
            [
                3519,
                3526
            ],
            [
                3526,
                3542
            ],
            [
                3545,
                3571
            ],
            [
                3572,
                3591
            ],
            [
                3591,
                3593
            ],
            [
                3593,
                3662
            ],
            [
                3665,
                3697
            ],
            [
                3697,
                3699
            ],
            [
                3700,
                3744
            ],
            [
                3761,
                3762
            ],
            [
                3764,
                3785
            ],
            [
                3786,
                3808
            ],
            [
                3808,
                3859
            ],
            [
                3863,
                3902
            ],
            [
                3902,
                3935
            ],
            [
                3938,
                3964
            ],
            [
                3965,
                3972
            ],
            [
                3978,
                3991
            ],
            [
                3998,
                4008
            ],
            [
                4013,
                4024
            ],
            [
                4027,
                4078
            ],
            [
                4080,
                4098
            ],
            [
                4099,
                4136
            ],
            [
                4139,
                4162
            ],
            [
                4162,
                4179
            ],
            [
                4186,
                4198
            ],
            [
                4198,
                4200
            ],
            [
                4200,
                4224
            ],
            [
                4225,
                4243
            ],
            [
                4244,
                4278
            ],
            [
                4280,
                4283
            ],
            [
                4284,
                4292
            ],
            [
                4299,
                4337
            ],
            [
                4337,
                4455
            ],
            [
                4455,
                4493
            ],
            [
                4494,
                4536
            ],
            [
                4540,
                4560
            ],
            [
                4563,
                4601
            ],
            [
                4601,
                4682
            ],
            [
                4682,
                4690
            ],
            [
                4691,
                4752
            ],
            [
                4752,
                4753
            ],
            [
                4754,
                4762
            ],
            [
                4763,
                4853
            ],
            [
                4854,
                4887
            ],
            [
                4888,
                4891
            ],
            [
                4892,
                4904
            ],
            [
                4905,
                4925
            ],
            [
                4926,
                4930
            ],
            [
                4947,
                4967
            ],
            [
                4968,
                5001
            ],
            [
                5007,
                5012
            ],
            [
                5014,
                5050
            ],
            [
                5056,
                5073
            ],
            [
                5074,
                5092
            ],
            [
                5093,
                5111
            ],
            [
                5111,
                5131
            ],
            [
                5137,
                5140
            ],
            [
                5143,
                5194
            ],
            [
                5203,
                5226
            ],
            [
                5226,
                5228
            ],
            [
                5228,
                5359
            ],
            [
                5360,
                5389
            ],
            [
                5392,
                5403
            ],
            [
                5405,
                5422
            ],
            [
                5426,
                5458
            ],
            [
                5463,
                5488
            ],
            [
                5490,
                5493
            ],
            [
                5494,
                5533
            ],
            [
                5537,
                5577
            ],
            [
                5577,
                5618
            ],
            [
                5622,
                5675
            ],
            [
                5678,
                5694
            ],
            [
                5694,
                5696
            ],
            [
                5697,
                5732
            ],
            [
                5732,
                5735
            ],
            [
                5736,
                5739
            ],
            [
                5740,
                5748
            ],
            [
                5749,
                5758
            ],
            [
                5769,
                5771
            ],
            [
                5775,
                5791
            ],
            [
                5799,
                5847
            ],
            [
                5848,
                5856
            ],
            [
                5857,
                5864
            ],
            [
                5865,
                5903
            ],
            [
                5907,
                5916
            ],
            [
                5916,
                5927
            ],
            [
                5927,
                5959
            ],
            [
                5959,
                5999
            ],
            [
                5999,
                6001
            ],
            [
                6001,
                6074
            ],
            [
                6081,
                6128
            ],
            [
                6132,
                6173
            ],
            [
                6173,
                6175
            ],
            [
                6175,
                6209
            ],
            [
                6213,
                6216
            ],
            [
                6219,
                6232
            ],
            [
                6235,
                6236
            ],
            [
                6237,
                6266
            ],
            [
                6270,
                6274
            ],
            [
                6274,
                6330
            ],
            [
                6334,
                6357
            ],
            [
                6361,
                6366
            ],
            [
                6366,
                6411
            ],
            [
                6411,
                6430
            ],
            [
                6434,
                6454
            ],
            [
                6454,
                6501
            ],
            [
                6505,
                6521
            ],
            [
                6524,
                6555
            ],
            [
                6557,
                6587
            ],
            [
                6587,
                6622
            ],
            [
                6622,
                6649
            ],
            [
                6649,
                6650
            ],
            [
                6651,
                6656
            ],
            [
                6661,
                6666
            ],
            [
                6667,
                6669
            ],
            [
                6670,
                6672
            ],
            [
                6675,
                6677
            ],
            [
                6677,
                6701
            ],
            [
                6702,
                6726
            ],
            [
                6730,
                6787
            ],
            [
                6788,
                6812
            ],
            [
                6815,
                6842
            ],
            [
                6843,
                6850
            ],
            [
                6851,
                6892
            ],
            [
                6892,
                6905
            ],
            [
                6908,
                6930
            ],
            [
                6932,
                6943
            ],
            [
                6943,
                7005
            ],
            [
                7015,
                7018
            ],
            [
                7021,
                7041
            ],
            [
                7042,
                7129
            ],
            [
                7130,
                7157
            ],
            [
                7160,
                7180
            ],
            [
                7180,
                7185
            ],
            [
                7191,
                7193
            ],
            [
                7200,
                7283
            ],
            [
                7293,
                7311
            ],
            [
                7311,
                7313
            ],
            [
                7313,
                7334
            ],
            [
                7334,
                7335
            ],
            [
                7337,
                7380
            ],
            [
                7380,
                7416
            ],
            [
                7416,
                7442
            ],
            [
                7446,
                7448
            ],
            [
                7450,
                7453
            ],
            [
                7454,
                7457
            ],
            [
                7460,
                7474
            ],
            [
                7482,
                7484
            ],
            [
                7494,
                7495
            ],
            [
                7496,
                7508
            ],
            [
                7510,
                7574
            ],
            [
                7574,
                7626
            ],
            [
                7645,
                7668
            ],
            [
                7671,
                7686
            ],
            [
                7688,
                7730
            ],
            [
                7739,
                7747
            ],
            [
                7750,
                7780
            ],
            [
                7782,
                7801
            ],
            [
                7802,
                7837
            ],
            [
                7838,
                7857
            ],
            [
                7858,
                7863
            ],
            [
                7872,
                7876
            ],
            [
                7876,
                7932
            ],
            [
                7933,
                7936
            ],
            [
                7937,
                7945
            ],
            [
                7946,
                7989
            ],
            [
                7989,
                7991
            ],
            [
                7991,
                8050
            ],
            [
                8057,
                8084
            ],
            [
                8085,
                8164
            ],
            [
                8165,
                8203
            ],
            [
                8203,
                8265
            ],
            [
                8266,
                8291
            ],
            [
                8295,
                8332
            ],
            [
                8345,
                8470
            ],
            [
                8471,
                8530
            ],
            [
                8533,
                8559
            ],
            [
                8560,
                8565
            ],
            [
                8568,
                8604
            ],
            [
                8606,
                8703
            ],
            [
                8703,
                8726
            ],
            [
                8726,
                8728
            ],
            [
                8728,
                8738
            ],
            [
                8739,
                8773
            ],
            [
                8777,
                8834
            ],
            [
                8837,
                8858
            ],
            [
                8859,
                8906
            ],
            [
                8910,
                8916
            ],
            [
                8916,
                8927
            ],
            [
                8929,
                8955
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                72
            ],
            [
                72,
                144
            ],
            [
                144,
                248
            ],
            [
                248,
                248
            ],
            [
                248,
                365
            ],
            [
                365,
                450
            ],
            [
                450,
                505
            ],
            [
                505,
                510
            ],
            [
                510,
                541
            ],
            [
                541,
                563
            ],
            [
                563,
                563
            ],
            [
                563,
                592
            ],
            [
                592,
                609
            ],
            [
                609,
                650
            ],
            [
                650,
                650
            ],
            [
                650,
                650
            ],
            [
                650,
                737
            ],
            [
                737,
                775
            ],
            [
                775,
                780
            ],
            [
                780,
                841
            ],
            [
                841,
                872
            ],
            [
                872,
                934
            ],
            [
                934,
                988
            ],
            [
                988,
                988
            ],
            [
                988,
                1015
            ],
            [
                1015,
                1165
            ],
            [
                1165,
                1546
            ],
            [
                1546,
                1642
            ],
            [
                1642,
                1675
            ],
            [
                1675,
                2079
            ],
            [
                2079,
                2169
            ],
            [
                2169,
                2244
            ],
            [
                2244,
                2322
            ],
            [
                2322,
                2355
            ],
            [
                2355,
                2420
            ],
            [
                2420,
                2470
            ],
            [
                2470,
                2475
            ],
            [
                2475,
                2524
            ],
            [
                2524,
                2537
            ],
            [
                2537,
                2580
            ],
            [
                2580,
                2618
            ],
            [
                2618,
                2618
            ],
            [
                2618,
                2656
            ],
            [
                2656,
                2750
            ],
            [
                2750,
                2813
            ],
            [
                2813,
                2868
            ],
            [
                2868,
                2891
            ],
            [
                2891,
                2928
            ],
            [
                2928,
                2928
            ],
            [
                2928,
                2989
            ],
            [
                2989,
                2998
            ],
            [
                2998,
                3099
            ],
            [
                3099,
                3118
            ],
            [
                3118,
                3195
            ],
            [
                3195,
                3202
            ],
            [
                3202,
                3251
            ],
            [
                3251,
                3308
            ],
            [
                3308,
                3395
            ],
            [
                3395,
                3442
            ],
            [
                3442,
                3471
            ],
            [
                3471,
                3518
            ],
            [
                3518,
                3526
            ],
            [
                3526,
                3571
            ],
            [
                3571,
                3593
            ],
            [
                3593,
                3665
            ],
            [
                3665,
                3699
            ],
            [
                3699,
                3699
            ],
            [
                3699,
                3699
            ],
            [
                3699,
                3808
            ],
            [
                3808,
                3862
            ],
            [
                3862,
                3902
            ],
            [
                3902,
                3902
            ],
            [
                3902,
                3938
            ],
            [
                3938,
                4027
            ],
            [
                4027,
                4139
            ],
            [
                4139,
                4139
            ],
            [
                4139,
                4162
            ],
            [
                4162,
                4200
            ],
            [
                4200,
                4337
            ],
            [
                4337,
                4455
            ],
            [
                4455,
                4601
            ],
            [
                4601,
                4682
            ],
            [
                4682,
                4754
            ],
            [
                4754,
                4905
            ],
            [
                4905,
                5111
            ],
            [
                5111,
                5143
            ],
            [
                5143,
                5228
            ],
            [
                5228,
                5359
            ],
            [
                5359,
                5425
            ],
            [
                5425,
                5536
            ],
            [
                5536,
                5577
            ],
            [
                5577,
                5621
            ],
            [
                5621,
                5678
            ],
            [
                5678,
                5696
            ],
            [
                5696,
                5732
            ],
            [
                5732,
                5771
            ],
            [
                5771,
                5799
            ],
            [
                5799,
                5864
            ],
            [
                5864,
                5906
            ],
            [
                5906,
                5916
            ],
            [
                5916,
                5927
            ],
            [
                5927,
                5959
            ],
            [
                5959,
                5959
            ],
            [
                5959,
                6001
            ],
            [
                6001,
                6077
            ],
            [
                6077,
                6131
            ],
            [
                6131,
                6175
            ],
            [
                6175,
                6212
            ],
            [
                6212,
                6269
            ],
            [
                6269,
                6274
            ],
            [
                6274,
                6333
            ],
            [
                6333,
                6360
            ],
            [
                6360,
                6366
            ],
            [
                6366,
                6411
            ],
            [
                6411,
                6433
            ],
            [
                6433,
                6454
            ],
            [
                6454,
                6504
            ],
            [
                6504,
                6622
            ],
            [
                6622,
                6677
            ],
            [
                6677,
                6729
            ],
            [
                6729,
                6850
            ],
            [
                6850,
                6892
            ],
            [
                6892,
                6908
            ],
            [
                6908,
                6943
            ],
            [
                6943,
                7008
            ],
            [
                7008,
                7041
            ],
            [
                7041,
                7160
            ],
            [
                7160,
                7180
            ],
            [
                7180,
                7313
            ],
            [
                7313,
                7380
            ],
            [
                7380,
                7416
            ],
            [
                7416,
                7445
            ],
            [
                7445,
                7450
            ],
            [
                7450,
                7475
            ],
            [
                7475,
                7574
            ],
            [
                7574,
                7639
            ],
            [
                7639,
                7733
            ],
            [
                7733,
                7733
            ],
            [
                7733,
                7801
            ],
            [
                7801,
                7991
            ],
            [
                7991,
                8203
            ],
            [
                8203,
                8294
            ],
            [
                8294,
                8470
            ],
            [
                8470,
                8559
            ],
            [
                8559,
                8568
            ],
            [
                8568,
                8703
            ],
            [
                8703,
                8728
            ],
            [
                8728,
                8776
            ],
            [
                8776,
                8858
            ],
            [
                8858,
                8909
            ],
            [
                8909,
                8916
            ],
            [
                8916,
                8957
            ]
        ]
    }
}