{
    "original": {
        "text": "\"I was used To sleep at nights as sweetly as a child,-- Now if the wind blew rough, it made me start, And think of my poor boy tossing about Upon the roaring seas. And then I seemed To feel that it was hard to take him from me For such a little fault.\" SOUTHEY.\nIt was a comfort to Margaret about this time, to find that her mother drew more tenderly and intimately towards her than she had ever done since the days of her childhood. She took her to her heart as a confidential friend--the post Margaret had always longed to fill, and had envied Dixon for being preferred to. Margaret took pains to respond to every call made upon her for sympathy--and they were many--even when they bore relation to trifles which she would no more have noticed or regarded herself than the elephant would perceive the little pin at his feet, which yet he lifts carefully up at the bidding of his keeper. All unconsciously Margaret drew near to a reward.\nOne evening, Mr. Hale being absent, her mother began to talk to her about her brother Frederick, the very subject on which Margaret had longed to ask questions, and almost the only one on which her timidity overcame her natural openness. The more she wanted to hear about him, the less likely she was to speak.\n\"Oh, Margaret, it was so windy last night! It came howling down the chimney in our room! I could not sleep. I never can when there is such a terrible wind. I got into a wakeful habit when poor Frederick was at sea; and now, even if I don't waken all at once, I dream of him in some stormy sea, with great, clear, glass-green walls of waves on either side his ship, but far higher than her very masts, curling over her with that cruel, terrible white foam, like some gigantic crested serpent. It is an old dream, but it always comes back on windy nights, till I am thankful to waken, sitting straight and stiff up in bed with my terror. Poor Frederick! He is on land now, so wind can do him no harm. Though I did think it might shake down some of those tall chimneys.\"\n\"Where is Frederick now, mamma? Our letters are directed to the care of Messrs. Barbour, at Cadiz. I know: but where is he himself?\"\n\"I can't remember the name of the place, but he is not called Hale; you must remember that, Margaret. Notice the F. D. in every corner of the letters. He has taken the name of Dickenson. I wanted him to have been called Beresford, to which he had a kind of right, but your father thought he had better not. He might be recognised, you know, if he were called by my name.\"\n\"Mamma,\" said Margaret, \"I was at Aunt Shaw's when it all happened; and I suppose I was not old enough to be told plainly about it. But I should like to know now, if I may--if it does not give you too much pain to speak about it.\"\n\"Pain! No,\" replied Mrs. Hale, her cheek flushing. \"Yet it is pain to think that perhaps I may never see my darling boy again. Or else he did right, Margaret. They may say what they like, but I have his own letters to show, and I'll believe him, though he is my son, sooner than any court-martial on earth. Go to my little japan cabinet, dear, and in the second left-hand drawer you will find a packet of letters.\"\nMargaret went. There were the yellow, sea-stained letters, with the peculiar fragrance which ocean letters have. Margaret carried them back to her mother, who untied the silken string with trembling fingers, and, examining their dates, she gave them to Margaret to read, making her hurried, anxious remarks on their contents, almost before her daughter could have understood what they were.\n\"You see, Margaret, how from the very first he disliked Captain Reid. He was second lieutenant in the ship--the Orion--in which Frederick sailed the very first time. Poor little fellow, how well he looked in his midshipman's dress, with his dirk in his hand, cutting open all the newspapers with it as if it were a paper-knife! But this Mr. Reid, as he was then, seemed to take a dislike to Frederick from the very beginning. And then--stay! these are the letters he wrote on board the Russell. When he was appointed to her, and found his old enemy Captain Reid in command, he did mean to bear all his tyranny patiently. Look! this is the letter. Just read it, Margaret. Where is it he says--Stop--'my father may rely upon me, that I will bear with all proper patience everything that one officer and gentleman can take from another. But from my former knowledge of my present captain, I confess I look forward with apprehension to a long course of tyranny on board the Russell.' You see, he promises to bear patiently, and I am sure he did, for he was the sweetest-tempered boy, when he was not vexed, that could possibly be. Is that the letter in which he speaks of Captain Reid's impatience with the men, for not going through the ship's manuvres as quickly as the Avenger? You see, he says that they had many new hands on board the Russell, while the Avenger had been nearly three years on the station, with nothing to do but to keep slavers off, and work her men, till they ran up and down the rigging like rats or monkeys.\"\nMargaret slowly read the letter, half illegible through the fading of the ink. It might be--it probably was--a statement of Captain Reid's imperiousness in trifles, very much exaggerated by the narrator, who had written it while fresh and warm from the scene of altercation. Some sailors being aloft in the main-topsail rigging, the captain had ordered them to race down, threatening the hindmost with the cat-of-nine tails. He who was the farthest on the spar, feeling the impossibility of passing his companions, and yet passionately dreading the disgrace of the flogging, threw himself desperately down to catch a rope considerably lower, failed, and fell senseless on the deck. He only survived for a few hours afterwards, and the indignation of the ship's crew was at boiling point when young Hale wrote.\n\"But we did not receive this letter till long, long after we heard of the mutiny. Poor Fred! I dare say it was a comfort to him to write it, even though he could not have known how to send it, poor fellow! And then we saw a report in the papers--that's to say, long before Fred's letter reached us--of an atrocious mutiny having broken out on board the Russell, and that the mutineers had remained in possession of the ship, which had gone off, it was supposed, to be a pirate; and that Captain Reid was sent adrift in a boat with some men--officers or something--whose names were all given, for they were picked up by a West Indian steamer. Oh, Margaret! how your father and I turned sick over that list, when there was no name of Frederick Hale. We thought it must be some mistake; for poor Fred was such a fine fellow, only perhaps rather too passionate; and we hoped that the name of Carr, which was in the list, was a misprint for that of Hale--newspapers are so careless. And towards post-time the next day, papa set off to walk to Southampton to get the papers; and I could not stop at home, so I went to meet him. He was very late--much later than I thought he would have been; and I sat down under the hedge to wait for him. He came at last, his arms hanging loose down, his head sunk, and walking heavily along, as if every step was a labour and a trouble. Margaret, I see him now.\"\n\"Don't go on, mamma. I can understand it all,\" said Margaret, leaning up caressingly against her mother's side, and kissing her hand.\n\"No, you can't, Margaret. No one can who did not see him then. I could hardly lift myself up to go and meet him--everything seemed so to reel around me all at once. And when I got to him, he did not speak, or seem surprised to see me there, more than three miles from home, beside the Oldham beech-tree; but he put my arm in his, and kept stroking my hand, as if he wanted to soothe me to be very quiet under some great heavy blow; and when I trembled so all over that I could not speak, he took me in his arms, and stooped down his head on mine, and began to shake and to cry in a strange muffled, groaning voice, till I, for very fright, stood quite still, and only begging him to tell me what he had heard. And then, with his hand jerking, as if some one else moved it against his will, he gave me a wicked newspaper to read, calling our Frederick a 'traitor of the blackest dye,' 'a base, ungrateful disgrace to his profession.' Oh! I cannot tell what bad words they did not use. I took the paper in my hands as soon as I had read it--I tore it up to little bits--I tore it--oh! I believe, Margaret, I tore it with my teeth. I did not cry. I could not. My cheeks were as hot as fire, and my very eyes burnt in my head. I saw your father looking grave at me. I said it was a lie, and so it was. Months after, this letter came, and you see what provocation Frederick had. It was not for himself, or his own injuries, he rebelled; but he would speak his mind to Captain Reid, and so it went on from bad to worse; and you see, most of the sailors stuck by Frederick.\"\n\"I think, Margaret,\" she continued, after a pause, in a weak, trembling, exhausted voice, \"I am glad of it--I am prouder of Frederick standing up against injustice, than if he had been simply a good officer.\"\n\"I am sure I am,\" said Margaret, in a firm, decided tone. \"Loyalty and obedience to wisdom and justice are fine; but it is still finer to defy arbitrary power, unjustly and cruelly used--not on behalf of ourselves, but on behalf of others more helpless.\"\n\"For all that, I wish I could see Frederick once more--just once. He was my first baby, Margaret.\" Mrs. Hale spoke wistfully, and almost as if apologising for the yearning, craving wish, as though it were a depreciation of her remaining child. But such an idea never crossed Margaret's mind. She was thinking how her mother's desire could be fulfilled.\n\"It is six or seven years ago--would they still prosecute him, mother. If he came and stood his trial, what would be the punishment? Surely, he might bring evidence of his great provocation.\"\n\"It would do no good,\" replied Mrs. Hale. \"Some of the sailors who accompanied Frederick were taken, and there was a court-martial held on them on board the Amicia; I believed all they said in their defence, poor fellows, because it just agreed with Frederick's story--but it was of no use,--\" and for the first time during the conversation Mrs. Hale began to cry; yet something possessed Margaret to force the information she foresaw, yet dreaded, from her mother.\n\"What happened to them, mamma?\" asked she.\n\"They were hung at the yard-arm,\" said Mrs. Hale, solemnly. \"And the worst was that the court, in condemning them to death, said they had suffered themselves to be led astray from their duty by their superior officers.\"\nThey were silent for a long time.\n\"And Frederick was in South America for several years, was he not?\"\n\"Yes. And now he is in Spain. At Cadiz, or somewhere near it. If he comes to England he will be hung. I shall never see his face again--for if he comes to England he will be hung.\"\nThere was no comfort to be given. Mrs. Hale turned her face to the wall, and lay perfectly still in her mother's despair. Nothing could be said to console her. She took her hand out of Margaret's with a little impatient movement, as if she would fain be left alone with the recollection of her son. When Mr. Hale came in, Margaret went out, oppressed with gloom, and seeing no promise of brightness on any side of the horizon.",
        "paragraph_chars": [
            [
                0,
                262
            ],
            [
                262,
                939
            ],
            [
                939,
                1250
            ],
            [
                1250,
                2018
            ],
            [
                2018,
                2151
            ],
            [
                2151,
                2523
            ],
            [
                2523,
                2754
            ],
            [
                2754,
                3169
            ],
            [
                3169,
                3560
            ],
            [
                3560,
                5090
            ],
            [
                5090,
                5900
            ],
            [
                5900,
                7293
            ],
            [
                7293,
                7427
            ],
            [
                7427,
                8995
            ],
            [
                8995,
                9204
            ],
            [
                9204,
                9459
            ],
            [
                9459,
                9812
            ],
            [
                9812,
                10004
            ],
            [
                10004,
                10470
            ],
            [
                10470,
                10513
            ],
            [
                10513,
                10733
            ],
            [
                10733,
                10767
            ],
            [
                10767,
                10835
            ],
            [
                10835,
                11016
            ],
            [
                11016,
                11442
            ]
        ],
        "segment_chars": [
            [
                0,
                164
            ],
            [
                164,
                253
            ],
            [
                253,
                262
            ],
            [
                262,
                434
            ],
            [
                434,
                576
            ],
            [
                576,
                889
            ],
            [
                889,
                939
            ],
            [
                939,
                1177
            ],
            [
                1177,
                1250
            ],
            [
                1250,
                1293
            ],
            [
                1293,
                1339
            ],
            [
                1339,
                1358
            ],
            [
                1358,
                1406
            ],
            [
                1406,
                1742
            ],
            [
                1742,
                1886
            ],
            [
                1886,
                1902
            ],
            [
                1902,
                1949
            ],
            [
                1949,
                2018
            ],
            [
                2018,
                2050
            ],
            [
                2050,
                2117
            ],
            [
                2117,
                2151
            ],
            [
                2151,
                2253
            ],
            [
                2253,
                2302
            ],
            [
                2302,
                2338
            ],
            [
                2338,
                2458
            ],
            [
                2458,
                2523
            ],
            [
                2523,
                2655
            ],
            [
                2655,
                2754
            ],
            [
                2754,
                2761
            ],
            [
                2761,
                2805
            ],
            [
                2805,
                2881
            ],
            [
                2881,
                2913
            ],
            [
                2913,
                3061
            ],
            [
                3061,
                3169
            ],
            [
                3169,
                3184
            ],
            [
                3184,
                3282
            ],
            [
                3282,
                3560
            ],
            [
                3560,
                3630
            ],
            [
                3630,
                3726
            ],
            [
                3726,
                3888
            ],
            [
                3888,
                3986
            ],
            [
                3986,
                4002
            ],
            [
                4002,
                4055
            ],
            [
                4055,
                4181
            ],
            [
                4181,
                4187
            ],
            [
                4187,
                4207
            ],
            [
                4207,
                4231
            ],
            [
                4231,
                4394
            ],
            [
                4394,
                4540
            ],
            [
                4540,
                4687
            ],
            [
                4687,
                4837
            ],
            [
                4837,
                5090
            ],
            [
                5090,
                5169
            ],
            [
                5169,
                5365
            ],
            [
                5365,
                5515
            ],
            [
                5515,
                5772
            ],
            [
                5772,
                5900
            ],
            [
                5900,
                5982
            ],
            [
                5982,
                5993
            ],
            [
                5993,
                6106
            ],
            [
                6106,
                6542
            ],
            [
                6542,
                6556
            ],
            [
                6556,
                6648
            ],
            [
                6648,
                6878
            ],
            [
                6878,
                7022
            ],
            [
                7022,
                7134
            ],
            [
                7134,
                7267
            ],
            [
                7267,
                7293
            ],
            [
                7293,
                7314
            ],
            [
                7314,
                7427
            ],
            [
                7427,
                7453
            ],
            [
                7453,
                7490
            ],
            [
                7490,
                7592
            ],
            [
                7592,
                8137
            ],
            [
                8137,
                8360
            ],
            [
                8360,
                8364
            ],
            [
                8364,
                8411
            ],
            [
                8411,
                8510
            ],
            [
                8510,
                8556
            ],
            [
                8556,
                8571
            ],
            [
                8571,
                8584
            ],
            [
                8584,
                8650
            ],
            [
                8650,
                8689
            ],
            [
                8689,
                8725
            ],
            [
                8725,
                8801
            ],
            [
                8801,
                8995
            ],
            [
                8995,
                9204
            ],
            [
                9204,
                9262
            ],
            [
                9262,
                9459
            ],
            [
                9459,
                9525
            ],
            [
                9525,
                9558
            ],
            [
                9558,
                9703
            ],
            [
                9703,
                9751
            ],
            [
                9751,
                9812
            ],
            [
                9812,
                9883
            ],
            [
                9883,
                9945
            ],
            [
                9945,
                10004
            ],
            [
                10004,
                10046
            ],
            [
                10046,
                10470
            ],
            [
                10470,
                10502
            ],
            [
                10502,
                10513
            ],
            [
                10513,
                10573
            ],
            [
                10573,
                10733
            ],
            [
                10733,
                10767
            ],
            [
                10767,
                10835
            ],
            [
                10835,
                10841
            ],
            [
                10841,
                10865
            ],
            [
                10865,
                10897
            ],
            [
                10897,
                10937
            ],
            [
                10937,
                11016
            ],
            [
                11016,
                11050
            ],
            [
                11050,
                11138
            ],
            [
                11138,
                11176
            ],
            [
                11176,
                11315
            ],
            [
                11315,
                11442
            ]
        ],
        "overlap_chars": [
            [
                262,
                290
            ],
            [
                297,
                306
            ],
            [
                308,
                331
            ],
            [
                337,
                348
            ],
            [
                351,
                354
            ],
            [
                366,
                390
            ],
            [
                396,
                406
            ],
            [
                419,
                434
            ],
            [
                434,
                484
            ],
            [
                486,
                529
            ],
            [
                574,
                576
            ],
            [
                576,
                584
            ],
            [
                596,
                598
            ],
            [
                631,
                634
            ],
            [
                610,
                620
            ],
            [
                635,
                647
            ],
            [
                825,
                826
            ],
            [
                669,
                678
            ],
            [
                701,
                708
            ],
            [
                887,
                889
            ],
            [
                937,
                939
            ],
            [
                939,
                999
            ],
            [
                1007,
                1034
            ],
            [
                1036,
                1052
            ],
            [
                1056,
                1176
            ],
            [
                1251,
                1293
            ],
            [
                1293,
                1339
            ],
            [
                1339,
                1358
            ],
            [
                1358,
                1404
            ],
            [
                1404,
                1406
            ],
            [
                1479,
                1495
            ],
            [
                1507,
                1614
            ],
            [
                1623,
                1638
            ],
            [
                1644,
                1667
            ],
            [
                1706,
                1742
            ],
            [
                1742,
                1802
            ],
            [
                1884,
                1886
            ],
            [
                1886,
                1902
            ],
            [
                1902,
                1947
            ],
            [
                2019,
                2027
            ],
            [
                2038,
                2050
            ],
            [
                2050,
                2065
            ],
            [
                2075,
                2115
            ],
            [
                2117,
                2123
            ],
            [
                2125,
                2137
            ],
            [
                2152,
                2217
            ],
            [
                2251,
                2253
            ],
            [
                2289,
                2300
            ],
            [
                2264,
                2268
            ],
            [
                2300,
                2338
            ],
            [
                2338,
                2381
            ],
            [
                2415,
                2458
            ],
            [
                2458,
                2515
            ],
            [
                2516,
                2520
            ],
            [
                2525,
                2529
            ],
            [
                2532,
                2546
            ],
            [
                2548,
                2596
            ],
            [
                2607,
                2655
            ],
            [
                2655,
                2684
            ],
            [
                2696,
                2751
            ],
            [
                2755,
                2761
            ],
            [
                2761,
                2763
            ],
            [
                2766,
                2784
            ],
            [
                2795,
                2805
            ],
            [
                2889,
                2913
            ],
            [
                2913,
                2947
            ],
            [
                2983,
                2994
            ],
            [
                3013,
                3019
            ],
            [
                3021,
                3061
            ],
            [
                3061,
                3166
            ],
            [
                3169,
                3184
            ],
            [
                3184,
                3282
            ],
            [
                3405,
                3408
            ],
            [
                3291,
                3380
            ],
            [
                3409,
                3446
            ],
            [
                3451,
                3560
            ],
            [
                3561,
                3630
            ],
            [
                3630,
                3666
            ],
            [
                3668,
                3677
            ],
            [
                3679,
                3726
            ],
            [
                3726,
                3737
            ],
            [
                3772,
                3782
            ],
            [
                3886,
                3888
            ],
            [
                3888,
                3986
            ],
            [
                4002,
                4055
            ],
            [
                4055,
                4062
            ],
            [
                4089,
                4132
            ],
            [
                4132,
                4153
            ],
            [
                4158,
                4169
            ],
            [
                4179,
                4181
            ],
            [
                4181,
                4185
            ],
            [
                4219,
                4229
            ],
            [
                4259,
                4286
            ],
            [
                4299,
                4303
            ],
            [
                4329,
                4394
            ],
            [
                4394,
                4428
            ],
            [
                4437,
                4447
            ],
            [
                4492,
                4537
            ],
            [
                4606,
                4661
            ],
            [
                4685,
                4687
            ],
            [
                4687,
                4789
            ],
            [
                4806,
                4837
            ],
            [
                4837,
                4845
            ],
            [
                4859,
                4931
            ],
            [
                4939,
                4950
            ],
            [
                4967,
                4989
            ],
            [
                5015,
                5071
            ],
            [
                5080,
                5087
            ],
            [
                5090,
                5169
            ],
            [
                5169,
                5171
            ],
            [
                5194,
                5197
            ],
            [
                5199,
                5242
            ],
            [
                5253,
                5254
            ],
            [
                5185,
                5193
            ],
            [
                5265,
                5324
            ],
            [
                5243,
                5245
            ],
            [
                5363,
                5365
            ],
            [
                5365,
                5477
            ],
            [
                5487,
                5491
            ],
            [
                5513,
                5515
            ],
            [
                5515,
                5538
            ],
            [
                5550,
                5551
            ],
            [
                5626,
                5711
            ],
            [
                5725,
                5761
            ],
            [
                5766,
                5772
            ],
            [
                5772,
                5815
            ],
            [
                5898,
                5900
            ],
            [
                5901,
                5982
            ],
            [
                5982,
                5993
            ],
            [
                6106,
                6144
            ],
            [
                6161,
                6197
            ],
            [
                6146,
                6150
            ],
            [
                6202,
                6221
            ],
            [
                6229,
                6288
            ],
            [
                6315,
                6343
            ],
            [
                6362,
                6435
            ],
            [
                6464,
                6480
            ],
            [
                6485,
                6525
            ],
            [
                6526,
                6541
            ],
            [
                6542,
                6556
            ],
            [
                6556,
                6648
            ],
            [
                6648,
                6756
            ],
            [
                6876,
                6878
            ],
            [
                6900,
                6974
            ],
            [
                7004,
                7022
            ],
            [
                7022,
                7038
            ],
            [
                7134,
                7167
            ],
            [
                7174,
                7214
            ],
            [
                7220,
                7251
            ],
            [
                7265,
                7267
            ],
            [
                7267,
                7290
            ],
            [
                7297,
                7314
            ],
            [
                7314,
                7337
            ],
            [
                7340,
                7362
            ],
            [
                7378,
                7427
            ],
            [
                7428,
                7453
            ],
            [
                7453,
                7490
            ],
            [
                7540,
                7557
            ],
            [
                7561,
                7578
            ],
            [
                7590,
                7592
            ],
            [
                7592,
                7602
            ],
            [
                7610,
                7667
            ],
            [
                7678,
                7699
            ],
            [
                7729,
                7782
            ],
            [
                7857,
                7878
            ],
            [
                7913,
                7964
            ],
            [
                7972,
                7996
            ],
            [
                8000,
                8024
            ],
            [
                8035,
                8046
            ],
            [
                7699,
                7700
            ],
            [
                8059,
                8066
            ],
            [
                7896,
                7897
            ],
            [
                8103,
                8136
            ],
            [
                8280,
                8281
            ],
            [
                8137,
                8145
            ],
            [
                8217,
                8255
            ],
            [
                8264,
                8279
            ],
            [
                8281,
                8308
            ],
            [
                8312,
                8313
            ],
            [
                8331,
                8357
            ],
            [
                8440,
                8464
            ],
            [
                8466,
                8478
            ],
            [
                8482,
                8493
            ],
            [
                8506,
                8510
            ],
            [
                8510,
                8556
            ],
            [
                8556,
                8569
            ],
            [
                8613,
                8614
            ],
            [
                8584,
                8586
            ],
            [
                8627,
                8650
            ],
            [
                8689,
                8725
            ],
            [
                8725,
                8731
            ],
            [
                8737,
                8801
            ],
            [
                8801,
                8823
            ],
            [
                8846,
                8944
            ],
            [
                8954,
                8992
            ],
            [
                8996,
                9013
            ],
            [
                9016,
                9048
            ],
            [
                9068,
                9084
            ],
            [
                9086,
                9101
            ],
            [
                9103,
                9201
            ],
            [
                9205,
                9219
            ],
            [
                9222,
                9235
            ],
            [
                9260,
                9262
            ],
            [
                9263,
                9270
            ],
            [
                9285,
                9306
            ],
            [
                9311,
                9346
            ],
            [
                9357,
                9362
            ],
            [
                9385,
                9389
            ],
            [
                9364,
                9384
            ],
            [
                9362,
                9363
            ],
            [
                9423,
                9456
            ],
            [
                9460,
                9512
            ],
            [
                9514,
                9523
            ],
            [
                9558,
                9595
            ],
            [
                9602,
                9608
            ],
            [
                9644,
                9655
            ],
            [
                9618,
                9621
            ],
            [
                9640,
                9644
            ],
            [
                9659,
                9703
            ],
            [
                9703,
                9751
            ],
            [
                9751,
                9812
            ],
            [
                9813,
                9841
            ],
            [
                9843,
                9881
            ],
            [
                9883,
                9888
            ],
            [
                9898,
                9903
            ],
            [
                9908,
                9945
            ],
            [
                9945,
                9951
            ],
            [
                9953,
                9983
            ],
            [
                9990,
                10001
            ],
            [
                10005,
                10024
            ],
            [
                10027,
                10046
            ],
            [
                10052,
                10108
            ],
            [
                10121,
                10131
            ],
            [
                10148,
                10236
            ],
            [
                10242,
                10271
            ],
            [
                10273,
                10293
            ],
            [
                10345,
                10372
            ],
            [
                10393,
                10401
            ],
            [
                10402,
                10404
            ],
            [
                10306,
                10309
            ],
            [
                10468,
                10470
            ],
            [
                10471,
                10499
            ],
            [
                10519,
                10544
            ],
            [
                10571,
                10573
            ],
            [
                10574,
                10606
            ],
            [
                10637,
                10650
            ],
            [
                10660,
                10687
            ],
            [
                10704,
                10730
            ],
            [
                10733,
                10767
            ],
            [
                10768,
                10832
            ],
            [
                10836,
                10841
            ],
            [
                10841,
                10863
            ],
            [
                10873,
                10874
            ],
            [
                10888,
                10892
            ],
            [
                10868,
                10873
            ],
            [
                10895,
                10897
            ],
            [
                10897,
                10937
            ],
            [
                10937,
                10969
            ],
            [
                11016,
                11050
            ],
            [
                11050,
                11066
            ],
            [
                11076,
                11092
            ],
            [
                11180,
                11261
            ],
            [
                11267,
                11280
            ],
            [
                11313,
                11315
            ],
            [
                11338,
                11346
            ],
            [
                11390,
                11442
            ]
        ],
        "row_chars": [
            [
                0,
                164
            ],
            [
                164,
                253
            ],
            [
                253,
                262
            ],
            [
                262,
                434
            ],
            [
                434,
                576
            ],
            [
                576,
                889
            ],
            [
                889,
                939
            ],
            [
                939,
                1177
            ],
            [
                1177,
                1250
            ],
            [
                1250,
                1293
            ],
            [
                1293,
                1339
            ],
            [
                1339,
                1358
            ],
            [
                1358,
                1406
            ],
            [
                1406,
                1742
            ],
            [
                1742,
                1886
            ],
            [
                1886,
                1902
            ],
            [
                1902,
                1949
            ],
            [
                1949,
                2018
            ],
            [
                2018,
                2050
            ],
            [
                2050,
                2151
            ],
            [
                2151,
                2253
            ],
            [
                2253,
                2338
            ],
            [
                2338,
                2458
            ],
            [
                2458,
                2523
            ],
            [
                2523,
                2655
            ],
            [
                2655,
                2754
            ],
            [
                2754,
                2761
            ],
            [
                2761,
                2805
            ],
            [
                2805,
                2881
            ],
            [
                2881,
                2913
            ],
            [
                2913,
                3061
            ],
            [
                3061,
                3169
            ],
            [
                3169,
                3184
            ],
            [
                3184,
                3282
            ],
            [
                3282,
                3560
            ],
            [
                3560,
                3630
            ],
            [
                3630,
                3726
            ],
            [
                3726,
                3888
            ],
            [
                3888,
                3986
            ],
            [
                3986,
                4002
            ],
            [
                4002,
                4055
            ],
            [
                4055,
                4181
            ],
            [
                4181,
                4231
            ],
            [
                4231,
                4394
            ],
            [
                4394,
                4540
            ],
            [
                4540,
                4687
            ],
            [
                4687,
                4837
            ],
            [
                4837,
                5090
            ],
            [
                5090,
                5169
            ],
            [
                5169,
                5365
            ],
            [
                5365,
                5515
            ],
            [
                5515,
                5772
            ],
            [
                5772,
                5900
            ],
            [
                5900,
                5982
            ],
            [
                5982,
                5993
            ],
            [
                5993,
                6106
            ],
            [
                6106,
                6542
            ],
            [
                6542,
                6556
            ],
            [
                6556,
                6648
            ],
            [
                6648,
                6878
            ],
            [
                6878,
                7022
            ],
            [
                7022,
                7267
            ],
            [
                7267,
                7293
            ],
            [
                7293,
                7314
            ],
            [
                7314,
                7427
            ],
            [
                7427,
                7453
            ],
            [
                7453,
                7490
            ],
            [
                7490,
                7592
            ],
            [
                7592,
                8137
            ],
            [
                8137,
                8360
            ],
            [
                8360,
                8364
            ],
            [
                8364,
                8411
            ],
            [
                8411,
                8510
            ],
            [
                8510,
                8556
            ],
            [
                8556,
                8650
            ],
            [
                8650,
                8689
            ],
            [
                8689,
                8725
            ],
            [
                8725,
                8801
            ],
            [
                8801,
                8995
            ],
            [
                8995,
                9204
            ],
            [
                9204,
                9262
            ],
            [
                9262,
                9459
            ],
            [
                9459,
                9525
            ],
            [
                9525,
                9558
            ],
            [
                9558,
                9703
            ],
            [
                9703,
                9751
            ],
            [
                9751,
                9812
            ],
            [
                9812,
                9883
            ],
            [
                9883,
                9945
            ],
            [
                9945,
                10004
            ],
            [
                10004,
                10046
            ],
            [
                10046,
                10470
            ],
            [
                10470,
                10502
            ],
            [
                10502,
                10513
            ],
            [
                10513,
                10573
            ],
            [
                10573,
                10733
            ],
            [
                10733,
                10767
            ],
            [
                10767,
                10835
            ],
            [
                10835,
                10841
            ],
            [
                10841,
                10897
            ],
            [
                10897,
                10937
            ],
            [
                10937,
                11016
            ],
            [
                11016,
                11050
            ],
            [
                11050,
                11315
            ],
            [
                11315,
                11442
            ]
        ]
    },
    "abridged": {
        "text": "It was a comfort to Margaret at this time to find that her mother became more tender and intimate towards her than she had done since her childhood. She took her to her heart as a confidential friend - the post Margaret had always longed to fill. Margaret responded to her every call for sympathy, even when only about trifles. For this, she was rewarded.\nOne evening, Mr. Hale being absent, her mother began to talk about her brother Frederick. This was the very subject about which Margaret had longed to ask questions, and almost the only one on which her timidity overcame her natural openness.\n'Oh, Margaret, it was so windy last night! It came howling down the chimney in our room! I could not sleep. I never can when there is such a terrible wind, ever since poor Frederick went to sea. If I don't waken, I dream of him in some stormy sea, with great, clear, glass-green walls of waves on either side his ship, higher than her masts, curling over her like some gigantic crested serpent. It is an old dream, but it always comes back on windy nights. Poor Frederick! He is on land now, so wind can do him no harm.'\n'Where is he now, mamma? Our letters are addressed to the care of Messrs. Barbour, at Cadiz, I know; but where is Frederick?'\n'I can't remember the name of the place, but he is not called Hale. The letters are sent to F. D. He has taken the name of Dickenson. I wanted him to have been called Beresford, but your father thought he had better not. He might be recognised, you know, if he were called by my maiden name.'\n'Mamma,' said Margaret, 'I was at Aunt Shaw's when it all happened; and I was not old enough to be told plainly about it. But I should like to know now - if it does not give you too much pain to speak about it.'\n'Pain! No,' replied Mrs. Hale, flushing. 'He did right, Margaret. They may say what they like, but I'll believe my son sooner than any court-martial on earth. Go to my little japan cabinet, dear, and in the second left-hand drawer you will find a packet of letters.'\nMargaret went. There were the yellow, sea-stained letters, with the peculiar fragrance which ocean letters have. She carried them back to her mother, who untied the silken string with trembling fingers, and gave them to Margaret to read, making hurried, anxious remarks on their contents, almost before her daughter could have understood what they were.\n'You see, Margaret, how from the very first he disliked Captain Reid. He was second lieutenant in the ship - the Orion - in which Frederick sailed the very first time. Poor little midshipman! But this Mr. Reid, as he was then, seemed to take a dislike to Frederick from the very beginning. These are the letters he wrote on board the Russell. When he found his old enemy Captain Reid in command there, he did mean to bear his tyranny calmly. Look here, Margaret -\n'\"my father may rely upon me, to bear patiently everything that one officer and gentleman can take from another. But from my former knowledge of my captain, I fear a long course of tyranny on board the Russell.\" He was the sweetest-tempered boy, when he was not vexed. Is that the letter in which he speaks of Captain Reid's impatience with the men, for not going through manoeuvres as quickly as the Avenger? You see, they had many new hands on board the Russell, while the Avenger had been three years with nothing to do but work her men, till they ran up and down the rigging like monkeys.'\nMargaret slowly read the letter, half illegible through the fading of the ink. It was a statement of Captain Reid's imperiousness, probably exaggerated by the narrator, who had written it while fresh in indignation. Some sailors being aloft in the main-topsail rigging, the captain had ordered them to race down, threatening the last with whipping. He who was the farthest up, dreading the disgrace of the flogging, threw himself desperately down to catch a rope much lower, failed, and fell senseless on deck. He only survived for a few hours afterwards.\n'But we did not receive this letter till long, long after we heard of the mutiny. Poor Fred! And then we saw a report in the papers - long before Fred's letter reached us - that an atrocious mutiny had broken out on board the Russell, and that the mutineers had taken over the ship, which had gone off to be a pirate; and that Captain Reid was sent adrift in a boat with some officers whose names were given, for they were picked up by a West-Indian steamer.\n'Oh, Margaret! how your father and I turned sick over that list, when there was no name of Frederick Hale. We thought it must be some mistake; for poor Fred was such a fine fellow, only perhaps rather too passionate. The next day, papa set off to walk to Southampton to get the papers; and I went to meet him. He was very late, but he came at last, his arms hanging down, his head sunk, and walking heavily, as if every step was a labour. Margaret, I see him now.'\n'Don't go on, mamma. I can understand it all,' said Margaret, leaning against her mother's side, and kissing her hand.\n'No, you can't, Margaret. No one can who did not see him then. Everything seemed to reel around me. And when I reached him, he did not speak, or seem surprised to see me there, three miles from home; but he put my arm in his, and kept stroking my hand; and when I trembled, he took me in his arms, and stooped down his head, and began to shake and cry in a strange muffled voice, till, in fright, I begged him to tell me what he had heard.\n'And then he gave me a wicked newspaper to read, which called our Frederick a \"traitor of the blackest dye,\" \"a disgrace to his profession.\" As soon as I had read it, I tore it up into little bits - oh! I believe, Margaret, I tore it with my teeth. I did not cry, though my eyes burnt in my head. I said it was a lie, and so it was. Months afterwards, this letter came, and you see what provocation Frederick had. It was not for himself that he rebelled; but he would speak his mind to Captain Reid, and so it went on from bad to worse; and most of the sailors stuck by Frederick.\n'I think, Margaret,' she continued, after a pause, in an exhausted voice, 'I am glad of it - I am prouder of Frederick standing up against injustice, than if he had been simply a good officer.'\n'I am sure I am,' said Margaret firmly. 'Loyalty to wisdom and justice is fine; but it is still finer to defy power used unjustly and cruelly, on behalf of others more helpless.'\n'For all that, I wish I could see Frederick once more - just once.' Mrs. Hale spoke wistfully, and almost apologetically, as though the wish were a depreciation of her remaining child. But such an idea never crossed Margaret's mind. She was thinking how her mother's desire could be fulfilled.\n'It is six or seven years ago - would they still prosecute him, mother? If he stood trial, what would be the punishment? Surely he might bring evidence of his provocation.'\n'It would do no good,' replied Mrs. Hale. 'Some of the sailors who accompanied Frederick were taken, and court-martialled on board the Amicia; I believed all they said in their defence, poor fellows, because it agreed with Frederick's story - but it was of no use.' Mrs. Hale began to cry; yet Margaret needed to know the end.\n'What happened to them, mamma?'\n'They were hung at the yard-arm. And the worst was that the court said they had allowed themselves to be led astray by their superior officers.'\nThey were silent for a long time.\n'And Frederick was in South America for several years, was he not?'\n'Yes. And now he is in Spain, near Cadiz. If he comes to England he will be hung. I shall never see his face again.'\nThere was no comfort to be given. Mrs. Hale turned to the wall, and took her hand out of Margaret's with a little impatient movement, as if she would rather be left alone. Margaret saw no promise of brightness on any side of the horizon.",
        "paragraph_chars": [
            [
                0,
                356
            ],
            [
                356,
                599
            ],
            [
                599,
                1120
            ],
            [
                1120,
                1246
            ],
            [
                1246,
                1539
            ],
            [
                1539,
                1751
            ],
            [
                1751,
                2018
            ],
            [
                2018,
                2372
            ],
            [
                2372,
                2836
            ],
            [
                2836,
                3430
            ],
            [
                3430,
                3986
            ],
            [
                3986,
                4445
            ],
            [
                4445,
                4910
            ],
            [
                4910,
                5029
            ],
            [
                5029,
                5469
            ],
            [
                5469,
                6050
            ],
            [
                6050,
                6244
            ],
            [
                6244,
                6423
            ],
            [
                6423,
                6717
            ],
            [
                6717,
                6890
            ],
            [
                6890,
                7217
            ],
            [
                7217,
                7249
            ],
            [
                7249,
                7394
            ],
            [
                7394,
                7428
            ],
            [
                7428,
                7496
            ],
            [
                7496,
                7613
            ],
            [
                7613,
                7850
            ]
        ],
        "segment_chars": [
            [
                0,
                149
            ],
            [
                149,
                247
            ],
            [
                247,
                328
            ],
            [
                328,
                356
            ],
            [
                356,
                446
            ],
            [
                446,
                599
            ],
            [
                599,
                642
            ],
            [
                642,
                688
            ],
            [
                688,
                707
            ],
            [
                707,
                794
            ],
            [
                794,
                994
            ],
            [
                994,
                1056
            ],
            [
                1056,
                1072
            ],
            [
                1072,
                1120
            ],
            [
                1120,
                1145
            ],
            [
                1145,
                1246
            ],
            [
                1246,
                1314
            ],
            [
                1314,
                1380
            ],
            [
                1380,
                1467
            ],
            [
                1467,
                1539
            ],
            [
                1539,
                1661
            ],
            [
                1661,
                1751
            ],
            [
                1751,
                1758
            ],
            [
                1758,
                1792
            ],
            [
                1792,
                1817
            ],
            [
                1817,
                1910
            ],
            [
                1910,
                2018
            ],
            [
                2018,
                2033
            ],
            [
                2033,
                2131
            ],
            [
                2131,
                2372
            ],
            [
                2372,
                2442
            ],
            [
                2442,
                2540
            ],
            [
                2540,
                2564
            ],
            [
                2564,
                2662
            ],
            [
                2662,
                2715
            ],
            [
                2715,
                2814
            ],
            [
                2814,
                2836
            ],
            [
                2836,
                2949
            ],
            [
                2949,
                3048
            ],
            [
                3048,
                3105
            ],
            [
                3105,
                3246
            ],
            [
                3246,
                3430
            ],
            [
                3430,
                3509
            ],
            [
                3509,
                3646
            ],
            [
                3646,
                3779
            ],
            [
                3779,
                3941
            ],
            [
                3941,
                3986
            ],
            [
                3986,
                4068
            ],
            [
                4068,
                4079
            ],
            [
                4079,
                4445
            ],
            [
                4445,
                4460
            ],
            [
                4460,
                4552
            ],
            [
                4552,
                4662
            ],
            [
                4662,
                4755
            ],
            [
                4755,
                4884
            ],
            [
                4884,
                4910
            ],
            [
                4910,
                4931
            ],
            [
                4931,
                5029
            ],
            [
                5029,
                5055
            ],
            [
                5055,
                5092
            ],
            [
                5092,
                5129
            ],
            [
                5129,
                5469
            ],
            [
                5469,
                5610
            ],
            [
                5610,
                5672
            ],
            [
                5672,
                5718
            ],
            [
                5718,
                5766
            ],
            [
                5766,
                5802
            ],
            [
                5802,
                5883
            ],
            [
                5883,
                6050
            ],
            [
                6050,
                6244
            ],
            [
                6244,
                6284
            ],
            [
                6284,
                6423
            ],
            [
                6423,
                6491
            ],
            [
                6491,
                6608
            ],
            [
                6608,
                6656
            ],
            [
                6656,
                6717
            ],
            [
                6717,
                6789
            ],
            [
                6789,
                6838
            ],
            [
                6838,
                6890
            ],
            [
                6890,
                6932
            ],
            [
                6932,
                7156
            ],
            [
                7156,
                7217
            ],
            [
                7217,
                7249
            ],
            [
                7249,
                7282
            ],
            [
                7282,
                7394
            ],
            [
                7394,
                7428
            ],
            [
                7428,
                7496
            ],
            [
                7496,
                7502
            ],
            [
                7502,
                7538
            ],
            [
                7538,
                7578
            ],
            [
                7578,
                7613
            ],
            [
                7613,
                7647
            ],
            [
                7647,
                7785
            ],
            [
                7785,
                7850
            ]
        ],
        "overlap_chars": [
            [
                0,
                28
            ],
            [
                32,
                41
            ],
            [
                42,
                65
            ],
            [
                73,
                84
            ],
            [
                85,
                88
            ],
            [
                98,
                122
            ],
            [
                123,
                133
            ],
            [
                134,
                149
            ],
            [
                149,
                199
            ],
            [
                202,
                245
            ],
            [
                245,
                247
            ],
            [
                247,
                255
            ],
            [
                266,
                268
            ],
            [
                269,
                272
            ],
            [
                273,
                283
            ],
            [
                284,
                296
            ],
            [
                296,
                297
            ],
            [
                298,
                307
            ],
            [
                319,
                326
            ],
            [
                326,
                328
            ],
            [
                354,
                356
            ],
            [
                356,
                416
            ],
            [
                417,
                444
            ],
            [
                455,
                471
            ],
            [
                478,
                598
            ],
            [
                600,
                642
            ],
            [
                642,
                688
            ],
            [
                688,
                707
            ],
            [
                707,
                753
            ],
            [
                792,
                794
            ],
            [
                794,
                810
            ],
            [
                810,
                917
            ],
            [
                918,
                933
            ],
            [
                934,
                957
            ],
            [
                958,
                994
            ],
            [
                994,
                1054
            ],
            [
                1054,
                1056
            ],
            [
                1056,
                1072
            ],
            [
                1072,
                1117
            ],
            [
                1121,
                1129
            ],
            [
                1133,
                1145
            ],
            [
                1145,
                1160
            ],
            [
                1171,
                1211
            ],
            [
                1213,
                1219
            ],
            [
                1221,
                1233
            ],
            [
                1247,
                1312
            ],
            [
                1312,
                1314
            ],
            [
                1314,
                1325
            ],
            [
                1338,
                1342
            ],
            [
                1342,
                1380
            ],
            [
                1380,
                1423
            ],
            [
                1424,
                1467
            ],
            [
                1467,
                1524
            ],
            [
                1532,
                1536
            ],
            [
                1541,
                1545
            ],
            [
                1548,
                1562
            ],
            [
                1564,
                1612
            ],
            [
                1613,
                1661
            ],
            [
                1661,
                1690
            ],
            [
                1693,
                1748
            ],
            [
                1752,
                1758
            ],
            [
                1758,
                1760
            ],
            [
                1763,
                1781
            ],
            [
                1782,
                1792
            ],
            [
                1793,
                1817
            ],
            [
                1817,
                1851
            ],
            [
                1851,
                1862
            ],
            [
                1863,
                1869
            ],
            [
                1870,
                1910
            ],
            [
                1910,
                2015
            ],
            [
                2018,
                2033
            ],
            [
                2033,
                2131
            ],
            [
                2131,
                2134
            ],
            [
                2135,
                2224
            ],
            [
                2225,
                2262
            ],
            [
                2263,
                2372
            ],
            [
                2373,
                2442
            ],
            [
                2442,
                2478
            ],
            [
                2481,
                2490
            ],
            [
                2493,
                2540
            ],
            [
                2540,
                2551
            ],
            [
                2552,
                2562
            ],
            [
                2562,
                2564
            ],
            [
                2564,
                2662
            ],
            [
                2662,
                2715
            ],
            [
                2715,
                2722
            ],
            [
                2723,
                2766
            ],
            [
                2772,
                2793
            ],
            [
                2794,
                2805
            ],
            [
                2812,
                2814
            ],
            [
                2814,
                2818
            ],
            [
                2823,
                2833
            ],
            [
                2838,
                2865
            ],
            [
                2869,
                2873
            ],
            [
                2884,
                2949
            ],
            [
                2949,
                2983
            ],
            [
                2984,
                2994
            ],
            [
                3000,
                3045
            ],
            [
                3048,
                3103
            ],
            [
                3103,
                3105
            ],
            [
                3105,
                3207
            ],
            [
                3215,
                3246
            ],
            [
                3246,
                3254
            ],
            [
                3255,
                3327
            ],
            [
                3328,
                3339
            ],
            [
                3340,
                3362
            ],
            [
                3363,
                3419
            ],
            [
                3420,
                3427
            ],
            [
                3430,
                3509
            ],
            [
                3509,
                3511
            ],
            [
                3512,
                3515
            ],
            [
                3516,
                3559
            ],
            [
                3559,
                3560
            ],
            [
                3561,
                3569
            ],
            [
                3570,
                3629
            ],
            [
                3630,
                3632
            ],
            [
                3644,
                3646
            ],
            [
                3646,
                3758
            ],
            [
                3764,
                3768
            ],
            [
                3777,
                3779
            ],
            [
                3779,
                3802
            ],
            [
                3805,
                3806
            ],
            [
                3807,
                3892
            ],
            [
                3898,
                3934
            ],
            [
                3935,
                3941
            ],
            [
                3941,
                3984
            ],
            [
                3984,
                3986
            ],
            [
                3987,
                4068
            ],
            [
                4068,
                4079
            ],
            [
                4079,
                4117
            ],
            [
                4120,
                4156
            ],
            [
                4159,
                4163
            ],
            [
                4164,
                4183
            ],
            [
                4188,
                4247
            ],
            [
                4259,
                4287
            ],
            [
                4288,
                4361
            ],
            [
                4371,
                4387
            ],
            [
                4388,
                4428
            ],
            [
                4429,
                4444
            ],
            [
                4446,
                4460
            ],
            [
                4460,
                4552
            ],
            [
                4552,
                4660
            ],
            [
                4660,
                4662
            ],
            [
                4662,
                4736
            ],
            [
                4737,
                4755
            ],
            [
                4755,
                4771
            ],
            [
                4777,
                4810
            ],
            [
                4811,
                4851
            ],
            [
                4851,
                4882
            ],
            [
                4882,
                4884
            ],
            [
                4884,
                4907
            ],
            [
                4914,
                4931
            ],
            [
                4931,
                4954
            ],
            [
                4957,
                4979
            ],
            [
                4980,
                5029
            ],
            [
                5030,
                5055
            ],
            [
                5055,
                5092
            ],
            [
                5092,
                5109
            ],
            [
                5110,
                5127
            ],
            [
                5127,
                5129
            ],
            [
                5129,
                5139
            ],
            [
                5148,
                5205
            ],
            [
                5206,
                5227
            ],
            [
                5227,
                5280
            ],
            [
                5280,
                5301
            ],
            [
                5301,
                5352
            ],
            [
                5352,
                5376
            ],
            [
                5377,
                5401
            ],
            [
                5402,
                5413
            ],
            [
                5413,
                5414
            ],
            [
                5418,
                5425
            ],
            [
                5426,
                5427
            ],
            [
                5435,
                5468
            ],
            [
                5469,
                5470
            ],
            [
                5470,
                5478
            ],
            [
                5479,
                5517
            ],
            [
                5531,
                5546
            ],
            [
                5548,
                5575
            ],
            [
                5579,
                5580
            ],
            [
                5581,
                5607
            ],
            [
                5610,
                5634
            ],
            [
                5636,
                5648
            ],
            [
                5654,
                5665
            ],
            [
                5668,
                5672
            ],
            [
                5672,
                5718
            ],
            [
                5718,
                5731
            ],
            [
                5731,
                5732
            ],
            [
                5740,
                5742
            ],
            [
                5743,
                5766
            ],
            [
                5766,
                5802
            ],
            [
                5802,
                5808
            ],
            [
                5819,
                5883
            ],
            [
                5883,
                5905
            ],
            [
                5911,
                6009
            ],
            [
                6010,
                6048
            ],
            [
                6051,
                6068
            ],
            [
                6071,
                6103
            ],
            [
                6107,
                6123
            ],
            [
                6125,
                6140
            ],
            [
                6143,
                6241
            ],
            [
                6245,
                6259
            ],
            [
                6262,
                6275
            ],
            [
                6282,
                6284
            ],
            [
                6285,
                6292
            ],
            [
                6293,
                6314
            ],
            [
                6318,
                6353
            ],
            [
                6354,
                6359
            ],
            [
                6360,
                6364
            ],
            [
                6365,
                6385
            ],
            [
                6385,
                6386
            ],
            [
                6387,
                6420
            ],
            [
                6424,
                6476
            ],
            [
                6479,
                6488
            ],
            [
                6491,
                6528
            ],
            [
                6529,
                6535
            ],
            [
                6543,
                6554
            ],
            [
                6555,
                6558
            ],
            [
                6559,
                6563
            ],
            [
                6564,
                6608
            ],
            [
                6608,
                6656
            ],
            [
                6656,
                6717
            ],
            [
                6718,
                6746
            ],
            [
                6749,
                6787
            ],
            [
                6789,
                6794
            ],
            [
                6795,
                6800
            ],
            [
                6801,
                6838
            ],
            [
                6838,
                6844
            ],
            [
                6845,
                6875
            ],
            [
                6876,
                6887
            ],
            [
                6891,
                6910
            ],
            [
                6913,
                6932
            ],
            [
                6938,
                6994
            ],
            [
                6995,
                7005
            ],
            [
                7012,
                7100
            ],
            [
                7101,
                7130
            ],
            [
                7133,
                7153
            ],
            [
                7156,
                7183
            ],
            [
                7184,
                7192
            ],
            [
                7200,
                7202
            ],
            [
                7208,
                7211
            ],
            [
                7215,
                7217
            ],
            [
                7218,
                7246
            ],
            [
                7255,
                7280
            ],
            [
                7280,
                7282
            ],
            [
                7282,
                7314
            ],
            [
                7315,
                7328
            ],
            [
                7337,
                7364
            ],
            [
                7365,
                7391
            ],
            [
                7394,
                7428
            ],
            [
                7429,
                7493
            ],
            [
                7497,
                7502
            ],
            [
                7502,
                7524
            ],
            [
                7524,
                7525
            ],
            [
                7526,
                7530
            ],
            [
                7531,
                7536
            ],
            [
                7536,
                7538
            ],
            [
                7538,
                7578
            ],
            [
                7578,
                7610
            ],
            [
                7613,
                7647
            ],
            [
                7647,
                7663
            ],
            [
                7664,
                7680
            ],
            [
                7681,
                7762
            ],
            [
                7770,
                7783
            ],
            [
                7783,
                7785
            ],
            [
                7785,
                7793
            ],
            [
                7798,
                7850
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                149
            ],
            [
                149,
                247
            ],
            [
                247,
                328
            ],
            [
                328,
                356
            ],
            [
                356,
                599
            ],
            [
                599,
                599
            ],
            [
                599,
                642
            ],
            [
                642,
                688
            ],
            [
                688,
                707
            ],
            [
                707,
                794
            ],
            [
                794,
                994
            ],
            [
                994,
                1056
            ],
            [
                1056,
                1072
            ],
            [
                1072,
                1120
            ],
            [
                1120,
                1120
            ],
            [
                1120,
                1145
            ],
            [
                1145,
                1246
            ],
            [
                1246,
                1314
            ],
            [
                1314,
                1380
            ],
            [
                1380,
                1467
            ],
            [
                1467,
                1539
            ],
            [
                1539,
                1661
            ],
            [
                1661,
                1751
            ],
            [
                1751,
                1758
            ],
            [
                1758,
                1792
            ],
            [
                1792,
                1792
            ],
            [
                1792,
                1817
            ],
            [
                1817,
                1910
            ],
            [
                1910,
                2018
            ],
            [
                2018,
                2033
            ],
            [
                2033,
                2131
            ],
            [
                2131,
                2372
            ],
            [
                2372,
                2442
            ],
            [
                2442,
                2540
            ],
            [
                2540,
                2564
            ],
            [
                2564,
                2662
            ],
            [
                2662,
                2662
            ],
            [
                2662,
                2715
            ],
            [
                2715,
                2814
            ],
            [
                2814,
                2836
            ],
            [
                2836,
                2949
            ],
            [
                2949,
                3048
            ],
            [
                3048,
                3105
            ],
            [
                3105,
                3246
            ],
            [
                3246,
                3430
            ],
            [
                3430,
                3509
            ],
            [
                3509,
                3646
            ],
            [
                3646,
                3779
            ],
            [
                3779,
                3941
            ],
            [
                3941,
                3986
            ],
            [
                3986,
                4068
            ],
            [
                4068,
                4079
            ],
            [
                4079,
                4079
            ],
            [
                4079,
                4445
            ],
            [
                4445,
                4460
            ],
            [
                4460,
                4552
            ],
            [
                4552,
                4662
            ],
            [
                4662,
                4755
            ],
            [
                4755,
                4884
            ],
            [
                4884,
                4910
            ],
            [
                4910,
                4931
            ],
            [
                4931,
                5029
            ],
            [
                5029,
                5055
            ],
            [
                5055,
                5092
            ],
            [
                5092,
                5129
            ],
            [
                5129,
                5469
            ],
            [
                5469,
                5610
            ],
            [
                5610,
                5610
            ],
            [
                5610,
                5610
            ],
            [
                5610,
                5672
            ],
            [
                5672,
                5718
            ],
            [
                5718,
                5766
            ],
            [
                5766,
                5766
            ],
            [
                5766,
                5802
            ],
            [
                5802,
                5883
            ],
            [
                5883,
                6050
            ],
            [
                6050,
                6244
            ],
            [
                6244,
                6284
            ],
            [
                6284,
                6423
            ],
            [
                6423,
                6491
            ],
            [
                6491,
                6491
            ],
            [
                6491,
                6608
            ],
            [
                6608,
                6656
            ],
            [
                6656,
                6717
            ],
            [
                6717,
                6789
            ],
            [
                6789,
                6838
            ],
            [
                6838,
                6890
            ],
            [
                6890,
                6932
            ],
            [
                6932,
                7217
            ],
            [
                7217,
                7249
            ],
            [
                7249,
                7249
            ],
            [
                7249,
                7282
            ],
            [
                7282,
                7394
            ],
            [
                7394,
                7428
            ],
            [
                7428,
                7496
            ],
            [
                7496,
                7502
            ],
            [
                7502,
                7538
            ],
            [
                7538,
                7578
            ],
            [
                7578,
                7613
            ],
            [
                7613,
                7647
            ],
            [
                7647,
                7785
            ],
            [
                7785,
                7850
            ]
        ]
    }
}