{
    "original": {
        "text": "\"Trust in that veiled hand, which leads None by the path that he would go; And always be for change prepared, For the world's law is ebb and flow.\" FROM THE ARABIC.\nThe next afternoon Dr. Donaldson came to pay his first visit to Mrs. Hale. The mystery that Margaret hoped their late habits of intimacy had broken through was resumed. She was excluded from the room, while Dixon was admitted. Margaret was not a ready lover, but where she loved she loved passionately, and with no small degree of jealousy.\nShe went into her mother's bed-room, just behind the drawing-room, and paced it up and down, while awaiting the doctor's coming out. Every now and then she stopped to listen; she fancied she heard a moan. She clenched her hands tight, and held her breath. She was sure she heard a moan. Then all was still for a few minutes more; and then there was the moving of chairs, the raised voices, all the little disturbances of leave-taking.\nWhen she heard the door open, she went quickly out of the bedroom.\n\"My father is from home, Dr. Donaldson; he has to attend a pupil at this hour. May I trouble you to come into his room downstairs?\"\nShe saw, and triumphed over all the obstacles which Dixon threw in her way; assuming her rightful position as daughter of the house in something of the spirit of the Elder Brother, which quelled the old servant's officiousness very effectually. Margaret's conscious assumption of this unusual dignity of demeanour towards Dixon, gave her an instant's amusement in the midst of her anxiety. She knew, from the surprised expression on Dixon's face, how ridiculously grand she herself must be looking; and the idea carried her downstairs into the room; it gave her that length of oblivion from the keen sharpness of the recollection of the actual business in hand. Now, that came back, and seemed to take away her breath. It was a moment or two before she could utter a word.\nBut she spoke with an air of command, as she asked--\n\"What is the matter with mamma? You will oblige me by telling the simple truth.\" Then, seeing a slight hesitation on the doctor's part, she added--\n\"I am the only child she has--here, I mean. My father is not sufficiently alarmed, I fear: and, therefore, if there is any serious apprehension, it must be broken to him gently. I can do this. I can nurse my mother. Pray, speak, sir; to see your face, and not be able to read it, gives me a worse dread than I trust any words of yours will justify.\"\n\"My dear young lady, your mother seems to have a most attentive and efficient servant, who is more like her friend----\"\n\"I am her daughter, sir.\"\n\"But when I tell you she expressly desired that you might not be told----\"\n\"I am not good or patient enough to submit to the prohibition. Besides, I am sure, you are too wise--too experienced to have promised to keep the secret.\"\n\"Well,\" said he, half-smiling, though sadly enough, \"there you are right. I did not promise. In fact, I fear, the secret will be known soon enough without my revealing it.\"\nHe paused. Margaret then went very white, and compressed her lips a little more. Otherwise not a feature moved. With the quick insight into character, without which no medical man can rise to the eminence of Dr. Donaldson, he saw that she would exact the full truth; that she would know if one iota was withheld; and that the withholding would be torture more acute than the knowledge of it. He spoke two short sentences in a low voice, watching her all the time; for the pupils of her eyes dilated into a black horror, and the whiteness of her complexion became livid. He ceased speaking. He waited for that look to go off,--for her gasping breath to come. Then she said:--\n\"I thank you most truly, sir, for your confidence. That dread has haunted me for many weeks. It is a true, real agony. My poor, poor mother!\" Her lips now began to quiver, and he let her have the relief of tears, sure of her power of self-control to check them.\nA few tears--those were all she shed, before she recollected the many questions she longed to ask.\n\"Will there be much suffering?\"\nHe shook his head. \"That we cannot tell. It depends on constitution; on a thousand things. But the late discoveries of medical science have given us large power of alleviation.\"\n\"My father!\" said Margaret, trembling all over.\n\"I do not know Mr. Hale. I mean, it is difficult to give advice. But I should say, bear on, with the knowledge you have forced me to give you so abruptly, till the fact which I could not withhold has become in some degree familiar to you, so that you may without too great an effort, be able to give what comfort you can to your father. Before then,--my visits, which of course, I shall repeat from time to time, although I fear I can do nothing but alleviate,--a thousand little circumstances will have occurred to awaken his alarm, to deepen it--so that he will be all the better prepared.--Nay, my dear young lady--nay, my dear--I saw Mr. Thornton, and I honour your father for the sacrifice he has made, however mistaken I may believe him to be.--Well, this once, if it will please you, my dear. Only remember, when I come again, I come as a friend. And you must learn to look upon me as such, because seeing each other--getting to know each other at such times as these, is worth years of morning calls.\"\nMargaret could not speak for crying; but she wrang his hand at parting.\n\"That's what I call a fine girl!\" thought Dr. Donaldson, when he was seated in his carriage, and had time to examine his ringed hand, which had slightly suffered from her pressure. \"Who would have thought that little hand could have given such a squeeze? But the bones were well put together, and that gives immense power. What a queen she is! With her head thrown back at first, to force me into speaking the truth; and then bent so eagerly forward to listen. Poor thing! I must see she does not overstrain herself. Though it's astonishing how much these thorough-bred creatures can do and suffer. That girl's game to the back-bone. Another, who had gone that deadly colour, could never have come round without either fainting or hysterics. But she wouldn't do either--not she! And the very force of her will brought her round. Such a girl as that would win my heart, if I were thirty years younger. It's too late now. Ah; here we are at the Archers'.\" So out he jumped, with thought, wisdom, experience, sympathy, and ready to attend to any of the calls made upon them by this family, just as if there were none other in the world.\nMeanwhile, Margaret had returned into her father's study for a moment, to recover strength before going upstairs into her mother's presence.\n\"Oh, my God, my God! but this is terrible. How shall I bear it? Such a deadly disease! no hope! Oh, mamma, mamma, I wish I had never gone to aunt Shaw's, and been all those precious years away from you! Poor mamma! how much she must have borne! Oh, pray thee, my God, that her sufferings may not be too acute, too dreadful. How shall I bear to see them? How can I bear papa's agony? He must not be told yet; not all at once. It would kill him. But I won't lose another moment of my own dear, precious mother.\"\nShe ran upstairs. Dixon was not in the room. Mrs. Hale lay back in an easy chair, with a soft white shawl wrapped around her, and a becoming cap put on, in expectation of the doctor's visit. Her face had a little faint colour in it, and the very exhaustion after the examination gave it a peaceful look. Margaret was surprised to see her look so calm.\n\"Why, Margaret, how strange you look! What is the matter?\" And then, as the idea stole into her mind of what was indeed the real state of the case, she added, as if a little displeased: \"you have not been seeing Dr. Donaldson, and asking him any questions--have you child?\" Margaret did not reply--only looked wistfully towards her. Mrs. Hale became more displeased. \"He would not surely break his word to me, and\"--\n\"Oh yes, mamma, he did. I made him. It was I--blame me.\" She knelt down by her mother's side, and caught her hand--she would not let it go, though Mrs. Hale tried to pull it away. She kept kissing it, and the hot tears she shed bathed it.\n\"Margaret, it was very wrong of you. You knew I did not wish you to know.\" But, as if tired with the contest, she left her hand in Margaret's clasp, and by-and-by she returned the pressure faintly. That encouraged Margaret to speak.\n\"Oh, mamma! let me be your nurse. I will learn anything Dixon can teach me. But you know I am your child, and I do think I have a right to do everything for you.\"\n\"You don't know what you are asking,\" said Mrs. Hale, with a shudder.\n\"Yes, I do. I know a great deal more than you are aware of. Let me be your nurse. Let me try, at any rate. No one has ever, shall ever try so hard as I will do. It will be such a comfort, mamma.\"\n\"My poor child! Well, you shall try. Do you know, Margaret, Dixon and I thought you would quite shrink from me if you knew--\"\n\"Dixon thought!\" said Margaret, her lip curling. \"Dixon could not give me credit for enough true love--for as much as herself! She thought, I suppose, that I was one of those poor sickly women who like to lie on rose leaves, and be fanned all day. Don't let Dixon's fancies come any more between you and me, mamma. Don't please!\" implored she.\n\"Don't be angry with Dixon,\" said Mrs. Hale, anxiously. Margaret recovered herself.\n\"No! I won't. I will try and be humble, and learn her ways, if you will only let me do all I can for you. Let me be in the first place, mother--I am greedy of that. I used to fancy you would forget me while I was away at aunt Shaw's, and cry myself to sleep at nights with that notion in my head.\"\n\"And I used to think, how will Margaret bear our make-shift poverty after the thorough comfort and luxury in Harley Street, till I have many a time been more ashamed of your seeing our contrivances at Helstone than of any stranger finding them out.\"\n\"Oh, mamma! and I did so enjoy them. They were so much more amusing than all the jog-trot Harley Street ways. The wardrobe shelf with handles that served as a supper-tray on grand occasions! And the old tea-chests stuffed and covered for ottomans! I think what you call the make-shift contrivances at dear Helstone were a charming part of the life there.\"\n\"I shall never see Helstone again, Margaret,\" said Mrs. Hale, the tears welling up into her eyes. Margaret could not reply. Mrs. Hale went on. \"While I was there, I was for ever wanting to leave it. Every place seemed pleasanter. And now I shall die far away from it. I am rightly punished.\"\n\"You must not talk so,\" said Margaret impatiently. \"He said you might live for years. Oh, mother! we will have you back at Helstone yet.\"\n\"No, never! That I must take as a just penance. But, Margaret--Frederick!\"\nAt the mention of that one word, she suddenly cried out loud, as in some sharp agony. It seemed as if the thought of him upset all her composure, destroyed the calm, overcame the exhaustion. Wild passionate cry succeeded to cry--\"Frederick! Frederick! Come to me. I am dying. Little first-born child, come to me once again!\"\nShe was in violent hysterics. Margaret went and called Dixon in terror. Dixon came in a huff, and accused Margaret of having over-excited her mother. Margaret bore all meekly, only trusting that her father might not return. In spite of her alarm, which was even greater than the occasion warranted, she obeyed all Dixon's directions promptly and well without a word of self-justification. By so doing she mollified her accuser. They put her mother to bed, and Margaret sate by her till she fell asleep, and afterwards till Dixon beckoned her out of the room, and, with a sour face, as if doing something against the grain, she bade her drink a cup of coffee which she had prepared for her in the drawing-room, and stood over her in a commanding attitude as she did so.\n\"You shouldn't have been so curious, Miss, and then you wouldn't have needed to fret before your time. It would have come soon enough. And now, I suppose, you'll tell master, and a pretty household I shall have of you!\"\n\"No, Dixon,\" said Margaret, sorrowfully, \"I will not tell papa. He could not bear it as I can.\" And by way of proving how well she bore it, she burst into tears.\n\"Ay! I knew how it would be. Now you'll waken your mamma, just after she's gone to sleep so quietly. Miss Margaret my dear, I've had to keep it down this many a week: and though I don't pretend I can love her as you do, yet I loved her better than any other man, woman, or child--no one but Master Frederick ever came near her in my mind. Ever since Lady Beresford's maid first took me in to see her dressed out in white crape, and corn-ears, and scarlet poppies, and I ran a needle down into my finger, and broke it in, and she tore up her worked pocket-handkerchief, after they'd cut it out, and came in to wet the bandages again with lotion when she returned from the ball--where she'd been the prettiest young lady of all--I've never loved any one like her. I little thought then that I should live to see her brought so low. I don't mean no reproach to nobody. Many a one calls you pretty and handsome, and what not. Even in this smoky place, enough to blind one's eyes, the owls can see that. But you'll never be like your mother for beauty--never; not if you live to be a hundred.\"\n\"Mamma is very pretty still. Poor mamma!\"\n\"Now don't ye set off again, or I shall give way at last\" (whimpering). \"You'll never stand master's coming home, and questioning, at this rate. Go out and take a walk, and come in something like. Many's the time I've longed to walk it off--the thought of what was the matter with her, and how it must all end.\"\n\"Oh, Dixon!\" said Margaret, \"how often I've been cross with you, not knowing what a terrible secret you had to bear!\"\n\"Bless you, child! I like to see you showing a bit of a spirit. It's the good old Beresford blood. Why, the last Sir John but two shot his steward down, there where he stood, for just telling him that he racked the tenants, and he'd racked the tenants till he could get no more money off them than he could get skin off a flint.\"\n\"Well, Dixon, I won't shoot you, and I'll try not to be cross again.\"\n\"You never have. If I've said it at times, it has always been to myself, just in private, by way of making a little agreeable conversation, for there's no one here fit to talk to. And when you fire up you're the very image of Master Frederick. I could find in my heart to put you in a passion any day just to see his stormy look coming like a great cloud over your face. But now you go out, Miss. I'll watch over Missus; and as for master, his books are company enough for him, if he should come in.\"\n\"I will go,\" said Margaret. She hung about Dixon for a minute or so, as if afraid and irresolute; then, suddenly kissing her, she went quickly out of the room.\n\"Bless her!\" said Dixon. \"She's as sweet as a nut. There are three people I love; its Missus, Master Frederick, and her. Just them three. That's all. The rest be hanged, for I don't know what they're in the world for. Master was born, I suppose, for to marry missus. If I thought he loved her properly, I might get to love him in time. But he should ha' made a deal more on her, and not been always reading, reading, thinking, thinking. See what it has brought him to. Many a one who never reads or thinks either, gets to be Rector, and Dean, and what not; and I daresay master might, if he'd just minded missus, and let the weary reading and thinking alone.--There she goes\" (looking out of the window as she heard the front door shut). \"Poor young lady! her clothes look shabby to what they did when she came to Helstone a year ago. Then she hadn't so much as a darned stocking or a cleaned pair of gloves in all her wardrobe. And now--!\"",
        "paragraph_chars": [
            [
                0,
                165
            ],
            [
                165,
                506
            ],
            [
                506,
                941
            ],
            [
                941,
                1008
            ],
            [
                1008,
                1140
            ],
            [
                1140,
                1913
            ],
            [
                1913,
                1966
            ],
            [
                1966,
                2114
            ],
            [
                2114,
                2464
            ],
            [
                2464,
                2584
            ],
            [
                2584,
                2610
            ],
            [
                2610,
                2685
            ],
            [
                2685,
                2840
            ],
            [
                2840,
                3013
            ],
            [
                3013,
                3688
            ],
            [
                3688,
                3950
            ],
            [
                3950,
                4049
            ],
            [
                4049,
                4081
            ],
            [
                4081,
                4259
            ],
            [
                4259,
                4307
            ],
            [
                4307,
                5317
            ],
            [
                5317,
                5389
            ],
            [
                5389,
                6523
            ],
            [
                6523,
                6664
            ],
            [
                6664,
                7174
            ],
            [
                7174,
                7526
            ],
            [
                7526,
                7943
            ],
            [
                7943,
                8182
            ],
            [
                8182,
                8415
            ],
            [
                8415,
                8578
            ],
            [
                8578,
                8648
            ],
            [
                8648,
                8844
            ],
            [
                8844,
                8970
            ],
            [
                8970,
                9314
            ],
            [
                9314,
                9398
            ],
            [
                9398,
                9696
            ],
            [
                9696,
                9946
            ],
            [
                9946,
                10302
            ],
            [
                10302,
                10594
            ],
            [
                10594,
                10732
            ],
            [
                10732,
                10807
            ],
            [
                10807,
                11132
            ],
            [
                11132,
                11901
            ],
            [
                11901,
                12121
            ],
            [
                12121,
                12283
            ],
            [
                12283,
                13372
            ],
            [
                13372,
                13414
            ],
            [
                13414,
                13726
            ],
            [
                13726,
                13844
            ],
            [
                13844,
                14174
            ],
            [
                14174,
                14244
            ],
            [
                14244,
                14745
            ],
            [
                14745,
                14905
            ],
            [
                14905,
                15845
            ]
        ],
        "segment_chars": [
            [
                0,
                148
            ],
            [
                148,
                165
            ],
            [
                165,
                240
            ],
            [
                240,
                334
            ],
            [
                334,
                392
            ],
            [
                392,
                506
            ],
            [
                506,
                639
            ],
            [
                639,
                711
            ],
            [
                711,
                762
            ],
            [
                762,
                793
            ],
            [
                793,
                941
            ],
            [
                941,
                1008
            ],
            [
                1008,
                1087
            ],
            [
                1087,
                1140
            ],
            [
                1140,
                1385
            ],
            [
                1385,
                1530
            ],
            [
                1530,
                1802
            ],
            [
                1802,
                1859
            ],
            [
                1859,
                1913
            ],
            [
                1913,
                1966
            ],
            [
                1966,
                1998
            ],
            [
                1998,
                2047
            ],
            [
                2047,
                2114
            ],
            [
                2114,
                2158
            ],
            [
                2158,
                2292
            ],
            [
                2292,
                2307
            ],
            [
                2307,
                2330
            ],
            [
                2330,
                2464
            ],
            [
                2464,
                2584
            ],
            [
                2584,
                2610
            ],
            [
                2610,
                2685
            ],
            [
                2685,
                2748
            ],
            [
                2748,
                2840
            ],
            [
                2840,
                2914
            ],
            [
                2914,
                2933
            ],
            [
                2933,
                3013
            ],
            [
                3013,
                3024
            ],
            [
                3024,
                3094
            ],
            [
                3094,
                3125
            ],
            [
                3125,
                3405
            ],
            [
                3405,
                3583
            ],
            [
                3583,
                3603
            ],
            [
                3603,
                3671
            ],
            [
                3671,
                3688
            ],
            [
                3688,
                3739
            ],
            [
                3739,
                3781
            ],
            [
                3781,
                3807
            ],
            [
                3807,
                3830
            ],
            [
                3830,
                3950
            ],
            [
                3950,
                4049
            ],
            [
                4049,
                4081
            ],
            [
                4081,
                4100
            ],
            [
                4100,
                4122
            ],
            [
                4122,
                4172
            ],
            [
                4172,
                4259
            ],
            [
                4259,
                4272
            ],
            [
                4272,
                4307
            ],
            [
                4307,
                4332
            ],
            [
                4332,
                4372
            ],
            [
                4372,
                4644
            ],
            [
                4644,
                5107
            ],
            [
                5107,
                5161
            ],
            [
                5161,
                5317
            ],
            [
                5317,
                5389
            ],
            [
                5389,
                5423
            ],
            [
                5423,
                5570
            ],
            [
                5570,
                5644
            ],
            [
                5644,
                5712
            ],
            [
                5712,
                5733
            ],
            [
                5733,
                5850
            ],
            [
                5850,
                5862
            ],
            [
                5862,
                5906
            ],
            [
                5906,
                5988
            ],
            [
                5988,
                6023
            ],
            [
                6023,
                6131
            ],
            [
                6131,
                6168
            ],
            [
                6168,
                6218
            ],
            [
                6218,
                6290
            ],
            [
                6290,
                6309
            ],
            [
                6309,
                6343
            ],
            [
                6343,
                6523
            ],
            [
                6523,
                6664
            ],
            [
                6664,
                6685
            ],
            [
                6685,
                6707
            ],
            [
                6707,
                6728
            ],
            [
                6728,
                6751
            ],
            [
                6751,
                6760
            ],
            [
                6760,
                6867
            ],
            [
                6867,
                6879
            ],
            [
                6879,
                6909
            ],
            [
                6909,
                6988
            ],
            [
                6988,
                7018
            ],
            [
                7018,
                7047
            ],
            [
                7047,
                7089
            ],
            [
                7089,
                7108
            ],
            [
                7108,
                7174
            ],
            [
                7174,
                7192
            ],
            [
                7192,
                7219
            ],
            [
                7219,
                7365
            ],
            [
                7365,
                7478
            ],
            [
                7478,
                7526
            ],
            [
                7526,
                7564
            ],
            [
                7564,
                7585
            ],
            [
                7585,
                7800
            ],
            [
                7800,
                7859
            ],
            [
                7859,
                7893
            ],
            [
                7893,
                7943
            ],
            [
                7943,
                7967
            ],
            [
                7967,
                7979
            ],
            [
                7979,
                8000
            ],
            [
                8000,
                8123
            ],
            [
                8123,
                8182
            ],
            [
                8182,
                8219
            ],
            [
                8219,
                8257
            ],
            [
                8257,
                8380
            ],
            [
                8380,
                8415
            ],
            [
                8415,
                8427
            ],
            [
                8427,
                8449
            ],
            [
                8449,
                8491
            ],
            [
                8491,
                8578
            ],
            [
                8578,
                8648
            ],
            [
                8648,
                8660
            ],
            [
                8660,
                8708
            ],
            [
                8708,
                8730
            ],
            [
                8730,
                8755
            ],
            [
                8755,
                8809
            ],
            [
                8809,
                8844
            ],
            [
                8844,
                8860
            ],
            [
                8860,
                8881
            ],
            [
                8881,
                8970
            ],
            [
                8970,
                8987
            ],
            [
                8987,
                9019
            ],
            [
                9019,
                9097
            ],
            [
                9097,
                9218
            ],
            [
                9218,
                9285
            ],
            [
                9285,
                9300
            ],
            [
                9300,
                9314
            ],
            [
                9314,
                9370
            ],
            [
                9370,
                9398
            ],
            [
                9398,
                9403
            ],
            [
                9403,
                9412
            ],
            [
                9412,
                9504
            ],
            [
                9504,
                9563
            ],
            [
                9563,
                9696
            ],
            [
                9696,
                9946
            ],
            [
                9946,
                9958
            ],
            [
                9958,
                9983
            ],
            [
                9983,
                10056
            ],
            [
                10056,
                10137
            ],
            [
                10137,
                10194
            ],
            [
                10194,
                10302
            ],
            [
                10302,
                10400
            ],
            [
                10400,
                10426
            ],
            [
                10426,
                10445
            ],
            [
                10445,
                10501
            ],
            [
                10501,
                10532
            ],
            [
                10532,
                10570
            ],
            [
                10570,
                10594
            ],
            [
                10594,
                10645
            ],
            [
                10645,
                10680
            ],
            [
                10680,
                10692
            ],
            [
                10692,
                10732
            ],
            [
                10732,
                10744
            ],
            [
                10744,
                10780
            ],
            [
                10780,
                10807
            ],
            [
                10807,
                10893
            ],
            [
                10893,
                10998
            ],
            [
                10998,
                11048
            ],
            [
                11048,
                11059
            ],
            [
                11059,
                11071
            ],
            [
                11071,
                11083
            ],
            [
                11083,
                11132
            ],
            [
                11132,
                11162
            ],
            [
                11162,
                11204
            ],
            [
                11204,
                11282
            ],
            [
                11282,
                11356
            ],
            [
                11356,
                11521
            ],
            [
                11521,
                11560
            ],
            [
                11560,
                11901
            ],
            [
                11901,
                12004
            ],
            [
                12004,
                12036
            ],
            [
                12036,
                12121
            ],
            [
                12121,
                12185
            ],
            [
                12185,
                12217
            ],
            [
                12217,
                12283
            ],
            [
                12283,
                12288
            ],
            [
                12288,
                12312
            ],
            [
                12312,
                12384
            ],
            [
                12384,
                12622
            ],
            [
                12622,
                13045
            ],
            [
                13045,
                13113
            ],
            [
                13113,
                13149
            ],
            [
                13149,
                13205
            ],
            [
                13205,
                13282
            ],
            [
                13282,
                13372
            ],
            [
                13372,
                13401
            ],
            [
                13401,
                13414
            ],
            [
                13414,
                13486
            ],
            [
                13486,
                13559
            ],
            [
                13559,
                13611
            ],
            [
                13611,
                13726
            ],
            [
                13726,
                13739
            ],
            [
                13739,
                13844
            ],
            [
                13844,
                13863
            ],
            [
                13863,
                13908
            ],
            [
                13908,
                13943
            ],
            [
                13943,
                14174
            ],
            [
                14174,
                14244
            ],
            [
                14244,
                14261
            ],
            [
                14261,
                14424
            ],
            [
                14424,
                14488
            ],
            [
                14488,
                14615
            ],
            [
                14615,
                14641
            ],
            [
                14641,
                14745
            ],
            [
                14745,
                14773
            ],
            [
                14773,
                14905
            ],
            [
                14905,
                14918
            ],
            [
                14918,
                14930
            ],
            [
                14930,
                14956
            ],
            [
                14956,
                15026
            ],
            [
                15026,
                15043
            ],
            [
                15043,
                15055
            ],
            [
                15055,
                15123
            ],
            [
                15123,
                15172
            ],
            [
                15172,
                15241
            ],
            [
                15241,
                15342
            ],
            [
                15342,
                15374
            ],
            [
                15374,
                15643
            ],
            [
                15643,
                15661
            ],
            [
                15661,
                15740
            ],
            [
                15740,
                15834
            ],
            [
                15834,
                15845
            ]
        ],
        "overlap_chars": [
            [
                165,
                205
            ],
            [
                220,
                225
            ],
            [
                229,
                240
            ],
            [
                257,
                265
            ],
            [
                338,
                365
            ],
            [
                372,
                392
            ],
            [
                392,
                506
            ],
            [
                506,
                509
            ],
            [
                577,
                582
            ],
            [
                586,
                597
            ],
            [
                555,
                558
            ],
            [
                537,
                542
            ],
            [
                605,
                639
            ],
            [
                639,
                657
            ],
            [
                681,
                711
            ],
            [
                711,
                762
            ],
            [
                798,
                876
            ],
            [
                877,
                894
            ],
            [
                924,
                941
            ],
            [
                941,
                987
            ],
            [
                1006,
                1008
            ],
            [
                1012,
                1021
            ],
            [
                1065,
                1072
            ],
            [
                1031,
                1046
            ],
            [
                1085,
                1087
            ],
            [
                1087,
                1137
            ],
            [
                1140,
                1147
            ],
            [
                1149,
                1228
            ],
            [
                1238,
                1271
            ],
            [
                1396,
                1405
            ],
            [
                1433,
                1440
            ],
            [
                1319,
                1326
            ],
            [
                1469,
                1530
            ],
            [
                1530,
                1613
            ],
            [
                1622,
                1688
            ],
            [
                1800,
                1801
            ],
            [
                1757,
                1800
            ],
            [
                1827,
                1859
            ],
            [
                1859,
                1898
            ],
            [
                1911,
                1913
            ],
            [
                1967,
                1998
            ],
            [
                2028,
                2044
            ],
            [
                2053,
                2059
            ],
            [
                2083,
                2093
            ],
            [
                2100,
                2111
            ],
            [
                2051,
                2052
            ],
            [
                2115,
                2142
            ],
            [
                2144,
                2148
            ],
            [
                2156,
                2158
            ],
            [
                2158,
                2174
            ],
            [
                2188,
                2196
            ],
            [
                2205,
                2208
            ],
            [
                2221,
                2244
            ],
            [
                2199,
                2203
            ],
            [
                2257,
                2292
            ],
            [
                2292,
                2307
            ],
            [
                2307,
                2330
            ],
            [
                2330,
                2334
            ],
            [
                2336,
                2346
            ],
            [
                2468,
                2496
            ],
            [
                2635,
                2679
            ],
            [
                2757,
                2766
            ],
            [
                2768,
                2784
            ],
            [
                2786,
                2837
            ],
            [
                2841,
                2845
            ],
            [
                2848,
                2883
            ],
            [
                2890,
                2891
            ],
            [
                2893,
                2914
            ],
            [
                2914,
                2933
            ],
            [
                2933,
                2948
            ],
            [
                2950,
                3010
            ],
            [
                3013,
                3024
            ],
            [
                3024,
                3032
            ],
            [
                3038,
                3053
            ],
            [
                3092,
                3094
            ],
            [
                3221,
                3234
            ],
            [
                3239,
                3242
            ],
            [
                3280,
                3311
            ],
            [
                3218,
                3220
            ],
            [
                3130,
                3133
            ],
            [
                3273,
                3278
            ],
            [
                3312,
                3359
            ],
            [
                3360,
                3367
            ],
            [
                3379,
                3397
            ],
            [
                3403,
                3404
            ],
            [
                3405,
                3462
            ],
            [
                3485,
                3491
            ],
            [
                3504,
                3507
            ],
            [
                3512,
                3531
            ],
            [
                3581,
                3583
            ],
            [
                3671,
                3685
            ],
            [
                3689,
                3739
            ],
            [
                3739,
                3781
            ],
            [
                3807,
                3827
            ],
            [
                3830,
                3838
            ],
            [
                3843,
                3899
            ],
            [
                3948,
                3950
            ],
            [
                3978,
                3986
            ],
            [
                3950,
                3955
            ],
            [
                3986,
                4049
            ],
            [
                4050,
                4078
            ],
            [
                4081,
                4100
            ],
            [
                4106,
                4122
            ],
            [
                4122,
                4132
            ],
            [
                4150,
                4172
            ],
            [
                4172,
                4179
            ],
            [
                4185,
                4250
            ],
            [
                4263,
                4269
            ],
            [
                4272,
                4296
            ],
            [
                4305,
                4307
            ],
            [
                4308,
                4332
            ],
            [
                4372,
                4389
            ],
            [
                4467,
                4475
            ],
            [
                4503,
                4513
            ],
            [
                4529,
                4561
            ],
            [
                4591,
                4601
            ],
            [
                4612,
                4619
            ],
            [
                4631,
                4644
            ],
            [
                4686,
                4687
            ],
            [
                5081,
                5085
            ],
            [
                4718,
                4766
            ],
            [
                4801,
                4810
            ],
            [
                4830,
                4840
            ],
            [
                4855,
                4873
            ],
            [
                4882,
                4897
            ],
            [
                4905,
                4912
            ],
            [
                4939,
                5013
            ],
            [
                5105,
                5107
            ],
            [
                5112,
                5161
            ],
            [
                5161,
                5212
            ],
            [
                5232,
                5314
            ],
            [
                5317,
                5352
            ],
            [
                5354,
                5364
            ],
            [
                5368,
                5389
            ],
            [
                5394,
                5420
            ],
            [
                5423,
                5457
            ],
            [
                5465,
                5480
            ],
            [
                5568,
                5570
            ],
            [
                5712,
                5733
            ],
            [
                5733,
                5850
            ],
            [
                5850,
                5862
            ],
            [
                5862,
                5906
            ],
            [
                5906,
                5912
            ],
            [
                5988,
                6023
            ],
            [
                6108,
                6129
            ],
            [
                6159,
                6168
            ],
            [
                6172,
                6218
            ],
            [
                6218,
                6290
            ],
            [
                6290,
                6309
            ],
            [
                6309,
                6311
            ],
            [
                6313,
                6324
            ],
            [
                6343,
                6360
            ],
            [
                6409,
                6424
            ],
            [
                6425,
                6427
            ],
            [
                6463,
                6467
            ],
            [
                6468,
                6475
            ],
            [
                6481,
                6523
            ],
            [
                6523,
                6555
            ],
            [
                6561,
                6579
            ],
            [
                6594,
                6626
            ],
            [
                6641,
                6651
            ],
            [
                6662,
                6664
            ],
            [
                6665,
                6685
            ],
            [
                6685,
                6707
            ],
            [
                6707,
                6728
            ],
            [
                6728,
                6751
            ],
            [
                6751,
                6760
            ],
            [
                6760,
                6762
            ],
            [
                6769,
                6796
            ],
            [
                6822,
                6867
            ],
            [
                6867,
                6879
            ],
            [
                6879,
                6909
            ],
            [
                6909,
                6912
            ],
            [
                6913,
                6966
            ],
            [
                6978,
                6988
            ],
            [
                6988,
                7018
            ],
            [
                7018,
                7047
            ],
            [
                7047,
                7070
            ],
            [
                7087,
                7089
            ],
            [
                7089,
                7108
            ],
            [
                7108,
                7171
            ],
            [
                7174,
                7192
            ],
            [
                7192,
                7219
            ],
            [
                7219,
                7298
            ],
            [
                7363,
                7365
            ],
            [
                7365,
                7410
            ],
            [
                7415,
                7430
            ],
            [
                7453,
                7478
            ],
            [
                7478,
                7511
            ],
            [
                7517,
                7526
            ],
            [
                7527,
                7564
            ],
            [
                7564,
                7582
            ],
            [
                7585,
                7593
            ],
            [
                7674,
                7710
            ],
            [
                7593,
                7594
            ],
            [
                7713,
                7781
            ],
            [
                7672,
                7673
            ],
            [
                7783,
                7791
            ],
            [
                7792,
                7797
            ],
            [
                7800,
                7822
            ],
            [
                7824,
                7840
            ],
            [
                7857,
                7859
            ],
            [
                7859,
                7893
            ],
            [
                7894,
                7906
            ],
            [
                7934,
                7935
            ],
            [
                7907,
                7913
            ],
            [
                7914,
                7934
            ],
            [
                7953,
                7967
            ],
            [
                7967,
                7979
            ],
            [
                7989,
                7997
            ],
            [
                8000,
                8056
            ],
            [
                8058,
                8123
            ],
            [
                8123,
                8147
            ],
            [
                8166,
                8170
            ],
            [
                8152,
                8161
            ],
            [
                8180,
                8182
            ],
            [
                8187,
                8219
            ],
            [
                8219,
                8254
            ],
            [
                8257,
                8260
            ],
            [
                8292,
                8329
            ],
            [
                8378,
                8379
            ],
            [
                8416,
                8427
            ],
            [
                8427,
                8449
            ],
            [
                8449,
                8489
            ],
            [
                8579,
                8613
            ],
            [
                8616,
                8648
            ],
            [
                8649,
                8660
            ],
            [
                8660,
                8708
            ],
            [
                8708,
                8730
            ],
            [
                8730,
                8755
            ],
            [
                8809,
                8841
            ],
            [
                8848,
                8860
            ],
            [
                8860,
                8881
            ],
            [
                8881,
                8966
            ],
            [
                8972,
                8984
            ],
            [
                8987,
                9019
            ],
            [
                9021,
                9054
            ],
            [
                9077,
                9084
            ],
            [
                9067,
                9071
            ],
            [
                9085,
                9097
            ],
            [
                9097,
                9149
            ],
            [
                9157,
                9218
            ],
            [
                9218,
                9283
            ],
            [
                9318,
                9340
            ],
            [
                9343,
                9357
            ],
            [
                9359,
                9369
            ],
            [
                9399,
                9403
            ],
            [
                9403,
                9412
            ],
            [
                9412,
                9422
            ],
            [
                9438,
                9504
            ],
            [
                9563,
                9665
            ],
            [
                9697,
                9744
            ],
            [
                9756,
                9773
            ],
            [
                9795,
                9818
            ],
            [
                9749,
                9750
            ],
            [
                9820,
                9831
            ],
            [
                9844,
                9943
            ],
            [
                9947,
                9958
            ],
            [
                9958,
                9983
            ],
            [
                10056,
                10087
            ],
            [
                10088,
                10137
            ],
            [
                10137,
                10194
            ],
            [
                10194,
                10201
            ],
            [
                10216,
                10219
            ],
            [
                10231,
                10265
            ],
            [
                10268,
                10276
            ],
            [
                10303,
                10345
            ],
            [
                10348,
                10400
            ],
            [
                10446,
                10496
            ],
            [
                10499,
                10501
            ],
            [
                10532,
                10570
            ],
            [
                10570,
                10591
            ],
            [
                10595,
                10615
            ],
            [
                10618,
                10631
            ],
            [
                10643,
                10645
            ],
            [
                10646,
                10680
            ],
            [
                10680,
                10692
            ],
            [
                10692,
                10729
            ],
            [
                10733,
                10744
            ],
            [
                10780,
                10793
            ],
            [
                10799,
                10804
            ],
            [
                10840,
                10891
            ],
            [
                10909,
                10941
            ],
            [
                10967,
                10971
            ],
            [
                10942,
                10951
            ],
            [
                10996,
                10998
            ],
            [
                10998,
                11017
            ],
            [
                11031,
                11034
            ],
            [
                11037,
                11048
            ],
            [
                11048,
                11059
            ],
            [
                11059,
                11071
            ],
            [
                11071,
                11083
            ],
            [
                11083,
                11129
            ],
            [
                11132,
                11162
            ],
            [
                11193,
                11202
            ],
            [
                11162,
                11192
            ],
            [
                11210,
                11249
            ],
            [
                11257,
                11265
            ],
            [
                11270,
                11281
            ],
            [
                11282,
                11307
            ],
            [
                11435,
                11441
            ],
            [
                11446,
                11482
            ],
            [
                11377,
                11378
            ],
            [
                11483,
                11521
            ],
            [
                11521,
                11560
            ],
            [
                11560,
                11600
            ],
            [
                11606,
                11633
            ],
            [
                11655,
                11694
            ],
            [
                11696,
                11712
            ],
            [
                11759,
                11789
            ],
            [
                11821,
                11841
            ],
            [
                11852,
                11860
            ],
            [
                11886,
                11901
            ],
            [
                11902,
                11985
            ],
            [
                12002,
                12004
            ],
            [
                12036,
                12111
            ],
            [
                12122,
                12131
            ],
            [
                12134,
                12147
            ],
            [
                12149,
                12161
            ],
            [
                12163,
                12185
            ],
            [
                12185,
                12214
            ],
            [
                12217,
                12220
            ],
            [
                12239,
                12283
            ],
            [
                12284,
                12288
            ],
            [
                12288,
                12312
            ],
            [
                12312,
                12339
            ],
            [
                12382,
                12384
            ],
            [
                12384,
                12397
            ],
            [
                12544,
                12545
            ],
            [
                12398,
                12448
            ],
            [
                12450,
                12508
            ],
            [
                12509,
                12540
            ],
            [
                12570,
                12590
            ],
            [
                12620,
                12622
            ],
            [
                12622,
                12682
            ],
            [
                12745,
                12765
            ],
            [
                12771,
                12785
            ],
            [
                12802,
                12823
            ],
            [
                12831,
                12850
            ],
            [
                12900,
                12908
            ],
            [
                12709,
                12710
            ],
            [
                13010,
                13026
            ],
            [
                13035,
                13045
            ],
            [
                13045,
                13113
            ],
            [
                13113,
                13149
            ],
            [
                13149,
                13203
            ],
            [
                13229,
                13230
            ],
            [
                13282,
                13329
            ],
            [
                13257,
                13258
            ],
            [
                13338,
                13369
            ],
            [
                13374,
                13401
            ],
            [
                13401,
                13411
            ],
            [
                13415,
                13424
            ],
            [
                13428,
                13441
            ],
            [
                13559,
                13611
            ],
            [
                13611,
                13653
            ],
            [
                13655,
                13669
            ],
            [
                13695,
                13698
            ],
            [
                13698,
                13723
            ],
            [
                13727,
                13736
            ],
            [
                13739,
                13753
            ],
            [
                13755,
                13841
            ],
            [
                14211,
                14241
            ],
            [
                14428,
                14444
            ],
            [
                14445,
                14488
            ],
            [
                14488,
                14489
            ],
            [
                14516,
                14544
            ],
            [
                14545,
                14615
            ],
            [
                14615,
                14641
            ],
            [
                14641,
                14663
            ],
            [
                14746,
                14755
            ],
            [
                14758,
                14773
            ],
            [
                14773,
                14787
            ],
            [
                14794,
                14806
            ],
            [
                14812,
                14813
            ],
            [
                14831,
                14847
            ],
            [
                14849,
                14865
            ],
            [
                14788,
                14793
            ],
            [
                14869,
                14905
            ],
            [
                14906,
                14915
            ],
            [
                14918,
                14930
            ],
            [
                14962,
                14985
            ],
            [
                14991,
                15026
            ],
            [
                15026,
                15043
            ],
            [
                15055,
                15073
            ],
            [
                15079,
                15123
            ],
            [
                15123,
                15129
            ],
            [
                15248,
                15263
            ],
            [
                15271,
                15275
            ],
            [
                15279,
                15342
            ],
            [
                15342,
                15372
            ],
            [
                15374,
                15400
            ],
            [
                15404,
                15410
            ],
            [
                15419,
                15467
            ],
            [
                15476,
                15562
            ],
            [
                15565,
                15579
            ],
            [
                15581,
                15582
            ],
            [
                15608,
                15643
            ],
            [
                15644,
                15661
            ],
            [
                15661,
                15677
            ],
            [
                15756,
                15758
            ],
            [
                15678,
                15684
            ],
            [
                15738,
                15739
            ],
            [
                15702,
                15738
            ],
            [
                15745,
                15755
            ],
            [
                15767,
                15784
            ],
            [
                15813,
                15834
            ],
            [
                15834,
                15841
            ]
        ],
        "row_chars": [
            [
                0,
                148
            ],
            [
                148,
                165
            ],
            [
                165,
                240
            ],
            [
                240,
                392
            ],
            [
                392,
                506
            ],
            [
                506,
                639
            ],
            [
                639,
                711
            ],
            [
                711,
                762
            ],
            [
                762,
                793
            ],
            [
                793,
                941
            ],
            [
                941,
                1008
            ],
            [
                1008,
                1087
            ],
            [
                1087,
                1140
            ],
            [
                1140,
                1530
            ],
            [
                1530,
                1859
            ],
            [
                1859,
                1913
            ],
            [
                1913,
                1966
            ],
            [
                1966,
                1998
            ],
            [
                1998,
                2047
            ],
            [
                2047,
                2158
            ],
            [
                2158,
                2292
            ],
            [
                2292,
                2307
            ],
            [
                2307,
                2330
            ],
            [
                2330,
                2464
            ],
            [
                2464,
                2685
            ],
            [
                2685,
                2748
            ],
            [
                2748,
                2840
            ],
            [
                2840,
                2914
            ],
            [
                2914,
                2933
            ],
            [
                2933,
                3013
            ],
            [
                3013,
                3024
            ],
            [
                3024,
                3094
            ],
            [
                3094,
                3125
            ],
            [
                3125,
                3405
            ],
            [
                3405,
                3583
            ],
            [
                3583,
                3603
            ],
            [
                3603,
                3671
            ],
            [
                3671,
                3688
            ],
            [
                3688,
                3739
            ],
            [
                3739,
                3781
            ],
            [
                3781,
                3807
            ],
            [
                3807,
                3830
            ],
            [
                3830,
                3950
            ],
            [
                3950,
                4049
            ],
            [
                4049,
                4081
            ],
            [
                4081,
                4100
            ],
            [
                4100,
                4122
            ],
            [
                4122,
                4172
            ],
            [
                4172,
                4259
            ],
            [
                4259,
                4272
            ],
            [
                4272,
                4307
            ],
            [
                4307,
                4332
            ],
            [
                4332,
                4372
            ],
            [
                4372,
                4644
            ],
            [
                4644,
                5107
            ],
            [
                5107,
                5161
            ],
            [
                5161,
                5317
            ],
            [
                5317,
                5389
            ],
            [
                5389,
                5423
            ],
            [
                5423,
                5570
            ],
            [
                5570,
                5644
            ],
            [
                5644,
                5712
            ],
            [
                5712,
                5733
            ],
            [
                5733,
                5850
            ],
            [
                5850,
                5862
            ],
            [
                5862,
                5906
            ],
            [
                5906,
                6023
            ],
            [
                6023,
                6168
            ],
            [
                6168,
                6218
            ],
            [
                6218,
                6290
            ],
            [
                6290,
                6309
            ],
            [
                6309,
                6343
            ],
            [
                6343,
                6523
            ],
            [
                6523,
                6664
            ],
            [
                6664,
                6685
            ],
            [
                6685,
                6707
            ],
            [
                6707,
                6728
            ],
            [
                6728,
                6751
            ],
            [
                6751,
                6760
            ],
            [
                6760,
                6867
            ],
            [
                6867,
                6879
            ],
            [
                6879,
                6909
            ],
            [
                6909,
                6988
            ],
            [
                6988,
                7018
            ],
            [
                7018,
                7047
            ],
            [
                7047,
                7089
            ],
            [
                7089,
                7108
            ],
            [
                7108,
                7174
            ],
            [
                7174,
                7192
            ],
            [
                7192,
                7219
            ],
            [
                7219,
                7365
            ],
            [
                7365,
                7478
            ],
            [
                7478,
                7526
            ],
            [
                7526,
                7564
            ],
            [
                7564,
                7585
            ],
            [
                7585,
                7800
            ],
            [
                7800,
                7859
            ],
            [
                7859,
                7893
            ],
            [
                7893,
                7943
            ],
            [
                7943,
                7967
            ],
            [
                7967,
                7979
            ],
            [
                7979,
                8000
            ],
            [
                8000,
                8123
            ],
            [
                8123,
                8182
            ],
            [
                8182,
                8219
            ],
            [
                8219,
                8257
            ],
            [
                8257,
                8380
            ],
            [
                8380,
                8415
            ],
            [
                8415,
                8427
            ],
            [
                8427,
                8449
            ],
            [
                8449,
                8491
            ],
            [
                8491,
                8578
            ],
            [
                8578,
                8648
            ],
            [
                8648,
                8660
            ],
            [
                8660,
                8708
            ],
            [
                8708,
                8730
            ],
            [
                8730,
                8755
            ],
            [
                8755,
                8809
            ],
            [
                8809,
                8844
            ],
            [
                8844,
                8860
            ],
            [
                8860,
                8881
            ],
            [
                8881,
                8970
            ],
            [
                8970,
                8987
            ],
            [
                8987,
                9019
            ],
            [
                9019,
                9097
            ],
            [
                9097,
                9218
            ],
            [
                9218,
                9285
            ],
            [
                9285,
                9300
            ],
            [
                9300,
                9314
            ],
            [
                9314,
                9370
            ],
            [
                9370,
                9398
            ],
            [
                9398,
                9403
            ],
            [
                9403,
                9412
            ],
            [
                9412,
                9504
            ],
            [
                9504,
                9563
            ],
            [
                9563,
                9696
            ],
            [
                9696,
                9946
            ],
            [
                9946,
                9958
            ],
            [
                9958,
                9983
            ],
            [
                9983,
                10056
            ],
            [
                10056,
                10137
            ],
            [
                10137,
                10194
            ],
            [
                10194,
                10302
            ],
            [
                10302,
                10400
            ],
            [
                10400,
                10426
            ],
            [
                10426,
                10445
            ],
            [
                10445,
                10501
            ],
            [
                10501,
                10532
            ],
            [
                10532,
                10570
            ],
            [
                10570,
                10594
            ],
            [
                10594,
                10645
            ],
            [
                10645,
                10680
            ],
            [
                10680,
                10692
            ],
            [
                10692,
                10732
            ],
            [
                10732,
                10744
            ],
            [
                10744,
                10780
            ],
            [
                10780,
                10807
            ],
            [
                10807,
                10998
            ],
            [
                10998,
                11048
            ],
            [
                11048,
                11059
            ],
            [
                11059,
                11071
            ],
            [
                11071,
                11083
            ],
            [
                11083,
                11132
            ],
            [
                11132,
                11162
            ],
            [
                11162,
                11282
            ],
            [
                11282,
                11521
            ],
            [
                11521,
                11560
            ],
            [
                11560,
                11901
            ],
            [
                11901,
                12004
            ],
            [
                12004,
                12036
            ],
            [
                12036,
                12121
            ],
            [
                12121,
                12185
            ],
            [
                12185,
                12217
            ],
            [
                12217,
                12283
            ],
            [
                12283,
                12288
            ],
            [
                12288,
                12312
            ],
            [
                12312,
                12384
            ],
            [
                12384,
                12622
            ],
            [
                12622,
                13045
            ],
            [
                13045,
                13113
            ],
            [
                13113,
                13149
            ],
            [
                13149,
                13372
            ],
            [
                13372,
                13401
            ],
            [
                13401,
                13414
            ],
            [
                13414,
                13486
            ],
            [
                13486,
                13559
            ],
            [
                13559,
                13611
            ],
            [
                13611,
                13726
            ],
            [
                13726,
                13739
            ],
            [
                13739,
                13844
            ],
            [
                13844,
                13863
            ],
            [
                13863,
                13908
            ],
            [
                13908,
                13943
            ],
            [
                13943,
                14174
            ],
            [
                14174,
                14244
            ],
            [
                14244,
                14261
            ],
            [
                14261,
                14424
            ],
            [
                14424,
                14488
            ],
            [
                14488,
                14615
            ],
            [
                14615,
                14641
            ],
            [
                14641,
                14745
            ],
            [
                14745,
                14773
            ],
            [
                14773,
                14905
            ],
            [
                14905,
                14918
            ],
            [
                14918,
                14930
            ],
            [
                14930,
                14956
            ],
            [
                14956,
                15026
            ],
            [
                15026,
                15043
            ],
            [
                15043,
                15055
            ],
            [
                15055,
                15123
            ],
            [
                15123,
                15342
            ],
            [
                15342,
                15374
            ],
            [
                15374,
                15643
            ],
            [
                15643,
                15661
            ],
            [
                15661,
                15834
            ],
            [
                15834,
                15845
            ]
        ]
    },
    "abridged": {
        "text": "The next afternoon Dr. Donaldson came to visit Mrs. Hale. Margaret was excluded from the room, though Dixon was admitted. Margaret was not a ready lover, but where she loved she loved passionately, and with no small degree of jealousy.\nShe paced up and down in the next room, awaiting the doctor's coming out. Every now and then she fancied she heard a moan. She clenched her hands tight, and held her breath. All was still for a few minutes more; and then there was the moving of chairs, and the raised voices of leave-taking.\nWhen she heard the door open, she went quickly to meet him.\n'My father is out with a pupil, Dr. Donaldson. May I trouble you to come into his room downstairs?'\nShe saw and triumphed over all the obstacles which Dixon threw in her way; assuming her position as daughter of the house with a conscious dignity, which gave her an instant's amusement in the midst of her anxiety. She knew, from the surprised expression on Dixon's face, how ridiculously grand she must be looking; and the idea carried her downstairs into the room. But then recollection of the actual business in hand seemed to take away her breath. It was a moment or two before she could speak.\n'What is the matter with mamma? Please tell the simple truth.' Seeing the doctor hesitate, she added, 'I am the only child she has here. My father is not alarmed, and if there is any serious cause for fear, it must be broken to him gently. I can do this. I can nurse my mother. Pray speak, sir.'\n'My dear young lady, your mother expressly desired that you might not be told.'\n'I am sure you are too wise - too experienced to have promised to keep the secret.'\n'Well,' said he, half-smiling, though sadly, 'there you are right. I did not promise. In fact, I fear the secret will be known soon enough without my revealing it.'\nHe paused. Margaret went very white. Dr. Donaldson saw that she would know if one iota of the truth was withheld; and that the withholding would be worse torture than the knowledge.\nHe spoke two short sentences in a low voice, watching her pupils dilate into a black horror. Then she said:\n'I thank you most truly, sir, for your confidence. That dread has haunted me for many weeks. My poor, poor mother!' Her lips began to quiver, and he let her have the relief of tears.\nShe shed only a few, before she recollected the many questions she longed to ask.\n'Will there be much suffering?'\nHe shook his head. 'That we cannot tell. It depends on a thousand things. But the discoveries of medical science have given us large power of alleviating pain.'\n'My father!' said Margaret, trembling.\n'I do not know Mr. Hale. But I should say, wait until the fact has become more familiar to you, so that you may be able to comfort your father. I will visit, although I fear I can do nothing but alleviate; and some symptoms will have awakened his alarm, so that he will be better prepared. My dear - I saw Mr. Thornton, and I honour your father for the sacrifice he has made. Remember, when I come again, I come as a friend. And you must learn to look upon me as such, because getting to know each other at such times as these, is worth years of morning calls.'\nMargaret could not speak for crying: but she wrung his hand at parting.\n'That's what I call a fine girl!' thought Dr. Donaldson, when he was in his carriage. 'What a queen she is! With her head thrown back at first, to force me into speaking the truth; and then bent so eagerly forward to listen. Poor thing! I must see she does not overstrain herself. Though that girl's game to the back-bone. No fainting or hysterics - not she! The very force of her will brought her round. Such a girl as that would win my heart, if I were thirty years younger. It's too late now. Ah! here we are.' So out he jumped, ready to attend fully to this next family, as if there were none other in the world.\nMeanwhile, Margaret had returned to her father's study to recover strength before going up to her mother.\n'Oh, my God, my God! but this is terrible. How shall I bear it? Such a deadly disease! no hope! Oh, mamma, I wish I had never been all those precious years away from you! Poor mamma! how much she must have borne! Oh, I pray thee, my God, that her sufferings may not be too dreadful. How shall I bear to see them? How can I bear papa's agony? He must not be told yet. It would kill him. But I won't lose another moment of my own dear, precious mother.'\nShe ran upstairs. Dixon was not in the room. Mrs. Hale lay back in an easy chair, with a soft white shawl wrapped around her. Her face had a little faint colour in it, and her very exhaustion gave it a peaceful look. Margaret was surprised to see her so calm.\n'Why, Margaret, how strange you look! What is the matter?' And then she added, as if a little displeased, 'You have not been seeing Dr. Donaldson, and asking him any questions, have you, child?'\nMargaret did not reply; only looked wistful. Mrs. Hale became more displeased. 'He would not, surely, break his word to me!'\n'Mamma, he did. I made him. Blame me.' She knelt down by her mother's side, and caught her hand. She would not let it go, though Mrs. Hale tried to pull it away. She kept kissing it, and shed hot tears.\n'Margaret, it was very wrong of you. You knew I did not wish you to know.' But she left her hand in Margaret's clasp.\n'Oh, mamma! let me be your nurse. I will learn anything Dixon can teach me.'\n'You don't know what you are asking,' said Mrs. Hale, with a shudder.\n'Yes, I do. I know a great deal more than you are aware of. Let me be your nurse. Let me try, at any rate. It will be such a comfort, mamma.'\n'My poor child! Well, you shall try. Do you know, Margaret, Dixon and I thought you would quite shrink from me if you knew-'\n'Dixon thought!' said Margaret, her lip curling. 'Dixon could not give me credit for as much love as herself! She thought, I suppose, that I was one of those poor women who like to lie on rose leaves, and be fanned all day. Don't let Dixon's fancies come any more between you and me, mamma!'\n'Don't be angry with Dixon,' said Mrs. Hale anxiously.\n'No! I won't. I will try and learn her ways, if you will only let me do all I can for you. I used to fancy you would forget me while I was away at aunt Shaw's, and cry myself to sleep at nights.'\n'And I used to think, how will Margaret bear our poverty after the luxury in Harley Street? - till I have been more ashamed of your seeing our contrivances at Helstone than of any stranger finding them out.'\n'Oh, mamma! and I did so enjoy them. The wardrobe shelf with handles, that served as a supper-tray on grand occasions! And the old tea-chests stuffed and covered for ottomans! I think the contrivances at dear Helstone were charming.'\n'I shall never see Helstone again, Margaret,' said Mrs. Hale, the tears welling up into her eyes. 'While I was there, I was for ever wanting to leave. And now I shall die far away from it. I am rightly punished.'\n'You must not talk so,' said Margaret. 'He said you might live for years. Oh, mother! we will have you back at Helstone yet.'\n'No, never! But, Margaret - Frederick!' She suddenly cried out loud, as in some sharp agony; the thought of him upset all her calm composure. There came wild passionate cry after cry - 'Frederick! Frederick! Come to me. I am dying. Little first-born child, come to me once again!'\nShe was in violent hysterics. In terror, Margaret went and called Dixon, who came in a huff, and accused Margaret of over-exciting her mother.\nMargaret bore all meekly, and obeyed Dixon's directions promptly and well, without a word of self-justification. By so doing she mollified her accuser. They put her mother to bed, and Margaret sat by her till she fell asleep. Then Dixon beckoned her out of the room, and with a sour face bade her drink a cup of coffee in the drawing-room, standing over her as she did so.\n'You shouldn't have been so curious, Miss, and then you wouldn't have needed to fret. And now, I suppose, you'll tell master, and a pretty household I shall have!'\n'No, Dixon,' said Margaret sorrowfully, 'I will not tell papa. He could not bear it as I can.' And to prove how well she bore it, she burst into tears.\n'Ay! I knew how it would be. Now you'll waken your mamma again. Miss Margaret, my dear, I've had to keep it down this many a week; and though I don't pretend I can love her as you do, yet I've loved her better than any other but Master Frederick. Ever since Lady Beresford's maid first took me in to see her, and I ran a needle into my finger, and she tore up her pocket-handkerchief for bandages, I've never loved anyone like her. I little thought then that I should live to see her brought so low. I don't mean no reproach to nobody. Many a one calls you pretty and handsome, and what not, but you'll never be like your mother for beauty, not if you live to be a hundred.'\n'Mamma is very pretty still. Poor mamma!'\n'Now don't set off again. Go out and take a walk, and come in something like. Many's the time I've longed to walk it off - the thought of her illness, and how it must all end.'\n'Oh, Dixon!' said Margaret, 'how often I've been cross with you, not knowing what a terrible secret you had to bear! I'll try not to be cross again.'\n'Yet when you fire up, you're the very image of Master Frederick. I'd put you in a passion any day, just to see his stormy look coming like a great cloud over your face. But now you go out, Miss. I'll watch over missus.'\n'I will go,' said Margaret. She hung about for a minute, irresolute; then suddenly kissing Dixon, she went quickly out of the room.\n'Bless her!' said Dixon. 'There are three people I love: missus, Master Frederick, and her. Just them three. The rest be hanged - I don't know what they're in the world for. Master should ha' made more of her, and not been always reading, reading, thinking, thinking. See what it has brought him to! Many a one who never reads nor thinks gets to be Rector, and Dean, and what not; and I dare say master might, if he'd just minded missus, and let the weary reading and thinking alone. There she goes' (as she heard the front door shut). 'Poor young lady! her clothes look so shabby. When she came to Helstone a year ago, she hadn't a darned stocking in all her wardrobe. And now-!'",
        "paragraph_chars": [
            [
                0,
                236
            ],
            [
                236,
                528
            ],
            [
                528,
                588
            ],
            [
                588,
                688
            ],
            [
                688,
                1187
            ],
            [
                1187,
                1483
            ],
            [
                1483,
                1563
            ],
            [
                1563,
                1647
            ],
            [
                1647,
                1812
            ],
            [
                1812,
                1994
            ],
            [
                1994,
                2102
            ],
            [
                2102,
                2285
            ],
            [
                2285,
                2367
            ],
            [
                2367,
                2399
            ],
            [
                2399,
                2560
            ],
            [
                2560,
                2599
            ],
            [
                2599,
                3161
            ],
            [
                3161,
                3233
            ],
            [
                3233,
                3850
            ],
            [
                3850,
                3956
            ],
            [
                3956,
                4408
            ],
            [
                4408,
                4668
            ],
            [
                4668,
                4863
            ],
            [
                4863,
                4988
            ],
            [
                4988,
                5191
            ],
            [
                5191,
                5309
            ],
            [
                5309,
                5386
            ],
            [
                5386,
                5456
            ],
            [
                5456,
                5598
            ],
            [
                5598,
                5723
            ],
            [
                5723,
                6015
            ],
            [
                6015,
                6070
            ],
            [
                6070,
                6266
            ],
            [
                6266,
                6474
            ],
            [
                6474,
                6708
            ],
            [
                6708,
                6921
            ],
            [
                6921,
                7047
            ],
            [
                7047,
                7328
            ],
            [
                7328,
                7471
            ],
            [
                7471,
                7844
            ],
            [
                7844,
                8008
            ],
            [
                8008,
                8160
            ],
            [
                8160,
                8835
            ],
            [
                8835,
                8877
            ],
            [
                8877,
                9054
            ],
            [
                9054,
                9204
            ],
            [
                9204,
                9425
            ],
            [
                9425,
                9557
            ],
            [
                9557,
                10237
            ]
        ],
        "segment_chars": [
            [
                0,
                58
            ],
            [
                58,
                122
            ],
            [
                122,
                236
            ],
            [
                236,
                310
            ],
            [
                310,
                359
            ],
            [
                359,
                410
            ],
            [
                410,
                528
            ],
            [
                528,
                588
            ],
            [
                588,
                635
            ],
            [
                635,
                688
            ],
            [
                688,
                903
            ],
            [
                903,
                1055
            ],
            [
                1055,
                1140
            ],
            [
                1140,
                1187
            ],
            [
                1187,
                1219
            ],
            [
                1219,
                1250
            ],
            [
                1250,
                1324
            ],
            [
                1324,
                1427
            ],
            [
                1427,
                1442
            ],
            [
                1442,
                1465
            ],
            [
                1465,
                1483
            ],
            [
                1483,
                1563
            ],
            [
                1563,
                1647
            ],
            [
                1647,
                1714
            ],
            [
                1714,
                1733
            ],
            [
                1733,
                1812
            ],
            [
                1812,
                1823
            ],
            [
                1823,
                1849
            ],
            [
                1849,
                1994
            ],
            [
                1994,
                2087
            ],
            [
                2087,
                2102
            ],
            [
                2102,
                2153
            ],
            [
                2153,
                2195
            ],
            [
                2195,
                2218
            ],
            [
                2218,
                2285
            ],
            [
                2285,
                2367
            ],
            [
                2367,
                2399
            ],
            [
                2399,
                2418
            ],
            [
                2418,
                2440
            ],
            [
                2440,
                2473
            ],
            [
                2473,
                2560
            ],
            [
                2560,
                2573
            ],
            [
                2573,
                2599
            ],
            [
                2599,
                2624
            ],
            [
                2624,
                2743
            ],
            [
                2743,
                2889
            ],
            [
                2889,
                2975
            ],
            [
                2975,
                3024
            ],
            [
                3024,
                3161
            ],
            [
                3161,
                3233
            ],
            [
                3233,
                3267
            ],
            [
                3267,
                3319
            ],
            [
                3319,
                3341
            ],
            [
                3341,
                3458
            ],
            [
                3458,
                3470
            ],
            [
                3470,
                3514
            ],
            [
                3514,
                3556
            ],
            [
                3556,
                3592
            ],
            [
                3592,
                3638
            ],
            [
                3638,
                3710
            ],
            [
                3710,
                3729
            ],
            [
                3729,
                3733
            ],
            [
                3733,
                3747
            ],
            [
                3747,
                3850
            ],
            [
                3850,
                3956
            ],
            [
                3956,
                3977
            ],
            [
                3977,
                3999
            ],
            [
                3999,
                4020
            ],
            [
                4020,
                4043
            ],
            [
                4043,
                4052
            ],
            [
                4052,
                4127
            ],
            [
                4127,
                4139
            ],
            [
                4139,
                4169
            ],
            [
                4169,
                4239
            ],
            [
                4239,
                4269
            ],
            [
                4269,
                4298
            ],
            [
                4298,
                4323
            ],
            [
                4323,
                4342
            ],
            [
                4342,
                4408
            ],
            [
                4408,
                4426
            ],
            [
                4426,
                4453
            ],
            [
                4453,
                4534
            ],
            [
                4534,
                4625
            ],
            [
                4625,
                4668
            ],
            [
                4668,
                4706
            ],
            [
                4706,
                4727
            ],
            [
                4727,
                4863
            ],
            [
                4863,
                4908
            ],
            [
                4908,
                4942
            ],
            [
                4942,
                4988
            ],
            [
                4988,
                5004
            ],
            [
                5004,
                5016
            ],
            [
                5016,
                5027
            ],
            [
                5027,
                5085
            ],
            [
                5085,
                5150
            ],
            [
                5150,
                5191
            ],
            [
                5191,
                5228
            ],
            [
                5228,
                5266
            ],
            [
                5266,
                5309
            ],
            [
                5309,
                5321
            ],
            [
                5321,
                5343
            ],
            [
                5343,
                5386
            ],
            [
                5386,
                5456
            ],
            [
                5456,
                5468
            ],
            [
                5468,
                5516
            ],
            [
                5516,
                5538
            ],
            [
                5538,
                5563
            ],
            [
                5563,
                5598
            ],
            [
                5598,
                5614
            ],
            [
                5614,
                5635
            ],
            [
                5635,
                5723
            ],
            [
                5723,
                5740
            ],
            [
                5740,
                5772
            ],
            [
                5772,
                5833
            ],
            [
                5833,
                5947
            ],
            [
                5947,
                6015
            ],
            [
                6015,
                6070
            ],
            [
                6070,
                6075
            ],
            [
                6075,
                6084
            ],
            [
                6084,
                6161
            ],
            [
                6161,
                6266
            ],
            [
                6266,
                6358
            ],
            [
                6358,
                6474
            ],
            [
                6474,
                6486
            ],
            [
                6486,
                6511
            ],
            [
                6511,
                6593
            ],
            [
                6593,
                6650
            ],
            [
                6650,
                6708
            ],
            [
                6708,
                6806
            ],
            [
                6806,
                6859
            ],
            [
                6859,
                6897
            ],
            [
                6897,
                6921
            ],
            [
                6921,
                6960
            ],
            [
                6960,
                6995
            ],
            [
                6995,
                7007
            ],
            [
                7007,
                7047
            ],
            [
                7047,
                7059
            ],
            [
                7059,
                7087
            ],
            [
                7087,
                7189
            ],
            [
                7189,
                7244
            ],
            [
                7244,
                7255
            ],
            [
                7255,
                7267
            ],
            [
                7267,
                7279
            ],
            [
                7279,
                7328
            ],
            [
                7328,
                7358
            ],
            [
                7358,
                7471
            ],
            [
                7471,
                7584
            ],
            [
                7584,
                7623
            ],
            [
                7623,
                7697
            ],
            [
                7697,
                7844
            ],
            [
                7844,
                7930
            ],
            [
                7930,
                8008
            ],
            [
                8008,
                8071
            ],
            [
                8071,
                8103
            ],
            [
                8103,
                8160
            ],
            [
                8160,
                8165
            ],
            [
                8165,
                8189
            ],
            [
                8189,
                8224
            ],
            [
                8224,
                8407
            ],
            [
                8407,
                8592
            ],
            [
                8592,
                8660
            ],
            [
                8660,
                8696
            ],
            [
                8696,
                8835
            ],
            [
                8835,
                8864
            ],
            [
                8864,
                8877
            ],
            [
                8877,
                8903
            ],
            [
                8903,
                8955
            ],
            [
                8955,
                9054
            ],
            [
                9054,
                9067
            ],
            [
                9067,
                9171
            ],
            [
                9171,
                9204
            ],
            [
                9204,
                9270
            ],
            [
                9270,
                9374
            ],
            [
                9374,
                9400
            ],
            [
                9400,
                9425
            ],
            [
                9425,
                9453
            ],
            [
                9453,
                9557
            ],
            [
                9557,
                9570
            ],
            [
                9570,
                9582
            ],
            [
                9582,
                9649
            ],
            [
                9649,
                9666
            ],
            [
                9666,
                9731
            ],
            [
                9731,
                9825
            ],
            [
                9825,
                9857
            ],
            [
                9857,
                10041
            ],
            [
                10041,
                10093
            ],
            [
                10093,
                10111
            ],
            [
                10111,
                10139
            ],
            [
                10139,
                10227
            ],
            [
                10227,
                10237
            ]
        ],
        "overlap_chars": [
            [
                0,
                40
            ],
            [
                41,
                46
            ],
            [
                47,
                58
            ],
            [
                58,
                66
            ],
            [
                67,
                94
            ],
            [
                102,
                122
            ],
            [
                122,
                236
            ],
            [
                236,
                239
            ],
            [
                240,
                245
            ],
            [
                246,
                257
            ],
            [
                261,
                264
            ],
            [
                270,
                275
            ],
            [
                276,
                310
            ],
            [
                310,
                328
            ],
            [
                329,
                359
            ],
            [
                359,
                410
            ],
            [
                410,
                488
            ],
            [
                493,
                510
            ],
            [
                511,
                528
            ],
            [
                528,
                574
            ],
            [
                586,
                588
            ],
            [
                592,
                601
            ],
            [
                611,
                618
            ],
            [
                618,
                633
            ],
            [
                633,
                635
            ],
            [
                635,
                685
            ],
            [
                688,
                695
            ],
            [
                696,
                775
            ],
            [
                776,
                809
            ],
            [
                817,
                826
            ],
            [
                827,
                834
            ],
            [
                834,
                841
            ],
            [
                842,
                903
            ],
            [
                903,
                986
            ],
            [
                987,
                1053
            ],
            [
                1053,
                1054
            ],
            [
                1064,
                1107
            ],
            [
                1108,
                1140
            ],
            [
                1140,
                1179
            ],
            [
                1185,
                1187
            ],
            [
                1188,
                1219
            ],
            [
                1231,
                1247
            ],
            [
                1250,
                1256
            ],
            [
                1257,
                1267
            ],
            [
                1276,
                1287
            ],
            [
                1287,
                1288
            ],
            [
                1290,
                1317
            ],
            [
                1318,
                1322
            ],
            [
                1322,
                1324
            ],
            [
                1324,
                1340
            ],
            [
                1341,
                1349
            ],
            [
                1350,
                1353
            ],
            [
                1354,
                1377
            ],
            [
                1388,
                1392
            ],
            [
                1392,
                1427
            ],
            [
                1427,
                1442
            ],
            [
                1442,
                1465
            ],
            [
                1465,
                1469
            ],
            [
                1470,
                1480
            ],
            [
                1487,
                1515
            ],
            [
                1516,
                1560
            ],
            [
                1564,
                1573
            ],
            [
                1574,
                1590
            ],
            [
                1593,
                1644
            ],
            [
                1648,
                1652
            ],
            [
                1655,
                1690
            ],
            [
                1690,
                1691
            ],
            [
                1693,
                1714
            ],
            [
                1714,
                1733
            ],
            [
                1733,
                1748
            ],
            [
                1749,
                1809
            ],
            [
                1812,
                1823
            ],
            [
                1823,
                1831
            ],
            [
                1832,
                1847
            ],
            [
                1847,
                1849
            ],
            [
                1849,
                1862
            ],
            [
                1863,
                1866
            ],
            [
                1867,
                1898
            ],
            [
                1899,
                1901
            ],
            [
                1902,
                1905
            ],
            [
                1906,
                1911
            ],
            [
                1912,
                1959
            ],
            [
                1966,
                1973
            ],
            [
                1974,
                1992
            ],
            [
                1992,
                1993
            ],
            [
                1994,
                2051
            ],
            [
                2052,
                2058
            ],
            [
                2059,
                2062
            ],
            [
                2066,
                2085
            ],
            [
                2085,
                2087
            ],
            [
                2087,
                2101
            ],
            [
                2103,
                2153
            ],
            [
                2153,
                2195
            ],
            [
                2195,
                2215
            ],
            [
                2218,
                2226
            ],
            [
                2227,
                2283
            ],
            [
                2283,
                2285
            ],
            [
                2285,
                2293
            ],
            [
                2299,
                2304
            ],
            [
                2304,
                2367
            ],
            [
                2368,
                2396
            ],
            [
                2399,
                2418
            ],
            [
                2424,
                2440
            ],
            [
                2440,
                2450
            ],
            [
                2451,
                2473
            ],
            [
                2473,
                2480
            ],
            [
                2481,
                2546
            ],
            [
                2564,
                2570
            ],
            [
                2573,
                2597
            ],
            [
                2597,
                2599
            ],
            [
                2600,
                2624
            ],
            [
                2624,
                2641
            ],
            [
                2653,
                2661
            ],
            [
                2662,
                2672
            ],
            [
                2678,
                2710
            ],
            [
                2711,
                2721
            ],
            [
                2722,
                2729
            ],
            [
                2730,
                2743
            ],
            [
                2743,
                2744
            ],
            [
                2745,
                2749
            ],
            [
                2755,
                2803
            ],
            [
                2823,
                2832
            ],
            [
                2842,
                2852
            ],
            [
                2853,
                2871
            ],
            [
                2872,
                2887
            ],
            [
                2889,
                2896
            ],
            [
                2899,
                2973
            ],
            [
                2973,
                2975
            ],
            [
                2975,
                3024
            ],
            [
                3024,
                3075
            ],
            [
                3076,
                3158
            ],
            [
                3161,
                3196
            ],
            [
                3198,
                3208
            ],
            [
                3212,
                3233
            ],
            [
                3238,
                3264
            ],
            [
                3267,
                3301
            ],
            [
                3302,
                3317
            ],
            [
                3317,
                3319
            ],
            [
                3320,
                3341
            ],
            [
                3341,
                3458
            ],
            [
                3458,
                3470
            ],
            [
                3470,
                3514
            ],
            [
                3514,
                3520
            ],
            [
                3521,
                3556
            ],
            [
                3559,
                3580
            ],
            [
                3583,
                3592
            ],
            [
                3592,
                3638
            ],
            [
                3638,
                3710
            ],
            [
                3710,
                3729
            ],
            [
                3729,
                3731
            ],
            [
                3733,
                3744
            ],
            [
                3747,
                3764
            ],
            [
                3765,
                3780
            ],
            [
                3787,
                3789
            ],
            [
                3790,
                3794
            ],
            [
                3800,
                3807
            ],
            [
                3808,
                3850
            ],
            [
                3850,
                3882
            ],
            [
                3886,
                3904
            ],
            [
                3905,
                3937
            ],
            [
                3944,
                3954
            ],
            [
                3954,
                3956
            ],
            [
                3957,
                3977
            ],
            [
                3977,
                3999
            ],
            [
                3999,
                4020
            ],
            [
                4020,
                4043
            ],
            [
                4043,
                4052
            ],
            [
                4052,
                4054
            ],
            [
                4054,
                4081
            ],
            [
                4082,
                4127
            ],
            [
                4127,
                4139
            ],
            [
                4139,
                4169
            ],
            [
                4169,
                4172
            ],
            [
                4175,
                4228
            ],
            [
                4229,
                4239
            ],
            [
                4239,
                4269
            ],
            [
                4269,
                4298
            ],
            [
                4298,
                4321
            ],
            [
                4321,
                4323
            ],
            [
                4323,
                4342
            ],
            [
                4342,
                4405
            ],
            [
                4408,
                4426
            ],
            [
                4426,
                4453
            ],
            [
                4453,
                4532
            ],
            [
                4532,
                4534
            ],
            [
                4534,
                4579
            ],
            [
                4584,
                4599
            ],
            [
                4600,
                4625
            ],
            [
                4625,
                4658
            ],
            [
                4659,
                4668
            ],
            [
                4669,
                4706
            ],
            [
                4706,
                4724
            ],
            [
                4727,
                4735
            ],
            [
                4736,
                4772
            ],
            [
                4772,
                4773
            ],
            [
                4775,
                4843
            ],
            [
                4843,
                4844
            ],
            [
                4845,
                4853
            ],
            [
                4855,
                4860
            ],
            [
                4863,
                4885
            ],
            [
                4887,
                4903
            ],
            [
                4906,
                4908
            ],
            [
                4908,
                4942
            ],
            [
                4943,
                4955
            ],
            [
                4955,
                4956
            ],
            [
                4957,
                4963
            ],
            [
                4965,
                4985
            ],
            [
                4990,
                5004
            ],
            [
                5004,
                5016
            ],
            [
                5016,
                5024
            ],
            [
                5027,
                5083
            ],
            [
                5085,
                5150
            ],
            [
                5150,
                5174
            ],
            [
                5175,
                5179
            ],
            [
                5180,
                5189
            ],
            [
                5189,
                5191
            ],
            [
                5196,
                5228
            ],
            [
                5228,
                5263
            ],
            [
                5266,
                5269
            ],
            [
                5270,
                5307
            ],
            [
                5307,
                5308
            ],
            [
                5310,
                5321
            ],
            [
                5321,
                5343
            ],
            [
                5343,
                5383
            ],
            [
                5387,
                5421
            ],
            [
                5424,
                5456
            ],
            [
                5457,
                5468
            ],
            [
                5468,
                5516
            ],
            [
                5516,
                5538
            ],
            [
                5538,
                5563
            ],
            [
                5563,
                5595
            ],
            [
                5602,
                5614
            ],
            [
                5614,
                5635
            ],
            [
                5635,
                5720
            ],
            [
                5725,
                5737
            ],
            [
                5740,
                5772
            ],
            [
                5774,
                5807
            ],
            [
                5808,
                5815
            ],
            [
                5816,
                5820
            ],
            [
                5821,
                5833
            ],
            [
                5833,
                5885
            ],
            [
                5886,
                5947
            ],
            [
                5947,
                6012
            ],
            [
                6019,
                6041
            ],
            [
                6044,
                6058
            ],
            [
                6059,
                6069
            ],
            [
                6071,
                6075
            ],
            [
                6075,
                6084
            ],
            [
                6084,
                6094
            ],
            [
                6095,
                6161
            ],
            [
                6161,
                6263
            ],
            [
                6267,
                6314
            ],
            [
                6315,
                6332
            ],
            [
                6333,
                6356
            ],
            [
                6358,
                6359
            ],
            [
                6360,
                6371
            ],
            [
                6372,
                6471
            ],
            [
                6475,
                6486
            ],
            [
                6486,
                6511
            ],
            [
                6511,
                6542
            ],
            [
                6544,
                6593
            ],
            [
                6593,
                6650
            ],
            [
                6650,
                6657
            ],
            [
                6658,
                6661
            ],
            [
                6662,
                6696
            ],
            [
                6697,
                6705
            ],
            [
                6709,
                6751
            ],
            [
                6754,
                6806
            ],
            [
                6807,
                6857
            ],
            [
                6857,
                6859
            ],
            [
                6859,
                6897
            ],
            [
                6897,
                6918
            ],
            [
                6922,
                6942
            ],
            [
                6945,
                6958
            ],
            [
                6958,
                6960
            ],
            [
                6961,
                6995
            ],
            [
                6995,
                7007
            ],
            [
                7007,
                7044
            ],
            [
                7048,
                7059
            ],
            [
                7059,
                7072
            ],
            [
                7079,
                7084
            ],
            [
                7087,
                7138
            ],
            [
                7140,
                7172
            ],
            [
                7173,
                7177
            ],
            [
                7178,
                7187
            ],
            [
                7187,
                7189
            ],
            [
                7200,
                7219
            ],
            [
                7226,
                7229
            ],
            [
                7233,
                7244
            ],
            [
                7244,
                7255
            ],
            [
                7255,
                7267
            ],
            [
                7267,
                7279
            ],
            [
                7279,
                7325
            ],
            [
                7328,
                7358
            ],
            [
                7358,
                7367
            ],
            [
                7369,
                7399
            ],
            [
                7405,
                7444
            ],
            [
                7445,
                7453
            ],
            [
                7459,
                7470
            ],
            [
                7471,
                7496
            ],
            [
                7501,
                7507
            ],
            [
                7508,
                7544
            ],
            [
                7544,
                7545
            ],
            [
                7546,
                7584
            ],
            [
                7584,
                7623
            ],
            [
                7623,
                7663
            ],
            [
                7668,
                7695
            ],
            [
                7702,
                7741
            ],
            [
                7742,
                7758
            ],
            [
                7759,
                7789
            ],
            [
                7790,
                7810
            ],
            [
                7820,
                7828
            ],
            [
                7829,
                7844
            ],
            [
                7845,
                7928
            ],
            [
                7928,
                7930
            ],
            [
                7930,
                8005
            ],
            [
                8009,
                8018
            ],
            [
                8021,
                8034
            ],
            [
                8035,
                8047
            ],
            [
                8049,
                8071
            ],
            [
                8071,
                8100
            ],
            [
                8103,
                8106
            ],
            [
                8116,
                8160
            ],
            [
                8161,
                8165
            ],
            [
                8165,
                8189
            ],
            [
                8189,
                8216
            ],
            [
                8222,
                8224
            ],
            [
                8224,
                8237
            ],
            [
                8237,
                8238
            ],
            [
                8239,
                8289
            ],
            [
                8291,
                8349
            ],
            [
                8353,
                8384
            ],
            [
                8385,
                8405
            ],
            [
                8405,
                8407
            ],
            [
                8407,
                8467
            ],
            [
                8467,
                8487
            ],
            [
                8488,
                8502
            ],
            [
                8502,
                8523
            ],
            [
                8524,
                8543
            ],
            [
                8548,
                8556
            ],
            [
                8556,
                8557
            ],
            [
                8558,
                8574
            ],
            [
                8582,
                8592
            ],
            [
                8592,
                8660
            ],
            [
                8660,
                8696
            ],
            [
                8696,
                8750
            ],
            [
                8750,
                8751
            ],
            [
                8752,
                8799
            ],
            [
                8799,
                8800
            ],
            [
                8801,
                8832
            ],
            [
                8837,
                8864
            ],
            [
                8864,
                8874
            ],
            [
                8878,
                8887
            ],
            [
                8888,
                8901
            ],
            [
                8903,
                8955
            ],
            [
                8955,
                8997
            ],
            [
                9000,
                9014
            ],
            [
                9015,
                9018
            ],
            [
                9026,
                9051
            ],
            [
                9055,
                9064
            ],
            [
                9067,
                9081
            ],
            [
                9083,
                9169
            ],
            [
                9171,
                9201
            ],
            [
                9209,
                9225
            ],
            [
                9227,
                9270
            ],
            [
                9270,
                9271
            ],
            [
                9274,
                9302
            ],
            [
                9304,
                9374
            ],
            [
                9374,
                9400
            ],
            [
                9400,
                9422
            ],
            [
                9426,
                9435
            ],
            [
                9438,
                9453
            ],
            [
                9453,
                9467
            ],
            [
                9468,
                9480
            ],
            [
                9480,
                9481
            ],
            [
                9482,
                9498
            ],
            [
                9499,
                9515
            ],
            [
                9516,
                9521
            ],
            [
                9521,
                9557
            ],
            [
                9558,
                9567
            ],
            [
                9570,
                9582
            ],
            [
                9589,
                9612
            ],
            [
                9614,
                9649
            ],
            [
                9649,
                9666
            ],
            [
                9666,
                9684
            ],
            [
                9687,
                9731
            ],
            [
                9731,
                9737
            ],
            [
                9738,
                9753
            ],
            [
                9754,
                9758
            ],
            [
                9762,
                9825
            ],
            [
                9825,
                9855
            ],
            [
                9857,
                9883
            ],
            [
                9888,
                9894
            ],
            [
                9895,
                9943
            ],
            [
                9953,
                10039
            ],
            [
                10041,
                10055
            ],
            [
                10057,
                10058
            ],
            [
                10058,
                10093
            ],
            [
                10094,
                10111
            ],
            [
                10111,
                10127
            ],
            [
                10128,
                10130
            ],
            [
                10131,
                10137
            ],
            [
                10137,
                10138
            ],
            [
                10139,
                10175
            ],
            [
                10177,
                10187
            ],
            [
                10188,
                10205
            ],
            [
                10206,
                10227
            ],
            [
                10227,
                10234
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                58
            ],
            [
                58,
                122
            ],
            [
                122,
                236
            ],
            [
                236,
                310
            ],
            [
                310,
                359
            ],
            [
                359,
                410
            ],
            [
                410,
                410
            ],
            [
                410,
                528
            ],
            [
                528,
                588
            ],
            [
                588,
                635
            ],
            [
                635,
                688
            ],
            [
                688,
                903
            ],
            [
                903,
                1140
            ],
            [
                1140,
                1187
            ],
            [
                1187,
                1187
            ],
            [
                1187,
                1219
            ],
            [
                1219,
                1250
            ],
            [
                1250,
                1324
            ],
            [
                1324,
                1427
            ],
            [
                1427,
                1442
            ],
            [
                1442,
                1465
            ],
            [
                1465,
                1483
            ],
            [
                1483,
                1563
            ],
            [
                1563,
                1563
            ],
            [
                1563,
                1647
            ],
            [
                1647,
                1714
            ],
            [
                1714,
                1733
            ],
            [
                1733,
                1812
            ],
            [
                1812,
                1823
            ],
            [
                1823,
                1849
            ],
            [
                1849,
                1849
            ],
            [
                1849,
                1994
            ],
            [
                1994,
                2087
            ],
            [
                2087,
                2087
            ],
            [
                2087,
                2087
            ],
            [
                2087,
                2102
            ],
            [
                2102,
                2153
            ],
            [
                2153,
                2195
            ],
            [
                2195,
                2195
            ],
            [
                2195,
                2218
            ],
            [
                2218,
                2285
            ],
            [
                2285,
                2367
            ],
            [
                2367,
                2399
            ],
            [
                2399,
                2418
            ],
            [
                2418,
                2440
            ],
            [
                2440,
                2473
            ],
            [
                2473,
                2560
            ],
            [
                2560,
                2573
            ],
            [
                2573,
                2599
            ],
            [
                2599,
                2624
            ],
            [
                2624,
                2624
            ],
            [
                2624,
                2743
            ],
            [
                2743,
                2975
            ],
            [
                2975,
                3024
            ],
            [
                3024,
                3161
            ],
            [
                3161,
                3233
            ],
            [
                3233,
                3267
            ],
            [
                3267,
                3319
            ],
            [
                3319,
                3319
            ],
            [
                3319,
                3319
            ],
            [
                3319,
                3341
            ],
            [
                3341,
                3458
            ],
            [
                3458,
                3470
            ],
            [
                3470,
                3514
            ],
            [
                3514,
                3556
            ],
            [
                3556,
                3592
            ],
            [
                3592,
                3638
            ],
            [
                3638,
                3710
            ],
            [
                3710,
                3729
            ],
            [
                3729,
                3747
            ],
            [
                3747,
                3850
            ],
            [
                3850,
                3956
            ],
            [
                3956,
                3977
            ],
            [
                3977,
                3999
            ],
            [
                3999,
                4020
            ],
            [
                4020,
                4043
            ],
            [
                4043,
                4052
            ],
            [
                4052,
                4127
            ],
            [
                4127,
                4139
            ],
            [
                4139,
                4169
            ],
            [
                4169,
                4239
            ],
            [
                4239,
                4269
            ],
            [
                4269,
                4298
            ],
            [
                4298,
                4323
            ],
            [
                4323,
                4342
            ],
            [
                4342,
                4408
            ],
            [
                4408,
                4426
            ],
            [
                4426,
                4453
            ],
            [
                4453,
                4534
            ],
            [
                4534,
                4625
            ],
            [
                4625,
                4668
            ],
            [
                4668,
                4706
            ],
            [
                4706,
                4727
            ],
            [
                4727,
                4863
            ],
            [
                4863,
                4908
            ],
            [
                4908,
                4942
            ],
            [
                4942,
                4988
            ],
            [
                4988,
                5004
            ],
            [
                5004,
                5016
            ],
            [
                5016,
                5027
            ],
            [
                5027,
                5150
            ],
            [
                5150,
                5191
            ],
            [
                5191,
                5228
            ],
            [
                5228,
                5266
            ],
            [
                5266,
                5309
            ],
            [
                5309,
                5309
            ],
            [
                5309,
                5321
            ],
            [
                5321,
                5343
            ],
            [
                5343,
                5386
            ],
            [
                5386,
                5386
            ],
            [
                5386,
                5456
            ],
            [
                5456,
                5468
            ],
            [
                5468,
                5516
            ],
            [
                5516,
                5538
            ],
            [
                5538,
                5563
            ],
            [
                5563,
                5563
            ],
            [
                5563,
                5598
            ],
            [
                5598,
                5614
            ],
            [
                5614,
                5635
            ],
            [
                5635,
                5723
            ],
            [
                5723,
                5740
            ],
            [
                5740,
                5772
            ],
            [
                5772,
                5833
            ],
            [
                5833,
                5947
            ],
            [
                5947,
                6015
            ],
            [
                6015,
                6015
            ],
            [
                6015,
                6015
            ],
            [
                6015,
                6070
            ],
            [
                6070,
                6070
            ],
            [
                6070,
                6075
            ],
            [
                6075,
                6084
            ],
            [
                6084,
                6161
            ],
            [
                6161,
                6161
            ],
            [
                6161,
                6266
            ],
            [
                6266,
                6474
            ],
            [
                6474,
                6486
            ],
            [
                6486,
                6511
            ],
            [
                6511,
                6511
            ],
            [
                6511,
                6593
            ],
            [
                6593,
                6650
            ],
            [
                6650,
                6708
            ],
            [
                6708,
                6806
            ],
            [
                6806,
                6806
            ],
            [
                6806,
                6806
            ],
            [
                6806,
                6859
            ],
            [
                6859,
                6859
            ],
            [
                6859,
                6897
            ],
            [
                6897,
                6921
            ],
            [
                6921,
                6960
            ],
            [
                6960,
                6995
            ],
            [
                6995,
                7007
            ],
            [
                7007,
                7047
            ],
            [
                7047,
                7059
            ],
            [
                7059,
                7059
            ],
            [
                7059,
                7087
            ],
            [
                7087,
                7189
            ],
            [
                7189,
                7244
            ],
            [
                7244,
                7255
            ],
            [
                7255,
                7267
            ],
            [
                7267,
                7279
            ],
            [
                7279,
                7328
            ],
            [
                7328,
                7358
            ],
            [
                7358,
                7471
            ],
            [
                7471,
                7584
            ],
            [
                7584,
                7623
            ],
            [
                7623,
                7844
            ],
            [
                7844,
                7930
            ],
            [
                7930,
                7930
            ],
            [
                7930,
                8008
            ],
            [
                8008,
                8071
            ],
            [
                8071,
                8103
            ],
            [
                8103,
                8160
            ],
            [
                8160,
                8165
            ],
            [
                8165,
                8189
            ],
            [
                8189,
                8224
            ],
            [
                8224,
                8407
            ],
            [
                8407,
                8592
            ],
            [
                8592,
                8660
            ],
            [
                8660,
                8696
            ],
            [
                8696,
                8835
            ],
            [
                8835,
                8864
            ],
            [
                8864,
                8877
            ],
            [
                8877,
                8903
            ],
            [
                8903,
                8903
            ],
            [
                8903,
                8955
            ],
            [
                8955,
                9054
            ],
            [
                9054,
                9067
            ],
            [
                9067,
                9171
            ],
            [
                9171,
                9171
            ],
            [
                9171,
                9171
            ],
            [
                9171,
                9171
            ],
            [
                9171,
                9171
            ],
            [
                9171,
                9204
            ],
            [
                9204,
                9204
            ],
            [
                9204,
                9204
            ],
            [
                9204,
                9270
            ],
            [
                9270,
                9374
            ],
            [
                9374,
                9400
            ],
            [
                9400,
                9425
            ],
            [
                9425,
                9453
            ],
            [
                9453,
                9557
            ],
            [
                9557,
                9570
            ],
            [
                9570,
                9582
            ],
            [
                9582,
                9582
            ],
            [
                9582,
                9649
            ],
            [
                9649,
                9666
            ],
            [
                9666,
                9666
            ],
            [
                9666,
                9731
            ],
            [
                9731,
                9825
            ],
            [
                9825,
                9857
            ],
            [
                9857,
                10093
            ],
            [
                10093,
                10111
            ],
            [
                10111,
                10227
            ],
            [
                10227,
                10237
            ]
        ]
    }
}