{
    "original": {
        "text": "\"There are briars besetting every path, Which call for patient care; There is a cross in every lot, And an earnest need for prayer.\" ANON.\nMargaret went out heavily and unwillingly enough. But the length of a street--yes, the air of a Milton Street--cheered her young blood before she reached her first turning. Her step grew lighter, her lip redder. She began to take notice, instead of having her thoughts turned so exclusively inward. She saw unusual loiterers in the streets: men with their hands in their pockets sauntering along; loud-laughing and loud-spoken girls clustered together, apparently excited to high spirits, and a boisterous independence of temper and behaviour. The more ill-looking of the men--the discreditable minority--hung about on the steps of the beer-houses and gin-shops, smoking, and commenting pretty freely on every passer-by. Margaret disliked the prospect of the long walk through these streets, before she came to the fields which she had planned to reach. Instead, she would go and see Bessy Higgins. It would not be so refreshing as a quiet country walk, but still it would perhaps be doing the kinder thing.\nNicholas Higgins was sitting by the fire smoking, as she went in. Bessy was rocking herself on the other side.\nNicholas took the pipe out of his mouth, and standing up, pushed his chair towards Margaret; he leant against the chimney-piece in a lounging attitude, while she asked Bessy how she was.\n\"Hoo's rather down i' th' mouth in regard to spirits, but hoo's better in health. Hoo doesn't like this strike. Hoo's a deal too much set on piece and quietness at any price.\"\n\"This is th' third strike I've seen,\" said she, sighing, as if that was answer and explanation enough.\n\"Well, third time pays for all. See if we don't dang th' masters this time. See if they don't come and beg us to come back at our own price. That's all. We've missed it afore time, I grant yo'; but this time we'n laid our plans desperate deep.\"\n\"Why do you strike?\" asked Margaret. \"Striking is leaving off work till you get your own rate of wages, is it not? You must not wonder at my ignorance; where I come from I never heard of a strike.\"\n\"I wish I were there,\" said Bessie, wearily. \"But it's not for me to get sick and tired o' strikes. This is the last I'll see. Before it's ended I shall be in the Great City--the Holy Jerusalem.\"\n\"Hoo's so full of th' life to come, hoo cannot think of th' present. Now I, yo see, am bound to do the best I can here. I think a bird i' th' hand is worth two i' th' bush. So them's the different views we take on th' strike question.\"\n\"But,\" said Margaret, \"if the people struck, as you call it, where I come from, as they are mostly all field labourers, the seed would not be sown, the hay got in, the corn reaped.\"\n\"Well?\" said he. He had resumed his pipe, and put his \"well\" in the form of an interrogation.\n\"Why,\" she went on, \"what would become of the farmers?\"\nHe puffed away. \"I reckon, they'd have either to give up their farms, or to give fair rate of wage.\"\n\"Suppose they could not, or would not do the last; they could not give up their farms all in a minute, however much they might wish to do so; but they would have no hay, nor corn to sell that year; and where would the money come from to pay the labourers' wages the next?\"\nStill puffing away. At last he said:\n\"I know nought of your ways down South. I have heerd they're a pack of spiritless, down-trodden men; welly clemmed to death; too dazed wi' clemming to know when they're put upon. Now, it's not so here. We known when we're put upon; and we'en too much blood in us to stand it. We just take our hands fro' our looms, and say, 'Yo' may clem us, but yo'll not put upon us, my masters!' And be danged to 'em, they shan't this time!\"\n\"I wished I lived down South,\" said Bessy.\n\"There's a deal to bear there,\" said Margaret. \"There are sorrows to bear everywhere. There is very hard bodily labour to be gone through, with very little food to give strength.\"\n\"But it's out of doors,\" said Bessy. \"And away from the endless, endless noise, and sickening heat.\"\n\"It's sometimes in heavy rain, and sometimes in bitter cold. A young person can stand it; but an old man gets racked with rheumatism, and bent and withered before his time; yet he must just work on the same, or else go to the workhouse.\"\n\"I thought yo were so taken wi' the ways of the South country.\"\n\"So I am,\" said Margaret, smiling a little, as she found herself thus caught. \"I only mean, Bessy, there's good and bad in everything in this world; and as you felt the bad up here, I thought it was but fair you should know the bad down there.\"\n\"And yo say they never strike down there?\" asked Nicholas abruptly.\n\"No!\" said Margaret; \"I think they have too much sense.\"\n\"An' I think,\" replied he, dashing the ashes out of his pipe with so much vehemence that it broke, \"it's not that they've too much sense, but that they've too little spirit.\"\n\"Oh, father!\" said Bessy, \"what have ye gained by striking? Just think of that first strike when mother died--how we all had to clem--you the worst of all; and yet many a one went in every week at the same wage, till all were gone in that there was work for; and some went beggars all their lives at after.\"\n\"Ay,\" said he. \"That there strike was badly managed. Folk got into th' management of it, as were either fools or not true men. Yo'll see, it'll be different this time.\"\n\"But all this time you've not told me what you're striking for,\" said Margaret, again.\n\"Why, yo see, there's five or six masters who have set themselves again paying the wages they've been paying these two years past, and flourishing upon, and getting richer upon. And now they come to us, and say we're to take less. And we won't. We'll just clem them to death first; and see who'll work for 'em then. They'll have killed the goose that laid 'em the golden eggs, I reckon.\"\n\"And so you plan dying, in order to be revenged upon them!\"\n\"No,\" said he, \"I dunnot. I just look forward to the chance of dying at my post sooner than yield. That's what folk call fine and honourable in a soldier, and why not in a poor weaver-chap?\"\n\"But,\" said Margaret, \"a soldier dies in the cause of the Nation--in the cause of others.\"\nHe laughed grimly. \"My lass,\" said he, \"yo're but a young wench, but don't yo think I can keep three people--that's Bessy, and Mary, and me--on sixteen shillings a week? Dun yo think it's for mysel' I'm striking work at this time? It is just as much in the cause of others as yon soldier--only m'appen, the cause he dies for is just that of somebody he never clapt eyes on, nor heerd on all his born days, while I take up John Boucher's cause, as lives next door but one, wi' a sickly wife, and eight childer, none on 'em factory age; and I don't take up his cause only, though he's a poor good-for-nought, as can only manage two looms at a time, but I take up th' cause o' justice. Why are we to have less wage now, I ask, than two year ago?\"\n\"Don't ask me,\" said Margaret; \"I am very ignorant. Ask some of your masters. Surely they will give you a reason for it. It is not merely an arbitrary decision of theirs, come to without reason.\"\n\"Yo're just a foreigner, and nothing more,\" said he, contemptuously. \"Much yo know about it. Ask th' masters! They'd tell us to mind our own business, and they'd mind theirs. Our business being, yo understand, to take the bated wage, and be thankful; and their business to bate us down to clemming point, to swell their profits. That's what it is.\"\n\"But,\" said Margaret, determined not to give way, although she saw she was irritating him, \"the state of trade may be such as not to enable them to give you the same remuneration.\"\n\"State o' trade! That's just a piece o' masters' humbug. It's rate o' wages I was talking of. Th' masters keep th' state o' trade in their own hands; and just walk it forward like a black bug-a-boo, to frighten naughty children with into being good. I'll tell you it's their part,--their cue, as some folks call it,--to beat us down, to swell their fortunes; and it's ours to stand up and fight hard,--not for ourselves alone, but for them round about us--for justice and fair play. We help to make their profits, and we ought to help spend 'em. It's not that we want their brass so much this time, as we've done many a time afore. We'n getten money laid by; and we're resolved to stand and fall together; not a man on us will go in for less wage than th' Union says is our due. So I say, 'hooray for the strike,' and let Thornton, and Slickson, and Hamper, and their set look to it!\"\n\"Thornton!\" said Margaret. \"Mr. Thornton of Marlborough Street?\"\n\"Aye! Thornton o' Marlborough Mill, as we call him.\"\n\"He is one of the masters you are striving with, is he not? What sort of a master is he?\"\n\"Did yo' ever see a bulldog? Set a bulldog on hind legs, and dress him up in coat and breeches, and yo'n just getten John Thornton.\"\n\"Nay,\" said Margaret, laughing, \"I deny that. Mr. Thornton is plain enough, but he's not like a bulldog, with its short broad nose, and snarling upper lip.\"\n\"No! not in look, I grant yo. But let John Thornton get hold on a notion, and he'll stick to it like a bulldog; yo might pull him away wi' a pitchfork ere he'd leave go. He's worth fighting wi', is John Thornton. As for Slickson, I take it, some o' these days he'll wheedle his men back wi' fair promises; that they'll just get cheated out of as soon as they're in his power again. He'll work his fines well out on 'em, I'll warrant. He's as slippery as an eel, he is. He's like a cat,--as sleek, and cunning, and fierce. It'll never be an honest up and down fight wi' him, as it will be wi' Thornton. Thornton's as dour as a door-nail; an obstinate chap, every inch on him,--th' oud bulldog!\"\n\"Poor Bessy!\" said Margaret, turning round to her. \"You sigh over it all. You don't like struggling and fighting as your father does, do you?\"\n\"No!\" said she, heavily. \"I'm sick on it. I could have wished to have had other talk about me in my latter days, than just the clashing and clanging and clattering that has ever wearied a' my life long, about work and wages, and masters, and hands, and knobsticks.\n\"Poor wench! latter days be farred! Thou'rt looking a sight better already for a little stir and change. Beside, I shall be a deal here to make it more lively for thee.\"\n\"Tobacco-smoke chokes me!\" said she, querulously.\n\"Then I'll never smoke no more i' the house!\" he replied, tenderly. \"But why didst thou not tell me afore, thou foolish wench?\"\nShe did not speak for a while, and then so low that only Margaret heard her:\n\"I reckon, he'll want a' the comfort he can get out o' either pipe or drink afore he's done.\"\nHer father went out of doors, evidently to finish his pipe.\nBessy said passionately,\n\"Now am not I a fool,--am I not, Miss?--there, I knew I ought for to keep father at home, and away fro' the folk that are always ready for to tempt a man, in time o' strike, to go drink,--and there my tongue must needs quarrel with this pipe o' his'n--and he'll go off, I know he will,--as often as he wants to smoke--and nobody knows where it'll end. I wish I'd letten myself be choked first.\"\n\"But does your father drink?\" said Margaret.\n\"No--not to say drink,\" replied she, still in the same wild excited tone. \"But what win ye have? There are days wi' you as wi' other folk, I suppose, when yo' get up and go through th' hours, just longing for a bit of a change--a bit of a fillip, as it were. I know I ha' gone and bought a four-pounder out o' another baker's shop to common on such days, just because I sickened at the thought of going on for ever wi' the same sight in my eyes, and the same sound in my ears, and the same taste i' my mouth, and the same thought (or no thought, for that matter) in my head, day after day, for ever. I've longed for to be a man to go spreeing, even if it were only a tramp to some new place in search o' work. And father--all men--have it stronger in 'em than me to get tired o' sameness and work for ever. And what is 'em to do? It's little blame to them if they do go into th' gin-shop for to make their blood flow quicker, and more lively, and see things they never see at no other time--pictures, and looking-glass, and such like. But father never was a drunkard, though maybe, he's got worse for drink, now and then. Only yo' see,\" and now her voice took a mournful, pleading tone, \"at times o' strike there's much to knock a man down, for all they start so hopefully; and where's the comfort to come fro'? He'll get angry and mad--they all do--and then they get tired out wi' being angry and mad, and maybe ha' done things in their passion they'd be glad to forget. Bless yo'r sweet pitiful face! but yo' dunnot know what a strike is yet.\"\n\"Come, Bessy,\" said Margaret, \"I won't say you're exaggerating, because I don't know enough about it: but, perhaps, as you're not well, you're only looking on one side, and there is another and a brighter to be looked to.\"\n\"It's all well enough for yo' to say so, who have lived in pleasant green places all your life long, and never known want or care, or wickedness either, for that matter.\"\n\"Take care,\" said Margaret, her cheek flushing, and her eye lightening, \"how you judge, Bessy. I shall go home to my mother, who is so ill--so ill, Bessy, that there's no outlet but death for her out of prison of her great suffering; and yet I must speak cheerfully to my father, who has no notion of her real state, and to whom the knowledge must come gradually. The only person--the only one who could sympathise with me and help me--whose presence could comfort my mother more than any other earthly thing--is falsely accused--would run the risk of death if he came to see his dying mother. This I tell you--only you, Bessy. You must not mention it. No other person in Milton--hardly any other person in England knows. Have I not care? Do I not know anxiety, though I go about well-dressed, and have food enough? Oh, Bessy, God is just, and our lots are well portioned out by Him, although none but He knows the bitterness of our souls.\"\n\"I ask your pardon,\" replied Bessy, humbly. \"Sometimes, when I've thought o' my life, and the little pleasure I've had in it, I've believed that, maybe, I was one of those doomed to die by the falling of a star from heaven; 'And the name of the star is called Wormwood; and the third part of the waters became wormwood; and men died of the waters, because they were made bitter.' One can bear pain and sorrow better if one thinks it has been prophesied long before for one: somehow, then it seems as if my pain was needed for the fulfilment; otherways it seems all sent for nothing.\"\n\"Nay, Bessy--think!\" said Margaret. \"God does not willingly inflict. Don't dwell so much on the prophecies, but read the clearer parts of the Bible.\"\n\"I dare say it would be wiser; but where would I hear such grand words of promise--hear tell o' anything so far different fro' this dreary world, and this town above a' as in Revelations? Many's the time I've repeated the verses in the seventh chapter to myself, just for the sound. It's as good as an organ, and as different from every day, too. No, I cannot give up Revelations. It gives me more comfort than any other book i' the Bible.\"\n\"Let me come and read you some of my favourite chapters.\"\n\"Ay,\" said she greedily, \"come. Father will maybe hear yo.' He's deaved wi' my talking; he says it's all nought to do with the things o' to-day, and that's his business.\"\n\"Where is your sister?\"\n\"Gone fustian cutting. I were loth to let her go; but somehow we must live; and th' Union can't afford us much.\"\n\"Now I must go. You have done me good, Bessy.\"\n\"I done you good!\"\n\"Yes, I came here very sad, and rather too apt to think my own cause for grief was the only one in the world. And now I hear how you have had to bear for years, and that makes me stronger.\"\n\"Bless yo'! I thought a' the good-doing was on the side of gentlefolk. I shall get proud if I think I can do good to yo'.\"\n\"You won't do it if you think about it. But you'll only puzzle yourself if you do, that's one comfort.\"\n\"You're not like no one I ever seed. I dunno what to make of yo'.\"\n\"Nor I of myself. Good-bye!\"\nBessy stilled her rocking to gaze after her.\n\"I wonder if there are many folk like her down South. She's like a breath of country air, somehow. She freshens me up above a bit. Who'd a thought that face--as bright and as strong as the angel I dream of--could have known the sorrow she speaks on? I wonder how she'll sin. All on us must sin. I think a deal on her, for sure. But father does the like, I see. And Mary even. It's not often hoo's stirred up to notice much.\"",
        "paragraph_chars": [
            [
                0,
                139
            ],
            [
                139,
                1147
            ],
            [
                1147,
                1258
            ],
            [
                1258,
                1445
            ],
            [
                1445,
                1621
            ],
            [
                1621,
                1724
            ],
            [
                1724,
                1969
            ],
            [
                1969,
                2167
            ],
            [
                2167,
                2363
            ],
            [
                2363,
                2599
            ],
            [
                2599,
                2781
            ],
            [
                2781,
                2875
            ],
            [
                2875,
                2931
            ],
            [
                2931,
                3032
            ],
            [
                3032,
                3305
            ],
            [
                3305,
                3342
            ],
            [
                3342,
                3770
            ],
            [
                3770,
                3813
            ],
            [
                3813,
                3993
            ],
            [
                3993,
                4094
            ],
            [
                4094,
                4332
            ],
            [
                4332,
                4396
            ],
            [
                4396,
                4641
            ],
            [
                4641,
                4709
            ],
            [
                4709,
                4766
            ],
            [
                4766,
                4941
            ],
            [
                4941,
                5249
            ],
            [
                5249,
                5418
            ],
            [
                5418,
                5505
            ],
            [
                5505,
                5893
            ],
            [
                5893,
                5953
            ],
            [
                5953,
                6144
            ],
            [
                6144,
                6235
            ],
            [
                6235,
                6979
            ],
            [
                6979,
                7175
            ],
            [
                7175,
                7524
            ],
            [
                7524,
                7705
            ],
            [
                7705,
                8590
            ],
            [
                8590,
                8655
            ],
            [
                8655,
                8708
            ],
            [
                8708,
                8798
            ],
            [
                8798,
                8931
            ],
            [
                8931,
                9088
            ],
            [
                9088,
                9782
            ],
            [
                9782,
                9925
            ],
            [
                9925,
                10190
            ],
            [
                10190,
                10360
            ],
            [
                10360,
                10410
            ],
            [
                10410,
                10538
            ],
            [
                10538,
                10615
            ],
            [
                10615,
                10709
            ],
            [
                10709,
                10769
            ],
            [
                10769,
                10794
            ],
            [
                10794,
                11189
            ],
            [
                11189,
                11234
            ],
            [
                11234,
                12780
            ],
            [
                12780,
                13003
            ],
            [
                13003,
                13174
            ],
            [
                13174,
                14115
            ],
            [
                14115,
                14699
            ],
            [
                14699,
                14849
            ],
            [
                14849,
                15290
            ],
            [
                15290,
                15348
            ],
            [
                15348,
                15519
            ],
            [
                15519,
                15543
            ],
            [
                15543,
                15656
            ],
            [
                15656,
                15703
            ],
            [
                15703,
                15722
            ],
            [
                15722,
                15912
            ],
            [
                15912,
                16035
            ],
            [
                16035,
                16139
            ],
            [
                16139,
                16206
            ],
            [
                16206,
                16235
            ],
            [
                16235,
                16280
            ],
            [
                16280,
                16704
            ]
        ],
        "segment_chars": [
            [
                0,
                133
            ],
            [
                133,
                139
            ],
            [
                139,
                189
            ],
            [
                189,
                312
            ],
            [
                312,
                351
            ],
            [
                351,
                438
            ],
            [
                438,
                683
            ],
            [
                683,
                860
            ],
            [
                860,
                993
            ],
            [
                993,
                1038
            ],
            [
                1038,
                1147
            ],
            [
                1147,
                1213
            ],
            [
                1213,
                1258
            ],
            [
                1258,
                1445
            ],
            [
                1445,
                1527
            ],
            [
                1527,
                1557
            ],
            [
                1557,
                1621
            ],
            [
                1621,
                1724
            ],
            [
                1724,
                1756
            ],
            [
                1756,
                1800
            ],
            [
                1800,
                1865
            ],
            [
                1865,
                1877
            ],
            [
                1877,
                1969
            ],
            [
                1969,
                1990
            ],
            [
                1990,
                2006
            ],
            [
                2006,
                2084
            ],
            [
                2084,
                2167
            ],
            [
                2167,
                2212
            ],
            [
                2212,
                2267
            ],
            [
                2267,
                2294
            ],
            [
                2294,
                2363
            ],
            [
                2363,
                2432
            ],
            [
                2432,
                2483
            ],
            [
                2483,
                2536
            ],
            [
                2536,
                2599
            ],
            [
                2599,
                2781
            ],
            [
                2781,
                2789
            ],
            [
                2789,
                2798
            ],
            [
                2798,
                2875
            ],
            [
                2875,
                2931
            ],
            [
                2931,
                2947
            ],
            [
                2947,
                3032
            ],
            [
                3032,
                3305
            ],
            [
                3305,
                3325
            ],
            [
                3325,
                3342
            ],
            [
                3342,
                3382
            ],
            [
                3382,
                3521
            ],
            [
                3521,
                3544
            ],
            [
                3544,
                3618
            ],
            [
                3618,
                3724
            ],
            [
                3724,
                3770
            ],
            [
                3770,
                3813
            ],
            [
                3813,
                3860
            ],
            [
                3860,
                3899
            ],
            [
                3899,
                3993
            ],
            [
                3993,
                4030
            ],
            [
                4030,
                4094
            ],
            [
                4094,
                4155
            ],
            [
                4155,
                4332
            ],
            [
                4332,
                4396
            ],
            [
                4396,
                4474
            ],
            [
                4474,
                4641
            ],
            [
                4641,
                4684
            ],
            [
                4684,
                4709
            ],
            [
                4709,
                4715
            ],
            [
                4715,
                4766
            ],
            [
                4766,
                4941
            ],
            [
                4941,
                4955
            ],
            [
                4955,
                5001
            ],
            [
                5001,
                5249
            ],
            [
                5249,
                5264
            ],
            [
                5264,
                5302
            ],
            [
                5302,
                5376
            ],
            [
                5376,
                5418
            ],
            [
                5418,
                5505
            ],
            [
                5505,
                5683
            ],
            [
                5683,
                5736
            ],
            [
                5736,
                5750
            ],
            [
                5750,
                5821
            ],
            [
                5821,
                5893
            ],
            [
                5893,
                5953
            ],
            [
                5953,
                5979
            ],
            [
                5979,
                6052
            ],
            [
                6052,
                6144
            ],
            [
                6144,
                6235
            ],
            [
                6235,
                6254
            ],
            [
                6254,
                6405
            ],
            [
                6405,
                6466
            ],
            [
                6466,
                6918
            ],
            [
                6918,
                6979
            ],
            [
                6979,
                7031
            ],
            [
                7031,
                7057
            ],
            [
                7057,
                7100
            ],
            [
                7100,
                7175
            ],
            [
                7175,
                7244
            ],
            [
                7244,
                7268
            ],
            [
                7268,
                7285
            ],
            [
                7285,
                7350
            ],
            [
                7350,
                7504
            ],
            [
                7504,
                7524
            ],
            [
                7524,
                7705
            ],
            [
                7705,
                7722
            ],
            [
                7722,
                7762
            ],
            [
                7762,
                7799
            ],
            [
                7799,
                7955
            ],
            [
                7955,
                8188
            ],
            [
                8188,
                8251
            ],
            [
                8251,
                8337
            ],
            [
                8337,
                8484
            ],
            [
                8484,
                8590
            ],
            [
                8590,
                8602
            ],
            [
                8602,
                8617
            ],
            [
                8617,
                8655
            ],
            [
                8655,
                8661
            ],
            [
                8661,
                8708
            ],
            [
                8708,
                8768
            ],
            [
                8768,
                8798
            ],
            [
                8798,
                8827
            ],
            [
                8827,
                8931
            ],
            [
                8931,
                8977
            ],
            [
                8977,
                9088
            ],
            [
                9088,
                9093
            ],
            [
                9093,
                9118
            ],
            [
                9118,
                9258
            ],
            [
                9258,
                9301
            ],
            [
                9301,
                9470
            ],
            [
                9470,
                9522
            ],
            [
                9522,
                9557
            ],
            [
                9557,
                9610
            ],
            [
                9610,
                9690
            ],
            [
                9690,
                9782
            ],
            [
                9782,
                9796
            ],
            [
                9796,
                9833
            ],
            [
                9833,
                9856
            ],
            [
                9856,
                9925
            ],
            [
                9925,
                9931
            ],
            [
                9931,
                9950
            ],
            [
                9950,
                9967
            ],
            [
                9967,
                10190
            ],
            [
                10190,
                10203
            ],
            [
                10203,
                10226
            ],
            [
                10226,
                10295
            ],
            [
                10295,
                10360
            ],
            [
                10360,
                10387
            ],
            [
                10387,
                10410
            ],
            [
                10410,
                10456
            ],
            [
                10456,
                10478
            ],
            [
                10478,
                10538
            ],
            [
                10538,
                10615
            ],
            [
                10615,
                10709
            ],
            [
                10709,
                10769
            ],
            [
                10769,
                10794
            ],
            [
                10794,
                11146
            ],
            [
                11146,
                11189
            ],
            [
                11189,
                11219
            ],
            [
                11219,
                11234
            ],
            [
                11234,
                11308
            ],
            [
                11308,
                11331
            ],
            [
                11331,
                11493
            ],
            [
                11493,
                11834
            ],
            [
                11834,
                11944
            ],
            [
                11944,
                12041
            ],
            [
                12041,
                12064
            ],
            [
                12064,
                12269
            ],
            [
                12269,
                12356
            ],
            [
                12356,
                12546
            ],
            [
                12546,
                12706
            ],
            [
                12706,
                12737
            ],
            [
                12737,
                12780
            ],
            [
                12780,
                13003
            ],
            [
                13003,
                13174
            ],
            [
                13174,
                13269
            ],
            [
                13269,
                13538
            ],
            [
                13538,
                13768
            ],
            [
                13768,
                13802
            ],
            [
                13802,
                13827
            ],
            [
                13827,
                13896
            ],
            [
                13896,
                13913
            ],
            [
                13913,
                13990
            ],
            [
                13990,
                14115
            ],
            [
                14115,
                14159
            ],
            [
                14159,
                14495
            ],
            [
                14495,
                14699
            ],
            [
                14699,
                14720
            ],
            [
                14720,
                14735
            ],
            [
                14735,
                14768
            ],
            [
                14768,
                14849
            ],
            [
                14849,
                15037
            ],
            [
                15037,
                15132
            ],
            [
                15132,
                15196
            ],
            [
                15196,
                15230
            ],
            [
                15230,
                15290
            ],
            [
                15290,
                15348
            ],
            [
                15348,
                15380
            ],
            [
                15380,
                15408
            ],
            [
                15408,
                15519
            ],
            [
                15519,
                15543
            ],
            [
                15543,
                15566
            ],
            [
                15566,
                15656
            ],
            [
                15656,
                15672
            ],
            [
                15672,
                15703
            ],
            [
                15703,
                15722
            ],
            [
                15722,
                15832
            ],
            [
                15832,
                15912
            ],
            [
                15912,
                15924
            ],
            [
                15924,
                15983
            ],
            [
                15983,
                16035
            ],
            [
                16035,
                16075
            ],
            [
                16075,
                16139
            ],
            [
                16139,
                16176
            ],
            [
                16176,
                16206
            ],
            [
                16206,
                16224
            ],
            [
                16224,
                16235
            ],
            [
                16235,
                16280
            ],
            [
                16280,
                16334
            ],
            [
                16334,
                16379
            ],
            [
                16379,
                16411
            ],
            [
                16411,
                16530
            ],
            [
                16530,
                16555
            ],
            [
                16555,
                16575
            ],
            [
                16575,
                16608
            ],
            [
                16608,
                16641
            ],
            [
                16641,
                16656
            ],
            [
                16656,
                16704
            ]
        ],
        "overlap_chars": [
            [
                139,
                180
            ],
            [
                187,
                189
            ],
            [
                189,
                215
            ],
            [
                258,
                273
            ],
            [
                310,
                312
            ],
            [
                312,
                333
            ],
            [
                351,
                414
            ],
            [
                430,
                437
            ],
            [
                438,
                549
            ],
            [
                566,
                591
            ],
            [
                614,
                627
            ],
            [
                632,
                657
            ],
            [
                681,
                683
            ],
            [
                720,
                733
            ],
            [
                695,
                703
            ],
            [
                711,
                714
            ],
            [
                744,
                860
            ],
            [
                860,
                993
            ],
            [
                993,
                1037
            ],
            [
                1147,
                1175
            ],
            [
                1179,
                1213
            ],
            [
                1213,
                1258
            ],
            [
                1258,
                1349
            ],
            [
                1351,
                1379
            ],
            [
                1380,
                1385
            ],
            [
                1408,
                1425
            ],
            [
                1432,
                1435
            ],
            [
                1426,
                1431
            ],
            [
                1440,
                1445
            ],
            [
                1446,
                1476
            ],
            [
                1497,
                1527
            ],
            [
                1527,
                1557
            ],
            [
                1557,
                1585
            ],
            [
                1592,
                1618
            ],
            [
                1627,
                1656
            ],
            [
                1659,
                1663
            ],
            [
                1667,
                1692
            ],
            [
                1704,
                1724
            ],
            [
                1725,
                1756
            ],
            [
                1756,
                1800
            ],
            [
                1800,
                1817
            ],
            [
                1827,
                1863
            ],
            [
                1865,
                1877
            ],
            [
                1922,
                1966
            ],
            [
                1970,
                1987
            ],
            [
                1990,
                2006
            ],
            [
                2107,
                2164
            ],
            [
                2168,
                2187
            ],
            [
                2190,
                2199
            ],
            [
                2201,
                2212
            ],
            [
                2256,
                2257
            ],
            [
                2213,
                2216
            ],
            [
                2267,
                2283
            ],
            [
                2284,
                2294
            ],
            [
                2294,
                2340
            ],
            [
                2342,
                2360
            ],
            [
                2364,
                2432
            ],
            [
                2432,
                2437
            ],
            [
                2447,
                2483
            ],
            [
                2536,
                2596
            ],
            [
                2600,
                2603
            ],
            [
                2606,
                2620
            ],
            [
                2622,
                2642
            ],
            [
                2658,
                2697
            ],
            [
                2702,
                2746
            ],
            [
                2763,
                2778
            ],
            [
                2896,
                2928
            ],
            [
                2931,
                2940
            ],
            [
                2945,
                2947
            ],
            [
                2962,
                3029
            ],
            [
                3037,
                3055
            ],
            [
                3070,
                3076
            ],
            [
                3081,
                3134
            ],
            [
                3174,
                3196
            ],
            [
                3206,
                3302
            ],
            [
                3305,
                3323
            ],
            [
                3333,
                3342
            ],
            [
                3343,
                3382
            ],
            [
                3382,
                3442
            ],
            [
                3467,
                3470
            ],
            [
                3471,
                3480
            ],
            [
                3490,
                3521
            ],
            [
                3526,
                3544
            ],
            [
                3544,
                3546
            ],
            [
                3553,
                3580
            ],
            [
                3608,
                3618
            ],
            [
                3728,
                3757
            ],
            [
                3758,
                3767
            ],
            [
                3771,
                3772
            ],
            [
                3780,
                3798
            ],
            [
                3801,
                3813
            ],
            [
                3867,
                3897
            ],
            [
                3845,
                3859
            ],
            [
                3905,
                3917
            ],
            [
                3925,
                3950
            ],
            [
                3899,
                3904
            ],
            [
                3950,
                3990
            ],
            [
                3994,
                4015
            ],
            [
                4018,
                4030
            ],
            [
                4031,
                4076
            ],
            [
                4087,
                4091
            ],
            [
                4095,
                4155
            ],
            [
                4155,
                4203
            ],
            [
                4232,
                4291
            ],
            [
                4300,
                4304
            ],
            [
                4310,
                4329
            ],
            [
                4333,
                4345
            ],
            [
                4346,
                4393
            ],
            [
                4400,
                4404
            ],
            [
                4407,
                4429
            ],
            [
                4472,
                4474
            ],
            [
                4475,
                4548
            ],
            [
                4578,
                4594
            ],
            [
                4599,
                4638
            ],
            [
                4642,
                4648
            ],
            [
                4649,
                4681
            ],
            [
                4684,
                4698
            ],
            [
                4699,
                4709
            ],
            [
                4710,
                4712
            ],
            [
                4715,
                4729
            ],
            [
                4731,
                4763
            ],
            [
                4767,
                4778
            ],
            [
                4781,
                4826
            ],
            [
                4863,
                4864
            ],
            [
                4908,
                4938
            ],
            [
                4944,
                4952
            ],
            [
                4955,
                4966
            ],
            [
                4968,
                5001
            ],
            [
                5006,
                5049
            ],
            [
                5051,
                5073
            ],
            [
                5075,
                5109
            ],
            [
                5116,
                5152
            ],
            [
                5158,
                5161
            ],
            [
                5198,
                5221
            ],
            [
                5241,
                5246
            ],
            [
                5250,
                5252
            ],
            [
                5255,
                5264
            ],
            [
                5270,
                5302
            ],
            [
                5387,
                5415
            ],
            [
                5419,
                5422
            ],
            [
                5437,
                5480
            ],
            [
                5483,
                5496
            ],
            [
                5503,
                5505
            ],
            [
                5506,
                5513
            ],
            [
                5514,
                5570
            ],
            [
                5577,
                5634
            ],
            [
                5681,
                5683
            ],
            [
                5687,
                5695
            ],
            [
                5712,
                5736
            ],
            [
                5736,
                5750
            ],
            [
                5750,
                5821
            ],
            [
                5821,
                5860
            ],
            [
                5865,
                5890
            ],
            [
                5894,
                5950
            ],
            [
                5954,
                5956
            ],
            [
                5959,
                5967
            ],
            [
                5969,
                5979
            ],
            [
                5979,
                5980
            ],
            [
                6022,
                6052
            ],
            [
                6052,
                6136
            ],
            [
                6145,
                6148
            ],
            [
                6151,
                6165
            ],
            [
                6167,
                6181
            ],
            [
                6226,
                6232
            ],
            [
                6235,
                6254
            ],
            [
                6258,
                6262
            ],
            [
                6265,
                6273
            ],
            [
                6275,
                6277
            ],
            [
                6313,
                6342
            ],
            [
                6351,
                6374
            ],
            [
                6376,
                6389
            ],
            [
                6397,
                6405
            ],
            [
                6418,
                6422
            ],
            [
                6423,
                6446
            ],
            [
                6515,
                6522
            ],
            [
                6556,
                6559
            ],
            [
                6576,
                6607
            ],
            [
                6639,
                6744
            ],
            [
                6806,
                6880
            ],
            [
                6882,
                6918
            ],
            [
                6918,
                6976
            ],
            [
                6983,
                6992
            ],
            [
                6995,
                7008
            ],
            [
                7029,
                7031
            ],
            [
                7031,
                7057
            ],
            [
                7057,
                7091
            ],
            [
                7176,
                7178
            ],
            [
                7253,
                7266
            ],
            [
                7219,
                7243
            ],
            [
                7268,
                7285
            ],
            [
                7285,
                7324
            ],
            [
                7348,
                7350
            ],
            [
                7350,
                7372
            ],
            [
                7373,
                7396
            ],
            [
                7403,
                7424
            ],
            [
                7478,
                7479
            ],
            [
                7426,
                7447
            ],
            [
                7453,
                7455
            ],
            [
                7483,
                7504
            ],
            [
                7504,
                7521
            ],
            [
                7525,
                7528
            ],
            [
                7531,
                7614
            ],
            [
                7616,
                7646
            ],
            [
                7677,
                7689
            ],
            [
                7712,
                7722
            ],
            [
                7722,
                7762
            ],
            [
                7799,
                7858
            ],
            [
                7869,
                7871
            ],
            [
                7880,
                7886
            ],
            [
                7893,
                7932
            ],
            [
                7938,
                7955
            ],
            [
                7955,
                7956
            ],
            [
                7960,
                7964
            ],
            [
                8022,
                8037
            ],
            [
                8062,
                8067
            ],
            [
                8078,
                8104
            ],
            [
                8161,
                8172
            ],
            [
                8107,
                8159
            ],
            [
                8186,
                8188
            ],
            [
                8337,
                8339
            ],
            [
                8342,
                8484
            ],
            [
                8484,
                8493
            ],
            [
                8495,
                8516
            ],
            [
                8519,
                8536
            ],
            [
                8541,
                8566
            ],
            [
                8577,
                8587
            ],
            [
                8595,
                8599
            ],
            [
                8602,
                8617
            ],
            [
                8620,
                8621
            ],
            [
                8622,
                8652
            ],
            [
                8656,
                8661
            ],
            [
                8661,
                8689
            ],
            [
                8768,
                8795
            ],
            [
                8803,
                8827
            ],
            [
                8827,
                8928
            ],
            [
                8932,
                8935
            ],
            [
                8938,
                8962
            ],
            [
                8964,
                8977
            ],
            [
                8977,
                9034
            ],
            [
                9089,
                9093
            ],
            [
                9093,
                9099
            ],
            [
                9104,
                9116
            ],
            [
                9118,
                9198
            ],
            [
                9256,
                9258
            ],
            [
                9258,
                9301
            ],
            [
                9301,
                9317
            ],
            [
                9348,
                9392
            ],
            [
                9327,
                9328
            ],
            [
                9431,
                9470
            ],
            [
                9522,
                9557
            ],
            [
                9610,
                9690
            ],
            [
                9690,
                9723
            ],
            [
                9783,
                9793
            ],
            [
                9796,
                9818
            ],
            [
                9825,
                9833
            ],
            [
                9834,
                9856
            ],
            [
                9856,
                9870
            ],
            [
                9886,
                9894
            ],
            [
                9914,
                9922
            ],
            [
                9926,
                9928
            ],
            [
                9931,
                9950
            ],
            [
                9951,
                9967
            ],
            [
                9967,
                9968
            ],
            [
                10103,
                10110
            ],
            [
                10114,
                10121
            ],
            [
                10112,
                10113
            ],
            [
                10048,
                10067
            ],
            [
                10080,
                10088
            ],
            [
                10128,
                10148
            ],
            [
                10191,
                10203
            ],
            [
                10226,
                10295
            ],
            [
                10301,
                10313
            ],
            [
                10326,
                10357
            ],
            [
                10362,
                10384
            ],
            [
                10387,
                10410
            ],
            [
                10416,
                10432
            ],
            [
                10441,
                10443
            ],
            [
                10448,
                10453
            ],
            [
                10456,
                10466
            ],
            [
                10468,
                10478
            ],
            [
                10479,
                10535
            ],
            [
                10538,
                10541
            ],
            [
                10578,
                10614
            ],
            [
                10626,
                10706
            ],
            [
                10709,
                10724
            ],
            [
                10749,
                10767
            ],
            [
                10737,
                10738
            ],
            [
                10769,
                10794
            ],
            [
                11037,
                11038
            ],
            [
                10795,
                10814
            ],
            [
                10831,
                10832
            ],
            [
                10841,
                10855
            ],
            [
                10860,
                10979
            ],
            [
                10982,
                10985
            ],
            [
                11050,
                11079
            ],
            [
                11093,
                11110
            ],
            [
                11112,
                11144
            ],
            [
                11190,
                11216
            ],
            [
                11224,
                11234
            ],
            [
                11235,
                11237
            ],
            [
                11239,
                11255
            ],
            [
                11258,
                11293
            ],
            [
                11302,
                11308
            ],
            [
                11348,
                11349
            ],
            [
                11331,
                11345
            ],
            [
                11384,
                11391
            ],
            [
                11426,
                11460
            ],
            [
                11462,
                11493
            ],
            [
                11834,
                11861
            ],
            [
                11876,
                11877
            ],
            [
                11862,
                11876
            ],
            [
                11942,
                11944
            ],
            [
                11944,
                11947
            ],
            [
                11960,
                11963
            ],
            [
                11965,
                11969
            ],
            [
                11973,
                11981
            ],
            [
                11989,
                11996
            ],
            [
                12039,
                12041
            ],
            [
                12041,
                12064
            ],
            [
                12064,
                12081
            ],
            [
                12090,
                12121
            ],
            [
                12126,
                12150
            ],
            [
                12164,
                12175
            ],
            [
                12267,
                12269
            ],
            [
                12269,
                12314
            ],
            [
                12316,
                12340
            ],
            [
                12342,
                12356
            ],
            [
                12356,
                12368
            ],
            [
                12371,
                12420
            ],
            [
                12422,
                12546
            ],
            [
                12546,
                12569
            ],
            [
                12571,
                12582
            ],
            [
                12637,
                12646
            ],
            [
                12656,
                12706
            ],
            [
                12706,
                12711
            ],
            [
                12717,
                12737
            ],
            [
                12737,
                12777
            ],
            [
                12781,
                12792
            ],
            [
                12795,
                12809
            ],
            [
                12811,
                12938
            ],
            [
                12943,
                12947
            ],
            [
                13004,
                13008
            ],
            [
                13013,
                13039
            ],
            [
                13042,
                13097
            ],
            [
                13102,
                13127
            ],
            [
                13137,
                13147
            ],
            [
                13180,
                13184
            ],
            [
                13247,
                13260
            ],
            [
                13187,
                13201
            ],
            [
                13212,
                13220
            ],
            [
                13267,
                13269
            ],
            [
                13269,
                13312
            ],
            [
                13329,
                13333
            ],
            [
                13356,
                13361
            ],
            [
                13366,
                13369
            ],
            [
                13387,
                13489
            ],
            [
                13536,
                13538
            ],
            [
                13538,
                13553
            ],
            [
                13568,
                13577
            ],
            [
                13601,
                13608
            ],
            [
                13625,
                13668
            ],
            [
                13684,
                13702
            ],
            [
                13597,
                13600
            ],
            [
                13704,
                13709
            ],
            [
                13718,
                13722
            ],
            [
                13726,
                13749
            ],
            [
                13766,
                13768
            ],
            [
                13802,
                13822
            ],
            [
                13768,
                13772
            ],
            [
                13793,
                13801
            ],
            [
                13827,
                13852
            ],
            [
                13889,
                13894
            ],
            [
                13894,
                13896
            ],
            [
                13916,
                13917
            ],
            [
                13922,
                13988
            ],
            [
                13990,
                14112
            ],
            [
                14116,
                14133
            ],
            [
                14136,
                14149
            ],
            [
                14151,
                14159
            ],
            [
                14169,
                14242
            ],
            [
                14268,
                14269
            ],
            [
                14274,
                14280
            ],
            [
                14365,
                14367
            ],
            [
                14294,
                14300
            ],
            [
                14657,
                14662
            ],
            [
                14667,
                14679
            ],
            [
                14685,
                14696
            ],
            [
                14700,
                14710
            ],
            [
                14720,
                14735
            ],
            [
                14736,
                14758
            ],
            [
                14766,
                14768
            ],
            [
                14768,
                14846
            ],
            [
                14943,
                14944
            ],
            [
                14850,
                14930
            ],
            [
                15018,
                15037
            ],
            [
                15037,
                15066
            ],
            [
                15081,
                15132
            ],
            [
                15132,
                15156
            ],
            [
                15194,
                15196
            ],
            [
                15230,
                15287
            ],
            [
                15291,
                15345
            ],
            [
                15349,
                15351
            ],
            [
                15354,
                15362
            ],
            [
                15363,
                15372
            ],
            [
                15374,
                15380
            ],
            [
                15380,
                15405
            ],
            [
                15405,
                15407
            ],
            [
                15657,
                15672
            ],
            [
                15672,
                15700
            ],
            [
                15704,
                15719
            ],
            [
                15723,
                15726
            ],
            [
                15728,
                15753
            ],
            [
                15778,
                15832
            ],
            [
                15832,
                15846
            ],
            [
                15851,
                15909
            ],
            [
                15913,
                15924
            ],
            [
                15983,
                16020
            ],
            [
                16029,
                16031
            ],
            [
                16021,
                16025
            ],
            [
                16143,
                16176
            ],
            [
                16176,
                16202
            ],
            [
                16207,
                16224
            ],
            [
                16224,
                16232
            ],
            [
                16235,
                16240
            ],
            [
                16269,
                16280
            ],
            [
                16281,
                16334
            ],
            [
                16334,
                16379
            ],
            [
                16411,
                16416
            ],
            [
                16419,
                16431
            ],
            [
                16441,
                16447
            ],
            [
                16432,
                16436
            ],
            [
                16487,
                16530
            ],
            [
                16530,
                16555
            ],
            [
                16555,
                16575
            ],
            [
                16575,
                16582
            ],
            [
                16593,
                16596
            ],
            [
                16583,
                16584
            ],
            [
                16596,
                16608
            ],
            [
                16608,
                16627
            ],
            [
                16639,
                16641
            ],
            [
                16641,
                16656
            ],
            [
                16656,
                16702
            ]
        ],
        "row_chars": [
            [
                0,
                133
            ],
            [
                133,
                139
            ],
            [
                139,
                189
            ],
            [
                189,
                312
            ],
            [
                312,
                438
            ],
            [
                438,
                683
            ],
            [
                683,
                860
            ],
            [
                860,
                993
            ],
            [
                993,
                1038
            ],
            [
                1038,
                1147
            ],
            [
                1147,
                1213
            ],
            [
                1213,
                1258
            ],
            [
                1258,
                1445
            ],
            [
                1445,
                1527
            ],
            [
                1527,
                1557
            ],
            [
                1557,
                1621
            ],
            [
                1621,
                1724
            ],
            [
                1724,
                1756
            ],
            [
                1756,
                1800
            ],
            [
                1800,
                1877
            ],
            [
                1877,
                1969
            ],
            [
                1969,
                1990
            ],
            [
                1990,
                2006
            ],
            [
                2006,
                2084
            ],
            [
                2084,
                2167
            ],
            [
                2167,
                2212
            ],
            [
                2212,
                2294
            ],
            [
                2294,
                2363
            ],
            [
                2363,
                2432
            ],
            [
                2432,
                2483
            ],
            [
                2483,
                2536
            ],
            [
                2536,
                2599
            ],
            [
                2599,
                2781
            ],
            [
                2781,
                2789
            ],
            [
                2789,
                2798
            ],
            [
                2798,
                2875
            ],
            [
                2875,
                2931
            ],
            [
                2931,
                2947
            ],
            [
                2947,
                3032
            ],
            [
                3032,
                3305
            ],
            [
                3305,
                3342
            ],
            [
                3342,
                3382
            ],
            [
                3382,
                3521
            ],
            [
                3521,
                3544
            ],
            [
                3544,
                3618
            ],
            [
                3618,
                3724
            ],
            [
                3724,
                3770
            ],
            [
                3770,
                3813
            ],
            [
                3813,
                3899
            ],
            [
                3899,
                3993
            ],
            [
                3993,
                4030
            ],
            [
                4030,
                4094
            ],
            [
                4094,
                4155
            ],
            [
                4155,
                4332
            ],
            [
                4332,
                4396
            ],
            [
                4396,
                4474
            ],
            [
                4474,
                4641
            ],
            [
                4641,
                4684
            ],
            [
                4684,
                4709
            ],
            [
                4709,
                4715
            ],
            [
                4715,
                4766
            ],
            [
                4766,
                4941
            ],
            [
                4941,
                4955
            ],
            [
                4955,
                5001
            ],
            [
                5001,
                5249
            ],
            [
                5249,
                5264
            ],
            [
                5264,
                5302
            ],
            [
                5302,
                5376
            ],
            [
                5376,
                5418
            ],
            [
                5418,
                5505
            ],
            [
                5505,
                5683
            ],
            [
                5683,
                5736
            ],
            [
                5736,
                5750
            ],
            [
                5750,
                5821
            ],
            [
                5821,
                5893
            ],
            [
                5893,
                5953
            ],
            [
                5953,
                5979
            ],
            [
                5979,
                6052
            ],
            [
                6052,
                6144
            ],
            [
                6144,
                6235
            ],
            [
                6235,
                6254
            ],
            [
                6254,
                6405
            ],
            [
                6405,
                6466
            ],
            [
                6466,
                6918
            ],
            [
                6918,
                6979
            ],
            [
                6979,
                7031
            ],
            [
                7031,
                7057
            ],
            [
                7057,
                7100
            ],
            [
                7100,
                7175
            ],
            [
                7175,
                7268
            ],
            [
                7268,
                7285
            ],
            [
                7285,
                7350
            ],
            [
                7350,
                7504
            ],
            [
                7504,
                7524
            ],
            [
                7524,
                7705
            ],
            [
                7705,
                7722
            ],
            [
                7722,
                7762
            ],
            [
                7762,
                7799
            ],
            [
                7799,
                7955
            ],
            [
                7955,
                8188
            ],
            [
                8188,
                8251
            ],
            [
                8251,
                8337
            ],
            [
                8337,
                8484
            ],
            [
                8484,
                8590
            ],
            [
                8590,
                8602
            ],
            [
                8602,
                8617
            ],
            [
                8617,
                8655
            ],
            [
                8655,
                8661
            ],
            [
                8661,
                8708
            ],
            [
                8708,
                8768
            ],
            [
                8768,
                8798
            ],
            [
                8798,
                8827
            ],
            [
                8827,
                8931
            ],
            [
                8931,
                8977
            ],
            [
                8977,
                9088
            ],
            [
                9088,
                9093
            ],
            [
                9093,
                9118
            ],
            [
                9118,
                9258
            ],
            [
                9258,
                9301
            ],
            [
                9301,
                9470
            ],
            [
                9470,
                9522
            ],
            [
                9522,
                9557
            ],
            [
                9557,
                9610
            ],
            [
                9610,
                9690
            ],
            [
                9690,
                9782
            ],
            [
                9782,
                9796
            ],
            [
                9796,
                9833
            ],
            [
                9833,
                9856
            ],
            [
                9856,
                9925
            ],
            [
                9925,
                9931
            ],
            [
                9931,
                9950
            ],
            [
                9950,
                9967
            ],
            [
                9967,
                10190
            ],
            [
                10190,
                10203
            ],
            [
                10203,
                10226
            ],
            [
                10226,
                10295
            ],
            [
                10295,
                10360
            ],
            [
                10360,
                10387
            ],
            [
                10387,
                10410
            ],
            [
                10410,
                10456
            ],
            [
                10456,
                10478
            ],
            [
                10478,
                10538
            ],
            [
                10538,
                10709
            ],
            [
                10709,
                10794
            ],
            [
                10794,
                11146
            ],
            [
                11146,
                11189
            ],
            [
                11189,
                11219
            ],
            [
                11219,
                11234
            ],
            [
                11234,
                11308
            ],
            [
                11308,
                11331
            ],
            [
                11331,
                11493
            ],
            [
                11493,
                11834
            ],
            [
                11834,
                11944
            ],
            [
                11944,
                12041
            ],
            [
                12041,
                12064
            ],
            [
                12064,
                12269
            ],
            [
                12269,
                12356
            ],
            [
                12356,
                12546
            ],
            [
                12546,
                12706
            ],
            [
                12706,
                12737
            ],
            [
                12737,
                12780
            ],
            [
                12780,
                13003
            ],
            [
                13003,
                13174
            ],
            [
                13174,
                13269
            ],
            [
                13269,
                13538
            ],
            [
                13538,
                13768
            ],
            [
                13768,
                13827
            ],
            [
                13827,
                13896
            ],
            [
                13896,
                13913
            ],
            [
                13913,
                13990
            ],
            [
                13990,
                14115
            ],
            [
                14115,
                14159
            ],
            [
                14159,
                14495
            ],
            [
                14495,
                14699
            ],
            [
                14699,
                14720
            ],
            [
                14720,
                14735
            ],
            [
                14735,
                14768
            ],
            [
                14768,
                14849
            ],
            [
                14849,
                15037
            ],
            [
                15037,
                15132
            ],
            [
                15132,
                15196
            ],
            [
                15196,
                15230
            ],
            [
                15230,
                15290
            ],
            [
                15290,
                15348
            ],
            [
                15348,
                15380
            ],
            [
                15380,
                15408
            ],
            [
                15408,
                15519
            ],
            [
                15519,
                15543
            ],
            [
                15543,
                15566
            ],
            [
                15566,
                15656
            ],
            [
                15656,
                15672
            ],
            [
                15672,
                15703
            ],
            [
                15703,
                15722
            ],
            [
                15722,
                15832
            ],
            [
                15832,
                15912
            ],
            [
                15912,
                15924
            ],
            [
                15924,
                15983
            ],
            [
                15983,
                16035
            ],
            [
                16035,
                16075
            ],
            [
                16075,
                16139
            ],
            [
                16139,
                16176
            ],
            [
                16176,
                16206
            ],
            [
                16206,
                16224
            ],
            [
                16224,
                16235
            ],
            [
                16235,
                16280
            ],
            [
                16280,
                16334
            ],
            [
                16334,
                16379
            ],
            [
                16379,
                16411
            ],
            [
                16411,
                16530
            ],
            [
                16530,
                16555
            ],
            [
                16555,
                16575
            ],
            [
                16575,
                16608
            ],
            [
                16608,
                16641
            ],
            [
                16641,
                16656
            ],
            [
                16656,
                16704
            ]
        ]
    },
    "abridged": {
        "text": "Margaret went out heavily and unwillingly. But the length of a street cheered her young blood. Her step grew lighter; she began to take notice, instead of having her thoughts turned inward.\nShe saw unusual loiterers in the streets: men with their hands in their pockets sauntering along; loud-laughing girls clustered together, in high spirits, with a boisterous independence. Discreditable-looking men hung about on the steps of the beer-houses and gin-shops, smoking, and commenting pretty freely on every passer-by. Margaret disliked the prospect of the long walk through these streets, before she came to the fields which she had planned to reach. Instead, she would go and see Bessy Higgins.\nNicholas Higgins was sitting at one side of the fire smoking, as she went in. Bessy was rocking herself on the other side.\nNicholas took the pipe out of his mouth, and standing up, pushed his chair towards Margaret. He leant against the chimney piece, while she asked how Bessy was.\n'Hoo's rather down i' th' mouth, but hoo's better in health. Hoo doesn't like this strike. Hoo's a deal too much set on peace and quietness at any price.'\n'This is th' third strike I've seen,' said Bessy, sighing, as if that was explanation enough.\n'Well, third time pays for all. See if we don't dang th' masters this time. See if they don't beg us to come back at our own price, that's all. This time we'n laid our plans desperate deep.'\n'Why do you strike?' asked Margaret. 'Excuse my ignorance; where I come from I never heard of a strike.'\n'I wish I were there,' said Bessy, wearily. 'But this is the last strike I'll see. Before it's ended I shall be in the Great City - the Holy Jerusalem.'\n'Hoo's so full of th' life to come, hoo cannot think of th' present. Now I am bound to do the best I can here. So them's the different views we take on th' strike question.'\n'But,' said Margaret, 'if the people struck, where I come from, as they are mostly field labourers, the seed would not be sown, or the corn reaped. So what would become of the farmers?'\nHe puffed at his pipe. 'They'd have either to give up their farms, or to give fair rate of wage.'\n'Suppose they could not do the latter; they could not give up their farms all in a minute, but they would have no corn to sell that year; and where would the money come from to pay the labourers' wages the next?'\nStill puffing away, he said:\n'I know nought of your ways down South. I have heerd they're a pack of spiritless, down-trodden men; too much dazed wi' hunger to know when they're put upon. It's not so here. We know when we're put upon; and we won't stand it. Be danged to 'em, they shan't put upon us this time!'\n'I wish I lived down South,' said Bessy.\n'There are sorrows to bear everywhere,' said Margaret. 'There is very hard labour to be gone through there, with very little food to give strength.'\n'But it's out of doors,' said Bessy. 'And away from the endless, endless noise, and heat.'\n'It's sometimes in heavy rain, and sometimes in bitter cold. A young person can stand it; but an old man gets bent and withered before his time; yet he must just work on, or go to the workhouse.'\n'I thought yo' were so taken wi' the ways of the South country.'\n'So I am,' said Margaret, smiling. 'I only mean, Bessy, there's good and bad in everything in this world; and I thought it was only fair you should know the bad down there.'\n'And yo' say they never strike down there?' asked Nicholas, abruptly.\n'No!' said Margaret; 'I think they have too much sense.'\n'An' I think,' replied he, dashing the ashes out of his pipe vehemently, 'that they've too little spirit.'\n'O, father!' said Bessy, 'what have ye gained by striking? Think of that first strike when mother died - how we all had to clem and go hungry - you the worst of all; and yet many men went in every week at the same wage, and took all the jobs; and some went beggars after.'\n'Ay,' said he. 'That there strike was badly managed. It'll be different this time.'\n'But you've not told me what you're striking for,' said Margaret.\n'Why, yo' see, there's five or six masters who have set themselves against paying the wages they've been paying these two years past. Now they say we're to take less. And we won't. We'll just clem them to death first; and see who'll work for 'em then. They'll have killed the goose that laid the golden eggs, I reckon.'\n'And so you plan dying, in order to be revenged upon them!'\n'No,' said he, 'I dunnot. But I'd die at my post sooner than yield. That's what folk call fine and honourable in a soldier, and why not in a poor weaver?'\n'But,' said Margaret, 'a soldier dies for his country - for others.'\nHe laughed grimly. 'My lass,' said he, 'do yo' think I can keep three people - Bessy, and Mary, and me - on sixteen shilling a week? It's not for mysel' I'm striking. Yon soldier might die for somebody he never clapt eyes on, while I take up John Boucher's cause, as lives next door but one, wi' a sickly wife, and eight childer, even though he's a poor good-for-nought, as can only manage two looms at a time - but I take up th' cause o' justice. Why are we to have less wage now, I ask, than two year ago?'\n'Don't ask me,' said Margaret. 'Ask some of your masters. Surely they will give you a reason.'\n'Much yo' know about it,' said he, contemptuously. 'Ask th' masters! They'd tell us to mind our own business. Our business being, yo' understand, to take the smaller wage, and be thankful, and their business to starve us, and swell their profits. That's what it is.'\n'But,' said Margaret, determined not to give way, although she saw she was irritating him, 'the state of trade may be such that they cannot pay you the same wage.'\n'State o' trade! That's just a piece o' masters' humbug. Th' masters keep th' state o' trade in their own hands; and use it like a bug-a-boo, to frighten naughty children into being good. I tell yo' they want to beat us down; and we have to stand up and fight hard for justice - not for ourselves alone, but for them round about us. We've getten money laid by; and we're resolved to stand and fall together; not a man on us will go in for less wage than th' Union says is our due. So I say, \"hooray for the strike,\" and let Thornton, Slickson, and Hamper, and the rest look to it!'\n'Thornton!' said Margaret. 'Mr. Thornton of Marlborough Street?'\n'Aye! Thornton o' Marlborough Mill.'\n'What sort of a master is he?'\n'Did yo' ever see a bulldog? Set a bulldog on hind legs, and dress him up in coat and breeches, and yo'n just getten John Thornton.'\n'Nay,' said Margaret, laughing, 'I deny that. Mr. Thornton is plain enough, but he's not like a bulldog.'\n'No! not in looks, I grant yo'. But let John Thornton get hold on a notion, and he'll stick to it like a bulldog. He's worth fighting wi', is John Thornton. As for Slickson, he'll wheedle his men back wi' fair promises, and cheat them as soon as they're in his power again. He's as slippery as an eel, he is. It'll never be an honest up and down fight wi' him, as it will be wi' Thornton. Thornton's as dour as a door-nail.'\n'Poor Bessy!' said Margaret, turning to her. 'You sigh over it all. You don't like fighting, do you?'\n'No!' said she, heavily. 'I'm sick on it. I've been wearied all my life wi' the clashing and clattering about work and wages.'\n'Poor wench! Thou'rt looking a sight better already for a little stir and change. Besides, I shall be home to make it more lively for thee.'\n'Tobacco-smoke chokes me!' said she, querulously.\n'Then I'll never smoke i' th' house!' he replied tenderly. 'But why didst thou not tell me afore, thou foolish wench?'\nShe answered so low that only Margaret heard her: 'He'll want a' the comfort he can get out o' either pipe or drink afore he's done.'\nHer father went outside to finish his pipe, and Bessy said passionately,\n'Now am not I a fool? I knew I ought to keep father at home, and away fro' the folk that are always ready for to tempt a man, in time o' strike, to go drink - and now he'll go off, I know he will, whenever he wants to smoke - and nobody knows where it'll end.'\n'But does your father drink?' asked Margaret.\n'No - not to say drink,' replied she, still in the same wild tone. 'But there are days when yo're just longing for a bit of a change - a bit of a fillip, as it were. I've longed for to be a man, and to go spreeing. And men have the feeling stronger than me. And what is 'em to do? It's little blame if they do go into th' gin-shop to make their blood flow more lively. But father never was a drunkard, though maybe he's got worse for drink now and then. Only yo' see,' and now her voice took a mournful, pleading tone, 'at times o' strike there's much to knock a man down, for all they start so hopefully; and where's the comfort to come fro'? He'll get angry and mad - they all do - and maybe do things in their passion they'd be glad to forget. Bless your sweet pitiful face! but yo' dunnot know what a strike is yet.'\n'Come, Bessy,' said Margaret, 'I won't say you're exaggerating, because I don't know enough about it: but, perhaps, as you're not well, you're only looking on the dark side.'\n'It's well enough for yo' to say, who have lived in pleasant green places all your life, and never known want or wickedness.'\n'Take care how you judge,' said Margaret, flushing. 'I shall go home to my mother, who is so ill that only death will free her from her great suffering; and yet I must speak cheerfully to my father, who has no notion of her real state. The only person who could help me - who could comfort my mother more than any other - is falsely accused, and would risk death if he came to see her. You must not mention this, Bessy. No other person in Milton knows it. I know anxiety, though I go about well-dressed, and have food enough. Oh, Bessy, God is just, and our lots are well portioned out by Him, although none but He knows the bitterness of our souls.'\n'I ask your pardon,' replied Bessy humbly. 'Sometimes, when I've thought o' my life, and the little pleasure I've had in it, I think I'm one of them as is prophesied to die in Revelations. Otherwise it seems all for nothing.'\n'Nay, Bessy!' said Margaret. 'God does not willingly afflict. Don't dwell so much on the prophecies, but read the clearer parts of the Bible.'\n'I dare say it would be wiser; but where would I hear such grand words of promise as in Revelations? Many's the time I've repeated the seventh chapter to myself, just for the sound. It's as good as an organ. It gives me more comfort than any other book i' the Bible.'\n'Let me come and read you some of my favourite chapters.'\n'Ay,' said she, greedily, 'come. Father will maybe hear yo'.'\n'Now I must go. You have done me good, Bessy.'\n'I done you good!'\n'Yes. I came here very sad, and thinking my own cause for grief was the only one in the world. And now I hear what you have had to bear for years, and that makes me stronger.'\n'Bless yo'! I shall get proud if I think I can do yo' good. Yo're not like no one I ever seed. I dunno what to make of yo'.'\n'Nor I of myself. Good-bye!'\nBessy gazed after her.\n'I wonder if there are many folk like her down South. She's like a breath of country air, somehow. Who'd ha' thought that bright face could have known the sorrow she speaks on? I wonder how she'll sin. All on us must sin. I think of her a lot, for sure. But father does the same. And Mary even. It's not often hoo's stirred up to notice much.'\n.",
        "paragraph_chars": [
            [
                0,
                190
            ],
            [
                190,
                697
            ],
            [
                697,
                820
            ],
            [
                820,
                980
            ],
            [
                980,
                1135
            ],
            [
                1135,
                1229
            ],
            [
                1229,
                1420
            ],
            [
                1420,
                1525
            ],
            [
                1525,
                1678
            ],
            [
                1678,
                1852
            ],
            [
                1852,
                2038
            ],
            [
                2038,
                2136
            ],
            [
                2136,
                2349
            ],
            [
                2349,
                2378
            ],
            [
                2378,
                2660
            ],
            [
                2660,
                2701
            ],
            [
                2701,
                2850
            ],
            [
                2850,
                2941
            ],
            [
                2941,
                3137
            ],
            [
                3137,
                3202
            ],
            [
                3202,
                3376
            ],
            [
                3376,
                3446
            ],
            [
                3446,
                3503
            ],
            [
                3503,
                3610
            ],
            [
                3610,
                3883
            ],
            [
                3883,
                3967
            ],
            [
                3967,
                4033
            ],
            [
                4033,
                4353
            ],
            [
                4353,
                4413
            ],
            [
                4413,
                4568
            ],
            [
                4568,
                4637
            ],
            [
                4637,
                5146
            ],
            [
                5146,
                5241
            ],
            [
                5241,
                5508
            ],
            [
                5508,
                5672
            ],
            [
                5672,
                6254
            ],
            [
                6254,
                6319
            ],
            [
                6319,
                6356
            ],
            [
                6356,
                6387
            ],
            [
                6387,
                6520
            ],
            [
                6520,
                6626
            ],
            [
                6626,
                7051
            ],
            [
                7051,
                7153
            ],
            [
                7153,
                7280
            ],
            [
                7280,
                7421
            ],
            [
                7421,
                7471
            ],
            [
                7471,
                7590
            ],
            [
                7590,
                7724
            ],
            [
                7724,
                7797
            ],
            [
                7797,
                8058
            ],
            [
                8058,
                8104
            ],
            [
                8104,
                8925
            ],
            [
                8925,
                9100
            ],
            [
                9100,
                9226
            ],
            [
                9226,
                9877
            ],
            [
                9877,
                10103
            ],
            [
                10103,
                10246
            ],
            [
                10246,
                10514
            ],
            [
                10514,
                10572
            ],
            [
                10572,
                10634
            ],
            [
                10634,
                10681
            ],
            [
                10681,
                10700
            ],
            [
                10700,
                10876
            ],
            [
                10876,
                11001
            ],
            [
                11001,
                11030
            ],
            [
                11030,
                11053
            ],
            [
                11053,
                11397
            ],
            [
                11397,
                11398
            ]
        ],
        "segment_chars": [
            [
                0,
                43
            ],
            [
                43,
                95
            ],
            [
                95,
                190
            ],
            [
                190,
                377
            ],
            [
                377,
                519
            ],
            [
                519,
                652
            ],
            [
                652,
                697
            ],
            [
                697,
                775
            ],
            [
                775,
                820
            ],
            [
                820,
                913
            ],
            [
                913,
                980
            ],
            [
                980,
                1041
            ],
            [
                1041,
                1071
            ],
            [
                1071,
                1135
            ],
            [
                1135,
                1229
            ],
            [
                1229,
                1261
            ],
            [
                1261,
                1305
            ],
            [
                1305,
                1373
            ],
            [
                1373,
                1420
            ],
            [
                1420,
                1441
            ],
            [
                1441,
                1457
            ],
            [
                1457,
                1525
            ],
            [
                1525,
                1569
            ],
            [
                1569,
                1608
            ],
            [
                1608,
                1678
            ],
            [
                1678,
                1747
            ],
            [
                1747,
                1789
            ],
            [
                1789,
                1852
            ],
            [
                1852,
                2000
            ],
            [
                2000,
                2038
            ],
            [
                2038,
                2061
            ],
            [
                2061,
                2136
            ],
            [
                2136,
                2349
            ],
            [
                2349,
                2378
            ],
            [
                2378,
                2418
            ],
            [
                2418,
                2536
            ],
            [
                2536,
                2554
            ],
            [
                2554,
                2606
            ],
            [
                2606,
                2660
            ],
            [
                2660,
                2701
            ],
            [
                2701,
                2756
            ],
            [
                2756,
                2850
            ],
            [
                2850,
                2887
            ],
            [
                2887,
                2941
            ],
            [
                2941,
                3002
            ],
            [
                3002,
                3137
            ],
            [
                3137,
                3202
            ],
            [
                3202,
                3237
            ],
            [
                3237,
                3376
            ],
            [
                3376,
                3420
            ],
            [
                3420,
                3446
            ],
            [
                3446,
                3452
            ],
            [
                3452,
                3503
            ],
            [
                3503,
                3610
            ],
            [
                3610,
                3623
            ],
            [
                3623,
                3669
            ],
            [
                3669,
                3883
            ],
            [
                3883,
                3898
            ],
            [
                3898,
                3936
            ],
            [
                3936,
                3967
            ],
            [
                3967,
                4033
            ],
            [
                4033,
                4167
            ],
            [
                4167,
                4200
            ],
            [
                4200,
                4214
            ],
            [
                4214,
                4285
            ],
            [
                4285,
                4353
            ],
            [
                4353,
                4413
            ],
            [
                4413,
                4439
            ],
            [
                4439,
                4481
            ],
            [
                4481,
                4568
            ],
            [
                4568,
                4637
            ],
            [
                4637,
                4656
            ],
            [
                4656,
                4770
            ],
            [
                4770,
                4804
            ],
            [
                4804,
                5085
            ],
            [
                5085,
                5146
            ],
            [
                5146,
                5177
            ],
            [
                5177,
                5204
            ],
            [
                5204,
                5241
            ],
            [
                5241,
                5292
            ],
            [
                5292,
                5310
            ],
            [
                5310,
                5351
            ],
            [
                5351,
                5488
            ],
            [
                5488,
                5508
            ],
            [
                5508,
                5672
            ],
            [
                5672,
                5689
            ],
            [
                5689,
                5729
            ],
            [
                5729,
                5860
            ],
            [
                5860,
                6005
            ],
            [
                6005,
                6153
            ],
            [
                6153,
                6254
            ],
            [
                6254,
                6266
            ],
            [
                6266,
                6281
            ],
            [
                6281,
                6286
            ],
            [
                6286,
                6319
            ],
            [
                6319,
                6325
            ],
            [
                6325,
                6356
            ],
            [
                6356,
                6387
            ],
            [
                6387,
                6416
            ],
            [
                6416,
                6520
            ],
            [
                6520,
                6566
            ],
            [
                6566,
                6626
            ],
            [
                6626,
                6631
            ],
            [
                6631,
                6658
            ],
            [
                6658,
                6740
            ],
            [
                6740,
                6783
            ],
            [
                6783,
                6900
            ],
            [
                6900,
                6935
            ],
            [
                6935,
                7015
            ],
            [
                7015,
                7051
            ],
            [
                7051,
                7065
            ],
            [
                7065,
                7096
            ],
            [
                7096,
                7119
            ],
            [
                7119,
                7153
            ],
            [
                7153,
                7159
            ],
            [
                7159,
                7178
            ],
            [
                7178,
                7195
            ],
            [
                7195,
                7280
            ],
            [
                7280,
                7293
            ],
            [
                7293,
                7362
            ],
            [
                7362,
                7421
            ],
            [
                7421,
                7448
            ],
            [
                7448,
                7471
            ],
            [
                7471,
                7509
            ],
            [
                7509,
                7530
            ],
            [
                7530,
                7590
            ],
            [
                7590,
                7724
            ],
            [
                7724,
                7797
            ],
            [
                7797,
                7819
            ],
            [
                7819,
                8058
            ],
            [
                8058,
                8088
            ],
            [
                8088,
                8104
            ],
            [
                8104,
                8171
            ],
            [
                8171,
                8270
            ],
            [
                8270,
                8319
            ],
            [
                8319,
                8362
            ],
            [
                8362,
                8385
            ],
            [
                8385,
                8473
            ],
            [
                8473,
                8558
            ],
            [
                8558,
                8748
            ],
            [
                8748,
                8851
            ],
            [
                8851,
                8882
            ],
            [
                8882,
                8925
            ],
            [
                8925,
                9100
            ],
            [
                9100,
                9226
            ],
            [
                9226,
                9278
            ],
            [
                9278,
                9462
            ],
            [
                9462,
                9612
            ],
            [
                9612,
                9646
            ],
            [
                9646,
                9682
            ],
            [
                9682,
                9752
            ],
            [
                9752,
                9877
            ],
            [
                9877,
                9920
            ],
            [
                9920,
                10066
            ],
            [
                10066,
                10103
            ],
            [
                10103,
                10117
            ],
            [
                10117,
                10132
            ],
            [
                10132,
                10165
            ],
            [
                10165,
                10246
            ],
            [
                10246,
                10347
            ],
            [
                10347,
                10428
            ],
            [
                10428,
                10454
            ],
            [
                10454,
                10514
            ],
            [
                10514,
                10572
            ],
            [
                10572,
                10605
            ],
            [
                10605,
                10634
            ],
            [
                10634,
                10650
            ],
            [
                10650,
                10681
            ],
            [
                10681,
                10700
            ],
            [
                10700,
                10706
            ],
            [
                10706,
                10795
            ],
            [
                10795,
                10876
            ],
            [
                10876,
                10888
            ],
            [
                10888,
                10936
            ],
            [
                10936,
                10971
            ],
            [
                10971,
                11001
            ],
            [
                11001,
                11019
            ],
            [
                11019,
                11030
            ],
            [
                11030,
                11053
            ],
            [
                11053,
                11107
            ],
            [
                11107,
                11152
            ],
            [
                11152,
                11230
            ],
            [
                11230,
                11255
            ],
            [
                11255,
                11275
            ],
            [
                11275,
                11307
            ],
            [
                11307,
                11333
            ],
            [
                11333,
                11348
            ],
            [
                11348,
                11397
            ],
            [
                11397,
                11398
            ]
        ],
        "overlap_chars": [
            [
                0,
                41
            ],
            [
                41,
                43
            ],
            [
                43,
                69
            ],
            [
                78,
                93
            ],
            [
                93,
                95
            ],
            [
                95,
                116
            ],
            [
                118,
                181
            ],
            [
                182,
                189
            ],
            [
                190,
                301
            ],
            [
                302,
                327
            ],
            [
                331,
                344
            ],
            [
                350,
                375
            ],
            [
                375,
                377
            ],
            [
                377,
                390
            ],
            [
                390,
                398
            ],
            [
                399,
                402
            ],
            [
                403,
                519
            ],
            [
                519,
                652
            ],
            [
                652,
                696
            ],
            [
                697,
                725
            ],
            [
                741,
                775
            ],
            [
                775,
                820
            ],
            [
                820,
                911
            ],
            [
                913,
                941
            ],
            [
                942,
                947
            ],
            [
                947,
                964
            ],
            [
                965,
                968
            ],
            [
                969,
                974
            ],
            [
                975,
                980
            ],
            [
                981,
                1011
            ],
            [
                1011,
                1041
            ],
            [
                1041,
                1071
            ],
            [
                1071,
                1099
            ],
            [
                1106,
                1132
            ],
            [
                1141,
                1170
            ],
            [
                1173,
                1177
            ],
            [
                1183,
                1208
            ],
            [
                1209,
                1229
            ],
            [
                1230,
                1261
            ],
            [
                1261,
                1305
            ],
            [
                1305,
                1322
            ],
            [
                1323,
                1359
            ],
            [
                1361,
                1373
            ],
            [
                1373,
                1417
            ],
            [
                1421,
                1438
            ],
            [
                1441,
                1457
            ],
            [
                1465,
                1522
            ],
            [
                1526,
                1545
            ],
            [
                1548,
                1557
            ],
            [
                1558,
                1569
            ],
            [
                1569,
                1570
            ],
            [
                1570,
                1573
            ],
            [
                1574,
                1590
            ],
            [
                1598,
                1608
            ],
            [
                1608,
                1654
            ],
            [
                1657,
                1675
            ],
            [
                1679,
                1747
            ],
            [
                1747,
                1752
            ],
            [
                1753,
                1789
            ],
            [
                1789,
                1849
            ],
            [
                1853,
                1856
            ],
            [
                1859,
                1873
            ],
            [
                1875,
                1895
            ],
            [
                1895,
                1934
            ],
            [
                1935,
                1979
            ],
            [
                1983,
                1998
            ],
            [
                2003,
                2035
            ],
            [
                2038,
                2047
            ],
            [
                2059,
                2061
            ],
            [
                2066,
                2133
            ],
            [
                2141,
                2159
            ],
            [
                2160,
                2166
            ],
            [
                2173,
                2226
            ],
            [
                2227,
                2249
            ],
            [
                2250,
                2346
            ],
            [
                2349,
                2367
            ],
            [
                2369,
                2378
            ],
            [
                2379,
                2418
            ],
            [
                2418,
                2478
            ],
            [
                2479,
                2482
            ],
            [
                2488,
                2497
            ],
            [
                2505,
                2536
            ],
            [
                2536,
                2554
            ],
            [
                2554,
                2556
            ],
            [
                2562,
                2589
            ],
            [
                2596,
                2606
            ],
            [
                2606,
                2635
            ],
            [
                2648,
                2657
            ],
            [
                2661,
                2662
            ],
            [
                2668,
                2686
            ],
            [
                2689,
                2701
            ],
            [
                2708,
                2738
            ],
            [
                2741,
                2755
            ],
            [
                2763,
                2775
            ],
            [
                2776,
                2801
            ],
            [
                2802,
                2807
            ],
            [
                2807,
                2847
            ],
            [
                2851,
                2872
            ],
            [
                2875,
                2887
            ],
            [
                2888,
                2933
            ],
            [
                2934,
                2938
            ],
            [
                2942,
                3002
            ],
            [
                3002,
                3050
            ],
            [
                3051,
                3110
            ],
            [
                3110,
                3114
            ],
            [
                3115,
                3134
            ],
            [
                3138,
                3150
            ],
            [
                3152,
                3199
            ],
            [
                3206,
                3210
            ],
            [
                3213,
                3235
            ],
            [
                3235,
                3237
            ],
            [
                3238,
                3311
            ],
            [
                3312,
                3328
            ],
            [
                3334,
                3373
            ],
            [
                3377,
                3383
            ],
            [
                3385,
                3417
            ],
            [
                3420,
                3434
            ],
            [
                3436,
                3446
            ],
            [
                3447,
                3449
            ],
            [
                3452,
                3466
            ],
            [
                3468,
                3500
            ],
            [
                3504,
                3515
            ],
            [
                3518,
                3563
            ],
            [
                3574,
                3575
            ],
            [
                3577,
                3607
            ],
            [
                3612,
                3620
            ],
            [
                3623,
                3634
            ],
            [
                3636,
                3669
            ],
            [
                3669,
                3712
            ],
            [
                3715,
                3737
            ],
            [
                3754,
                3788
            ],
            [
                3793,
                3829
            ],
            [
                3839,
                3842
            ],
            [
                3851,
                3874
            ],
            [
                3875,
                3880
            ],
            [
                3884,
                3886
            ],
            [
                3889,
                3898
            ],
            [
                3904,
                3936
            ],
            [
                3936,
                3964
            ],
            [
                3968,
                3971
            ],
            [
                3972,
                4015
            ],
            [
                4018,
                4031
            ],
            [
                4031,
                4033
            ],
            [
                4034,
                4041
            ],
            [
                4043,
                4099
            ],
            [
                4108,
                4165
            ],
            [
                4165,
                4167
            ],
            [
                4167,
                4175
            ],
            [
                4176,
                4200
            ],
            [
                4200,
                4214
            ],
            [
                4214,
                4285
            ],
            [
                4285,
                4324
            ],
            [
                4325,
                4350
            ],
            [
                4354,
                4410
            ],
            [
                4414,
                4416
            ],
            [
                4419,
                4427
            ],
            [
                4429,
                4439
            ],
            [
                4443,
                4444
            ],
            [
                4451,
                4481
            ],
            [
                4481,
                4565
            ],
            [
                4569,
                4572
            ],
            [
                4575,
                4589
            ],
            [
                4591,
                4605
            ],
            [
                4628,
                4634
            ],
            [
                4637,
                4656
            ],
            [
                4660,
                4664
            ],
            [
                4667,
                4675
            ],
            [
                4680,
                4682
            ],
            [
                4684,
                4713
            ],
            [
                4716,
                4739
            ],
            [
                4742,
                4755
            ],
            [
                4762,
                4770
            ],
            [
                4770,
                4774
            ],
            [
                4779,
                4802
            ],
            [
                4808,
                4815
            ],
            [
                4826,
                4829
            ],
            [
                4830,
                4861
            ],
            [
                4861,
                4966
            ],
            [
                4972,
                5046
            ],
            [
                5049,
                5085
            ],
            [
                5085,
                5143
            ],
            [
                5150,
                5159
            ],
            [
                5162,
                5175
            ],
            [
                5175,
                5177
            ],
            [
                5178,
                5204
            ],
            [
                5204,
                5238
            ],
            [
                5247,
                5249
            ],
            [
                5251,
                5264
            ],
            [
                5267,
                5291
            ],
            [
                5293,
                5310
            ],
            [
                5310,
                5349
            ],
            [
                5349,
                5351
            ],
            [
                5351,
                5373
            ],
            [
                5375,
                5398
            ],
            [
                5407,
                5428
            ],
            [
                5428,
                5429
            ],
            [
                5430,
                5451
            ],
            [
                5459,
                5461
            ],
            [
                5467,
                5488
            ],
            [
                5488,
                5505
            ],
            [
                5509,
                5512
            ],
            [
                5515,
                5598
            ],
            [
                5600,
                5630
            ],
            [
                5652,
                5664
            ],
            [
                5679,
                5689
            ],
            [
                5689,
                5729
            ],
            [
                5729,
                5788
            ],
            [
                5793,
                5795
            ],
            [
                5796,
                5802
            ],
            [
                5803,
                5842
            ],
            [
                5843,
                5860
            ],
            [
                5860,
                5861
            ],
            [
                5862,
                5866
            ],
            [
                5881,
                5896
            ],
            [
                5896,
                5901
            ],
            [
                5910,
                5936
            ],
            [
                5937,
                5948
            ],
            [
                5951,
                6003
            ],
            [
                6003,
                6005
            ],
            [
                6005,
                6007
            ],
            [
                6011,
                6153
            ],
            [
                6153,
                6162
            ],
            [
                6164,
                6185
            ],
            [
                6188,
                6205
            ],
            [
                6206,
                6231
            ],
            [
                6241,
                6251
            ],
            [
                6259,
                6263
            ],
            [
                6266,
                6281
            ],
            [
                6284,
                6285
            ],
            [
                6286,
                6316
            ],
            [
                6320,
                6325
            ],
            [
                6325,
                6353
            ],
            [
                6357,
                6384
            ],
            [
                6392,
                6416
            ],
            [
                6416,
                6517
            ],
            [
                6521,
                6524
            ],
            [
                6527,
                6551
            ],
            [
                6553,
                6566
            ],
            [
                6566,
                6623
            ],
            [
                6627,
                6631
            ],
            [
                6631,
                6637
            ],
            [
                6643,
                6655
            ],
            [
                6658,
                6738
            ],
            [
                6738,
                6740
            ],
            [
                6740,
                6783
            ],
            [
                6783,
                6799
            ],
            [
                6800,
                6844
            ],
            [
                6844,
                6845
            ],
            [
                6861,
                6900
            ],
            [
                6900,
                6935
            ],
            [
                6935,
                7015
            ],
            [
                7015,
                7048
            ],
            [
                7052,
                7062
            ],
            [
                7065,
                7087
            ],
            [
                7088,
                7096
            ],
            [
                7097,
                7119
            ],
            [
                7119,
                7133
            ],
            [
                7134,
                7142
            ],
            [
                7142,
                7150
            ],
            [
                7154,
                7156
            ],
            [
                7159,
                7178
            ],
            [
                7179,
                7195
            ],
            [
                7195,
                7196
            ],
            [
                7205,
                7212
            ],
            [
                7217,
                7224
            ],
            [
                7227,
                7228
            ],
            [
                7229,
                7248
            ],
            [
                7248,
                7256
            ],
            [
                7257,
                7277
            ],
            [
                7281,
                7293
            ],
            [
                7293,
                7362
            ],
            [
                7369,
                7381
            ],
            [
                7387,
                7418
            ],
            [
                7423,
                7445
            ],
            [
                7448,
                7471
            ],
            [
                7477,
                7493
            ],
            [
                7494,
                7496
            ],
            [
                7501,
                7506
            ],
            [
                7509,
                7519
            ],
            [
                7520,
                7530
            ],
            [
                7531,
                7587
            ],
            [
                7590,
                7593
            ],
            [
                7603,
                7639
            ],
            [
                7641,
                7721
            ],
            [
                7724,
                7739
            ],
            [
                7748,
                7766
            ],
            [
                7766,
                7767
            ],
            [
                7772,
                7797
            ],
            [
                7797,
                7798
            ],
            [
                7798,
                7817
            ],
            [
                7817,
                7818
            ],
            [
                7819,
                7833
            ],
            [
                7834,
                7953
            ],
            [
                7956,
                7959
            ],
            [
                7964,
                7993
            ],
            [
                8003,
                8020
            ],
            [
                8023,
                8055
            ],
            [
                8059,
                8085
            ],
            [
                8094,
                8104
            ],
            [
                8105,
                8107
            ],
            [
                8110,
                8126
            ],
            [
                8129,
                8164
            ],
            [
                8165,
                8171
            ],
            [
                8171,
                8172
            ],
            [
                8176,
                8190
            ],
            [
                8191,
                8198
            ],
            [
                8202,
                8236
            ],
            [
                8239,
                8270
            ],
            [
                8270,
                8297
            ],
            [
                8297,
                8298
            ],
            [
                8303,
                8317
            ],
            [
                8317,
                8319
            ],
            [
                8319,
                8322
            ],
            [
                8323,
                8326
            ],
            [
                8327,
                8331
            ],
            [
                8344,
                8352
            ],
            [
                8353,
                8360
            ],
            [
                8360,
                8362
            ],
            [
                8362,
                8385
            ],
            [
                8385,
                8402
            ],
            [
                8403,
                8434
            ],
            [
                8435,
                8459
            ],
            [
                8460,
                8471
            ],
            [
                8471,
                8473
            ],
            [
                8473,
                8518
            ],
            [
                8519,
                8543
            ],
            [
                8544,
                8558
            ],
            [
                8558,
                8570
            ],
            [
                8573,
                8622
            ],
            [
                8624,
                8748
            ],
            [
                8748,
                8771
            ],
            [
                8774,
                8785
            ],
            [
                8788,
                8797
            ],
            [
                8801,
                8851
            ],
            [
                8851,
                8856
            ],
            [
                8862,
                8882
            ],
            [
                8882,
                8922
            ],
            [
                8926,
                8937
            ],
            [
                8940,
                8954
            ],
            [
                8956,
                9083
            ],
            [
                9093,
                9097
            ],
            [
                9101,
                9105
            ],
            [
                9106,
                9132
            ],
            [
                9132,
                9187
            ],
            [
                9187,
                9212
            ],
            [
                9213,
                9223
            ],
            [
                9232,
                9236
            ],
            [
                9237,
                9250
            ],
            [
                9253,
                9267
            ],
            [
                9268,
                9276
            ],
            [
                9276,
                9278
            ],
            [
                9279,
                9322
            ],
            [
                9323,
                9327
            ],
            [
                9333,
                9338
            ],
            [
                9349,
                9352
            ],
            [
                9358,
                9460
            ],
            [
                9460,
                9462
            ],
            [
                9462,
                9477
            ],
            [
                9478,
                9487
            ],
            [
                9488,
                9495
            ],
            [
                9502,
                9545
            ],
            [
                9548,
                9566
            ],
            [
                9568,
                9571
            ],
            [
                9572,
                9577
            ],
            [
                9578,
                9582
            ],
            [
                9583,
                9606
            ],
            [
                9610,
                9612
            ],
            [
                9612,
                9632
            ],
            [
                9633,
                9637
            ],
            [
                9637,
                9645
            ],
            [
                9646,
                9671
            ],
            [
                9672,
                9677
            ],
            [
                9680,
                9682
            ],
            [
                9682,
                9683
            ],
            [
                9684,
                9750
            ],
            [
                9752,
                9874
            ],
            [
                9878,
                9895
            ],
            [
                9898,
                9911
            ],
            [
                9912,
                9920
            ],
            [
                9930,
                10003
            ],
            [
                10010,
                10011
            ],
            [
                10014,
                10020
            ],
            [
                10029,
                10031
            ],
            [
                10043,
                10049
            ],
            [
                10066,
                10071
            ],
            [
                10076,
                10088
            ],
            [
                10089,
                10100
            ],
            [
                10104,
                10114
            ],
            [
                10117,
                10132
            ],
            [
                10133,
                10155
            ],
            [
                10163,
                10165
            ],
            [
                10165,
                10243
            ],
            [
                10246,
                10247
            ],
            [
                10247,
                10327
            ],
            [
                10328,
                10347
            ],
            [
                10347,
                10376
            ],
            [
                10377,
                10428
            ],
            [
                10428,
                10452
            ],
            [
                10452,
                10454
            ],
            [
                10454,
                10511
            ],
            [
                10515,
                10569
            ],
            [
                10573,
                10575
            ],
            [
                10578,
                10586
            ],
            [
                10588,
                10597
            ],
            [
                10599,
                10605
            ],
            [
                10605,
                10630
            ],
            [
                10631,
                10633
            ],
            [
                10635,
                10650
            ],
            [
                10650,
                10678
            ],
            [
                10682,
                10697
            ],
            [
                10701,
                10704
            ],
            [
                10706,
                10731
            ],
            [
                10741,
                10795
            ],
            [
                10795,
                10809
            ],
            [
                10815,
                10873
            ],
            [
                10877,
                10888
            ],
            [
                10888,
                10925
            ],
            [
                10926,
                10928
            ],
            [
                10930,
                10934
            ],
            [
                10938,
                10971
            ],
            [
                10971,
                10997
            ],
            [
                11002,
                11019
            ],
            [
                11019,
                11027
            ],
            [
                11030,
                11035
            ],
            [
                11042,
                11053
            ],
            [
                11054,
                11107
            ],
            [
                11107,
                11152
            ],
            [
                11152,
                11157
            ],
            [
                11162,
                11174
            ],
            [
                11175,
                11181
            ],
            [
                11182,
                11186
            ],
            [
                11187,
                11230
            ],
            [
                11230,
                11255
            ],
            [
                11255,
                11275
            ],
            [
                11275,
                11282
            ],
            [
                11286,
                11289
            ],
            [
                11290,
                11291
            ],
            [
                11295,
                11307
            ],
            [
                11307,
                11326
            ],
            [
                11331,
                11333
            ],
            [
                11333,
                11348
            ],
            [
                11348,
                11394
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                43
            ],
            [
                43,
                95
            ],
            [
                95,
                190
            ],
            [
                190,
                377
            ],
            [
                377,
                519
            ],
            [
                519,
                652
            ],
            [
                652,
                697
            ],
            [
                697,
                697
            ],
            [
                697,
                775
            ],
            [
                775,
                820
            ],
            [
                820,
                980
            ],
            [
                980,
                1041
            ],
            [
                1041,
                1071
            ],
            [
                1071,
                1135
            ],
            [
                1135,
                1229
            ],
            [
                1229,
                1261
            ],
            [
                1261,
                1305
            ],
            [
                1305,
                1373
            ],
            [
                1373,
                1420
            ],
            [
                1420,
                1441
            ],
            [
                1441,
                1457
            ],
            [
                1457,
                1457
            ],
            [
                1457,
                1525
            ],
            [
                1525,
                1569
            ],
            [
                1569,
                1608
            ],
            [
                1608,
                1678
            ],
            [
                1678,
                1747
            ],
            [
                1747,
                1789
            ],
            [
                1789,
                1789
            ],
            [
                1789,
                1852
            ],
            [
                1852,
                2000
            ],
            [
                2000,
                2000
            ],
            [
                2000,
                2000
            ],
            [
                2000,
                2000
            ],
            [
                2000,
                2038
            ],
            [
                2038,
                2061
            ],
            [
                2061,
                2136
            ],
            [
                2136,
                2349
            ],
            [
                2349,
                2378
            ],
            [
                2378,
                2418
            ],
            [
                2418,
                2536
            ],
            [
                2536,
                2554
            ],
            [
                2554,
                2606
            ],
            [
                2606,
                2606
            ],
            [
                2606,
                2660
            ],
            [
                2660,
                2701
            ],
            [
                2701,
                2756
            ],
            [
                2756,
                2850
            ],
            [
                2850,
                2887
            ],
            [
                2887,
                2941
            ],
            [
                2941,
                3002
            ],
            [
                3002,
                3137
            ],
            [
                3137,
                3202
            ],
            [
                3202,
                3237
            ],
            [
                3237,
                3376
            ],
            [
                3376,
                3420
            ],
            [
                3420,
                3446
            ],
            [
                3446,
                3452
            ],
            [
                3452,
                3503
            ],
            [
                3503,
                3610
            ],
            [
                3610,
                3623
            ],
            [
                3623,
                3669
            ],
            [
                3669,
                3883
            ],
            [
                3883,
                3898
            ],
            [
                3898,
                3936
            ],
            [
                3936,
                3936
            ],
            [
                3936,
                3967
            ],
            [
                3967,
                4033
            ],
            [
                4033,
                4167
            ],
            [
                4167,
                4200
            ],
            [
                4200,
                4214
            ],
            [
                4214,
                4285
            ],
            [
                4285,
                4353
            ],
            [
                4353,
                4413
            ],
            [
                4413,
                4439
            ],
            [
                4439,
                4481
            ],
            [
                4481,
                4568
            ],
            [
                4568,
                4637
            ],
            [
                4637,
                4656
            ],
            [
                4656,
                4770
            ],
            [
                4770,
                4804
            ],
            [
                4804,
                5085
            ],
            [
                5085,
                5146
            ],
            [
                5146,
                5177
            ],
            [
                5177,
                5204
            ],
            [
                5204,
                5241
            ],
            [
                5241,
                5241
            ],
            [
                5241,
                5292
            ],
            [
                5292,
                5310
            ],
            [
                5310,
                5351
            ],
            [
                5351,
                5488
            ],
            [
                5488,
                5508
            ],
            [
                5508,
                5672
            ],
            [
                5672,
                5689
            ],
            [
                5689,
                5729
            ],
            [
                5729,
                5729
            ],
            [
                5729,
                5860
            ],
            [
                5860,
                6005
            ],
            [
                6005,
                6005
            ],
            [
                6005,
                6005
            ],
            [
                6005,
                6153
            ],
            [
                6153,
                6254
            ],
            [
                6254,
                6266
            ],
            [
                6266,
                6281
            ],
            [
                6281,
                6319
            ],
            [
                6319,
                6325
            ],
            [
                6325,
                6356
            ],
            [
                6356,
                6356
            ],
            [
                6356,
                6387
            ],
            [
                6387,
                6416
            ],
            [
                6416,
                6520
            ],
            [
                6520,
                6566
            ],
            [
                6566,
                6626
            ],
            [
                6626,
                6631
            ],
            [
                6631,
                6658
            ],
            [
                6658,
                6740
            ],
            [
                6740,
                6783
            ],
            [
                6783,
                6900
            ],
            [
                6900,
                6900
            ],
            [
                6900,
                6935
            ],
            [
                6935,
                6935
            ],
            [
                6935,
                7015
            ],
            [
                7015,
                7051
            ],
            [
                7051,
                7065
            ],
            [
                7065,
                7096
            ],
            [
                7096,
                7119
            ],
            [
                7119,
                7153
            ],
            [
                7153,
                7159
            ],
            [
                7159,
                7178
            ],
            [
                7178,
                7195
            ],
            [
                7195,
                7280
            ],
            [
                7280,
                7293
            ],
            [
                7293,
                7293
            ],
            [
                7293,
                7362
            ],
            [
                7362,
                7421
            ],
            [
                7421,
                7448
            ],
            [
                7448,
                7471
            ],
            [
                7471,
                7509
            ],
            [
                7509,
                7530
            ],
            [
                7530,
                7590
            ],
            [
                7590,
                7724
            ],
            [
                7724,
                7797
            ],
            [
                7797,
                8058
            ],
            [
                8058,
                8058
            ],
            [
                8058,
                8088
            ],
            [
                8088,
                8104
            ],
            [
                8104,
                8171
            ],
            [
                8171,
                8171
            ],
            [
                8171,
                8270
            ],
            [
                8270,
                8270
            ],
            [
                8270,
                8319
            ],
            [
                8319,
                8362
            ],
            [
                8362,
                8385
            ],
            [
                8385,
                8473
            ],
            [
                8473,
                8558
            ],
            [
                8558,
                8748
            ],
            [
                8748,
                8851
            ],
            [
                8851,
                8882
            ],
            [
                8882,
                8925
            ],
            [
                8925,
                9100
            ],
            [
                9100,
                9226
            ],
            [
                9226,
                9278
            ],
            [
                9278,
                9462
            ],
            [
                9462,
                9612
            ],
            [
                9612,
                9646
            ],
            [
                9646,
                9682
            ],
            [
                9682,
                9682
            ],
            [
                9682,
                9752
            ],
            [
                9752,
                9877
            ],
            [
                9877,
                9920
            ],
            [
                9920,
                10066
            ],
            [
                10066,
                10103
            ],
            [
                10103,
                10117
            ],
            [
                10117,
                10132
            ],
            [
                10132,
                10165
            ],
            [
                10165,
                10246
            ],
            [
                10246,
                10347
            ],
            [
                10347,
                10428
            ],
            [
                10428,
                10454
            ],
            [
                10454,
                10454
            ],
            [
                10454,
                10514
            ],
            [
                10514,
                10572
            ],
            [
                10572,
                10605
            ],
            [
                10605,
                10634
            ],
            [
                10634,
                10634
            ],
            [
                10634,
                10634
            ],
            [
                10634,
                10634
            ],
            [
                10634,
                10634
            ],
            [
                10634,
                10650
            ],
            [
                10650,
                10681
            ],
            [
                10681,
                10700
            ],
            [
                10700,
                10795
            ],
            [
                10795,
                10876
            ],
            [
                10876,
                10888
            ],
            [
                10888,
                10888
            ],
            [
                10888,
                10936
            ],
            [
                10936,
                10936
            ],
            [
                10936,
                10936
            ],
            [
                10936,
                10971
            ],
            [
                10971,
                11001
            ],
            [
                11001,
                11019
            ],
            [
                11019,
                11030
            ],
            [
                11030,
                11053
            ],
            [
                11053,
                11107
            ],
            [
                11107,
                11152
            ],
            [
                11152,
                11152
            ],
            [
                11152,
                11230
            ],
            [
                11230,
                11255
            ],
            [
                11255,
                11275
            ],
            [
                11275,
                11307
            ],
            [
                11307,
                11333
            ],
            [
                11333,
                11348
            ],
            [
                11348,
                11398
            ]
        ]
    }
}