{
    "original": {
        "text": "\"My heart revolts within me, and two voices Make themselves audible within my bosom.\" WALLENSTEIN.\nOn Margaret's return home she found two letters on the table: one was a note for her mother,--the other, which had come by the post, was evidently from her aunt Shaw--covered with foreign post-marks--thin, silvery, and rustling. She took up the other, and was examining it, when her father came in suddenly:\n\"So your mother is tired, and gone to bed early! I'm afraid, such a thundery day was not the best in the world for the doctor to see her. What did he say? Dixon tells me he spoke to you about her.\"\nMargaret hesitated. Her father's looks became more grave and anxious:\n\"He does not think her seriously ill?\"\n\"Not at present; she needs care, he says; he was very kind, and he said he would call again, and see how his medicines worked.\"\n\"Only care?--he did not recommend change of air?--he did not say this smoky town was doing her any harm, did he, Margaret?\"\n\"No! not a word,\" she replied, gravely. \"He was anxious, I think.\"\n\"Doctors have that anxious manner; its professional,\" said he.\nMargaret saw, in her father's nervous ways, that the first impression of possible danger was made upon his mind, in spite of all his making light of what she told him. He could not forget the subject,--could not pass from it to other things; he kept recurring to it through the evening, with an unwillingness to receive even the slightest unfavourable idea, which made Margaret inexpressibly sad.\n\"This letter is from Aunt Shaw, papa. She has got to Naples, and finds it too hot, so she has taken apartments at Sorrento. But I don't think she likes Italy.\"\n\"He did not say anything about diet, did he?\"\n\"It was to be nourishing, and digestible. Mamma's appetite is pretty good, I think.\"\n\"Yes! and that makes it all the more strange he should have thought of speaking about diet.\"\n\"I asked him, papa.\" Another pause. Then Margaret went on: \"Aunt Shaw says she has sent me some coral ornaments, papa: but,\" added Margaret, half smiling, \"she's afraid the Milton dissenters won't appreciate them. She has got all her ideas of Dissenters from the Quakers, has she not?\"\n\"If ever you hear or notice that your mother wishes for anything, be sure you let me know. I am so afraid she does not tell me always what she would like. Pray, see after that girl Mrs. Thornton named. If we had a good, efficient house-servant, Dixon could be constantly with her, and I'd answer for it we'd soon set her up amongst us, if care will do it. She's been very much tired of late, with the hot weather, and the difficulty of getting a servant. A little rest will put her quite to rights--eh, Margaret?\"\n\"I hope so,\" said Margaret,--but so sadly, that her father took notice of it. He pinched her cheek.\n\"Come; if you look so pale as this, I must rouge you up a little. Take care of yourself, child, or you'll be wanting the doctor next.\"\nBut he could not settle to anything that evening. He was continually going backwards and forwards, on laborious tiptoe, to see if his wife was still asleep. Margaret's heart ached at his restlessness--his trying to stifle and strangle the hideous fear that was looming out of the dark places of his heart.\nHe came back at last, somewhat comforted.\n\"She's awake now, Margaret. She quite smiled as she saw me standing by her. Just her old smile. And she says she feels refreshed, and ready for tea. Where's the note for her? She want's to see it. I'll read it to her while you make tea.\"\nThe note proved to be a formal invitation from Mrs. Thornton, to Mr., Mrs., and Miss Hale to dinner, on the twenty-first instant. Margaret was surprised to find an acceptance contemplated, after all she had learnt of sad probabilities during the day. But so it was. The idea of her husband's and daughter's going to this dinner had quite captivated Mrs. Hale's fancy, even before Margaret had heard the contents of the note. It was an event to diversify the monotony of the invalid's life; and she clung to the idea of their going, with even fretful pertinacity, when Margaret objected.\n\"Nay, Margaret: if she wishes it, I'm sure we'll both go willingly. She never would wish it unless she felt herself really stronger--really better than we thought she was, eh, Margaret?\" said Mr. Hale, anxiously, as she prepared to write the note of acceptance, the next day.\n\"Eh! Margaret?\" questioned he, with a nervous motion of his hands. It seemed cruel to refuse him the comfort he craved for. And besides, his passionate refusal to admit the existence of fear, almost inspired Margaret herself with hope.\n\"I do think she is better since last night,\" said she. \"Her eyes look brighter, and her complexion clearer.\"\n\"God bless you,\" said her father earnestly. \"But is it true? Yesterday was so sultry every one felt ill. It was a most unlucky day for Mr. Donaldson to see her on.\"\nSo he went away to his day's duties, now increased by the preparation of some lectures he had promised to deliver to the working people at a neighbouring Lyceum. He had chosen Ecclesiastical Architecture as his subject, rather more in accordance with his own taste and knowledge than as falling in with the character of the place or the desire for particular kinds of information among those to whom he was to lecture. And the institution itself, being in debt, was only too glad to get a gratis course from an educated and accomplished man like Mr. Hale, let the subject be what it might.\n\"Well, mother,\" asked Mr. Thornton that night, \"who have accepted your invitations for the twenty-first?\"\n\"Fanny, where are the notes? The Slicksons accept, Collingbrooks accept, Stephenses accept, Browns decline. Hales--father and daughter come--mother too great an invalid--Macphersons come, and Mr. Horsfall, and Mr. Young. I was thinking of asking the Porters, as the Browns can't come.\"\n\"Very good. Do you know, I'm really afraid Mrs. Hale is very far from well, from what Dr. Donaldson says.\"\n\"It's strange of them to accept a dinner-invitation if she's very ill,\" said Fanny.\n\"I didn't say very ill,\" said her brother, rather sharply. \"I only said far from well. They may not know it either.\" And then he suddenly remembered that, from what Dr. Donaldson had told him, Margaret, at any rate, must be aware of the exact state of the case.\n\"Very probably they are quite aware of what you said yesterday, John--of the great advantage it would be to them--to Mr. Hale, I mean, to be introduced to such people as the Stephenses and the Collingbrooks.\"\n\"I'm sure that motive would not influence them. No! I think I understand how it is.\"\n\"John!\" said Fanny, laughing in her little, weak, nervous way. \"How you profess to understand these Hales, and how you never will allow that we can know anything about them. Are they really so very different to most people one meets with?\"\nShe did not mean to vex him; but if she had intended it, she could not have done it more thoroughly. He chafed in silence, however, not deigning to reply to her question.\n\"They do not seem to me out of the common way,\" said Mrs. Thornton. \"He appears a worthy kind of man enough; rather too simple for trade--so it's perhaps as well he should have been a clergyman first, and now a teacher. She's a bit of a fine lady, with her invalidism; and as for the girl--she's the only one who puzzles me when I think about her,--which I don't often do. She seems to have a great notion of giving herself airs; and I can't make out why. I could almost fancy she thinks herself too good for her company at times. And yet they're not rich; from all I can hear they never have been.\"\n\"And she's not accomplished, mamma. She can't play.\"\n\"Go on, Fanny. What else; does she want to bring her up to your standard?\"\n\"Nay! John,\" said his mother, \"that speech of Fanny's did no harm. I myself heard Miss Hale say she could not play. If you would let us alone, we could perhaps like her, and see her merits.\"\n\"I'm sure I never could!\" murmured Fanny, protected by her mother. Mr. Thornton heard, but did not care to reply. He was walking up and down the dining-room, wishing that his mother would order candles, and allow him to set to work at either reading or writing, and so put a stop to the conversation. But he never thought of interfering in any of the small domestic regulations that Mrs. Thornton observed, in habitual remembrance of her old economies.\n\"Mother,\" said he, stopping, and bravely speaking out the truth, \"I wish you would like Miss Hale.\"\n\"Why,\" asked she, startled by his earnest, yet tender manner. \"You're never thinking of marrying her?--a girl without a penny.\"\n\"She would never have me,\" said he, with a short laugh.\n\"No, I don't think she would,\" answered his mother. \"She laughed in my face, when I praised her for speaking out something Mr. Bell had said in your favour. I liked the girl for doing so frankly, for it made me sure she had no thought of you; and the next minute she vexed me so by seeming to think---- Well, never mind! Only you're right in saying she's too good an opinion of herself to think of you! The saucy jade! I should like to know where she'd find a better!\"\n\"Well, as I'm just as much convinced of the truth of what you have been saying as you can be; and as I have no thought or expectation of ever asking her to be my wife, you'll believe me for the future that I'm quite disinterested in speaking about her. I foresee trouble for that girl--perhaps, want of motherly care--and I only wish you to be ready to be a friend to her, in case she needs one. Now, Fanny,\" said he, \"I trust you have delicacy enough to understand, that it is as great an injury to Miss Hale as to me--in fact, she would think it a greater--to suppose that I have any reason, more than I now give, for begging you and my mother to show her every kindly attention.\"\n\"I cannot forgive her her pride,\" said his mother; \"I will befriend her, if there is need, for your asking, John. I would befriend Jezebel herself if you asked me. But this girl, who turns up her nose at us all--who turns up her nose at you----\"\n\"Nay, mother; I have never yet put myself, and I mean never to put myself, within reach of her contempt.\"\n\"Contempt, indeed!\"--(One of Mrs. Thornton's expressive snorts.)--\"Don't go on speaking of Miss Hale, John, if I've to be kind to her. When I'm with her, I don't know if I like or dislike her most; but when I think of her, and hear you talk of her, I hate her. I can see she's given herself airs to you as well as if you'd told me out.\"\n\"And if she has,\" said he--and then he paused for a moment--then went on: \"I'm not a lad, to be cowed by a proud look from a woman, or to care for her misunderstanding me and my position. I can laugh at it!\"\n\"To be sure! and at her too, with her fine notions, and haughty tosses!\"\n\"I only wonder why you talk so much about her, then,\" said Fanny. \"I'm sure, I'm tired enough of the subject.\"\n\"Well!\" said her brother, with a shade of bitterness. \"Suppose we find some more agreeable subject. What do you say to a strike, by way of something pleasant to talk about?\"\n\"Have the hands actually turned out?\" asked Mrs. Thornton, with vivid interest.\n\"Hamper's men are actually out. Mine are working out their week, through fear of being prosecuted for breach of contract. I'd have had every one of them up and punished for it, that left his work before his time was out.\"\n\"The law expenses would have been more than the hands themselves were worth--a set of ungrateful naughts!\" said his mother.\n\"To be sure. But I'd have shown them how to keep my word, and how I mean them to keep their's. They know me by this time. Slickson's men are off--pretty certain he won't spend money in getting them punished. We're in for a turn-out, mother.\"\n\"I hope there are not many orders in hand?\"\n\"Of course there are. They know that well enough. But they don't quite understand all, though they think they do.\"\n\"What do you mean, John?\"\nCandles had been brought, and Fanny had taken up her interminable piece of worsted-work, over which she was yawning; throwing herself back in her chair, from time to time to gaze at vacancy, and think of nothing at her ease.\n\"Why,\" said he, \"the Americans are getting their yarns so into the general market, that our only chance is producing them at a lower rate. If we can't, we may shut up shop at once, and hands and masters alike go on tramp. Yet these fools go back to the prices paid three years ago--nay, some of their leaders quote Dickinson's price now--though they know as well as we do that, what with fines pressed out of their wages, as no honourable man would extort them, the real rate of wage paid at Dickinson's is less than at ours. Upon my word, mother, I wish the old combination laws were in force. It is too bad to find out that fools--ignorant, wayward men like these--just by uniting their silly heads, are to rule over the fortunes of those who bring all the wisdom that knowledge and experience, and often painful thought and anxiety, can give. The next thing will be--indeed, we've all but come to it now--that we shall have to go and ask--stand hat in hand--and humbly ask the secretary of the Spinner's Union to be so kind as to furnish us with labour at their own price. That's what they want--they, who haven't the sense to see that, if we don't get a fair share of the profits to compensate us for our wear and tear here in England, we can move off to some other country; and that, what with home and foreign competition, we are none of us likely to make above a fair share, and may be thankful enough if we can get that, in an average number of years.\"\n\"Can't you get hands from Ireland? I wouldn't keep these fellows a day. I'd teach them that I was master, and could employ what servants I liked.\"\n\"Yes! to be sure, I can; and will, too, if they go on long. It will be trouble and expense, and I fear there will be some danger; but I will do it, rather than give in.\"\n\"If there is to be all this extra expense, I'm sorry we're giving a dinner just now.\"\n\"So am I,--not because of the expense, but because I shall have much to think about, and many unexpected calls on my time. But we must have had Mr. Horsfall, and he does not stay in Milton long. And as for the others, we owe them dinners, and it's all one trouble.\"\nHe kept on with his restless walk--not speaking any more, but drawing a deep breath from time to time, as if endeavouring to throw off some annoying thought. Fanny asked her mother numerous small questions, all having nothing to do with the subject, which a wiser person would have perceived was occupying her attention. Consequently, she received many short answers. She was not sorry when, at ten o'clock, the servants filed in to prayers. These her mother always read,--first reading a chapter. They were now working steadily through the Old Testament. When prayers were ended, and his mother had wished him good-night, with that long steady look of hers which conveyed no expression of the tenderness that was in her heart, but yet had the intensity of a blessing, Mr. Thornton continued his walk. All his business plans had received a check, a sudden pull-up, from this approaching turn-out. The forethought of many anxious hours was thrown away, utterly wasted by their insane folly, which would injure themselves even more than him, though no one could set any limit to the mischief they were doing. And these were the men who thought themselves fitted to direct the masters in the disposal of their capital; Hamper had said, only this very day, that if he were ruined by the strike, he would start life again, comforted by the conviction that those who had brought it on were in a worse predicament than he himself,--for he had head as well as hands, while they had only hands; and if they drove away their market, they could not follow it, nor turn to anything else. But this thought was no consolation to Mr. Thornton. It might be that revenge gave him no pleasure; it might be that he valued the position he had earned with the sweat of his brow, so much that he keenly felt its being endangered by the ignorance or folly of others,--so keenly that he had no thoughts to spare for what would be the consequences of their conduct to themselves. He paced up and down, setting his teeth now and then. At last it struck two. The candles were flickering in their sockets. He lighted his own, muttering to himself:\n\"Once for all they shall know whom they have got to deal with. I can give them a fortnight,--no more. If they don't see their madness before the end of that time, I must have hands from Ireland. I believe it's Slickson's doing,--confound him and his dodges! He thought he was overstocked; so he seemed to yield at first, when the deputation came to him,--and of course, he only confirmed them in their folly, as he meant to do. That's where it spread from.\"",
        "paragraph_chars": [
            [
                0,
                99
            ],
            [
                99,
                407
            ],
            [
                407,
                605
            ],
            [
                605,
                675
            ],
            [
                675,
                714
            ],
            [
                714,
                842
            ],
            [
                842,
                966
            ],
            [
                966,
                1033
            ],
            [
                1033,
                1096
            ],
            [
                1096,
                1493
            ],
            [
                1493,
                1653
            ],
            [
                1653,
                1699
            ],
            [
                1699,
                1784
            ],
            [
                1784,
                1877
            ],
            [
                1877,
                2163
            ],
            [
                2163,
                2677
            ],
            [
                2677,
                2777
            ],
            [
                2777,
                2912
            ],
            [
                2912,
                3218
            ],
            [
                3218,
                3260
            ],
            [
                3260,
                3498
            ],
            [
                3498,
                4085
            ],
            [
                4085,
                4361
            ],
            [
                4361,
                4597
            ],
            [
                4597,
                4706
            ],
            [
                4706,
                4871
            ],
            [
                4871,
                5461
            ],
            [
                5461,
                5567
            ],
            [
                5567,
                5853
            ],
            [
                5853,
                5960
            ],
            [
                5960,
                6044
            ],
            [
                6044,
                6306
            ],
            [
                6306,
                6515
            ],
            [
                6515,
                6600
            ],
            [
                6600,
                6840
            ],
            [
                6840,
                7011
            ],
            [
                7011,
                7611
            ],
            [
                7611,
                7664
            ],
            [
                7664,
                7739
            ],
            [
                7739,
                7930
            ],
            [
                7930,
                8383
            ],
            [
                8383,
                8483
            ],
            [
                8483,
                8611
            ],
            [
                8611,
                8667
            ],
            [
                8667,
                9136
            ],
            [
                9136,
                9819
            ],
            [
                9819,
                10065
            ],
            [
                10065,
                10171
            ],
            [
                10171,
                10508
            ],
            [
                10508,
                10716
            ],
            [
                10716,
                10789
            ],
            [
                10789,
                10900
            ],
            [
                10900,
                11074
            ],
            [
                11074,
                11154
            ],
            [
                11154,
                11376
            ],
            [
                11376,
                11500
            ],
            [
                11500,
                11742
            ],
            [
                11742,
                11786
            ],
            [
                11786,
                11901
            ],
            [
                11901,
                11927
            ],
            [
                11927,
                12152
            ],
            [
                12152,
                13613
            ],
            [
                13613,
                13760
            ],
            [
                13760,
                13930
            ],
            [
                13930,
                14016
            ],
            [
                14016,
                14282
            ],
            [
                14282,
                16402
            ],
            [
                16402,
                16859
            ]
        ],
        "segment_chars": [
            [
                0,
                86
            ],
            [
                86,
                99
            ],
            [
                99,
                328
            ],
            [
                328,
                407
            ],
            [
                407,
                456
            ],
            [
                456,
                545
            ],
            [
                545,
                562
            ],
            [
                562,
                605
            ],
            [
                605,
                625
            ],
            [
                625,
                675
            ],
            [
                675,
                714
            ],
            [
                714,
                842
            ],
            [
                842,
                966
            ],
            [
                966,
                971
            ],
            [
                971,
                1006
            ],
            [
                1006,
                1033
            ],
            [
                1033,
                1096
            ],
            [
                1096,
                1264
            ],
            [
                1264,
                1493
            ],
            [
                1493,
                1531
            ],
            [
                1531,
                1617
            ],
            [
                1617,
                1653
            ],
            [
                1653,
                1699
            ],
            [
                1699,
                1741
            ],
            [
                1741,
                1784
            ],
            [
                1784,
                1790
            ],
            [
                1790,
                1877
            ],
            [
                1877,
                1898
            ],
            [
                1898,
                1913
            ],
            [
                1913,
                2091
            ],
            [
                2091,
                2163
            ],
            [
                2163,
                2254
            ],
            [
                2254,
                2318
            ],
            [
                2318,
                2365
            ],
            [
                2365,
                2519
            ],
            [
                2519,
                2618
            ],
            [
                2618,
                2677
            ],
            [
                2677,
                2755
            ],
            [
                2755,
                2777
            ],
            [
                2777,
                2843
            ],
            [
                2843,
                2912
            ],
            [
                2912,
                2962
            ],
            [
                2962,
                3069
            ],
            [
                3069,
                3218
            ],
            [
                3218,
                3260
            ],
            [
                3260,
                3288
            ],
            [
                3288,
                3336
            ],
            [
                3336,
                3356
            ],
            [
                3356,
                3409
            ],
            [
                3409,
                3435
            ],
            [
                3435,
                3457
            ],
            [
                3457,
                3498
            ],
            [
                3498,
                3628
            ],
            [
                3628,
                3749
            ],
            [
                3749,
                3764
            ],
            [
                3764,
                3923
            ],
            [
                3923,
                4085
            ],
            [
                4085,
                4153
            ],
            [
                4153,
                4272
            ],
            [
                4272,
                4361
            ],
            [
                4361,
                4366
            ],
            [
                4366,
                4377
            ],
            [
                4377,
                4428
            ],
            [
                4428,
                4485
            ],
            [
                4485,
                4597
            ],
            [
                4597,
                4652
            ],
            [
                4652,
                4706
            ],
            [
                4706,
                4750
            ],
            [
                4750,
                4767
            ],
            [
                4767,
                4811
            ],
            [
                4811,
                4871
            ],
            [
                4871,
                5033
            ],
            [
                5033,
                5290
            ],
            [
                5290,
                5461
            ],
            [
                5461,
                5567
            ],
            [
                5567,
                5596
            ],
            [
                5596,
                5675
            ],
            [
                5675,
                5788
            ],
            [
                5788,
                5853
            ],
            [
                5853,
                5865
            ],
            [
                5865,
                5960
            ],
            [
                5960,
                6044
            ],
            [
                6044,
                6103
            ],
            [
                6103,
                6131
            ],
            [
                6131,
                6161
            ],
            [
                6161,
                6306
            ],
            [
                6306,
                6515
            ],
            [
                6515,
                6563
            ],
            [
                6563,
                6567
            ],
            [
                6567,
                6600
            ],
            [
                6600,
                6608
            ],
            [
                6608,
                6663
            ],
            [
                6663,
                6774
            ],
            [
                6774,
                6840
            ],
            [
                6840,
                6941
            ],
            [
                6941,
                7011
            ],
            [
                7011,
                7079
            ],
            [
                7079,
                7231
            ],
            [
                7231,
                7384
            ],
            [
                7384,
                7467
            ],
            [
                7467,
                7542
            ],
            [
                7542,
                7611
            ],
            [
                7611,
                7647
            ],
            [
                7647,
                7664
            ],
            [
                7664,
                7679
            ],
            [
                7679,
                7739
            ],
            [
                7739,
                7745
            ],
            [
                7745,
                7806
            ],
            [
                7806,
                7855
            ],
            [
                7855,
                7930
            ],
            [
                7930,
                7956
            ],
            [
                7956,
                7997
            ],
            [
                7997,
                8044
            ],
            [
                8044,
                8231
            ],
            [
                8231,
                8383
            ],
            [
                8383,
                8483
            ],
            [
                8483,
                8545
            ],
            [
                8545,
                8611
            ],
            [
                8611,
                8667
            ],
            [
                8667,
                8719
            ],
            [
                8719,
                8824
            ],
            [
                8824,
                8988
            ],
            [
                8988,
                9070
            ],
            [
                9070,
                9086
            ],
            [
                9086,
                9136
            ],
            [
                9136,
                9389
            ],
            [
                9389,
                9532
            ],
            [
                9532,
                9819
            ],
            [
                9819,
                9933
            ],
            [
                9933,
                9983
            ],
            [
                9983,
                10065
            ],
            [
                10065,
                10171
            ],
            [
                10171,
                10190
            ],
            [
                10190,
                10235
            ],
            [
                10235,
                10306
            ],
            [
                10306,
                10432
            ],
            [
                10432,
                10508
            ],
            [
                10508,
                10696
            ],
            [
                10696,
                10716
            ],
            [
                10716,
                10729
            ],
            [
                10729,
                10789
            ],
            [
                10789,
                10855
            ],
            [
                10855,
                10900
            ],
            [
                10900,
                10908
            ],
            [
                10908,
                10954
            ],
            [
                10954,
                11000
            ],
            [
                11000,
                11074
            ],
            [
                11074,
                11112
            ],
            [
                11112,
                11154
            ],
            [
                11154,
                11186
            ],
            [
                11186,
                11276
            ],
            [
                11276,
                11376
            ],
            [
                11376,
                11483
            ],
            [
                11483,
                11500
            ],
            [
                11500,
                11513
            ],
            [
                11513,
                11595
            ],
            [
                11595,
                11622
            ],
            [
                11622,
                11708
            ],
            [
                11708,
                11742
            ],
            [
                11742,
                11786
            ],
            [
                11786,
                11808
            ],
            [
                11808,
                11836
            ],
            [
                11836,
                11901
            ],
            [
                11901,
                11927
            ],
            [
                11927,
                12152
            ],
            [
                12152,
                12291
            ],
            [
                12291,
                12374
            ],
            [
                12374,
                12678
            ],
            [
                12678,
                12747
            ],
            [
                12747,
                12998
            ],
            [
                12998,
                13228
            ],
            [
                13228,
                13613
            ],
            [
                13613,
                13648
            ],
            [
                13648,
                13685
            ],
            [
                13685,
                13760
            ],
            [
                13760,
                13766
            ],
            [
                13766,
                13820
            ],
            [
                13820,
                13930
            ],
            [
                13930,
                14016
            ],
            [
                14016,
                14139
            ],
            [
                14139,
                14211
            ],
            [
                14211,
                14282
            ],
            [
                14282,
                14440
            ],
            [
                14440,
                14603
            ],
            [
                14603,
                14650
            ],
            [
                14650,
                14724
            ],
            [
                14724,
                14780
            ],
            [
                14780,
                14838
            ],
            [
                14838,
                15084
            ],
            [
                15084,
                15179
            ],
            [
                15179,
                15389
            ],
            [
                15389,
                15858
            ],
            [
                15858,
                15911
            ],
            [
                15911,
                16237
            ],
            [
                16237,
                16291
            ],
            [
                16291,
                16314
            ],
            [
                16314,
                16360
            ],
            [
                16360,
                16402
            ],
            [
                16402,
                16465
            ],
            [
                16465,
                16504
            ],
            [
                16504,
                16597
            ],
            [
                16597,
                16660
            ],
            [
                16660,
                16830
            ],
            [
                16830,
                16859
            ]
        ],
        "overlap_chars": [
            [
                99,
                159
            ],
            [
                161,
                190
            ],
            [
                193,
                202
            ],
            [
                232,
                235
            ],
            [
                246,
                264
            ],
            [
                190,
                191
            ],
            [
                266,
                297
            ],
            [
                326,
                328
            ],
            [
                328,
                331
            ],
            [
                355,
                371
            ],
            [
                373,
                396
            ],
            [
                411,
                456
            ],
            [
                456,
                466
            ],
            [
                468,
                504
            ],
            [
                518,
                545
            ],
            [
                545,
                560
            ],
            [
                605,
                624
            ],
            [
                676,
                711
            ],
            [
                625,
                635
            ],
            [
                715,
                777
            ],
            [
                781,
                805
            ],
            [
                855,
                890
            ],
            [
                892,
                963
            ],
            [
                971,
                981
            ],
            [
                984,
                1006
            ],
            [
                1007,
                1030
            ],
            [
                1036,
                1067
            ],
            [
                1072,
                1084
            ],
            [
                1096,
                1108
            ],
            [
                1140,
                1220
            ],
            [
                1225,
                1264
            ],
            [
                1338,
                1358
            ],
            [
                1284,
                1295
            ],
            [
                1362,
                1493
            ],
            [
                1499,
                1531
            ],
            [
                1531,
                1574
            ],
            [
                1615,
                1617
            ],
            [
                1621,
                1650
            ],
            [
                1654,
                1696
            ],
            [
                1700,
                1723
            ],
            [
                1739,
                1741
            ],
            [
                1741,
                1781
            ],
            [
                1785,
                1790
            ],
            [
                1794,
                1843
            ],
            [
                1864,
                1874
            ],
            [
                1878,
                1895
            ],
            [
                1918,
                1935
            ],
            [
                1937,
                1951
            ],
            [
                2016,
                2017
            ],
            [
                1952,
                1994
            ],
            [
                1996,
                1999
            ],
            [
                2033,
                2089
            ],
            [
                2164,
                2180
            ],
            [
                2191,
                2254
            ],
            [
                2254,
                2258
            ],
            [
                2262,
                2281
            ],
            [
                2290,
                2296
            ],
            [
                2282,
                2289
            ],
            [
                2297,
                2318
            ],
            [
                2318,
                2327
            ],
            [
                2334,
                2365
            ],
            [
                2365,
                2381
            ],
            [
                2393,
                2438
            ],
            [
                2466,
                2468
            ],
            [
                2471,
                2486
            ],
            [
                2517,
                2519
            ],
            [
                2519,
                2534
            ],
            [
                2540,
                2576
            ],
            [
                2618,
                2644
            ],
            [
                2651,
                2660
            ],
            [
                2662,
                2674
            ],
            [
                2678,
                2687
            ],
            [
                2690,
                2703
            ],
            [
                2713,
                2718
            ],
            [
                2753,
                2754
            ],
            [
                2725,
                2735
            ],
            [
                2758,
                2777
            ],
            [
                2778,
                2783
            ],
            [
                2787,
                2790
            ],
            [
                2815,
                2819
            ],
            [
                2843,
                2909
            ],
            [
                2912,
                2962
            ],
            [
                2962,
                3069
            ],
            [
                3069,
                3111
            ],
            [
                3216,
                3217
            ],
            [
                3218,
                3260
            ],
            [
                3264,
                3288
            ],
            [
                3288,
                3291
            ],
            [
                3298,
                3318
            ],
            [
                3336,
                3356
            ],
            [
                3356,
                3409
            ],
            [
                3409,
                3435
            ],
            [
                3435,
                3438
            ],
            [
                3446,
                3455
            ],
            [
                3498,
                3506
            ],
            [
                3520,
                3562
            ],
            [
                3591,
                3597
            ],
            [
                3599,
                3618
            ],
            [
                3626,
                3628
            ],
            [
                3628,
                3672
            ],
            [
                3673,
                3685
            ],
            [
                3747,
                3749
            ],
            [
                3749,
                3764
            ],
            [
                3764,
                3825
            ],
            [
                3830,
                3864
            ],
            [
                3921,
                3923
            ],
            [
                3992,
                4029
            ],
            [
                4035,
                4039
            ],
            [
                4061,
                4085
            ],
            [
                4169,
                4187
            ],
            [
                4201,
                4207
            ],
            [
                4188,
                4192
            ],
            [
                4208,
                4216
            ],
            [
                4163,
                4168
            ],
            [
                4153,
                4156
            ],
            [
                4259,
                4269
            ],
            [
                4272,
                4285
            ],
            [
                4287,
                4345
            ],
            [
                4347,
                4360
            ],
            [
                4428,
                4484
            ],
            [
                4598,
                4639
            ],
            [
                4642,
                4652
            ],
            [
                4653,
                4703
            ],
            [
                4707,
                4720
            ],
            [
                4723,
                4738
            ],
            [
                4739,
                4750
            ],
            [
                4767,
                4790
            ],
            [
                4801,
                4811
            ],
            [
                4811,
                4865
            ],
            [
                4871,
                4907
            ],
            [
                4908,
                4924
            ],
            [
                4944,
                4984
            ],
            [
                5062,
                5074
            ],
            [
                5031,
                5032
            ],
            [
                5462,
                5474
            ],
            [
                5477,
                5507
            ],
            [
                5509,
                5564
            ],
            [
                5568,
                5596
            ],
            [
                5596,
                5675
            ],
            [
                5675,
                5680
            ],
            [
                5682,
                5706
            ],
            [
                5708,
                5735
            ],
            [
                5737,
                5786
            ],
            [
                5859,
                5865
            ],
            [
                5865,
                5957
            ],
            [
                5961,
                6029
            ],
            [
                6032,
                6044
            ],
            [
                6045,
                6066
            ],
            [
                6069,
                6103
            ],
            [
                6104,
                6115
            ],
            [
                6116,
                6131
            ],
            [
                6131,
                6158
            ],
            [
                6165,
                6172
            ],
            [
                6182,
                6306
            ],
            [
                6312,
                6325
            ],
            [
                6379,
                6418
            ],
            [
                6439,
                6512
            ],
            [
                6516,
                6563
            ],
            [
                6563,
                6567
            ],
            [
                6567,
                6597
            ],
            [
                6601,
                6605
            ],
            [
                6608,
                6663
            ],
            [
                6664,
                6710
            ],
            [
                6778,
                6782
            ],
            [
                6774,
                6777
            ],
            [
                6790,
                6792
            ],
            [
                6798,
                6822
            ],
            [
                6840,
                6872
            ],
            [
                6897,
                6941
            ],
            [
                6941,
                6943
            ],
            [
                7009,
                7011
            ],
            [
                7017,
                7056
            ],
            [
                7059,
                7079
            ],
            [
                7080,
                7118
            ],
            [
                7229,
                7231
            ],
            [
                7231,
                7299
            ],
            [
                7301,
                7310
            ],
            [
                7316,
                7334
            ],
            [
                7382,
                7384
            ],
            [
                7384,
                7467
            ],
            [
                7467,
                7531
            ],
            [
                7540,
                7542
            ],
            [
                7542,
                7566
            ],
            [
                7612,
                7647
            ],
            [
                7647,
                7661
            ],
            [
                7665,
                7679
            ],
            [
                7679,
                7688
            ],
            [
                7690,
                7736
            ],
            [
                7740,
                7745
            ],
            [
                7745,
                7749
            ],
            [
                7752,
                7768
            ],
            [
                7806,
                7855
            ],
            [
                7855,
                7927
            ],
            [
                7931,
                7953
            ],
            [
                7956,
                7970
            ],
            [
                7995,
                7997
            ],
            [
                7997,
                8015
            ],
            [
                8015,
                8028
            ],
            [
                8037,
                8044
            ],
            [
                8044,
                8046
            ],
            [
                8059,
                8149
            ],
            [
                8180,
                8182
            ],
            [
                8190,
                8198
            ],
            [
                8213,
                8231
            ],
            [
                8231,
                8295
            ],
            [
                8308,
                8339
            ],
            [
                8349,
                8383
            ],
            [
                8393,
                8447
            ],
            [
                8449,
                8480
            ],
            [
                8484,
                8487
            ],
            [
                8490,
                8545
            ],
            [
                8546,
                8584
            ],
            [
                8586,
                8608
            ],
            [
                8616,
                8635
            ],
            [
                8638,
                8667
            ],
            [
                8668,
                8695
            ],
            [
                8698,
                8719
            ],
            [
                8724,
                8766
            ],
            [
                8780,
                8824
            ],
            [
                8824,
                8850
            ],
            [
                8851,
                8948
            ],
            [
                8970,
                8988
            ],
            [
                9016,
                9068
            ],
            [
                9070,
                9086
            ],
            [
                9086,
                9133
            ],
            [
                9230,
                9233
            ],
            [
                9137,
                9142
            ],
            [
                9234,
                9254
            ],
            [
                9270,
                9318
            ],
            [
                9337,
                9389
            ],
            [
                9389,
                9420
            ],
            [
                9422,
                9429
            ],
            [
                9431,
                9452
            ],
            [
                9458,
                9508
            ],
            [
                9517,
                9532
            ],
            [
                9532,
                9542
            ],
            [
                9552,
                9553
            ],
            [
                9555,
                9566
            ],
            [
                9591,
                9601
            ],
            [
                9706,
                9717
            ],
            [
                9722,
                9728
            ],
            [
                9752,
                9784
            ],
            [
                9588,
                9590
            ],
            [
                9790,
                9793
            ],
            [
                9820,
                9840
            ],
            [
                9845,
                9850
            ],
            [
                9853,
                9868
            ],
            [
                9871,
                9909
            ],
            [
                9927,
                9933
            ],
            [
                9933,
                9983
            ],
            [
                9983,
                10025
            ],
            [
                10513,
                10519
            ],
            [
                10526,
                10533
            ],
            [
                10596,
                10597
            ],
            [
                10583,
                10596
            ],
            [
                10598,
                10678
            ],
            [
                10694,
                10696
            ],
            [
                10696,
                10713
            ],
            [
                10790,
                10840
            ],
            [
                10843,
                10855
            ],
            [
                10856,
                10875
            ],
            [
                10883,
                10897
            ],
            [
                10901,
                10905
            ],
            [
                10908,
                10954
            ],
            [
                10959,
                10998
            ],
            [
                11019,
                11027
            ],
            [
                11075,
                11109
            ],
            [
                11112,
                11131
            ],
            [
                11152,
                11154
            ],
            [
                11155,
                11171
            ],
            [
                11181,
                11186
            ],
            [
                11186,
                11276
            ],
            [
                11276,
                11309
            ],
            [
                11323,
                11326
            ],
            [
                11331,
                11335
            ],
            [
                11329,
                11330
            ],
            [
                11336,
                11340
            ],
            [
                11345,
                11356
            ],
            [
                11361,
                11365
            ],
            [
                11381,
                11384
            ],
            [
                11394,
                11451
            ],
            [
                11377,
                11380
            ],
            [
                11462,
                11480
            ],
            [
                11483,
                11500
            ],
            [
                11504,
                11513
            ],
            [
                11513,
                11540
            ],
            [
                11544,
                11585
            ],
            [
                11593,
                11595
            ],
            [
                11595,
                11607
            ],
            [
                11620,
                11622
            ],
            [
                11622,
                11644
            ],
            [
                11708,
                11739
            ],
            [
                11743,
                11783
            ],
            [
                11787,
                11808
            ],
            [
                11808,
                11836
            ],
            [
                11836,
                11898
            ],
            [
                11902,
                11924
            ],
            [
                11927,
                11962
            ],
            [
                12031,
                12034
            ],
            [
                12035,
                12042
            ],
            [
                12042,
                12097
            ],
            [
                12014,
                12015
            ],
            [
                12098,
                12138
            ],
            [
                12150,
                12152
            ],
            [
                12153,
                12156
            ],
            [
                12159,
                12167
            ],
            [
                12169,
                12186
            ],
            [
                12207,
                12209
            ],
            [
                12201,
                12206
            ],
            [
                12233,
                12291
            ],
            [
                12291,
                12331
            ],
            [
                12372,
                12374
            ],
            [
                12374,
                12432
            ],
            [
                12434,
                12478
            ],
            [
                12485,
                12488
            ],
            [
                12490,
                12545
            ],
            [
                12554,
                12573
            ],
            [
                12612,
                12678
            ],
            [
                12793,
                12794
            ],
            [
                12852,
                12853
            ],
            [
                12747,
                12768
            ],
            [
                12773,
                12777
            ],
            [
                12778,
                12783
            ],
            [
                12807,
                12817
            ],
            [
                12854,
                12892
            ],
            [
                12923,
                12947
            ],
            [
                12996,
                12998
            ],
            [
                12998,
                13012
            ],
            [
                13028,
                13029
            ],
            [
                13065,
                13084
            ],
            [
                13100,
                13111
            ],
            [
                13113,
                13131
            ],
            [
                13159,
                13167
            ],
            [
                13193,
                13195
            ],
            [
                13201,
                13228
            ],
            [
                13228,
                13249
            ],
            [
                13251,
                13255
            ],
            [
                13261,
                13307
            ],
            [
                13554,
                13560
            ],
            [
                13375,
                13429
            ],
            [
                13614,
                13648
            ],
            [
                13648,
                13685
            ],
            [
                13685,
                13706
            ],
            [
                13723,
                13757
            ],
            [
                13761,
                13766
            ],
            [
                13766,
                13788
            ],
            [
                13789,
                13820
            ],
            [
                13820,
                13850
            ],
            [
                13888,
                13927
            ],
            [
                13931,
                14013
            ],
            [
                14020,
                14024
            ],
            [
                14027,
                14109
            ],
            [
                14121,
                14139
            ],
            [
                14139,
                14145
            ],
            [
                14237,
                14240
            ],
            [
                14222,
                14225
            ],
            [
                14246,
                14253
            ],
            [
                14282,
                14315
            ],
            [
                14338,
                14339
            ],
            [
                14344,
                14390
            ],
            [
                14404,
                14440
            ],
            [
                14654,
                14722
            ],
            [
                14752,
                14753
            ],
            [
                14730,
                14740
            ],
            [
                14748,
                14752
            ],
            [
                14722,
                14723
            ],
            [
                14838,
                14862
            ],
            [
                14867,
                14877
            ],
            [
                14882,
                14897
            ],
            [
                14898,
                14909
            ],
            [
                14915,
                14931
            ],
            [
                14940,
                14954
            ],
            [
                14969,
                14986
            ],
            [
                14996,
                15049
            ],
            [
                15051,
                15084
            ],
            [
                15084,
                15127
            ],
            [
                15147,
                15179
            ],
            [
                15179,
                15320
            ],
            [
                15387,
                15388
            ],
            [
                15389,
                15470
            ],
            [
                15480,
                15488
            ],
            [
                15498,
                15513
            ],
            [
                15535,
                15587
            ],
            [
                15593,
                15632
            ],
            [
                15661,
                15688
            ],
            [
                15707,
                15766
            ],
            [
                15513,
                15514
            ],
            [
                15768,
                15771
            ],
            [
                15810,
                15815
            ],
            [
                15835,
                15842
            ],
            [
                15852,
                15857
            ],
            [
                15858,
                15911
            ],
            [
                15911,
                15977
            ],
            [
                16063,
                16067
            ],
            [
                16056,
                16062
            ],
            [
                16048,
                16052
            ],
            [
                16030,
                16033
            ],
            [
                16078,
                16095
            ],
            [
                16109,
                16124
            ],
            [
                16127,
                16184
            ],
            [
                16222,
                16224
            ],
            [
                16235,
                16237
            ],
            [
                16237,
                16257
            ],
            [
                16302,
                16314
            ],
            [
                16314,
                16360
            ],
            [
                16360,
                16362
            ],
            [
                16390,
                16402
            ],
            [
                16403,
                16415
            ],
            [
                16416,
                16465
            ],
            [
                16465,
                16492
            ],
            [
                16502,
                16504
            ],
            [
                16504,
                16595
            ]
        ],
        "row_chars": [
            [
                0,
                86
            ],
            [
                86,
                99
            ],
            [
                99,
                328
            ],
            [
                328,
                407
            ],
            [
                407,
                456
            ],
            [
                456,
                545
            ],
            [
                545,
                562
            ],
            [
                562,
                605
            ],
            [
                605,
                625
            ],
            [
                625,
                714
            ],
            [
                714,
                842
            ],
            [
                842,
                966
            ],
            [
                966,
                971
            ],
            [
                971,
                1006
            ],
            [
                1006,
                1033
            ],
            [
                1033,
                1096
            ],
            [
                1096,
                1264
            ],
            [
                1264,
                1493
            ],
            [
                1493,
                1531
            ],
            [
                1531,
                1617
            ],
            [
                1617,
                1653
            ],
            [
                1653,
                1699
            ],
            [
                1699,
                1741
            ],
            [
                1741,
                1784
            ],
            [
                1784,
                1790
            ],
            [
                1790,
                1877
            ],
            [
                1877,
                1898
            ],
            [
                1898,
                1913
            ],
            [
                1913,
                2091
            ],
            [
                2091,
                2163
            ],
            [
                2163,
                2254
            ],
            [
                2254,
                2318
            ],
            [
                2318,
                2365
            ],
            [
                2365,
                2519
            ],
            [
                2519,
                2677
            ],
            [
                2677,
                2777
            ],
            [
                2777,
                2912
            ],
            [
                2912,
                2962
            ],
            [
                2962,
                3069
            ],
            [
                3069,
                3218
            ],
            [
                3218,
                3260
            ],
            [
                3260,
                3288
            ],
            [
                3288,
                3356
            ],
            [
                3356,
                3409
            ],
            [
                3409,
                3435
            ],
            [
                3435,
                3457
            ],
            [
                3457,
                3498
            ],
            [
                3498,
                3628
            ],
            [
                3628,
                3749
            ],
            [
                3749,
                3764
            ],
            [
                3764,
                3923
            ],
            [
                3923,
                4085
            ],
            [
                4085,
                4153
            ],
            [
                4153,
                4272
            ],
            [
                4272,
                4361
            ],
            [
                4361,
                4366
            ],
            [
                4366,
                4377
            ],
            [
                4377,
                4428
            ],
            [
                4428,
                4485
            ],
            [
                4485,
                4597
            ],
            [
                4597,
                4652
            ],
            [
                4652,
                4706
            ],
            [
                4706,
                4750
            ],
            [
                4750,
                4767
            ],
            [
                4767,
                4811
            ],
            [
                4811,
                4871
            ],
            [
                4871,
                5290
            ],
            [
                5290,
                5461
            ],
            [
                5461,
                5567
            ],
            [
                5567,
                5596
            ],
            [
                5596,
                5675
            ],
            [
                5675,
                5788
            ],
            [
                5788,
                5853
            ],
            [
                5853,
                5865
            ],
            [
                5865,
                5960
            ],
            [
                5960,
                6044
            ],
            [
                6044,
                6103
            ],
            [
                6103,
                6131
            ],
            [
                6131,
                6161
            ],
            [
                6161,
                6306
            ],
            [
                6306,
                6515
            ],
            [
                6515,
                6563
            ],
            [
                6563,
                6567
            ],
            [
                6567,
                6600
            ],
            [
                6600,
                6608
            ],
            [
                6608,
                6663
            ],
            [
                6663,
                6840
            ],
            [
                6840,
                6941
            ],
            [
                6941,
                7011
            ],
            [
                7011,
                7079
            ],
            [
                7079,
                7231
            ],
            [
                7231,
                7384
            ],
            [
                7384,
                7467
            ],
            [
                7467,
                7542
            ],
            [
                7542,
                7611
            ],
            [
                7611,
                7647
            ],
            [
                7647,
                7664
            ],
            [
                7664,
                7679
            ],
            [
                7679,
                7739
            ],
            [
                7739,
                7745
            ],
            [
                7745,
                7855
            ],
            [
                7855,
                7930
            ],
            [
                7930,
                7956
            ],
            [
                7956,
                7997
            ],
            [
                7997,
                8044
            ],
            [
                8044,
                8231
            ],
            [
                8231,
                8383
            ],
            [
                8383,
                8483
            ],
            [
                8483,
                8545
            ],
            [
                8545,
                8611
            ],
            [
                8611,
                8667
            ],
            [
                8667,
                8719
            ],
            [
                8719,
                8824
            ],
            [
                8824,
                8988
            ],
            [
                8988,
                9070
            ],
            [
                9070,
                9086
            ],
            [
                9086,
                9136
            ],
            [
                9136,
                9389
            ],
            [
                9389,
                9532
            ],
            [
                9532,
                9819
            ],
            [
                9819,
                9933
            ],
            [
                9933,
                9983
            ],
            [
                9983,
                10065
            ],
            [
                10065,
                10171
            ],
            [
                10171,
                10190
            ],
            [
                10190,
                10235
            ],
            [
                10235,
                10306
            ],
            [
                10306,
                10432
            ],
            [
                10432,
                10508
            ],
            [
                10508,
                10696
            ],
            [
                10696,
                10716
            ],
            [
                10716,
                10729
            ],
            [
                10729,
                10789
            ],
            [
                10789,
                10855
            ],
            [
                10855,
                10900
            ],
            [
                10900,
                10908
            ],
            [
                10908,
                10954
            ],
            [
                10954,
                11074
            ],
            [
                11074,
                11112
            ],
            [
                11112,
                11154
            ],
            [
                11154,
                11186
            ],
            [
                11186,
                11276
            ],
            [
                11276,
                11376
            ],
            [
                11376,
                11483
            ],
            [
                11483,
                11500
            ],
            [
                11500,
                11513
            ],
            [
                11513,
                11595
            ],
            [
                11595,
                11622
            ],
            [
                11622,
                11742
            ],
            [
                11742,
                11786
            ],
            [
                11786,
                11808
            ],
            [
                11808,
                11836
            ],
            [
                11836,
                11901
            ],
            [
                11901,
                11927
            ],
            [
                11927,
                12152
            ],
            [
                12152,
                12291
            ],
            [
                12291,
                12374
            ],
            [
                12374,
                12678
            ],
            [
                12678,
                12747
            ],
            [
                12747,
                12998
            ],
            [
                12998,
                13228
            ],
            [
                13228,
                13613
            ],
            [
                13613,
                13648
            ],
            [
                13648,
                13685
            ],
            [
                13685,
                13760
            ],
            [
                13760,
                13766
            ],
            [
                13766,
                13820
            ],
            [
                13820,
                13930
            ],
            [
                13930,
                14016
            ],
            [
                14016,
                14139
            ],
            [
                14139,
                14282
            ],
            [
                14282,
                14440
            ],
            [
                14440,
                14603
            ],
            [
                14603,
                14650
            ],
            [
                14650,
                14780
            ],
            [
                14780,
                14838
            ],
            [
                14838,
                15084
            ],
            [
                15084,
                15179
            ],
            [
                15179,
                15389
            ],
            [
                15389,
                15858
            ],
            [
                15858,
                15911
            ],
            [
                15911,
                16237
            ],
            [
                16237,
                16314
            ],
            [
                16314,
                16360
            ],
            [
                16360,
                16402
            ],
            [
                16402,
                16465
            ],
            [
                16465,
                16504
            ],
            [
                16504,
                16597
            ],
            [
                16597,
                16660
            ],
            [
                16660,
                16830
            ],
            [
                16830,
                16859
            ]
        ]
    },
    "abridged": {
        "text": "On Margaret's return home she found two letters on the table. One was a note for her mother; the other was from her Aunt Shaw, covered with foreign post-marks. She was examining it when her father came in.\n'So your mother is tired, and gone to bed early! I'm afraid such a thundery day was not the best for the doctor to see her. What did he say?'\nMargaret hesitated.\n'He does not think her seriously ill?' asked her father.\n'Not at present; she needs care, he says; he was very kind, and said he would call again.'\n'He did not recommend change of air? - he did not say this smoky town was doing her any harm, did he, Margaret?'\n'Not a word,' she replied, gravely. 'He was anxious, I think.'\n'Doctors have that anxious manner; it's professional.'\nMargaret saw that the first impression of possible danger was made upon his mind, in spite of his making light of what she told him. He kept recurring to the subject through the evening, with an unwillingness to receive even the slightest unfavourable idea, which made Margaret inexpressibly sad.\n'This letter is from Aunt Shaw, papa. She has got to Naples, and finds it too hot. I don't think she likes Italy.'\n'He did not say anything about diet, did he?'\n'It was to be nourishing. Mamma's appetite is pretty good, I think.'\n'Yes! that makes it all the more strange he should have spoken about diet.'\n'I asked him, papa.' Margaret went on: 'Aunt Shaw says, she has sent me some coral ornaments, papa; but she's afraid the Milton Dissenters won't appreciate them.'\n'If ever you hear that your mother wishes for anything, be sure you let me know. I am afraid she does not always tell me what she would like. Pray, see about that girl Mrs. Thornton named. If we had a good house-servant, Dixon could be constantly with your mother. We could soon set her up. She's been very tired of late, with the hot weather, but a little rest will put her to rights - eh, Margaret?'\n'I hope so,' said Margaret sadly. Her father pinched her cheek.\n'Come; you must take care of yourself, child, or you'll be wanting the doctor next.'\nBut he could not settle to anything that evening. He was continually going backwards and forwards, on laborious tiptoe, to see if his wife was still asleep. Margaret's heart ached at his restlessness. He came back at last, somewhat comforted.\n'She's awake now, Margaret. She smiled as she saw me - just her old smile. And she says she feels refreshed, and ready for tea. Where's the note for her? She wants to see it.'\nThe note was a formal invitation from Mrs. Thornton, to dinner on the twenty-first. Margaret was surprised to find an acceptance was contemplated. But so it was. The idea of her husband's and daughter's going to this dinner quite captivated Mrs. Hale's fancy. She clung to the idea of their going, even when Margaret objected.\n'She wouldn't wish it unless she really felt stronger - would she, Margaret?' said Mr. Hale anxiously, as she prepared to write the note of acceptance the next day. It seemed cruel to refuse him the comfort he craved for.\n'I do think she is better since last night,' said she. 'Her eyes look brighter, and her complexion clearer.'\n'God bless you,' said her father, earnestly. 'Yesterday was so sultry everyone felt ill. It was a most unlucky day for Mr. Donaldson to see her.' So he went away to his day's duties, which were now increased by some lectures he had promised to deliver on Church Architecture.\n'Well, mother,' asked Mr. Thornton that night, 'who have accepted your invitations for the twenty-first?'\n'Fanny, where are the notes? The Slicksons accept, Collingbrooks accept, Stephenses accept, Browns decline. Hales - father and daughter come - mother too great an invalid - Macphersons come, and Mr. Horsfall, and Mr. Young.'\n'Very good. Do you know, I'm really afraid Mrs. Hale is very far from well, from what Dr. Donaldson says.'\n'It's strange of them to accept a dinner-invitation if she's very ill,' said Fanny.\n'I didn't say very ill,' said her brother, rather sharply. 'I only said very far from well. They may not know it either.' Then he remembered that, from what Dr. Donaldson had told him, Margaret, at any rate, must be aware of the exact state of the case.\n'Very probably they know the great advantage it would be to them, to be introduced to such people as the Stephenses and the Collingbrooks.'\n'I'm sure that motive would not influence them. No! I think I understand how it is.'\n'John!' said Fanny, laughing in her little, weak, nervous way. 'How you profess to understand these Hales, and yet make out they are so different to most people.'\nShe did not mean to vex him; but she could not have done it more thoroughly. He was silent.\n'They do not seem to me out of the common way,' said Mrs. Thornton. 'He appears a worthy kind of man enough. She's a bit of a fine lady, with her invalidism; and as for the girl - she's the one who puzzles me. She seems to have a great notion of giving herself airs; and I can't make out why. I could almost fancy she thinks herself too good for her company. And yet they're not rich.'\n'And she's not accomplished, mamma. She can't play.'\n'Go on, Fanny. What else does she want to bring her up to your standard?'\n'Nay! John,' said his mother, 'I myself heard Miss Hale say she could not play. If you would let us alone, we could perhaps like her, and see her merits.'\n'I'm sure I never could!' murmured Fanny. Mr. Thornton heard her, but did not reply. He walked up and down the dining-room, wishing that his mother would order candles, and allow him to read or write, and so end the conversation. But he never thought of interfering in any of the small domestic rules that Mrs. Thornton observed, in remembrance of her old economies.\n'Mother,' said he, stopping, and bravely speaking out the truth, 'I wish you would like Miss Hale.'\n'Why?' asked she, startled by his earnest, yet tender manner. 'You're never thinking of marrying her? - a girl without a penny.'\n'She would never have me,' said he, with a short laugh.\n'No, I don't think she would,' answered his mother. 'She laughed in my face, when I praised her for repeating something Mr. Bell had said in your favour. I liked the girl for doing it so frankly, for it made me sure she had no thought of you; and the next minute she vexed me so by- Well, never mind! But she's too good an opinion of herself to think of you. The saucy jade! I should like to know where she'd find a better!'\nIf these words hurt her son, the dusky light prevented him from showing it. He came up quite cheerfully to his mother, and putting one hand on her shoulder, said:\n'Well, as I have no thought of ever asking her to be my wife, you'll believe that I'm quite disinterested in speaking about her. I foresee trouble for that girl - perhaps want of motherly care. I only wish you to be ready to be a friend to her, if she needs one. Now, Fanny, I trust you understand that I have no other reason for begging you and my mother to be kind to her.'\n'I cannot forgive her pride,' said his mother. 'I will befriend her, if there is need, John. I would befriend Jezebel herself if you asked me. But this girl, who turns up her nose at us-'\n'If she does,' said he, 'I'm not a lad to be cowed by a proud look from a woman, or to care for her misunderstanding me. I can laugh at it!'\n'I only wonder why you talk so much about her, then,' said Fanny. 'I'm sure, I'm tired of the subject.'\n'Well!' said her brother, with a shade of bitterness. 'Suppose we find some more agreeable subject - like a strike?'\n'Have the hands actually turned out?' asked Mrs. Thornton.\n'Hamper's men are out. Mine are working out their week, through fear of being prosecuted for breach of contract. I'd have had every one of them up for that, if they left their work before time.'\n'The law fees would have been more than the hands themselves were worth - the ungrateful naughts!' said his mother.\n'To be sure. But I'd have shown them how I keep my word, and how I mean them to keep theirs. They know me. Slickson's men are off - we're in for a turn-out, mother.'\n'I hope there are not many orders in hand?'\n'Of course there are. They know that well enough. But they don't quite understand all, though they think they do.'\n'What do you mean, John?'\nCandles had been brought, and Fanny was sewing and yawning in turn; throwing herself back in her chair, from time to time, to gaze at vacancy, and think of nothing.\n'Why,' said he, 'the Americans are selling so many yarns, that our only chance is producing them at a lower rate. If we can't, we may shut up shop at once. Yet these fools go back to the prices paid three years ago - nay, some of their leaders quote Dickinson's prices now, though they know as well as we do that, what with fines taken out of their wages, and other fees, the real rate of wage paid at Dickinson's is less than at ours. Upon my word, mother, it is too bad to find that ignorant fools like these are to rule over the fortunes of those with knowledge and experience. The next thing, we shall have to go hat in hand and humbly ask the Spinners' Union to kindly give us labour at their own price. That's what they want. They haven't the sense to see that, if we don't get enough profit here in England, we can move off to some other country.'\n'Can't you get hands from Ireland? I wouldn't keep these fellows a day. I'd teach them that I could employ what servants I liked.'\n'Yes! to be sure, I can; and I will, too, if they go on long. It will be trouble and expense; but I will do it, rather than give in.'\n'If there is to be all this extra expense, I'm sorry we're giving a dinner just now.'\n'So am I - not because of the expense, but because I shall have much to think about, and many calls on my time. But we owe the dinners.'\nHe kept on with his restless walk, drawing a deep breath from time to time, as if trying to throw off some annoying thought. Fanny was not sorry when, at ten o'clock, the servants filed in to prayers, which her mother read.\nWhen prayers were ended, his mother wished him goodnight, with a long steady look which conveyed none of the tenderness in her heart, but yet had the intensity of a blessing. Mr. Thornton continued his walk. All his business plans had received a check from this approaching turn-out. The forethought of many anxious hours was thrown away, utterly wasted by their insane folly, which would injure themselves even more than him.\nAnd these were the men who thought themselves fitted to direct the masters in the use of their money! Hamper had said that if he were ruined by the strike, he would start again, comforted by the conviction that the strikers were in a worse predicament - for he had head as well as hands, while they had only hands, and could turn to nothing else.\nBut this thought was no consolation to Mr. Thornton. It might be that revenge gave him no pleasure; it might be that he felt keenly that all his efforts were endangered by the folly of others - so keenly that he had no thoughts to spare for what would happen to them. He paced up and down until the clock struck two. The candles were flickering in their sockets. He muttered to himself:\n'Once for all, they shall know whom they have got to deal with. I can give them a fortnight. If they don't see their madness before the end of that time, I must have hands from Ireland.'",
        "paragraph_chars": [
            [
                0,
                206
            ],
            [
                206,
                348
            ],
            [
                348,
                368
            ],
            [
                368,
                425
            ],
            [
                425,
                516
            ],
            [
                516,
                629
            ],
            [
                629,
                692
            ],
            [
                692,
                747
            ],
            [
                747,
                1044
            ],
            [
                1044,
                1159
            ],
            [
                1159,
                1205
            ],
            [
                1205,
                1274
            ],
            [
                1274,
                1350
            ],
            [
                1350,
                1513
            ],
            [
                1513,
                1915
            ],
            [
                1915,
                1979
            ],
            [
                1979,
                2064
            ],
            [
                2064,
                2307
            ],
            [
                2307,
                2483
            ],
            [
                2483,
                2810
            ],
            [
                2810,
                3032
            ],
            [
                3032,
                3141
            ],
            [
                3141,
                3417
            ],
            [
                3417,
                3523
            ],
            [
                3523,
                3748
            ],
            [
                3748,
                3855
            ],
            [
                3855,
                3939
            ],
            [
                3939,
                4193
            ],
            [
                4193,
                4333
            ],
            [
                4333,
                4418
            ],
            [
                4418,
                4581
            ],
            [
                4581,
                4673
            ],
            [
                4673,
                5059
            ],
            [
                5059,
                5112
            ],
            [
                5112,
                5186
            ],
            [
                5186,
                5341
            ],
            [
                5341,
                5708
            ],
            [
                5708,
                5808
            ],
            [
                5808,
                5937
            ],
            [
                5937,
                5993
            ],
            [
                5993,
                6418
            ],
            [
                6418,
                6581
            ],
            [
                6581,
                6957
            ],
            [
                6957,
                7145
            ],
            [
                7145,
                7286
            ],
            [
                7286,
                7390
            ],
            [
                7390,
                7507
            ],
            [
                7507,
                7566
            ],
            [
                7566,
                7761
            ],
            [
                7761,
                7877
            ],
            [
                7877,
                8043
            ],
            [
                8043,
                8087
            ],
            [
                8087,
                8202
            ],
            [
                8202,
                8228
            ],
            [
                8228,
                8393
            ],
            [
                8393,
                9248
            ],
            [
                9248,
                9379
            ],
            [
                9379,
                9513
            ],
            [
                9513,
                9599
            ],
            [
                9599,
                9736
            ],
            [
                9736,
                9960
            ],
            [
                9960,
                10387
            ],
            [
                10387,
                10734
            ],
            [
                10734,
                11121
            ],
            [
                11121,
                11307
            ]
        ],
        "segment_chars": [
            [
                0,
                62
            ],
            [
                62,
                160
            ],
            [
                160,
                206
            ],
            [
                206,
                255
            ],
            [
                255,
                330
            ],
            [
                330,
                348
            ],
            [
                348,
                368
            ],
            [
                368,
                407
            ],
            [
                407,
                425
            ],
            [
                425,
                516
            ],
            [
                516,
                553
            ],
            [
                553,
                629
            ],
            [
                629,
                665
            ],
            [
                665,
                692
            ],
            [
                692,
                747
            ],
            [
                747,
                880
            ],
            [
                880,
                1044
            ],
            [
                1044,
                1082
            ],
            [
                1082,
                1127
            ],
            [
                1127,
                1159
            ],
            [
                1159,
                1205
            ],
            [
                1205,
                1231
            ],
            [
                1231,
                1274
            ],
            [
                1274,
                1280
            ],
            [
                1280,
                1350
            ],
            [
                1350,
                1371
            ],
            [
                1371,
                1513
            ],
            [
                1513,
                1594
            ],
            [
                1594,
                1655
            ],
            [
                1655,
                1702
            ],
            [
                1702,
                1778
            ],
            [
                1778,
                1804
            ],
            [
                1804,
                1915
            ],
            [
                1915,
                1949
            ],
            [
                1949,
                1979
            ],
            [
                1979,
                2064
            ],
            [
                2064,
                2114
            ],
            [
                2114,
                2221
            ],
            [
                2221,
                2265
            ],
            [
                2265,
                2307
            ],
            [
                2307,
                2335
            ],
            [
                2335,
                2382
            ],
            [
                2382,
                2435
            ],
            [
                2435,
                2461
            ],
            [
                2461,
                2483
            ],
            [
                2483,
                2567
            ],
            [
                2567,
                2630
            ],
            [
                2630,
                2645
            ],
            [
                2645,
                2743
            ],
            [
                2743,
                2810
            ],
            [
                2810,
                2888
            ],
            [
                2888,
                2975
            ],
            [
                2975,
                3032
            ],
            [
                3032,
                3087
            ],
            [
                3087,
                3141
            ],
            [
                3141,
                3186
            ],
            [
                3186,
                3230
            ],
            [
                3230,
                3287
            ],
            [
                3287,
                3417
            ],
            [
                3417,
                3523
            ],
            [
                3523,
                3552
            ],
            [
                3552,
                3631
            ],
            [
                3631,
                3748
            ],
            [
                3748,
                3760
            ],
            [
                3760,
                3855
            ],
            [
                3855,
                3939
            ],
            [
                3939,
                3998
            ],
            [
                3998,
                4031
            ],
            [
                4031,
                4061
            ],
            [
                4061,
                4193
            ],
            [
                4193,
                4333
            ],
            [
                4333,
                4381
            ],
            [
                4381,
                4385
            ],
            [
                4385,
                4418
            ],
            [
                4418,
                4426
            ],
            [
                4426,
                4481
            ],
            [
                4481,
                4581
            ],
            [
                4581,
                4658
            ],
            [
                4658,
                4673
            ],
            [
                4673,
                4741
            ],
            [
                4741,
                4782
            ],
            [
                4782,
                4883
            ],
            [
                4883,
                4966
            ],
            [
                4966,
                5032
            ],
            [
                5032,
                5059
            ],
            [
                5059,
                5095
            ],
            [
                5095,
                5112
            ],
            [
                5112,
                5127
            ],
            [
                5127,
                5186
            ],
            [
                5186,
                5192
            ],
            [
                5192,
                5266
            ],
            [
                5266,
                5341
            ],
            [
                5341,
                5367
            ],
            [
                5367,
                5383
            ],
            [
                5383,
                5426
            ],
            [
                5426,
                5571
            ],
            [
                5571,
                5708
            ],
            [
                5708,
                5808
            ],
            [
                5808,
                5815
            ],
            [
                5815,
                5870
            ],
            [
                5870,
                5910
            ],
            [
                5910,
                5937
            ],
            [
                5937,
                5993
            ],
            [
                5993,
                6045
            ],
            [
                6045,
                6147
            ],
            [
                6147,
                6294
            ],
            [
                6294,
                6352
            ],
            [
                6352,
                6368
            ],
            [
                6368,
                6418
            ],
            [
                6418,
                6494
            ],
            [
                6494,
                6581
            ],
            [
                6581,
                6710
            ],
            [
                6710,
                6775
            ],
            [
                6775,
                6844
            ],
            [
                6844,
                6957
            ],
            [
                6957,
                7004
            ],
            [
                7004,
                7050
            ],
            [
                7050,
                7100
            ],
            [
                7100,
                7145
            ],
            [
                7145,
                7266
            ],
            [
                7266,
                7286
            ],
            [
                7286,
                7352
            ],
            [
                7352,
                7390
            ],
            [
                7390,
                7398
            ],
            [
                7398,
                7444
            ],
            [
                7444,
                7507
            ],
            [
                7507,
                7545
            ],
            [
                7545,
                7566
            ],
            [
                7566,
                7589
            ],
            [
                7589,
                7679
            ],
            [
                7679,
                7761
            ],
            [
                7761,
                7860
            ],
            [
                7860,
                7877
            ],
            [
                7877,
                7890
            ],
            [
                7890,
                7970
            ],
            [
                7970,
                7984
            ],
            [
                7984,
                8043
            ],
            [
                8043,
                8087
            ],
            [
                8087,
                8109
            ],
            [
                8109,
                8137
            ],
            [
                8137,
                8202
            ],
            [
                8202,
                8228
            ],
            [
                8228,
                8393
            ],
            [
                8393,
                8507
            ],
            [
                8507,
                8549
            ],
            [
                8549,
                8829
            ],
            [
                8829,
                8974
            ],
            [
                8974,
                9102
            ],
            [
                9102,
                9125
            ],
            [
                9125,
                9248
            ],
            [
                9248,
                9283
            ],
            [
                9283,
                9320
            ],
            [
                9320,
                9379
            ],
            [
                9379,
                9385
            ],
            [
                9385,
                9441
            ],
            [
                9441,
                9513
            ],
            [
                9513,
                9599
            ],
            [
                9599,
                9711
            ],
            [
                9711,
                9736
            ],
            [
                9736,
                9861
            ],
            [
                9861,
                9960
            ],
            [
                9960,
                10135
            ],
            [
                10135,
                10168
            ],
            [
                10168,
                10244
            ],
            [
                10244,
                10387
            ],
            [
                10387,
                10489
            ],
            [
                10489,
                10734
            ],
            [
                10734,
                10787
            ],
            [
                10787,
                11002
            ],
            [
                11002,
                11051
            ],
            [
                11051,
                11097
            ],
            [
                11097,
                11121
            ],
            [
                11121,
                11185
            ],
            [
                11185,
                11214
            ],
            [
                11214,
                11307
            ]
        ],
        "overlap_chars": [
            [
                0,
                60
            ],
            [
                62,
                91
            ],
            [
                93,
                102
            ],
            [
                103,
                106
            ],
            [
                107,
                125
            ],
            [
                125,
                126
            ],
            [
                127,
                158
            ],
            [
                158,
                160
            ],
            [
                160,
                163
            ],
            [
                164,
                180
            ],
            [
                181,
                204
            ],
            [
                210,
                255
            ],
            [
                255,
                265
            ],
            [
                266,
                302
            ],
            [
                303,
                330
            ],
            [
                330,
                345
            ],
            [
                348,
                367
            ],
            [
                369,
                404
            ],
            [
                413,
                423
            ],
            [
                426,
                488
            ],
            [
                489,
                513
            ],
            [
                517,
                552
            ],
            [
                555,
                626
            ],
            [
                630,
                640
            ],
            [
                643,
                665
            ],
            [
                666,
                689
            ],
            [
                695,
                726
            ],
            [
                732,
                744
            ],
            [
                747,
                759
            ],
            [
                760,
                840
            ],
            [
                841,
                880
            ],
            [
                880,
                900
            ],
            [
                901,
                912
            ],
            [
                913,
                1044
            ],
            [
                1050,
                1082
            ],
            [
                1082,
                1125
            ],
            [
                1125,
                1127
            ],
            [
                1127,
                1156
            ],
            [
                1160,
                1202
            ],
            [
                1206,
                1229
            ],
            [
                1229,
                1231
            ],
            [
                1231,
                1271
            ],
            [
                1275,
                1280
            ],
            [
                1280,
                1329
            ],
            [
                1337,
                1347
            ],
            [
                1351,
                1368
            ],
            [
                1371,
                1388
            ],
            [
                1390,
                1404
            ],
            [
                1404,
                1405
            ],
            [
                1406,
                1448
            ],
            [
                1450,
                1453
            ],
            [
                1454,
                1510
            ],
            [
                1514,
                1530
            ],
            [
                1531,
                1594
            ],
            [
                1594,
                1598
            ],
            [
                1599,
                1618
            ],
            [
                1619,
                1625
            ],
            [
                1626,
                1633
            ],
            [
                1634,
                1655
            ],
            [
                1655,
                1664
            ],
            [
                1671,
                1702
            ],
            [
                1702,
                1718
            ],
            [
                1719,
                1764
            ],
            [
                1778,
                1780
            ],
            [
                1787,
                1802
            ],
            [
                1802,
                1804
            ],
            [
                1804,
                1819
            ],
            [
                1820,
                1856
            ],
            [
                1861,
                1887
            ],
            [
                1888,
                1897
            ],
            [
                1900,
                1912
            ],
            [
                1916,
                1925
            ],
            [
                1928,
                1941
            ],
            [
                1942,
                1947
            ],
            [
                1947,
                1948
            ],
            [
                1949,
                1959
            ],
            [
                1960,
                1979
            ],
            [
                1980,
                1985
            ],
            [
                1986,
                1989
            ],
            [
                1990,
                1994
            ],
            [
                1995,
                2061
            ],
            [
                2064,
                2114
            ],
            [
                2114,
                2221
            ],
            [
                2221,
                2263
            ],
            [
                2263,
                2264
            ],
            [
                2265,
                2307
            ],
            [
                2311,
                2335
            ],
            [
                2335,
                2338
            ],
            [
                2339,
                2359
            ],
            [
                2362,
                2382
            ],
            [
                2382,
                2435
            ],
            [
                2435,
                2461
            ],
            [
                2461,
                2464
            ],
            [
                2471,
                2480
            ],
            [
                2483,
                2491
            ],
            [
                2496,
                2538
            ],
            [
                2539,
                2545
            ],
            [
                2546,
                2565
            ],
            [
                2565,
                2567
            ],
            [
                2567,
                2611
            ],
            [
                2616,
                2628
            ],
            [
                2628,
                2630
            ],
            [
                2630,
                2645
            ],
            [
                2645,
                2706
            ],
            [
                2707,
                2741
            ],
            [
                2741,
                2743
            ],
            [
                2743,
                2780
            ],
            [
                2781,
                2785
            ],
            [
                2786,
                2810
            ],
            [
                2824,
                2842
            ],
            [
                2843,
                2849
            ],
            [
                2850,
                2854
            ],
            [
                2855,
                2863
            ],
            [
                2866,
                2871
            ],
            [
                2872,
                2875
            ],
            [
                2875,
                2885
            ],
            [
                2888,
                2901
            ],
            [
                2902,
                2960
            ],
            [
                2961,
                2974
            ],
            [
                2975,
                3031
            ],
            [
                3033,
                3074
            ],
            [
                3077,
                3087
            ],
            [
                3088,
                3138
            ],
            [
                3142,
                3155
            ],
            [
                3158,
                3173
            ],
            [
                3175,
                3186
            ],
            [
                3187,
                3210
            ],
            [
                3220,
                3230
            ],
            [
                3230,
                3284
            ],
            [
                3287,
                3323
            ],
            [
                3335,
                3351
            ],
            [
                3352,
                3392
            ],
            [
                3403,
                3415
            ],
            [
                3415,
                3416
            ],
            [
                3418,
                3430
            ],
            [
                3433,
                3463
            ],
            [
                3465,
                3520
            ],
            [
                3524,
                3552
            ],
            [
                3552,
                3631
            ],
            [
                3631,
                3636
            ],
            [
                3639,
                3663
            ],
            [
                3666,
                3693
            ],
            [
                3696,
                3745
            ],
            [
                3754,
                3760
            ],
            [
                3760,
                3852
            ],
            [
                3856,
                3924
            ],
            [
                3927,
                3939
            ],
            [
                3940,
                3961
            ],
            [
                3964,
                3998
            ],
            [
                3999,
                4010
            ],
            [
                4016,
                4031
            ],
            [
                4031,
                4058
            ],
            [
                4061,
                4068
            ],
            [
                4069,
                4193
            ],
            [
                4199,
                4212
            ],
            [
                4218,
                4257
            ],
            [
                4257,
                4330
            ],
            [
                4334,
                4381
            ],
            [
                4381,
                4385
            ],
            [
                4385,
                4415
            ],
            [
                4419,
                4423
            ],
            [
                4426,
                4481
            ],
            [
                4482,
                4528
            ],
            [
                4542,
                4546
            ],
            [
                4547,
                4550
            ],
            [
                4551,
                4553
            ],
            [
                4554,
                4578
            ],
            [
                4581,
                4613
            ],
            [
                4614,
                4658
            ],
            [
                4658,
                4660
            ],
            [
                4671,
                4673
            ],
            [
                4679,
                4718
            ],
            [
                4721,
                4741
            ],
            [
                4742,
                4780
            ],
            [
                4780,
                4782
            ],
            [
                4782,
                4850
            ],
            [
                4853,
                4862
            ],
            [
                4863,
                4881
            ],
            [
                4881,
                4883
            ],
            [
                4883,
                4966
            ],
            [
                4966,
                5030
            ],
            [
                5030,
                5032
            ],
            [
                5032,
                5056
            ],
            [
                5060,
                5095
            ],
            [
                5095,
                5109
            ],
            [
                5113,
                5127
            ],
            [
                5127,
                5136
            ],
            [
                5137,
                5183
            ],
            [
                5187,
                5192
            ],
            [
                5192,
                5196
            ],
            [
                5199,
                5215
            ],
            [
                5217,
                5266
            ],
            [
                5266,
                5338
            ],
            [
                5342,
                5364
            ],
            [
                5367,
                5381
            ],
            [
                5381,
                5383
            ],
            [
                5383,
                5401
            ],
            [
                5405,
                5418
            ],
            [
                5419,
                5426
            ],
            [
                5426,
                5428
            ],
            [
                5436,
                5526
            ],
            [
                5532,
                5534
            ],
            [
                5540,
                5548
            ],
            [
                5553,
                5571
            ],
            [
                5571,
                5635
            ],
            [
                5642,
                5673
            ],
            [
                5674,
                5708
            ],
            [
                5718,
                5772
            ],
            [
                5774,
                5805
            ],
            [
                5809,
                5812
            ],
            [
                5815,
                5870
            ],
            [
                5871,
                5909
            ],
            [
                5912,
                5934
            ],
            [
                5942,
                5961
            ],
            [
                5964,
                5993
            ],
            [
                5994,
                6021
            ],
            [
                6024,
                6045
            ],
            [
                6050,
                6092
            ],
            [
                6103,
                6147
            ],
            [
                6147,
                6173
            ],
            [
                6177,
                6274
            ],
            [
                6276,
                6294
            ],
            [
                6298,
                6350
            ],
            [
                6352,
                6368
            ],
            [
                6368,
                6415
            ],
            [
                6537,
                6540
            ],
            [
                6582,
                6587
            ],
            [
                6588,
                6608
            ],
            [
                6609,
                6657
            ],
            [
                6658,
                6710
            ],
            [
                6710,
                6741
            ],
            [
                6744,
                6751
            ],
            [
                6752,
                6773
            ],
            [
                6775,
                6825
            ],
            [
                6829,
                6844
            ],
            [
                6844,
                6854
            ],
            [
                6854,
                6855
            ],
            [
                6856,
                6867
            ],
            [
                6868,
                6878
            ],
            [
                6879,
                6890
            ],
            [
                6900,
                6906
            ],
            [
                6907,
                6939
            ],
            [
                6948,
                6950
            ],
            [
                6951,
                6954
            ],
            [
                6958,
                6978
            ],
            [
                6979,
                6984
            ],
            [
                6987,
                7002
            ],
            [
                7005,
                7043
            ],
            [
                7044,
                7050
            ],
            [
                7050,
                7100
            ],
            [
                7100,
                7142
            ],
            [
                7146,
                7152
            ],
            [
                7160,
                7167
            ],
            [
                7167,
                7168
            ],
            [
                7170,
                7183
            ],
            [
                7184,
                7264
            ],
            [
                7264,
                7266
            ],
            [
                7266,
                7283
            ],
            [
                7287,
                7337
            ],
            [
                7340,
                7352
            ],
            [
                7353,
                7372
            ],
            [
                7373,
                7387
            ],
            [
                7391,
                7395
            ],
            [
                7398,
                7444
            ],
            [
                7449,
                7488
            ],
            [
                7496,
                7504
            ],
            [
                7508,
                7542
            ],
            [
                7545,
                7564
            ],
            [
                7564,
                7566
            ],
            [
                7567,
                7583
            ],
            [
                7584,
                7589
            ],
            [
                7589,
                7679
            ],
            [
                7679,
                7712
            ],
            [
                7713,
                7716
            ],
            [
                7717,
                7721
            ],
            [
                7721,
                7722
            ],
            [
                7731,
                7735
            ],
            [
                7742,
                7753
            ],
            [
                7754,
                7758
            ],
            [
                7766,
                7769
            ],
            [
                7775,
                7832
            ],
            [
                7835,
                7838
            ],
            [
                7839,
                7857
            ],
            [
                7860,
                7877
            ],
            [
                7881,
                7890
            ],
            [
                7890,
                7917
            ],
            [
                7920,
                7961
            ],
            [
                7968,
                7970
            ],
            [
                7970,
                7982
            ],
            [
                7982,
                7984
            ],
            [
                7984,
                8006
            ],
            [
                8009,
                8040
            ],
            [
                8044,
                8084
            ],
            [
                8088,
                8109
            ],
            [
                8109,
                8137
            ],
            [
                8137,
                8199
            ],
            [
                8203,
                8225
            ],
            [
                8228,
                8263
            ],
            [
                8264,
                8267
            ],
            [
                8279,
                8286
            ],
            [
                8294,
                8349
            ],
            [
                8349,
                8350
            ],
            [
                8351,
                8391
            ],
            [
                8391,
                8393
            ],
            [
                8394,
                8397
            ],
            [
                8400,
                8408
            ],
            [
                8410,
                8427
            ],
            [
                8436,
                8438
            ],
            [
                8444,
                8449
            ],
            [
                8449,
                8507
            ],
            [
                8507,
                8547
            ],
            [
                8547,
                8549
            ],
            [
                8549,
                8607
            ],
            [
                8610,
                8654
            ],
            [
                8662,
                8665
            ],
            [
                8667,
                8722
            ],
            [
                8729,
                8748
            ],
            [
                8763,
                8829
            ],
            [
                8841,
                8842
            ],
            [
                8849,
                8850
            ],
            [
                8851,
                8872
            ],
            [
                8873,
                8877
            ],
            [
                8887,
                8892
            ],
            [
                8893,
                8903
            ],
            [
                8904,
                8942
            ],
            [
                8948,
                8972
            ],
            [
                8972,
                8974
            ],
            [
                8974,
                8988
            ],
            [
                8988,
                8989
            ],
            [
                8990,
                9009
            ],
            [
                9010,
                9021
            ],
            [
                9022,
                9040
            ],
            [
                9051,
                9059
            ],
            [
                9072,
                9074
            ],
            [
                9075,
                9102
            ],
            [
                9102,
                9123
            ],
            [
                9125,
                9129
            ],
            [
                9130,
                9176
            ],
            [
                9177,
                9183
            ],
            [
                9191,
                9245
            ],
            [
                9249,
                9283
            ],
            [
                9283,
                9320
            ],
            [
                9320,
                9341
            ],
            [
                9342,
                9376
            ],
            [
                9380,
                9385
            ],
            [
                9385,
                9407
            ],
            [
                9410,
                9441
            ],
            [
                9441,
                9471
            ],
            [
                9471,
                9510
            ],
            [
                9514,
                9596
            ],
            [
                9603,
                9607
            ],
            [
                9610,
                9692
            ],
            [
                9693,
                9711
            ],
            [
                9711,
                9717
            ],
            [
                9718,
                9721
            ],
            [
                9722,
                9725
            ],
            [
                9726,
                9733
            ],
            [
                9736,
                9769
            ],
            [
                9769,
                9770
            ],
            [
                9771,
                9817
            ],
            [
                9825,
                9861
            ],
            [
                9867,
                9935
            ],
            [
                9935,
                9936
            ],
            [
                9943,
                9953
            ],
            [
                9954,
                9958
            ],
            [
                9958,
                9959
            ],
            [
                9960,
                9984
            ],
            [
                9985,
                9995
            ],
            [
                9996,
                10011
            ],
            [
                10011,
                10022
            ],
            [
                10025,
                10041
            ],
            [
                10042,
                10056
            ],
            [
                10062,
                10079
            ],
            [
                10080,
                10133
            ],
            [
                10135,
                10168
            ],
            [
                10168,
                10211
            ],
            [
                10212,
                10244
            ],
            [
                10244,
                10385
            ],
            [
                10385,
                10386
            ],
            [
                10387,
                10468
            ],
            [
                10473,
                10481
            ],
            [
                10489,
                10504
            ],
            [
                10505,
                10557
            ],
            [
                10558,
                10597
            ],
            [
                10611,
                10638
            ],
            [
                10641,
                10700
            ],
            [
                10700,
                10701
            ],
            [
                10702,
                10705
            ],
            [
                10706,
                10711
            ],
            [
                10712,
                10719
            ],
            [
                10728,
                10733
            ],
            [
                10734,
                10787
            ],
            [
                10787,
                10853
            ],
            [
                10854,
                10858
            ],
            [
                10859,
                10865
            ],
            [
                10866,
                10870
            ],
            [
                10875,
                10878
            ],
            [
                10892,
                10909
            ],
            [
                10910,
                10925
            ],
            [
                10928,
                10985
            ],
            [
                10993,
                10995
            ],
            [
                11000,
                11002
            ],
            [
                11002,
                11022
            ],
            [
                11039,
                11051
            ],
            [
                11051,
                11097
            ],
            [
                11097,
                11099
            ],
            [
                11109,
                11121
            ],
            [
                11122,
                11134
            ],
            [
                11136,
                11185
            ],
            [
                11185,
                11212
            ],
            [
                11212,
                11214
            ],
            [
                11214,
                11305
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                160
            ],
            [
                160,
                206
            ],
            [
                206,
                255
            ],
            [
                255,
                330
            ],
            [
                330,
                348
            ],
            [
                348,
                348
            ],
            [
                348,
                368
            ],
            [
                368,
                425
            ],
            [
                425,
                516
            ],
            [
                516,
                629
            ],
            [
                629,
                629
            ],
            [
                629,
                665
            ],
            [
                665,
                692
            ],
            [
                692,
                747
            ],
            [
                747,
                880
            ],
            [
                880,
                1044
            ],
            [
                1044,
                1082
            ],
            [
                1082,
                1127
            ],
            [
                1127,
                1159
            ],
            [
                1159,
                1205
            ],
            [
                1205,
                1231
            ],
            [
                1231,
                1274
            ],
            [
                1274,
                1280
            ],
            [
                1280,
                1350
            ],
            [
                1350,
                1371
            ],
            [
                1371,
                1371
            ],
            [
                1371,
                1513
            ],
            [
                1513,
                1513
            ],
            [
                1513,
                1594
            ],
            [
                1594,
                1655
            ],
            [
                1655,
                1702
            ],
            [
                1702,
                1804
            ],
            [
                1804,
                1915
            ],
            [
                1915,
                1979
            ],
            [
                1979,
                2064
            ],
            [
                2064,
                2114
            ],
            [
                2114,
                2221
            ],
            [
                2221,
                2265
            ],
            [
                2265,
                2307
            ],
            [
                2307,
                2335
            ],
            [
                2335,
                2382
            ],
            [
                2382,
                2435
            ],
            [
                2435,
                2461
            ],
            [
                2461,
                2483
            ],
            [
                2483,
                2483
            ],
            [
                2483,
                2567
            ],
            [
                2567,
                2630
            ],
            [
                2630,
                2645
            ],
            [
                2645,
                2743
            ],
            [
                2743,
                2810
            ],
            [
                2810,
                2810
            ],
            [
                2810,
                2888
            ],
            [
                2888,
                2975
            ],
            [
                2975,
                2975
            ],
            [
                2975,
                2975
            ],
            [
                2975,
                2975
            ],
            [
                2975,
                3032
            ],
            [
                3032,
                3032
            ],
            [
                3032,
                3087
            ],
            [
                3087,
                3141
            ],
            [
                3141,
                3186
            ],
            [
                3186,
                3186
            ],
            [
                3186,
                3230
            ],
            [
                3230,
                3287
            ],
            [
                3287,
                3417
            ],
            [
                3417,
                3417
            ],
            [
                3417,
                3523
            ],
            [
                3523,
                3552
            ],
            [
                3552,
                3631
            ],
            [
                3631,
                3748
            ],
            [
                3748,
                3748
            ],
            [
                3748,
                3760
            ],
            [
                3760,
                3855
            ],
            [
                3855,
                3939
            ],
            [
                3939,
                3998
            ],
            [
                3998,
                4031
            ],
            [
                4031,
                4061
            ],
            [
                4061,
                4193
            ],
            [
                4193,
                4333
            ],
            [
                4333,
                4381
            ],
            [
                4381,
                4385
            ],
            [
                4385,
                4418
            ],
            [
                4418,
                4426
            ],
            [
                4426,
                4481
            ],
            [
                4481,
                4581
            ],
            [
                4581,
                4658
            ],
            [
                4658,
                4673
            ],
            [
                4673,
                4741
            ],
            [
                4741,
                4782
            ],
            [
                4782,
                4883
            ],
            [
                4883,
                4966
            ],
            [
                4966,
                5032
            ],
            [
                5032,
                5059
            ],
            [
                5059,
                5095
            ],
            [
                5095,
                5112
            ],
            [
                5112,
                5127
            ],
            [
                5127,
                5186
            ],
            [
                5186,
                5192
            ],
            [
                5192,
                5266
            ],
            [
                5266,
                5341
            ],
            [
                5341,
                5367
            ],
            [
                5367,
                5383
            ],
            [
                5383,
                5426
            ],
            [
                5426,
                5571
            ],
            [
                5571,
                5708
            ],
            [
                5708,
                5808
            ],
            [
                5808,
                5870
            ],
            [
                5870,
                5937
            ],
            [
                5937,
                5993
            ],
            [
                5993,
                6045
            ],
            [
                6045,
                6147
            ],
            [
                6147,
                6294
            ],
            [
                6294,
                6352
            ],
            [
                6352,
                6368
            ],
            [
                6368,
                6494
            ],
            [
                6494,
                6710
            ],
            [
                6710,
                6844
            ],
            [
                6844,
                6957
            ],
            [
                6957,
                7050
            ],
            [
                7050,
                7100
            ],
            [
                7100,
                7145
            ],
            [
                7145,
                7145
            ],
            [
                7145,
                7145
            ],
            [
                7145,
                7145
            ],
            [
                7145,
                7145
            ],
            [
                7145,
                7145
            ],
            [
                7145,
                7145
            ],
            [
                7145,
                7266
            ],
            [
                7266,
                7286
            ],
            [
                7286,
                7286
            ],
            [
                7286,
                7286
            ],
            [
                7286,
                7352
            ],
            [
                7352,
                7390
            ],
            [
                7390,
                7398
            ],
            [
                7398,
                7444
            ],
            [
                7444,
                7507
            ],
            [
                7507,
                7545
            ],
            [
                7545,
                7566
            ],
            [
                7566,
                7589
            ],
            [
                7589,
                7679
            ],
            [
                7679,
                7761
            ],
            [
                7761,
                7860
            ],
            [
                7860,
                7877
            ],
            [
                7877,
                7890
            ],
            [
                7890,
                7970
            ],
            [
                7970,
                7984
            ],
            [
                7984,
                8043
            ],
            [
                8043,
                8087
            ],
            [
                8087,
                8109
            ],
            [
                8109,
                8137
            ],
            [
                8137,
                8202
            ],
            [
                8202,
                8228
            ],
            [
                8228,
                8393
            ],
            [
                8393,
                8507
            ],
            [
                8507,
                8549
            ],
            [
                8549,
                8829
            ],
            [
                8829,
                8829
            ],
            [
                8829,
                8974
            ],
            [
                8974,
                9102
            ],
            [
                9102,
                9248
            ],
            [
                9248,
                9283
            ],
            [
                9283,
                9320
            ],
            [
                9320,
                9379
            ],
            [
                9379,
                9385
            ],
            [
                9385,
                9441
            ],
            [
                9441,
                9513
            ],
            [
                9513,
                9599
            ],
            [
                9599,
                9711
            ],
            [
                9711,
                9736
            ],
            [
                9736,
                9861
            ],
            [
                9861,
                9861
            ],
            [
                9861,
                9861
            ],
            [
                9861,
                9960
            ],
            [
                9960,
                9960
            ],
            [
                9960,
                10168
            ],
            [
                10168,
                10244
            ],
            [
                10244,
                10387
            ],
            [
                10387,
                10734
            ],
            [
                10734,
                10787
            ],
            [
                10787,
                11002
            ],
            [
                11002,
                11051
            ],
            [
                11051,
                11097
            ],
            [
                11097,
                11121
            ],
            [
                11121,
                11185
            ],
            [
                11185,
                11214
            ],
            [
                11214,
                11307
            ],
            [
                11307,
                11307
            ],
            [
                11307,
                11307
            ],
            [
                11307,
                11307
            ]
        ]
    }
}