{
    "original": {
        "text": "\"Old and young, boy, let 'em all eat, I have it; Let 'em have ten tire of teeth a-piece, I care not. ROLLO, DUKE OF NORMANDY.\nMargaret went home so painfully occupied with what she had heard and seen that she hardly knew how to rouse herself up to the duties which awaited her; the necessity for keeping up a constant flow of cheerful conversation for her mother, who, now that she was unable to go out, always looked to Margaret's return from the shortest walk as bringing in some news.\n\"And can your factory friend come on Thursday to see you dressed?\"\n\"She was so ill I never thought of asking her,\" said Margaret, dolefully.\n\"Dear! Everybody is ill now, I think,\" said Mrs. Hale, with a little of the jealousy which one invalid is apt to feel of another. \"But it must be very sad to be ill in one of those little back streets.\" (Her kindly nature prevailing, and the old Helstone habits of thought returning.) \"It's bad enough here. What could you do for her, Margaret? Mr. Thornton has sent me some of his old port wine since you went out. Would a bottle of that do her good, think you?\"\n\"No, mamma! I don't believe they are very poor,--at least, they don't speak as if they were; and, at any rate, Bessy's illness is consumption--she won't want wine. Perhaps, I might take her a little preserve, made of our dear Helstone fruit. No! there's another family to whom I should like to give--Oh mamma, mamma! how am I to dress up in my finery, and go off and away to smart parties, after the sorrow I've seen to-day?\" exclaimed Margaret, bursting the bounds she had preordained for herself before she came in, and telling her mother what she had seen and heard at Higgins's cottage.\nIt distressed Mrs. Hale excessively. It made her restlessly irritated till she could do something. She directed Margaret to pack up a basket in the very drawing-room, to be sent there and then to the family; and was almost angry with her for saying, that it would not signify if it did not go till morning, as she knew Higgins had provided for their immediate wants, and she herself had left money with Bessy. Mrs. Hale called her unfeeling for saying this; and never gave herself breathing-time till the basket was sent out of the house. Then she said:\n\"After all, we may have been doing wrong. It was only the last time Mr. Thornton was here that he said, those were no true friends who helped to prolong the struggle by assisting the turn-outs. And this Boucher-man was a turn-out, was he not?\"\nThe question was referred to Mr. Hale by his wife, when he came upstairs, fresh from giving a lesson to Mr. Thornton, which had ended in conversation, as was their wont. Margaret did not care if their gifts had prolonged the strife; she did not think far enough for that, in her present excited state.\nMr. Hale listened, and tried to be as calm as a judge; he recalled all that had seemed so clear not half-an-hour before, as it came out of Mr. Thornton's lips; and then he made an unsatisfactory compromise. His wife and daughter had not only done quite right in this instance, but he did not see for a moment how they could have done otherwise. Nevertheless, as a general rule, it was very true what Mr. Thornton said, that as the strike, if prolonged, must end in the masters bringing hands from a distance (if, indeed, the final result were not, as it had often been before, the invention of some machine which would diminish the need of hands at all), why, it was clear enough that the kindest thing was to refuse all help which might bolster them up in their folly. But as to this Boucher, he would go and see him the first thing in the morning, and try and find out what could be done for him.\nMr. Hale went the next morning, as he proposed. He did not find Boucher at home, but he had a long talk with his wife; promised to ask for an Infirmary order for; and, seeing the plenty provided by Mrs. Hale, and somewhat lavishly used by the children, who were masters downstairs in their father's absence, he came back with a more consoling and cheerful account than Margaret had dared to hope for; indeed, what she had said the night before had prepared her father for so much worse a state of things that, by a re-action of his imagination, he described all as better than it really was.\n\"But I will go again, and see the man himself,\" said Mr. Hale. \"I hardly know as yet how to compare one of these houses with our Helstone cottages. I see furniture here which our labourers would never have thought of buying, and food commonly used which they would consider luxuries; yet for these very families there seems no other resource now that their weekly wages are stopped, but the pawn-shop. One had need to learn a different standard, up here in Milton.\"\nBessy, too, was rather better this day. Still she was so weak that she seemed to have entirely forgotten her wish to see Margaret dressed--if, indeed, that had not been the feverish desire of a half delirious state.\nMargaret could not help comparing this strange dressing of hers, to go where she did not care to be--her heart heavy with various anxieties--with the old, merry, girlish toilettes that she and Edith had performed scarcely more than a year ago. Her only pleasure now in decking herself out was in thinking that her mother would take delight in seeing her dressed. She blushed when Dixon, throwing the drawing-room door open, made an appeal for admiration.\n\"Miss Hale looks well, ma'am,--doesn't she? Mrs. Shaw's coral couldn't have come in better. It just gives the right touch of colour, ma'am. Otherwise, Miss Margaret, you would have been too pale.\"\nMargaret's black hair was too thick to be plaited; it needed rather to be twisted round and round, and have its fine silkiness compressed into massive coils, that encircled her head like a crown, and then were gathered into a large spiral knot behind. She kept its weight together by two large coral pins, like small arrows for length. Her white silk sleeves were looped up with strings of the same material, and on her neck, just below the base of her curved and milk-white throat, there lay heavy coral beads.\n\"Oh, Margaret! how I should like to be going with you to one of the old Barrington assemblies,--taking you as Lady Beresford used to take me.\"\nMargaret kissed her mother for this little burst of maternal vanity; but she could hardly smile at it, she felt so much out of spirits.\n\"I would rather stay at home with you,--much rather, mamma.\"\n\"Nonsense, darling! Be sure you notice the dinner well. I shall like to hear how they manage these things in Milton. Particularly the second course, dear. Look what they have instead of game.\"\nMrs. Hale would have been more than interested,--she would have been astonished, if she had seen the sumptuousness of the dinner-table and its appointments. Margaret, with her London cultivated taste, felt the number of delicacies to be oppressive; one half of the quantity would have been enough, and the effect tighter and more elegant. But it was one of Mrs. Thornton's rigorous laws of hospitality, that of each separate dainty enough should be provided for all the guests to partake, if they felt inclined. Careless to abstemiousness in her daily habits, it was part of her pride to set a feast before such of her guests as cared for it. Her son shared this feeling. He had never known--though he might have imagined, and had the capability to relish--any kind of society but that which depended on an exchange of superb meals: and even now, though he was denying himself the personal expenditure of an unnecessary sixpence, and had more than once regretted that the invitations for this dinner had been sent out, still, as it was to be, he was glad to see the old magnificence of preparation.\nMargaret and her father were the first to arrive. Mr. Hale was anxiously punctual to the time specified. There was no one upstairs in the drawing-room but Mrs. Thornton and Fanny. Every cover was taken off, and the apartment blazed forth in yellow silk damask and a brilliantly flowered carpet. Every corner seemed filled up with ornament, until it became a weariness to the eye, and presented a strange contrast to the bald ugliness of the look-out into the great mill-yard, where wide folding gates were thrown open for the admission of carriages. The mill loomed high on the left-hand side of the windows, casting a shadow down from its many stories, which darkened the summer evening before its time.\n\"My son was engaged up to the last moment on business. He will be here directly, Mr. Hale. May I beg you to take a seat?\"\nMr. Hale was standing at one of the windows as Mrs. Thornton spoke. He turned away, saying,\n\"Don't you find such close neighbourhood to the mill rather unpleasant at times?\"\nShe drew herself up:\n\"Never. I am not become so fine as to desire to forget the source of my son's wealth and power. Besides, there is not such another factory in Milton. One room alone is two hundred and twenty square yards.\"\n\"I meant that the smoke and the noise--the constant going out and coming in of the workpeople, might be annoying!\"\n\"I agree with you, Mr. Hale!\" said Fanny. \"There is a continual smell of steam and oily machinery--and the noise is perfectly deafening.\"\n\"I have heard noise that was called music far more deafening. The engine-room is at the street-end of the factory; we hardly hear it, except in summer weather, when all the windows are open; and as for the continual murmur of the workpeople, it disturbs me no more than the humming of a hive of bees. If I think of it at all, I connect it with my son, and feel how all belongs to him, and that his is the head that directs it. Just now, there are no sounds to come from the mill; the hands have been ungrateful enough to turn out, as perhaps you have heard. But the very business (of which I spoke when you entered), had reference to the steps he is going to take to make them learn their place.\" The expression on her face, always stern, deepened into dark anger, as she said this. Nor did it clear away when Mr. Thornton entered the room; for she saw in an instant, the weight of care and anxiety which he could not shake off, although his guests received from him a greeting that appeared both cheerful and cordial. He shook hands with Margaret. He knew it was the first time their hands had met, though she was perfectly unconscious of the fact. He inquired after Mrs. Hale, and heard Mr. Hale's sanguine, hopeful account; and, glancing to Margaret, to understand how far she agreed with her father, he saw that no dissenting shadow crossed her face. And as he looked with this intention, he was struck anew with her great beauty. He had never seen her in such dress before; and yet now it appeared that such elegance of attire was so befitting her noble figure and lofty serenity of countenance that she ought to go always thus apparelled. She was talking to Fanny; about what he could not hear; but he saw his sister's restless way of continually arranging some part of her gown, her wandering eyes, now glancing here, now there, but without any purpose in her observation; and he contrasted them uneasily with the large soft eyes that looked forth steadily at one object, as if from out their light beamed some gentle influence of repose: the curving lines of the red lips, just parted in the interest of listening to what her companion said--the head a little bent forwards, so as to make a long sweeping line from the summit, where the light caught on the glossy raven hair, to the smooth ivory tip of the shoulder; the round white arms, and taper hands, laid lightly across each other, but perfectly motionless in their pretty attitude. Mr. Thornton sighed as he took in all this with one of his sudden comprehensive glances. And then he turned his back to the young ladies, and threw himself, with an effort, but with all his heart and soul, into a conversation with Mr. Hale.\nMore people came--more and more. Fanny left Margaret's side and helped her mother to receive her guests. Mr. Thornton felt that in this influx no one was speaking to Margaret, and was restless under this apparent neglect. But he never went near her himself; he did not look at her. Only, he knew what she was doing--or not doing--better than he knew the movements of any one else in the room. Margaret was so unconscious of herself, and so much amused by watching other people, that she never thought whether she was left unnoticed or not. Somebody took her down to dinner; she did not catch the name; nor did he seem much inclined to talk to her. There was a very animated conversation going on among the gentlemen; the ladies, for the most part, were silent, employing themselves in taking notes of the dinner and criticising each other's dresses. Margaret caught the clue to the general conversation, grew interested and listened attentively. Mr. Horsfall, the stranger, whose visit to the town was the original germ of the party, was asking questions relative to the trade and manufactures of the place; and the rest of the gentlemen--all Milton men--were giving him answers and explanations. Some dispute arose, which was warmly contested; it was referred to Mr. Thornton, who had hardly spoken before; but who now gave an opinion, the grounds of which were so clearly stated that even the opponents yielded. Margaret's attention was thus called to her host; his whole manner, as master of the house, and entertainer of his friends, was so straightforward, yet simple and modest, as to be thoroughly dignified. Margaret thought she had never seen him to so much advantage. When he had come to their house, there had been always something, either of over-eagerness or of that kind of vexed annoyance which seemed ready to pre-suppose that he was unjustly judged, and yet felt too proud to try and make himself better understood. But now, among his fellows, there was no uncertainty as to his position. He was regarded by them as a man of great force of character; of power in many ways. There was no need to struggle for their respect. He had it, and he knew it; and the security of this gave a fine grand quietness to his voice and ways, which Margaret had missed before.\nHe was not in the habit of talking to ladies; and what he did say was a little formal. To Margaret herself he hardly spoke at all. She was surprised to think how much she enjoyed this dinner. She knew enough now to understand many local interests--nay, even some of the technical words employed by the eager millowners. She silently took a very decided part in the question they were discussing. At any rate, they talked in desperate earnest,--not in the used-up style that wearied her so in the old London parties. She wondered that, with all this dwelling on the manufacturers and trade of the place, no allusion was made to the strike then pending. She did not yet know how coolly such things were taken by the masters, as having only one possible end. To be sure, the men were cutting their own throats, as they had done many a time before; but if they would be fools, and put themselves into the hands of a rascally set of paid delegates, they must take the consequence. One or two thought Thornton looked out of spirits; and, of course, he must lose by this turn-out. But it was an accident that might happen to themselves any day; and Thornton was as good to manage a strike as any one; for he was as iron a chap as any in Milton. The hands had mistaken their man in trying that dodge on him. And they chuckled inwardly at the idea of the workmen's discomfiture and defeat, in their attempt to alter one iota of what Thornton had decreed.\nIt was rather dull for Margaret after dinner. She was glad when the gentlemen came, not merely because she caught her father's eye to brighten her sleepiness up; but because she could listen to something larger and grander than the petty interests which the ladies had been talking about. She liked the exultation in the sense of power which these Milton men had. It might be rather rampant in its display, and savour of boasting; but still they seemed to defy the old limits of possibility, in a kind of fine intoxication, caused by the recollection of what had been achieved, and what yet should be. If in her cooler moments she might not approve of the spirit in all things, still there was much to admire in their forgetfulness of themselves and the present, in their anticipated triumphs over all inanimate matter at some future time which none of them would live to see. She was rather startled when Mr. Thornton spoke to her close at her elbow:\n\"I could see you were on our side in our discussion at dinner,--were you not, Miss Hale?\"\n\"Certainly. But then I know so little about it. I was surprised, however, to find from what Mr. Horsfall said, that there were others who thought in so diametrically opposite a manner, as the Mr. Morison he spoke about. He cannot be a gentleman--is he?\"\n\"I am not quite the person to decide on another's gentlemanliness, Miss Hale. I mean, I don't quite understand your application of the word. But I should say that this Morison is no true man. I don't know who he is; I merely judge him from Mr. Horsfall's account.\"\n\"I suspect my 'gentleman' includes your 'true man.'\"\n\"And a great deal more, you would imply. I differ from you. A man is to me a higher and a completer being than a gentleman.\"\n\"What do you mean?\" asked Margaret. \"We must understand the words differently.\"\n\"I take it that 'gentleman' is a term that only describes a person in his relation to others; but when we speak of him as 'a man,' we consider him not merely with regard to his fellow-men, but in relation to himself,--to life--to time--to eternity. A cast-away lonely as Robinson Crusoe--a prisoner immured in a dungeon for life--nay, even a saint in Patmos, has his endurance, his strength, his faith, best described by being spoken of as 'a man.' I am rather weary of this word 'gentlemanly,' which seems to me to be often inappropriately used, and often, too, with such exaggerated distortion of meaning, while the full simplicity of the noun 'man,' and the adjective 'manly' are acknowledged--that I am induced to class it with the cant of the day.\"\nMargaret thought a moment--but before she could speak her slow conviction, he was called away by some of the eager manufacturers, whose speeches she could not hear, though she could guess at their import by the short clear answers Mr. Thornton gave, which came steady and firm as the boom of a distant minute gun. They were evidently talking of the turn-out, and suggesting what course had best be pursued. She heard Mr. Thornton say:\n\"That has been done.\" Then came a hurried murmur, in which two or three joined.\n\"All those arrangements have been made.\"\nSome doubts were implied, some difficulties named by Mr. Slickson, who took hold of Mr. Thornton's arm, the better to impress his words. Mr. Thornton moved slightly away, lifted his eyebrows a very little, and then replied:\n\"I take the risk. You need not join in it unless you choose.\" Still some more fears were urged.\n\"I'm not afraid of anything so dastardly as incendiarism. We are open enemies; and I can protect myself from any violence that I apprehend. And I will assuredly protect all others who come to me for work. They know my determination by this time, as well and as fully as you do.\"\nMr. Horsfall took him a little on one side, as Margaret conjectured, to ask him some other question about the strike; but, in truth, it was to inquire who she herself was--so quiet, so stately, and so beautiful.\n\"A Milton lady?\" asked he, as the name was given.\n\"No! from the south of England--Hampshire, I believe,\" was the cold, indifferent answer.\nMrs. Slickson was catechising Fanny on the same subject.\n\"Who is that fine distinguished-looking girl? a sister of Mr. Horsfall's?\"\n\"Oh dear, no! That is Mr. Hale, her father, talking now to Mr. Stephens. He gives lessons; that is to say, he reads with young men. My brother John goes to him twice a week, and so he begged mamma to ask them here, in hopes of getting him known. I believe we have some of their prospectuses, if you would like to have one.\"\n\"Mr. Thornton! Does he really find time to read with a tutor, in the midst of all his business,--and this abominable strike in hand as well?\"\nFanny was not sure, from Mrs. Slickson's manner, whether she ought to be proud or ashamed of her brother's conduct; and, like all people who try and take other people's \"ought\" for the rule of their feelings, she was inclined to blush for any singularity of action. Her shame was interrupted by the dispersion of the guests.",
        "paragraph_chars": [
            [
                0,
                126
            ],
            [
                126,
                488
            ],
            [
                488,
                555
            ],
            [
                555,
                629
            ],
            [
                629,
                1093
            ],
            [
                1093,
                1684
            ],
            [
                1684,
                2238
            ],
            [
                2238,
                2482
            ],
            [
                2482,
                2784
            ],
            [
                2784,
                3683
            ],
            [
                3683,
                4275
            ],
            [
                4275,
                4741
            ],
            [
                4741,
                4957
            ],
            [
                4957,
                5412
            ],
            [
                5412,
                5609
            ],
            [
                5609,
                6121
            ],
            [
                6121,
                6264
            ],
            [
                6264,
                6400
            ],
            [
                6400,
                6461
            ],
            [
                6461,
                6654
            ],
            [
                6654,
                7753
            ],
            [
                7753,
                8458
            ],
            [
                8458,
                8580
            ],
            [
                8580,
                8672
            ],
            [
                8672,
                8754
            ],
            [
                8754,
                8775
            ],
            [
                8775,
                8981
            ],
            [
                8981,
                9096
            ],
            [
                9096,
                9234
            ],
            [
                9234,
                11922
            ],
            [
                11922,
                14199
            ],
            [
                14199,
                15645
            ],
            [
                15645,
                16597
            ],
            [
                16597,
                16687
            ],
            [
                16687,
                16941
            ],
            [
                16941,
                17206
            ],
            [
                17206,
                17259
            ],
            [
                17259,
                17384
            ],
            [
                17384,
                17464
            ],
            [
                17464,
                18218
            ],
            [
                18218,
                18653
            ],
            [
                18653,
                18733
            ],
            [
                18733,
                18774
            ],
            [
                18774,
                18998
            ],
            [
                18998,
                19094
            ],
            [
                19094,
                19373
            ],
            [
                19373,
                19585
            ],
            [
                19585,
                19635
            ],
            [
                19635,
                19724
            ],
            [
                19724,
                19781
            ],
            [
                19781,
                19856
            ],
            [
                19856,
                20180
            ],
            [
                20180,
                20322
            ],
            [
                20322,
                20646
            ]
        ],
        "segment_chars": [
            [
                0,
                101
            ],
            [
                101,
                126
            ],
            [
                126,
                488
            ],
            [
                488,
                555
            ],
            [
                555,
                629
            ],
            [
                629,
                636
            ],
            [
                636,
                759
            ],
            [
                759,
                832
            ],
            [
                832,
                914
            ],
            [
                914,
                937
            ],
            [
                937,
                974
            ],
            [
                974,
                1045
            ],
            [
                1045,
                1093
            ],
            [
                1093,
                1105
            ],
            [
                1105,
                1257
            ],
            [
                1257,
                1335
            ],
            [
                1335,
                1339
            ],
            [
                1339,
                1410
            ],
            [
                1410,
                1519
            ],
            [
                1519,
                1684
            ],
            [
                1684,
                1721
            ],
            [
                1721,
                1783
            ],
            [
                1783,
                2094
            ],
            [
                2094,
                2223
            ],
            [
                2223,
                2238
            ],
            [
                2238,
                2280
            ],
            [
                2280,
                2432
            ],
            [
                2432,
                2482
            ],
            [
                2482,
                2652
            ],
            [
                2652,
                2784
            ],
            [
                2784,
                2991
            ],
            [
                2991,
                3129
            ],
            [
                3129,
                3554
            ],
            [
                3554,
                3683
            ],
            [
                3683,
                3731
            ],
            [
                3731,
                4275
            ],
            [
                4275,
                4338
            ],
            [
                4338,
                4423
            ],
            [
                4423,
                4677
            ],
            [
                4677,
                4741
            ],
            [
                4741,
                4781
            ],
            [
                4781,
                4957
            ],
            [
                4957,
                5201
            ],
            [
                5201,
                5320
            ],
            [
                5320,
                5412
            ],
            [
                5412,
                5456
            ],
            [
                5456,
                5504
            ],
            [
                5504,
                5552
            ],
            [
                5552,
                5609
            ],
            [
                5609,
                5861
            ],
            [
                5861,
                5945
            ],
            [
                5945,
                6121
            ],
            [
                6121,
                6136
            ],
            [
                6136,
                6264
            ],
            [
                6264,
                6400
            ],
            [
                6400,
                6461
            ],
            [
                6461,
                6481
            ],
            [
                6481,
                6517
            ],
            [
                6517,
                6578
            ],
            [
                6578,
                6616
            ],
            [
                6616,
                6654
            ],
            [
                6654,
                6811
            ],
            [
                6811,
                6993
            ],
            [
                6993,
                7166
            ],
            [
                7166,
                7297
            ],
            [
                7297,
                7326
            ],
            [
                7326,
                7753
            ],
            [
                7753,
                7803
            ],
            [
                7803,
                7858
            ],
            [
                7858,
                7933
            ],
            [
                7933,
                8048
            ],
            [
                8048,
                8303
            ],
            [
                8303,
                8458
            ],
            [
                8458,
                8513
            ],
            [
                8513,
                8549
            ],
            [
                8549,
                8580
            ],
            [
                8580,
                8648
            ],
            [
                8648,
                8672
            ],
            [
                8672,
                8754
            ],
            [
                8754,
                8775
            ],
            [
                8775,
                8783
            ],
            [
                8783,
                8871
            ],
            [
                8871,
                8925
            ],
            [
                8925,
                8981
            ],
            [
                8981,
                9096
            ],
            [
                9096,
                9126
            ],
            [
                9126,
                9138
            ],
            [
                9138,
                9234
            ],
            [
                9234,
                9296
            ],
            [
                9296,
                9535
            ],
            [
                9535,
                9661
            ],
            [
                9661,
                9792
            ],
            [
                9792,
                9931
            ],
            [
                9931,
                10017
            ],
            [
                10017,
                10253
            ],
            [
                10253,
                10283
            ],
            [
                10283,
                10384
            ],
            [
                10384,
                10589
            ],
            [
                10589,
                10669
            ],
            [
                10669,
                10879
            ],
            [
                10879,
                11681
            ],
            [
                11681,
                11770
            ],
            [
                11770,
                11922
            ],
            [
                11922,
                11955
            ],
            [
                11955,
                12027
            ],
            [
                12027,
                12144
            ],
            [
                12144,
                12204
            ],
            [
                12204,
                12315
            ],
            [
                12315,
                12462
            ],
            [
                12462,
                12570
            ],
            [
                12570,
                12772
            ],
            [
                12772,
                12868
            ],
            [
                12868,
                13119
            ],
            [
                13119,
                13336
            ],
            [
                13336,
                13538
            ],
            [
                13538,
                13600
            ],
            [
                13600,
                13855
            ],
            [
                13855,
                13928
            ],
            [
                13928,
                14013
            ],
            [
                14013,
                14062
            ],
            [
                14062,
                14199
            ],
            [
                14199,
                14286
            ],
            [
                14286,
                14330
            ],
            [
                14330,
                14391
            ],
            [
                14391,
                14519
            ],
            [
                14519,
                14595
            ],
            [
                14595,
                14715
            ],
            [
                14715,
                14851
            ],
            [
                14851,
                14955
            ],
            [
                14955,
                15175
            ],
            [
                15175,
                15273
            ],
            [
                15273,
                15437
            ],
            [
                15437,
                15499
            ],
            [
                15499,
                15645
            ],
            [
                15645,
                15691
            ],
            [
                15691,
                15934
            ],
            [
                15934,
                16009
            ],
            [
                16009,
                16247
            ],
            [
                16247,
                16522
            ],
            [
                16522,
                16597
            ],
            [
                16597,
                16687
            ],
            [
                16687,
                16699
            ],
            [
                16699,
                16735
            ],
            [
                16735,
                16907
            ],
            [
                16907,
                16941
            ],
            [
                16941,
                17019
            ],
            [
                17019,
                17082
            ],
            [
                17082,
                17133
            ],
            [
                17133,
                17206
            ],
            [
                17206,
                17259
            ],
            [
                17259,
                17300
            ],
            [
                17300,
                17319
            ],
            [
                17319,
                17384
            ],
            [
                17384,
                17404
            ],
            [
                17404,
                17420
            ],
            [
                17420,
                17464
            ],
            [
                17464,
                17713
            ],
            [
                17713,
                17913
            ],
            [
                17913,
                18218
            ],
            [
                18218,
                18532
            ],
            [
                18532,
                18625
            ],
            [
                18625,
                18653
            ],
            [
                18653,
                18675
            ],
            [
                18675,
                18733
            ],
            [
                18733,
                18774
            ],
            [
                18774,
                18911
            ],
            [
                18911,
                18998
            ],
            [
                18998,
                19016
            ],
            [
                19016,
                19060
            ],
            [
                19060,
                19094
            ],
            [
                19094,
                19152
            ],
            [
                19152,
                19234
            ],
            [
                19234,
                19299
            ],
            [
                19299,
                19373
            ],
            [
                19373,
                19585
            ],
            [
                19585,
                19602
            ],
            [
                19602,
                19635
            ],
            [
                19635,
                19640
            ],
            [
                19640,
                19724
            ],
            [
                19724,
                19781
            ],
            [
                19781,
                19827
            ],
            [
                19827,
                19856
            ],
            [
                19856,
                19870
            ],
            [
                19870,
                19929
            ],
            [
                19929,
                19988
            ],
            [
                19988,
                20102
            ],
            [
                20102,
                20180
            ],
            [
                20180,
                20195
            ],
            [
                20195,
                20322
            ],
            [
                20322,
                20588
            ],
            [
                20588,
                20646
            ]
        ],
        "overlap_chars": [
            [
                126,
                190
            ],
            [
                200,
                208
            ],
            [
                209,
                215
            ],
            [
                304,
                308
            ],
            [
                318,
                429
            ],
            [
                225,
                227
            ],
            [
                477,
                488
            ],
            [
                489,
                552
            ],
            [
                560,
                600
            ],
            [
                603,
                629
            ],
            [
                631,
                636
            ],
            [
                636,
                665
            ],
            [
                668,
                759
            ],
            [
                760,
                829
            ],
            [
                832,
                861
            ],
            [
                911,
                914
            ],
            [
                976,
                977
            ],
            [
                978,
                1003
            ],
            [
                1011,
                1024
            ],
            [
                1043,
                1045
            ],
            [
                1045,
                1090
            ],
            [
                1094,
                1103
            ],
            [
                1105,
                1139
            ],
            [
                1184,
                1189
            ],
            [
                1204,
                1234
            ],
            [
                1236,
                1257
            ],
            [
                1257,
                1264
            ],
            [
                1266,
                1291
            ],
            [
                1328,
                1333
            ],
            [
                1292,
                1300
            ],
            [
                1333,
                1335
            ],
            [
                1335,
                1339
            ],
            [
                1339,
                1391
            ],
            [
                1393,
                1395
            ],
            [
                1403,
                1410
            ],
            [
                1410,
                1451
            ],
            [
                1465,
                1501
            ],
            [
                1505,
                1509
            ],
            [
                1519,
                1566
            ],
            [
                1579,
                1590
            ],
            [
                1609,
                1633
            ],
            [
                1682,
                1684
            ],
            [
                1684,
                1721
            ],
            [
                1783,
                1786
            ],
            [
                1796,
                1824
            ],
            [
                1849,
                1932
            ],
            [
                1934,
                1947
            ],
            [
                1977,
                2094
            ],
            [
                2094,
                2124
            ],
            [
                2142,
                2145
            ],
            [
                2185,
                2195
            ],
            [
                2200,
                2223
            ],
            [
                2223,
                2238
            ],
            [
                2239,
                2280
            ],
            [
                2308,
                2318
            ],
            [
                2336,
                2432
            ],
            [
                2432,
                2479
            ],
            [
                2511,
                2519
            ],
            [
                2533,
                2555
            ],
            [
                2567,
                2598
            ],
            [
                2650,
                2652
            ],
            [
                2784,
                2815
            ],
            [
                2832,
                2837
            ],
            [
                2837,
                2991
            ],
            [
                3065,
                3079
            ],
            [
                3093,
                3096
            ],
            [
                2991,
                3012
            ],
            [
                3102,
                3129
            ],
            [
                3129,
                3141
            ],
            [
                3160,
                3201
            ],
            [
                3203,
                3207
            ],
            [
                3211,
                3260
            ],
            [
                3261,
                3291
            ],
            [
                3141,
                3142
            ],
            [
                3469,
                3554
            ],
            [
                3554,
                3557
            ],
            [
                3558,
                3601
            ],
            [
                3606,
                3683
            ],
            [
                3683,
                3713
            ],
            [
                3729,
                3731
            ],
            [
                3731,
                3844
            ],
            [
                4140,
                4143
            ],
            [
                3844,
                3952
            ],
            [
                3964,
                4015
            ],
            [
                4030,
                4064
            ],
            [
                4079,
                4082
            ],
            [
                4273,
                4275
            ],
            [
                4276,
                4320
            ],
            [
                4323,
                4338
            ],
            [
                4339,
                4352
            ],
            [
                4360,
                4374
            ],
            [
                4382,
                4423
            ],
            [
                4423,
                4508
            ],
            [
                4523,
                4616
            ],
            [
                4617,
                4631
            ],
            [
                4639,
                4677
            ],
            [
                4677,
                4680
            ],
            [
                4690,
                4692
            ],
            [
                4699,
                4738
            ],
            [
                4741,
                4779
            ],
            [
                4781,
                4786
            ],
            [
                4795,
                4878
            ],
            [
                4955,
                4957
            ],
            [
                4957,
                5020
            ],
            [
                5058,
                5078
            ],
            [
                5087,
                5096
            ],
            [
                5098,
                5117
            ],
            [
                5137,
                5201
            ],
            [
                5201,
                5320
            ],
            [
                5320,
                5342
            ],
            [
                5410,
                5412
            ],
            [
                5418,
                5441
            ],
            [
                5443,
                5456
            ],
            [
                5456,
                5473
            ],
            [
                5512,
                5543
            ],
            [
                5550,
                5552
            ],
            [
                5552,
                5606
            ],
            [
                5609,
                5696
            ],
            [
                5747,
                5759
            ],
            [
                5760,
                5834
            ],
            [
                5841,
                5861
            ],
            [
                5861,
                5913
            ],
            [
                5943,
                5945
            ],
            [
                6022,
                6045
            ],
            [
                6058,
                6068
            ],
            [
                6078,
                6121
            ],
            [
                6122,
                6136
            ],
            [
                6136,
                6214
            ],
            [
                6264,
                6290
            ],
            [
                6365,
                6366
            ],
            [
                6333,
                6336
            ],
            [
                6451,
                6452
            ],
            [
                6401,
                6438
            ],
            [
                6453,
                6458
            ],
            [
                6462,
                6481
            ],
            [
                6481,
                6492
            ],
            [
                6500,
                6510
            ],
            [
                6515,
                6517
            ],
            [
                6517,
                6576
            ],
            [
                6654,
                6679
            ],
            [
                6723,
                6733
            ],
            [
                6735,
                6788
            ],
            [
                6809,
                6811
            ],
            [
                6811,
                6819
            ],
            [
                6855,
                6902
            ],
            [
                6907,
                6911
            ],
            [
                6928,
                6966
            ],
            [
                6979,
                6993
            ],
            [
                6993,
                7055
            ],
            [
                7057,
                7061
            ],
            [
                7086,
                7111
            ],
            [
                7062,
                7085
            ],
            [
                7112,
                7150
            ],
            [
                7164,
                7166
            ],
            [
                7178,
                7188
            ],
            [
                7212,
                7260
            ],
            [
                7269,
                7279
            ],
            [
                7295,
                7296
            ],
            [
                7297,
                7326
            ],
            [
                7326,
                7344
            ],
            [
                7411,
                7485
            ],
            [
                7487,
                7495
            ],
            [
                7501,
                7530
            ],
            [
                7562,
                7573
            ],
            [
                7535,
                7543
            ],
            [
                7375,
                7384
            ],
            [
                7607,
                7678
            ],
            [
                7697,
                7736
            ],
            [
                7751,
                7753
            ],
            [
                7805,
                7834
            ],
            [
                7753,
                7802
            ],
            [
                7858,
                7874
            ],
            [
                7884,
                7933
            ],
            [
                7949,
                8030
            ],
            [
                8040,
                8048
            ],
            [
                8048,
                8101
            ],
            [
                8111,
                8115
            ],
            [
                8124,
                8193
            ],
            [
                8203,
                8234
            ],
            [
                8275,
                8278
            ],
            [
                8248,
                8270
            ],
            [
                8121,
                8123
            ],
            [
                8292,
                8303
            ],
            [
                8303,
                8335
            ],
            [
                8360,
                8371
            ],
            [
                8372,
                8378
            ],
            [
                8407,
                8440
            ],
            [
                8456,
                8458
            ],
            [
                8462,
                8465
            ],
            [
                8516,
                8549
            ],
            [
                8549,
                8577
            ],
            [
                8580,
                8648
            ],
            [
                8648,
                8672
            ],
            [
                8676,
                8751
            ],
            [
                8754,
                8773
            ],
            [
                8776,
                8783
            ],
            [
                8783,
                8871
            ],
            [
                8871,
                8892
            ],
            [
                8898,
                8905
            ],
            [
                8893,
                8897
            ],
            [
                8906,
                8925
            ],
            [
                8925,
                8978
            ],
            [
                8982,
                9018
            ],
            [
                9020,
                9038
            ],
            [
                9054,
                9056
            ],
            [
                9043,
                9046
            ],
            [
                9039,
                9042
            ],
            [
                9057,
                9059
            ],
            [
                9068,
                9093
            ],
            [
                9097,
                9123
            ],
            [
                9126,
                9138
            ],
            [
                9145,
                9178
            ],
            [
                9195,
                9231
            ],
            [
                9235,
                9296
            ],
            [
                9296,
                9321
            ],
            [
                9329,
                9374
            ],
            [
                9394,
                9423
            ],
            [
                9429,
                9439
            ],
            [
                9464,
                9468
            ],
            [
                9328,
                9329
            ],
            [
                9468,
                9475
            ],
            [
                9488,
                9535
            ],
            [
                9661,
                9690
            ],
            [
                9699,
                9792
            ],
            [
                9792,
                9795
            ],
            [
                9881,
                9889
            ],
            [
                9898,
                9928
            ],
            [
                9931,
                9997
            ],
            [
                9999,
                10017
            ],
            [
                10017,
                10033
            ],
            [
                10039,
                10086
            ],
            [
                10087,
                10120
            ],
            [
                10133,
                10191
            ],
            [
                10201,
                10202
            ],
            [
                10231,
                10239
            ],
            [
                10203,
                10211
            ],
            [
                10251,
                10252
            ],
            [
                10253,
                10283
            ],
            [
                10283,
                10384
            ],
            [
                10384,
                10433
            ],
            [
                10444,
                10464
            ],
            [
                10466,
                10474
            ],
            [
                10478,
                10486
            ],
            [
                10536,
                10588
            ],
            [
                10593,
                10605
            ],
            [
                10625,
                10669
            ],
            [
                10669,
                10712
            ],
            [
                10759,
                10765
            ],
            [
                10773,
                10775
            ],
            [
                10783,
                10803
            ],
            [
                10810,
                10812
            ],
            [
                10877,
                10879
            ],
            [
                10879,
                10915
            ],
            [
                11038,
                11039
            ],
            [
                10916,
                10933
            ],
            [
                10939,
                10974
            ],
            [
                11010,
                11023
            ],
            [
                11034,
                11038
            ],
            [
                11024,
                11033
            ],
            [
                11074,
                11093
            ],
            [
                11112,
                11182
            ],
            [
                11189,
                11211
            ],
            [
                10933,
                10934
            ],
            [
                11280,
                11291
            ],
            [
                11305,
                11329
            ],
            [
                11346,
                11355
            ],
            [
                11384,
                11460
            ],
            [
                11499,
                11516
            ],
            [
                11518,
                11584
            ],
            [
                11591,
                11596
            ],
            [
                11598,
                11628
            ],
            [
                11679,
                11681
            ],
            [
                11681,
                11728
            ],
            [
                11740,
                11760
            ],
            [
                11768,
                11770
            ],
            [
                11770,
                11797
            ],
            [
                11801,
                11853
            ],
            [
                11887,
                11922
            ],
            [
                11922,
                11938
            ],
            [
                11953,
                11955
            ],
            [
                11955,
                11981
            ],
            [
                11982,
                12027
            ],
            [
                12027,
                12049
            ],
            [
                12065,
                12114
            ],
            [
                12178,
                12179
            ],
            [
                12144,
                12147
            ],
            [
                12180,
                12204
            ],
            [
                12204,
                12236
            ],
            [
                12252,
                12288
            ],
            [
                12297,
                12314
            ],
            [
                12315,
                12453
            ],
            [
                12460,
                12462
            ],
            [
                12462,
                12570
            ],
            [
                12570,
                12638
            ],
            [
                12772,
                12780
            ],
            [
                12826,
                12868
            ],
            [
                12868,
                12881
            ],
            [
                12886,
                12894
            ],
            [
                12908,
                12919
            ],
            [
                12954,
                12966
            ],
            [
                13065,
                13071
            ],
            [
                12993,
                13015
            ],
            [
                13028,
                13059
            ],
            [
                13077,
                13119
            ],
            [
                13119,
                13138
            ],
            [
                13170,
                13221
            ],
            [
                13228,
                13257
            ],
            [
                13285,
                13295
            ],
            [
                13303,
                13307
            ],
            [
                13313,
                13335
            ],
            [
                13386,
                13402
            ],
            [
                13404,
                13538
            ],
            [
                13538,
                13600
            ],
            [
                13600,
                13654
            ],
            [
                13676,
                13693
            ],
            [
                13710,
                13787
            ],
            [
                13853,
                13855
            ],
            [
                13855,
                13928
            ],
            [
                13928,
                14013
            ],
            [
                14062,
                14068
            ],
            [
                14047,
                14060
            ],
            [
                14071,
                14158
            ],
            [
                14197,
                14199
            ],
            [
                14289,
                14297
            ],
            [
                14334,
                14347
            ],
            [
                14322,
                14324
            ],
            [
                14357,
                14391
            ],
            [
                14391,
                14445
            ],
            [
                14452,
                14484
            ],
            [
                14494,
                14511
            ],
            [
                14511,
                14519
            ],
            [
                14608,
                14641
            ],
            [
                14643,
                14714
            ],
            [
                14715,
                14732
            ],
            [
                14802,
                14804
            ],
            [
                14826,
                14836
            ],
            [
                14849,
                14851
            ],
            [
                14851,
                14955
            ],
            [
                14955,
                15005
            ],
            [
                15042,
                15071
            ],
            [
                15143,
                15175
            ],
            [
                15175,
                15225
            ],
            [
                15231,
                15273
            ],
            [
                15273,
                15276
            ],
            [
                15341,
                15349
            ],
            [
                15365,
                15380
            ],
            [
                15393,
                15437
            ],
            [
                15499,
                15645
            ],
            [
                15645,
                15691
            ],
            [
                15691,
                15728
            ],
            [
                15811,
                15855
            ],
            [
                15868,
                15934
            ],
            [
                15934,
                16009
            ],
            [
                16009,
                16017
            ],
            [
                16056,
                16167
            ],
            [
                16169,
                16178
            ],
            [
                16199,
                16247
            ],
            [
                16247,
                16249
            ],
            [
                16272,
                16296
            ],
            [
                16301,
                16483
            ],
            [
                16520,
                16522
            ],
            [
                16522,
                16576
            ],
            [
                16577,
                16597
            ],
            [
                16598,
                16658
            ],
            [
                16661,
                16684
            ],
            [
                16688,
                16699
            ],
            [
                16699,
                16735
            ],
            [
                16735,
                16832
            ],
            [
                16836,
                16838
            ],
            [
                16870,
                16871
            ],
            [
                16875,
                16893
            ],
            [
                16905,
                16907
            ],
            [
                16907,
                16931
            ],
            [
                16933,
                16938
            ],
            [
                16942,
                16943
            ],
            [
                16971,
                17019
            ],
            [
                17019,
                17082
            ],
            [
                17082,
                17133
            ],
            [
                17133,
                17145
            ],
            [
                17155,
                17203
            ],
            [
                17220,
                17221
            ],
            [
                17207,
                17219
            ],
            [
                17206,
                17207
            ],
            [
                17221,
                17230
            ],
            [
                17232,
                17245
            ],
            [
                17247,
                17255
            ],
            [
                17230,
                17231
            ],
            [
                17260,
                17300
            ],
            [
                17300,
                17319
            ],
            [
                17319,
                17381
            ],
            [
                17385,
                17401
            ],
            [
                17404,
                17419
            ],
            [
                17480,
                17481
            ],
            [
                17465,
                17479
            ],
            [
                17464,
                17465
            ],
            [
                17481,
                17490
            ],
            [
                17492,
                17585
            ],
            [
                17587,
                17592
            ],
            [
                17595,
                17679
            ],
            [
                17682,
                17689
            ],
            [
                17700,
                17713
            ],
            [
                17913,
                17943
            ],
            [
                17945,
                17956
            ],
            [
                17959,
                18014
            ],
            [
                18027,
                18031
            ],
            [
                18049,
                18100
            ],
            [
                18111,
                18114
            ],
            [
                18117,
                18120
            ],
            [
                18136,
                18141
            ],
            [
                18143,
                18146
            ],
            [
                18218,
                18243
            ],
            [
                18245,
                18271
            ],
            [
                18291,
                18314
            ],
            [
                18323,
                18346
            ],
            [
                18363,
                18381
            ],
            [
                18409,
                18414
            ],
            [
                18346,
                18347
            ],
            [
                18390,
                18408
            ],
            [
                18422,
                18434
            ],
            [
                18381,
                18382
            ],
            [
                18490,
                18494
            ],
            [
                18441,
                18466
            ],
            [
                18530,
                18532
            ],
            [
                18532,
                18603
            ],
            [
                18623,
                18625
            ],
            [
                18625,
                18653
            ],
            [
                18659,
                18672
            ],
            [
                18734,
                18771
            ],
            [
                18774,
                18798
            ],
            [
                18824,
                18876
            ],
            [
                18909,
                18911
            ],
            [
                18911,
                18964
            ],
            [
                18978,
                18983
            ],
            [
                18989,
                18998
            ],
            [
                18999,
                19016
            ],
            [
                19016,
                19057
            ],
            [
                19095,
                19109
            ],
            [
                19171,
                19172
            ],
            [
                19177,
                19215
            ],
            [
                19232,
                19234
            ],
            [
                19234,
                19299
            ],
            [
                19299,
                19338
            ],
            [
                19373,
                19394
            ],
            [
                19404,
                19415
            ],
            [
                19420,
                19428
            ],
            [
                19442,
                19457
            ],
            [
                19464,
                19543
            ],
            [
                19545,
                19585
            ],
            [
                19586,
                19599
            ],
            [
                19602,
                19610
            ],
            [
                19633,
                19635
            ],
            [
                19636,
                19640
            ],
            [
                19640,
                19654
            ],
            [
                19667,
                19687
            ],
            [
                19690,
                19724
            ],
            [
                19724,
                19741
            ],
            [
                19754,
                19780
            ],
            [
                19782,
                19825
            ],
            [
                19857,
                19859
            ],
            [
                19868,
                19870
            ],
            [
                19880,
                19886
            ],
            [
                19875,
                19877
            ],
            [
                19888,
                19898
            ],
            [
                19927,
                19929
            ],
            [
                19929,
                19946
            ],
            [
                19988,
                20100
            ],
            [
                20203,
                20274
            ],
            [
                20277,
                20303
            ],
            [
                20312,
                20319
            ],
            [
                20322,
                20426
            ],
            [
                20436,
                20437
            ],
            [
                20531,
                20556
            ],
            [
                20586,
                20588
            ],
            [
                20588,
                20646
            ]
        ],
        "row_chars": [
            [
                0,
                101
            ],
            [
                101,
                126
            ],
            [
                126,
                488
            ],
            [
                488,
                555
            ],
            [
                555,
                629
            ],
            [
                629,
                636
            ],
            [
                636,
                759
            ],
            [
                759,
                832
            ],
            [
                832,
                914
            ],
            [
                914,
                937
            ],
            [
                937,
                974
            ],
            [
                974,
                1045
            ],
            [
                1045,
                1093
            ],
            [
                1093,
                1105
            ],
            [
                1105,
                1257
            ],
            [
                1257,
                1335
            ],
            [
                1335,
                1339
            ],
            [
                1339,
                1410
            ],
            [
                1410,
                1519
            ],
            [
                1519,
                1684
            ],
            [
                1684,
                1721
            ],
            [
                1721,
                1783
            ],
            [
                1783,
                2094
            ],
            [
                2094,
                2223
            ],
            [
                2223,
                2238
            ],
            [
                2238,
                2280
            ],
            [
                2280,
                2432
            ],
            [
                2432,
                2482
            ],
            [
                2482,
                2652
            ],
            [
                2652,
                2784
            ],
            [
                2784,
                2991
            ],
            [
                2991,
                3129
            ],
            [
                3129,
                3554
            ],
            [
                3554,
                3683
            ],
            [
                3683,
                3731
            ],
            [
                3731,
                4275
            ],
            [
                4275,
                4338
            ],
            [
                4338,
                4423
            ],
            [
                4423,
                4677
            ],
            [
                4677,
                4741
            ],
            [
                4741,
                4957
            ],
            [
                4957,
                5201
            ],
            [
                5201,
                5320
            ],
            [
                5320,
                5412
            ],
            [
                5412,
                5456
            ],
            [
                5456,
                5552
            ],
            [
                5552,
                5609
            ],
            [
                5609,
                5861
            ],
            [
                5861,
                5945
            ],
            [
                5945,
                6121
            ],
            [
                6121,
                6136
            ],
            [
                6136,
                6264
            ],
            [
                6264,
                6461
            ],
            [
                6461,
                6481
            ],
            [
                6481,
                6517
            ],
            [
                6517,
                6578
            ],
            [
                6578,
                6616
            ],
            [
                6616,
                6654
            ],
            [
                6654,
                6811
            ],
            [
                6811,
                6993
            ],
            [
                6993,
                7166
            ],
            [
                7166,
                7297
            ],
            [
                7297,
                7326
            ],
            [
                7326,
                7753
            ],
            [
                7753,
                7858
            ],
            [
                7858,
                7933
            ],
            [
                7933,
                8048
            ],
            [
                8048,
                8303
            ],
            [
                8303,
                8458
            ],
            [
                8458,
                8549
            ],
            [
                8549,
                8580
            ],
            [
                8580,
                8648
            ],
            [
                8648,
                8672
            ],
            [
                8672,
                8754
            ],
            [
                8754,
                8775
            ],
            [
                8775,
                8783
            ],
            [
                8783,
                8871
            ],
            [
                8871,
                8925
            ],
            [
                8925,
                8981
            ],
            [
                8981,
                9096
            ],
            [
                9096,
                9126
            ],
            [
                9126,
                9138
            ],
            [
                9138,
                9234
            ],
            [
                9234,
                9296
            ],
            [
                9296,
                9535
            ],
            [
                9535,
                9661
            ],
            [
                9661,
                9792
            ],
            [
                9792,
                9931
            ],
            [
                9931,
                10017
            ],
            [
                10017,
                10253
            ],
            [
                10253,
                10283
            ],
            [
                10283,
                10384
            ],
            [
                10384,
                10589
            ],
            [
                10589,
                10669
            ],
            [
                10669,
                10879
            ],
            [
                10879,
                11681
            ],
            [
                11681,
                11770
            ],
            [
                11770,
                11922
            ],
            [
                11922,
                11955
            ],
            [
                11955,
                12027
            ],
            [
                12027,
                12204
            ],
            [
                12204,
                12315
            ],
            [
                12315,
                12462
            ],
            [
                12462,
                12570
            ],
            [
                12570,
                12868
            ],
            [
                12868,
                13119
            ],
            [
                13119,
                13336
            ],
            [
                13336,
                13538
            ],
            [
                13538,
                13600
            ],
            [
                13600,
                13855
            ],
            [
                13855,
                13928
            ],
            [
                13928,
                14013
            ],
            [
                14013,
                14199
            ],
            [
                14199,
                14286
            ],
            [
                14286,
                14391
            ],
            [
                14391,
                14519
            ],
            [
                14519,
                14595
            ],
            [
                14595,
                14715
            ],
            [
                14715,
                14851
            ],
            [
                14851,
                14955
            ],
            [
                14955,
                15175
            ],
            [
                15175,
                15273
            ],
            [
                15273,
                15437
            ],
            [
                15437,
                15499
            ],
            [
                15499,
                15645
            ],
            [
                15645,
                15691
            ],
            [
                15691,
                15934
            ],
            [
                15934,
                16009
            ],
            [
                16009,
                16247
            ],
            [
                16247,
                16522
            ],
            [
                16522,
                16597
            ],
            [
                16597,
                16687
            ],
            [
                16687,
                16699
            ],
            [
                16699,
                16735
            ],
            [
                16735,
                16907
            ],
            [
                16907,
                16941
            ],
            [
                16941,
                17019
            ],
            [
                17019,
                17082
            ],
            [
                17082,
                17133
            ],
            [
                17133,
                17206
            ],
            [
                17206,
                17259
            ],
            [
                17259,
                17300
            ],
            [
                17300,
                17319
            ],
            [
                17319,
                17384
            ],
            [
                17384,
                17404
            ],
            [
                17404,
                17420
            ],
            [
                17420,
                17464
            ],
            [
                17464,
                17713
            ],
            [
                17713,
                17913
            ],
            [
                17913,
                18218
            ],
            [
                18218,
                18532
            ],
            [
                18532,
                18625
            ],
            [
                18625,
                18653
            ],
            [
                18653,
                18675
            ],
            [
                18675,
                18733
            ],
            [
                18733,
                18774
            ],
            [
                18774,
                18911
            ],
            [
                18911,
                18998
            ],
            [
                18998,
                19016
            ],
            [
                19016,
                19060
            ],
            [
                19060,
                19094
            ],
            [
                19094,
                19234
            ],
            [
                19234,
                19299
            ],
            [
                19299,
                19373
            ],
            [
                19373,
                19585
            ],
            [
                19585,
                19602
            ],
            [
                19602,
                19635
            ],
            [
                19635,
                19640
            ],
            [
                19640,
                19724
            ],
            [
                19724,
                19781
            ],
            [
                19781,
                19827
            ],
            [
                19827,
                19856
            ],
            [
                19856,
                19870
            ],
            [
                19870,
                19929
            ],
            [
                19929,
                20102
            ],
            [
                20102,
                20180
            ],
            [
                20180,
                20195
            ],
            [
                20195,
                20322
            ],
            [
                20322,
                20588
            ],
            [
                20588,
                20646
            ]
        ]
    },
    "abridged": {
        "text": "Margaret went home so painfully occupied with what she had heard that she could hardly keep up a flow of cheerful conversation for her mother, who, now that she was unable to go out, always looked to Margaret to bring some news.\n'And can your factory friend come on Thursday to see you dressed?'\n'She was so ill I never thought of asking her,' said Margaret, dolefully.\n'Dear! Everybody is ill now, I think,' said Mrs. Hale, with a little of the jealousy which one invalid is apt to feel of another. 'But it must be very sad to be ill in one of those little back streets.' (Her kindly nature prevailing.) 'Mr. Thornton has sent me some old port wine. Would a bottle of that do her good, think you?'\n'No, mamma. I don't believe they are very poor; and Bessy's illness is consumption - she won't want wine. Perhaps I might take her a little fruit preserve. No! there's another family to whom I should like to give - Oh mamma! how am I to dress up in my finery, and go to smart parties, after the sorrow I have seen today?' exclaimed Margaret, bursting the bounds she had set for herself, and telling her mother about John Boucher.\nIt distressed Mrs. Hale excessively. She told Margaret to pack up a basket, to be sent there and then to the family; and was almost angry with her for saying that it would wait till morning, as she knew Higgins had provided for their immediate wants, and she herself had left money with Bessy. Mrs. Hale called her unfeeling, and ordered the basket to be sent out of the house. Then she said:\n'After all, we may have been doing wrong. Mr. Thornton said, those were no true friends who helped to prolong the struggle by assisting the turn-outs. And this Boucher-man was a turn-out, was he not?'\nShe asked this of Mr. Hale when he came upstairs, after giving a lesson to Mr. Thornton. Mr. Hale listened, and tried to judge calmly; he recalled all that had seemed so clear not half-an-hour before, as it came out of Mr. Thornton's lips; and then he made an unsatisfactory compromise. He did not see how his wife and daughter could have done otherwise. Nevertheless, it was very true what Mr. Thornton said; that the strike, if prolonged, must end in the masters' bringing hands from a distance, so the kindest thing was to refuse all help which might bolster them up in their folly. But, as to this Boucher, he would go and see him first thing in the morning, and try and find out what could be done for him.\nMr. Hale went the next morning. He did not find Boucher at home, but he had a long talk with his wife; promised to ask for an Infirmary order for her; and, seeing the plenty provided by Mrs. Hale, and somewhat lavishly used by the children, who were masters in their father's absence, he came back with a more cheerful account than Margaret had hoped for.\n'But I will go again, and see the man himself,' said Mr. Hale. 'I hardly know how to compare these houses with our Helstone cottages. I see furniture here which our labourers would never have thought of buying, and food which they would consider luxuries; yet for these very families there seems no other resource, now that their wages are stopped, but the pawn-shop. One needs to measure by a different standard, up here in Milton.'\nBessy, too, was rather better this day; although still so weak that she seemed to have entirely forgotten her wish to see Margaret dressed up.\nMargaret could not help comparing this strange dressing of hers - her heart heavy with anxieties - with the old, merry preparations that she and Edith had performed scarcely more than a year ago. Her only pleasure now in decking herself out was in thinking that her mother would take delight in seeing her dressed. She blushed when Dixon admired her.\n'Miss Hale looks well, ma'am, doesn't she? Mrs. Shaw's coral gives the right touch of colour. Otherwise, Miss Margaret, you would have been too pale.'\nMargaret's black hair was too thick to be plaited; it needed rather to be twisted round into massive silky coils, that encircled her head like a crown, and then were gathered into a spiral knot behind. She kept its weight together by two large coral pins. On her neck, just below her curved white throat, there lay heavy coral beads.\n'Oh, Margaret! how I should like to be going with you to one of the old Barrington assemblies.'\nMargaret kissed her mother, but said, 'I would rather stay at home with you, mamma.'\n'Nonsense, darling! Be sure you take note of the dinner. I shall like to hear how they manage these things in Milton.'\nMrs. Hale would have been astonished if she had seen the sumptuousness of the dinner-table. Margaret felt the number of delicacies to be oppressive; half would have been enough, and the effect more elegant. But it was one of Mrs. Thornton's rigorous laws of hospitality that enough should be provided of each separate dainty for all the guests to partake, if they wished. Abstemious herself, it was part of her pride to set a feast before her guests.\nHer son shared this feeling. He had never known any kind of society but that which depended on an exchange of superb meals; and even though he was denying himself any unnecessary personal expense, and had regretted that the invitations for this dinner had been sent out, still he was glad to see the old magnificence.\nMr. Hale was anxiously punctual, and Margaret and her father were the first to arrive. There was no one in the drawing-room but Mrs. Thornton and Fanny. The covers were taken off, and the apartment blazed forth in yellow silk damask and a brilliantly-flowered carpet. Every corner seemed filled up with ornament, until it wearied the eye, and presented a strange contrast to the bald ugliness of the view into the great mill-yard, where the gates were thrown open to admit carriages. The mill loomed high on the left, casting a long shadow which darkened the summer evening.\n'My son will be here directly, Mr. Hale. May I beg you to take a seat?'\nMr. Hale was standing at one of the windows as Mrs. Thornton spoke. He turned away, saying,\n'Don't you find such close neighbourhood to the mill rather unpleasant at times?'\nShe drew herself up. 'Never. I am not become so fine as to desire to forget the source of my son's wealth and power. Besides, there is not another such factory in Milton. One room alone is two hundred and twenty square yards.'\n'I meant that the smoke and the noise - the constant going in and out of people, might be annoying.'\n'I agree with you, Mr. Hale!' said Fanny. 'There is a continual smell of steam and oil - and the noise is perfectly deafening.'\n'I have heard noise that was called music far more deafening. The engine-room is at the other end of the factory; we hardly hear it, except when all the windows are open. As for the work-people, they disturb me no more than the humming of a hive of bees. Just now, there are no sounds from the mill; the hands have been ungrateful enough to turn out, as perhaps you have heard. But my son is going to make them learn their place.' The expression on her face, always stern, deepened into dark anger as she said this. Nor did it clear when Mr. Thornton entered the room; for she saw, in an instant, the weight of care which he could not shake off, although his guests received a cheerful greeting.\nHe shook hands with Margaret. He knew it was the first time their hands had met, though she was perfectly unconscious of the fact. He inquired after Mrs. Hale, and heard Mr. Hale's hopeful account; and glancing at Margaret, he saw that no dissenting shadow crossed her face.\nAs he looked, he was struck anew with her great beauty. He had never seen her in such dress before; her elegant attire befitted her noble figure and serene face. She was talking to Fanny; about what, he could not hear. He saw his sister's restless way of constantly re-arranging her gown, her eyes wandering without any purpose; and he contrasted them uneasily with the large soft eyes that looked steadily at one object; the curving red lips, just parted in listening - the head a little bent forwards, so as to make a long sweeping line from the glossy raven hair to the smooth ivory tip of the shoulder; the round white arms, and hands laid lightly across each other. Mr. Thornton sighed as he took in all this with a sudden comprehensive glance. And then he turned his back on the young ladies, and threw himself, with an effort, into a conversation with Mr. Hale.\nMore people came. Fanny left Margaret's side, and helped her mother to receive her guests. Mr. Thornton felt that no one was speaking to Margaret, and was restless; but he did not look at her. Only, he knew what she was doing better than he knew the movements of anyone else in the room.\nMargaret was so unconscious of herself, and so much amused by watching other people, that she never thought whether she was left unnoticed. Somebody took her down to dinner; she did not catch the name; nor did he seem much inclined to talk to her. There was a very animated conversation going on among the gentlemen; Margaret grew interested and listened attentively. Mr. Horsfall, a stranger to the town, was asking about Milton's trade and manufactures; and the rest of the gentlemen were giving him answers and explanations. Some dispute arose, and was referred to Mr. Thornton, who had hardly spoken; but who now gave an opinion so clearly that the opponents yielded.\nHis whole manner as master of the house, and entertainer of his friends, was so straightforward, yet simple and modest, as to be thoroughly dignified. Margaret thought she had never seen him to so much advantage. When he had come to their house, there had been always some over-eagerness or vexed annoyance which seemed ready to pre-suppose that he was unjustly judged. But now, among his fellows, there was no uncertainty as to his position. He was regarded by them as a man of great force of character; of power in many ways. He had their respect, and he knew it; and the security of this gave a fine grand quietness to his voice and manner.\nMargaret was surprised at how much she enjoyed this dinner. She knew enough now to understand many local interests - even some of the technical words used by the eager mill-owners. They talked in desperate earnest, not in the used-up style that wearied her so in the old London parties.\nShe wondered that no one mentioned the strike. She did not yet know how coolly such things were taken by the masters, as having only one possible end. To be sure, the men were cutting their own throats; but if they would be fools, they must take the consequence. One or two thought Thornton looked out of spirits; of course, he must lose by this turn-out. But Thornton could manage a strike, for he was as iron a chap as any in Milton. And they chuckled inwardly at the idea of the workmen's discomfiture and defeat, in their attempt to alter one iota of what Thornton had decreed.\nIt was rather dull for Margaret after dinner. She was glad when the gentlemen came, because she could listen to something larger than the petty interests which the ladies had been talking about. She liked the exultation in the sense of power which these Milton men had. It might savour of boasting; but still they seemed to defy the old limits of possibility, in a kind of fine intoxication caused by what had been achieved, and what yet should be. If she might not approve of their spirit in all things, still there was much to admire in their forgetfulness of themselves and the present, in their anticipated triumphs over all inanimate matter at some future time. She was rather startled when Mr. Thornton spoke to her, close at her elbow:\n'I could see you were on our side in our discussion at dinner - were you not, Miss Hale?'\n'Certainly. But then I know so little about it. I was surprised, however, to find from what Mr. Horsfall said, that there were others who thought so differently, like the Mr. Morison he mentioned. He cannot be a gentleman - is he?'\n'I cannot decide on another's gentlemanliness, Miss Hale. I mean, I don't quite understand your application of the word. But I should say that this Morison is no true man. I don't know him; I merely judge him from Mr. Horsfall's account.'\n'I suspect my \"gentleman\" includes your \"true man.\"'\n'And a great deal more, you would imply. I differ from you. A man is to me a higher and a completer being than a gentleman.'\n'What do you mean?' asked Margaret.\n'I take it that \"gentleman\" is a term that only describes a person in his relation to others; but when we speak of him as \"a man,\" we consider him not merely with regard to his fellow-men, but in relation to himself - to life - to eternity. I am rather weary of this word \"gentlemanly,\" which seems to me to be often inappropriately used, and with much distortion of meaning, while the full simplicity of \"man\" and \"manly\" are unacknowledged.'\nMargaret thought a moment - but before she could speak, he was called away by the eager manufacturers. Although she could not hear their questions, she could guess at them by the short, firm answers Mr. Thornton gave. They were evidently talking of the turn-out, and suggesting what course to take. She heard Mr. Thornton say:\n'That has been done. All those arrangements have been made.'\nSome doubts were implied by Mr. Slickson, who took hold of Mr. Thornton's arm. Mr. Thornton moved slightly away, lifted his eyebrows, and replied:\n'I take the risk. You need not join in it unless you choose. I'm not afraid; I can protect myself from any violence. And I will assuredly protect all others who come to me for work. They know my determination by this time.'\nMr. Horsfall took him on one side. Margaret assumed it was to ask him some question about the strike; but, in truth, it was to inquire who she herself was - so quiet, so stately, and so beautiful.\n'A Milton lady?' asked he.\n'No! from the south - Hampshire, I believe,' was the cold, indifferent answer.\nMrs. Slickson was questioning Fanny on the same subject. 'Who is that fine distinguished-looking girl?'\n'Oh! Mr. Hale there is her father. He gives lessons; my brother John goes to him twice a week, and so he begged mamma to ask them here, in hopes of getting him known.'\n'Does Mr. Thornton really find time to read with a tutor, in the midst of all his business - and this abominable strike as well?'\nFanny was not sure, from Mrs. Slickson's manner, whether she ought to be proud or ashamed of her brother; she was inclined to blush. Her shame was interrupted by the dispersion of the guests.",
        "paragraph_chars": [
            [
                0,
                229
            ],
            [
                229,
                296
            ],
            [
                296,
                370
            ],
            [
                370,
                699
            ],
            [
                699,
                1129
            ],
            [
                1129,
                1522
            ],
            [
                1522,
                1723
            ],
            [
                1723,
                2435
            ],
            [
                2435,
                2791
            ],
            [
                2791,
                3225
            ],
            [
                3225,
                3368
            ],
            [
                3368,
                3719
            ],
            [
                3719,
                3870
            ],
            [
                3870,
                4204
            ],
            [
                4204,
                4300
            ],
            [
                4300,
                4385
            ],
            [
                4385,
                4504
            ],
            [
                4504,
                4955
            ],
            [
                4955,
                5273
            ],
            [
                5273,
                5848
            ],
            [
                5848,
                5920
            ],
            [
                5920,
                6012
            ],
            [
                6012,
                6094
            ],
            [
                6094,
                6321
            ],
            [
                6321,
                6422
            ],
            [
                6422,
                6550
            ],
            [
                6550,
                7246
            ],
            [
                7246,
                7521
            ],
            [
                7521,
                8390
            ],
            [
                8390,
                8678
            ],
            [
                8678,
                9350
            ],
            [
                9350,
                9994
            ],
            [
                9994,
                10281
            ],
            [
                10281,
                10863
            ],
            [
                10863,
                11606
            ],
            [
                11606,
                11696
            ],
            [
                11696,
                11928
            ],
            [
                11928,
                12167
            ],
            [
                12167,
                12220
            ],
            [
                12220,
                12345
            ],
            [
                12345,
                12381
            ],
            [
                12381,
                12825
            ],
            [
                12825,
                13152
            ],
            [
                13152,
                13213
            ],
            [
                13213,
                13360
            ],
            [
                13360,
                13584
            ],
            [
                13584,
                13781
            ],
            [
                13781,
                13808
            ],
            [
                13808,
                13887
            ],
            [
                13887,
                13991
            ],
            [
                13991,
                14159
            ],
            [
                14159,
                14289
            ],
            [
                14289,
                14480
            ]
        ],
        "segment_chars": [
            [
                0,
                229
            ],
            [
                229,
                296
            ],
            [
                296,
                370
            ],
            [
                370,
                377
            ],
            [
                377,
                500
            ],
            [
                500,
                573
            ],
            [
                573,
                605
            ],
            [
                605,
                610
            ],
            [
                610,
                651
            ],
            [
                651,
                699
            ],
            [
                699,
                711
            ],
            [
                711,
                805
            ],
            [
                805,
                855
            ],
            [
                855,
                859
            ],
            [
                859,
                924
            ],
            [
                924,
                1021
            ],
            [
                1021,
                1129
            ],
            [
                1129,
                1166
            ],
            [
                1166,
                1423
            ],
            [
                1423,
                1507
            ],
            [
                1507,
                1522
            ],
            [
                1522,
                1564
            ],
            [
                1564,
                1673
            ],
            [
                1673,
                1723
            ],
            [
                1723,
                1812
            ],
            [
                1812,
                2010
            ],
            [
                2010,
                2078
            ],
            [
                2078,
                2309
            ],
            [
                2309,
                2435
            ],
            [
                2435,
                2467
            ],
            [
                2467,
                2791
            ],
            [
                2791,
                2854
            ],
            [
                2854,
                2925
            ],
            [
                2925,
                3159
            ],
            [
                3159,
                3225
            ],
            [
                3225,
                3368
            ],
            [
                3368,
                3564
            ],
            [
                3564,
                3683
            ],
            [
                3683,
                3719
            ],
            [
                3719,
                3762
            ],
            [
                3762,
                3813
            ],
            [
                3813,
                3870
            ],
            [
                3870,
                4072
            ],
            [
                4072,
                4126
            ],
            [
                4126,
                4204
            ],
            [
                4204,
                4219
            ],
            [
                4219,
                4300
            ],
            [
                4300,
                4385
            ],
            [
                4385,
                4405
            ],
            [
                4405,
                4442
            ],
            [
                4442,
                4504
            ],
            [
                4504,
                4596
            ],
            [
                4596,
                4711
            ],
            [
                4711,
                4876
            ],
            [
                4876,
                4955
            ],
            [
                4955,
                4984
            ],
            [
                4984,
                5273
            ],
            [
                5273,
                5360
            ],
            [
                5360,
                5426
            ],
            [
                5426,
                5541
            ],
            [
                5541,
                5757
            ],
            [
                5757,
                5848
            ],
            [
                5848,
                5889
            ],
            [
                5889,
                5920
            ],
            [
                5920,
                5988
            ],
            [
                5988,
                6012
            ],
            [
                6012,
                6094
            ],
            [
                6094,
                6115
            ],
            [
                6115,
                6123
            ],
            [
                6123,
                6211
            ],
            [
                6211,
                6265
            ],
            [
                6265,
                6321
            ],
            [
                6321,
                6422
            ],
            [
                6422,
                6452
            ],
            [
                6452,
                6464
            ],
            [
                6464,
                6550
            ],
            [
                6550,
                6612
            ],
            [
                6612,
                6721
            ],
            [
                6721,
                6805
            ],
            [
                6805,
                6928
            ],
            [
                6928,
                6981
            ],
            [
                6981,
                7066
            ],
            [
                7066,
                7246
            ],
            [
                7246,
                7276
            ],
            [
                7276,
                7377
            ],
            [
                7377,
                7521
            ],
            [
                7521,
                7577
            ],
            [
                7577,
                7683
            ],
            [
                7683,
                7740
            ],
            [
                7740,
                8192
            ],
            [
                8192,
                8271
            ],
            [
                8271,
                8390
            ],
            [
                8390,
                8408
            ],
            [
                8408,
                8481
            ],
            [
                8481,
                8583
            ],
            [
                8583,
                8678
            ],
            [
                8678,
                8818
            ],
            [
                8818,
                8926
            ],
            [
                8926,
                9046
            ],
            [
                9046,
                9206
            ],
            [
                9206,
                9350
            ],
            [
                9350,
                9501
            ],
            [
                9501,
                9563
            ],
            [
                9563,
                9720
            ],
            [
                9720,
                9793
            ],
            [
                9793,
                9878
            ],
            [
                9878,
                9994
            ],
            [
                9994,
                10054
            ],
            [
                10054,
                10175
            ],
            [
                10175,
                10281
            ],
            [
                10281,
                10328
            ],
            [
                10328,
                10432
            ],
            [
                10432,
                10544
            ],
            [
                10544,
                10637
            ],
            [
                10637,
                10717
            ],
            [
                10717,
                10863
            ],
            [
                10863,
                10909
            ],
            [
                10909,
                11058
            ],
            [
                11058,
                11133
            ],
            [
                11133,
                11312
            ],
            [
                11312,
                11530
            ],
            [
                11530,
                11606
            ],
            [
                11606,
                11696
            ],
            [
                11696,
                11708
            ],
            [
                11708,
                11744
            ],
            [
                11744,
                11893
            ],
            [
                11893,
                11928
            ],
            [
                11928,
                11986
            ],
            [
                11986,
                12049
            ],
            [
                12049,
                12100
            ],
            [
                12100,
                12167
            ],
            [
                12167,
                12220
            ],
            [
                12220,
                12261
            ],
            [
                12261,
                12280
            ],
            [
                12280,
                12345
            ],
            [
                12345,
                12365
            ],
            [
                12365,
                12381
            ],
            [
                12381,
                12622
            ],
            [
                12622,
                12825
            ],
            [
                12825,
                12928
            ],
            [
                12928,
                13043
            ],
            [
                13043,
                13124
            ],
            [
                13124,
                13152
            ],
            [
                13152,
                13173
            ],
            [
                13173,
                13213
            ],
            [
                13213,
                13292
            ],
            [
                13292,
                13360
            ],
            [
                13360,
                13378
            ],
            [
                13378,
                13421
            ],
            [
                13421,
                13477
            ],
            [
                13477,
                13542
            ],
            [
                13542,
                13584
            ],
            [
                13584,
                13619
            ],
            [
                13619,
                13781
            ],
            [
                13781,
                13798
            ],
            [
                13798,
                13808
            ],
            [
                13808,
                13813
            ],
            [
                13813,
                13887
            ],
            [
                13887,
                13944
            ],
            [
                13944,
                13991
            ],
            [
                13991,
                13996
            ],
            [
                13996,
                14026
            ],
            [
                14026,
                14159
            ],
            [
                14159,
                14289
            ],
            [
                14289,
                14422
            ],
            [
                14422,
                14480
            ]
        ],
        "overlap_chars": [
            [
                0,
                64
            ],
            [
                65,
                73
            ],
            [
                80,
                86
            ],
            [
                92,
                96
            ],
            [
                97,
                208
            ],
            [
                209,
                211
            ],
            [
                218,
                229
            ],
            [
                230,
                293
            ],
            [
                301,
                341
            ],
            [
                344,
                370
            ],
            [
                372,
                377
            ],
            [
                377,
                406
            ],
            [
                409,
                500
            ],
            [
                501,
                570
            ],
            [
                573,
                602
            ],
            [
                602,
                605
            ],
            [
                608,
                609
            ],
            [
                610,
                635
            ],
            [
                636,
                649
            ],
            [
                649,
                651
            ],
            [
                651,
                696
            ],
            [
                700,
                709
            ],
            [
                711,
                745
            ],
            [
                745,
                750
            ],
            [
                751,
                781
            ],
            [
                784,
                805
            ],
            [
                805,
                812
            ],
            [
                813,
                838
            ],
            [
                839,
                844
            ],
            [
                845,
                853
            ],
            [
                853,
                855
            ],
            [
                855,
                859
            ],
            [
                859,
                911
            ],
            [
                914,
                916
            ],
            [
                917,
                924
            ],
            [
                924,
                965
            ],
            [
                966,
                1002
            ],
            [
                1008,
                1012
            ],
            [
                1021,
                1068
            ],
            [
                1073,
                1084
            ],
            [
                1084,
                1108
            ],
            [
                1127,
                1129
            ],
            [
                1129,
                1166
            ],
            [
                1166,
                1169
            ],
            [
                1175,
                1203
            ],
            [
                1203,
                1286
            ],
            [
                1287,
                1300
            ],
            [
                1306,
                1423
            ],
            [
                1423,
                1453
            ],
            [
                1455,
                1458
            ],
            [
                1467,
                1477
            ],
            [
                1484,
                1507
            ],
            [
                1507,
                1522
            ],
            [
                1523,
                1564
            ],
            [
                1566,
                1576
            ],
            [
                1577,
                1673
            ],
            [
                1673,
                1720
            ],
            [
                1741,
                1749
            ],
            [
                1750,
                1772
            ],
            [
                1779,
                1810
            ],
            [
                1810,
                1812
            ],
            [
                1812,
                1843
            ],
            [
                1844,
                1849
            ],
            [
                1856,
                2010
            ],
            [
                2010,
                2024
            ],
            [
                2025,
                2028
            ],
            [
                2029,
                2050
            ],
            [
                2051,
                2078
            ],
            [
                2078,
                2090
            ],
            [
                2090,
                2131
            ],
            [
                2133,
                2137
            ],
            [
                2138,
                2187
            ],
            [
                2189,
                2219
            ],
            [
                2219,
                2220
            ],
            [
                2224,
                2309
            ],
            [
                2309,
                2312
            ],
            [
                2314,
                2357
            ],
            [
                2358,
                2435
            ],
            [
                2435,
                2465
            ],
            [
                2465,
                2467
            ],
            [
                2467,
                2580
            ],
            [
                2581,
                2584
            ],
            [
                2584,
                2692
            ],
            [
                2693,
                2744
            ],
            [
                2745,
                2779
            ],
            [
                2786,
                2789
            ],
            [
                2789,
                2791
            ],
            [
                2792,
                2836
            ],
            [
                2839,
                2854
            ],
            [
                2855,
                2868
            ],
            [
                2869,
                2883
            ],
            [
                2884,
                2925
            ],
            [
                2925,
                3010
            ],
            [
                3011,
                3104
            ],
            [
                3106,
                3120
            ],
            [
                3121,
                3159
            ],
            [
                3159,
                3162
            ],
            [
                3169,
                3171
            ],
            [
                3183,
                3222
            ],
            [
                3225,
                3263
            ],
            [
                3274,
                3279
            ],
            [
                3280,
                3363
            ],
            [
                3366,
                3368
            ],
            [
                3368,
                3431
            ],
            [
                3434,
                3454
            ],
            [
                3455,
                3464
            ],
            [
                3467,
                3486
            ],
            [
                3500,
                3564
            ],
            [
                3564,
                3683
            ],
            [
                3683,
                3705
            ],
            [
                3717,
                3719
            ],
            [
                3725,
                3748
            ],
            [
                3749,
                3762
            ],
            [
                3762,
                3779
            ],
            [
                3780,
                3811
            ],
            [
                3811,
                3813
            ],
            [
                3813,
                3867
            ],
            [
                3870,
                3957
            ],
            [
                3958,
                3970
            ],
            [
                3977,
                4051
            ],
            [
                4052,
                4072
            ],
            [
                4072,
                4124
            ],
            [
                4124,
                4126
            ],
            [
                4126,
                4149
            ],
            [
                4150,
                4160
            ],
            [
                4161,
                4204
            ],
            [
                4205,
                4219
            ],
            [
                4219,
                4297
            ],
            [
                4300,
                4326
            ],
            [
                4326,
                4327
            ],
            [
                4328,
                4331
            ],
            [
                4336,
                4337
            ],
            [
                4339,
                4376
            ],
            [
                4377,
                4382
            ],
            [
                4386,
                4405
            ],
            [
                4405,
                4416
            ],
            [
                4430,
                4440
            ],
            [
                4440,
                4442
            ],
            [
                4442,
                4501
            ],
            [
                4504,
                4529
            ],
            [
                4530,
                4540
            ],
            [
                4541,
                4594
            ],
            [
                4594,
                4596
            ],
            [
                4596,
                4604
            ],
            [
                4605,
                4652
            ],
            [
                4653,
                4657
            ],
            [
                4658,
                4696
            ],
            [
                4697,
                4711
            ],
            [
                4711,
                4773
            ],
            [
                4774,
                4778
            ],
            [
                4779,
                4804
            ],
            [
                4805,
                4828
            ],
            [
                4829,
                4867
            ],
            [
                4874,
                4876
            ],
            [
                4876,
                4886
            ],
            [
                4894,
                4942
            ],
            [
                4943,
                4953
            ],
            [
                4953,
                4954
            ],
            [
                4955,
                4984
            ],
            [
                4984,
                5002
            ],
            [
                5003,
                5077
            ],
            [
                5079,
                5087
            ],
            [
                5088,
                5117
            ],
            [
                5122,
                5133
            ],
            [
                5134,
                5142
            ],
            [
                5150,
                5159
            ],
            [
                5160,
                5231
            ],
            [
                5232,
                5271
            ],
            [
                5271,
                5273
            ],
            [
                5275,
                5304
            ],
            [
                5310,
                5359
            ],
            [
                5360,
                5376
            ],
            [
                5377,
                5426
            ],
            [
                5442,
                5523
            ],
            [
                5533,
                5541
            ],
            [
                5541,
                5594
            ],
            [
                5595,
                5599
            ],
            [
                5603,
                5672
            ],
            [
                5678,
                5709
            ],
            [
                5710,
                5713
            ],
            [
                5714,
                5736
            ],
            [
                5737,
                5739
            ],
            [
                5746,
                5757
            ],
            [
                5757,
                5789
            ],
            [
                5789,
                5800
            ],
            [
                5806,
                5812
            ],
            [
                5813,
                5846
            ],
            [
                5846,
                5848
            ],
            [
                5852,
                5855
            ],
            [
                5856,
                5889
            ],
            [
                5889,
                5917
            ],
            [
                5920,
                5988
            ],
            [
                5988,
                6012
            ],
            [
                6016,
                6091
            ],
            [
                6094,
                6113
            ],
            [
                6116,
                6123
            ],
            [
                6123,
                6211
            ],
            [
                6211,
                6232
            ],
            [
                6233,
                6240
            ],
            [
                6241,
                6245
            ],
            [
                6246,
                6265
            ],
            [
                6265,
                6318
            ],
            [
                6322,
                6358
            ],
            [
                6361,
                6379
            ],
            [
                6380,
                6382
            ],
            [
                6383,
                6386
            ],
            [
                6387,
                6390
            ],
            [
                6391,
                6393
            ],
            [
                6394,
                6419
            ],
            [
                6423,
                6449
            ],
            [
                6452,
                6464
            ],
            [
                6471,
                6504
            ],
            [
                6511,
                6547
            ],
            [
                6551,
                6612
            ],
            [
                6612,
                6637
            ],
            [
                6644,
                6689
            ],
            [
                6690,
                6719
            ],
            [
                6721,
                6731
            ],
            [
                6732,
                6736
            ],
            [
                6736,
                6737
            ],
            [
                6737,
                6744
            ],
            [
                6758,
                6805
            ],
            [
                6805,
                6834
            ],
            [
                6835,
                6928
            ],
            [
                6928,
                6931
            ],
            [
                6939,
                6947
            ],
            [
                6948,
                6978
            ],
            [
                6981,
                7047
            ],
            [
                7048,
                7066
            ],
            [
                7066,
                7082
            ],
            [
                7083,
                7130
            ],
            [
                7132,
                7165
            ],
            [
                7166,
                7224
            ],
            [
                7225,
                7226
            ],
            [
                7227,
                7235
            ],
            [
                7236,
                7244
            ],
            [
                7244,
                7245
            ],
            [
                7246,
                7276
            ],
            [
                7276,
                7377
            ],
            [
                7377,
                7426
            ],
            [
                7427,
                7447
            ],
            [
                7448,
                7456
            ],
            [
                7460,
                7468
            ],
            [
                7468,
                7520
            ],
            [
                7521,
                7533
            ],
            [
                7533,
                7577
            ],
            [
                7577,
                7620
            ],
            [
                7633,
                7639
            ],
            [
                7640,
                7642
            ],
            [
                7649,
                7669
            ],
            [
                7670,
                7672
            ],
            [
                7681,
                7683
            ],
            [
                7683,
                7719
            ],
            [
                7719,
                7720
            ],
            [
                7721,
                7738
            ],
            [
                7740,
                7775
            ],
            [
                7800,
                7813
            ],
            [
                7814,
                7818
            ],
            [
                7819,
                7828
            ],
            [
                7829,
                7848
            ],
            [
                7848,
                7918
            ],
            [
                7919,
                7941
            ],
            [
                7941,
                7942
            ],
            [
                7943,
                7954
            ],
            [
                7955,
                7979
            ],
            [
                7980,
                7989
            ],
            [
                7992,
                8068
            ],
            [
                8069,
                8086
            ],
            [
                8087,
                8153
            ],
            [
                8154,
                8159
            ],
            [
                8160,
                8190
            ],
            [
                8190,
                8192
            ],
            [
                8192,
                8239
            ],
            [
                8242,
                8262
            ],
            [
                8269,
                8271
            ],
            [
                8271,
                8298
            ],
            [
                8302,
                8354
            ],
            [
                8355,
                8390
            ],
            [
                8390,
                8406
            ],
            [
                8406,
                8408
            ],
            [
                8408,
                8434
            ],
            [
                8436,
                8481
            ],
            [
                8481,
                8503
            ],
            [
                8504,
                8553
            ],
            [
                8553,
                8554
            ],
            [
                8555,
                8558
            ],
            [
                8559,
                8583
            ],
            [
                8583,
                8615
            ],
            [
                8616,
                8652
            ],
            [
                8660,
                8677
            ],
            [
                8678,
                8816
            ],
            [
                8816,
                8818
            ],
            [
                8818,
                8926
            ],
            [
                8926,
                8994
            ],
            [
                8995,
                9003
            ],
            [
                9004,
                9046
            ],
            [
                9046,
                9059
            ],
            [
                9062,
                9070
            ],
            [
                9071,
                9082
            ],
            [
                9082,
                9094
            ],
            [
                9101,
                9107
            ],
            [
                9110,
                9132
            ],
            [
                9132,
                9163
            ],
            [
                9164,
                9206
            ],
            [
                9206,
                9225
            ],
            [
                9230,
                9281
            ],
            [
                9281,
                9310
            ],
            [
                9311,
                9321
            ],
            [
                9322,
                9326
            ],
            [
                9327,
                9349
            ],
            [
                9350,
                9366
            ],
            [
                9367,
                9501
            ],
            [
                9501,
                9563
            ],
            [
                9563,
                9617
            ],
            [
                9623,
                9640
            ],
            [
                9641,
                9718
            ],
            [
                9718,
                9720
            ],
            [
                9720,
                9793
            ],
            [
                9793,
                9878
            ],
            [
                9878,
                9884
            ],
            [
                9885,
                9898
            ],
            [
                9898,
                9985
            ],
            [
                9992,
                9994
            ],
            [
                9994,
                10002
            ],
            [
                10003,
                10016
            ],
            [
                10017,
                10019
            ],
            [
                10020,
                10054
            ],
            [
                10054,
                10108
            ],
            [
                10111,
                10143
            ],
            [
                10149,
                10166
            ],
            [
                10167,
                10175
            ],
            [
                10175,
                10208
            ],
            [
                10209,
                10280
            ],
            [
                10281,
                10298
            ],
            [
                10299,
                10301
            ],
            [
                10316,
                10326
            ],
            [
                10326,
                10328
            ],
            [
                10328,
                10432
            ],
            [
                10432,
                10482
            ],
            [
                10482,
                10511
            ],
            [
                10512,
                10544
            ],
            [
                10544,
                10594
            ],
            [
                10595,
                10637
            ],
            [
                10637,
                10640
            ],
            [
                10641,
                10649
            ],
            [
                10656,
                10671
            ],
            [
                10673,
                10717
            ],
            [
                10717,
                10863
            ],
            [
                10863,
                10909
            ],
            [
                10909,
                10946
            ],
            [
                10947,
                10991
            ],
            [
                10992,
                11058
            ],
            [
                11058,
                11133
            ],
            [
                11133,
                11141
            ],
            [
                11142,
                11253
            ],
            [
                11254,
                11263
            ],
            [
                11264,
                11312
            ],
            [
                11312,
                11314
            ],
            [
                11315,
                11339
            ],
            [
                11346,
                11528
            ],
            [
                11528,
                11530
            ],
            [
                11530,
                11584
            ],
            [
                11586,
                11606
            ],
            [
                11607,
                11667
            ],
            [
                11670,
                11693
            ],
            [
                11697,
                11708
            ],
            [
                11708,
                11744
            ],
            [
                11744,
                11841
            ],
            [
                11842,
                11844
            ],
            [
                11856,
                11857
            ],
            [
                11863,
                11881
            ],
            [
                11891,
                11893
            ],
            [
                11893,
                11917
            ],
            [
                11920,
                11925
            ],
            [
                11929,
                11930
            ],
            [
                11938,
                11986
            ],
            [
                11986,
                12049
            ],
            [
                12049,
                12100
            ],
            [
                12100,
                12112
            ],
            [
                12116,
                12164
            ],
            [
                12167,
                12168
            ],
            [
                12168,
                12180
            ],
            [
                12181,
                12182
            ],
            [
                12182,
                12191
            ],
            [
                12193,
                12206
            ],
            [
                12208,
                12216
            ],
            [
                12218,
                12219
            ],
            [
                12221,
                12261
            ],
            [
                12261,
                12280
            ],
            [
                12280,
                12342
            ],
            [
                12346,
                12362
            ],
            [
                12365,
                12380
            ],
            [
                12381,
                12382
            ],
            [
                12382,
                12396
            ],
            [
                12397,
                12398
            ],
            [
                12398,
                12407
            ],
            [
                12409,
                12502
            ],
            [
                12504,
                12509
            ],
            [
                12512,
                12596
            ],
            [
                12599,
                12606
            ],
            [
                12609,
                12622
            ],
            [
                12622,
                12652
            ],
            [
                12654,
                12665
            ],
            [
                12668,
                12723
            ],
            [
                12724,
                12728
            ],
            [
                12734,
                12785
            ],
            [
                12787,
                12790
            ],
            [
                12792,
                12795
            ],
            [
                12797,
                12802
            ],
            [
                12804,
                12807
            ],
            [
                12825,
                12850
            ],
            [
                12853,
                12879
            ],
            [
                12879,
                12902
            ],
            [
                12903,
                12926
            ],
            [
                12937,
                12955
            ],
            [
                12956,
                12961
            ],
            [
                12971,
                12972
            ],
            [
                12973,
                12991
            ],
            [
                12997,
                13009
            ],
            [
                13009,
                13010
            ],
            [
                13011,
                13015
            ],
            [
                13016,
                13041
            ],
            [
                13041,
                13043
            ],
            [
                13043,
                13114
            ],
            [
                13122,
                13124
            ],
            [
                13124,
                13152
            ],
            [
                13158,
                13171
            ],
            [
                13173,
                13210
            ],
            [
                13213,
                13237
            ],
            [
                13238,
                13290
            ],
            [
                13290,
                13292
            ],
            [
                13292,
                13345
            ],
            [
                13345,
                13350
            ],
            [
                13351,
                13360
            ],
            [
                13361,
                13378
            ],
            [
                13378,
                13419
            ],
            [
                13421,
                13435
            ],
            [
                13435,
                13436
            ],
            [
                13437,
                13475
            ],
            [
                13475,
                13477
            ],
            [
                13477,
                13542
            ],
            [
                13542,
                13581
            ],
            [
                13584,
                13605
            ],
            [
                13606,
                13617
            ],
            [
                13619,
                13627
            ],
            [
                13643,
                13658
            ],
            [
                13659,
                13738
            ],
            [
                13741,
                13781
            ],
            [
                13782,
                13795
            ],
            [
                13798,
                13806
            ],
            [
                13806,
                13808
            ],
            [
                13809,
                13813
            ],
            [
                13813,
                13827
            ],
            [
                13830,
                13850
            ],
            [
                13853,
                13887
            ],
            [
                13887,
                13904
            ],
            [
                13917,
                13943
            ],
            [
                13945,
                13988
            ],
            [
                13992,
                13994
            ],
            [
                13994,
                13996
            ],
            [
                13998,
                14004
            ],
            [
                14011,
                14013
            ],
            [
                14014,
                14024
            ],
            [
                14024,
                14026
            ],
            [
                14026,
                14043
            ],
            [
                14044,
                14156
            ],
            [
                14178,
                14249
            ],
            [
                14252,
                14278
            ],
            [
                14279,
                14286
            ],
            [
                14289,
                14393
            ],
            [
                14393,
                14394
            ],
            [
                14395,
                14420
            ],
            [
                14420,
                14422
            ],
            [
                14422,
                14480
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                229
            ],
            [
                229,
                296
            ],
            [
                296,
                370
            ],
            [
                370,
                377
            ],
            [
                377,
                500
            ],
            [
                500,
                573
            ],
            [
                573,
                605
            ],
            [
                605,
                605
            ],
            [
                605,
                605
            ],
            [
                605,
                651
            ],
            [
                651,
                699
            ],
            [
                699,
                711
            ],
            [
                711,
                805
            ],
            [
                805,
                855
            ],
            [
                855,
                859
            ],
            [
                859,
                924
            ],
            [
                924,
                1021
            ],
            [
                1021,
                1129
            ],
            [
                1129,
                1166
            ],
            [
                1166,
                1166
            ],
            [
                1166,
                1423
            ],
            [
                1423,
                1507
            ],
            [
                1507,
                1522
            ],
            [
                1522,
                1564
            ],
            [
                1564,
                1673
            ],
            [
                1673,
                1723
            ],
            [
                1723,
                1812
            ],
            [
                1812,
                1812
            ],
            [
                1812,
                2010
            ],
            [
                2010,
                2078
            ],
            [
                2078,
                2309
            ],
            [
                2309,
                2435
            ],
            [
                2435,
                2467
            ],
            [
                2467,
                2791
            ],
            [
                2791,
                2854
            ],
            [
                2854,
                2925
            ],
            [
                2925,
                3159
            ],
            [
                3159,
                3225
            ],
            [
                3225,
                3368
            ],
            [
                3368,
                3564
            ],
            [
                3564,
                3683
            ],
            [
                3683,
                3719
            ],
            [
                3719,
                3762
            ],
            [
                3762,
                3813
            ],
            [
                3813,
                3870
            ],
            [
                3870,
                4072
            ],
            [
                4072,
                4126
            ],
            [
                4126,
                4204
            ],
            [
                4204,
                4219
            ],
            [
                4219,
                4300
            ],
            [
                4300,
                4385
            ],
            [
                4385,
                4405
            ],
            [
                4405,
                4442
            ],
            [
                4442,
                4504
            ],
            [
                4504,
                4504
            ],
            [
                4504,
                4504
            ],
            [
                4504,
                4596
            ],
            [
                4596,
                4711
            ],
            [
                4711,
                4876
            ],
            [
                4876,
                4955
            ],
            [
                4955,
                4984
            ],
            [
                4984,
                5273
            ],
            [
                5273,
                5360
            ],
            [
                5360,
                5426
            ],
            [
                5426,
                5541
            ],
            [
                5541,
                5757
            ],
            [
                5757,
                5848
            ],
            [
                5848,
                5889
            ],
            [
                5889,
                5920
            ],
            [
                5920,
                5988
            ],
            [
                5988,
                6012
            ],
            [
                6012,
                6094
            ],
            [
                6094,
                6115
            ],
            [
                6115,
                6123
            ],
            [
                6123,
                6211
            ],
            [
                6211,
                6265
            ],
            [
                6265,
                6321
            ],
            [
                6321,
                6422
            ],
            [
                6422,
                6452
            ],
            [
                6452,
                6464
            ],
            [
                6464,
                6550
            ],
            [
                6550,
                6612
            ],
            [
                6612,
                6805
            ],
            [
                6805,
                6805
            ],
            [
                6805,
                6928
            ],
            [
                6928,
                6981
            ],
            [
                6981,
                7066
            ],
            [
                7066,
                7246
            ],
            [
                7246,
                7276
            ],
            [
                7276,
                7377
            ],
            [
                7377,
                7521
            ],
            [
                7521,
                7577
            ],
            [
                7577,
                7683
            ],
            [
                7683,
                8192
            ],
            [
                8192,
                8271
            ],
            [
                8271,
                8390
            ],
            [
                8390,
                8408
            ],
            [
                8408,
                8481
            ],
            [
                8481,
                8583
            ],
            [
                8583,
                8678
            ],
            [
                8678,
                8818
            ],
            [
                8818,
                8926
            ],
            [
                8926,
                9046
            ],
            [
                9046,
                9206
            ],
            [
                9206,
                9350
            ],
            [
                9350,
                9501
            ],
            [
                9501,
                9563
            ],
            [
                9563,
                9720
            ],
            [
                9720,
                9793
            ],
            [
                9793,
                9878
            ],
            [
                9878,
                9994
            ],
            [
                9994,
                9994
            ],
            [
                9994,
                10054
            ],
            [
                10054,
                10175
            ],
            [
                10175,
                10175
            ],
            [
                10175,
                10281
            ],
            [
                10281,
                10328
            ],
            [
                10328,
                10432
            ],
            [
                10432,
                10544
            ],
            [
                10544,
                10637
            ],
            [
                10637,
                10717
            ],
            [
                10717,
                10717
            ],
            [
                10717,
                10863
            ],
            [
                10863,
                10909
            ],
            [
                10909,
                11058
            ],
            [
                11058,
                11133
            ],
            [
                11133,
                11312
            ],
            [
                11312,
                11530
            ],
            [
                11530,
                11606
            ],
            [
                11606,
                11696
            ],
            [
                11696,
                11708
            ],
            [
                11708,
                11744
            ],
            [
                11744,
                11893
            ],
            [
                11893,
                11928
            ],
            [
                11928,
                11986
            ],
            [
                11986,
                12049
            ],
            [
                12049,
                12100
            ],
            [
                12100,
                12167
            ],
            [
                12167,
                12220
            ],
            [
                12220,
                12261
            ],
            [
                12261,
                12280
            ],
            [
                12280,
                12345
            ],
            [
                12345,
                12365
            ],
            [
                12365,
                12381
            ],
            [
                12381,
                12381
            ],
            [
                12381,
                12622
            ],
            [
                12622,
                12622
            ],
            [
                12622,
                12825
            ],
            [
                12825,
                13043
            ],
            [
                13043,
                13124
            ],
            [
                13124,
                13152
            ],
            [
                13152,
                13173
            ],
            [
                13173,
                13173
            ],
            [
                13173,
                13213
            ],
            [
                13213,
                13292
            ],
            [
                13292,
                13360
            ],
            [
                13360,
                13378
            ],
            [
                13378,
                13421
            ],
            [
                13421,
                13421
            ],
            [
                13421,
                13477
            ],
            [
                13477,
                13542
            ],
            [
                13542,
                13584
            ],
            [
                13584,
                13781
            ],
            [
                13781,
                13798
            ],
            [
                13798,
                13808
            ],
            [
                13808,
                13813
            ],
            [
                13813,
                13887
            ],
            [
                13887,
                13944
            ],
            [
                13944,
                13991
            ],
            [
                13991,
                13991
            ],
            [
                13991,
                13996
            ],
            [
                13996,
                14026
            ],
            [
                14026,
                14159
            ],
            [
                14159,
                14159
            ],
            [
                14159,
                14159
            ],
            [
                14159,
                14289
            ],
            [
                14289,
                14422
            ],
            [
                14422,
                14480
            ]
        ]
    }
}