{
    "original": {
        "text": "\"Learn to win a lady's faith Nobly, as the thing is high; Bravely, as for life and death-- With a loyal gravity.\nLead her from the festive boards, Point her to the starry skies, Guard her, by your truthful words, Pure from courtship's flatteries.\" MRS. BROWNING.\n\"Mr. Henry Lennox.\" Margaret had been thinking of him only a moment before, and remembering his inquiry into her probable occupations at home. It was \"parler du soleil et l'on en voit les rayons;\" and the brightness of the sun came over Margaret's face as she put down her board, and went forward to shake hands with him. \"Tell mamma, Sarah,\" said she. \"Mamma and I want to ask you so many questions about Edith; I am so much obliged to you for coming.\"\n\"Did not I say that I should?\" asked he, in a lower tone than that in which he had spoken.\n\"But I heard of you so far away in the Highlands that I never thought Hampshire could come in.\"\n\"Oh!\" said he, more lightly, \"our young couple were playing such foolish pranks, running all sorts of risks, climbing this mountain, sailing on that lake, that I really thought they needed a Mentor to take care of them. And indeed they did: they were quite beyond my uncle's management, and kept the old gentleman in a panic for sixteen hours out of the twenty-four. Indeed, when I once saw how unfit they were to be trusted alone, I thought it my duty not to leave them till I had seen them safely embarked at Plymouth.\"\n\"Have you been at Plymouth? Oh! Edith never named that. To be sure, she has written in such a hurry lately. Did they really sail on Tuesday?\"\n\"Really sailed, and relieved me from many responsibilities. Edith gave me all sorts of messages for you. I believe I have a little diminutive note somewhere; yes, here it is.\"\n\"Oh! thank you,\" exclaimed Margaret; and then, half wishing to read it alone and unwatched, she made the excuse of going to tell her mother again (Sarah surely had made some mistake) that Mr. Lennox was there.\nWhen she had left the room, he began in his scrutinising way to look about him. The little drawing-room was looking its best in the streaming light of the morning sun. The middle window in the bow was opened, and clustering roses and the scarlet honeysuckle came peeping round the corner; the small lawn was gorgeous with verbenas and geraniums of all bright colours. But the very brightness outside made the colours within seem poor and faded. The carpet was far from new; the chintz had been often washed; the whole apartment was smaller and shabbier than he had expected, as back-ground and frame-work for Margaret, herself so queenly. He took up one of the books lying on the table; it was the Paradise of Dante, in the proper old Italian binding of white vellum and gold; by it lay a dictionary, and some words copied out in Margaret's handwriting. They were a dull list of words, but somehow he liked looking at them. He put them down with a sigh.\n\"The living is evidently as small as she said. It seems strange, for the Beresfords belong to a good family.\"\nMargaret meanwhile had found her mother. It was one of Mrs. Hale's fitful days, when everything was a difficulty and a hardship: and Mr. Lennox's appearance took this shape, although secretly she felt complimented by his thinking it worth while to call.\n\"It is most unfortunate! We are dining early to-day, and having nothing but cold meat, in order that the servants may get on with their ironing; and yet, of course, we must ask him to dinner--Edith's brother-in-law and all. And your papa is in such low spirits this morning about something--I don't know what. I went into the study just now, and he had his face on the table, covering it with his hands. I told him I was sure Helstone air did not agree with him any more than with me, and he suddenly lifted up his head, and begged me not to speak a word more against Helstone, he could not bear it; if there was one place he loved on earth it was Helstone. But I am sure, for all that, it is the damp and relaxing air.\"\nMargaret felt as if a thin cold cloud had come between her and the sun. She had listened patiently, in hopes that it might be some relief to her mother to unburden herself; but now it was time to draw her back to Mr. Lennox.\n\"Papa likes Mr. Lennox; they got on together famously at the wedding breakfast. I daresay his coming will do papa good. And never mind the dinner, dear mamma. Cold meat will do capitally for a lunch, which is the light in which Mr. Lennox will most likely look upon a two o'clock dinner.\"\n\"But what are we to do with him till then? It is only half-past ten now.\"\n\"I'll ask him to go out sketching with me. I know he draws, and that will take him out of your way, mamma. Only do come in now; he will think it so strange if you don't.\"\nMrs. Hale took off her black silk apron, and smoothed her face. She looked a very pretty lady-like woman, as she greeted Mr. Lennox with the cordiality due to one who was almost a relation. He evidently expected to be asked to spend the day, and accepted the invitation with a glad readiness that made Mrs. Hale wish she could add something to the cold beef. He was pleased with everything; delighted with Margaret's idea of going out sketching together; would not have Mr. Hale disturbed for the world, with the prospect of so soon meeting him at dinner. Margaret brought out her drawing materials for him to choose from; and after the paper and brushes had been duly selected, the two set out in the merriest spirits in the world.\n\"Now, please, just stop here for a minute or two,\" said Margaret. \"These are the cottages that haunted me so during the rainy fortnight, reproaching me for not having sketched them.\"\n\"Before they tumbled down and were no more seen. Truly, if they are to be sketched--and they are very picturesque--we had better not put it off till next year. But where shall we sit?\"\n\"Oh! You might have come straight from chambers in the Temple, instead of having been two months in the Highlands! Look at this beautiful trunk of a tree, which the woodcutters have left just in the right place for the light. I will put my plaid over it, and it will be a regular forest throne.\"\n\"With your feet in that puddle for a regal footstool! Stay, I will move, and then you can come nearer this way. Who lives in these cottages?\"\n\"They were built by squatters fifty or sixty years ago. One is uninhabited; the foresters are going to take it down, as soon as the other is dead, poor old fellow! Look--there he is--I must go and speak to him. He is so deaf you will hear all our secrets.\"\nThe old man stood bareheaded in the sun, leaning on his stick at the front of his cottage. His stiff features relaxed into a slow smile as Margaret went up and spoke to him. Mr. Lennox hastily introduced the two figures into his sketch, and finished up the landscape with a subordinate reference to them--as Margaret perceived, when the time came for getting up, putting away water, and scraps of paper, and exhibiting to each other their sketches. She laughed and blushed: Mr. Lennox watched her countenance.\n\"Now, I call that treacherous,\" said she. \"I little thought that you were making old Isaac and me into subjects, when you told me to ask him the history of these cottages.\"\n\"It was irresistible. You can't know how strong a temptation it was. I hardly dare tell you how much I shall like this sketch.\"\nHe was not quite sure whether she heard this latter sentence before she went to the brook to wash her palette. She came back rather flushed, but looking perfectly innocent and unconscious. He was glad of it, for the speech had slipped from him unawares--a rare thing in the case of a man who premeditated his actions so much as Henry Lennox.\nThe aspect of home was all right and bright when they reached it. The clouds on her mother's brow had cleared off under the propitious influence of a brace of carp, most opportunely presented by a neighbour. Mr. Hale had returned from his morning's round, and was awaiting his visitor just outside the wicket gate that led into the garden. He looked a complete gentleman in his rather threadbare coat and well-worn hat. Margaret was proud of her father; she had always a fresh and tender pride in seeing how favourably he impressed every stranger; still her quick eye sought over his face and found there traces of some unusual disturbance, which was only put aside, not cleared away.\nMr. Hale asked to look at their sketches.\n\"I think you have made the tints on the thatch too dark, have you not?\" as he returned Margaret's to her, and held out his hand for Mr. Lennox's, which was withheld from him one moment, no more.\n\"No, papa! I don't think I have. The house-leek and stone-crop have grown so much darker in the rain. Is it not like, papa?\" said she, peeping over his shoulder, as he looked at the figures in Mr. Lennox's drawing.\n\"Yes, very like. Your figure and way of holding yourself is capital. And it is just poor old Isaac's stiff way of stooping his long rheumatic back. What is this hanging from the branch of the tree? Not a bird's nest, surely.\"\n\"Oh no! that is my bonnet. I never can draw with my bonnet on; it makes my head so hot. I wonder if I could manage figures. There are so many people about here whom I should like to sketch.\"\n\"I should say that a likeness you very much wish to take you would always succeed in,\" said Mr. Lennox. \"I have great faith in the power of will. I think myself I have succeeded pretty well in yours.\" Mr. Hale had preceded them into the house, while Margaret was lingering to pluck some roses, with which to adorn her morning gown for dinner.\n\"A regular London girl would understand the implied meaning of that speech,\" thought Mr. Lennox. \"She would be up to looking through every speech that a young man made her for the arrire-pense of a compliment. But I don't believe Margaret,--Stay!\" exclaimed he, \"Let me help you;\" and he gathered for her some velvety cramoisy roses that were above her reach, and then dividing the spoil he placed two in his button-hole, and sent her in, pleased and happy, to arrange her flowers.\nThe conversation at dinner flowed on quietly and agreeably. There were plenty of questions to be asked on both sides--the latest intelligence which each could give of Mrs. Shaw's movements in Italy to be exchanged; and in the interest of what was said, the unpretending simplicity of the parsonage-ways--above all in the neighbourhood of Margaret, Mr. Lennox forgot the little feeling of disappointment with which he had at first perceived that she had spoken but the simple truth when she had described her father's living as very small.\n\"Margaret, my child, you might have gathered us some pears for our dessert,\" said Mr. Hale, as the hospitable luxury of a freshly-decanted bottle of wine was placed on the table.\nMrs. Hale was hurried. It seemed as if desserts were impromptu and unusual things at the parsonage; whereas, if Mr. Hale would only have looked behind him, he would have seen biscuits and marmalade, and what not, all arranged in formal order on the side-board. But the idea of pears had taken possession of Mr. Hale's mind, and was not to be got rid of.\n\"There are a few brown beurrs against the south wall which are worth all foreign fruits and preserves. Run, Margaret, and gather some.\"\n\"I propose that we adjourn into the garden, and eat them there,\" said Mr. Lennox. \"Nothing is so delicious as to set one's teeth into the crisp, juicy fruit, warm and scented by the sun. The worst is, the wasps are impudent enough to dispute it with one, even at the very crisis and summit of enjoyment.\"\nHe rose, as if to follow Margaret, who had disappeared through the window: he only awaited Mrs. Hale's permission. She would rather have wound up the dinner in the proper way, and with all the ceremonies which had gone on so smoothly hitherto, especially as she and Dixon had got out the finger-glasses from the store-room on purpose to be as correct as became General Shaw's widow's sister; but as Mr. Hale got up directly, and prepared to accompany his guest, she could only submit.\n\"I shall arm myself with a knife,\" said Mr. Hale: \"the days of eating fruit so primitively as you describe are over with me. I must pare it and quarter it before I can enjoy it.\"\nMargaret made a plate for the pears out of a beet-root leaf, which threw up their brown gold colour admirably. Mr. Lennox looked more at her than at the pears; but her father, inclined to cull fastidiously the very zest and perfection of the hour he had stolen from his anxiety, chose daintily the ripest fruit, and sat down on the garden bench to enjoy it at his leisure. Margaret and Mr. Lennox strolled along the little terrace-walk under the south wall, where the bees still hummed and worked busily in their hives.\n\"What a perfect life you seem to live here! I have always felt rather contemptuously towards the poets before, with their wishes, 'Mine be a cot beside a hill,' and that sort of thing; but now I am afraid that the truth is, I have been nothing better than a Cockney. Just now I feel as if twenty years' hard study of law would be amply rewarded by one year of such an exquisite serene life as this--such skies!\" looking up--\"such crimson and amber foliage, so perfectly motionless as that!\" pointing to some of the great forest trees which shut in the garden as if it were a nest.\n\"You must please to remember that our skies are not always as deep a blue as they are now. We have rain, and our leaves do fall, and get sodden: though I think Helstone is about as perfect a place as any in the world. Recollect how you rather scorned my description of it one evening in Harley Street: 'a village in a tale.'\"\n\"Scorned, Margaret! That is rather a hard word.\"\n\"Perhaps it is. Only I know I should have liked to have talked to you of what I was very full at the time, and you--what must I call it then?--spoke disrespectfully of Helstone as a mere village in a tale.\"\n\"I will never do so again,\" said he, warmly. They turned the corner of the walk.\n\"I could almost wish, Margaret----\" he stopped and hesitated. It was so unusual for the fluent lawyer to hesitate that Margaret looked up at him, in a little state of questioning wonder; but in an instant--from what about him she could not tell--she wished herself back with her mother--her father--anywhere away from him, for she was sure he was going to say something to which she should not know what to reply. In another moment the strong pride that was in her came to conquer her sudden agitation, which she hoped he had not perceived. Of course she could answer, and answer the right thing; and it was poor and despicable of her to shrink from hearing any speech, as if she had not power to put an end to it with her high maidenly dignity.\n\"Margaret,\" said he, taking her by surprise, and getting sudden possession of her hand, so that she was forced to stand still and listen, despising herself for the fluttering at her heart all the time; \"Margaret, I wish you did not like Helstone so much--did not seem so perfectly calm and happy here. I have been hoping for these three months past to find you regretting London--and London friends, a little--enough to make you listen more kindly\" (for she was quietly, but firmly, striving to extricate her hand from his grasp) \"to one who has not much to offer, it is true--nothing but prospects in the future--but who does love you, Margaret, almost in spite of himself. Margaret, have I startled you too much? Speak!\" For he saw her lips quivering almost as if she were going to cry. She made a strong effort to be calm; she would not speak till she had succeeded in mastering her voice, and then she said:\n\"I was startled. I did not know that you cared for me in that way. I have always thought of you as a friend; and, please, I would rather go on thinking of you so. I don't like to be spoken to as you have been doing. I cannot answer you as you want me to do, and yet I should feel so sorry if I vexed you.\"\n\"Margaret,\" said he, looking into her eyes, which met his with their open, straight look, expressive of the utmost good faith and reluctance to give pain, \"Do you\"--he was going to say--\"love any one else?\" But it seemed as if this question would be an insult to the pure serenity of those eyes. \"Forgive me! I have been too abrupt. I am punished. Only let me hope. Give me the poor comfort of telling me you have never seen any one whom you could----\" Again a pause. He could not end his sentence. Margaret reproached herself acutely as the cause of his distress.\n\"Ah! if you had but never got this fancy into your head! It was such a pleasure to think of you as a friend.\"\n\"But I may hope, may I not, Margaret, that some time you will think of me as a lover? Not yet, I see--there is no hurry--but some time----\"\nShe was silent for a minute or two, trying to discover the truth as it was in her own heart, before replying, then she said:\n\"I have never thought of--you, but as a friend. I like to think of you so; but I am sure I could never think of you as anything else. Pray let us both forget that all this\" (\"disagreeable,\" she was going to say, but stopped short) \"conversation has taken place.\"\nHe paused before he replied. Then, in his habitual coldness of tone, he answered:\n\"Of course, as your feelings are so decided, and as this conversation has been so evidently unpleasant to you, it had better not be remembered. That is all very fine in theory, that plan of forgetting whatever is painful, but it will be somewhat difficult for me, at least, to carry it into execution.\"\n\"You are vexed,\" said she, sadly; \"yet how can I help it?\"\nShe looked so truly grieved as she said this, that he struggled for a moment with his real disappointment, and then answered more cheerfully, but still with a little hardness in his tone:\n\"You should make allowances for the mortification, not only of a lover, Margaret, but of a man not given to romance in general--prudent, worldly, as some people call me--who has been carried out of his usual habits by the force of a passion--well, we will say no more of that; but in the one outlet which he has formed for the deeper and better feelings of his nature, he meets with rejection and repulse. I shall have to console myself with scorning my own folly. A struggling barrister to think of matrimony!\"\nMargaret could not answer this. The whole tone of it annoyed her. It seemed to touch on and call out all the points of difference which had often repelled her in him; while yet he was the pleasantest man, the most sympathising friend, the person of all others who understood her best in Harley Street. She felt a tinge of contempt mingle itself with her pain at having refused him. Her beautiful lip curled in a slight disdain. It was well that, having made the round of the garden, they came suddenly upon Mr. Hale, whose whereabouts had been quite forgotten by them. He had not yet finished the pear, which he had delicately peeled in one long strip of silver-paper thinness, and which he was enjoying in a deliberate manner. It was like the story of the eastern king, who dipped his head into a basin of water, at the magician's command, and ere he instantly took it out went through the experience of a lifetime. Margaret felt stunned, and unable to recover her self-possession enough to join in the trivial conversation that ensued between her father and Mr. Lennox. She was grave, and little disposed to speak; full of wonder when Mr. Lennox would go, and allow her to relax into thought on the events of the last quarter of an hour. He was almost as anxious to take his departure as she was for him to leave; but a few minutes light and careless talking, carried on at whatever effort, was a sacrifice which he owed to his mortified vanity, or his self-respect. He glanced from time to time at her sad and pensive face.\n\"I am not so indifferent to her as she believes,\" thought he to himself. \"I do not give up hope.\"\nBefore a quarter of an hour was over, he had fallen into a way of conversing with quiet sarcasm; speaking of life in London and life in the country, as if he were conscious of his second mocking self, and afraid of his own satire. Mr. Hale was puzzled. His visitor was a different man to what he had seen him before at the wedding-breakfast, and at dinner to-day; a lighter, cleverer, more worldly man, and, as such, dissonant to Mr. Hale. It was a relief to all three when Mr. Lennox said that he must go directly if he meant to catch the five o'clock train. They proceeded to the house to find Mrs. Hale, and wish her good-bye. At the last moment, Henry Lennox's real self broke through the crust.\n\"Margaret, don't despise me; I have a heart, notwithstanding all this good-for-nothing way of talking. As a proof of it, I believe I love you more than ever--if I do not hate you--for the disdain with which you have listened to me during this last half-hour. Good-bye, Margaret--Margaret!\"",
        "paragraph_chars": [
            [
                0,
                113
            ],
            [
                113,
                263
            ],
            [
                263,
                717
            ],
            [
                717,
                808
            ],
            [
                808,
                904
            ],
            [
                904,
                1426
            ],
            [
                1426,
                1568
            ],
            [
                1568,
                1744
            ],
            [
                1744,
                1954
            ],
            [
                1954,
                2908
            ],
            [
                2908,
                3018
            ],
            [
                3018,
                3272
            ],
            [
                3272,
                3993
            ],
            [
                3993,
                4218
            ],
            [
                4218,
                4507
            ],
            [
                4507,
                4581
            ],
            [
                4581,
                4752
            ],
            [
                4752,
                5485
            ],
            [
                5485,
                5668
            ],
            [
                5668,
                5853
            ],
            [
                5853,
                6149
            ],
            [
                6149,
                6291
            ],
            [
                6291,
                6548
            ],
            [
                6548,
                7058
            ],
            [
                7058,
                7231
            ],
            [
                7231,
                7359
            ],
            [
                7359,
                7701
            ],
            [
                7701,
                8386
            ],
            [
                8386,
                8428
            ],
            [
                8428,
                8623
            ],
            [
                8623,
                8838
            ],
            [
                8838,
                9064
            ],
            [
                9064,
                9255
            ],
            [
                9255,
                9598
            ],
            [
                9598,
                10080
            ],
            [
                10080,
                10619
            ],
            [
                10619,
                10798
            ],
            [
                10798,
                11152
            ],
            [
                11152,
                11288
            ],
            [
                11288,
                11593
            ],
            [
                11593,
                12078
            ],
            [
                12078,
                12257
            ],
            [
                12257,
                12777
            ],
            [
                12777,
                13358
            ],
            [
                13358,
                13684
            ],
            [
                13684,
                13733
            ],
            [
                13733,
                13940
            ],
            [
                13940,
                14021
            ],
            [
                14021,
                14767
            ],
            [
                14767,
                15679
            ],
            [
                15679,
                15985
            ],
            [
                15985,
                16550
            ],
            [
                16550,
                16660
            ],
            [
                16660,
                16800
            ],
            [
                16800,
                16925
            ],
            [
                16925,
                17188
            ],
            [
                17188,
                17270
            ],
            [
                17270,
                17573
            ],
            [
                17573,
                17632
            ],
            [
                17632,
                17820
            ],
            [
                17820,
                18332
            ],
            [
                18332,
                19859
            ],
            [
                19859,
                19957
            ],
            [
                19957,
                20657
            ],
            [
                20657,
                20946
            ]
        ],
        "segment_chars": [
            [
                0,
                113
            ],
            [
                113,
                248
            ],
            [
                248,
                263
            ],
            [
                263,
                283
            ],
            [
                283,
                406
            ],
            [
                406,
                585
            ],
            [
                585,
                616
            ],
            [
                616,
                717
            ],
            [
                717,
                748
            ],
            [
                748,
                808
            ],
            [
                808,
                904
            ],
            [
                904,
                910
            ],
            [
                910,
                1124
            ],
            [
                1124,
                1271
            ],
            [
                1271,
                1426
            ],
            [
                1426,
                1454
            ],
            [
                1454,
                1458
            ],
            [
                1458,
                1482
            ],
            [
                1482,
                1534
            ],
            [
                1534,
                1568
            ],
            [
                1568,
                1628
            ],
            [
                1628,
                1673
            ],
            [
                1673,
                1744
            ],
            [
                1744,
                1749
            ],
            [
                1749,
                1954
            ],
            [
                1954,
                2034
            ],
            [
                2034,
                2122
            ],
            [
                2122,
                2322
            ],
            [
                2322,
                2399
            ],
            [
                2399,
                2593
            ],
            [
                2593,
                2808
            ],
            [
                2808,
                2878
            ],
            [
                2878,
                2908
            ],
            [
                2908,
                2955
            ],
            [
                2955,
                3018
            ],
            [
                3018,
                3059
            ],
            [
                3059,
                3272
            ],
            [
                3272,
                3297
            ],
            [
                3297,
                3496
            ],
            [
                3496,
                3582
            ],
            [
                3582,
                3676
            ],
            [
                3676,
                3930
            ],
            [
                3930,
                3993
            ],
            [
                3993,
                4065
            ],
            [
                4065,
                4218
            ],
            [
                4218,
                4298
            ],
            [
                4298,
                4338
            ],
            [
                4338,
                4377
            ],
            [
                4377,
                4507
            ],
            [
                4507,
                4550
            ],
            [
                4550,
                4581
            ],
            [
                4581,
                4624
            ],
            [
                4624,
                4688
            ],
            [
                4688,
                4752
            ],
            [
                4752,
                4816
            ],
            [
                4816,
                4942
            ],
            [
                4942,
                5111
            ],
            [
                5111,
                5308
            ],
            [
                5308,
                5485
            ],
            [
                5485,
                5551
            ],
            [
                5551,
                5668
            ],
            [
                5668,
                5717
            ],
            [
                5717,
                5828
            ],
            [
                5828,
                5853
            ],
            [
                5853,
                5858
            ],
            [
                5858,
                5968
            ],
            [
                5968,
                6079
            ],
            [
                6079,
                6149
            ],
            [
                6149,
                6203
            ],
            [
                6203,
                6261
            ],
            [
                6261,
                6291
            ],
            [
                6291,
                6347
            ],
            [
                6347,
                6455
            ],
            [
                6455,
                6502
            ],
            [
                6502,
                6548
            ],
            [
                6548,
                6639
            ],
            [
                6639,
                6722
            ],
            [
                6722,
                6997
            ],
            [
                6997,
                7058
            ],
            [
                7058,
                7100
            ],
            [
                7100,
                7231
            ],
            [
                7231,
                7253
            ],
            [
                7253,
                7300
            ],
            [
                7300,
                7359
            ],
            [
                7359,
                7470
            ],
            [
                7470,
                7548
            ],
            [
                7548,
                7701
            ],
            [
                7701,
                7767
            ],
            [
                7767,
                7909
            ],
            [
                7909,
                8041
            ],
            [
                8041,
                8121
            ],
            [
                8121,
                8386
            ],
            [
                8386,
                8428
            ],
            [
                8428,
                8500
            ],
            [
                8500,
                8623
            ],
            [
                8623,
                8634
            ],
            [
                8634,
                8656
            ],
            [
                8656,
                8725
            ],
            [
                8725,
                8748
            ],
            [
                8748,
                8838
            ],
            [
                8838,
                8855
            ],
            [
                8855,
                8907
            ],
            [
                8907,
                8986
            ],
            [
                8986,
                9036
            ],
            [
                9036,
                9064
            ],
            [
                9064,
                9072
            ],
            [
                9072,
                9091
            ],
            [
                9091,
                9152
            ],
            [
                9152,
                9188
            ],
            [
                9188,
                9255
            ],
            [
                9255,
                9359
            ],
            [
                9359,
                9401
            ],
            [
                9401,
                9456
            ],
            [
                9456,
                9598
            ],
            [
                9598,
                9695
            ],
            [
                9695,
                9808
            ],
            [
                9808,
                9846
            ],
            [
                9846,
                10080
            ],
            [
                10080,
                10140
            ],
            [
                10140,
                10619
            ],
            [
                10619,
                10798
            ],
            [
                10798,
                10821
            ],
            [
                10821,
                11059
            ],
            [
                11059,
                11152
            ],
            [
                11152,
                11255
            ],
            [
                11255,
                11288
            ],
            [
                11288,
                11370
            ],
            [
                11370,
                11475
            ],
            [
                11475,
                11593
            ],
            [
                11593,
                11708
            ],
            [
                11708,
                12078
            ],
            [
                12078,
                12203
            ],
            [
                12203,
                12257
            ],
            [
                12257,
                12368
            ],
            [
                12368,
                12630
            ],
            [
                12630,
                12777
            ],
            [
                12777,
                12821
            ],
            [
                12821,
                13044
            ],
            [
                13044,
                13189
            ],
            [
                13189,
                13268
            ],
            [
                13268,
                13358
            ],
            [
                13358,
                13449
            ],
            [
                13449,
                13576
            ],
            [
                13576,
                13684
            ],
            [
                13684,
                13704
            ],
            [
                13704,
                13733
            ],
            [
                13733,
                13749
            ],
            [
                13749,
                13940
            ],
            [
                13940,
                13985
            ],
            [
                13985,
                14021
            ],
            [
                14021,
                14083
            ],
            [
                14083,
                14435
            ],
            [
                14435,
                14562
            ],
            [
                14562,
                14767
            ],
            [
                14767,
                15069
            ],
            [
                15069,
                15442
            ],
            [
                15442,
                15482
            ],
            [
                15482,
                15490
            ],
            [
                15490,
                15556
            ],
            [
                15556,
                15679
            ],
            [
                15679,
                15696
            ],
            [
                15696,
                15746
            ],
            [
                15746,
                15842
            ],
            [
                15842,
                15895
            ],
            [
                15895,
                15985
            ],
            [
                15985,
                16192
            ],
            [
                16192,
                16281
            ],
            [
                16281,
                16294
            ],
            [
                16294,
                16318
            ],
            [
                16318,
                16333
            ],
            [
                16333,
                16351
            ],
            [
                16351,
                16453
            ],
            [
                16453,
                16484
            ],
            [
                16484,
                16550
            ],
            [
                16550,
                16555
            ],
            [
                16555,
                16607
            ],
            [
                16607,
                16660
            ],
            [
                16660,
                16746
            ],
            [
                16746,
                16800
            ],
            [
                16800,
                16925
            ],
            [
                16925,
                16973
            ],
            [
                16973,
                17059
            ],
            [
                17059,
                17188
            ],
            [
                17188,
                17217
            ],
            [
                17217,
                17270
            ],
            [
                17270,
                17414
            ],
            [
                17414,
                17573
            ],
            [
                17573,
                17632
            ],
            [
                17632,
                17820
            ],
            [
                17820,
                18226
            ],
            [
                18226,
                18285
            ],
            [
                18285,
                18332
            ],
            [
                18332,
                18364
            ],
            [
                18364,
                18398
            ],
            [
                18398,
                18634
            ],
            [
                18634,
                18714
            ],
            [
                18714,
                18760
            ],
            [
                18760,
                18901
            ],
            [
                18901,
                19060
            ],
            [
                19060,
                19249
            ],
            [
                19249,
                19404
            ],
            [
                19404,
                19572
            ],
            [
                19572,
                19801
            ],
            [
                19801,
                19859
            ],
            [
                19859,
                19932
            ],
            [
                19932,
                19957
            ],
            [
                19957,
                20188
            ],
            [
                20188,
                20210
            ],
            [
                20210,
                20397
            ],
            [
                20397,
                20517
            ],
            [
                20517,
                20587
            ],
            [
                20587,
                20657
            ],
            [
                20657,
                20760
            ],
            [
                20760,
                20916
            ],
            [
                20916,
                20946
            ]
        ],
        "overlap_chars": [
            [
                283,
                337
            ],
            [
                404,
                406
            ],
            [
                511,
                515
            ],
            [
                516,
                584
            ],
            [
                618,
                644
            ],
            [
                663,
                683
            ],
            [
                689,
                714
            ],
            [
                722,
                745
            ],
            [
                748,
                762
            ],
            [
                769,
                773
            ],
            [
                806,
                808
            ],
            [
                809,
                827
            ],
            [
                831,
                856
            ],
            [
                905,
                907
            ],
            [
                910,
                932
            ],
            [
                934,
                1124
            ],
            [
                1145,
                1228
            ],
            [
                1269,
                1271
            ],
            [
                1336,
                1423
            ],
            [
                1458,
                1469
            ],
            [
                1476,
                1482
            ],
            [
                1482,
                1534
            ],
            [
                1534,
                1565
            ],
            [
                1626,
                1628
            ],
            [
                1628,
                1673
            ],
            [
                1673,
                1698
            ],
            [
                1710,
                1725
            ],
            [
                1731,
                1741
            ],
            [
                1755,
                1758
            ],
            [
                1761,
                1790
            ],
            [
                1796,
                1883
            ],
            [
                1927,
                1954
            ],
            [
                1954,
                1971
            ],
            [
                2029,
                2032
            ],
            [
                1980,
                1990
            ],
            [
                2015,
                2017
            ],
            [
                1998,
                2005
            ],
            [
                1972,
                1975
            ],
            [
                1976,
                1980
            ],
            [
                2032,
                2034
            ],
            [
                2058,
                2122
            ],
            [
                2122,
                2125
            ],
            [
                2133,
                2139
            ],
            [
                2151,
                2154
            ],
            [
                2161,
                2187
            ],
            [
                2200,
                2288
            ],
            [
                2306,
                2312
            ],
            [
                2289,
                2298
            ],
            [
                2320,
                2322
            ],
            [
                2322,
                2399
            ],
            [
                2399,
                2402
            ],
            [
                2482,
                2527
            ],
            [
                2529,
                2531
            ],
            [
                2559,
                2592
            ],
            [
                2593,
                2651
            ],
            [
                2661,
                2669
            ],
            [
                2731,
                2794
            ],
            [
                2806,
                2808
            ],
            [
                2808,
                2812
            ],
            [
                2818,
                2829
            ],
            [
                2838,
                2878
            ],
            [
                2878,
                2908
            ],
            [
                3018,
                3059
            ],
            [
                3059,
                3130
            ],
            [
                3151,
                3163
            ],
            [
                3190,
                3238
            ],
            [
                3270,
                3272
            ],
            [
                3273,
                3297
            ],
            [
                3297,
                3299
            ],
            [
                3336,
                3358
            ],
            [
                3417,
                3462
            ],
            [
                3494,
                3496
            ],
            [
                3496,
                3545
            ],
            [
                3563,
                3575
            ],
            [
                3580,
                3582
            ],
            [
                3582,
                3633
            ],
            [
                3665,
                3676
            ],
            [
                3676,
                3733
            ],
            [
                3755,
                3930
            ],
            [
                3930,
                3943
            ],
            [
                3959,
                3973
            ],
            [
                3987,
                3990
            ],
            [
                3993,
                4065
            ],
            [
                4065,
                4068
            ],
            [
                4134,
                4144
            ],
            [
                4198,
                4205
            ],
            [
                4206,
                4218
            ],
            [
                4219,
                4286
            ],
            [
                4296,
                4298
            ],
            [
                4308,
                4338
            ],
            [
                4338,
                4352
            ],
            [
                4357,
                4377
            ],
            [
                4377,
                4408
            ],
            [
                4411,
                4416
            ],
            [
                4508,
                4550
            ],
            [
                4550,
                4574
            ],
            [
                4582,
                4624
            ],
            [
                4645,
                4688
            ],
            [
                4688,
                4725
            ],
            [
                4729,
                4749
            ],
            [
                4752,
                4816
            ],
            [
                4816,
                4883
            ],
            [
                4893,
                4897
            ],
            [
                4940,
                4942
            ],
            [
                4942,
                4944
            ],
            [
                4998,
                5021
            ],
            [
                4964,
                4966
            ],
            [
                5022,
                5111
            ],
            [
                5111,
                5117
            ],
            [
                5143,
                5182
            ],
            [
                5187,
                5205
            ],
            [
                5306,
                5308
            ],
            [
                5317,
                5350
            ],
            [
                5429,
                5430
            ],
            [
                5375,
                5378
            ],
            [
                5431,
                5449
            ],
            [
                5463,
                5470
            ],
            [
                5483,
                5485
            ],
            [
                5486,
                5526
            ],
            [
                5536,
                5551
            ],
            [
                5558,
                5665
            ],
            [
                5669,
                5693
            ],
            [
                5715,
                5717
            ],
            [
                5717,
                5750
            ],
            [
                5752,
                5781
            ],
            [
                5783,
                5828
            ],
            [
                5828,
                5850
            ],
            [
                5854,
                5858
            ],
            [
                5976,
                5990
            ],
            [
                6002,
                6006
            ],
            [
                5991,
                5996
            ],
            [
                6077,
                6079
            ],
            [
                6079,
                6092
            ],
            [
                6099,
                6146
            ],
            [
                6150,
                6203
            ],
            [
                6261,
                6288
            ],
            [
                6347,
                6365
            ],
            [
                6365,
                6366
            ],
            [
                6367,
                6422
            ],
            [
                6423,
                6455
            ],
            [
                6455,
                6459
            ],
            [
                6461,
                6472
            ],
            [
                6474,
                6500
            ],
            [
                6548,
                6609
            ],
            [
                6617,
                6639
            ],
            [
                6639,
                6703
            ],
            [
                6714,
                6722
            ],
            [
                6722,
                6740
            ],
            [
                6752,
                6767
            ],
            [
                6844,
                6846
            ],
            [
                6773,
                6783
            ],
            [
                6853,
                6874
            ],
            [
                6874,
                6880
            ],
            [
                6911,
                6923
            ],
            [
                6801,
                6804
            ],
            [
                6995,
                6997
            ],
            [
                6997,
                7020
            ],
            [
                7056,
                7058
            ],
            [
                7059,
                7087
            ],
            [
                7090,
                7100
            ],
            [
                7101,
                7117
            ],
            [
                7123,
                7131
            ],
            [
                7139,
                7155
            ],
            [
                7232,
                7253
            ],
            [
                7253,
                7300
            ],
            [
                7300,
                7356
            ],
            [
                7359,
                7470
            ],
            [
                7470,
                7521
            ],
            [
                7535,
                7548
            ],
            [
                7548,
                7611
            ],
            [
                7613,
                7628
            ],
            [
                7664,
                7667
            ],
            [
                7633,
                7637
            ],
            [
                7699,
                7701
            ],
            [
                7745,
                7762
            ],
            [
                7715,
                7719
            ],
            [
                7767,
                7810
            ],
            [
                7815,
                7824
            ],
            [
                7836,
                7909
            ],
            [
                7909,
                7964
            ],
            [
                8029,
                8039
            ],
            [
                8010,
                8014
            ],
            [
                8039,
                8041
            ],
            [
                8041,
                8120
            ],
            [
                8121,
                8171
            ],
            [
                8182,
                8247
            ],
            [
                8249,
                8275
            ],
            [
                8281,
                8340
            ],
            [
                8384,
                8386
            ],
            [
                8386,
                8428
            ],
            [
                8429,
                8497
            ],
            [
                8503,
                8572
            ],
            [
                8621,
                8623
            ],
            [
                8624,
                8634
            ],
            [
                8634,
                8656
            ],
            [
                8697,
                8725
            ],
            [
                8725,
                8727
            ],
            [
                8731,
                8745
            ],
            [
                8748,
                8838
            ],
            [
                8839,
                8855
            ],
            [
                8855,
                8859
            ],
            [
                8871,
                8907
            ],
            [
                8907,
                8921
            ],
            [
                8922,
                8936
            ],
            [
                8984,
                8986
            ],
            [
                8986,
                9036
            ],
            [
                9036,
                9061
            ],
            [
                9065,
                9072
            ],
            [
                9072,
                9091
            ],
            [
                9152,
                9188
            ],
            [
                9188,
                9252
            ],
            [
                9256,
                9268
            ],
            [
                9312,
                9321
            ],
            [
                9329,
                9336
            ],
            [
                9342,
                9359
            ],
            [
                9401,
                9453
            ],
            [
                9456,
                9468
            ],
            [
                9483,
                9547
            ],
            [
                9596,
                9598
            ],
            [
                9599,
                9672
            ],
            [
                9675,
                9695
            ],
            [
                9700,
                9705
            ],
            [
                9723,
                9743
            ],
            [
                9749,
                9773
            ],
            [
                9794,
                9808
            ],
            [
                9808,
                9827
            ],
            [
                9839,
                9843
            ],
            [
                9846,
                9858
            ],
            [
                9861,
                9876
            ],
            [
                9883,
                9894
            ],
            [
                9903,
                9915
            ],
            [
                9925,
                9956
            ],
            [
                10018,
                10080
            ],
            [
                10080,
                10140
            ],
            [
                10140,
                10145
            ],
            [
                10323,
                10326
            ],
            [
                10198,
                10208
            ],
            [
                10244,
                10256
            ],
            [
                10269,
                10301
            ],
            [
                10333,
                10382
            ],
            [
                10426,
                10445
            ],
            [
                10504,
                10509
            ],
            [
                10457,
                10464
            ],
            [
                10183,
                10185
            ],
            [
                10584,
                10603
            ],
            [
                10612,
                10619
            ],
            [
                10624,
                10693
            ],
            [
                10696,
                10709
            ],
            [
                10796,
                10797
            ],
            [
                11159,
                11179
            ],
            [
                11182,
                11204
            ],
            [
                11253,
                11255
            ],
            [
                11255,
                11258
            ],
            [
                11270,
                11280
            ],
            [
                11281,
                11285
            ],
            [
                11289,
                11350
            ],
            [
                11353,
                11370
            ],
            [
                11371,
                11397
            ],
            [
                11422,
                11445
            ],
            [
                11455,
                11475
            ],
            [
                11475,
                11532
            ],
            [
                11593,
                11600
            ],
            [
                11608,
                11626
            ],
            [
                11706,
                11708
            ],
            [
                12266,
                12306
            ],
            [
                12307,
                12338
            ],
            [
                12350,
                12368
            ],
            [
                12368,
                12432
            ],
            [
                12442,
                12444
            ],
            [
                12463,
                12466
            ],
            [
                12492,
                12541
            ],
            [
                12551,
                12613
            ],
            [
                12628,
                12630
            ],
            [
                12630,
                12742
            ],
            [
                12754,
                12760
            ],
            [
                12775,
                12777
            ],
            [
                12778,
                12821
            ],
            [
                12821,
                12879
            ],
            [
                12886,
                12898
            ],
            [
                12908,
                12935
            ],
            [
                12938,
                12960
            ],
            [
                12962,
                12965
            ],
            [
                13044,
                13174
            ],
            [
                13042,
                13043
            ],
            [
                13176,
                13186
            ],
            [
                13189,
                13199
            ],
            [
                13202,
                13257
            ],
            [
                13277,
                13335
            ],
            [
                13350,
                13358
            ],
            [
                13392,
                13416
            ],
            [
                13420,
                13434
            ],
            [
                13444,
                13449
            ],
            [
                13449,
                13576
            ],
            [
                13576,
                13593
            ],
            [
                13601,
                13629
            ],
            [
                13642,
                13659
            ],
            [
                13661,
                13680
            ],
            [
                13660,
                13661
            ],
            [
                13692,
                13704
            ],
            [
                13704,
                13730
            ],
            [
                13734,
                13749
            ],
            [
                13749,
                13753
            ],
            [
                13761,
                13802
            ],
            [
                13901,
                13909
            ],
            [
                13838,
                13847
            ],
            [
                13882,
                13900
            ],
            [
                13866,
                13868
            ],
            [
                13910,
                13937
            ],
            [
                13941,
                13965
            ],
            [
                13968,
                13985
            ],
            [
                13985,
                14007
            ],
            [
                14019,
                14021
            ],
            [
                14022,
                14051
            ],
            [
                14057,
                14083
            ],
            [
                14083,
                14165
            ],
            [
                14167,
                14169
            ],
            [
                14188,
                14225
            ],
            [
                14267,
                14306
            ],
            [
                14308,
                14318
            ],
            [
                14329,
                14434
            ],
            [
                14482,
                14485
            ],
            [
                14464,
                14469
            ],
            [
                14494,
                14562
            ],
            [
                14562,
                14588
            ],
            [
                14616,
                14689
            ],
            [
                14765,
                14767
            ],
            [
                14772,
                14776
            ],
            [
                14779,
                14787
            ],
            [
                14816,
                14941
            ],
            [
                14945,
                14954
            ],
            [
                14970,
                15020
            ],
            [
                15022,
                15047
            ],
            [
                15057,
                15069
            ],
            [
                15069,
                15087
            ],
            [
                15116,
                15145
            ],
            [
                15147,
                15165
            ],
            [
                15177,
                15214
            ],
            [
                15216,
                15261
            ],
            [
                15272,
                15296
            ],
            [
                15298,
                15330
            ],
            [
                15373,
                15379
            ],
            [
                15356,
                15365
            ],
            [
                15381,
                15442
            ],
            [
                15442,
                15482
            ],
            [
                15482,
                15487
            ],
            [
                15490,
                15556
            ],
            [
                15556,
                15625
            ],
            [
                15649,
                15679
            ],
            [
                15680,
                15696
            ],
            [
                15696,
                15746
            ],
            [
                15746,
                15842
            ],
            [
                15895,
                15982
            ],
            [
                15990,
                15994
            ],
            [
                15997,
                16073
            ],
            [
                16141,
                16147
            ],
            [
                16150,
                16169
            ],
            [
                16073,
                16074
            ],
            [
                16172,
                16176
            ],
            [
                16185,
                16189
            ],
            [
                16192,
                16244
            ],
            [
                16279,
                16281
            ],
            [
                16282,
                16292
            ],
            [
                16294,
                16318
            ],
            [
                16318,
                16333
            ],
            [
                16333,
                16351
            ],
            [
                16387,
                16409
            ],
            [
                16418,
                16432
            ],
            [
                16438,
                16443
            ],
            [
                16453,
                16483
            ],
            [
                16484,
                16511
            ],
            [
                16520,
                16549
            ],
            [
                16551,
                16555
            ],
            [
                16555,
                16557
            ],
            [
                16558,
                16565
            ],
            [
                16570,
                16607
            ],
            [
                16607,
                16657
            ],
            [
                16661,
                16664
            ],
            [
                16677,
                16686
            ],
            [
                16671,
                16675
            ],
            [
                16686,
                16746
            ],
            [
                16746,
                16754
            ],
            [
                16781,
                16794
            ],
            [
                16800,
                16814
            ],
            [
                16834,
                16864
            ],
            [
                16875,
                16908
            ],
            [
                16910,
                16925
            ],
            [
                16926,
                16927
            ],
            [
                16933,
                16938
            ],
            [
                16947,
                16949
            ],
            [
                16951,
                16954
            ],
            [
                16960,
                16973
            ],
            [
                17059,
                17063
            ],
            [
                17064,
                17096
            ],
            [
                17100,
                17112
            ],
            [
                17115,
                17155
            ],
            [
                17157,
                17185
            ],
            [
                17188,
                17197
            ],
            [
                17215,
                17217
            ],
            [
                17217,
                17243
            ],
            [
                17251,
                17270
            ],
            [
                17271,
                17414
            ],
            [
                17414,
                17555
            ],
            [
                17574,
                17587
            ],
            [
                17590,
                17606
            ],
            [
                17608,
                17629
            ],
            [
                17632,
                17659
            ],
            [
                17676,
                17820
            ],
            [
                17821,
                17946
            ],
            [
                17955,
                17956
            ],
            [
                17990,
                18060
            ],
            [
                18062,
                18100
            ],
            [
                18189,
                18197
            ],
            [
                18198,
                18212
            ],
            [
                18224,
                18226
            ],
            [
                18226,
                18285
            ],
            [
                18285,
                18329
            ],
            [
                18332,
                18364
            ],
            [
                18364,
                18398
            ],
            [
                18398,
                18410
            ],
            [
                18424,
                18432
            ],
            [
                18437,
                18447
            ],
            [
                18462,
                18490
            ],
            [
                18497,
                18634
            ],
            [
                18634,
                18714
            ],
            [
                18714,
                18759
            ],
            [
                18760,
                18847
            ],
            [
                18899,
                18901
            ],
            [
                18901,
                18983
            ],
            [
                19008,
                19060
            ],
            [
                19249,
                19356
            ],
            [
                19369,
                19404
            ],
            [
                19404,
                19417
            ],
            [
                19447,
                19448
            ],
            [
                19464,
                19506
            ],
            [
                19570,
                19571
            ],
            [
                19572,
                19599
            ],
            [
                19619,
                19671
            ],
            [
                19685,
                19692
            ],
            [
                19725,
                19801
            ],
            [
                19801,
                19811
            ],
            [
                19830,
                19859
            ],
            [
                19865,
                19886
            ],
            [
                19891,
                19906
            ],
            [
                19909,
                19919
            ],
            [
                19930,
                19932
            ],
            [
                19933,
                19954
            ],
            [
                19995,
                20001
            ],
            [
                20023,
                20052
            ],
            [
                19993,
                19994
            ],
            [
                20054,
                20084
            ],
            [
                20093,
                20104
            ],
            [
                20090,
                20092
            ],
            [
                19964,
                19965
            ],
            [
                20144,
                20151
            ],
            [
                20186,
                20188
            ],
            [
                20188,
                20210
            ],
            [
                20210,
                20244
            ],
            [
                20276,
                20279
            ],
            [
                20250,
                20261
            ],
            [
                20319,
                20397
            ],
            [
                20397,
                20462
            ],
            [
                20484,
                20496
            ],
            [
                20510,
                20517
            ],
            [
                20517,
                20521
            ],
            [
                20532,
                20586
            ],
            [
                20587,
                20657
            ],
            [
                20662,
                20701
            ],
            [
                20718,
                20760
            ],
            [
                20778,
                20813
            ],
            [
                20815,
                20835
            ],
            [
                20837,
                20916
            ],
            [
                20916,
                20934
            ]
        ],
        "row_chars": [
            [
                0,
                113
            ],
            [
                113,
                248
            ],
            [
                248,
                263
            ],
            [
                263,
                283
            ],
            [
                283,
                406
            ],
            [
                406,
                585
            ],
            [
                585,
                616
            ],
            [
                616,
                717
            ],
            [
                717,
                748
            ],
            [
                748,
                808
            ],
            [
                808,
                904
            ],
            [
                904,
                910
            ],
            [
                910,
                1124
            ],
            [
                1124,
                1271
            ],
            [
                1271,
                1426
            ],
            [
                1426,
                1454
            ],
            [
                1454,
                1458
            ],
            [
                1458,
                1482
            ],
            [
                1482,
                1534
            ],
            [
                1534,
                1568
            ],
            [
                1568,
                1628
            ],
            [
                1628,
                1673
            ],
            [
                1673,
                1744
            ],
            [
                1744,
                1749
            ],
            [
                1749,
                1954
            ],
            [
                1954,
                2034
            ],
            [
                2034,
                2122
            ],
            [
                2122,
                2322
            ],
            [
                2322,
                2399
            ],
            [
                2399,
                2593
            ],
            [
                2593,
                2808
            ],
            [
                2808,
                2878
            ],
            [
                2878,
                2908
            ],
            [
                2908,
                2955
            ],
            [
                2955,
                3018
            ],
            [
                3018,
                3059
            ],
            [
                3059,
                3272
            ],
            [
                3272,
                3297
            ],
            [
                3297,
                3496
            ],
            [
                3496,
                3582
            ],
            [
                3582,
                3676
            ],
            [
                3676,
                3930
            ],
            [
                3930,
                3993
            ],
            [
                3993,
                4065
            ],
            [
                4065,
                4218
            ],
            [
                4218,
                4298
            ],
            [
                4298,
                4338
            ],
            [
                4338,
                4377
            ],
            [
                4377,
                4507
            ],
            [
                4507,
                4550
            ],
            [
                4550,
                4581
            ],
            [
                4581,
                4624
            ],
            [
                4624,
                4688
            ],
            [
                4688,
                4752
            ],
            [
                4752,
                4816
            ],
            [
                4816,
                4942
            ],
            [
                4942,
                5111
            ],
            [
                5111,
                5308
            ],
            [
                5308,
                5485
            ],
            [
                5485,
                5551
            ],
            [
                5551,
                5668
            ],
            [
                5668,
                5717
            ],
            [
                5717,
                5828
            ],
            [
                5828,
                5853
            ],
            [
                5853,
                5858
            ],
            [
                5858,
                5968
            ],
            [
                5968,
                6079
            ],
            [
                6079,
                6149
            ],
            [
                6149,
                6203
            ],
            [
                6203,
                6261
            ],
            [
                6261,
                6291
            ],
            [
                6291,
                6347
            ],
            [
                6347,
                6455
            ],
            [
                6455,
                6502
            ],
            [
                6502,
                6548
            ],
            [
                6548,
                6639
            ],
            [
                6639,
                6722
            ],
            [
                6722,
                6997
            ],
            [
                6997,
                7058
            ],
            [
                7058,
                7100
            ],
            [
                7100,
                7231
            ],
            [
                7231,
                7253
            ],
            [
                7253,
                7300
            ],
            [
                7300,
                7359
            ],
            [
                7359,
                7470
            ],
            [
                7470,
                7548
            ],
            [
                7548,
                7701
            ],
            [
                7701,
                7909
            ],
            [
                7909,
                8041
            ],
            [
                8041,
                8121
            ],
            [
                8121,
                8386
            ],
            [
                8386,
                8428
            ],
            [
                8428,
                8500
            ],
            [
                8500,
                8623
            ],
            [
                8623,
                8634
            ],
            [
                8634,
                8656
            ],
            [
                8656,
                8725
            ],
            [
                8725,
                8748
            ],
            [
                8748,
                8838
            ],
            [
                8838,
                8855
            ],
            [
                8855,
                8907
            ],
            [
                8907,
                8986
            ],
            [
                8986,
                9036
            ],
            [
                9036,
                9064
            ],
            [
                9064,
                9072
            ],
            [
                9072,
                9091
            ],
            [
                9091,
                9152
            ],
            [
                9152,
                9188
            ],
            [
                9188,
                9255
            ],
            [
                9255,
                9359
            ],
            [
                9359,
                9401
            ],
            [
                9401,
                9456
            ],
            [
                9456,
                9598
            ],
            [
                9598,
                9695
            ],
            [
                9695,
                9808
            ],
            [
                9808,
                9846
            ],
            [
                9846,
                10080
            ],
            [
                10080,
                10140
            ],
            [
                10140,
                10619
            ],
            [
                10619,
                10798
            ],
            [
                10798,
                10821
            ],
            [
                10821,
                11059
            ],
            [
                11059,
                11152
            ],
            [
                11152,
                11255
            ],
            [
                11255,
                11288
            ],
            [
                11288,
                11370
            ],
            [
                11370,
                11475
            ],
            [
                11475,
                11593
            ],
            [
                11593,
                11708
            ],
            [
                11708,
                12078
            ],
            [
                12078,
                12203
            ],
            [
                12203,
                12257
            ],
            [
                12257,
                12368
            ],
            [
                12368,
                12630
            ],
            [
                12630,
                12777
            ],
            [
                12777,
                12821
            ],
            [
                12821,
                13189
            ],
            [
                13189,
                13268
            ],
            [
                13268,
                13358
            ],
            [
                13358,
                13449
            ],
            [
                13449,
                13576
            ],
            [
                13576,
                13684
            ],
            [
                13684,
                13704
            ],
            [
                13704,
                13733
            ],
            [
                13733,
                13749
            ],
            [
                13749,
                13940
            ],
            [
                13940,
                13985
            ],
            [
                13985,
                14021
            ],
            [
                14021,
                14083
            ],
            [
                14083,
                14435
            ],
            [
                14435,
                14562
            ],
            [
                14562,
                14767
            ],
            [
                14767,
                15069
            ],
            [
                15069,
                15442
            ],
            [
                15442,
                15482
            ],
            [
                15482,
                15490
            ],
            [
                15490,
                15556
            ],
            [
                15556,
                15679
            ],
            [
                15679,
                15696
            ],
            [
                15696,
                15746
            ],
            [
                15746,
                15842
            ],
            [
                15842,
                15895
            ],
            [
                15895,
                15985
            ],
            [
                15985,
                16192
            ],
            [
                16192,
                16281
            ],
            [
                16281,
                16294
            ],
            [
                16294,
                16318
            ],
            [
                16318,
                16333
            ],
            [
                16333,
                16351
            ],
            [
                16351,
                16484
            ],
            [
                16484,
                16550
            ],
            [
                16550,
                16555
            ],
            [
                16555,
                16607
            ],
            [
                16607,
                16660
            ],
            [
                16660,
                16746
            ],
            [
                16746,
                16800
            ],
            [
                16800,
                16925
            ],
            [
                16925,
                16973
            ],
            [
                16973,
                17059
            ],
            [
                17059,
                17188
            ],
            [
                17188,
                17217
            ],
            [
                17217,
                17270
            ],
            [
                17270,
                17414
            ],
            [
                17414,
                17573
            ],
            [
                17573,
                17632
            ],
            [
                17632,
                17820
            ],
            [
                17820,
                18226
            ],
            [
                18226,
                18285
            ],
            [
                18285,
                18332
            ],
            [
                18332,
                18364
            ],
            [
                18364,
                18398
            ],
            [
                18398,
                18634
            ],
            [
                18634,
                18714
            ],
            [
                18714,
                18760
            ],
            [
                18760,
                18901
            ],
            [
                18901,
                19060
            ],
            [
                19060,
                19249
            ],
            [
                19249,
                19404
            ],
            [
                19404,
                19572
            ],
            [
                19572,
                19801
            ],
            [
                19801,
                19859
            ],
            [
                19859,
                19932
            ],
            [
                19932,
                19957
            ],
            [
                19957,
                20188
            ],
            [
                20188,
                20210
            ],
            [
                20210,
                20397
            ],
            [
                20397,
                20517
            ],
            [
                20517,
                20587
            ],
            [
                20587,
                20657
            ],
            [
                20657,
                20760
            ],
            [
                20760,
                20916
            ],
            [
                20916,
                20946
            ]
        ]
    },
    "abridged": {
        "text": "Margaret had been thinking of him only a moment before. Her face brightened as she put down her board, and went forward to shake hands with him.\n'Mamma and I want to ask you about Edith; I am so obliged to you for coming,' she said.\n'Did not I say that I should?' asked he, in a low tone.\n'But I heard of you far away in the Highlands.'\n'Oh!' said he, more lightly, 'our young couple were playing such foolish pranks, running all sorts of risks, climbing this mountain, sailing on that lake, that I really thought they needed a mentor to take care of them. They were quite beyond my uncle's management, and kept the old gentleman in a panic. I thought it my duty not to leave them till I had seen them safely embarked at Plymouth.'\n'Edith never mentioned that. To be sure, she has written in such a hurry lately. Did they really sail on Tuesday?'\n'Yes. Edith gave me all sorts of messages for you. I believe I have a little note somewhere; here it is.'\n'Thank you,' exclaimed Margaret; and then, wishing to read it alone and unwatched, she made the excuse of going to tell her mother that Mr. Lennox was there.\nWhen she had left him, he began to scrutinise the little drawing-room. It was looking its best in the streaming light of the morning sun. The window was open, and clustering roses and honeysuckle came peeping round the corner; the small lawn was gorgeous with verbenas and bright geraniums. But the very brightness outside made the colours within seem poor and faded. The room was smaller and shabbier than he had expected as a background for Margaret, herself so queenly.\nHe took up one of the books lying on the table; it was the Paradiso of Dante. By it lay a dictionary, and some words copied out in Margaret's hand-writing. They made a dull list, but somehow he liked looking at them. He put them down with a sigh.\nMargaret meanwhile had found her mother. It was one of Mrs. Hale's fitful days, when everything was a difficulty; including Mr. Lennox's visit, although secretly she felt complimented by his calling.\n'It is most unfortunate! We have nothing but cold meat, and yet, of course, we must ask him to dinner. And your papa is in such low spirits this morning - I don't know why. I went into the study just now, and he had his face in his hands. I told him I was sure Helstone air did not agree with him, and he suddenly lifted up his head, and begged me not to speak a word more against Helstone, he could not bear it; if there was one place he loved on earth it was Helstone. But I am sure it is the damp air.'\nMargaret felt as if a thin cold cloud had come between her and the sun. She drew her mother back to the subject of Mr. Lennox.\n'Papa likes Mr. Lennox; they got on together famously at the wedding. His coming will do papa good. And never mind dinner, dear mamma. Cold meat will do capitally for lunch.'\n'But what are we to do with him till then? It is only half-past ten.'\n'I'll ask him to go out sketching with me. That will take him out of your way, mamma. Only do come in now; he will think it strange if you don't.'\nMrs. Hale took off her black silk apron, and smoothed her face. She looked a very pretty lady-like woman, as she greeted Mr. Lennox cordially. He accepted the invitation to lunch with a glad readiness that made Mrs. Hale wish she could add something to the cold beef. He was delighted with Margaret's idea of going sketching together. She brought out her drawing materials, and the two set out in merry spirits.\n'Now, please, just stop here for a minute,' said Margaret. 'These are the cottages that haunted me so during the rainy fortnight, reproaching me for not having sketched them.'\n'Before they tumbled down. Truly, if they are to be sketched - and they are very picturesque - we had better not put it off till next year. But where shall we sit?'\n'Oh! On this beautiful tree trunk. I will put my shawl over it, and it will be a regular forest throne.'\n'With your feet in that puddle for a regal footstool! Who lives in these cottages?'\n'One is uninhabited,' said she; 'the foresters are going to take it down, as soon as the old man who lives in the other is dead, poor old fellow! Look - there he is - I must go and speak to him.'\nThe old man stood bareheaded in the sun, leaning on his stick in front of his cottage. His stiff features relaxed into a slow smile as Margaret went up to him. Mr. Lennox hastily added the two figures to his sketch - as Margaret perceived later, when they were putting away the paints. She laughed and blushed.\n'Now, I call that treacherous,' said she. 'I little thought you were drawing old Isaac and me.'\n'It was irresistible. You can't know how strong a temptation it was. I hardly dare tell you how much I shall like this sketch.'\nHe was not quite sure whether she heard this latter sentence before she went to the brook to wash her palette. She came back rather flushed, but looking perfectly unconscious. He was glad of it, for the speech had slipped from him unawares - a rare thing in his case.\nWhen they reached home, the clouds on her mother's brow had cleared under the lucky influence of a brace of carp, most opportunely presented by a neighbour. Mr. Hale had returned from his morning's round, and was waiting by the garden gate. He looked a complete gentleman in his rather threadbare coat and well-worn hat.\nMargaret was proud of her father; she had always a tender pride in seeing how favourably he impressed every stranger. Still her quick eye sought his face and found there traces of some unusual disturbance.\nMr. Hale asked to look at their sketches.\n'I think you have made the tints on the thatch too dark, have you not?' He returned Margaret's to her, and held out his hand for Mr. Lennox's.\n'No, papa! I don't think I have. It is so much darker in the rain. Is that not like, papa?' said she, peeping over his shoulder, as he looked at the figures in Mr. Lennox's drawing.\n'Yes, very like. Your way of holding yourself is capital. And it is just like poor old Isaac. What is this hanging from the branch of the tree? Not a bird's nest, surely.'\n'Oh no! that is my bonnet. I wonder if I could manage figures. There are so many people about here whom I should like to sketch.'\n'I should say you would succeed,' said Mr. Lennox. 'I think myself I have succeeded pretty well in yours.' Mr. Hale had gone into the house, while Margaret was lingering to pluck some roses.\n'A regular London girl would understand the implied meaning of that speech,' thought Mr. Lennox. 'She would look through every speech a young man made her for a compliment. But I don't believe - stay!' exclaimed he. 'Let me help you.' He gathered some velvety roses that were above her reach, and sent her in, pleased and happy, to arrange her flowers.\nThe conversation at dinner flowed on quietly and agreeably. There was the latest news of Mrs. Shaw in Italy to be exchanged; and in the unpretending simplicity of the parsonage-ways, Mr. Lennox forgot his first feeling on finding her father's living was so small.\n'Margaret, my child, you might have gathered us some pears for our dessert,' said Mr. Hale. 'There are a few brown beurres against the south wall. Run and gather us some.'\n'I propose that we adjourn into the garden, and eat them there,' said Mr. Lennox. 'Nothing is so delicious as the crisp, juicy fruit, scented by the sun. The worst is, the wasps are impudent enough to dispute it.'\nHe rose to follow Margaret outside. She made a plate for the pears out of a beetroot leaf, which threw up their colour admirably. Mr. Lennox looked more at her than at the pears; but her father, determined to make the most of the hour he had stolen from his anxiety, chose the ripest fruit, and sat down on the garden bench to enjoy it. Margaret and Mr. Lennox strolled along the little terrace-walk under the south wall, where the bees still hummed busily.\n'What a perfect life you seem to live here! I have always felt rather contemptuously towards the poets, with their \"Mine be a cot beside a hill,\" and that sort of thing: but just now I feel as if twenty years' hard study of law would be amply rewarded by one year of such an exquisite serene life as this. Such skies!' - looking up - 'such crimson and amber foliage, so perfectly motionless!' He pointed to some of the great forest trees which shut in the garden like a nest.\n'Our skies are not always so deep a blue as now. We have rain, and our leaves do fall, and get sodden: though I think Helstone is about as perfect a place as any in the world. Recollect how you scorned my description of it in Harley Street: \"a village in a tale.\"'\n'Scorned, Margaret! That is rather a hard word.'\n'Perhaps it is. Only I should have liked to have talked to you about Helstone, and you spoke disrespectfully of it as a mere village in a tale.'\n'I will never do so again,' said he, warmly. They turned the corner.\n'I could almost wish, Margaret-' He stopped and hesitated. It was so unusual for the fluent lawyer to hesitate that Margaret looked up at him in questioning wonder; but in an instant she wished herself back with her mother - her father - anywhere away from him, for she was sure he was going to say something to which she should not know what to reply.\nHer pride made her conquer her sudden agitation, which she hoped he had not perceived. Of course she could answer; and it was poor and despicable of her to shrink from hearing any speech.\n'Margaret,' said he, getting sudden possession of her hand, so that she was forced to stand still and listen, despising herself for the fluttering of her heart. 'Margaret, I wish you did not like Helstone so much - did not seem so perfectly happy here. I have been hoping to find you regretting London - and London friends - enough to make you listen more kindly' (for she was quietly, but firmly, striving to remove her hand from his grasp) 'to one who has not much to offer apart from future prospects - but who does love you, Margaret, almost in spite of himself. Margaret, have I startled you too much? Speak!'\nFor he saw her lips quivering almost as if she were going to cry. She made a strong effort to be calm; she would not speak till she had mastered her voice, and then she said:\n'I was startled. I did not know that you cared for me in that way. I have always thought of you as a friend; and, please, I would rather go on thinking of you so. I cannot answer you as you want me to do, and yet I should feel so sorry if I vexed you.'\n'Margaret,' said he, looking into her eyes, which met his with their open, straight look. 'Do you' - he was going to say, 'love anyone else?' But it seemed as if this question would be an insult. 'Forgive me. I have been too abrupt. I am punished. Only let me hope. Tell me you have never seen anyone whom you could-' Again he could not end his sentence.\nMargaret reproached herself as the cause of his distress. 'Ah! if only you had never got this fancy into your head! It was such a pleasure to think of you as a friend.'\n'But may I not hope, Margaret, that some time you will think of me as a lover? Not yet, but some time.'\nShe was silent, trying to discover the truth in her own heart, before replying. Then she said:\n'I could never think of you except as a friend. Pray, let us both forget that all this' ('disagreeable,' she was going to say, but stopped short) 'conversation has taken place.'\nHe paused. Then, in his habitual cold tone, he answered:\n'Of course, as your feelings are so decided, and as this conversation has been so evidently unpleasant to you, it had better not be remembered. That is all very fine in theory, that plan of forgetting whatever is painful, but it will be somewhat difficult for me, at least, to carry it out.'\n'You are vexed,' said she, sadly; 'yet how can I help it?'\nShe looked so truly grieved, that he struggled for a moment with his real disappointment, and then answered more cheerfully, but still with a little hardness in his tone:\n'You should make allowances for the mortification, not only of a lover, Margaret, but of a man not given to romance in general, who has been carried out of his usual habits by the force of a passion - well, we will say no more of that; but he meets only with rejection. I shall have to console myself with scorning my own folly. A struggling barrister to think of matrimony!'\nMargaret could not answer this. The whole tone of it annoyed her. It seemed to call out the points which had often repelled her; while yet he was the pleasantest man, the most sympathising friend, the person of all others who understood her best in Harley Street. She felt a tinge of contempt mingle itself with her pain at having refused him. Her beautiful lip curled in a slight disdain.\nIt was well that, having made the round of the garden, they came suddenly upon Mr. Hale. He had not yet finished the pear, which he had delicately peeled in one long strip, and which he was enjoying in a deliberate manner. Margaret felt stunned, and unable to recover her self-possession enough to join in the trivial conversation between her father and Mr. Lennox. She was grave; wondering when Mr. Lennox would go, and allow her to think.\nHe was almost as anxious to depart as she was for him to leave; but a few minutes light talking was a sacrifice which he owed to his mortified vanity, or his self-respect. He glanced at her sad and pensive face.\n'She is not so indifferent to me as she believes,' thought he. 'I do not give up hope.'\nHe had begun conversing with quiet sarcasm, speaking of life in London and the country in a mocking manner. Mr. Hale was puzzled. His visitor was a different man to the one he had seen earlier; a lighter, cleverer, more worldly man, and, as such, dissonant to Mr. Hale. It was a relief to all three when Mr. Lennox said that he must go to catch the train. They went to the house to find Mrs. Hale, and wish her good-bye.\nAt the last moment, Henry Lennox's real self broke through the crust.\n'Margaret, don't despise me; I have a heart, despite all this good-for-nothing way of talking. I believe I love you more than ever - if I do not hate you - for the disdain with which you have listened to me during this last half-hour. Good-bye, Margaret!'",
        "paragraph_chars": [
            [
                0,
                145
            ],
            [
                145,
                233
            ],
            [
                233,
                289
            ],
            [
                289,
                337
            ],
            [
                337,
                732
            ],
            [
                732,
                847
            ],
            [
                847,
                953
            ],
            [
                953,
                1111
            ],
            [
                1111,
                1584
            ],
            [
                1584,
                1831
            ],
            [
                1831,
                2031
            ],
            [
                2031,
                2537
            ],
            [
                2537,
                2664
            ],
            [
                2664,
                2839
            ],
            [
                2839,
                2909
            ],
            [
                2909,
                3056
            ],
            [
                3056,
                3468
            ],
            [
                3468,
                3644
            ],
            [
                3644,
                3809
            ],
            [
                3809,
                3914
            ],
            [
                3914,
                3998
            ],
            [
                3998,
                4194
            ],
            [
                4194,
                4505
            ],
            [
                4505,
                4601
            ],
            [
                4601,
                4729
            ],
            [
                4729,
                4997
            ],
            [
                4997,
                5318
            ],
            [
                5318,
                5524
            ],
            [
                5524,
                5566
            ],
            [
                5566,
                5709
            ],
            [
                5709,
                5891
            ],
            [
                5891,
                6063
            ],
            [
                6063,
                6193
            ],
            [
                6193,
                6384
            ],
            [
                6384,
                6737
            ],
            [
                6737,
                7001
            ],
            [
                7001,
                7173
            ],
            [
                7173,
                7387
            ],
            [
                7387,
                7845
            ],
            [
                7845,
                8321
            ],
            [
                8321,
                8586
            ],
            [
                8586,
                8635
            ],
            [
                8635,
                8780
            ],
            [
                8780,
                8849
            ],
            [
                8849,
                9202
            ],
            [
                9202,
                9390
            ],
            [
                9390,
                10005
            ],
            [
                10005,
                10180
            ],
            [
                10180,
                10433
            ],
            [
                10433,
                10788
            ],
            [
                10788,
                10957
            ],
            [
                10957,
                11061
            ],
            [
                11061,
                11156
            ],
            [
                11156,
                11334
            ],
            [
                11334,
                11391
            ],
            [
                11391,
                11683
            ],
            [
                11683,
                11742
            ],
            [
                11742,
                11913
            ],
            [
                11913,
                12289
            ],
            [
                12289,
                12679
            ],
            [
                12679,
                13120
            ],
            [
                13120,
                13332
            ],
            [
                13332,
                13420
            ],
            [
                13420,
                13841
            ],
            [
                13841,
                13911
            ],
            [
                13911,
                14166
            ]
        ],
        "segment_chars": [
            [
                0,
                56
            ],
            [
                56,
                145
            ],
            [
                145,
                233
            ],
            [
                233,
                264
            ],
            [
                264,
                289
            ],
            [
                289,
                337
            ],
            [
                337,
                343
            ],
            [
                343,
                557
            ],
            [
                557,
                642
            ],
            [
                642,
                732
            ],
            [
                732,
                761
            ],
            [
                761,
                813
            ],
            [
                813,
                847
            ],
            [
                847,
                853
            ],
            [
                853,
                898
            ],
            [
                898,
                953
            ],
            [
                953,
                1111
            ],
            [
                1111,
                1182
            ],
            [
                1182,
                1249
            ],
            [
                1249,
                1402
            ],
            [
                1402,
                1479
            ],
            [
                1479,
                1584
            ],
            [
                1584,
                1662
            ],
            [
                1662,
                1740
            ],
            [
                1740,
                1801
            ],
            [
                1801,
                1831
            ],
            [
                1831,
                1872
            ],
            [
                1872,
                2031
            ],
            [
                2031,
                2056
            ],
            [
                2056,
                2134
            ],
            [
                2134,
                2204
            ],
            [
                2204,
                2270
            ],
            [
                2270,
                2502
            ],
            [
                2502,
                2537
            ],
            [
                2537,
                2609
            ],
            [
                2609,
                2664
            ],
            [
                2664,
                2734
            ],
            [
                2734,
                2764
            ],
            [
                2764,
                2799
            ],
            [
                2799,
                2839
            ],
            [
                2839,
                2882
            ],
            [
                2882,
                2909
            ],
            [
                2909,
                2952
            ],
            [
                2952,
                2995
            ],
            [
                2995,
                3056
            ],
            [
                3056,
                3120
            ],
            [
                3120,
                3199
            ],
            [
                3199,
                3324
            ],
            [
                3324,
                3391
            ],
            [
                3391,
                3468
            ],
            [
                3468,
                3527
            ],
            [
                3527,
                3644
            ],
            [
                3644,
                3671
            ],
            [
                3671,
                3784
            ],
            [
                3784,
                3809
            ],
            [
                3809,
                3814
            ],
            [
                3814,
                3844
            ],
            [
                3844,
                3914
            ],
            [
                3914,
                3968
            ],
            [
                3968,
                3998
            ],
            [
                3998,
                4144
            ],
            [
                4144,
                4194
            ],
            [
                4194,
                4281
            ],
            [
                4281,
                4354
            ],
            [
                4354,
                4480
            ],
            [
                4480,
                4505
            ],
            [
                4505,
                4547
            ],
            [
                4547,
                4601
            ],
            [
                4601,
                4623
            ],
            [
                4623,
                4670
            ],
            [
                4670,
                4729
            ],
            [
                4729,
                4840
            ],
            [
                4840,
                4905
            ],
            [
                4905,
                4997
            ],
            [
                4997,
                5154
            ],
            [
                5154,
                5238
            ],
            [
                5238,
                5318
            ],
            [
                5318,
                5436
            ],
            [
                5436,
                5524
            ],
            [
                5524,
                5566
            ],
            [
                5566,
                5638
            ],
            [
                5638,
                5709
            ],
            [
                5709,
                5720
            ],
            [
                5720,
                5742
            ],
            [
                5742,
                5776
            ],
            [
                5776,
                5801
            ],
            [
                5801,
                5891
            ],
            [
                5891,
                5908
            ],
            [
                5908,
                5949
            ],
            [
                5949,
                5985
            ],
            [
                5985,
                6035
            ],
            [
                6035,
                6063
            ],
            [
                6063,
                6071
            ],
            [
                6071,
                6090
            ],
            [
                6090,
                6126
            ],
            [
                6126,
                6193
            ],
            [
                6193,
                6244
            ],
            [
                6244,
                6300
            ],
            [
                6300,
                6384
            ],
            [
                6384,
                6481
            ],
            [
                6481,
                6557
            ],
            [
                6557,
                6586
            ],
            [
                6586,
                6600
            ],
            [
                6600,
                6619
            ],
            [
                6619,
                6737
            ],
            [
                6737,
                6797
            ],
            [
                6797,
                7001
            ],
            [
                7001,
                7093
            ],
            [
                7093,
                7148
            ],
            [
                7148,
                7173
            ],
            [
                7173,
                7255
            ],
            [
                7255,
                7327
            ],
            [
                7327,
                7387
            ],
            [
                7387,
                7423
            ],
            [
                7423,
                7517
            ],
            [
                7517,
                7724
            ],
            [
                7724,
                7845
            ],
            [
                7845,
                7889
            ],
            [
                7889,
                8151
            ],
            [
                8151,
                8164
            ],
            [
                8164,
                8238
            ],
            [
                8238,
                8321
            ],
            [
                8321,
                8370
            ],
            [
                8370,
                8497
            ],
            [
                8497,
                8586
            ],
            [
                8586,
                8606
            ],
            [
                8606,
                8635
            ],
            [
                8635,
                8651
            ],
            [
                8651,
                8780
            ],
            [
                8780,
                8825
            ],
            [
                8825,
                8849
            ],
            [
                8849,
                8908
            ],
            [
                8908,
                9202
            ],
            [
                9202,
                9289
            ],
            [
                9289,
                9390
            ],
            [
                9390,
                9551
            ],
            [
                9551,
                9643
            ],
            [
                9643,
                9957
            ],
            [
                9957,
                9997
            ],
            [
                9997,
                10005
            ],
            [
                10005,
                10071
            ],
            [
                10071,
                10180
            ],
            [
                10180,
                10197
            ],
            [
                10197,
                10247
            ],
            [
                10247,
                10343
            ],
            [
                10343,
                10433
            ],
            [
                10433,
                10523
            ],
            [
                10523,
                10575
            ],
            [
                10575,
                10629
            ],
            [
                10629,
                10642
            ],
            [
                10642,
                10666
            ],
            [
                10666,
                10681
            ],
            [
                10681,
                10699
            ],
            [
                10699,
                10788
            ],
            [
                10788,
                10846
            ],
            [
                10846,
                10851
            ],
            [
                10851,
                10904
            ],
            [
                10904,
                10957
            ],
            [
                10957,
                11036
            ],
            [
                11036,
                11061
            ],
            [
                11061,
                11141
            ],
            [
                11141,
                11156
            ],
            [
                11156,
                11204
            ],
            [
                11204,
                11334
            ],
            [
                11334,
                11345
            ],
            [
                11345,
                11391
            ],
            [
                11391,
                11535
            ],
            [
                11535,
                11683
            ],
            [
                11683,
                11742
            ],
            [
                11742,
                11913
            ],
            [
                11913,
                12183
            ],
            [
                12183,
                12242
            ],
            [
                12242,
                12289
            ],
            [
                12289,
                12321
            ],
            [
                12321,
                12355
            ],
            [
                12355,
                12553
            ],
            [
                12553,
                12633
            ],
            [
                12633,
                12679
            ],
            [
                12679,
                12768
            ],
            [
                12768,
                12902
            ],
            [
                12902,
                13045
            ],
            [
                13045,
                13120
            ],
            [
                13120,
                13292
            ],
            [
                13292,
                13332
            ],
            [
                13332,
                13395
            ],
            [
                13395,
                13420
            ],
            [
                13420,
                13528
            ],
            [
                13528,
                13550
            ],
            [
                13550,
                13690
            ],
            [
                13690,
                13776
            ],
            [
                13776,
                13841
            ],
            [
                13841,
                13911
            ],
            [
                13911,
                14006
            ],
            [
                14006,
                14146
            ],
            [
                14146,
                14166
            ]
        ],
        "overlap_chars": [
            [
                0,
                54
            ],
            [
                54,
                56
            ],
            [
                60,
                64
            ],
            [
                76,
                144
            ],
            [
                147,
                173
            ],
            [
                174,
                194
            ],
            [
                195,
                220
            ],
            [
                238,
                261
            ],
            [
                264,
                278
            ],
            [
                283,
                287
            ],
            [
                287,
                289
            ],
            [
                290,
                308
            ],
            [
                309,
                334
            ],
            [
                338,
                340
            ],
            [
                343,
                365
            ],
            [
                367,
                557
            ],
            [
                557,
                640
            ],
            [
                640,
                642
            ],
            [
                642,
                729
            ],
            [
                733,
                744
            ],
            [
                755,
                761
            ],
            [
                761,
                813
            ],
            [
                813,
                844
            ],
            [
                851,
                853
            ],
            [
                853,
                898
            ],
            [
                898,
                923
            ],
            [
                924,
                939
            ],
            [
                940,
                950
            ],
            [
                960,
                963
            ],
            [
                966,
                995
            ],
            [
                996,
                1083
            ],
            [
                1084,
                1111
            ],
            [
                1111,
                1128
            ],
            [
                1129,
                1132
            ],
            [
                1132,
                1142
            ],
            [
                1143,
                1145
            ],
            [
                1146,
                1153
            ],
            [
                1157,
                1160
            ],
            [
                1176,
                1180
            ],
            [
                1180,
                1182
            ],
            [
                1185,
                1249
            ],
            [
                1249,
                1252
            ],
            [
                1253,
                1259
            ],
            [
                1260,
                1263
            ],
            [
                1268,
                1294
            ],
            [
                1295,
                1383
            ],
            [
                1384,
                1390
            ],
            [
                1391,
                1400
            ],
            [
                1400,
                1402
            ],
            [
                1402,
                1479
            ],
            [
                1479,
                1482
            ],
            [
                1488,
                1533
            ],
            [
                1534,
                1536
            ],
            [
                1550,
                1583
            ],
            [
                1584,
                1642
            ],
            [
                1652,
                1660
            ],
            [
                1662,
                1725
            ],
            [
                1738,
                1740
            ],
            [
                1740,
                1744
            ],
            [
                1750,
                1761
            ],
            [
                1761,
                1801
            ],
            [
                1801,
                1831
            ],
            [
                1831,
                1872
            ],
            [
                1872,
                1943
            ],
            [
                1955,
                1967
            ],
            [
                1973,
                2021
            ],
            [
                2029,
                2031
            ],
            [
                2032,
                2056
            ],
            [
                2056,
                2058
            ],
            [
                2064,
                2086
            ],
            [
                2087,
                2132
            ],
            [
                2132,
                2134
            ],
            [
                2134,
                2183
            ],
            [
                2186,
                2198
            ],
            [
                2202,
                2204
            ],
            [
                2204,
                2255
            ],
            [
                2259,
                2270
            ],
            [
                2270,
                2327
            ],
            [
                2327,
                2502
            ],
            [
                2502,
                2515
            ],
            [
                2516,
                2530
            ],
            [
                2531,
                2534
            ],
            [
                2537,
                2609
            ],
            [
                2609,
                2612
            ],
            [
                2618,
                2628
            ],
            [
                2629,
                2636
            ],
            [
                2652,
                2664
            ],
            [
                2665,
                2732
            ],
            [
                2732,
                2734
            ],
            [
                2734,
                2764
            ],
            [
                2764,
                2778
            ],
            [
                2779,
                2799
            ],
            [
                2799,
                2830
            ],
            [
                2831,
                2836
            ],
            [
                2840,
                2882
            ],
            [
                2882,
                2906
            ],
            [
                2910,
                2952
            ],
            [
                2952,
                2995
            ],
            [
                2995,
                3032
            ],
            [
                3033,
                3053
            ],
            [
                3056,
                3120
            ],
            [
                3120,
                3187
            ],
            [
                3188,
                3192
            ],
            [
                3197,
                3199
            ],
            [
                3199,
                3201
            ],
            [
                3202,
                3225
            ],
            [
                3226,
                3228
            ],
            [
                3235,
                3324
            ],
            [
                3324,
                3330
            ],
            [
                3331,
                3370
            ],
            [
                3371,
                3389
            ],
            [
                3389,
                3391
            ],
            [
                3395,
                3428
            ],
            [
                3428,
                3429
            ],
            [
                3430,
                3433
            ],
            [
                3434,
                3452
            ],
            [
                3459,
                3466
            ],
            [
                3466,
                3468
            ],
            [
                3469,
                3509
            ],
            [
                3512,
                3527
            ],
            [
                3534,
                3641
            ],
            [
                3645,
                3669
            ],
            [
                3669,
                3671
            ],
            [
                3671,
                3704
            ],
            [
                3707,
                3736
            ],
            [
                3739,
                3784
            ],
            [
                3784,
                3806
            ],
            [
                3810,
                3814
            ],
            [
                3817,
                3831
            ],
            [
                3832,
                3836
            ],
            [
                3837,
                3842
            ],
            [
                3842,
                3844
            ],
            [
                3844,
                3857
            ],
            [
                3864,
                3911
            ],
            [
                3915,
                3968
            ],
            [
                3968,
                3995
            ],
            [
                3999,
                4017
            ],
            [
                4028,
                4029
            ],
            [
                4031,
                4086
            ],
            [
                4112,
                4144
            ],
            [
                4144,
                4148
            ],
            [
                4151,
                4162
            ],
            [
                4165,
                4191
            ],
            [
                4194,
                4255
            ],
            [
                4259,
                4281
            ],
            [
                4281,
                4345
            ],
            [
                4346,
                4354
            ],
            [
                4354,
                4372
            ],
            [
                4379,
                4394
            ],
            [
                4395,
                4397
            ],
            [
                4398,
                4408
            ],
            [
                4411,
                4432
            ],
            [
                4438,
                4444
            ],
            [
                4455,
                4467
            ],
            [
                4468,
                4471
            ],
            [
                4478,
                4480
            ],
            [
                4480,
                4503
            ],
            [
                4503,
                4505
            ],
            [
                4506,
                4534
            ],
            [
                4537,
                4547
            ],
            [
                4548,
                4564
            ],
            [
                4565,
                4573
            ],
            [
                4582,
                4598
            ],
            [
                4602,
                4623
            ],
            [
                4623,
                4670
            ],
            [
                4670,
                4726
            ],
            [
                4729,
                4840
            ],
            [
                4840,
                4891
            ],
            [
                4892,
                4905
            ],
            [
                4905,
                4968
            ],
            [
                4971,
                4986
            ],
            [
                4987,
                4990
            ],
            [
                4991,
                4995
            ],
            [
                4995,
                4997
            ],
            [
                4997,
                5014
            ],
            [
                5015,
                5019
            ],
            [
                5021,
                5064
            ],
            [
                5065,
                5074
            ],
            [
                5081,
                5154
            ],
            [
                5154,
                5209
            ],
            [
                5221,
                5231
            ],
            [
                5232,
                5236
            ],
            [
                5236,
                5238
            ],
            [
                5238,
                5317
            ],
            [
                5318,
                5368
            ],
            [
                5369,
                5434
            ],
            [
                5436,
                5462
            ],
            [
                5463,
                5522
            ],
            [
                5522,
                5524
            ],
            [
                5524,
                5566
            ],
            [
                5567,
                5635
            ],
            [
                5638,
                5707
            ],
            [
                5707,
                5709
            ],
            [
                5710,
                5720
            ],
            [
                5720,
                5742
            ],
            [
                5748,
                5776
            ],
            [
                5776,
                5778
            ],
            [
                5784,
                5798
            ],
            [
                5801,
                5891
            ],
            [
                5892,
                5908
            ],
            [
                5908,
                5912
            ],
            [
                5913,
                5949
            ],
            [
                5949,
                5963
            ],
            [
                5969,
                5983
            ],
            [
                5983,
                5985
            ],
            [
                5985,
                6035
            ],
            [
                6035,
                6060
            ],
            [
                6064,
                6071
            ],
            [
                6071,
                6090
            ],
            [
                6090,
                6126
            ],
            [
                6126,
                6190
            ],
            [
                6194,
                6206
            ],
            [
                6207,
                6216
            ],
            [
                6217,
                6224
            ],
            [
                6227,
                6244
            ],
            [
                6245,
                6297
            ],
            [
                6300,
                6312
            ],
            [
                6318,
                6382
            ],
            [
                6382,
                6384
            ],
            [
                6385,
                6458
            ],
            [
                6461,
                6481
            ],
            [
                6486,
                6491
            ],
            [
                6497,
                6517
            ],
            [
                6518,
                6542
            ],
            [
                6543,
                6557
            ],
            [
                6557,
                6576
            ],
            [
                6579,
                6583
            ],
            [
                6586,
                6598
            ],
            [
                6601,
                6616
            ],
            [
                6619,
                6630
            ],
            [
                6631,
                6643
            ],
            [
                6644,
                6675
            ],
            [
                6675,
                6737
            ],
            [
                6737,
                6797
            ],
            [
                6797,
                6802
            ],
            [
                6803,
                6806
            ],
            [
                6807,
                6817
            ],
            [
                6823,
                6835
            ],
            [
                6836,
                6868
            ],
            [
                6869,
                6918
            ],
            [
                6918,
                6937
            ],
            [
                6942,
                6947
            ],
            [
                6948,
                6955
            ],
            [
                6956,
                6958
            ],
            [
                6967,
                6986
            ],
            [
                6994,
                7001
            ],
            [
                7006,
                7075
            ],
            [
                7078,
                7091
            ],
            [
                7091,
                7092
            ],
            [
                7100,
                7120
            ],
            [
                7124,
                7146
            ],
            [
                7146,
                7148
            ],
            [
                7148,
                7151
            ],
            [
                7152,
                7162
            ],
            [
                7166,
                7170
            ],
            [
                7174,
                7235
            ],
            [
                7238,
                7255
            ],
            [
                7256,
                7282
            ],
            [
                7283,
                7306
            ],
            [
                7307,
                7327
            ],
            [
                7327,
                7384
            ],
            [
                7387,
                7394
            ],
            [
                7395,
                7413
            ],
            [
                7421,
                7423
            ],
            [
                7427,
                7467
            ],
            [
                7467,
                7498
            ],
            [
                7499,
                7517
            ],
            [
                7517,
                7581
            ],
            [
                7593,
                7595
            ],
            [
                7601,
                7604
            ],
            [
                7610,
                7659
            ],
            [
                7660,
                7722
            ],
            [
                7722,
                7724
            ],
            [
                7724,
                7836
            ],
            [
                7837,
                7843
            ],
            [
                7843,
                7845
            ],
            [
                7846,
                7889
            ],
            [
                7889,
                7947
            ],
            [
                7947,
                7959
            ],
            [
                7961,
                7988
            ],
            [
                7991,
                8013
            ],
            [
                8015,
                8018
            ],
            [
                8019,
                8149
            ],
            [
                8149,
                8150
            ],
            [
                8151,
                8161
            ],
            [
                8166,
                8176
            ],
            [
                8180,
                8235
            ],
            [
                8249,
                8307
            ],
            [
                8313,
                8321
            ],
            [
                8322,
                8346
            ],
            [
                8350,
                8364
            ],
            [
                8365,
                8370
            ],
            [
                8370,
                8497
            ],
            [
                8497,
                8514
            ],
            [
                8515,
                8543
            ],
            [
                8544,
                8561
            ],
            [
                8563,
                8582
            ],
            [
                8584,
                8585
            ],
            [
                8594,
                8606
            ],
            [
                8606,
                8632
            ],
            [
                8636,
                8651
            ],
            [
                8651,
                8655
            ],
            [
                8656,
                8697
            ],
            [
                8704,
                8712
            ],
            [
                8712,
                8721
            ],
            [
                8728,
                8746
            ],
            [
                8747,
                8749
            ],
            [
                8750,
                8777
            ],
            [
                8781,
                8805
            ],
            [
                8808,
                8825
            ],
            [
                8825,
                8847
            ],
            [
                8847,
                8849
            ],
            [
                8850,
                8879
            ],
            [
                8882,
                8908
            ],
            [
                8908,
                8990
            ],
            [
                8991,
                8993
            ],
            [
                8994,
                9031
            ],
            [
                9032,
                9071
            ],
            [
                9074,
                9084
            ],
            [
                9096,
                9201
            ],
            [
                9202,
                9205
            ],
            [
                9206,
                9211
            ],
            [
                9221,
                9289
            ],
            [
                9289,
                9315
            ],
            [
                9315,
                9388
            ],
            [
                9388,
                9390
            ],
            [
                9395,
                9399
            ],
            [
                9402,
                9410
            ],
            [
                9411,
                9536
            ],
            [
                9540,
                9549
            ],
            [
                9552,
                9602
            ],
            [
                9605,
                9630
            ],
            [
                9631,
                9643
            ],
            [
                9643,
                9661
            ],
            [
                9662,
                9691
            ],
            [
                9694,
                9712
            ],
            [
                9715,
                9752
            ],
            [
                9754,
                9799
            ],
            [
                9807,
                9831
            ],
            [
                9833,
                9865
            ],
            [
                9877,
                9883
            ],
            [
                9884,
                9893
            ],
            [
                9896,
                9957
            ],
            [
                9957,
                9997
            ],
            [
                9997,
                10002
            ],
            [
                10005,
                10071
            ],
            [
                10071,
                10140
            ],
            [
                10150,
                10180
            ],
            [
                10181,
                10197
            ],
            [
                10197,
                10247
            ],
            [
                10247,
                10343
            ],
            [
                10343,
                10430
            ],
            [
                10438,
                10442
            ],
            [
                10445,
                10521
            ],
            [
                10524,
                10530
            ],
            [
                10534,
                10553
            ],
            [
                10553,
                10554
            ],
            [
                10556,
                10560
            ],
            [
                10568,
                10572
            ],
            [
                10575,
                10627
            ],
            [
                10627,
                10629
            ],
            [
                10630,
                10640
            ],
            [
                10642,
                10666
            ],
            [
                10666,
                10681
            ],
            [
                10681,
                10699
            ],
            [
                10704,
                10726
            ],
            [
                10734,
                10748
            ],
            [
                10751,
                10756
            ],
            [
                10757,
                10787
            ],
            [
                10788,
                10815
            ],
            [
                10816,
                10845
            ],
            [
                10847,
                10851
            ],
            [
                10851,
                10853
            ],
            [
                10859,
                10866
            ],
            [
                10867,
                10904
            ],
            [
                10904,
                10954
            ],
            [
                10958,
                10961
            ],
            [
                10962,
                10971
            ],
            [
                10972,
                10976
            ],
            [
                10976,
                11036
            ],
            [
                11036,
                11044
            ],
            [
                11045,
                11058
            ],
            [
                11061,
                11075
            ],
            [
                11075,
                11105
            ],
            [
                11106,
                11139
            ],
            [
                11141,
                11156
            ],
            [
                11157,
                11158
            ],
            [
                11165,
                11170
            ],
            [
                11177,
                11179
            ],
            [
                11180,
                11183
            ],
            [
                11191,
                11204
            ],
            [
                11204,
                11208
            ],
            [
                11210,
                11242
            ],
            [
                11246,
                11258
            ],
            [
                11261,
                11301
            ],
            [
                11303,
                11331
            ],
            [
                11334,
                11343
            ],
            [
                11343,
                11345
            ],
            [
                11345,
                11371
            ],
            [
                11372,
                11391
            ],
            [
                11392,
                11535
            ],
            [
                11535,
                11676
            ],
            [
                11684,
                11697
            ],
            [
                11700,
                11716
            ],
            [
                11718,
                11739
            ],
            [
                11742,
                11769
            ],
            [
                11769,
                11913
            ],
            [
                11914,
                12039
            ],
            [
                12039,
                12040
            ],
            [
                12041,
                12111
            ],
            [
                12114,
                12152
            ],
            [
                12153,
                12161
            ],
            [
                12167,
                12181
            ],
            [
                12181,
                12183
            ],
            [
                12183,
                12242
            ],
            [
                12242,
                12286
            ],
            [
                12289,
                12321
            ],
            [
                12321,
                12355
            ],
            [
                12355,
                12367
            ],
            [
                12368,
                12376
            ],
            [
                12377,
                12387
            ],
            [
                12388,
                12416
            ],
            [
                12416,
                12553
            ],
            [
                12553,
                12633
            ],
            [
                12633,
                12678
            ],
            [
                12679,
                12766
            ],
            [
                12766,
                12768
            ],
            [
                12768,
                12850
            ],
            [
                12850,
                12902
            ],
            [
                12902,
                13009
            ],
            [
                13010,
                13045
            ],
            [
                13045,
                13058
            ],
            [
                13058,
                13059
            ],
            [
                13070,
                13112
            ],
            [
                13118,
                13119
            ],
            [
                13120,
                13147
            ],
            [
                13155,
                13207
            ],
            [
                13208,
                13215
            ],
            [
                13216,
                13292
            ],
            [
                13292,
                13302
            ],
            [
                13303,
                13332
            ],
            [
                13340,
                13361
            ],
            [
                13365,
                13380
            ],
            [
                13383,
                13393
            ],
            [
                13393,
                13395
            ],
            [
                13396,
                13417
            ],
            [
                13420,
                13426
            ],
            [
                13433,
                13462
            ],
            [
                13462,
                13463
            ],
            [
                13464,
                13494
            ],
            [
                13495,
                13506
            ],
            [
                13507,
                13509
            ],
            [
                13510,
                13511
            ],
            [
                13512,
                13519
            ],
            [
                13526,
                13528
            ],
            [
                13528,
                13550
            ],
            [
                13550,
                13584
            ],
            [
                13585,
                13588
            ],
            [
                13593,
                13604
            ],
            [
                13612,
                13690
            ],
            [
                13690,
                13755
            ],
            [
                13756,
                13768
            ],
            [
                13769,
                13776
            ],
            [
                13776,
                13780
            ],
            [
                13786,
                13840
            ],
            [
                13841,
                13911
            ],
            [
                13916,
                13955
            ],
            [
                13964,
                14006
            ],
            [
                14006,
                14041
            ],
            [
                14044,
                14064
            ],
            [
                14067,
                14146
            ],
            [
                14146,
                14164
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                56
            ],
            [
                56,
                145
            ],
            [
                145,
                145
            ],
            [
                145,
                233
            ],
            [
                233,
                264
            ],
            [
                264,
                289
            ],
            [
                289,
                337
            ],
            [
                337,
                343
            ],
            [
                343,
                557
            ],
            [
                557,
                642
            ],
            [
                642,
                732
            ],
            [
                732,
                732
            ],
            [
                732,
                732
            ],
            [
                732,
                761
            ],
            [
                761,
                813
            ],
            [
                813,
                847
            ],
            [
                847,
                853
            ],
            [
                853,
                898
            ],
            [
                898,
                953
            ],
            [
                953,
                953
            ],
            [
                953,
                1111
            ],
            [
                1111,
                1182
            ],
            [
                1182,
                1249
            ],
            [
                1249,
                1402
            ],
            [
                1402,
                1479
            ],
            [
                1479,
                1584
            ],
            [
                1584,
                1740
            ],
            [
                1740,
                1801
            ],
            [
                1801,
                1831
            ],
            [
                1831,
                1831
            ],
            [
                1831,
                1831
            ],
            [
                1831,
                1872
            ],
            [
                1872,
                2031
            ],
            [
                2031,
                2056
            ],
            [
                2056,
                2134
            ],
            [
                2134,
                2204
            ],
            [
                2204,
                2270
            ],
            [
                2270,
                2502
            ],
            [
                2502,
                2537
            ],
            [
                2537,
                2609
            ],
            [
                2609,
                2664
            ],
            [
                2664,
                2734
            ],
            [
                2734,
                2764
            ],
            [
                2764,
                2799
            ],
            [
                2799,
                2839
            ],
            [
                2839,
                2882
            ],
            [
                2882,
                2909
            ],
            [
                2909,
                2952
            ],
            [
                2952,
                2995
            ],
            [
                2995,
                3056
            ],
            [
                3056,
                3120
            ],
            [
                3120,
                3199
            ],
            [
                3199,
                3324
            ],
            [
                3324,
                3391
            ],
            [
                3391,
                3468
            ],
            [
                3468,
                3527
            ],
            [
                3527,
                3644
            ],
            [
                3644,
                3671
            ],
            [
                3671,
                3784
            ],
            [
                3784,
                3809
            ],
            [
                3809,
                3814
            ],
            [
                3814,
                3814
            ],
            [
                3814,
                3844
            ],
            [
                3844,
                3914
            ],
            [
                3914,
                3968
            ],
            [
                3968,
                3968
            ],
            [
                3968,
                3998
            ],
            [
                3998,
                3998
            ],
            [
                3998,
                4144
            ],
            [
                4144,
                4194
            ],
            [
                4194,
                4194
            ],
            [
                4194,
                4281
            ],
            [
                4281,
                4354
            ],
            [
                4354,
                4480
            ],
            [
                4480,
                4505
            ],
            [
                4505,
                4547
            ],
            [
                4547,
                4601
            ],
            [
                4601,
                4623
            ],
            [
                4623,
                4670
            ],
            [
                4670,
                4729
            ],
            [
                4729,
                4840
            ],
            [
                4840,
                4905
            ],
            [
                4905,
                4997
            ],
            [
                4997,
                5154
            ],
            [
                5154,
                5238
            ],
            [
                5238,
                5318
            ],
            [
                5318,
                5524
            ],
            [
                5524,
                5566
            ],
            [
                5566,
                5638
            ],
            [
                5638,
                5709
            ],
            [
                5709,
                5720
            ],
            [
                5720,
                5742
            ],
            [
                5742,
                5776
            ],
            [
                5776,
                5801
            ],
            [
                5801,
                5891
            ],
            [
                5891,
                5908
            ],
            [
                5908,
                5949
            ],
            [
                5949,
                5985
            ],
            [
                5985,
                6035
            ],
            [
                6035,
                6063
            ],
            [
                6063,
                6071
            ],
            [
                6071,
                6090
            ],
            [
                6090,
                6090
            ],
            [
                6090,
                6126
            ],
            [
                6126,
                6193
            ],
            [
                6193,
                6244
            ],
            [
                6244,
                6244
            ],
            [
                6244,
                6300
            ],
            [
                6300,
                6384
            ],
            [
                6384,
                6481
            ],
            [
                6481,
                6557
            ],
            [
                6557,
                6586
            ],
            [
                6586,
                6737
            ],
            [
                6737,
                6797
            ],
            [
                6797,
                7001
            ],
            [
                7001,
                7093
            ],
            [
                7093,
                7093
            ],
            [
                7093,
                7093
            ],
            [
                7093,
                7093
            ],
            [
                7093,
                7148
            ],
            [
                7148,
                7173
            ],
            [
                7173,
                7255
            ],
            [
                7255,
                7327
            ],
            [
                7327,
                7387
            ],
            [
                7387,
                7423
            ],
            [
                7423,
                7423
            ],
            [
                7423,
                7423
            ],
            [
                7423,
                7423
            ],
            [
                7423,
                7517
            ],
            [
                7517,
                7724
            ],
            [
                7724,
                7845
            ],
            [
                7845,
                7889
            ],
            [
                7889,
                8164
            ],
            [
                8164,
                8238
            ],
            [
                8238,
                8321
            ],
            [
                8321,
                8370
            ],
            [
                8370,
                8497
            ],
            [
                8497,
                8586
            ],
            [
                8586,
                8606
            ],
            [
                8606,
                8635
            ],
            [
                8635,
                8651
            ],
            [
                8651,
                8780
            ],
            [
                8780,
                8825
            ],
            [
                8825,
                8849
            ],
            [
                8849,
                8908
            ],
            [
                8908,
                9202
            ],
            [
                9202,
                9289
            ],
            [
                9289,
                9390
            ],
            [
                9390,
                9643
            ],
            [
                9643,
                9957
            ],
            [
                9957,
                9997
            ],
            [
                9997,
                10005
            ],
            [
                10005,
                10071
            ],
            [
                10071,
                10180
            ],
            [
                10180,
                10197
            ],
            [
                10197,
                10247
            ],
            [
                10247,
                10343
            ],
            [
                10343,
                10343
            ],
            [
                10343,
                10433
            ],
            [
                10433,
                10575
            ],
            [
                10575,
                10629
            ],
            [
                10629,
                10642
            ],
            [
                10642,
                10666
            ],
            [
                10666,
                10681
            ],
            [
                10681,
                10699
            ],
            [
                10699,
                10788
            ],
            [
                10788,
                10846
            ],
            [
                10846,
                10851
            ],
            [
                10851,
                10904
            ],
            [
                10904,
                10957
            ],
            [
                10957,
                11036
            ],
            [
                11036,
                11061
            ],
            [
                11061,
                11156
            ],
            [
                11156,
                11204
            ],
            [
                11204,
                11204
            ],
            [
                11204,
                11334
            ],
            [
                11334,
                11345
            ],
            [
                11345,
                11391
            ],
            [
                11391,
                11535
            ],
            [
                11535,
                11683
            ],
            [
                11683,
                11742
            ],
            [
                11742,
                11913
            ],
            [
                11913,
                12183
            ],
            [
                12183,
                12242
            ],
            [
                12242,
                12289
            ],
            [
                12289,
                12321
            ],
            [
                12321,
                12355
            ],
            [
                12355,
                12553
            ],
            [
                12553,
                12633
            ],
            [
                12633,
                12679
            ],
            [
                12679,
                12768
            ],
            [
                12768,
                12902
            ],
            [
                12902,
                12902
            ],
            [
                12902,
                13045
            ],
            [
                13045,
                13120
            ],
            [
                13120,
                13292
            ],
            [
                13292,
                13332
            ],
            [
                13332,
                13395
            ],
            [
                13395,
                13420
            ],
            [
                13420,
                13528
            ],
            [
                13528,
                13550
            ],
            [
                13550,
                13690
            ],
            [
                13690,
                13776
            ],
            [
                13776,
                13841
            ],
            [
                13841,
                13911
            ],
            [
                13911,
                14006
            ],
            [
                14006,
                14146
            ],
            [
                14146,
                14166
            ]
        ]
    }
}