{
    "original": {
        "text": "\"On earth is known to none The smile that is not sister to a tear.\" ELLIOTT.\nMargaret and her father walked home. The night was fine, the streets clean, and with her pretty white silk, like Leezie Lindsay's gown o' green satin, in the ballad, \"kilted up to her knee,\" she was off with her father--ready to dance along with the excitement of the cool, fresh night air.\n\"I rather think Thornton is not quite easy in his mind about this strike. He seemed very anxious to-night.\"\n\"I should wonder if he were not. But he spoke with his usual coolness to the others, when they suggested different things, just before we came away.\"\n\"So he did after dinner as well. It would take a good deal to stir him from his cool manner of speaking; but his face strikes me as anxious.\"\n\"I should be, if I were he. He must know of the growing anger and hardly smothered hatred of his workpeople, who all looked upon him as what the Bible calls a 'hard man,'--not so much unjust as unfeeling; clear in judgment, standing upon his 'rights' as no human being ought to stand, considering what we and all our petty rights are in the sight of the Almighty. I am glad you think he looks anxious. When I remember Boucher's half mad words and ways, I cannot bear to think how coolly Mr. Thornton spoke.\"\n\"In the first place, I am not so convinced as you are about that man Boucher's utter distress; for the moment, he was badly off, I don't doubt. But there is always a mysterious supply of money from these Unions; and, from what you said, it was evident the man was of a passionate, demonstrative nature, and gave strong expression to all he felt.\"\n\"Oh, papa!\"\n\"Well! I only want you to do justice to Mr. Thornton, who is, I suspect, of an exactly opposite nature--a man who is far too proud to show his feelings. Just the character I should have thought beforehand, you would have admired, Margaret.\"\n\"So I do--so I should; but I don't feel quite so sure as you do of the existence of those feelings. He is a man of great strength of character--of unusual intellect, considering the few advantages he has had.\"\n\"Not so few. He has led a practical life from a very early age, has been called upon to exercise judgment and self-control. All that developes one part of the intellect. To be sure, he needs some of the knowledge of the past, which gives the truest basis for conjecture as to the future; but he knows this need--he perceives it, and that is something. You are quite prejudiced against Mr. Thornton, Margaret.\"\n\"He is the first specimen of a manufacturer--of a person engaged in trade--that I had ever the opportunity of studying, papa. He is my first olive: let me make a face while I swallow it. I know he is good of his kind, and by and by I shall like the kind. I rather think I am already beginning to do so. I was very much interested by what the gentlemen were talking about, although I did not understand half of it. I was quite sorry when Miss Thornton came to take me to the other end of the room, saying she was sure I should be uncomfortable at being the only lady among so many gentlemen. I had never thought about it, I was so busy listening; and the ladies were so dull, papa--oh, so dull! Yet I think it was clever too. It reminded me of our old game of having each so many nouns to introduce into a sentence.\"\n\"What do you mean, child?\" asked Mr. Hale.\n\"Why, they took nouns that were signs of things which gave evidence of wealth,--housekeepers, under-gardeners, extent of glass, valuable lace, diamonds, and all such things; and each one formed her speech so as to bring them all in, in the prettiest accidental manner possible.\"\n\"You will be as proud of your one servant when you get her, if all is true about her that Mrs. Thornton says.\"\n\"To be sure, I shall. I felt like a great hypocrite to-night, sitting there in my white silk gown, with my idle hands before me, when I remembered all the good, thorough, house-work they had done to-day. They took me for a fine lady, I'm sure.\"\n\"Even I was mistaken enough to think you looked like a lady, my dear,\" said Mr. Hale, quietly smiling.\nBut smiles were changed to white and trembling looks when they saw Dixon's face, as she opened the door.\n\"Oh, master!--Oh, Miss Margaret! Thank God you are come! Dr. Donaldson is here. The servant next door went for him, for the charwoman is gone home. She's better now; but, oh sir! I thought she'd have died an hour ago.\"\nMr. Hale caught Margaret's arm to steady himself from falling. He looked at her face, and saw an expression upon it of surprise and extremest sorrow, but not the agony of terror that contracted his own unprepared heart. She knew more than he did, and yet she listened with that hopeless expression of awed apprehension.\n\"Oh! I should not have left her--wicked daughter that I am!\" moaned forth Margaret, as she supported her trembling father's hasty steps upstairs. Dr. Donaldson met them on the landing.\n\"She is better now,\" he whispered. \"The opiate has taken effect. The spasms were very bad: no wonder they frightened your maid; but she'll rally this time.\"\n\"This time! Let me go to her!\" Half an hour ago Mr. Hale was a middle-aged man; now his sight was dim, his senses wavering, his walk tottering, as if he were seventy years of age.\nDr. Donaldson took his arm, and led him into the bedroom. Margaret followed close. There lay her mother, with an unmistakeable look on her face. She might be better now; she was sleeping, but Death had signed her for his own, and it was clear that ere long he would return to take possession. Mr. Hale looked at her for some time without a word. Then he began to shake all over, and, turning away from Dr. Donaldson's anxious care, he groped to find the door; he could not see it, although several candles, brought in the sudden affright, were burning and flaring there. He staggered into the drawing-room, and felt about for a chair. Dr. Donaldson wheeled one to him, and placed him in it. He felt his pulse.\n\"Speak to him, Miss Hale. We must rouse him.\"\n\"Papa!\" said Margaret, with a crying voice that was wild with pain. \"Papa! Speak to me!\" The speculation came again into his eyes, and he made a great effort.\n\"Margaret, did you know of this? Oh, it was cruel of you!\"\n\"No, sir, it was not cruel!\" replied Dr. Donaldson, with quick decision. \"Miss Hale acted under my directions. There may have been a mistake, but it was not cruel. Your wife will be a different creature to-morrow, I trust. She has had spasms, as I anticipated, though I did not tell Miss Hale of my apprehensions. She has taken the opiate I brought with me; she will have a good long sleep; and to-morrow that look which has alarmed you so much will have passed away.\"\n\"But not the disease?\"\nDr. Donaldson glanced at Margaret. Her bent head, her face raised with no appeal for a temporary reprieve, showed that quick observer of human nature that she thought it better that the whole truth should be told.\n\"Not the disease. We cannot touch the disease, with all our poor vaunted skill. We can only delay its progress--alleviate the pain it causes. Be a man, sir--a Christian. Have faith in the immortality of the soul, which no pain, no mortal disease, can assail or touch!\"\nBut all the reply he got was in the choked words, \"You have never been married, Dr. Donaldson; you don't know what it is,\" and in the deep, manly sobs, which went through the stillness of the night like heavy pulses of agony.\nMargaret knelt by him, caressing him with tearful caresses. No one, not even Dr. Donaldson, knew how the time went by. Mr. Hale was the first to dare to speak of the necessities of the present moment.\n\"What must we do?\" asked he. \"Tell us both. Margaret is my staff--my right hand.\"\nDr. Donaldson gave his clear, sensible directions. No fear for to-night--nay, even peace for to-morrow, and for many days yet. But no enduring hope of recovery. He advised Mr. Hale to go to bed, and leave only one to watch the slumber, which he hoped would be undisturbed. He promised to come again early in the morning. And, with a warm and kindly shake of the hand, he left them.\nThey spoke but few words; they were too much exhausted by their terror to do more than decide upon the immediate course of action. Mr. Hale was resolved to sit up through the night, and all that Margaret could do was to prevail upon him to rest on the drawing-room sofa. Dixon stoutly and bluntly refused to go to bed; and, as for Margaret, it was simply impossible that she should leave her mother, let all the doctors in the world speak of \"husbanding resources,\" and \"one watcher only being required.\" So, Dixon sat, and stared, and winked, and drooped, and picked herself up again with a jerk, and finally gave up the battle, and fairly snored. Margaret had taken off her gown and tossed it aside with a sort of impatient disgust, and put on her dressing-gown. She felt as if she never could sleep again; as if her whole senses were acutely vital, and all endued with double keenness, for the purpose of watching. Every sight and sound--nay, even every thought, touched some nerve to the very quick. For more than two hours, she heard her father's restless movements in the next room. He came perpetually to the door of her mother's chamber, pausing there to listen, till she, not hearing his close unseen presence, went and opened it to tell him how all went on, in reply to the questions his baked lips could hardly form. At last he, too, fell asleep, and all the house was still. Margaret sat behind the curtain thinking. Far away in time, far away in space, seemed all the interests of past days. Not more than thirty-six hours ago, she cared for Bessy Higgins and her father, and her heart was wrung for Boucher; now, that was all like a dreaming memory of some former life;--everything that had passed out of doors seemed dissevered from her mother, and therefore unreal. Even Harley Street appeared more distinct; there she remembered, as if it were yesterday, how she had pleased herself with tracing out her mother's features in her Aunt Shaw's face,--and how letters had come, making her dwell on the thoughs of home with all the longing of love. Helstone, itself, was in the dim past. The dull gray days of the preceding winter and spring, so uneventless and monotonous, seemed more associated with what she cared for now above all price. She would fain have caught at the skirts of that departing time, and prayed it to return, and give her back what she had too little valued while it was yet in her possession. What a vain show Life seemed! How unsubstantial, and flickering, and flitting! It was as if from some arial belfry, high up above the stir and jar of the earth, there was a bell continually tolling, \"All are shadows!--all are passing!--all is past!\" And when the morning dawned, cool and gray, like many a happier morning before--when Margaret looked one by one at the sleepers, it seemed as if the terrible night were unreal as a dream; it, too, was a shadow. It, too, was past.\nMrs. Hale herself was not aware when she awoke, how ill she had been the night before. She was rather surprised at Dr. Donaldson's early visit, and perplexed by the anxious faces of husband and child. She consented to remain in bed that day, saying she certainly was tired; but, the next, she insisted on getting up; and Dr. Donaldson gave his consent to her returning into the drawing-room. She was restless and uncomfortable in every position, and before night she became very feverish. Mr. Hale was utterly listless, and incapable of deciding on anything.\n\"What can we do to spare mamma such another night?\" asked Margaret on the third day.\n\"It is to a certain degree, the reaction after the powerful opiates I have been obliged to use. It is more painful for you to see than for her to bear, I believe. But, I think, if we could get a water-bed it might be a good thing. Not but what she will be better to-morrow; pretty much like herself as she was before this attack. Still, I should like her to have a water-bed. Mrs. Thornton has one, I know. I'll try and call there this afternoon. Stay,\" said he, his eye catching on Margaret's face, blanched with watching in a sick room, \"I'm not sure whether I can go; I've a long round to take. It would do you no harm to have a brisk walk to Marlborough Street, and ask Mrs. Thornton if she can spare it.\"\n\"Certainly,\" said Margaret. \"I could go while mamma is asleep this afternoon. I'm sure Mrs. Thornton would lend it to us.\"\nDr. Donaldson's experience told him rightly. Mrs. Hale seemed to shake off the consequences of her attack, and looked brighter and better this afternoon than Margaret had ever hoped to see her again. Her daughter left her after dinner, sitting in her easy chair, with her hand lying in her husband's, who looked more worn and suffering than she by far. Still, he could smile now--rather slowly, rather faintly, it is true; but a day or two before, Margaret never thought to see him smile again.\nIt was about two miles from their house in Crampton Crescent to Marlborough Street. It was too hot to walk very quickly. An August sun beat straight down into the street at three o'clock in the afternoon. Margaret went along, without noticing anything very different from usual in the first mile and a half of her journey; she was absorbed in her own thoughts, and had learnt by this time to thread her way through the irregular stream of human beings that flowed through Milton streets. But, by and by, she was struck with an unusual heaving among the mass of people in the crowded road on which she was entering. They did not appear to be moving on, so much as talking, and listening, and buzzing with excitement without much stirring from the spot where they might happen to be. Still, as they made way for her, and, wrapt up in the purpose of her errand, and the necessities that suggested it, she was less quick of observation than she might have been, if her mind had been at ease. She had got into Marlborough Street before the full conviction forced itself upon her, that there was a restless, oppressive sense of irritation abroad among the people; a thunderous atmosphere, morally as well as physically, around her. From every narrow lane opening out on Marlborough Street came up a low distant roar, as of myriads of fierce indignant voices. The inhabitants of each poor squalid dwelling were gathered round the doors and windows, if indeed they were not actually standing in the middle of the narrow ways--all with looks intent towards one point. Marlborough Street itself was the focus of all those human eyes, that betrayed intensest interest of various kinds; some fierce with anger, some lowering with relentless threats! some dilated with fear, or imploring entreaty; and as Margaret reached the small side-entrance by the folding doors, in the great dead wall of Marlborough mill-yard, and waited the porter's answer to the bell, she looked round and heard the first long far-off roll of the tempest;--saw the first slow-surging wave of the dark crowd come, with its threatening crest, tumble over, and retreat, at the far end of the street, which a moment ago seemed so full of repressed noise, but which now was ominously still; all these circumstances forced themselves on Margaret's notice, but did not sink down into her pre-occupied heart. She did not know what they meant--what was their deep significance; while she did know, did feel the keen sharp pressure of the knife that was soon to stab her through and through by leaving her motherless. She was trying to realise that, in order that, when it came, she might be ready to comfort her father.\nThe porter opened the door cautiously, not nearly wide enough to admit her.\n\"It's you, is it, ma'am?\" said he, drawing a long breath, and widening the entrance, but still not opening it fully. Margaret went in. He hastily bolted it behind her.\n\"Th' folk are all coming up here, I reckon?\" asked he.\n\"I don't know. Something unusual seemed going on; but this street is quite empty, I think.\"\nShe went across the yard and put up the steps to the house door. There was no near sound,--no steam engine at work with beat and pant,--no click of machinery, no mingling and clashing of many sharp voices; but far away, the ominous gathering roar, deep-clamouring.",
        "paragraph_chars": [
            [
                0,
                77
            ],
            [
                77,
                368
            ],
            [
                368,
                476
            ],
            [
                476,
                626
            ],
            [
                626,
                768
            ],
            [
                768,
                1276
            ],
            [
                1276,
                1623
            ],
            [
                1623,
                1635
            ],
            [
                1635,
                1876
            ],
            [
                1876,
                2086
            ],
            [
                2086,
                2496
            ],
            [
                2496,
                3312
            ],
            [
                3312,
                3355
            ],
            [
                3355,
                3634
            ],
            [
                3634,
                3745
            ],
            [
                3745,
                3990
            ],
            [
                3990,
                4093
            ],
            [
                4093,
                4198
            ],
            [
                4198,
                4417
            ],
            [
                4417,
                4737
            ],
            [
                4737,
                4922
            ],
            [
                4922,
                5079
            ],
            [
                5079,
                5259
            ],
            [
                5259,
                5969
            ],
            [
                5969,
                6015
            ],
            [
                6015,
                6174
            ],
            [
                6174,
                6233
            ],
            [
                6233,
                6702
            ],
            [
                6702,
                6725
            ],
            [
                6725,
                6939
            ],
            [
                6939,
                7208
            ],
            [
                7208,
                7434
            ],
            [
                7434,
                7635
            ],
            [
                7635,
                7717
            ],
            [
                7717,
                8099
            ],
            [
                8099,
                11008
            ],
            [
                11008,
                11567
            ],
            [
                11567,
                11652
            ],
            [
                11652,
                12362
            ],
            [
                12362,
                12485
            ],
            [
                12485,
                12980
            ],
            [
                12980,
                15654
            ],
            [
                15654,
                15730
            ],
            [
                15730,
                15898
            ],
            [
                15898,
                15953
            ],
            [
                15953,
                16045
            ],
            [
                16045,
                16309
            ]
        ],
        "segment_chars": [
            [
                0,
                68
            ],
            [
                68,
                77
            ],
            [
                77,
                114
            ],
            [
                114,
                368
            ],
            [
                368,
                442
            ],
            [
                442,
                476
            ],
            [
                476,
                509
            ],
            [
                509,
                626
            ],
            [
                626,
                659
            ],
            [
                659,
                768
            ],
            [
                768,
                796
            ],
            [
                796,
                1132
            ],
            [
                1132,
                1170
            ],
            [
                1170,
                1276
            ],
            [
                1276,
                1420
            ],
            [
                1420,
                1623
            ],
            [
                1623,
                1635
            ],
            [
                1635,
                1642
            ],
            [
                1642,
                1788
            ],
            [
                1788,
                1876
            ],
            [
                1876,
                1976
            ],
            [
                1976,
                2086
            ],
            [
                2086,
                2099
            ],
            [
                2099,
                2210
            ],
            [
                2210,
                2256
            ],
            [
                2256,
                2438
            ],
            [
                2438,
                2496
            ],
            [
                2496,
                2622
            ],
            [
                2622,
                2683
            ],
            [
                2683,
                2751
            ],
            [
                2751,
                2799
            ],
            [
                2799,
                2910
            ],
            [
                2910,
                3087
            ],
            [
                3087,
                3190
            ],
            [
                3190,
                3221
            ],
            [
                3221,
                3312
            ],
            [
                3312,
                3339
            ],
            [
                3339,
                3355
            ],
            [
                3355,
                3634
            ],
            [
                3634,
                3745
            ],
            [
                3745,
                3767
            ],
            [
                3767,
                3949
            ],
            [
                3949,
                3990
            ],
            [
                3990,
                4093
            ],
            [
                4093,
                4198
            ],
            [
                4198,
                4231
            ],
            [
                4231,
                4255
            ],
            [
                4255,
                4278
            ],
            [
                4278,
                4346
            ],
            [
                4346,
                4377
            ],
            [
                4377,
                4417
            ],
            [
                4417,
                4480
            ],
            [
                4480,
                4637
            ],
            [
                4637,
                4737
            ],
            [
                4737,
                4742
            ],
            [
                4742,
                4798
            ],
            [
                4798,
                4883
            ],
            [
                4883,
                4922
            ],
            [
                4922,
                4957
            ],
            [
                4957,
                4987
            ],
            [
                4987,
                5079
            ],
            [
                5079,
                5091
            ],
            [
                5091,
                5110
            ],
            [
                5110,
                5259
            ],
            [
                5259,
                5317
            ],
            [
                5317,
                5342
            ],
            [
                5342,
                5404
            ],
            [
                5404,
                5552
            ],
            [
                5552,
                5605
            ],
            [
                5605,
                5830
            ],
            [
                5830,
                5894
            ],
            [
                5894,
                5950
            ],
            [
                5950,
                5969
            ],
            [
                5969,
                5995
            ],
            [
                5995,
                6015
            ],
            [
                6015,
                6023
            ],
            [
                6023,
                6083
            ],
            [
                6083,
                6090
            ],
            [
                6090,
                6104
            ],
            [
                6104,
                6174
            ],
            [
                6174,
                6207
            ],
            [
                6207,
                6233
            ],
            [
                6233,
                6262
            ],
            [
                6262,
                6306
            ],
            [
                6306,
                6344
            ],
            [
                6344,
                6397
            ],
            [
                6397,
                6456
            ],
            [
                6456,
                6547
            ],
            [
                6547,
                6702
            ],
            [
                6702,
                6725
            ],
            [
                6725,
                6760
            ],
            [
                6760,
                6939
            ],
            [
                6939,
                6957
            ],
            [
                6957,
                7019
            ],
            [
                7019,
                7081
            ],
            [
                7081,
                7109
            ],
            [
                7109,
                7208
            ],
            [
                7208,
                7434
            ],
            [
                7434,
                7494
            ],
            [
                7494,
                7553
            ],
            [
                7553,
                7635
            ],
            [
                7635,
                7654
            ],
            [
                7654,
                7664
            ],
            [
                7664,
                7679
            ],
            [
                7679,
                7717
            ],
            [
                7717,
                7768
            ],
            [
                7768,
                7844
            ],
            [
                7844,
                7878
            ],
            [
                7878,
                7990
            ],
            [
                7990,
                8038
            ],
            [
                8038,
                8099
            ],
            [
                8099,
                8230
            ],
            [
                8230,
                8370
            ],
            [
                8370,
                8604
            ],
            [
                8604,
                8748
            ],
            [
                8748,
                8864
            ],
            [
                8864,
                9017
            ],
            [
                9017,
                9103
            ],
            [
                9103,
                9188
            ],
            [
                9188,
                9427
            ],
            [
                9427,
                9486
            ],
            [
                9486,
                9528
            ],
            [
                9528,
                9604
            ],
            [
                9604,
                9881
            ],
            [
                9881,
                10160
            ],
            [
                10160,
                10199
            ],
            [
                10199,
                10353
            ],
            [
                10353,
                10528
            ],
            [
                10528,
                10558
            ],
            [
                10558,
                10607
            ],
            [
                10607,
                10778
            ],
            [
                10778,
                10989
            ],
            [
                10989,
                11008
            ],
            [
                11008,
                11095
            ],
            [
                11095,
                11209
            ],
            [
                11209,
                11400
            ],
            [
                11400,
                11497
            ],
            [
                11497,
                11567
            ],
            [
                11567,
                11619
            ],
            [
                11619,
                11652
            ],
            [
                11652,
                11748
            ],
            [
                11748,
                11815
            ],
            [
                11815,
                11883
            ],
            [
                11883,
                11982
            ],
            [
                11982,
                12028
            ],
            [
                12028,
                12059
            ],
            [
                12059,
                12099
            ],
            [
                12099,
                12250
            ],
            [
                12250,
                12362
            ],
            [
                12362,
                12390
            ],
            [
                12390,
                12440
            ],
            [
                12440,
                12485
            ],
            [
                12485,
                12530
            ],
            [
                12530,
                12685
            ],
            [
                12685,
                12838
            ],
            [
                12838,
                12980
            ],
            [
                12980,
                13064
            ],
            [
                13064,
                13101
            ],
            [
                13101,
                13185
            ],
            [
                13185,
                13468
            ],
            [
                13468,
                13595
            ],
            [
                13595,
                13762
            ],
            [
                13762,
                13968
            ],
            [
                13968,
                14206
            ],
            [
                14206,
                14333
            ],
            [
                14333,
                14539
            ],
            [
                14539,
                14718
            ],
            [
                14718,
                15344
            ],
            [
                15344,
                15551
            ],
            [
                15551,
                15654
            ],
            [
                15654,
                15730
            ],
            [
                15730,
                15756
            ],
            [
                15756,
                15847
            ],
            [
                15847,
                15865
            ],
            [
                15865,
                15898
            ],
            [
                15898,
                15943
            ],
            [
                15943,
                15953
            ],
            [
                15953,
                15968
            ],
            [
                15968,
                16045
            ],
            [
                16045,
                16110
            ],
            [
                16110,
                16309
            ]
        ],
        "overlap_chars": [
            [
                77,
                114
            ],
            [
                114,
                132
            ],
            [
                151,
                183
            ],
            [
                251,
                253
            ],
            [
                132,
                133
            ],
            [
                268,
                275
            ],
            [
                297,
                368
            ],
            [
                369,
                399
            ],
            [
                406,
                440
            ],
            [
                440,
                442
            ],
            [
                442,
                464
            ],
            [
                477,
                509
            ],
            [
                509,
                545
            ],
            [
                659,
                717
            ],
            [
                729,
                765
            ],
            [
                927,
                928
            ],
            [
                796,
                833
            ],
            [
                851,
                880
            ],
            [
                892,
                926
            ],
            [
                928,
                936
            ],
            [
                940,
                972
            ],
            [
                992,
                1009
            ],
            [
                1011,
                1017
            ],
            [
                1019,
                1069
            ],
            [
                1081,
                1132
            ],
            [
                1132,
                1170
            ],
            [
                1170,
                1210
            ],
            [
                1219,
                1273
            ],
            [
                1297,
                1318
            ],
            [
                1330,
                1369
            ],
            [
                1371,
                1420
            ],
            [
                1420,
                1491
            ],
            [
                1513,
                1555
            ],
            [
                1571,
                1620
            ],
            [
                1624,
                1632
            ],
            [
                1636,
                1642
            ],
            [
                1642,
                1707
            ],
            [
                1714,
                1730
            ],
            [
                1739,
                1744
            ],
            [
                1756,
                1788
            ],
            [
                1807,
                1828
            ],
            [
                1841,
                1850
            ],
            [
                1863,
                1873
            ],
            [
                1880,
                1884
            ],
            [
                1897,
                1976
            ],
            [
                1976,
                2018
            ],
            [
                2020,
                2083
            ],
            [
                2087,
                2099
            ],
            [
                2099,
                2148
            ],
            [
                2150,
                2210
            ],
            [
                2256,
                2281
            ],
            [
                2289,
                2380
            ],
            [
                2401,
                2410
            ],
            [
                2387,
                2396
            ],
            [
                2436,
                2438
            ],
            [
                2438,
                2493
            ],
            [
                2497,
                2539
            ],
            [
                2571,
                2622
            ],
            [
                2622,
                2683
            ],
            [
                2683,
                2751
            ],
            [
                2751,
                2752
            ],
            [
                2760,
                2799
            ],
            [
                2799,
                2910
            ],
            [
                2910,
                2946
            ],
            [
                2960,
                3014
            ],
            [
                3025,
                3087
            ],
            [
                3087,
                3175
            ],
            [
                3188,
                3190
            ],
            [
                3190,
                3193
            ],
            [
                3209,
                3219
            ],
            [
                3270,
                3280
            ],
            [
                3294,
                3309
            ],
            [
                3313,
                3336
            ],
            [
                3339,
                3355
            ],
            [
                3356,
                3381
            ],
            [
                3426,
                3432
            ],
            [
                3435,
                3465
            ],
            [
                3476,
                3482
            ],
            [
                3492,
                3511
            ],
            [
                3560,
                3562
            ],
            [
                3527,
                3532
            ],
            [
                3575,
                3583
            ],
            [
                3586,
                3631
            ],
            [
                3635,
                3692
            ],
            [
                3749,
                3767
            ],
            [
                3767,
                3796
            ],
            [
                3805,
                3814
            ],
            [
                3852,
                3856
            ],
            [
                3821,
                3843
            ],
            [
                3874,
                3899
            ],
            [
                3916,
                3926
            ],
            [
                3932,
                3940
            ],
            [
                3947,
                3949
            ],
            [
                3949,
                3987
            ],
            [
                3991,
                3997
            ],
            [
                4027,
                4058
            ],
            [
                4061,
                4075
            ],
            [
                4084,
                4093
            ],
            [
                4093,
                4145
            ],
            [
                4172,
                4173
            ],
            [
                4146,
                4172
            ],
            [
                4174,
                4198
            ],
            [
                4199,
                4209
            ],
            [
                4212,
                4231
            ],
            [
                4231,
                4255
            ],
            [
                4255,
                4278
            ],
            [
                4346,
                4371
            ],
            [
                4372,
                4377
            ],
            [
                4377,
                4414
            ],
            [
                4417,
                4465
            ],
            [
                4478,
                4480
            ],
            [
                4480,
                4510
            ],
            [
                4525,
                4532
            ],
            [
                4536,
                4548
            ],
            [
                4559,
                4618
            ],
            [
                4630,
                4637
            ],
            [
                4637,
                4662
            ],
            [
                4735,
                4737
            ],
            [
                4738,
                4742
            ],
            [
                4742,
                4768
            ],
            [
                4777,
                4795
            ],
            [
                4798,
                4804
            ],
            [
                4821,
                4860
            ],
            [
                4867,
                4872
            ],
            [
                4881,
                4883
            ],
            [
                4883,
                4922
            ],
            [
                4927,
                4940
            ],
            [
                4943,
                4957
            ],
            [
                4962,
                4987
            ],
            [
                4987,
                5011
            ],
            [
                5048,
                5076
            ],
            [
                5085,
                5091
            ],
            [
                5091,
                5107
            ],
            [
                5129,
                5135
            ],
            [
                5212,
                5215
            ],
            [
                5223,
                5244
            ],
            [
                5257,
                5258
            ],
            [
                5259,
                5317
            ],
            [
                5317,
                5334
            ],
            [
                5340,
                5341
            ],
            [
                5342,
                5378
            ],
            [
                5386,
                5404
            ],
            [
                5429,
                5506
            ],
            [
                5511,
                5552
            ],
            [
                5552,
                5605
            ],
            [
                5605,
                5674
            ],
            [
                5689,
                5700
            ],
            [
                5709,
                5717
            ],
            [
                5828,
                5830
            ],
            [
                5830,
                5865
            ],
            [
                5894,
                5907
            ],
            [
                5923,
                5926
            ],
            [
                5885,
                5892
            ],
            [
                5866,
                5869
            ],
            [
                5953,
                5969
            ],
            [
                5976,
                5995
            ],
            [
                5995,
                6012
            ],
            [
                6016,
                6020
            ],
            [
                6023,
                6037
            ],
            [
                6052,
                6057
            ],
            [
                6067,
                6083
            ],
            [
                6084,
                6090
            ],
            [
                6090,
                6101
            ],
            [
                6150,
                6173
            ],
            [
                6179,
                6207
            ],
            [
                6207,
                6230
            ],
            [
                6234,
                6259
            ],
            [
                6262,
                6283
            ],
            [
                6304,
                6306
            ],
            [
                6312,
                6344
            ],
            [
                6397,
                6435
            ],
            [
                6445,
                6456
            ],
            [
                6456,
                6547
            ],
            [
                6591,
                6627
            ],
            [
                6638,
                6642
            ],
            [
                6643,
                6647
            ],
            [
                6678,
                6694
            ],
            [
                6703,
                6722
            ],
            [
                6725,
                6760
            ],
            [
                6760,
                6773
            ],
            [
                6832,
                6838
            ],
            [
                6875,
                6939
            ],
            [
                6940,
                6957
            ],
            [
                6957,
                6984
            ],
            [
                7017,
                7019
            ],
            [
                7019,
                7049
            ],
            [
                7061,
                7069
            ],
            [
                7079,
                7081
            ],
            [
                7081,
                7094
            ],
            [
                7096,
                7109
            ],
            [
                7109,
                7160
            ],
            [
                7177,
                7184
            ],
            [
                7186,
                7189
            ],
            [
                7200,
                7205
            ],
            [
                7259,
                7306
            ],
            [
                7313,
                7328
            ],
            [
                7342,
                7358
            ],
            [
                7366,
                7433
            ],
            [
                7434,
                7451
            ],
            [
                7455,
                7470
            ],
            [
                7476,
                7480
            ],
            [
                7492,
                7494
            ],
            [
                7555,
                7561
            ],
            [
                7633,
                7635
            ],
            [
                7636,
                7651
            ],
            [
                7665,
                7679
            ],
            [
                7679,
                7693
            ],
            [
                7704,
                7714
            ],
            [
                7717,
                7768
            ],
            [
                7768,
                7779
            ],
            [
                7782,
                7783
            ],
            [
                7790,
                7809
            ],
            [
                7829,
                7844
            ],
            [
                7844,
                7878
            ],
            [
                7878,
                7930
            ],
            [
                7931,
                7990
            ],
            [
                7990,
                8038
            ],
            [
                8038,
                8041
            ],
            [
                8043,
                8049
            ],
            [
                8059,
                8099
            ],
            [
                8099,
                8138
            ],
            [
                8144,
                8230
            ],
            [
                8230,
                8318
            ],
            [
                8332,
                8370
            ],
            [
                8370,
                8383
            ],
            [
                8396,
                8497
            ],
            [
                8604,
                8606
            ],
            [
                8608,
                8629
            ],
            [
                8641,
                8716
            ],
            [
                8729,
                8748
            ],
            [
                8748,
                8756
            ],
            [
                8832,
                8833
            ],
            [
                8757,
                8760
            ],
            [
                8771,
                8779
            ],
            [
                8988,
                8991
            ],
            [
                8845,
                8862
            ],
            [
                8949,
                8950
            ],
            [
                8868,
                8917
            ],
            [
                8924,
                8935
            ],
            [
                8978,
                8982
            ],
            [
                9015,
                9017
            ],
            [
                9017,
                9038
            ],
            [
                9065,
                9103
            ],
            [
                9128,
                9186
            ],
            [
                9126,
                9127
            ],
            [
                9208,
                9244
            ],
            [
                9324,
                9327
            ],
            [
                9245,
                9252
            ],
            [
                9259,
                9278
            ],
            [
                9328,
                9365
            ],
            [
                9186,
                9187
            ],
            [
                9427,
                9460
            ],
            [
                9465,
                9486
            ],
            [
                9486,
                9498
            ],
            [
                9518,
                9528
            ],
            [
                9618,
                9639
            ],
            [
                9688,
                9707
            ],
            [
                9650,
                9659
            ],
            [
                9668,
                9671
            ],
            [
                9708,
                9734
            ],
            [
                9739,
                9781
            ],
            [
                9879,
                9881
            ],
            [
                9881,
                9923
            ],
            [
                9930,
                10061
            ],
            [
                10064,
                10067
            ],
            [
                10110,
                10113
            ],
            [
                10072,
                10079
            ],
            [
                10080,
                10088
            ],
            [
                10125,
                10129
            ],
            [
                10158,
                10159
            ],
            [
                10160,
                10168
            ],
            [
                10170,
                10176
            ],
            [
                10178,
                10199
            ],
            [
                10353,
                10497
            ],
            [
                10498,
                10500
            ],
            [
                10526,
                10528
            ],
            [
                10528,
                10558
            ],
            [
                10558,
                10591
            ],
            [
                10605,
                10606
            ],
            [
                10778,
                10815
            ],
            [
                10820,
                10856
            ],
            [
                10858,
                10878
            ],
            [
                10890,
                10946
            ],
            [
                10947,
                10989
            ],
            [
                10989,
                11008
            ],
            [
                11008,
                11039
            ],
            [
                11040,
                11055
            ],
            [
                11056,
                11095
            ],
            [
                11095,
                11209
            ],
            [
                11209,
                11239
            ],
            [
                11248,
                11285
            ],
            [
                11287,
                11295
            ],
            [
                11245,
                11248
            ],
            [
                11295,
                11342
            ],
            [
                11363,
                11366
            ],
            [
                11360,
                11362
            ],
            [
                11377,
                11400
            ],
            [
                11400,
                11434
            ],
            [
                11452,
                11497
            ],
            [
                11497,
                11567
            ],
            [
                11568,
                11616
            ],
            [
                11625,
                11633
            ],
            [
                11634,
                11652
            ],
            [
                11653,
                11658
            ],
            [
                11659,
                11661
            ],
            [
                11672,
                11748
            ],
            [
                11748,
                11815
            ],
            [
                11815,
                11883
            ],
            [
                11896,
                11914
            ],
            [
                11924,
                11950
            ],
            [
                11980,
                11982
            ],
            [
                11982,
                12028
            ],
            [
                12028,
                12057
            ],
            [
                12057,
                12059
            ],
            [
                12059,
                12099
            ],
            [
                12099,
                12103
            ],
            [
                12106,
                12114
            ],
            [
                12135,
                12145
            ],
            [
                12146,
                12150
            ],
            [
                12192,
                12250
            ],
            [
                12250,
                12359
            ],
            [
                12363,
                12372
            ],
            [
                12375,
                12389
            ],
            [
                12628,
                12637
            ],
            [
                12530,
                12622
            ],
            [
                12638,
                12655
            ],
            [
                12661,
                12685
            ],
            [
                12685,
                12746
            ],
            [
                12771,
                12782
            ],
            [
                12784,
                12829
            ],
            [
                12836,
                12838
            ],
            [
                12838,
                12863
            ],
            [
                12887,
                12894
            ],
            [
                12978,
                12980
            ],
            [
                12980,
                13002
            ],
            [
                13041,
                13064
            ],
            [
                13064,
                13099
            ],
            [
                13101,
                13119
            ],
            [
                13129,
                13133
            ],
            [
                13183,
                13185
            ],
            [
                13265,
                13270
            ],
            [
                13185,
                13204
            ],
            [
                13206,
                13257
            ],
            [
                13301,
                13339
            ],
            [
                13466,
                13468
            ],
            [
                13468,
                13567
            ],
            [
                13593,
                13595
            ],
            [
                13595,
                13694
            ],
            [
                13695,
                13702
            ],
            [
                13708,
                13730
            ],
            [
                13760,
                13762
            ],
            [
                13762,
                13768
            ],
            [
                13772,
                13798
            ],
            [
                13878,
                13885
            ],
            [
                13809,
                13811
            ],
            [
                13827,
                13837
            ],
            [
                13839,
                13842
            ],
            [
                13886,
                13890
            ],
            [
                13912,
                13937
            ],
            [
                13968,
                14010
            ],
            [
                14055,
                14112
            ],
            [
                14120,
                14161
            ],
            [
                14194,
                14205
            ],
            [
                14206,
                14236
            ],
            [
                14241,
                14243
            ],
            [
                14256,
                14267
            ],
            [
                14271,
                14289
            ],
            [
                14305,
                14333
            ],
            [
                14333,
                14356
            ],
            [
                14362,
                14392
            ],
            [
                14399,
                14408
            ],
            [
                14420,
                14421
            ],
            [
                14455,
                14484
            ],
            [
                14973,
                14974
            ],
            [
                14498,
                14501
            ],
            [
                14520,
                14527
            ],
            [
                14539,
                14557
            ],
            [
                14502,
                14506
            ],
            [
                14628,
                14636
            ],
            [
                14598,
                14602
            ],
            [
                14653,
                14683
            ],
            [
                15065,
                15076
            ],
            [
                14602,
                14603
            ],
            [
                14718,
                14754
            ],
            [
                14537,
                14538
            ],
            [
                14769,
                14812
            ],
            [
                14835,
                14860
            ],
            [
                14569,
                14572
            ],
            [
                14873,
                14882
            ],
            [
                14884,
                14894
            ],
            [
                14895,
                14905
            ],
            [
                14915,
                14917
            ],
            [
                14908,
                14914
            ],
            [
                14918,
                14969
            ],
            [
                14978,
                14998
            ],
            [
                15000,
                15054
            ],
            [
                14409,
                14412
            ],
            [
                15101,
                15145
            ],
            [
                15204,
                15207
            ],
            [
                15159,
                15165
            ],
            [
                15212,
                15227
            ],
            [
                15274,
                15282
            ],
            [
                15229,
                15238
            ],
            [
                14833,
                14834
            ],
            [
                14565,
                14568
            ],
            [
                15324,
                15336
            ],
            [
                15342,
                15344
            ],
            [
                15344,
                15376
            ],
            [
                15410,
                15430
            ],
            [
                15512,
                15515
            ],
            [
                15436,
                15511
            ],
            [
                15524,
                15551
            ],
            [
                15551,
                15582
            ],
            [
                15592,
                15596
            ],
            [
                15612,
                15654
            ],
            [
                15654,
                15691
            ],
            [
                15728,
                15730
            ],
            [
                15731,
                15753
            ],
            [
                15756,
                15813
            ],
            [
                15845,
                15847
            ],
            [
                15847,
                15865
            ],
            [
                15865,
                15898
            ],
            [
                15901,
                15940
            ],
            [
                15943,
                15953
            ],
            [
                15954,
                15968
            ],
            [
                15968,
                15992
            ],
            [
                15993,
                16042
            ],
            [
                16045,
                16069
            ],
            [
                16091,
                16110
            ],
            [
                16110,
                16122
            ],
            [
                16165,
                16178
            ],
            [
                16229,
                16231
            ],
            [
                16139,
                16144
            ],
            [
                16297,
                16298
            ],
            [
                16145,
                16151
            ],
            [
                16181,
                16202
            ],
            [
                16249,
                16291
            ],
            [
                16308,
                16309
            ]
        ],
        "row_chars": [
            [
                0,
                68
            ],
            [
                68,
                77
            ],
            [
                77,
                114
            ],
            [
                114,
                368
            ],
            [
                368,
                442
            ],
            [
                442,
                476
            ],
            [
                476,
                509
            ],
            [
                509,
                626
            ],
            [
                626,
                659
            ],
            [
                659,
                768
            ],
            [
                768,
                796
            ],
            [
                796,
                1132
            ],
            [
                1132,
                1170
            ],
            [
                1170,
                1276
            ],
            [
                1276,
                1420
            ],
            [
                1420,
                1623
            ],
            [
                1623,
                1635
            ],
            [
                1635,
                1642
            ],
            [
                1642,
                1788
            ],
            [
                1788,
                1876
            ],
            [
                1876,
                1976
            ],
            [
                1976,
                2086
            ],
            [
                2086,
                2099
            ],
            [
                2099,
                2210
            ],
            [
                2210,
                2256
            ],
            [
                2256,
                2438
            ],
            [
                2438,
                2496
            ],
            [
                2496,
                2622
            ],
            [
                2622,
                2683
            ],
            [
                2683,
                2751
            ],
            [
                2751,
                2799
            ],
            [
                2799,
                2910
            ],
            [
                2910,
                3087
            ],
            [
                3087,
                3190
            ],
            [
                3190,
                3312
            ],
            [
                3312,
                3339
            ],
            [
                3339,
                3355
            ],
            [
                3355,
                3634
            ],
            [
                3634,
                3745
            ],
            [
                3745,
                3767
            ],
            [
                3767,
                3949
            ],
            [
                3949,
                3990
            ],
            [
                3990,
                4093
            ],
            [
                4093,
                4198
            ],
            [
                4198,
                4231
            ],
            [
                4231,
                4255
            ],
            [
                4255,
                4278
            ],
            [
                4278,
                4346
            ],
            [
                4346,
                4377
            ],
            [
                4377,
                4417
            ],
            [
                4417,
                4480
            ],
            [
                4480,
                4637
            ],
            [
                4637,
                4737
            ],
            [
                4737,
                4742
            ],
            [
                4742,
                4798
            ],
            [
                4798,
                4883
            ],
            [
                4883,
                4922
            ],
            [
                4922,
                4957
            ],
            [
                4957,
                4987
            ],
            [
                4987,
                5079
            ],
            [
                5079,
                5091
            ],
            [
                5091,
                5110
            ],
            [
                5110,
                5259
            ],
            [
                5259,
                5317
            ],
            [
                5317,
                5342
            ],
            [
                5342,
                5404
            ],
            [
                5404,
                5552
            ],
            [
                5552,
                5605
            ],
            [
                5605,
                5830
            ],
            [
                5830,
                5969
            ],
            [
                5969,
                5995
            ],
            [
                5995,
                6015
            ],
            [
                6015,
                6023
            ],
            [
                6023,
                6083
            ],
            [
                6083,
                6090
            ],
            [
                6090,
                6104
            ],
            [
                6104,
                6174
            ],
            [
                6174,
                6207
            ],
            [
                6207,
                6233
            ],
            [
                6233,
                6262
            ],
            [
                6262,
                6306
            ],
            [
                6306,
                6344
            ],
            [
                6344,
                6397
            ],
            [
                6397,
                6456
            ],
            [
                6456,
                6547
            ],
            [
                6547,
                6702
            ],
            [
                6702,
                6725
            ],
            [
                6725,
                6760
            ],
            [
                6760,
                6939
            ],
            [
                6939,
                6957
            ],
            [
                6957,
                7019
            ],
            [
                7019,
                7081
            ],
            [
                7081,
                7109
            ],
            [
                7109,
                7208
            ],
            [
                7208,
                7434
            ],
            [
                7434,
                7494
            ],
            [
                7494,
                7553
            ],
            [
                7553,
                7635
            ],
            [
                7635,
                7654
            ],
            [
                7654,
                7664
            ],
            [
                7664,
                7679
            ],
            [
                7679,
                7717
            ],
            [
                7717,
                7768
            ],
            [
                7768,
                7844
            ],
            [
                7844,
                7878
            ],
            [
                7878,
                7990
            ],
            [
                7990,
                8038
            ],
            [
                8038,
                8099
            ],
            [
                8099,
                8230
            ],
            [
                8230,
                8370
            ],
            [
                8370,
                8604
            ],
            [
                8604,
                8748
            ],
            [
                8748,
                9017
            ],
            [
                9017,
                9103
            ],
            [
                9103,
                9427
            ],
            [
                9427,
                9486
            ],
            [
                9486,
                9528
            ],
            [
                9528,
                9604
            ],
            [
                9604,
                9881
            ],
            [
                9881,
                10160
            ],
            [
                10160,
                10199
            ],
            [
                10199,
                10353
            ],
            [
                10353,
                10528
            ],
            [
                10528,
                10558
            ],
            [
                10558,
                10607
            ],
            [
                10607,
                10778
            ],
            [
                10778,
                10989
            ],
            [
                10989,
                11008
            ],
            [
                11008,
                11095
            ],
            [
                11095,
                11209
            ],
            [
                11209,
                11400
            ],
            [
                11400,
                11497
            ],
            [
                11497,
                11567
            ],
            [
                11567,
                11619
            ],
            [
                11619,
                11652
            ],
            [
                11652,
                11748
            ],
            [
                11748,
                11815
            ],
            [
                11815,
                11883
            ],
            [
                11883,
                11982
            ],
            [
                11982,
                12028
            ],
            [
                12028,
                12059
            ],
            [
                12059,
                12099
            ],
            [
                12099,
                12250
            ],
            [
                12250,
                12362
            ],
            [
                12362,
                12390
            ],
            [
                12390,
                12440
            ],
            [
                12440,
                12485
            ],
            [
                12485,
                12530
            ],
            [
                12530,
                12685
            ],
            [
                12685,
                12838
            ],
            [
                12838,
                12980
            ],
            [
                12980,
                13064
            ],
            [
                13064,
                13185
            ],
            [
                13185,
                13468
            ],
            [
                13468,
                13595
            ],
            [
                13595,
                13762
            ],
            [
                13762,
                14206
            ],
            [
                14206,
                14333
            ],
            [
                14333,
                15344
            ],
            [
                15344,
                15551
            ],
            [
                15551,
                15654
            ],
            [
                15654,
                15730
            ],
            [
                15730,
                15756
            ],
            [
                15756,
                15847
            ],
            [
                15847,
                15865
            ],
            [
                15865,
                15898
            ],
            [
                15898,
                15943
            ],
            [
                15943,
                15953
            ],
            [
                15953,
                15968
            ],
            [
                15968,
                16045
            ],
            [
                16045,
                16110
            ],
            [
                16110,
                16309
            ]
        ]
    },
    "abridged": {
        "text": "Margaret and her father walked home. The night was fine, and with her pretty white silk hitched up, she was ready to dance along with the excitement of the cool, fresh night air.\n'I rather think Thornton is not easy in his mind about this strike,' said Mr. Hale. 'He seemed very anxious tonight.'\n'I should wonder if he were not. But he spoke with his usual coolness.'\n'It would take a good deal to stir him from his cool manner; but his face strikes me as anxious.'\n'He must know of the growing anger and hatred of his workpeople, who look upon him as what the Bible calls a \"hard man\" - not so much unjust as unfeeling; standing upon his \"rights\" as no human being ought to stand, considering what our petty rights are in the sight of the Almighty. I am glad you think he looks anxious. When I remember Boucher's half mad words, I cannot bear to think how coolly Mr. Thornton spoke.'\n'I am not so convinced about that man Boucher's utter distress. For the moment, he was badly off, I don't doubt. But there is always a mysterious supply of money from these Unions; and it was evident the man was of a passionate nature, and gave strong expression to all he felt.'\n'Oh, papa!'\n'Well! I only want you to do justice to Mr. Thornton, who is, I suspect, exactly opposite - a man too proud to show his feelings. I should have thought you would admire that, Margaret.'\n'So I do; but I don't feel quite so sure as you do of the existence of those feelings. He is a man of great strength of character - of unusual intellect, considering the few advantages he has had.'\n'Not so few. He has led a practical life from a very early age; has been called upon to exercise judgment and self-control. To be sure, he needs some knowledge of the past, which gives the truest basis for conjecture as to the future; but he perceives this need. You are quite prejudiced against Mr. Thornton, Margaret.'\n'He is the first specimen of a manufacturer that I had ever the opportunity of studying, papa. He is my first olive: let me make a face while I swallow it. I know he is good of his kind, and by and by I shall like the kind. I think I am already beginning to do so. I was very much interested by what the gentlemen were talking about, although I did not understand half of it. I was quite sorry when Miss Thornton took me to the other end of the room, saying she was sure I was uncomfortable at being the only lady among so many gentlemen. I had never thought about it, I was so busy listening; and the ladies were so dull, papa! Yet clever too, at seeing how many nouns they could put into a sentence.'\n'What do you mean, child?' asked Mr. Hale.\n'Why, they took nouns that indicated wealth: housekeepers, under-gardeners, glass, lace, diamonds, and so on; and brought them all into their speches, in the prettiest accidental manner possible.'\n'You will be as proud of your one servant when you get her.'\n'To be sure, I shall. I felt like a great hypocrite tonight, sitting idle in my white silk gown, when I remembered all the house-work I had done today. They took me for a fine lady, I'm sure.'\n'Even I thought you looked like a lady, my dear,' said Mr. Hale, smiling.\nBut smiles were changed to white and trembling looks, when they saw Dixon's face as she opened the door.\n'Oh, master! - Oh, Miss Margaret! Thank God you are come! Dr. Donaldson is here. She's better now; but, oh, sir! I thought she'd have died an hour ago.'\nMr. Hale caught Margaret's arm to steady himself. He looked at her face, and saw upon it surprise and extreme sorrow, but not the agony of terror that contracted his own heart. She knew more than he did.\n'Oh! I should not have left her - wicked daughter that I am!' she moaned as she supported her trembling father's steps. Dr. Donaldson met them on the landing.\n'She is better now,' he whispered. 'The opiate has taken effect. The spasms were very bad; but she'll rally this time.'\n'This time! Let me go to her!' Mr. Hale tottered as if he were seventy. Dr. Donaldson took his arm, and led him into the bedroom. Margaret followed.\nThere lay her mother, with an unmistakable look on her face. She was sleeping, but Death had signed her for his own, and it was clear that before long he would return to take possession. Mr. Hale looked at her for some time without a word. Then he began to shake all over, and, turning away from Dr. Donaldson, he groped blindly for the door. He staggered into the drawing-room, where Dr. Donaldson brought him a chair and felt his pulse.\n'Speak to him, Miss Hale. We must rouse him.'\n'Papa!' said Margaret, her voice wild with pain. 'Papa! Speak to me!'\nHe made a great effort. 'Margaret, did you know of this? Oh, it was cruel of you!'\n'No, sir, it was not cruel!' replied Dr. Donaldson quickly. 'Miss Hale acted under my directions. Your wife will be a different creature tomorrow, I trust. She has had spasms, as I anticipated, though I did not tell Miss Hale of my apprehensions. She will have a good long sleep; and tomorrow, that alarming look will have passed.'\n'But not the disease?'\nDr. Donaldson glanced at Margaret. Her bent head showed him that she thought it better that the whole truth should be told.\n'Not the disease. We cannot touch the disease. We can only delay its progress and alleviate the pain. Be a man, sir - be a Christian. Have faith in the immortality of the soul, which no disease can touch!'\n'You have never been married, Dr. Donaldson; you do not know what it is.' Deep, manly sobs went through the stillness of the night like heavy pulses of agony. Margaret knelt by her father, caressing him tearfully. At last Mr. Hale spoke again.\n'What must we do? Tell us both. Margaret is my right hand.'\nDr. Donaldson gave his clear, sensible directions. No fear for tonight - nay, even peace for many days yet. But no enduring hope of recovery. He advised Mr. Hale to go to bed, and leave only one person to watch the slumber, which he hoped would be undisturbed. He promised to come again early in the morning. And with a kindly shake of the hand, he left them.\nThey spoke but few words; they were too exhausted by their terror to do more than decide upon the immediate course of action. Mr. Hale was resolved to sit up through the night, and all that Margaret could do was to persuade him to rest on the drawing-room sofa. Dixon stoutly refused to go to bed; and, as for Margaret, it was simply impossible that she should leave her mother.\nSo Dixon sat, and stared, and drooped, and picked herself up again with a jerk, and finally gave up and fairly snored. Margaret, who had exchanged her gown for her dressing-gown, felt as if she never could sleep again; as if her senses were doubly keen. Every sight and sound touched some nerve to the very quick. She heard her father's restless movements in the next room, coming to the door of her mother's chamber, and pausing to listen, till she opened it to tell him how all went on.\nAt last he, too, fell asleep, and the house was still. Margaret sat thinking. Only thirty-six hours ago, her heart was wrung for Bessy and for Boucher; now, that was like a dreaming memory of some former life. Even Harley Street appeared more distinct; she remembered, as if it were yesterday, how she had pleased herself with tracing out her mother's features in her Aunt Shaw's face - and the letters that had come from home.\nHelstone itself was in the dim past. She would fain have caught at the skirts of that departing time, and prayed it to return, and give her back what she had too little valued while she had it. What a vain show Life seemed! How unsubstantial, and flickering!\nAnd when the morning dawned, cool and grey, like many a happier morning before - when Margaret looked at the sleepers, it seemed as if the terrible night were as unreal as a dream; it, too, was a shadow. It, too, was past.\nMrs. Hale herself was not aware, when she awoke, of how ill she had been the night before. She was rather surprised at Dr. Donaldson's early visit, and perplexed by the anxious faces of husband and child. She consented to remain in bed, saying she certainly was tired; but the next day, she insisted on getting up; and Dr. Donaldson allowed her to return into the drawing-room. She was restless and uncomfortable, and before night she became very feverish. Mr. Hale was utterly listless, and incapable of deciding on anything.\n'What can we do to spare mamma such another night?' Margaret asked the doctor on the third day.\n'It is, to some degree, the reaction after the powerful opiates I have been obliged to use. It is more painful for you to see than for her to bear, I believe. But, I think, if we could get a water-bed it might be a good thing. Though she will be better tomorrow; pretty much like herself again. Still, I should like her to have a water-bed. Mrs. Thornton has one, I know, made of rubber-coated canvas. I'll try and call there this afternoon. Stay,' said he, seeing Margaret's pale face. 'I'm not sure whether I can go; I've a long round to take. It would do you no harm to have a brisk walk to Marlborough Street, and ask Mrs. Thornton if she can spare it.'\n'Certainly,' said Margaret.\nThat afternoon Mrs. Hale seemed to shake off the consequences of her attack, and looked brighter and better than Margaret had hoped to see her again. Her daughter left her after dinner, sitting in her easy chair beside her husband, who looked more worn and suffering than she. Still, he could smile now - if only faintly.\nIt was about two miles to Marlborough Street. It was too hot to walk very quickly; an August sun beat down. At first Margaret went along without noticing anything very different from usual; she was absorbed in her own thoughts. But, by and by, she was struck with an unusual heaving among the mass of people in the crowded road. They did not appear to be moving on, so much as talking, and listening, and buzzing with excitement, without stirring from the spot. Still, since they made way for her, and she was wrapped in her errand and so less observant than she might have been, she had got into Marlborough Street before she realised that there was a restless, oppressive sense of irritation among the people; a thunderous atmosphere around her.\nFrom every narrow lane opening on to the street came a low distant roar of fierce indignant voices. The inhabitants of each squalid dwelling were gathered at the doors, or standing in the middle of the lane - all looking towards Marlborough Street with intense interest in their eyes; some fierce with anger, some threatening, some dilated with fear, or imploring.\nAs Margaret reached the small side-entrance in the great dead wall of the mill-yard and waited for the porter to answer the bell, she looked round and heard the first long roll of the tempest; - saw the first slow-surging wave of the dark crowd come and then retreat, at the far end of the street, which now seemed ominously still.\nAlthough Margaret noticed all these things, she was still pre-occupied. She did not know what they meant; while she did know and feel the keen sharp pressure of the knife that was soon to stab her through by leaving her motherless. She was trying to realise that, so that she might be ready to comfort her father.\nThe porter opened the door cautiously.\n'It's you, is it, ma'am?' said he, drawing a long breath, and widening the entrance a little. Margaret went in. He hastily bolted it behind her.\n'Th' folk are all coming up here, I reckon?' asked he.\n'I don't know. Something unusual seemed to be going on; but this street is quite empty, I think.'\nShe went across the yard to the house door. There was no beat and pant of the steam-engine - no click of machinery; but far away, the ominous gathering roar.",
        "paragraph_chars": [
            [
                0,
                179
            ],
            [
                179,
                297
            ],
            [
                297,
                369
            ],
            [
                369,
                467
            ],
            [
                467,
                886
            ],
            [
                886,
                1166
            ],
            [
                1166,
                1178
            ],
            [
                1178,
                1364
            ],
            [
                1364,
                1562
            ],
            [
                1562,
                1883
            ],
            [
                1883,
                2586
            ],
            [
                2586,
                2629
            ],
            [
                2629,
                2826
            ],
            [
                2826,
                2887
            ],
            [
                2887,
                3080
            ],
            [
                3080,
                3154
            ],
            [
                3154,
                3259
            ],
            [
                3259,
                3412
            ],
            [
                3412,
                3616
            ],
            [
                3616,
                3775
            ],
            [
                3775,
                3895
            ],
            [
                3895,
                4044
            ],
            [
                4044,
                4483
            ],
            [
                4483,
                4529
            ],
            [
                4529,
                4599
            ],
            [
                4599,
                4682
            ],
            [
                4682,
                5014
            ],
            [
                5014,
                5037
            ],
            [
                5037,
                5161
            ],
            [
                5161,
                5367
            ],
            [
                5367,
                5611
            ],
            [
                5611,
                5671
            ],
            [
                5671,
                6031
            ],
            [
                6031,
                6410
            ],
            [
                6410,
                6899
            ],
            [
                6899,
                7327
            ],
            [
                7327,
                7586
            ],
            [
                7586,
                7809
            ],
            [
                7809,
                8336
            ],
            [
                8336,
                8432
            ],
            [
                8432,
                9090
            ],
            [
                9090,
                9118
            ],
            [
                9118,
                9440
            ],
            [
                9440,
                10188
            ],
            [
                10188,
                10553
            ],
            [
                10553,
                10885
            ],
            [
                10885,
                11199
            ],
            [
                11199,
                11238
            ],
            [
                11238,
                11383
            ],
            [
                11383,
                11438
            ],
            [
                11438,
                11536
            ],
            [
                11536,
                11693
            ]
        ],
        "segment_chars": [
            [
                0,
                37
            ],
            [
                37,
                179
            ],
            [
                179,
                263
            ],
            [
                263,
                297
            ],
            [
                297,
                330
            ],
            [
                330,
                369
            ],
            [
                369,
                467
            ],
            [
                467,
                751
            ],
            [
                751,
                789
            ],
            [
                789,
                886
            ],
            [
                886,
                950
            ],
            [
                950,
                999
            ],
            [
                999,
                1166
            ],
            [
                1166,
                1178
            ],
            [
                1178,
                1185
            ],
            [
                1185,
                1308
            ],
            [
                1308,
                1364
            ],
            [
                1364,
                1451
            ],
            [
                1451,
                1562
            ],
            [
                1562,
                1575
            ],
            [
                1575,
                1686
            ],
            [
                1686,
                1825
            ],
            [
                1825,
                1883
            ],
            [
                1883,
                1978
            ],
            [
                1978,
                2039
            ],
            [
                2039,
                2107
            ],
            [
                2107,
                2148
            ],
            [
                2148,
                2259
            ],
            [
                2259,
                2422
            ],
            [
                2422,
                2512
            ],
            [
                2512,
                2586
            ],
            [
                2586,
                2613
            ],
            [
                2613,
                2629
            ],
            [
                2629,
                2826
            ],
            [
                2826,
                2887
            ],
            [
                2887,
                2909
            ],
            [
                2909,
                3039
            ],
            [
                3039,
                3080
            ],
            [
                3080,
                3154
            ],
            [
                3154,
                3259
            ],
            [
                3259,
                3272
            ],
            [
                3272,
                3293
            ],
            [
                3293,
                3317
            ],
            [
                3317,
                3340
            ],
            [
                3340,
                3372
            ],
            [
                3372,
                3412
            ],
            [
                3412,
                3462
            ],
            [
                3462,
                3589
            ],
            [
                3589,
                3616
            ],
            [
                3616,
                3621
            ],
            [
                3621,
                3678
            ],
            [
                3678,
                3736
            ],
            [
                3736,
                3775
            ],
            [
                3775,
                3810
            ],
            [
                3810,
                3840
            ],
            [
                3840,
                3895
            ],
            [
                3895,
                3907
            ],
            [
                3907,
                3926
            ],
            [
                3926,
                3967
            ],
            [
                3967,
                4025
            ],
            [
                4025,
                4044
            ],
            [
                4044,
                4105
            ],
            [
                4105,
                4231
            ],
            [
                4231,
                4284
            ],
            [
                4284,
                4387
            ],
            [
                4387,
                4483
            ],
            [
                4483,
                4509
            ],
            [
                4509,
                4529
            ],
            [
                4529,
                4537
            ],
            [
                4537,
                4578
            ],
            [
                4578,
                4585
            ],
            [
                4585,
                4599
            ],
            [
                4599,
                4623
            ],
            [
                4623,
                4656
            ],
            [
                4656,
                4682
            ],
            [
                4682,
                4711
            ],
            [
                4711,
                4742
            ],
            [
                4742,
                4780
            ],
            [
                4780,
                4838
            ],
            [
                4838,
                4929
            ],
            [
                4929,
                5014
            ],
            [
                5014,
                5037
            ],
            [
                5037,
                5072
            ],
            [
                5072,
                5161
            ],
            [
                5161,
                5179
            ],
            [
                5179,
                5208
            ],
            [
                5208,
                5263
            ],
            [
                5263,
                5295
            ],
            [
                5295,
                5367
            ],
            [
                5367,
                5441
            ],
            [
                5441,
                5526
            ],
            [
                5526,
                5581
            ],
            [
                5581,
                5611
            ],
            [
                5611,
                5629
            ],
            [
                5629,
                5643
            ],
            [
                5643,
                5671
            ],
            [
                5671,
                5722
            ],
            [
                5722,
                5779
            ],
            [
                5779,
                5813
            ],
            [
                5813,
                5932
            ],
            [
                5932,
                5980
            ],
            [
                5980,
                6031
            ],
            [
                6031,
                6157
            ],
            [
                6157,
                6293
            ],
            [
                6293,
                6410
            ],
            [
                6410,
                6529
            ],
            [
                6529,
                6664
            ],
            [
                6664,
                6724
            ],
            [
                6724,
                6899
            ],
            [
                6899,
                6954
            ],
            [
                6954,
                6977
            ],
            [
                6977,
                7109
            ],
            [
                7109,
                7327
            ],
            [
                7327,
                7364
            ],
            [
                7364,
                7521
            ],
            [
                7521,
                7551
            ],
            [
                7551,
                7586
            ],
            [
                7586,
                7790
            ],
            [
                7790,
                7809
            ],
            [
                7809,
                7900
            ],
            [
                7900,
                8014
            ],
            [
                8014,
                8187
            ],
            [
                8187,
                8266
            ],
            [
                8266,
                8336
            ],
            [
                8336,
                8388
            ],
            [
                8388,
                8432
            ],
            [
                8432,
                8524
            ],
            [
                8524,
                8591
            ],
            [
                8591,
                8659
            ],
            [
                8659,
                8727
            ],
            [
                8727,
                8773
            ],
            [
                8773,
                8834
            ],
            [
                8834,
                8874
            ],
            [
                8874,
                8919
            ],
            [
                8919,
                8978
            ],
            [
                8978,
                9090
            ],
            [
                9090,
                9118
            ],
            [
                9118,
                9268
            ],
            [
                9268,
                9395
            ],
            [
                9395,
                9440
            ],
            [
                9440,
                9486
            ],
            [
                9486,
                9548
            ],
            [
                9548,
                9668
            ],
            [
                9668,
                9769
            ],
            [
                9769,
                9902
            ],
            [
                9902,
                10188
            ],
            [
                10188,
                10288
            ],
            [
                10288,
                10553
            ],
            [
                10553,
                10885
            ],
            [
                10885,
                10957
            ],
            [
                10957,
                11117
            ],
            [
                11117,
                11199
            ],
            [
                11199,
                11238
            ],
            [
                11238,
                11264
            ],
            [
                11264,
                11332
            ],
            [
                11332,
                11350
            ],
            [
                11350,
                11383
            ],
            [
                11383,
                11428
            ],
            [
                11428,
                11438
            ],
            [
                11438,
                11453
            ],
            [
                11453,
                11536
            ],
            [
                11536,
                11580
            ],
            [
                11580,
                11693
            ]
        ],
        "overlap_chars": [
            [
                0,
                37
            ],
            [
                37,
                55
            ],
            [
                55,
                87
            ],
            [
                96,
                98
            ],
            [
                98,
                99
            ],
            [
                100,
                107
            ],
            [
                108,
                179
            ],
            [
                180,
                210
            ],
            [
                211,
                245
            ],
            [
                261,
                263
            ],
            [
                264,
                286
            ],
            [
                298,
                330
            ],
            [
                330,
                366
            ],
            [
                370,
                428
            ],
            [
                428,
                464
            ],
            [
                467,
                468
            ],
            [
                468,
                505
            ],
            [
                506,
                535
            ],
            [
                541,
                575
            ],
            [
                577,
                585
            ],
            [
                589,
                621
            ],
            [
                622,
                639
            ],
            [
                641,
                647
            ],
            [
                649,
                699
            ],
            [
                700,
                751
            ],
            [
                751,
                789
            ],
            [
                789,
                829
            ],
            [
                829,
                883
            ],
            [
                887,
                908
            ],
            [
                909,
                948
            ],
            [
                950,
                999
            ],
            [
                999,
                1070
            ],
            [
                1071,
                1113
            ],
            [
                1114,
                1163
            ],
            [
                1167,
                1175
            ],
            [
                1179,
                1185
            ],
            [
                1185,
                1250
            ],
            [
                1251,
                1267
            ],
            [
                1270,
                1275
            ],
            [
                1276,
                1308
            ],
            [
                1308,
                1329
            ],
            [
                1330,
                1339
            ],
            [
                1351,
                1361
            ],
            [
                1368,
                1372
            ],
            [
                1372,
                1451
            ],
            [
                1451,
                1493
            ],
            [
                1496,
                1559
            ],
            [
                1563,
                1575
            ],
            [
                1575,
                1624
            ],
            [
                1626,
                1686
            ],
            [
                1686,
                1711
            ],
            [
                1712,
                1803
            ],
            [
                1804,
                1813
            ],
            [
                1814,
                1823
            ],
            [
                1823,
                1825
            ],
            [
                1825,
                1880
            ],
            [
                1884,
                1926
            ],
            [
                1927,
                1978
            ],
            [
                1978,
                2039
            ],
            [
                2039,
                2107
            ],
            [
                2107,
                2108
            ],
            [
                2109,
                2148
            ],
            [
                2148,
                2259
            ],
            [
                2259,
                2295
            ],
            [
                2301,
                2355
            ],
            [
                2360,
                2422
            ],
            [
                2422,
                2510
            ],
            [
                2510,
                2512
            ],
            [
                2512,
                2515
            ],
            [
                2516,
                2526
            ],
            [
                2542,
                2552
            ],
            [
                2568,
                2583
            ],
            [
                2587,
                2610
            ],
            [
                2613,
                2629
            ],
            [
                2630,
                2655
            ],
            [
                2666,
                2672
            ],
            [
                2674,
                2704
            ],
            [
                2705,
                2711
            ],
            [
                2712,
                2731
            ],
            [
                2732,
                2734
            ],
            [
                2737,
                2742
            ],
            [
                2751,
                2759
            ],
            [
                2778,
                2823
            ],
            [
                2827,
                2884
            ],
            [
                2891,
                2909
            ],
            [
                2909,
                2938
            ],
            [
                2946,
                2955
            ],
            [
                2956,
                2960
            ],
            [
                2961,
                2983
            ],
            [
                2984,
                3009
            ],
            [
                3010,
                3020
            ],
            [
                3023,
                3031
            ],
            [
                3037,
                3039
            ],
            [
                3039,
                3077
            ],
            [
                3081,
                3087
            ],
            [
                3096,
                3127
            ],
            [
                3130,
                3144
            ],
            [
                3145,
                3154
            ],
            [
                3154,
                3206
            ],
            [
                3206,
                3207
            ],
            [
                3208,
                3234
            ],
            [
                3235,
                3259
            ],
            [
                3260,
                3270
            ],
            [
                3274,
                3293
            ],
            [
                3293,
                3317
            ],
            [
                3317,
                3340
            ],
            [
                3340,
                3365
            ],
            [
                3367,
                3372
            ],
            [
                3372,
                3409
            ],
            [
                3412,
                3460
            ],
            [
                3460,
                3462
            ],
            [
                3462,
                3492
            ],
            [
                3493,
                3500
            ],
            [
                3501,
                3513
            ],
            [
                3522,
                3581
            ],
            [
                3582,
                3589
            ],
            [
                3589,
                3614
            ],
            [
                3614,
                3616
            ],
            [
                3617,
                3621
            ],
            [
                3621,
                3647
            ],
            [
                3657,
                3675
            ],
            [
                3682,
                3688
            ],
            [
                3689,
                3728
            ],
            [
                3729,
                3734
            ],
            [
                3734,
                3736
            ],
            [
                3736,
                3775
            ],
            [
                3780,
                3793
            ],
            [
                3796,
                3810
            ],
            [
                3815,
                3840
            ],
            [
                3840,
                3864
            ],
            [
                3864,
                3892
            ],
            [
                3901,
                3907
            ],
            [
                3907,
                3923
            ],
            [
                3928,
                3934
            ],
            [
                3935,
                3938
            ],
            [
                3944,
                3965
            ],
            [
                3965,
                3966
            ],
            [
                3967,
                4025
            ],
            [
                4025,
                4042
            ],
            [
                4042,
                4043
            ],
            [
                4044,
                4080
            ],
            [
                4087,
                4105
            ],
            [
                4105,
                4182
            ],
            [
                4190,
                4231
            ],
            [
                4231,
                4284
            ],
            [
                4284,
                4353
            ],
            [
                4353,
                4364
            ],
            [
                4377,
                4385
            ],
            [
                4385,
                4387
            ],
            [
                4387,
                4422
            ],
            [
                4429,
                4442
            ],
            [
                4451,
                4454
            ],
            [
                4455,
                4462
            ],
            [
                4463,
                4466
            ],
            [
                4467,
                4483
            ],
            [
                4490,
                4509
            ],
            [
                4509,
                4526
            ],
            [
                4530,
                4534
            ],
            [
                4537,
                4551
            ],
            [
                4556,
                4561
            ],
            [
                4562,
                4578
            ],
            [
                4579,
                4585
            ],
            [
                4585,
                4596
            ],
            [
                4599,
                4622
            ],
            [
                4628,
                4656
            ],
            [
                4656,
                4679
            ],
            [
                4683,
                4708
            ],
            [
                4711,
                4732
            ],
            [
                4740,
                4742
            ],
            [
                4748,
                4780
            ],
            [
                4780,
                4818
            ],
            [
                4827,
                4838
            ],
            [
                4838,
                4929
            ],
            [
                4929,
                4965
            ],
            [
                4976,
                4980
            ],
            [
                4990,
                4994
            ],
            [
                4995,
                5011
            ],
            [
                5015,
                5034
            ],
            [
                5037,
                5072
            ],
            [
                5072,
                5085
            ],
            [
                5086,
                5092
            ],
            [
                5097,
                5161
            ],
            [
                5162,
                5179
            ],
            [
                5179,
                5206
            ],
            [
                5206,
                5208
            ],
            [
                5208,
                5238
            ],
            [
                5253,
                5261
            ],
            [
                5261,
                5263
            ],
            [
                5263,
                5276
            ],
            [
                5282,
                5295
            ],
            [
                5295,
                5346
            ],
            [
                5347,
                5354
            ],
            [
                5355,
                5358
            ],
            [
                5359,
                5364
            ],
            [
                5368,
                5415
            ],
            [
                5423,
                5438
            ],
            [
                5441,
                5457
            ],
            [
                5458,
                5525
            ],
            [
                5526,
                5543
            ],
            [
                5554,
                5569
            ],
            [
                5570,
                5574
            ],
            [
                5579,
                5581
            ],
            [
                5591,
                5597
            ],
            [
                5609,
                5611
            ],
            [
                5612,
                5627
            ],
            [
                5629,
                5643
            ],
            [
                5643,
                5657
            ],
            [
                5658,
                5668
            ],
            [
                5671,
                5722
            ],
            [
                5722,
                5733
            ],
            [
                5742,
                5743
            ],
            [
                5744,
                5763
            ],
            [
                5764,
                5779
            ],
            [
                5779,
                5813
            ],
            [
                5813,
                5865
            ],
            [
                5873,
                5932
            ],
            [
                5932,
                5980
            ],
            [
                5980,
                5983
            ],
            [
                5984,
                5990
            ],
            [
                5991,
                6031
            ],
            [
                6031,
                6070
            ],
            [
                6071,
                6157
            ],
            [
                6157,
                6245
            ],
            [
                6255,
                6293
            ],
            [
                6293,
                6306
            ],
            [
                6307,
                6408
            ],
            [
                6410,
                6412
            ],
            [
                6413,
                6434
            ],
            [
                6434,
                6509
            ],
            [
                6510,
                6529
            ],
            [
                6529,
                6537
            ],
            [
                6537,
                6538
            ],
            [
                6543,
                6546
            ],
            [
                6557,
                6565
            ],
            [
                6566,
                6569
            ],
            [
                6570,
                6587
            ],
            [
                6587,
                6588
            ],
            [
                6589,
                6638
            ],
            [
                6639,
                6650
            ],
            [
                6658,
                6662
            ],
            [
                6662,
                6664
            ],
            [
                6664,
                6685
            ],
            [
                6686,
                6724
            ],
            [
                6724,
                6782
            ],
            [
                6782,
                6783
            ],
            [
                6791,
                6827
            ],
            [
                6828,
                6831
            ],
            [
                6832,
                6839
            ],
            [
                6840,
                6859
            ],
            [
                6860,
                6897
            ],
            [
                6897,
                6898
            ],
            [
                6899,
                6932
            ],
            [
                6933,
                6954
            ],
            [
                6954,
                6966
            ],
            [
                6967,
                6977
            ],
            [
                6982,
                7003
            ],
            [
                7004,
                7023
            ],
            [
                7024,
                7033
            ],
            [
                7034,
                7037
            ],
            [
                7038,
                7064
            ],
            [
                7065,
                7107
            ],
            [
                7107,
                7109
            ],
            [
                7109,
                7151
            ],
            [
                7152,
                7283
            ],
            [
                7286,
                7289
            ],
            [
                7290,
                7293
            ],
            [
                7294,
                7301
            ],
            [
                7307,
                7315
            ],
            [
                7321,
                7325
            ],
            [
                7325,
                7326
            ],
            [
                7327,
                7335
            ],
            [
                7336,
                7342
            ],
            [
                7343,
                7364
            ],
            [
                7364,
                7508
            ],
            [
                7517,
                7519
            ],
            [
                7519,
                7521
            ],
            [
                7521,
                7551
            ],
            [
                7551,
                7584
            ],
            [
                7584,
                7585
            ],
            [
                7586,
                7623
            ],
            [
                7628,
                7664
            ],
            [
                7667,
                7687
            ],
            [
                7688,
                7744
            ],
            [
                7748,
                7790
            ],
            [
                7790,
                7809
            ],
            [
                7809,
                7840
            ],
            [
                7842,
                7857
            ],
            [
                7861,
                7900
            ],
            [
                7900,
                8014
            ],
            [
                8014,
                8044
            ],
            [
                8044,
                8081
            ],
            [
                8082,
                8090
            ],
            [
                8091,
                8094
            ],
            [
                8094,
                8141
            ],
            [
                8150,
                8153
            ],
            [
                8154,
                8156
            ],
            [
                8164,
                8187
            ],
            [
                8187,
                8221
            ],
            [
                8221,
                8266
            ],
            [
                8266,
                8336
            ],
            [
                8337,
                8385
            ],
            [
                8388,
                8396
            ],
            [
                8414,
                8432
            ],
            [
                8433,
                8438
            ],
            [
                8440,
                8442
            ],
            [
                8448,
                8524
            ],
            [
                8524,
                8591
            ],
            [
                8591,
                8659
            ],
            [
                8666,
                8684
            ],
            [
                8693,
                8719
            ],
            [
                8725,
                8727
            ],
            [
                8727,
                8773
            ],
            [
                8773,
                8802
            ],
            [
                8832,
                8834
            ],
            [
                8834,
                8874
            ],
            [
                8874,
                8878
            ],
            [
                8881,
                8889
            ],
            [
                8897,
                8907
            ],
            [
                8913,
                8917
            ],
            [
                8920,
                8978
            ],
            [
                8978,
                9087
            ],
            [
                9091,
                9100
            ],
            [
                9103,
                9117
            ],
            [
                9123,
                9132
            ],
            [
                9133,
                9225
            ],
            [
                9226,
                9243
            ],
            [
                9244,
                9268
            ],
            [
                9268,
                9329
            ],
            [
                9337,
                9348
            ],
            [
                9348,
                9393
            ],
            [
                9393,
                9395
            ],
            [
                9395,
                9420
            ],
            [
                9431,
                9438
            ],
            [
                9438,
                9440
            ],
            [
                9440,
                9462
            ],
            [
                9463,
                9486
            ],
            [
                9486,
                9521
            ],
            [
                9523,
                9541
            ],
            [
                9542,
                9546
            ],
            [
                9546,
                9548
            ],
            [
                9551,
                9556
            ],
            [
                9557,
                9576
            ],
            [
                9577,
                9628
            ],
            [
                9628,
                9666
            ],
            [
                9666,
                9668
            ],
            [
                9668,
                9767
            ],
            [
                9767,
                9769
            ],
            [
                9769,
                9868
            ],
            [
                9870,
                9877
            ],
            [
                9878,
                9900
            ],
            [
                9900,
                9902
            ],
            [
                9902,
                9908
            ],
            [
                9915,
                9941
            ],
            [
                9942,
                9949
            ],
            [
                9958,
                9960
            ],
            [
                9961,
                9971
            ],
            [
                9972,
                9975
            ],
            [
                9979,
                9983
            ],
            [
                9994,
                10019
            ],
            [
                10020,
                10062
            ],
            [
                10076,
                10133
            ],
            [
                10134,
                10175
            ],
            [
                10176,
                10187
            ],
            [
                10188,
                10218
            ],
            [
                10219,
                10221
            ],
            [
                10229,
                10240
            ],
            [
                10241,
                10259
            ],
            [
                10260,
                10288
            ],
            [
                10288,
                10311
            ],
            [
                10312,
                10342
            ],
            [
                10346,
                10355
            ],
            [
                10355,
                10356
            ],
            [
                10360,
                10389
            ],
            [
                10395,
                10396
            ],
            [
                10397,
                10400
            ],
            [
                10409,
                10416
            ],
            [
                10417,
                10435
            ],
            [
                10436,
                10440
            ],
            [
                10449,
                10457
            ],
            [
                10467,
                10471
            ],
            [
                10471,
                10501
            ],
            [
                10502,
                10513
            ],
            [
                10513,
                10514
            ],
            [
                10515,
                10551
            ],
            [
                10551,
                10552
            ],
            [
                10553,
                10596
            ],
            [
                10597,
                10622
            ],
            [
                10623,
                10626
            ],
            [
                10627,
                10636
            ],
            [
                10637,
                10647
            ],
            [
                10652,
                10662
            ],
            [
                10663,
                10665
            ],
            [
                10666,
                10672
            ],
            [
                10673,
                10724
            ],
            [
                10725,
                10745
            ],
            [
                10748,
                10802
            ],
            [
                10803,
                10806
            ],
            [
                10812,
                10856
            ],
            [
                10857,
                10860
            ],
            [
                10861,
                10867
            ],
            [
                10868,
                10883
            ],
            [
                10894,
                10902
            ],
            [
                10911,
                10920
            ],
            [
                10927,
                10928
            ],
            [
                10933,
                10936
            ],
            [
                10943,
                10955
            ],
            [
                10955,
                10957
            ],
            [
                10957,
                10989
            ],
            [
                10989,
                11009
            ],
            [
                11010,
                11013
            ],
            [
                11014,
                11089
            ],
            [
                11090,
                11117
            ],
            [
                11117,
                11148
            ],
            [
                11152,
                11156
            ],
            [
                11157,
                11199
            ],
            [
                11199,
                11236
            ],
            [
                11236,
                11238
            ],
            [
                11239,
                11261
            ],
            [
                11264,
                11321
            ],
            [
                11330,
                11332
            ],
            [
                11332,
                11350
            ],
            [
                11350,
                11383
            ],
            [
                11386,
                11425
            ],
            [
                11428,
                11438
            ],
            [
                11439,
                11453
            ],
            [
                11453,
                11477
            ],
            [
                11484,
                11533
            ],
            [
                11536,
                11560
            ],
            [
                11561,
                11580
            ],
            [
                11580,
                11592
            ],
            [
                11593,
                11606
            ],
            [
                11607,
                11609
            ],
            [
                11614,
                11619
            ],
            [
                11619,
                11620
            ],
            [
                11620,
                11626
            ],
            [
                11629,
                11650
            ],
            [
                11650,
                11692
            ],
            [
                11692,
                11693
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                37
            ],
            [
                37,
                179
            ],
            [
                179,
                263
            ],
            [
                263,
                297
            ],
            [
                297,
                330
            ],
            [
                330,
                369
            ],
            [
                369,
                369
            ],
            [
                369,
                467
            ],
            [
                467,
                467
            ],
            [
                467,
                751
            ],
            [
                751,
                789
            ],
            [
                789,
                886
            ],
            [
                886,
                999
            ],
            [
                999,
                1166
            ],
            [
                1166,
                1178
            ],
            [
                1178,
                1185
            ],
            [
                1185,
                1308
            ],
            [
                1308,
                1364
            ],
            [
                1364,
                1451
            ],
            [
                1451,
                1562
            ],
            [
                1562,
                1575
            ],
            [
                1575,
                1686
            ],
            [
                1686,
                1686
            ],
            [
                1686,
                1825
            ],
            [
                1825,
                1883
            ],
            [
                1883,
                1978
            ],
            [
                1978,
                2039
            ],
            [
                2039,
                2107
            ],
            [
                2107,
                2148
            ],
            [
                2148,
                2259
            ],
            [
                2259,
                2422
            ],
            [
                2422,
                2512
            ],
            [
                2512,
                2586
            ],
            [
                2586,
                2613
            ],
            [
                2613,
                2629
            ],
            [
                2629,
                2826
            ],
            [
                2826,
                2887
            ],
            [
                2887,
                2909
            ],
            [
                2909,
                3039
            ],
            [
                3039,
                3080
            ],
            [
                3080,
                3154
            ],
            [
                3154,
                3259
            ],
            [
                3259,
                3293
            ],
            [
                3293,
                3317
            ],
            [
                3317,
                3340
            ],
            [
                3340,
                3340
            ],
            [
                3340,
                3372
            ],
            [
                3372,
                3412
            ],
            [
                3412,
                3462
            ],
            [
                3462,
                3589
            ],
            [
                3589,
                3616
            ],
            [
                3616,
                3621
            ],
            [
                3621,
                3678
            ],
            [
                3678,
                3736
            ],
            [
                3736,
                3775
            ],
            [
                3775,
                3810
            ],
            [
                3810,
                3840
            ],
            [
                3840,
                3895
            ],
            [
                3895,
                3907
            ],
            [
                3907,
                3926
            ],
            [
                3926,
                3967
            ],
            [
                3967,
                4025
            ],
            [
                4025,
                4044
            ],
            [
                4044,
                4105
            ],
            [
                4105,
                4231
            ],
            [
                4231,
                4284
            ],
            [
                4284,
                4387
            ],
            [
                4387,
                4483
            ],
            [
                4483,
                4509
            ],
            [
                4509,
                4529
            ],
            [
                4529,
                4537
            ],
            [
                4537,
                4578
            ],
            [
                4578,
                4585
            ],
            [
                4585,
                4599
            ],
            [
                4599,
                4623
            ],
            [
                4623,
                4656
            ],
            [
                4656,
                4682
            ],
            [
                4682,
                4711
            ],
            [
                4711,
                4742
            ],
            [
                4742,
                4780
            ],
            [
                4780,
                4780
            ],
            [
                4780,
                4838
            ],
            [
                4838,
                4929
            ],
            [
                4929,
                5014
            ],
            [
                5014,
                5037
            ],
            [
                5037,
                5072
            ],
            [
                5072,
                5161
            ],
            [
                5161,
                5179
            ],
            [
                5179,
                5208
            ],
            [
                5208,
                5263
            ],
            [
                5263,
                5295
            ],
            [
                5295,
                5367
            ],
            [
                5367,
                5526
            ],
            [
                5526,
                5581
            ],
            [
                5581,
                5581
            ],
            [
                5581,
                5611
            ],
            [
                5611,
                5629
            ],
            [
                5629,
                5629
            ],
            [
                5629,
                5643
            ],
            [
                5643,
                5671
            ],
            [
                5671,
                5722
            ],
            [
                5722,
                5779
            ],
            [
                5779,
                5813
            ],
            [
                5813,
                5932
            ],
            [
                5932,
                5980
            ],
            [
                5980,
                6031
            ],
            [
                6031,
                6157
            ],
            [
                6157,
                6293
            ],
            [
                6293,
                6410
            ],
            [
                6410,
                6529
            ],
            [
                6529,
                6664
            ],
            [
                6664,
                6724
            ],
            [
                6724,
                6899
            ],
            [
                6899,
                6954
            ],
            [
                6954,
                6977
            ],
            [
                6977,
                6977
            ],
            [
                6977,
                7109
            ],
            [
                7109,
                7327
            ],
            [
                7327,
                7364
            ],
            [
                7364,
                7364
            ],
            [
                7364,
                7521
            ],
            [
                7521,
                7551
            ],
            [
                7551,
                7586
            ],
            [
                7586,
                7586
            ],
            [
                7586,
                7790
            ],
            [
                7790,
                7809
            ],
            [
                7809,
                7900
            ],
            [
                7900,
                8014
            ],
            [
                8014,
                8187
            ],
            [
                8187,
                8266
            ],
            [
                8266,
                8336
            ],
            [
                8336,
                8388
            ],
            [
                8388,
                8432
            ],
            [
                8432,
                8524
            ],
            [
                8524,
                8591
            ],
            [
                8591,
                8659
            ],
            [
                8659,
                8727
            ],
            [
                8727,
                8773
            ],
            [
                8773,
                8834
            ],
            [
                8834,
                8874
            ],
            [
                8874,
                8978
            ],
            [
                8978,
                9090
            ],
            [
                9090,
                9118
            ],
            [
                9118,
                9118
            ],
            [
                9118,
                9118
            ],
            [
                9118,
                9118
            ],
            [
                9118,
                9268
            ],
            [
                9268,
                9395
            ],
            [
                9395,
                9440
            ],
            [
                9440,
                9486
            ],
            [
                9486,
                9548
            ],
            [
                9548,
                9668
            ],
            [
                9668,
                9769
            ],
            [
                9769,
                9902
            ],
            [
                9902,
                10188
            ],
            [
                10188,
                10288
            ],
            [
                10288,
                10957
            ],
            [
                10957,
                11117
            ],
            [
                11117,
                11199
            ],
            [
                11199,
                11238
            ],
            [
                11238,
                11264
            ],
            [
                11264,
                11332
            ],
            [
                11332,
                11350
            ],
            [
                11350,
                11383
            ],
            [
                11383,
                11428
            ],
            [
                11428,
                11438
            ],
            [
                11438,
                11453
            ],
            [
                11453,
                11536
            ],
            [
                11536,
                11580
            ],
            [
                11580,
                11693
            ]
        ]
    }
}