{
    "original": {
        "text": "\"Which when his mother saw, she in her mind Was troubled sore, he wist well what to ween.\" SPENSER.\nMargaret had not been gone five minutes when Mr. Thornton came in, his face all a-glow.\n\"I could not come sooner: the superintendent would---- Where is she?\" He looked round the dining-room, and then almost fiercely at his mother, who was quietly re-arranging the disturbed furniture, and did not instantly reply. \"Where is Miss Hale?\" asked he again.\n\"Gone home,\" said she, rather shortly.\n\"Gone home!\"\n\"Yes. She was a great deal better. Indeed, I don't believe it was so very much of a hurt; only some people faint at the least thing.\"\n\"I am sorry she has gone home,\" said he, walking uneasily about. \"She could not have been fit for it.\"\n\"She said she was; and Mr. Lowe said she was. I went for him myself.\"\n\"Thank you, mother.\" He stopped, and partly held out his hand to give her a grateful shake. But she did not notice the movement.\n\"What have you done with your Irish people?\"\n\"Sent to the Dragon, for a good meal for them, poor wretches. And then, luckily, I caught Father Grady, and I've asked him in to speak to them, and dissuade them from going off in a body. How did Miss Hale go home? I'm sure she could not walk.\"\n\"She had a cab. Everything was done properly, even to the paying. Let us talk of something else. She has caused disturbance enough.\"\n\"I don't know where I should have been but for her.\"\n\"Are you become so helpless as to have to be defended by a girl?\" asked Mrs. Thornton scornfully.\nHe reddened. \"Not many girls would have taken the blows on herself which were meant for me;--meant with right down goodwill, too.\"\n\"A girl in love will do a good deal,\" replied Mrs. Thornton, shortly.\n\"Mother!\" He made a step forwards; stood still; heaved with passion.\nShe was a little startled at the evident force he used to keep himself calm. She was not sure of the nature of the emotions she had provoked. It was only their violence that was clear. Was it anger? His eyes glowed, his figure was dilated, his breath came thick and fast. It was a mixture of joy, of anger, of pride, of glad surprise, of panting doubt; but she could not read it. Still it made her uneasy,--as the presence of all strong feeling, of which the cause is not fully understood or sympathised in, always has this effect. She went to the side-board, opened a drawer, and took out a duster, which she kept there for any occasional purpose. She had seen a drop of eau de Cologne on the polished arm of the sofa, and instinctively sought to wipe it off. But she kept her back turned to her son much longer than was necessary; and when she spoke, her voice seemed unusual and constrained.\n\"You have taken some steps about the rioters, I suppose? You don't apprehend anymore violence, do you? Where were the police? Never at hand when they're wanted!\"\n\"On the contrary, I saw three or four of them, when the gates gave way, struggling and beating about in fine fashion; and more came running up just when the yard was clearing. I might have given some of the fellows in charge then, if I had had my wits about me. But there will be no difficulty, plenty of people can identify them.\"\n\"But won't they come back to-night?\"\n\"I'm going to see about a sufficient guard for the premises. I have appointed to meet Captain Hanbury in half an hour at the station.\"\n\"You must have some tea first.\"\n\"Tea! Yes, I suppose I must. It's half-past six, and I may be out for some time. Don't sit up for me, mother.\"\n\"You expect me to go to bed before I have seen you safe, do you?\"\n\"Well, perhaps not.\" He hesitated for a moment. \"But if I've time, I shall go round by Crampton, after I've arranged with the police and seen Hamper and Clarkson.\" Their eyes met; they looked at each other intently for a minute. Then she asked:\n\"Why are you going round by Crampton?\"\n\"To ask after Miss Hale.\"\n\"I will send. Williams must take the water-bed she came to ask for. He shall inquire how she is.\"\n\"I must go myself.\"\n\"Not merely to ask how Miss Hale is?\"\n\"No, not merely for that. I want to thank her for the way in which she stood between me and the mob.\"\n\"What made you go down at all? It was putting your head into the lion's mouth!\"\nHe glanced sharply at her; saw that she did not know what had passed between him and Margaret in the drawing-room: and replied by another question:\n\"Shall you be afraid to be left without me, until I can get some of the police; or had we better send Williams for them now, and they could be here by the time we have done tea? There's no time to be lost. I must be off in a quarter of an hour.\"\nMrs. Thornton left the room. Her servants wondered at her directions, usually so sharply-cut and decided, now confused and uncertain. Mr. Thornton remained in the dining-room, trying to think of the business he had to do at the police-office, and in reality thinking of Margaret. Everything seemed dim and vague beyond--behind--besides the touch of her arms round his neck--the soft clinging which made the dark colour come and go in his cheek as he thought of it.\nThe tea would have been very silent, but for Fanny's perpetual description of her own feelings; how she had been alarmed--and then thought they were gone--and then felt sick and faint and trembling in every limb.\n\"There, that's enough,\" said her brother, rising from the table. \"The reality was enough for me.\" He was going to leave the room, when his mother stopped him with her hand upon his arm.\n\"You will come back here before you go to the Hales',\" said she, in a low, anxious voice.\n\"I know what I know,\" said Fanny to herself.\n\"Why? Will it be too late to disturb them?\"\n\"John, come back to me for this one evening. It will be late for Mrs. Hale. But that is not it. To-morrow, you will---- Come back to-night, John!\" She had seldom pleaded with her son at all--she was too proud for that; but she had never pleaded in vain.\n\"I will return straight here after I have done my business. You will be sure to enquire after them?--after her?\"\nMrs. Thornton was by no means a talkative companion to Fanny, nor yet a good listener while her son was absent. But on his return, her eyes and ears were keen to see and to listen to all the details which he could give, as to the steps he had taken to secure himself, and those whom he chose to employ, from any repetition of the day's outrages. He clearly saw his object. Punishment and suffering, were the natural consequences to those who had taken part in the riot. All that was necessary, in order that property should be protected, and that the will of the proprietor might cut to his end, clean and sharp as a sword.\n\"Mother! You know what I have got to say to Miss Hale, to-morrow?\"\nThe question came upon her suddenly, during a pause in which she, at least, had forgotten Margaret.\nShe looked up at him.\n\"Yes! I do. You can hardly do otherwise.\"\n\"Do otherwise! I don't understand you.\"\n\"I mean that, after allowing her feelings so to overcome her, I consider you bound in honour--\"\n\"Bound in honour,\" said he scornfully. \"I'm afraid honour has nothing to do with it. 'Her feelings overcome her!' What feelings do you mean?\"\n\"Nay, John, there is no need to be angry. Did she not rush down and cling to you to save you from danger?\"\n\"She did!\" said he. \"But, mother,\" continued he, stopping short in his walk right in front of her. \"I dare not hope. I never was faint-hearted before; but I cannot believe such a creature cares for me.\"\n\"Don't be foolish, John. Such a creature! Why, she might be a duke's daughter, to hear you speak. And what proof more would you have, I wonder, of her caring for you? I can believe she has had a struggle with her aristocratic way of viewing things; but I like her the better for seeing clearly at last. It is a good deal for me to say,\" said Mrs. Thornton, smiling slowly, while the tears stood in her eyes; \"for after to-night, I stand second. It was to have you to myself, all to myself, a few hours longer, that I begged you not to go till to-morrow.\"\n\"Dearest mother!\" (Still love is selfish, and in an instant he reverted to his own hopes and fears in a way that drew the cold creeping shadow over Mrs. Thornton's heart.) \"But I know she does not care for me. I shall put myself at her feet--I must. If it were but one chance in a thousand--or a million--I should do it.\"\n\"Don't fear!\" said his mother, crushing down her own personal mortification at the little notice he had taken of the rare ebullition of her maternal feelings--of the pang of jealousy that betrayed the intensity of her disregarded love. \"Don't be afraid,\" she said, coldly. \"As far as love may go she may be worthy of you. It must have taken a good deal to overcome her pride. Don't be afraid, John,\" said she, kissing him, as she wished him good-night. And she went slowly and majestically out of the room. But when she got into her own, she locked the door, and sate down to cry unwonted tears.\n* * * * *\nMargaret entered the room (where her father and mother still sat, holding low conversation together), looking very pale and white. She came close up to them before she could trust herself to speak.\n\"Mrs. Thornton will send the water-bed, mamma.\"\n\"Dear, how tired you look! Is it very hot, Margaret?\"\n\"Very hot, and the streets are rather rough with the strike.\"\nMargaret's colour came back vivid and bright as ever; but it faded away instantly.\n\"Here has been a message from Bessy Higgins, asking you to go to her,\" said Mrs. Hale. \"But I'm sure you look too tired.\"\n\"Yes!\" said Margaret. \"I am tired, I cannot go.\"\nShe was very silent and trembling while she made tea. She was thankful to see her father so much occupied with her mother as not to notice her looks. Even after her mother went to bed, he was not content to be absent from her, but undertook to read her to sleep. Margaret was alone.\n\"Now I will think of it--now I will remember it all. I could not before--I dared not.\" She sat still in her chair, her hands clasped on her knees, her lips compressed, her eyes fixed as one who sees a vision. She drew a deep breath.\n\"I, who hate scenes--I, who have despised people for showing emotion--who have thought them wanting in self-control--I went down and must needs throw myself into the mele, like a romantic fool! Did I do any good? They would have gone away without me, I dare say.\" But this was overleaping the rational conclusion,--as in an instant her well-poised judgment felt. \"No, perhaps they would not. I did some good. But what possessed me to defend that man as if he were a helpless child! Ah!\" said she, clenching her hands together, \"it is no wonder those people thought I was in love with him, after disgracing myself in that way. I in love--and with him too!\" Her pale cheeks suddenly became one flame of fire; and she covered her face with her hands. When she took them away, her palms were wet with scalding tears.\n\"Oh how low I am fallen that they should say that of me! I could not have been so brave for any one else, just because he was so utterly indifferent to me--if, indeed, I do not positively dislike him. It made me the more anxious that there should be fair play on each side; and I could see what fair play was. It was not fair,\" said she vehemently, \"that he should stand there--sheltered, awaiting the soldiers, who might catch those poor maddened creatures as in a trap--without an effort on his part, to bring them to reason. And it was worse than unfair for them to set on him as they threatened. I would do it again, let who will say what they like of me. If I saved one blow, one cruel, angry action that might otherwise have been committed, I did a woman's work. Let them insult my maiden pride as they will--I walk pure before God!\"\nShe looked up, and a noble peace seemed to descend and calm her face, till it was \"stiller than chiselled marble.\"\nDixon came in:\n\"If you please, Miss Margaret, here's the water-bed from Mrs. Thornton's. It's too late for to-night, I'm afraid, for missus is nearly asleep: but it will do nicely for to-morrow.\"\n\"Very,\" said Margaret. \"You must send our best thanks.\"\nDixon left the room for a moment.\n\"If you please, Miss Margaret, he says he's to ask particular how you are. I think he must mean missus; but he says his last words were, to ask how Miss Hale was.\"\n\"Me!\" said Margaret, drawing herself up. \"I am quite well. Tell him I am perfectly well.\" But her complexion was as deadly white as her handkerchief; and her head ached intensely.\nMr. Hale now came in. He had left his sleeping wife; and wanted, as Margaret saw, to be amused and interested by something that she was to tell him. With sweet patience did she bear her pain, without a word of complaint; and rummaged up numberless small subjects for conversation--all except the riot, and that she never named once. It turned her sick to think of it.\n\"Good-night, Margaret. I have every chance of a good night myself, and you are looking very pale with your watching. I shall call Dixon if your mother needs anything. Do you go to bed and sleep like a top; for I'm sure you need it, poor child!\"\n\"Good-night, papa!\"\nShe let her colour go--the false smile fade away--the eyes grow dull with heavy pain. She released her strong will from its laborious task. Till morning she might feel ill and weary.\nShe lay down and never stirred. To move hand or foot, or even so much as one finger, would have been beyond the powers of either volition or motion. She was so tired, so stunned, that she thought she never slept at all; her feverish thoughts passed and repassed the boundary between sleeping and waking, and kept their own miserable identity. She could not be alone, prostrate, powerless as she was,--a cloud of faces looked up at her, giving her no idea of fierce vivid anger, or of personal danger, but a deep sense of shame that she should thus be the object of universal regard--a sense of shame so acute that it seemed as if she would fain have burrowed into the earth to hide herself, and yet she could not escape out of that unwinking glare of many eyes.",
        "paragraph_chars": [
            [
                0,
                100
            ],
            [
                100,
                188
            ],
            [
                188,
                452
            ],
            [
                452,
                491
            ],
            [
                491,
                504
            ],
            [
                504,
                638
            ],
            [
                638,
                741
            ],
            [
                741,
                811
            ],
            [
                811,
                940
            ],
            [
                940,
                985
            ],
            [
                985,
                1230
            ],
            [
                1230,
                1363
            ],
            [
                1363,
                1416
            ],
            [
                1416,
                1514
            ],
            [
                1514,
                1645
            ],
            [
                1645,
                1715
            ],
            [
                1715,
                1784
            ],
            [
                1784,
                2679
            ],
            [
                2679,
                2841
            ],
            [
                2841,
                3173
            ],
            [
                3173,
                3210
            ],
            [
                3210,
                3345
            ],
            [
                3345,
                3377
            ],
            [
                3377,
                3488
            ],
            [
                3488,
                3554
            ],
            [
                3554,
                3799
            ],
            [
                3799,
                3838
            ],
            [
                3838,
                3864
            ],
            [
                3864,
                3962
            ],
            [
                3962,
                3982
            ],
            [
                3982,
                4020
            ],
            [
                4020,
                4122
            ],
            [
                4122,
                4202
            ],
            [
                4202,
                4350
            ],
            [
                4350,
                4596
            ],
            [
                4596,
                5061
            ],
            [
                5061,
                5274
            ],
            [
                5274,
                5460
            ],
            [
                5460,
                5550
            ],
            [
                5550,
                5595
            ],
            [
                5595,
                5639
            ],
            [
                5639,
                5893
            ],
            [
                5893,
                6006
            ],
            [
                6006,
                6630
            ],
            [
                6630,
                6697
            ],
            [
                6697,
                6797
            ],
            [
                6797,
                6819
            ],
            [
                6819,
                6861
            ],
            [
                6861,
                6901
            ],
            [
                6901,
                6997
            ],
            [
                6997,
                7139
            ],
            [
                7139,
                7246
            ],
            [
                7246,
                7449
            ],
            [
                7449,
                8004
            ],
            [
                8004,
                8326
            ],
            [
                8326,
                8922
            ],
            [
                8922,
                8932
            ],
            [
                8932,
                9130
            ],
            [
                9130,
                9178
            ],
            [
                9178,
                9232
            ],
            [
                9232,
                9294
            ],
            [
                9294,
                9377
            ],
            [
                9377,
                9499
            ],
            [
                9499,
                9548
            ],
            [
                9548,
                9831
            ],
            [
                9831,
                10064
            ],
            [
                10064,
                10877
            ],
            [
                10877,
                11717
            ],
            [
                11717,
                11832
            ],
            [
                11832,
                11847
            ],
            [
                11847,
                12028
            ],
            [
                12028,
                12084
            ],
            [
                12084,
                12118
            ],
            [
                12118,
                12282
            ],
            [
                12282,
                12462
            ],
            [
                12462,
                12830
            ],
            [
                12830,
                13075
            ],
            [
                13075,
                13095
            ],
            [
                13095,
                13278
            ],
            [
                13278,
                14039
            ]
        ],
        "segment_chars": [
            [
                0,
                91
            ],
            [
                91,
                100
            ],
            [
                100,
                188
            ],
            [
                188,
                258
            ],
            [
                258,
                414
            ],
            [
                414,
                436
            ],
            [
                436,
                452
            ],
            [
                452,
                491
            ],
            [
                491,
                504
            ],
            [
                504,
                510
            ],
            [
                510,
                539
            ],
            [
                539,
                638
            ],
            [
                638,
                703
            ],
            [
                703,
                741
            ],
            [
                741,
                787
            ],
            [
                787,
                811
            ],
            [
                811,
                832
            ],
            [
                832,
                903
            ],
            [
                903,
                940
            ],
            [
                940,
                985
            ],
            [
                985,
                1047
            ],
            [
                1047,
                1173
            ],
            [
                1173,
                1200
            ],
            [
                1200,
                1230
            ],
            [
                1230,
                1246
            ],
            [
                1246,
                1296
            ],
            [
                1296,
                1327
            ],
            [
                1327,
                1363
            ],
            [
                1363,
                1416
            ],
            [
                1416,
                1482
            ],
            [
                1482,
                1514
            ],
            [
                1514,
                1527
            ],
            [
                1527,
                1645
            ],
            [
                1645,
                1715
            ],
            [
                1715,
                1725
            ],
            [
                1725,
                1784
            ],
            [
                1784,
                1861
            ],
            [
                1861,
                1926
            ],
            [
                1926,
                1969
            ],
            [
                1969,
                1983
            ],
            [
                1983,
                2056
            ],
            [
                2056,
                2164
            ],
            [
                2164,
                2316
            ],
            [
                2316,
                2433
            ],
            [
                2433,
                2545
            ],
            [
                2545,
                2679
            ],
            [
                2679,
                2736
            ],
            [
                2736,
                2782
            ],
            [
                2782,
                2805
            ],
            [
                2805,
                2841
            ],
            [
                2841,
                3017
            ],
            [
                3017,
                3103
            ],
            [
                3103,
                3173
            ],
            [
                3173,
                3210
            ],
            [
                3210,
                3271
            ],
            [
                3271,
                3345
            ],
            [
                3345,
                3377
            ],
            [
                3377,
                3383
            ],
            [
                3383,
                3406
            ],
            [
                3406,
                3458
            ],
            [
                3458,
                3488
            ],
            [
                3488,
                3554
            ],
            [
                3554,
                3575
            ],
            [
                3575,
                3602
            ],
            [
                3602,
                3718
            ],
            [
                3718,
                3783
            ],
            [
                3783,
                3799
            ],
            [
                3799,
                3838
            ],
            [
                3838,
                3864
            ],
            [
                3864,
                3878
            ],
            [
                3878,
                3932
            ],
            [
                3932,
                3962
            ],
            [
                3962,
                3982
            ],
            [
                3982,
                4020
            ],
            [
                4020,
                4046
            ],
            [
                4046,
                4122
            ],
            [
                4122,
                4153
            ],
            [
                4153,
                4202
            ],
            [
                4202,
                4350
            ],
            [
                4350,
                4528
            ],
            [
                4528,
                4556
            ],
            [
                4556,
                4596
            ],
            [
                4596,
                4625
            ],
            [
                4625,
                4730
            ],
            [
                4730,
                4876
            ],
            [
                4876,
                5061
            ],
            [
                5061,
                5274
            ],
            [
                5274,
                5339
            ],
            [
                5339,
                5372
            ],
            [
                5372,
                5460
            ],
            [
                5460,
                5550
            ],
            [
                5550,
                5595
            ],
            [
                5595,
                5601
            ],
            [
                5601,
                5639
            ],
            [
                5639,
                5684
            ],
            [
                5684,
                5715
            ],
            [
                5715,
                5735
            ],
            [
                5735,
                5786
            ],
            [
                5786,
                5893
            ],
            [
                5893,
                5953
            ],
            [
                5953,
                6006
            ],
            [
                6006,
                6118
            ],
            [
                6118,
                6352
            ],
            [
                6352,
                6379
            ],
            [
                6379,
                6476
            ],
            [
                6476,
                6630
            ],
            [
                6630,
                6639
            ],
            [
                6639,
                6697
            ],
            [
                6697,
                6797
            ],
            [
                6797,
                6819
            ],
            [
                6819,
                6825
            ],
            [
                6825,
                6831
            ],
            [
                6831,
                6861
            ],
            [
                6861,
                6876
            ],
            [
                6876,
                6901
            ],
            [
                6901,
                6997
            ],
            [
                6997,
                7036
            ],
            [
                7036,
                7082
            ],
            [
                7082,
                7111
            ],
            [
                7111,
                7139
            ],
            [
                7139,
                7181
            ],
            [
                7181,
                7246
            ],
            [
                7246,
                7257
            ],
            [
                7257,
                7266
            ],
            [
                7266,
                7345
            ],
            [
                7345,
                7363
            ],
            [
                7363,
                7449
            ],
            [
                7449,
                7474
            ],
            [
                7474,
                7491
            ],
            [
                7491,
                7547
            ],
            [
                7547,
                7616
            ],
            [
                7616,
                7752
            ],
            [
                7752,
                7894
            ],
            [
                7894,
                8004
            ],
            [
                8004,
                8022
            ],
            [
                8022,
                8176
            ],
            [
                8176,
                8214
            ],
            [
                8214,
                8254
            ],
            [
                8254,
                8326
            ],
            [
                8326,
                8340
            ],
            [
                8340,
                8562
            ],
            [
                8562,
                8599
            ],
            [
                8599,
                8648
            ],
            [
                8648,
                8702
            ],
            [
                8702,
                8779
            ],
            [
                8779,
                8833
            ],
            [
                8833,
                8922
            ],
            [
                8922,
                8932
            ],
            [
                8932,
                9063
            ],
            [
                9063,
                9130
            ],
            [
                9130,
                9178
            ],
            [
                9178,
                9205
            ],
            [
                9205,
                9232
            ],
            [
                9232,
                9294
            ],
            [
                9294,
                9377
            ],
            [
                9377,
                9464
            ],
            [
                9464,
                9499
            ],
            [
                9499,
                9506
            ],
            [
                9506,
                9521
            ],
            [
                9521,
                9548
            ],
            [
                9548,
                9602
            ],
            [
                9602,
                9698
            ],
            [
                9698,
                9811
            ],
            [
                9811,
                9831
            ],
            [
                9831,
                9884
            ],
            [
                9884,
                9918
            ],
            [
                9918,
                10040
            ],
            [
                10040,
                10064
            ],
            [
                10064,
                10258
            ],
            [
                10258,
                10277
            ],
            [
                10277,
                10328
            ],
            [
                10328,
                10427
            ],
            [
                10427,
                10456
            ],
            [
                10456,
                10473
            ],
            [
                10473,
                10546
            ],
            [
                10546,
                10551
            ],
            [
                10551,
                10690
            ],
            [
                10690,
                10720
            ],
            [
                10720,
                10812
            ],
            [
                10812,
                10877
            ],
            [
                10877,
                10934
            ],
            [
                10934,
                11078
            ],
            [
                11078,
                11187
            ],
            [
                11187,
                11405
            ],
            [
                11405,
                11477
            ],
            [
                11477,
                11537
            ],
            [
                11537,
                11646
            ],
            [
                11646,
                11717
            ],
            [
                11717,
                11832
            ],
            [
                11832,
                11847
            ],
            [
                11847,
                11921
            ],
            [
                11921,
                12028
            ],
            [
                12028,
                12051
            ],
            [
                12051,
                12084
            ],
            [
                12084,
                12118
            ],
            [
                12118,
                12193
            ],
            [
                12193,
                12282
            ],
            [
                12282,
                12288
            ],
            [
                12288,
                12323
            ],
            [
                12323,
                12341
            ],
            [
                12341,
                12372
            ],
            [
                12372,
                12462
            ],
            [
                12462,
                12484
            ],
            [
                12484,
                12611
            ],
            [
                12611,
                12795
            ],
            [
                12795,
                12830
            ],
            [
                12830,
                12853
            ],
            [
                12853,
                12947
            ],
            [
                12947,
                12997
            ],
            [
                12997,
                13075
            ],
            [
                13075,
                13095
            ],
            [
                13095,
                13181
            ],
            [
                13181,
                13235
            ],
            [
                13235,
                13278
            ],
            [
                13278,
                13310
            ],
            [
                13310,
                13427
            ],
            [
                13427,
                13621
            ],
            [
                13621,
                14039
            ]
        ],
        "overlap_chars": [
            [
                100,
                175
            ],
            [
                180,
                188
            ],
            [
                189,
                238
            ],
            [
                243,
                255
            ],
            [
                258,
                329
            ],
            [
                412,
                414
            ],
            [
                415,
                433
            ],
            [
                453,
                462
            ],
            [
                465,
                491
            ],
            [
                492,
                501
            ],
            [
                505,
                510
            ],
            [
                510,
                539
            ],
            [
                539,
                569
            ],
            [
                578,
                635
            ],
            [
                639,
                653
            ],
            [
                658,
                667
            ],
            [
                670,
                678
            ],
            [
                687,
                695
            ],
            [
                701,
                703
            ],
            [
                708,
                738
            ],
            [
                746,
                787
            ],
            [
                787,
                808
            ],
            [
                818,
                829
            ],
            [
                941,
                982
            ],
            [
                991,
                1004
            ],
            [
                1006,
                1047
            ],
            [
                1089,
                1103
            ],
            [
                1075,
                1087
            ],
            [
                1108,
                1161
            ],
            [
                1171,
                1173
            ],
            [
                1173,
                1200
            ],
            [
                1200,
                1227
            ],
            [
                1235,
                1246
            ],
            [
                1296,
                1327
            ],
            [
                1327,
                1360
            ],
            [
                1364,
                1413
            ],
            [
                1417,
                1479
            ],
            [
                1482,
                1501
            ],
            [
                1502,
                1514
            ],
            [
                1514,
                1527
            ],
            [
                1528,
                1604
            ],
            [
                1646,
                1680
            ],
            [
                1683,
                1704
            ],
            [
                1713,
                1715
            ],
            [
                1725,
                1784
            ],
            [
                1784,
                1861
            ],
            [
                1861,
                1926
            ],
            [
                1976,
                1983
            ],
            [
                1983,
                1998
            ],
            [
                2022,
                2056
            ],
            [
                2056,
                2080
            ],
            [
                2084,
                2090
            ],
            [
                2094,
                2164
            ],
            [
                2164,
                2188
            ],
            [
                2314,
                2316
            ],
            [
                2316,
                2336
            ],
            [
                2337,
                2343
            ],
            [
                2558,
                2679
            ],
            [
                2680,
                2736
            ],
            [
                2782,
                2805
            ],
            [
                2805,
                2838
            ],
            [
                2842,
                2912
            ],
            [
                2928,
                3015
            ],
            [
                3174,
                3183
            ],
            [
                3189,
                3198
            ],
            [
                3211,
                3235
            ],
            [
                3247,
                3271
            ],
            [
                3271,
                3272
            ],
            [
                3288,
                3327
            ],
            [
                3346,
                3374
            ],
            [
                3381,
                3383
            ],
            [
                3383,
                3406
            ],
            [
                3430,
                3458
            ],
            [
                3458,
                3485
            ],
            [
                3489,
                3551
            ],
            [
                3555,
                3572
            ],
            [
                3575,
                3602
            ],
            [
                3603,
                3715
            ],
            [
                3718,
                3732
            ],
            [
                3781,
                3783
            ],
            [
                3783,
                3799
            ],
            [
                3800,
                3835
            ],
            [
                3842,
                3861
            ],
            [
                3865,
                3876
            ],
            [
                3876,
                3878
            ],
            [
                3878,
                3932
            ],
            [
                3932,
                3959
            ],
            [
                3963,
                3979
            ],
            [
                4046,
                4119
            ],
            [
                4123,
                4153
            ],
            [
                4153,
                4199
            ],
            [
                4202,
                4315
            ],
            [
                4317,
                4328
            ],
            [
                4332,
                4350
            ],
            [
                4357,
                4392
            ],
            [
                4394,
                4399
            ],
            [
                4418,
                4428
            ],
            [
                4392,
                4393
            ],
            [
                4430,
                4473
            ],
            [
                4526,
                4528
            ],
            [
                4528,
                4556
            ],
            [
                4556,
                4593
            ],
            [
                4596,
                4625
            ],
            [
                4625,
                4729
            ],
            [
                4730,
                4771
            ],
            [
                4854,
                4876
            ],
            [
                4876,
                4914
            ],
            [
                4932,
                4968
            ],
            [
                4970,
                5061
            ],
            [
                5061,
                5181
            ],
            [
                5183,
                5186
            ],
            [
                5192,
                5214
            ],
            [
                5216,
                5258
            ],
            [
                5272,
                5274
            ],
            [
                5286,
                5295
            ],
            [
                5298,
                5339
            ],
            [
                5344,
                5369
            ],
            [
                5372,
                5431
            ],
            [
                5458,
                5460
            ],
            [
                5461,
                5511
            ],
            [
                5515,
                5533
            ],
            [
                5543,
                5550
            ],
            [
                5551,
                5569
            ],
            [
                5572,
                5595
            ],
            [
                5596,
                5599
            ],
            [
                5640,
                5661
            ],
            [
                5666,
                5670
            ],
            [
                5675,
                5684
            ],
            [
                5684,
                5715
            ],
            [
                5715,
                5735
            ],
            [
                5759,
                5768
            ],
            [
                5777,
                5783
            ],
            [
                5786,
                5828
            ],
            [
                5856,
                5857
            ],
            [
                5830,
                5847
            ],
            [
                5891,
                5893
            ],
            [
                5894,
                5951
            ],
            [
                5951,
                5953
            ],
            [
                5953,
                5972
            ],
            [
                5981,
                5992
            ],
            [
                5994,
                6003
            ],
            [
                6006,
                6066
            ],
            [
                6066,
                6071
            ],
            [
                6076,
                6091
            ],
            [
                6116,
                6118
            ],
            [
                6118,
                6124
            ],
            [
                6137,
                6140
            ],
            [
                6129,
                6136
            ],
            [
                6160,
                6167
            ],
            [
                6232,
                6272
            ],
            [
                6309,
                6352
            ],
            [
                6352,
                6379
            ],
            [
                6379,
                6403
            ],
            [
                6405,
                6437
            ],
            [
                6466,
                6474
            ],
            [
                6474,
                6476
            ],
            [
                6480,
                6589
            ],
            [
                6602,
                6630
            ],
            [
                6637,
                6639
            ],
            [
                6639,
                6684
            ],
            [
                6797,
                6818
            ],
            [
                6820,
                6823
            ],
            [
                6825,
                6831
            ],
            [
                6831,
                6858
            ],
            [
                6865,
                6876
            ],
            [
                6876,
                6898
            ],
            [
                6902,
                6993
            ],
            [
                6998,
                7013
            ],
            [
                7016,
                7023
            ],
            [
                7024,
                7036
            ],
            [
                7037,
                7082
            ],
            [
                7083,
                7108
            ],
            [
                7111,
                7136
            ],
            [
                7145,
                7181
            ],
            [
                7181,
                7202
            ],
            [
                7203,
                7243
            ],
            [
                7251,
                7254
            ],
            [
                7267,
                7278
            ],
            [
                7281,
                7303
            ],
            [
                7328,
                7343
            ],
            [
                7346,
                7363
            ],
            [
                7363,
                7374
            ],
            [
                7389,
                7446
            ],
            [
                7453,
                7474
            ],
            [
                7491,
                7547
            ],
            [
                7547,
                7581
            ],
            [
                7593,
                7616
            ],
            [
                7616,
                7633
            ],
            [
                7662,
                7674
            ],
            [
                7696,
                7752
            ],
            [
                7752,
                7783
            ],
            [
                7786,
                7821
            ],
            [
                7832,
                7837
            ],
            [
                7844,
                7856
            ],
            [
                7858,
                7867
            ],
            [
                7876,
                7892
            ],
            [
                7892,
                7894
            ],
            [
                7894,
                7922
            ],
            [
                7939,
                7991
            ],
            [
                8007,
                8019
            ],
            [
                8177,
                8214
            ],
            [
                8214,
                8244
            ],
            [
                8246,
                8254
            ],
            [
                8254,
                8293
            ],
            [
                8295,
                8307
            ],
            [
                8309,
                8323
            ],
            [
                8330,
                8337
            ],
            [
                8340,
                8374
            ],
            [
                8388,
                8438
            ],
            [
                8462,
                8465
            ],
            [
                8443,
                8447
            ],
            [
                8459,
                8461
            ],
            [
                8466,
                8474
            ],
            [
                8560,
                8562
            ],
            [
                8566,
                8578
            ],
            [
                8581,
                8599
            ],
            [
                8600,
                8614
            ],
            [
                8622,
                8648
            ],
            [
                8648,
                8700
            ],
            [
                8744,
                8748
            ],
            [
                8752,
                8777
            ],
            [
                8717,
                8718
            ],
            [
                8779,
                8782
            ],
            [
                8787,
                8833
            ],
            [
                8833,
                8836
            ],
            [
                8855,
                8862
            ],
            [
                8862,
                8888
            ],
            [
                8894,
                8922
            ],
            [
                8932,
                8940
            ],
            [
                8996,
                8997
            ],
            [
                8941,
                8948
            ],
            [
                9034,
                9063
            ],
            [
                9063,
                9083
            ],
            [
                9089,
                9130
            ],
            [
                9132,
                9135
            ],
            [
                9136,
                9175
            ],
            [
                9180,
                9205
            ],
            [
                9205,
                9229
            ],
            [
                9238,
                9291
            ],
            [
                9378,
                9445
            ],
            [
                9448,
                9464
            ],
            [
                9465,
                9496
            ],
            [
                9500,
                9503
            ],
            [
                9506,
                9521
            ],
            [
                9522,
                9545
            ],
            [
                9548,
                9602
            ],
            [
                9602,
                9698
            ],
            [
                9709,
                9735
            ],
            [
                9779,
                9811
            ],
            [
                9811,
                9831
            ],
            [
                9832,
                9854
            ],
            [
                9856,
                9884
            ],
            [
                9884,
                9902
            ],
            [
                9904,
                9915
            ],
            [
                9918,
                9981
            ],
            [
                10003,
                10040
            ],
            [
                10040,
                10064
            ],
            [
                10065,
                10083
            ],
            [
                10088,
                10132
            ],
            [
                10134,
                10179
            ],
            [
                10085,
                10086
            ],
            [
                10197,
                10229
            ],
            [
                10234,
                10258
            ],
            [
                10258,
                10277
            ],
            [
                10277,
                10325
            ],
            [
                10328,
                10345
            ],
            [
                10345,
                10377
            ],
            [
                10379,
                10411
            ],
            [
                10421,
                10426
            ],
            [
                10428,
                10456
            ],
            [
                10456,
                10473
            ],
            [
                10473,
                10546
            ],
            [
                10546,
                10548
            ],
            [
                10551,
                10590
            ],
            [
                10592,
                10690
            ],
            [
                10690,
                10691
            ],
            [
                10692,
                10699
            ],
            [
                10701,
                10717
            ],
            [
                10720,
                10812
            ],
            [
                10812,
                10860
            ],
            [
                10870,
                10877
            ],
            [
                10878,
                10880
            ],
            [
                10881,
                10934
            ],
            [
                10934,
                10941
            ],
            [
                10956,
                10968
            ],
            [
                10981,
                11031
            ],
            [
                11033,
                11078
            ],
            [
                11078,
                11088
            ],
            [
                11098,
                11154
            ],
            [
                11187,
                11202
            ],
            [
                11205,
                11213
            ],
            [
                11264,
                11265
            ],
            [
                11214,
                11225
            ],
            [
                11227,
                11253
            ],
            [
                11266,
                11347
            ],
            [
                11349,
                11356
            ],
            [
                11360,
                11378
            ],
            [
                11380,
                11405
            ],
            [
                11405,
                11445
            ],
            [
                11453,
                11456
            ],
            [
                11475,
                11477
            ],
            [
                11477,
                11496
            ],
            [
                11535,
                11537
            ],
            [
                11537,
                11581
            ],
            [
                11622,
                11646
            ],
            [
                11646,
                11661
            ],
            [
                11678,
                11690
            ],
            [
                11692,
                11714
            ],
            [
                11717,
                11759
            ],
            [
                11772,
                11785
            ],
            [
                11832,
                11845
            ],
            [
                11848,
                11921
            ],
            [
                11921,
                11938
            ],
            [
                11947,
                12015
            ],
            [
                12052,
                12081
            ],
            [
                12119,
                12193
            ],
            [
                12193,
                12233
            ],
            [
                12255,
                12279
            ],
            [
                12288,
                12323
            ],
            [
                12346,
                12369
            ],
            [
                12372,
                12397
            ],
            [
                12405,
                12462
            ],
            [
                12462,
                12484
            ],
            [
                12484,
                12556
            ],
            [
                12609,
                12611
            ],
            [
                12611,
                12630
            ],
            [
                12635,
                12638
            ],
            [
                12644,
                12681
            ],
            [
                12683,
                12741
            ],
            [
                12743,
                12763
            ],
            [
                12795,
                12830
            ],
            [
                12831,
                12853
            ],
            [
                12901,
                12926
            ],
            [
                12945,
                12947
            ],
            [
                12997,
                12999
            ],
            [
                13004,
                13072
            ],
            [
                13076,
                13092
            ],
            [
                13095,
                13102
            ],
            [
                13118,
                13121
            ],
            [
                13128,
                13143
            ],
            [
                13194,
                13235
            ],
            [
                13278,
                13310
            ],
            [
                13310,
                13339
            ],
            [
                13351,
                13385
            ],
            [
                13425,
                13427
            ],
            [
                13427,
                13621
            ],
            [
                13679,
                13724
            ],
            [
                13783,
                13804
            ],
            [
                13861,
                13868
            ],
            [
                13878,
                13891
            ],
            [
                13908,
                13997
            ],
            [
                14005,
                14039
            ]
        ],
        "row_chars": [
            [
                0,
                91
            ],
            [
                91,
                100
            ],
            [
                100,
                188
            ],
            [
                188,
                258
            ],
            [
                258,
                414
            ],
            [
                414,
                436
            ],
            [
                436,
                452
            ],
            [
                452,
                491
            ],
            [
                491,
                504
            ],
            [
                504,
                510
            ],
            [
                510,
                539
            ],
            [
                539,
                638
            ],
            [
                638,
                703
            ],
            [
                703,
                741
            ],
            [
                741,
                787
            ],
            [
                787,
                811
            ],
            [
                811,
                832
            ],
            [
                832,
                903
            ],
            [
                903,
                940
            ],
            [
                940,
                985
            ],
            [
                985,
                1047
            ],
            [
                1047,
                1173
            ],
            [
                1173,
                1200
            ],
            [
                1200,
                1230
            ],
            [
                1230,
                1246
            ],
            [
                1246,
                1296
            ],
            [
                1296,
                1327
            ],
            [
                1327,
                1363
            ],
            [
                1363,
                1416
            ],
            [
                1416,
                1482
            ],
            [
                1482,
                1514
            ],
            [
                1514,
                1527
            ],
            [
                1527,
                1645
            ],
            [
                1645,
                1715
            ],
            [
                1715,
                1725
            ],
            [
                1725,
                1784
            ],
            [
                1784,
                1861
            ],
            [
                1861,
                1926
            ],
            [
                1926,
                1969
            ],
            [
                1969,
                1983
            ],
            [
                1983,
                2056
            ],
            [
                2056,
                2164
            ],
            [
                2164,
                2316
            ],
            [
                2316,
                2679
            ],
            [
                2679,
                2736
            ],
            [
                2736,
                2782
            ],
            [
                2782,
                2805
            ],
            [
                2805,
                2841
            ],
            [
                2841,
                3017
            ],
            [
                3017,
                3103
            ],
            [
                3103,
                3173
            ],
            [
                3173,
                3210
            ],
            [
                3210,
                3271
            ],
            [
                3271,
                3345
            ],
            [
                3345,
                3377
            ],
            [
                3377,
                3383
            ],
            [
                3383,
                3406
            ],
            [
                3406,
                3458
            ],
            [
                3458,
                3488
            ],
            [
                3488,
                3554
            ],
            [
                3554,
                3575
            ],
            [
                3575,
                3602
            ],
            [
                3602,
                3718
            ],
            [
                3718,
                3783
            ],
            [
                3783,
                3799
            ],
            [
                3799,
                3838
            ],
            [
                3838,
                3864
            ],
            [
                3864,
                3878
            ],
            [
                3878,
                3932
            ],
            [
                3932,
                3962
            ],
            [
                3962,
                3982
            ],
            [
                3982,
                4020
            ],
            [
                4020,
                4046
            ],
            [
                4046,
                4122
            ],
            [
                4122,
                4153
            ],
            [
                4153,
                4202
            ],
            [
                4202,
                4350
            ],
            [
                4350,
                4528
            ],
            [
                4528,
                4556
            ],
            [
                4556,
                4596
            ],
            [
                4596,
                4625
            ],
            [
                4625,
                4730
            ],
            [
                4730,
                4876
            ],
            [
                4876,
                5061
            ],
            [
                5061,
                5274
            ],
            [
                5274,
                5339
            ],
            [
                5339,
                5372
            ],
            [
                5372,
                5460
            ],
            [
                5460,
                5550
            ],
            [
                5550,
                5595
            ],
            [
                5595,
                5601
            ],
            [
                5601,
                5639
            ],
            [
                5639,
                5684
            ],
            [
                5684,
                5715
            ],
            [
                5715,
                5735
            ],
            [
                5735,
                5786
            ],
            [
                5786,
                5893
            ],
            [
                5893,
                5953
            ],
            [
                5953,
                6006
            ],
            [
                6006,
                6118
            ],
            [
                6118,
                6352
            ],
            [
                6352,
                6379
            ],
            [
                6379,
                6476
            ],
            [
                6476,
                6630
            ],
            [
                6630,
                6639
            ],
            [
                6639,
                6697
            ],
            [
                6697,
                6797
            ],
            [
                6797,
                6819
            ],
            [
                6819,
                6831
            ],
            [
                6831,
                6861
            ],
            [
                6861,
                6876
            ],
            [
                6876,
                6901
            ],
            [
                6901,
                6997
            ],
            [
                6997,
                7036
            ],
            [
                7036,
                7082
            ],
            [
                7082,
                7111
            ],
            [
                7111,
                7139
            ],
            [
                7139,
                7181
            ],
            [
                7181,
                7246
            ],
            [
                7246,
                7257
            ],
            [
                7257,
                7266
            ],
            [
                7266,
                7363
            ],
            [
                7363,
                7449
            ],
            [
                7449,
                7474
            ],
            [
                7474,
                7491
            ],
            [
                7491,
                7547
            ],
            [
                7547,
                7616
            ],
            [
                7616,
                7752
            ],
            [
                7752,
                7894
            ],
            [
                7894,
                8004
            ],
            [
                8004,
                8022
            ],
            [
                8022,
                8176
            ],
            [
                8176,
                8214
            ],
            [
                8214,
                8254
            ],
            [
                8254,
                8326
            ],
            [
                8326,
                8340
            ],
            [
                8340,
                8562
            ],
            [
                8562,
                8599
            ],
            [
                8599,
                8648
            ],
            [
                8648,
                8702
            ],
            [
                8702,
                8833
            ],
            [
                8833,
                8922
            ],
            [
                8922,
                8932
            ],
            [
                8932,
                9063
            ],
            [
                9063,
                9130
            ],
            [
                9130,
                9178
            ],
            [
                9178,
                9205
            ],
            [
                9205,
                9232
            ],
            [
                9232,
                9294
            ],
            [
                9294,
                9377
            ],
            [
                9377,
                9464
            ],
            [
                9464,
                9499
            ],
            [
                9499,
                9506
            ],
            [
                9506,
                9521
            ],
            [
                9521,
                9548
            ],
            [
                9548,
                9602
            ],
            [
                9602,
                9698
            ],
            [
                9698,
                9811
            ],
            [
                9811,
                9831
            ],
            [
                9831,
                9884
            ],
            [
                9884,
                9918
            ],
            [
                9918,
                10040
            ],
            [
                10040,
                10064
            ],
            [
                10064,
                10258
            ],
            [
                10258,
                10277
            ],
            [
                10277,
                10328
            ],
            [
                10328,
                10427
            ],
            [
                10427,
                10456
            ],
            [
                10456,
                10473
            ],
            [
                10473,
                10546
            ],
            [
                10546,
                10551
            ],
            [
                10551,
                10690
            ],
            [
                10690,
                10720
            ],
            [
                10720,
                10812
            ],
            [
                10812,
                10877
            ],
            [
                10877,
                10934
            ],
            [
                10934,
                11078
            ],
            [
                11078,
                11405
            ],
            [
                11405,
                11477
            ],
            [
                11477,
                11537
            ],
            [
                11537,
                11646
            ],
            [
                11646,
                11717
            ],
            [
                11717,
                11832
            ],
            [
                11832,
                11847
            ],
            [
                11847,
                11921
            ],
            [
                11921,
                12028
            ],
            [
                12028,
                12051
            ],
            [
                12051,
                12084
            ],
            [
                12084,
                12118
            ],
            [
                12118,
                12193
            ],
            [
                12193,
                12282
            ],
            [
                12282,
                12288
            ],
            [
                12288,
                12323
            ],
            [
                12323,
                12341
            ],
            [
                12341,
                12372
            ],
            [
                12372,
                12462
            ],
            [
                12462,
                12484
            ],
            [
                12484,
                12611
            ],
            [
                12611,
                12830
            ],
            [
                12830,
                12853
            ],
            [
                12853,
                12947
            ],
            [
                12947,
                12997
            ],
            [
                12997,
                13075
            ],
            [
                13075,
                13095
            ],
            [
                13095,
                13235
            ],
            [
                13235,
                13278
            ],
            [
                13278,
                13310
            ],
            [
                13310,
                13427
            ],
            [
                13427,
                13621
            ],
            [
                13621,
                14039
            ]
        ]
    },
    "abridged": {
        "text": "Margaret had not been gone five minutes when Mr. Thornton came in, his face a-glow.\n'I could not come sooner: the superintendent would - where is she?' He looked round the dining-room, and then almost fiercely at his mother. 'Where is Miss Hale?\n'Gone home,' said she, rather shortly.\n'Gone home!'\n'Yes. She was a great deal better. Indeed, I don't believe it was much of a hurt; only some people faint at the least thing.'\n'I am sorry she is gone home,' said he, uneasily. 'She could not have been fit for it.'\n'She said she was; and Mr. Lowe said she was. I went for him myself.'\n'Thank you, mother.'\n'What have you done with your Irish people?'\n'Sent to the Dragon for a good meal for them, poor wretches. And I've asked Father Grady in to speak to them, and dissuade them from going off. How did Miss Hale go home? I'm sure she could not walk.'\n'She had a cab. Let us talk of something else. She has caused disturbance enough.'\n'I don't know where I should have been but for her.'\n'Are you become so helpless as to have to be defended by a girl?' asked Mrs. Thornton, scornfully.\nHe reddened. 'Not many girls would have taken the blows on herself which were meant for me.'\n'A girl in love will do a good deal,' replied Mrs. Thornton.\n'Mother!' He made a step forwards; stood still; heaved with passion.\nShe was a little startled at the evident force he used to keep himself calm. She was not sure of the nature of the emotions she had provoked. Anger? His eyes glowed, his breath came thick and fast. It was a mixture of joy, anger, pride, of glad surprise, of panting doubt; but she could not read it. Still it made her uneasy. She went to the sideboard, keeping her back turned to her son much longer than was necessary; and when she spoke, her voice seemed unusual and constrained.\n'You have taken some steps about the rioters, I suppose? Where were the police? Never at hand when they're wanted!'\n'On the contrary, I saw three or four of them, when the gates gave way, beating about in fine fashion; and more came running up just when the yard was clearing.'\n'But won't the rioters come back tonight?'\n'I'm going to see about a guard for the premises. I am to meet Captain Hanbury in half an hour.'\n'You must have some tea first.'\n'Tea! Yes, I suppose I must. I may be out for some time. Don't sit up for me, mother.'\n'You expect me to go to bed before I have seen you safe, do you?'\n'Well, perhaps not.' He hesitated for a moment. 'But if I've time, I shall go round by Crampton, after I've arranged with the police and seen Hamper and Clarkson.' Their eyes met. Then she asked:\n'Why are you going round by Crampton?'\n'To ask after Miss Hale.'\n'I will send a servant. Williams must take the water-bed she came to ask for. He shall inquire how she is.'\n'I must go myself. I want to thank her for the way in which she stood between me and the mob.'\n'What made you go down at all? It was putting your head into the lion's mouth!'\nHe glanced sharply at her; saw that she did not know what had passed between him and Margaret in the drawing-room; and replied with another question:\n'Shall you be afraid to be left without me until the police arrive, or had we better send Williams for them now? There's no time to be lost. I must be off in a quarter of an hour.'\nMrs. Thornton left the room. Her servants wondered at her directions, usually so sharply-cut and decided, now confused and uncertain.\nMr. Thornton remained in the dining-room, thinking of Margaret. Everything seemed dim and vague beyond the touch of her arms round his neck - the soft clinging which made the dark colour come and go in his cheek as he thought of it.\nThe tea would have been very silent, but for Fanny's perpetual description of her own feelings; how she had been alarmed - and thought they were gone - and then felt sick and faint and trembling.\n'That's enough,' said her brother, rising from the table. 'The reality was enough for me.' He was going to leave the room, when his mother stopped him.\n'You will come back here before you go to the Hales',' said she, in a low voice.\n'I know what I know,' said Fanny to herself.\n'Why?'\n'John, come back to me this evening. It will be late for Mrs. Hale. But that is not it. Come back tonight, John!' She had seldom pleaded with her son at all; she was too proud.\n'I will return straight here after I have done my business,' said he. 'You will be sure to inquire after them? - after her?'\nMrs. Thornton was by no means a talkative companion to Fanny that day, nor a good listener. But on her son's return, she was keen to hear him list the steps he had taken to secure himself from any repetition of the day's outrages. He clearly saw his object. Punishment and suffering were the natural consequences to the rioters. That was necessary, in order that property should be protected, and that the will of the proprietor might cut as clean and sharp as a sword.\n'Mother! You know what I have got to say to Miss Hale, tomorrow?'\nShe looked up at him. 'Yes, I do. You can hardly do otherwise.'\n'Do otherwise! I don't understand you.'\n'I mean that, after allowing her feelings so to overcome her, I consider you bound in honour-'\n'Bound in honour,' said he, scornfully. 'I'm afraid honour has nothing to do with it. \"Her feelings overcome her!\" What feelings do you mean?'\n'John, there is no need to be angry. Did she not rush down, and cling to you to save you from danger?'\n'She did! But, mother,' continued he, stopping in front of her, 'I dare not hope. I never was fainthearted before; but I cannot believe such a creature cares for me.'\n'Don't be foolish, John. Why, she might be a duke's daughter, to hear you speak. And what proof more would you have of her caring for you? I can believe she felt herself too aristocratic for you; but I like her the better for seeing clearly at last. It is a good deal for me to say,' said Mrs. Thornton, smiling slowly, with tears in her eyes; 'for after tonight, I stand second with you. It was to have you to myself for a few hours longer, that I begged you not to go till tomorrow!'\n'Dearest mother! But I know she does not care for me. I shall put myself at her feet - I must. If it were but one chance in a thousand - or a million - I should do it.'\n'Don't fear!' said his mother, crushing down her mortification at the little notice he had taken of her rare outburst of maternal feeling. 'Don't be afraid,' she said, coldly. 'As far as love goes she may be worthy of you. It must have taken a good deal to overcome her pride.'\nKissing him, she wished him good-night, and went slowly and majestically out of the room. But once in her own room, she locked the door, and sat down to cry unwonted tears.\nMargaret, on arriving home, had entered looking very pale and white. She came close up to her parents before she could trust herself to speak.\n'Mrs. Thornton will send the water-bed, mamma.'\n'Dear, how tired you look! Is it very hot, Margaret?'\n'Very hot, and the streets are rather rough with the strike.'\n'There has been a message from Bessy Higgins, asking you to go to her,' said Mrs. Hale. 'But I'm sure you look too tired.'\n'Yes!' said Margaret. 'I am tired, I cannot go.'\nShe was very silent and trembling while she made tea. She was thankful to see her father so much occupied with her mother as not to notice her looks. When her mother went to bed, he undertook to read her to sleep. Margaret was alone.\n'Now I will think of it - now I will remember it all. I could not before - I dared not.' She sat still in her chair, her hands clasped on her knees, her eyes fixed as one who sees a vision. She drew a deep breath.\n'I, who hate scenes - who have despised people for showing emotion - who have thought them wanting in self-control - I must needs throw myself into the melee, like a romantic fool! Did I do any good? They would have gone away without me, I dare say.' But this was over-leaping the rational conclusion, as in an instant her well-poised judgement felt.\n'No, perhaps they would not. I did some good. But what possessed me to defend that man as if he were a helpless child! Ah!' said she, clenching her hands together, 'it is no wonder those people thought I was in love with him, after disgracing myself in that way. I, in love - and with him too!' Her pale cheeks suddenly became one flame of fire; and she covered her face with her hands. When she took them away, her palms were wet with tears.\n'Oh, how low I am fallen that they should say that of me! I could be so brave for him, just because he was so utterly indifferent to me - if, indeed, I do not positively dislike him. It made me anxious that there should be fair play on each side; and it was not fair,' said she, vehemently, 'that he should stand there awaiting the soldiers, who might catch those poor maddened creatures as in a trap - without any effort on his part to bring them to reason. And it was worse than unfair for them to attack him. I would do it again. If I saved one blow, one cruel, angry action, I did a woman's work. Let them insult me as they will - I walk pure before God!'\nShe looked up, and a noble peace seemed to calm her face.\nDixon came in. 'If you please, Miss Margaret, here's the water-bed from Mrs. Thornton's. It's too late for tonight, I'm afraid, for missus is nearly asleep: but it will do nicely for tomorrow.'\n'You must send our best thanks.'\n'If you please, Miss Margaret, he says he's to ask particular how you are. I think he must mean missus; but he says to ask how Miss Hale was.'\n'Me!' said Margaret, drawing herself up. 'Tell him I am perfectly well.' But her complexion was as white as her handkerchief; and her head ached intensely.\nMr. Hale now came in. He had left his sleeping wife; and wanted, as Margaret saw, to be amused. With sweet patience she bore her pain, without a word of complaint, and rummaged up numberless small subjects for conversation - all except the riot, for it turned her sick to think of it.\n'Good-night, Margaret. You are looking very pale. Do go to bed and sleep like a top; for I'm sure you need it, poor child!'\n'Good-night, papa.'\nShe let the forced smile fade away, releasing her strong will from its laborious task. She lay down and never stirred. To move hand or foot, or even one finger, would have been beyond her power. She was so tired, so stunned, that she thought she never slept at all; her feverish thoughts passed and repassed the boundary between sleeping and waking, and kept their own miserable identity. A cloud of faces looked up at her, giving her a deep sense of shame - a sense so acute that she would fain have burrowed into the earth to hide herself, and yet she could not escape that unwinking glare of many eyes.",
        "paragraph_chars": [
            [
                0,
                84
            ],
            [
                84,
                246
            ],
            [
                246,
                285
            ],
            [
                285,
                298
            ],
            [
                298,
                424
            ],
            [
                424,
                512
            ],
            [
                512,
                582
            ],
            [
                582,
                603
            ],
            [
                603,
                648
            ],
            [
                648,
                849
            ],
            [
                849,
                932
            ],
            [
                932,
                985
            ],
            [
                985,
                1084
            ],
            [
                1084,
                1177
            ],
            [
                1177,
                1238
            ],
            [
                1238,
                1307
            ],
            [
                1307,
                1789
            ],
            [
                1789,
                1905
            ],
            [
                1905,
                2067
            ],
            [
                2067,
                2110
            ],
            [
                2110,
                2207
            ],
            [
                2207,
                2239
            ],
            [
                2239,
                2326
            ],
            [
                2326,
                2392
            ],
            [
                2392,
                2588
            ],
            [
                2588,
                2627
            ],
            [
                2627,
                2653
            ],
            [
                2653,
                2761
            ],
            [
                2761,
                2856
            ],
            [
                2856,
                2936
            ],
            [
                2936,
                3086
            ],
            [
                3086,
                3267
            ],
            [
                3267,
                3401
            ],
            [
                3401,
                3634
            ],
            [
                3634,
                3830
            ],
            [
                3830,
                3982
            ],
            [
                3982,
                4063
            ],
            [
                4063,
                4108
            ],
            [
                4108,
                4115
            ],
            [
                4115,
                4292
            ],
            [
                4292,
                4417
            ],
            [
                4417,
                4887
            ],
            [
                4887,
                4953
            ],
            [
                4953,
                5017
            ],
            [
                5017,
                5057
            ],
            [
                5057,
                5152
            ],
            [
                5152,
                5295
            ],
            [
                5295,
                5398
            ],
            [
                5398,
                5565
            ],
            [
                5565,
                6051
            ],
            [
                6051,
                6220
            ],
            [
                6220,
                6498
            ],
            [
                6498,
                6671
            ],
            [
                6671,
                6814
            ],
            [
                6814,
                6862
            ],
            [
                6862,
                6916
            ],
            [
                6916,
                6978
            ],
            [
                6978,
                7101
            ],
            [
                7101,
                7150
            ],
            [
                7150,
                7384
            ],
            [
                7384,
                7598
            ],
            [
                7598,
                7949
            ],
            [
                7949,
                8392
            ],
            [
                8392,
                9052
            ],
            [
                9052,
                9110
            ],
            [
                9110,
                9304
            ],
            [
                9304,
                9337
            ],
            [
                9337,
                9480
            ],
            [
                9480,
                9636
            ],
            [
                9636,
                9921
            ],
            [
                9921,
                10045
            ],
            [
                10045,
                10065
            ],
            [
                10065,
                10670
            ]
        ],
        "segment_chars": [
            [
                0,
                84
            ],
            [
                84,
                152
            ],
            [
                152,
                225
            ],
            [
                225,
                246
            ],
            [
                246,
                285
            ],
            [
                285,
                298
            ],
            [
                298,
                304
            ],
            [
                304,
                333
            ],
            [
                333,
                424
            ],
            [
                424,
                474
            ],
            [
                474,
                512
            ],
            [
                512,
                558
            ],
            [
                558,
                582
            ],
            [
                582,
                603
            ],
            [
                603,
                648
            ],
            [
                648,
                709
            ],
            [
                709,
                792
            ],
            [
                792,
                819
            ],
            [
                819,
                849
            ],
            [
                849,
                865
            ],
            [
                865,
                896
            ],
            [
                896,
                932
            ],
            [
                932,
                985
            ],
            [
                985,
                1051
            ],
            [
                1051,
                1084
            ],
            [
                1084,
                1097
            ],
            [
                1097,
                1177
            ],
            [
                1177,
                1238
            ],
            [
                1238,
                1248
            ],
            [
                1248,
                1307
            ],
            [
                1307,
                1384
            ],
            [
                1384,
                1449
            ],
            [
                1449,
                1456
            ],
            [
                1456,
                1505
            ],
            [
                1505,
                1607
            ],
            [
                1607,
                1633
            ],
            [
                1633,
                1789
            ],
            [
                1789,
                1846
            ],
            [
                1846,
                1869
            ],
            [
                1869,
                1905
            ],
            [
                1905,
                2067
            ],
            [
                2067,
                2110
            ],
            [
                2110,
                2160
            ],
            [
                2160,
                2207
            ],
            [
                2207,
                2239
            ],
            [
                2239,
                2245
            ],
            [
                2245,
                2268
            ],
            [
                2268,
                2296
            ],
            [
                2296,
                2326
            ],
            [
                2326,
                2392
            ],
            [
                2392,
                2413
            ],
            [
                2413,
                2440
            ],
            [
                2440,
                2556
            ],
            [
                2556,
                2572
            ],
            [
                2572,
                2588
            ],
            [
                2588,
                2627
            ],
            [
                2627,
                2653
            ],
            [
                2653,
                2677
            ],
            [
                2677,
                2731
            ],
            [
                2731,
                2761
            ],
            [
                2761,
                2780
            ],
            [
                2780,
                2856
            ],
            [
                2856,
                2887
            ],
            [
                2887,
                2936
            ],
            [
                2936,
                3086
            ],
            [
                3086,
                3199
            ],
            [
                3199,
                3227
            ],
            [
                3227,
                3267
            ],
            [
                3267,
                3296
            ],
            [
                3296,
                3401
            ],
            [
                3401,
                3465
            ],
            [
                3465,
                3634
            ],
            [
                3634,
                3830
            ],
            [
                3830,
                3888
            ],
            [
                3888,
                3921
            ],
            [
                3921,
                3982
            ],
            [
                3982,
                4063
            ],
            [
                4063,
                4108
            ],
            [
                4108,
                4115
            ],
            [
                4115,
                4152
            ],
            [
                4152,
                4183
            ],
            [
                4183,
                4203
            ],
            [
                4203,
                4229
            ],
            [
                4229,
                4292
            ],
            [
                4292,
                4362
            ],
            [
                4362,
                4403
            ],
            [
                4403,
                4417
            ],
            [
                4417,
                4509
            ],
            [
                4509,
                4648
            ],
            [
                4648,
                4675
            ],
            [
                4675,
                4746
            ],
            [
                4746,
                4887
            ],
            [
                4887,
                4896
            ],
            [
                4896,
                4953
            ],
            [
                4953,
                4975
            ],
            [
                4975,
                4987
            ],
            [
                4987,
                5017
            ],
            [
                5017,
                5032
            ],
            [
                5032,
                5057
            ],
            [
                5057,
                5152
            ],
            [
                5152,
                5192
            ],
            [
                5192,
                5238
            ],
            [
                5238,
                5267
            ],
            [
                5267,
                5295
            ],
            [
                5295,
                5332
            ],
            [
                5332,
                5398
            ],
            [
                5398,
                5408
            ],
            [
                5408,
                5480
            ],
            [
                5480,
                5565
            ],
            [
                5565,
                5590
            ],
            [
                5590,
                5646
            ],
            [
                5646,
                5704
            ],
            [
                5704,
                5815
            ],
            [
                5815,
                5954
            ],
            [
                5954,
                6051
            ],
            [
                6051,
                6068
            ],
            [
                6068,
                6105
            ],
            [
                6105,
                6146
            ],
            [
                6146,
                6220
            ],
            [
                6220,
                6234
            ],
            [
                6234,
                6359
            ],
            [
                6359,
                6396
            ],
            [
                6396,
                6443
            ],
            [
                6443,
                6498
            ],
            [
                6498,
                6588
            ],
            [
                6588,
                6671
            ],
            [
                6671,
                6740
            ],
            [
                6740,
                6814
            ],
            [
                6814,
                6820
            ],
            [
                6820,
                6862
            ],
            [
                6862,
                6889
            ],
            [
                6889,
                6916
            ],
            [
                6916,
                6978
            ],
            [
                6978,
                7066
            ],
            [
                7066,
                7101
            ],
            [
                7101,
                7108
            ],
            [
                7108,
                7123
            ],
            [
                7123,
                7150
            ],
            [
                7150,
                7204
            ],
            [
                7204,
                7300
            ],
            [
                7300,
                7364
            ],
            [
                7364,
                7384
            ],
            [
                7384,
                7438
            ],
            [
                7438,
                7473
            ],
            [
                7473,
                7574
            ],
            [
                7574,
                7598
            ],
            [
                7598,
                7779
            ],
            [
                7779,
                7798
            ],
            [
                7798,
                7849
            ],
            [
                7849,
                7949
            ],
            [
                7949,
                7978
            ],
            [
                7978,
                7995
            ],
            [
                7995,
                8068
            ],
            [
                8068,
                8073
            ],
            [
                8073,
                8212
            ],
            [
                8212,
                8244
            ],
            [
                8244,
                8336
            ],
            [
                8336,
                8392
            ],
            [
                8392,
                8450
            ],
            [
                8450,
                8575
            ],
            [
                8575,
                8851
            ],
            [
                8851,
                8904
            ],
            [
                8904,
                8925
            ],
            [
                8925,
                8993
            ],
            [
                8993,
                9052
            ],
            [
                9052,
                9110
            ],
            [
                9110,
                9125
            ],
            [
                9125,
                9199
            ],
            [
                9199,
                9304
            ],
            [
                9304,
                9337
            ],
            [
                9337,
                9412
            ],
            [
                9412,
                9480
            ],
            [
                9480,
                9486
            ],
            [
                9486,
                9521
            ],
            [
                9521,
                9553
            ],
            [
                9553,
                9636
            ],
            [
                9636,
                9658
            ],
            [
                9658,
                9732
            ],
            [
                9732,
                9921
            ],
            [
                9921,
                9944
            ],
            [
                9944,
                9971
            ],
            [
                9971,
                10045
            ],
            [
                10045,
                10065
            ],
            [
                10065,
                10152
            ],
            [
                10152,
                10184
            ],
            [
                10184,
                10260
            ],
            [
                10260,
                10454
            ],
            [
                10454,
                10670
            ]
        ],
        "overlap_chars": [
            [
                0,
                75
            ],
            [
                76,
                84
            ],
            [
                85,
                134
            ],
            [
                137,
                149
            ],
            [
                152,
                223
            ],
            [
                223,
                225
            ],
            [
                226,
                244
            ],
            [
                247,
                256
            ],
            [
                259,
                285
            ],
            [
                286,
                295
            ],
            [
                299,
                304
            ],
            [
                304,
                333
            ],
            [
                333,
                363
            ],
            [
                364,
                421
            ],
            [
                425,
                439
            ],
            [
                443,
                452
            ],
            [
                455,
                463
            ],
            [
                464,
                472
            ],
            [
                472,
                474
            ],
            [
                479,
                509
            ],
            [
                517,
                558
            ],
            [
                558,
                579
            ],
            [
                589,
                600
            ],
            [
                604,
                645
            ],
            [
                654,
                667
            ],
            [
                668,
                709
            ],
            [
                709,
                723
            ],
            [
                724,
                736
            ],
            [
                737,
                790
            ],
            [
                790,
                792
            ],
            [
                792,
                819
            ],
            [
                819,
                846
            ],
            [
                854,
                865
            ],
            [
                865,
                896
            ],
            [
                896,
                929
            ],
            [
                933,
                982
            ],
            [
                986,
                1048
            ],
            [
                1051,
                1070
            ],
            [
                1072,
                1084
            ],
            [
                1084,
                1097
            ],
            [
                1098,
                1174
            ],
            [
                1178,
                1212
            ],
            [
                1215,
                1236
            ],
            [
                1236,
                1238
            ],
            [
                1248,
                1307
            ],
            [
                1307,
                1384
            ],
            [
                1384,
                1449
            ],
            [
                1449,
                1456
            ],
            [
                1456,
                1471
            ],
            [
                1471,
                1505
            ],
            [
                1505,
                1529
            ],
            [
                1530,
                1536
            ],
            [
                1537,
                1607
            ],
            [
                1607,
                1631
            ],
            [
                1631,
                1633
            ],
            [
                1633,
                1653
            ],
            [
                1653,
                1659
            ],
            [
                1668,
                1789
            ],
            [
                1790,
                1846
            ],
            [
                1846,
                1869
            ],
            [
                1869,
                1902
            ],
            [
                1906,
                1976
            ],
            [
                1977,
                2064
            ],
            [
                2068,
                2077
            ],
            [
                2090,
                2099
            ],
            [
                2111,
                2135
            ],
            [
                2136,
                2160
            ],
            [
                2160,
                2161
            ],
            [
                2165,
                2204
            ],
            [
                2208,
                2236
            ],
            [
                2243,
                2245
            ],
            [
                2245,
                2268
            ],
            [
                2268,
                2296
            ],
            [
                2296,
                2323
            ],
            [
                2327,
                2389
            ],
            [
                2393,
                2410
            ],
            [
                2413,
                2440
            ],
            [
                2441,
                2553
            ],
            [
                2556,
                2570
            ],
            [
                2570,
                2572
            ],
            [
                2572,
                2588
            ],
            [
                2589,
                2624
            ],
            [
                2631,
                2650
            ],
            [
                2654,
                2665
            ],
            [
                2675,
                2677
            ],
            [
                2677,
                2731
            ],
            [
                2731,
                2758
            ],
            [
                2762,
                2778
            ],
            [
                2780,
                2853
            ],
            [
                2857,
                2887
            ],
            [
                2887,
                2933
            ],
            [
                2936,
                3049
            ],
            [
                3051,
                3062
            ],
            [
                3068,
                3086
            ],
            [
                3093,
                3128
            ],
            [
                3129,
                3134
            ],
            [
                3135,
                3145
            ],
            [
                3152,
                3153
            ],
            [
                3154,
                3197
            ],
            [
                3197,
                3199
            ],
            [
                3199,
                3227
            ],
            [
                3227,
                3264
            ],
            [
                3267,
                3296
            ],
            [
                3296,
                3400
            ],
            [
                3401,
                3442
            ],
            [
                3443,
                3465
            ],
            [
                3465,
                3503
            ],
            [
                3504,
                3540
            ],
            [
                3543,
                3634
            ],
            [
                3634,
                3754
            ],
            [
                3757,
                3760
            ],
            [
                3761,
                3783
            ],
            [
                3786,
                3828
            ],
            [
                3828,
                3830
            ],
            [
                3835,
                3844
            ],
            [
                3847,
                3888
            ],
            [
                3893,
                3918
            ],
            [
                3921,
                3980
            ],
            [
                3980,
                3982
            ],
            [
                3983,
                4033
            ],
            [
                4037,
                4055
            ],
            [
                4056,
                4063
            ],
            [
                4064,
                4082
            ],
            [
                4085,
                4108
            ],
            [
                4109,
                4112
            ],
            [
                4116,
                4137
            ],
            [
                4138,
                4142
            ],
            [
                4143,
                4152
            ],
            [
                4152,
                4183
            ],
            [
                4183,
                4203
            ],
            [
                4203,
                4212
            ],
            [
                4220,
                4226
            ],
            [
                4229,
                4271
            ],
            [
                4271,
                4272
            ],
            [
                4273,
                4290
            ],
            [
                4290,
                4292
            ],
            [
                4293,
                4350
            ],
            [
                4360,
                4362
            ],
            [
                4363,
                4382
            ],
            [
                4391,
                4402
            ],
            [
                4405,
                4414
            ],
            [
                4417,
                4477
            ],
            [
                4486,
                4491
            ],
            [
                4492,
                4507
            ],
            [
                4507,
                4509
            ],
            [
                4509,
                4515
            ],
            [
                4516,
                4519
            ],
            [
                4526,
                4533
            ],
            [
                4542,
                4549
            ],
            [
                4564,
                4604
            ],
            [
                4605,
                4648
            ],
            [
                4648,
                4675
            ],
            [
                4675,
                4699
            ],
            [
                4700,
                4732
            ],
            [
                4733,
                4741
            ],
            [
                4744,
                4746
            ],
            [
                4746,
                4855
            ],
            [
                4859,
                4887
            ],
            [
                4894,
                4896
            ],
            [
                4896,
                4941
            ],
            [
                4953,
                4974
            ],
            [
                4976,
                4979
            ],
            [
                4981,
                4987
            ],
            [
                4987,
                5014
            ],
            [
                5021,
                5032
            ],
            [
                5032,
                5054
            ],
            [
                5058,
                5149
            ],
            [
                5153,
                5168
            ],
            [
                5171,
                5178
            ],
            [
                5180,
                5192
            ],
            [
                5193,
                5238
            ],
            [
                5239,
                5264
            ],
            [
                5267,
                5292
            ],
            [
                5296,
                5332
            ],
            [
                5332,
                5353
            ],
            [
                5355,
                5395
            ],
            [
                5403,
                5406
            ],
            [
                5408,
                5419
            ],
            [
                5422,
                5444
            ],
            [
                5445,
                5460
            ],
            [
                5463,
                5480
            ],
            [
                5480,
                5491
            ],
            [
                5505,
                5562
            ],
            [
                5569,
                5590
            ],
            [
                5590,
                5646
            ],
            [
                5646,
                5680
            ],
            [
                5681,
                5704
            ],
            [
                5704,
                5721
            ],
            [
                5739,
                5751
            ],
            [
                5759,
                5815
            ],
            [
                5815,
                5846
            ],
            [
                5849,
                5884
            ],
            [
                5890,
                5895
            ],
            [
                5896,
                5908
            ],
            [
                5910,
                5919
            ],
            [
                5927,
                5943
            ],
            [
                5952,
                5954
            ],
            [
                5954,
                5982
            ],
            [
                5987,
                6039
            ],
            [
                6054,
                6066
            ],
            [
                6068,
                6105
            ],
            [
                6105,
                6135
            ],
            [
                6138,
                6146
            ],
            [
                6146,
                6185
            ],
            [
                6188,
                6200
            ],
            [
                6203,
                6217
            ],
            [
                6224,
                6231
            ],
            [
                6234,
                6268
            ],
            [
                6269,
                6319
            ],
            [
                6320,
                6323
            ],
            [
                6324,
                6328
            ],
            [
                6338,
                6340
            ],
            [
                6341,
                6349
            ],
            [
                6357,
                6359
            ],
            [
                6363,
                6375
            ],
            [
                6378,
                6396
            ],
            [
                6397,
                6411
            ],
            [
                6417,
                6443
            ],
            [
                6443,
                6495
            ],
            [
                6506,
                6510
            ],
            [
                6511,
                6536
            ],
            [
                6536,
                6537
            ],
            [
                6538,
                6541
            ],
            [
                6542,
                6588
            ],
            [
                6588,
                6591
            ],
            [
                6600,
                6607
            ],
            [
                6612,
                6638
            ],
            [
                6643,
                6671
            ],
            [
                6671,
                6679
            ],
            [
                6679,
                6680
            ],
            [
                6703,
                6710
            ],
            [
                6711,
                6740
            ],
            [
                6740,
                6760
            ],
            [
                6773,
                6814
            ],
            [
                6816,
                6819
            ],
            [
                6820,
                6859
            ],
            [
                6864,
                6889
            ],
            [
                6889,
                6913
            ],
            [
                6922,
                6975
            ],
            [
                6980,
                7047
            ],
            [
                7050,
                7066
            ],
            [
                7067,
                7098
            ],
            [
                7102,
                7105
            ],
            [
                7108,
                7123
            ],
            [
                7124,
                7147
            ],
            [
                7150,
                7204
            ],
            [
                7204,
                7300
            ],
            [
                7305,
                7331
            ],
            [
                7332,
                7364
            ],
            [
                7364,
                7384
            ],
            [
                7385,
                7407
            ],
            [
                7410,
                7438
            ],
            [
                7438,
                7456
            ],
            [
                7459,
                7470
            ],
            [
                7473,
                7536
            ],
            [
                7537,
                7574
            ],
            [
                7574,
                7598
            ],
            [
                7599,
                7617
            ],
            [
                7620,
                7664
            ],
            [
                7667,
                7712
            ],
            [
                7715,
                7716
            ],
            [
                7717,
                7749
            ],
            [
                7755,
                7779
            ],
            [
                7779,
                7798
            ],
            [
                7798,
                7846
            ],
            [
                7849,
                7866
            ],
            [
                7867,
                7899
            ],
            [
                7900,
                7932
            ],
            [
                7943,
                7948
            ],
            [
                7950,
                7978
            ],
            [
                7978,
                7995
            ],
            [
                7995,
                8068
            ],
            [
                8068,
                8070
            ],
            [
                8073,
                8112
            ],
            [
                8114,
                8212
            ],
            [
                8212,
                8213
            ],
            [
                8215,
                8222
            ],
            [
                8225,
                8241
            ],
            [
                8244,
                8336
            ],
            [
                8336,
                8384
            ],
            [
                8385,
                8392
            ],
            [
                8393,
                8395
            ],
            [
                8397,
                8450
            ],
            [
                8450,
                8457
            ],
            [
                8461,
                8473
            ],
            [
                8477,
                8527
            ],
            [
                8530,
                8575
            ],
            [
                8575,
                8585
            ],
            [
                8586,
                8642
            ],
            [
                8643,
                8658
            ],
            [
                8661,
                8669
            ],
            [
                8669,
                8670
            ],
            [
                8671,
                8682
            ],
            [
                8684,
                8710
            ],
            [
                8711,
                8792
            ],
            [
                8795,
                8802
            ],
            [
                8807,
                8825
            ],
            [
                8826,
                8851
            ],
            [
                8851,
                8891
            ],
            [
                8899,
                8902
            ],
            [
                8902,
                8904
            ],
            [
                8904,
                8923
            ],
            [
                8923,
                8925
            ],
            [
                8925,
                8969
            ],
            [
                8969,
                8993
            ],
            [
                8993,
                9008
            ],
            [
                9012,
                9024
            ],
            [
                9027,
                9049
            ],
            [
                9052,
                9094
            ],
            [
                9095,
                9108
            ],
            [
                9110,
                9123
            ],
            [
                9126,
                9199
            ],
            [
                9199,
                9216
            ],
            [
                9224,
                9292
            ],
            [
                9305,
                9334
            ],
            [
                9338,
                9412
            ],
            [
                9412,
                9452
            ],
            [
                9453,
                9477
            ],
            [
                9486,
                9521
            ],
            [
                9527,
                9550
            ],
            [
                9553,
                9578
            ],
            [
                9579,
                9636
            ],
            [
                9636,
                9658
            ],
            [
                9658,
                9730
            ],
            [
                9730,
                9732
            ],
            [
                9732,
                9751
            ],
            [
                9752,
                9755
            ],
            [
                9761,
                9798
            ],
            [
                9800,
                9858
            ],
            [
                9861,
                9881
            ],
            [
                9886,
                9921
            ],
            [
                9922,
                9944
            ],
            [
                9944,
                9969
            ],
            [
                9969,
                9971
            ],
            [
                9971,
                9973
            ],
            [
                9974,
                10042
            ],
            [
                10046,
                10062
            ],
            [
                10065,
                10072
            ],
            [
                10073,
                10076
            ],
            [
                10084,
                10099
            ],
            [
                10111,
                10152
            ],
            [
                10152,
                10184
            ],
            [
                10184,
                10213
            ],
            [
                10214,
                10248
            ],
            [
                10258,
                10260
            ],
            [
                10260,
                10454
            ],
            [
                10454,
                10499
            ],
            [
                10500,
                10521
            ],
            [
                10524,
                10531
            ],
            [
                10532,
                10545
            ],
            [
                10546,
                10635
            ],
            [
                10636,
                10670
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                84
            ],
            [
                84,
                152
            ],
            [
                152,
                225
            ],
            [
                225,
                246
            ],
            [
                246,
                246
            ],
            [
                246,
                285
            ],
            [
                285,
                298
            ],
            [
                298,
                304
            ],
            [
                304,
                333
            ],
            [
                333,
                424
            ],
            [
                424,
                474
            ],
            [
                474,
                512
            ],
            [
                512,
                558
            ],
            [
                558,
                582
            ],
            [
                582,
                603
            ],
            [
                603,
                603
            ],
            [
                603,
                603
            ],
            [
                603,
                648
            ],
            [
                648,
                709
            ],
            [
                709,
                792
            ],
            [
                792,
                819
            ],
            [
                819,
                849
            ],
            [
                849,
                865
            ],
            [
                865,
                865
            ],
            [
                865,
                896
            ],
            [
                896,
                932
            ],
            [
                932,
                985
            ],
            [
                985,
                1051
            ],
            [
                1051,
                1084
            ],
            [
                1084,
                1097
            ],
            [
                1097,
                1177
            ],
            [
                1177,
                1238
            ],
            [
                1238,
                1248
            ],
            [
                1248,
                1307
            ],
            [
                1307,
                1384
            ],
            [
                1384,
                1449
            ],
            [
                1449,
                1449
            ],
            [
                1449,
                1456
            ],
            [
                1456,
                1505
            ],
            [
                1505,
                1607
            ],
            [
                1607,
                1633
            ],
            [
                1633,
                1789
            ],
            [
                1789,
                1846
            ],
            [
                1846,
                1846
            ],
            [
                1846,
                1869
            ],
            [
                1869,
                1905
            ],
            [
                1905,
                2067
            ],
            [
                2067,
                2067
            ],
            [
                2067,
                2067
            ],
            [
                2067,
                2110
            ],
            [
                2110,
                2160
            ],
            [
                2160,
                2207
            ],
            [
                2207,
                2239
            ],
            [
                2239,
                2245
            ],
            [
                2245,
                2268
            ],
            [
                2268,
                2296
            ],
            [
                2296,
                2326
            ],
            [
                2326,
                2392
            ],
            [
                2392,
                2413
            ],
            [
                2413,
                2440
            ],
            [
                2440,
                2556
            ],
            [
                2556,
                2572
            ],
            [
                2572,
                2588
            ],
            [
                2588,
                2627
            ],
            [
                2627,
                2653
            ],
            [
                2653,
                2677
            ],
            [
                2677,
                2731
            ],
            [
                2731,
                2761
            ],
            [
                2761,
                2780
            ],
            [
                2780,
                2780
            ],
            [
                2780,
                2780
            ],
            [
                2780,
                2856
            ],
            [
                2856,
                2887
            ],
            [
                2887,
                2936
            ],
            [
                2936,
                3086
            ],
            [
                3086,
                3199
            ],
            [
                3199,
                3227
            ],
            [
                3227,
                3267
            ],
            [
                3267,
                3296
            ],
            [
                3296,
                3401
            ],
            [
                3401,
                3465
            ],
            [
                3465,
                3634
            ],
            [
                3634,
                3830
            ],
            [
                3830,
                3888
            ],
            [
                3888,
                3921
            ],
            [
                3921,
                3982
            ],
            [
                3982,
                4063
            ],
            [
                4063,
                4108
            ],
            [
                4108,
                4115
            ],
            [
                4115,
                4115
            ],
            [
                4115,
                4152
            ],
            [
                4152,
                4183
            ],
            [
                4183,
                4203
            ],
            [
                4203,
                4229
            ],
            [
                4229,
                4292
            ],
            [
                4292,
                4362
            ],
            [
                4362,
                4417
            ],
            [
                4417,
                4509
            ],
            [
                4509,
                4648
            ],
            [
                4648,
                4675
            ],
            [
                4675,
                4746
            ],
            [
                4746,
                4887
            ],
            [
                4887,
                4896
            ],
            [
                4896,
                4953
            ],
            [
                4953,
                4953
            ],
            [
                4953,
                4975
            ],
            [
                4975,
                4987
            ],
            [
                4987,
                5017
            ],
            [
                5017,
                5032
            ],
            [
                5032,
                5057
            ],
            [
                5057,
                5152
            ],
            [
                5152,
                5192
            ],
            [
                5192,
                5238
            ],
            [
                5238,
                5267
            ],
            [
                5267,
                5295
            ],
            [
                5295,
                5332
            ],
            [
                5332,
                5398
            ],
            [
                5398,
                5408
            ],
            [
                5408,
                5408
            ],
            [
                5408,
                5480
            ],
            [
                5480,
                5565
            ],
            [
                5565,
                5590
            ],
            [
                5590,
                5590
            ],
            [
                5590,
                5646
            ],
            [
                5646,
                5704
            ],
            [
                5704,
                5815
            ],
            [
                5815,
                5954
            ],
            [
                5954,
                6051
            ],
            [
                6051,
                6068
            ],
            [
                6068,
                6068
            ],
            [
                6068,
                6105
            ],
            [
                6105,
                6146
            ],
            [
                6146,
                6220
            ],
            [
                6220,
                6234
            ],
            [
                6234,
                6359
            ],
            [
                6359,
                6396
            ],
            [
                6396,
                6443
            ],
            [
                6443,
                6498
            ],
            [
                6498,
                6588
            ],
            [
                6588,
                6671
            ],
            [
                6671,
                6671
            ],
            [
                6671,
                6740
            ],
            [
                6740,
                6814
            ],
            [
                6814,
                6862
            ],
            [
                6862,
                6889
            ],
            [
                6889,
                6916
            ],
            [
                6916,
                6978
            ],
            [
                6978,
                6978
            ],
            [
                6978,
                7066
            ],
            [
                7066,
                7101
            ],
            [
                7101,
                7108
            ],
            [
                7108,
                7123
            ],
            [
                7123,
                7150
            ],
            [
                7150,
                7204
            ],
            [
                7204,
                7300
            ],
            [
                7300,
                7364
            ],
            [
                7364,
                7384
            ],
            [
                7384,
                7438
            ],
            [
                7438,
                7473
            ],
            [
                7473,
                7574
            ],
            [
                7574,
                7598
            ],
            [
                7598,
                7779
            ],
            [
                7779,
                7798
            ],
            [
                7798,
                7849
            ],
            [
                7849,
                7949
            ],
            [
                7949,
                7978
            ],
            [
                7978,
                7995
            ],
            [
                7995,
                8068
            ],
            [
                8068,
                8073
            ],
            [
                8073,
                8212
            ],
            [
                8212,
                8244
            ],
            [
                8244,
                8336
            ],
            [
                8336,
                8392
            ],
            [
                8392,
                8450
            ],
            [
                8450,
                8575
            ],
            [
                8575,
                8851
            ],
            [
                8851,
                8904
            ],
            [
                8904,
                8925
            ],
            [
                8925,
                8993
            ],
            [
                8993,
                9052
            ],
            [
                9052,
                9110
            ],
            [
                9110,
                9125
            ],
            [
                9125,
                9199
            ],
            [
                9199,
                9304
            ],
            [
                9304,
                9304
            ],
            [
                9304,
                9337
            ],
            [
                9337,
                9337
            ],
            [
                9337,
                9412
            ],
            [
                9412,
                9480
            ],
            [
                9480,
                9486
            ],
            [
                9486,
                9521
            ],
            [
                9521,
                9521
            ],
            [
                9521,
                9553
            ],
            [
                9553,
                9636
            ],
            [
                9636,
                9658
            ],
            [
                9658,
                9732
            ],
            [
                9732,
                9921
            ],
            [
                9921,
                9944
            ],
            [
                9944,
                9971
            ],
            [
                9971,
                9971
            ],
            [
                9971,
                10045
            ],
            [
                10045,
                10065
            ],
            [
                10065,
                10152
            ],
            [
                10152,
                10152
            ],
            [
                10152,
                10184
            ],
            [
                10184,
                10260
            ],
            [
                10260,
                10454
            ],
            [
                10454,
                10670
            ]
        ]
    }
}