{
    "original": {
        "text": "\"Your beauty was the first that won the place And scal'd the walls of my undaunted heart, Which, captive now, pines in a caitive case, Unkindly met with rigour for desert:-- Yet not the less your servant shall abide, In spite of rude repulse or silent pride.\" WILLIAM FOWLER.\nThe next morning, Margaret dragged herself up, thankful that the night was over,--unrefreshed, yet rested. All had gone well through the house; her mother had only wakened once. A little breeze was stirring in the hot air, and though there were no trees to show the playful tossing movement caused by the wind among the leaves, Margaret knew how, somewhere or another, by wayside, in copses, or in thick green woods, there was a pleasant, murmuring dancing sound,--a rushing and falling noise, the very thought of which was an echo of distinct gladness in her heart.\nShe sat at her work in Mrs. Hale's room. As soon as that forenoon slumber was over, she would help her mother to dress; after dinner, she would go and see Bessy Higgins. She would banish all recollection of the Thornton family--no need to think of them till they absolutely stood before her in flesh and blood. But, of course, the effort not to think of them brought them only the more strongly before her; and from time to time, the hot flush came over her pale face sweeping it into colour, as a sunbeam from between watery clouds comes swiftly moving over the sea.\nDixon opened the door very softly, and stole on tiptoe up to Margaret, sitting by the shaded window.\n\"Mr. Thornton, Miss Margaret. He is in the drawing-room.\"\nMargaret dropped her sewing.\n\"Did he ask for me? Isn't papa come in?\"\n\"He asked for you, miss; and master is out.\"\n\"Very well, I will come,\" said Margaret, quietly. But she lingered strangely.\nMr. Thornton stood by one of the windows, with his back to the door apparently absorbed in watching something in the street. But, in truth, he was afraid of himself. His heart beat thick at the thought of her coming. He could not forget the touch of her arms around his neck, impatiently felt as it had been at the time; but now the recollection of her clinging defence of him, seemed to thrill him through and through,--to melt away every resolution, all power of self-control, as if it were wax before a fire. He dreaded lest he should go forwards to meet her, with his arms held out in mute entreaty that she would come and nestle there, as she had done, all unheeded, the day before, but never unheeded again. His heart throbbed loud and quick. Strong man as he was, he trembled at the anticipation of what he had to say, and how it might be received. She might droop, and flush, and flutter to his arms, as to her natural home and resting-place. One moment he glowed with impatience at the thought that she might do this,--the next he feared a passionate rejection, the idea of which withered up his future with so deadly a blight that he refused to think of it. He was startled by the sense of the presence of some one else in the room. He turned round. She had come in so gently, that he had never heard her; the street noises had been more distinct to his inattentive ear than her slow movements, in her soft muslin gown.\nShe stood by the table, not offering to sit down. Her eyelids were dropped half over her eyes; her teeth were shut, not compressed; her lips were just parted over them, allowing the white line to be seen between their curve. Her slow deep breathings dilated her chin and beautiful nostrils; it was the only motion visible on her countenance. The fine-grained skin, the oval cheek, the rich outline of her mouth, its corners deep set in dimples,--were all wan and pale to-day; the loss of their usual natural healthy colour being made more evident by the heavy shadow of the dark hair, brought down upon her temples, to hide all sign of the blow she had received. Her head, for all its drooping eyes, was thrown a little back, in the old proud attitude. Her long arms hung motionless by her sides. Altogether she looked like some prisoner, falsely accused of a crime that she loathed and despised, and from which she was too indignant to justify herself.\nMr. Thornton made a hasty step or two forwards; recovered himself, and went with quiet firmness to the door (which she had left open), and shut it. Then he came back, and stood opposite to her for a moment, receiving the general impression of her beautiful presence, before he dared to disturb it, perhaps to repel it, by what he had to say.\n\"Miss Hale, I was very ungrateful yesterday--\"\n\"You had nothing to be grateful for,\" said she raising her eyes, and looking full and straight at him. \"You mean, I suppose, that you believe you ought to thank me for what I did.\" In spite of herself--in defiance of her anger--the thick blushes came all over her face, and burnt into her very eyes; which fell not nevertheless from their grave and steady look. \"It was only a natural instinct; any woman would have done just the same. We all feel the sanctity of our sex as a high privilege when we see danger. I ought rather,\" said she, hastily, \"to apologise to you, for having said thoughtless words which sent you down into the danger.\"\n\"It was not your words; it was the truth they conveyed, pungently as it was expressed. But you shall not drive me off upon that, and so escape the expression of my deep gratitude, my--\" he was on the verge now; he would not speak in the haste of his hot passion; he would weigh each word. He would; and his will was triumphant. He stopped in mid career.\n\"I do not try to escape from anything,\" said she. \"I simply say, that you owe me no gratitude; and I may add, that any expression of it will be painful to me, because I do not feel that I deserve it. Still, if it will relieve you from even a fancied obligation, speak on.\"\n\"I do not want to be relieved from any obligation,\" said he, goaded by her calm manner. \"Fancied, or not fancied--I question not myself to know which--I choose to believe that I owe my very life to you--ay--smile, and think it an exaggeration if you will. I believe it, because it adds a value to that life to think--oh, Miss Hale!\" continued he, lowering his voice to such a tender intensity of passion that she shivered and trembled before him, \"to think circumstances so wrought, that whenever I exult in existence henceforward, I may say to myself, 'All this gladness in life, all honest pride in doing my work in the world, all this keen sense of being, I owe to her!' And it doubles the gladness, it makes the pride glow, it sharpens the sense of existence till I hardly know if it is pain or pleasure to think that I owe it to one--nay, you must, you shall hear,\"--said he, stepping forward with stern determination--\"to one whom I love, as I do not believe man ever loved woman before.\" He held her hand tight in his. He panted as he listened for what should come. He threw the hand away with indignation, as he heard her icy tone; for icy it was, though the words came faltering out, as if she knew not where to find them.\n\"Your way of speaking shocks me. It is blasphemous. I cannot help it, if that is my first feeling. It might not be so, I dare say, if I understood the kind of feeling you describe. I do not want to vex you; and besides, we must speak gently, for mamma is asleep; but your whole manner offends me--\"\n\"How!\" exclaimed he. \"Offends you! I am indeed most unfortunate.\"\n\"Yes!\" said she with recovered dignity. \"I do feel offended; and, I think, justly. You seem to fancy that my conduct of yesterday\"--again the deep carnation blush, but this time with eyes kindling with indignation rather than shame--\"was a personal act between you and me; and that you may come and thank me for it, instead of perceiving, as a gentleman would--yes! a gentleman,\" she repeated, in allusion to their former conversation about that word, \"that any woman, worthy of the name of woman, would come forward to shield, with her reverenced helplessness, a man in danger from the violence of numbers.\"\n\"And the gentleman thus rescued is forbidden the relief of thanks!\" he broke in contemptuously. \"I am a man. I claim the right of expressing my feelings.\"\n\"And I yielded to the right; simply saying that you gave me pain by insisting upon it,\" she replied, proudly. \"But you seem to have imagined, that I was not merely guided by womanly instinct, but\"--and here the passionate tears (kept down for long--struggled with vehemently) came up into her eyes and choked her voice--\"but that I was prompted by some particular feeling for you--you! Why, there was not a man--not a poor desperate man in all that crowd--for whom I had not more sympathy--for whom I should not have done what little I could more heartily.\"\n\"You may speak on, Miss Hale. I am aware of these misplaced sympathies of yours. I now believe that it was only your innate sense of oppression--(yes; I, though a master, may be oppressed)--that made you act so nobly as you did. I know you despise me; allow me to say, it is because you do not understand me.\"\n\"I do not care to understand,\" she replied, taking hold of the table to steady herself; for she thought him cruel--as, indeed, he was--and she was weak with her indignation.\n\"No, I see you do not. You are unfair and unjust.\"\nMargaret compressed her lips. She would not speak in answer to such accusations. But, for all that--for all his savage words, he could have thrown himself at her feet, and kissed the hem of her garment. She did not speak; she did not move. The tears of wounded pride fell hot and fast. He waited awhile, longing for her to say something, even a taunt, to which he might reply. But she was silent. He took up his hat.\n\"One word more. You look as if you thought it tainted you to be loved by me. You cannot avoid it. Nay, I, if I would, cannot cleanse you from it. But I would not if I could. I have never loved any woman before: my life has been too busy, my thoughts too much absorbed with other things. Now I love, and will love. But do not be afraid of too much expression on my part.\"\n\"I am not afraid,\" she replied, lifting herself straight up. \"No one yet has ever dared to be impertinent to me, and no one ever shall. But, Mr. Thornton, you have been very kind to my father,\" said she, changing her whole tone and bearing to a most womanly softness. \"Don't let us go on making each other angry. Pray don't!\" He took no notice of her words; he occupied himself in smoothing the nap of his hat with his coat-sleeve, for half a minute or so; and then, rejecting her offered hand, and making as if he did not see her grave look of regret, he turned abruptly away, and left the room. Margaret caught one glance at his face before he went.\nWhen he was gone she thought she had seen the gleam of washed tears in his eyes; and that turned her proud dislike into something different and kinder, if nearly as painful--self-reproach for having caused such mortification to any one.\n\"But how could I help it?\" asked she of herself. \"I never liked him. I was civil; but I took no trouble to conceal my indifference. Indeed, I never thought about myself or him, so my manners must have shown the truth. All that yesterday, he might mistake. But that is his fault, not mine. I would do it again, if need were, though it does lead me into all this shame and trouble.\"",
        "paragraph_chars": [
            [
                0,
                276
            ],
            [
                276,
                843
            ],
            [
                843,
                1411
            ],
            [
                1411,
                1512
            ],
            [
                1512,
                1570
            ],
            [
                1570,
                1599
            ],
            [
                1599,
                1640
            ],
            [
                1640,
                1685
            ],
            [
                1685,
                1763
            ],
            [
                1763,
                3193
            ],
            [
                3193,
                4147
            ],
            [
                4147,
                4489
            ],
            [
                4489,
                4536
            ],
            [
                4536,
                5178
            ],
            [
                5178,
                5532
            ],
            [
                5532,
                5805
            ],
            [
                5805,
                7037
            ],
            [
                7037,
                7336
            ],
            [
                7336,
                7402
            ],
            [
                7402,
                8011
            ],
            [
                8011,
                8166
            ],
            [
                8166,
                8724
            ],
            [
                8724,
                9034
            ],
            [
                9034,
                9208
            ],
            [
                9208,
                9259
            ],
            [
                9259,
                9676
            ],
            [
                9676,
                10047
            ],
            [
                10047,
                10699
            ],
            [
                10699,
                10936
            ],
            [
                10936,
                11316
            ]
        ],
        "segment_chars": [
            [
                0,
                260
            ],
            [
                260,
                276
            ],
            [
                276,
                383
            ],
            [
                383,
                454
            ],
            [
                454,
                843
            ],
            [
                843,
                884
            ],
            [
                884,
                1013
            ],
            [
                1013,
                1154
            ],
            [
                1154,
                1411
            ],
            [
                1411,
                1512
            ],
            [
                1512,
                1542
            ],
            [
                1542,
                1570
            ],
            [
                1570,
                1599
            ],
            [
                1599,
                1619
            ],
            [
                1619,
                1640
            ],
            [
                1640,
                1685
            ],
            [
                1685,
                1735
            ],
            [
                1735,
                1763
            ],
            [
                1763,
                1888
            ],
            [
                1888,
                1929
            ],
            [
                1929,
                1980
            ],
            [
                1980,
                2275
            ],
            [
                2275,
                2477
            ],
            [
                2477,
                2512
            ],
            [
                2512,
                2619
            ],
            [
                2619,
                2714
            ],
            [
                2714,
                2931
            ],
            [
                2931,
                3006
            ],
            [
                3006,
                3023
            ],
            [
                3023,
                3193
            ],
            [
                3193,
                3243
            ],
            [
                3243,
                3418
            ],
            [
                3418,
                3535
            ],
            [
                3535,
                3856
            ],
            [
                3856,
                3946
            ],
            [
                3946,
                3990
            ],
            [
                3990,
                4147
            ],
            [
                4147,
                4295
            ],
            [
                4295,
                4489
            ],
            [
                4489,
                4536
            ],
            [
                4536,
                4639
            ],
            [
                4639,
                4717
            ],
            [
                4717,
                4898
            ],
            [
                4898,
                4972
            ],
            [
                4972,
                5048
            ],
            [
                5048,
                5178
            ],
            [
                5178,
                5265
            ],
            [
                5265,
                5467
            ],
            [
                5467,
                5506
            ],
            [
                5506,
                5532
            ],
            [
                5532,
                5582
            ],
            [
                5582,
                5732
            ],
            [
                5732,
                5805
            ],
            [
                5805,
                5893
            ],
            [
                5893,
                6061
            ],
            [
                6061,
                6138
            ],
            [
                6138,
                6479
            ],
            [
                6479,
                6800
            ],
            [
                6800,
                6831
            ],
            [
                6831,
                6878
            ],
            [
                6878,
                7037
            ],
            [
                7037,
                7070
            ],
            [
                7070,
                7089
            ],
            [
                7089,
                7136
            ],
            [
                7136,
                7218
            ],
            [
                7218,
                7336
            ],
            [
                7336,
                7343
            ],
            [
                7343,
                7357
            ],
            [
                7357,
                7371
            ],
            [
                7371,
                7402
            ],
            [
                7402,
                7409
            ],
            [
                7409,
                7442
            ],
            [
                7442,
                7485
            ],
            [
                7485,
                7768
            ],
            [
                7768,
                8011
            ],
            [
                8011,
                8079
            ],
            [
                8079,
                8107
            ],
            [
                8107,
                8120
            ],
            [
                8120,
                8166
            ],
            [
                8166,
                8276
            ],
            [
                8276,
                8552
            ],
            [
                8552,
                8724
            ],
            [
                8724,
                8754
            ],
            [
                8754,
                8805
            ],
            [
                8805,
                8953
            ],
            [
                8953,
                9034
            ],
            [
                9034,
                9208
            ],
            [
                9208,
                9231
            ],
            [
                9231,
                9259
            ],
            [
                9259,
                9289
            ],
            [
                9289,
                9340
            ],
            [
                9340,
                9462
            ],
            [
                9462,
                9499
            ],
            [
                9499,
                9545
            ],
            [
                9545,
                9636
            ],
            [
                9636,
                9656
            ],
            [
                9656,
                9676
            ],
            [
                9676,
                9692
            ],
            [
                9692,
                9753
            ],
            [
                9753,
                9774
            ],
            [
                9774,
                9822
            ],
            [
                9822,
                9850
            ],
            [
                9850,
                9963
            ],
            [
                9963,
                9990
            ],
            [
                9990,
                10047
            ],
            [
                10047,
                10108
            ],
            [
                10108,
                10183
            ],
            [
                10183,
                10315
            ],
            [
                10315,
                10360
            ],
            [
                10360,
                10373
            ],
            [
                10373,
                10644
            ],
            [
                10644,
                10699
            ],
            [
                10699,
                10936
            ],
            [
                10936,
                10963
            ],
            [
                10963,
                10985
            ],
            [
                10985,
                11005
            ],
            [
                11005,
                11068
            ],
            [
                11068,
                11154
            ],
            [
                11154,
                11192
            ],
            [
                11192,
                11225
            ],
            [
                11225,
                11316
            ]
        ],
        "overlap_chars": [
            [
                276,
                355
            ],
            [
                358,
                383
            ],
            [
                454,
                502
            ],
            [
                613,
                635
            ],
            [
                602,
                603
            ],
            [
                671,
                698
            ],
            [
                703,
                724
            ],
            [
                643,
                644
            ],
            [
                725,
                738
            ],
            [
                538,
                541
            ],
            [
                779,
                786
            ],
            [
                796,
                810
            ],
            [
                820,
                843
            ],
            [
                843,
                884
            ],
            [
                884,
                894
            ],
            [
                946,
                952
            ],
            [
                909,
                945
            ],
            [
                953,
                1013
            ],
            [
                1013,
                1069
            ],
            [
                1152,
                1154
            ],
            [
                1154,
                1310
            ],
            [
                1311,
                1335
            ],
            [
                1339,
                1348
            ],
            [
                1382,
                1411
            ],
            [
                1411,
                1432
            ],
            [
                1438,
                1444
            ],
            [
                1510,
                1512
            ],
            [
                1515,
                1516
            ],
            [
                1517,
                1542
            ],
            [
                1542,
                1567
            ],
            [
                1570,
                1599
            ],
            [
                1604,
                1619
            ],
            [
                1619,
                1629
            ],
            [
                1635,
                1637
            ],
            [
                1641,
                1682
            ],
            [
                1691,
                1708
            ],
            [
                1711,
                1735
            ],
            [
                1735,
                1751
            ],
            [
                1761,
                1763
            ],
            [
                1763,
                1804
            ],
            [
                1831,
                1888
            ],
            [
                1893,
                1929
            ],
            [
                1929,
                1980
            ],
            [
                1980,
                2048
            ],
            [
                2056,
                2058
            ],
            [
                2062,
                2132
            ],
            [
                2141,
                2181
            ],
            [
                2184,
                2196
            ],
            [
                2215,
                2241
            ],
            [
                2256,
                2275
            ],
            [
                2275,
                2324
            ],
            [
                2326,
                2365
            ],
            [
                2475,
                2477
            ],
            [
                2477,
                2512
            ],
            [
                2512,
                2619
            ],
            [
                2619,
                2628
            ],
            [
                2640,
                2694
            ],
            [
                2712,
                2714
            ],
            [
                2771,
                2780
            ],
            [
                2735,
                2739
            ],
            [
                2810,
                2837
            ],
            [
                2838,
                2930
            ],
            [
                2931,
                2962
            ],
            [
                2967,
                2975
            ],
            [
                2993,
                3006
            ],
            [
                3023,
                3048
            ],
            [
                3050,
                3077
            ],
            [
                3191,
                3193
            ],
            [
                3193,
                3215
            ],
            [
                3241,
                3243
            ],
            [
                3243,
                3291
            ],
            [
                3329,
                3350
            ],
            [
                3360,
                3385
            ],
            [
                3292,
                3297
            ],
            [
                3386,
                3418
            ],
            [
                3535,
                3636
            ],
            [
                3663,
                3664
            ],
            [
                3644,
                3647
            ],
            [
                3639,
                3643
            ],
            [
                3648,
                3660
            ],
            [
                3636,
                3637
            ],
            [
                3743,
                3790
            ],
            [
                3809,
                3856
            ],
            [
                3856,
                3864
            ],
            [
                3893,
                3946
            ],
            [
                3946,
                3975
            ],
            [
                3988,
                3990
            ],
            [
                3990,
                4067
            ],
            [
                4080,
                4088
            ],
            [
                4145,
                4147
            ],
            [
                4147,
                4254
            ],
            [
                4282,
                4295
            ],
            [
                4295,
                4302
            ],
            [
                4318,
                4489
            ],
            [
                4495,
                4532
            ],
            [
                4537,
                4571
            ],
            [
                4574,
                4582
            ],
            [
                4583,
                4639
            ],
            [
                4640,
                4714
            ],
            [
                4717,
                4728
            ],
            [
                4753,
                4762
            ],
            [
                4804,
                4805
            ],
            [
                4764,
                4767
            ],
            [
                4774,
                4781
            ],
            [
                4810,
                4815
            ],
            [
                4796,
                4804
            ],
            [
                4834,
                4835
            ],
            [
                4821,
                4824
            ],
            [
                4830,
                4834
            ],
            [
                4869,
                4898
            ],
            [
                4899,
                4956
            ],
            [
                4962,
                4972
            ],
            [
                5048,
                5062
            ],
            [
                5085,
                5175
            ],
            [
                5179,
                5232
            ],
            [
                5263,
                5265
            ],
            [
                5265,
                5282
            ],
            [
                5311,
                5360
            ],
            [
                5364,
                5388
            ],
            [
                5389,
                5467
            ],
            [
                5506,
                5532
            ],
            [
                5533,
                5569
            ],
            [
                5572,
                5582
            ],
            [
                5583,
                5632
            ],
            [
                5701,
                5732
            ],
            [
                5732,
                5802
            ],
            [
                5806,
                5854
            ],
            [
                5857,
                5893
            ],
            [
                5956,
                6006
            ],
            [
                5901,
                5902
            ],
            [
                6017,
                6061
            ],
            [
                6061,
                6120
            ],
            [
                6122,
                6135
            ],
            [
                6161,
                6170
            ],
            [
                6174,
                6226
            ],
            [
                6358,
                6359
            ],
            [
                6328,
                6357
            ],
            [
                6252,
                6253
            ],
            [
                6359,
                6476
            ],
            [
                6479,
                6612
            ],
            [
                6684,
                6685
            ],
            [
                6613,
                6642
            ],
            [
                6644,
                6673
            ],
            [
                6730,
                6797
            ],
            [
                6800,
                6829
            ],
            [
                6996,
                6997
            ],
            [
                6856,
                6876
            ],
            [
                6881,
                6943
            ],
            [
                6829,
                6830
            ],
            [
                6945,
                6992
            ],
            [
                7035,
                7037
            ],
            [
                7038,
                7070
            ],
            [
                7070,
                7089
            ],
            [
                7089,
                7136
            ],
            [
                7136,
                7218
            ],
            [
                7218,
                7247
            ],
            [
                7257,
                7332
            ],
            [
                7337,
                7340
            ],
            [
                7343,
                7357
            ],
            [
                7358,
                7369
            ],
            [
                7403,
                7406
            ],
            [
                7409,
                7417
            ],
            [
                7418,
                7442
            ],
            [
                7443,
                7485
            ],
            [
                7485,
                7531
            ],
            [
                7534,
                7548
            ],
            [
                7559,
                7633
            ],
            [
                7636,
                7654
            ],
            [
                7673,
                7761
            ],
            [
                7794,
                7795
            ],
            [
                7855,
                7869
            ],
            [
                7871,
                7898
            ],
            [
                7900,
                7918
            ],
            [
                7667,
                7670
            ],
            [
                7935,
                7938
            ],
            [
                7950,
                7962
            ],
            [
                7919,
                7928
            ],
            [
                7964,
                8000
            ],
            [
                7768,
                7769
            ],
            [
                8012,
                8029
            ],
            [
                8043,
                8076
            ],
            [
                8079,
                8107
            ],
            [
                8108,
                8120
            ],
            [
                8120,
                8163
            ],
            [
                8167,
                8193
            ],
            [
                8254,
                8276
            ],
            [
                8277,
                8361
            ],
            [
                8364,
                8393
            ],
            [
                8442,
                8449
            ],
            [
                8450,
                8463
            ],
            [
                8464,
                8484
            ],
            [
                8487,
                8545
            ],
            [
                8405,
                8408
            ],
            [
                8547,
                8552
            ],
            [
                8552,
                8566
            ],
            [
                8578,
                8620
            ],
            [
                8622,
                8654
            ],
            [
                8748,
                8752
            ],
            [
                8741,
                8742
            ],
            [
                8754,
                8767
            ],
            [
                8768,
                8805
            ],
            [
                8805,
                8867
            ],
            [
                8869,
                8911
            ],
            [
                8914,
                8953
            ],
            [
                8953,
                8975
            ],
            [
                8993,
                9031
            ],
            [
                9035,
                9062
            ],
            [
                9065,
                9147
            ],
            [
                9151,
                9152
            ],
            [
                9169,
                9190
            ],
            [
                9195,
                9208
            ],
            [
                9209,
                9231
            ],
            [
                9231,
                9256
            ],
            [
                9259,
                9289
            ],
            [
                9289,
                9318
            ],
            [
                9338,
                9340
            ],
            [
                9340,
                9344
            ],
            [
                9359,
                9425
            ],
            [
                9460,
                9462
            ],
            [
                9462,
                9499
            ],
            [
                9503,
                9545
            ],
            [
                9545,
                9636
            ],
            [
                9636,
                9656
            ],
            [
                9656,
                9676
            ],
            [
                9677,
                9692
            ],
            [
                9692,
                9753
            ],
            [
                9779,
                9780
            ],
            [
                9794,
                9822
            ],
            [
                9822,
                9837
            ],
            [
                9838,
                9850
            ],
            [
                9850,
                9943
            ],
            [
                9961,
                9963
            ],
            [
                9963,
                9990
            ],
            [
                9990,
                10044
            ],
            [
                10048,
                10063
            ],
            [
                10066,
                10108
            ],
            [
                10109,
                10183
            ],
            [
                10183,
                10238
            ],
            [
                10241,
                10274
            ],
            [
                10287,
                10315
            ],
            [
                10319,
                10360
            ],
            [
                10360,
                10370
            ],
            [
                10373,
                10403
            ],
            [
                10405,
                10437
            ],
            [
                10449,
                10477
            ],
            [
                10502,
                10545
            ],
            [
                10553,
                10644
            ],
            [
                10644,
                10699
            ],
            [
                10716,
                10753
            ],
            [
                10761,
                10849
            ],
            [
                10873,
                10909
            ],
            [
                10934,
                10936
            ],
            [
                10937,
                10960
            ],
            [
                10969,
                10972
            ],
            [
                10976,
                10985
            ],
            [
                10986,
                11005
            ],
            [
                11005,
                11023
            ],
            [
                11043,
                11066
            ],
            [
                11040,
                11042
            ],
            [
                11066,
                11068
            ],
            [
                11092,
                11097
            ],
            [
                11163,
                11192
            ],
            [
                11192,
                11225
            ],
            [
                11225,
                11314
            ]
        ],
        "row_chars": [
            [
                0,
                260
            ],
            [
                260,
                276
            ],
            [
                276,
                383
            ],
            [
                383,
                454
            ],
            [
                454,
                843
            ],
            [
                843,
                884
            ],
            [
                884,
                1013
            ],
            [
                1013,
                1154
            ],
            [
                1154,
                1411
            ],
            [
                1411,
                1512
            ],
            [
                1512,
                1542
            ],
            [
                1542,
                1570
            ],
            [
                1570,
                1599
            ],
            [
                1599,
                1619
            ],
            [
                1619,
                1640
            ],
            [
                1640,
                1685
            ],
            [
                1685,
                1735
            ],
            [
                1735,
                1763
            ],
            [
                1763,
                1888
            ],
            [
                1888,
                1929
            ],
            [
                1929,
                1980
            ],
            [
                1980,
                2275
            ],
            [
                2275,
                2477
            ],
            [
                2477,
                2512
            ],
            [
                2512,
                2619
            ],
            [
                2619,
                2714
            ],
            [
                2714,
                2931
            ],
            [
                2931,
                3006
            ],
            [
                3006,
                3023
            ],
            [
                3023,
                3193
            ],
            [
                3193,
                3243
            ],
            [
                3243,
                3418
            ],
            [
                3418,
                3535
            ],
            [
                3535,
                3856
            ],
            [
                3856,
                3946
            ],
            [
                3946,
                3990
            ],
            [
                3990,
                4147
            ],
            [
                4147,
                4295
            ],
            [
                4295,
                4489
            ],
            [
                4489,
                4536
            ],
            [
                4536,
                4639
            ],
            [
                4639,
                4717
            ],
            [
                4717,
                4898
            ],
            [
                4898,
                4972
            ],
            [
                4972,
                5048
            ],
            [
                5048,
                5178
            ],
            [
                5178,
                5265
            ],
            [
                5265,
                5467
            ],
            [
                5467,
                5506
            ],
            [
                5506,
                5532
            ],
            [
                5532,
                5582
            ],
            [
                5582,
                5732
            ],
            [
                5732,
                5805
            ],
            [
                5805,
                5893
            ],
            [
                5893,
                6061
            ],
            [
                6061,
                6138
            ],
            [
                6138,
                6479
            ],
            [
                6479,
                6800
            ],
            [
                6800,
                7037
            ],
            [
                7037,
                7070
            ],
            [
                7070,
                7089
            ],
            [
                7089,
                7136
            ],
            [
                7136,
                7218
            ],
            [
                7218,
                7336
            ],
            [
                7336,
                7343
            ],
            [
                7343,
                7357
            ],
            [
                7357,
                7371
            ],
            [
                7371,
                7402
            ],
            [
                7402,
                7409
            ],
            [
                7409,
                7442
            ],
            [
                7442,
                7485
            ],
            [
                7485,
                8011
            ],
            [
                8011,
                8079
            ],
            [
                8079,
                8107
            ],
            [
                8107,
                8120
            ],
            [
                8120,
                8166
            ],
            [
                8166,
                8276
            ],
            [
                8276,
                8552
            ],
            [
                8552,
                8724
            ],
            [
                8724,
                8805
            ],
            [
                8805,
                8953
            ],
            [
                8953,
                9034
            ],
            [
                9034,
                9208
            ],
            [
                9208,
                9231
            ],
            [
                9231,
                9259
            ],
            [
                9259,
                9289
            ],
            [
                9289,
                9340
            ],
            [
                9340,
                9462
            ],
            [
                9462,
                9499
            ],
            [
                9499,
                9545
            ],
            [
                9545,
                9636
            ],
            [
                9636,
                9656
            ],
            [
                9656,
                9676
            ],
            [
                9676,
                9692
            ],
            [
                9692,
                9753
            ],
            [
                9753,
                9774
            ],
            [
                9774,
                9822
            ],
            [
                9822,
                9850
            ],
            [
                9850,
                9963
            ],
            [
                9963,
                9990
            ],
            [
                9990,
                10047
            ],
            [
                10047,
                10108
            ],
            [
                10108,
                10183
            ],
            [
                10183,
                10315
            ],
            [
                10315,
                10360
            ],
            [
                10360,
                10373
            ],
            [
                10373,
                10644
            ],
            [
                10644,
                10699
            ],
            [
                10699,
                10936
            ],
            [
                10936,
                10963
            ],
            [
                10963,
                10985
            ],
            [
                10985,
                11005
            ],
            [
                11005,
                11068
            ],
            [
                11068,
                11192
            ],
            [
                11192,
                11225
            ],
            [
                11225,
                11316
            ]
        ]
    },
    "abridged": {
        "text": "The next morning, Margaret dragged herself up, thankful that the night was over - unrefreshed, yet rested. A little breeze was stirring in the hot air, and she knew how, somewhere or other, in thick green woods, there would be a pleasant, murmuring, dancing sound; the thought was an echo of distant gladness in her heart.\nShe sat at her work in Mrs. Hale's room. As soon as her mother's morning slumber was over, she would help her to dress; after dinner, she would go and see Bessy Higgins. She would banish all recollection of the Thornton family. But, of course, the effort not to think of them brought them only the more strongly before her; and from time to time, the hot flush came over her pale face, sweeping it into colour, like a sunbeam swiftly moving over the sea.\nDixon opened the door softly.\n'Mr. Thornton, Miss Margaret. He is in the drawing-room.'\nMargaret dropped her sewing.\n'Did he ask for me? Isn't papa in?'\n'He asked for you, miss; and master is out.'\n'Very well, I will come,' said Margaret, quietly. But she lingered.\nMr. Thornton stood by one of the windows, apparently absorbed in watching something in the street. In truth, he was afraid of himself. His heart beat thick at the thought of her coming. He could not forget the touch of her arms around his neck, impatient as he had been at the time; but now the recollection of her clinging defence seemed to thrill him through and through - to melt away all power of self-control, like wax before a fire. He dreaded lest he should go forwards to meet her with his arms held out in mute entreaty. His heart throbbed loud and quick. Strong man as he was, he trembled at the anticipation of what he had to say, and how it might be received. She might flush, and flutter to his arms, as to her natural home. Or she might respond with a passionate rejection, the very idea of which withered up his future with so deadly a blight that he refused to think of it.\nHe was startled by the sense of a presence in the room. She had come in so gently that he had never heard her.\nShe stood by the table. Her eyelids were dropped half over her eyes; her lips were just parted, allowing the white line of teeth to be seen between their curve. The fine-grained skin, the oval cheek, the rich outline of her mouth, its corners deep set in dimples - all were wan and pale today, under the heavy shadow of the dark hair, brought down to hide all sign of the blow she had received. Her head was thrown a little back, in the old proud attitude. Her long arms hung motionless. Altogether she looked like some prisoner, falsely accused of a crime that she despised.\nMr. Thornton made a hasty step or two forwards; recovered himself, and went with quiet firmness to the door and shut it. Then he stood opposite to her for a moment, receiving the general impression of her beautiful presence, before he dared to disturb it, perhaps to repel it, by what he had to say.\n'Miss Hale, I was very ungrateful yesterday-'\n'You had nothing to be grateful for,' said she, raising her eyes, and looking full and straight at him. 'You mean, I suppose, that you believe you ought to thank me for what I did.' In spite of her anger, the blushes burnt her face; but her eyes kept their grave and steady look. 'It was only a natural instinct; any woman would have done the same. I ought rather to apologise to you, for having said thoughtless words which sent you down into the danger.'\n'It was not your words; it was the truth they conveyed. But you shall not so escape the expression of my deep gratitude, my-' he was on the verge now; yet he would not speak in the haste of his hot passion; he would weigh each word. He stopped in mid career.\n'I do not try to escape from anything,' said she. 'I simply say, that you owe me no gratitude; and I do not feel that I deserve it. Still, if it will relieve you from even a fancied obligation, speak on.'\n'I do not want to be relieved from any obligation,' said he, goaded by her calm manner. 'I choose to believe that I owe my very life to you - aye, smile, and think it an exaggeration if you will. I believe it, because it adds a value to that life to think - oh, Miss Hale!' His voice held such a tender intensity of passion that she shivered. 'Henceforward, I may say to myself, \"All this gladness in life, all honest pride in doing my work in the world, all this keen sense of being, I owe to her!\" And it doubles the gladness, it makes the pride glow, it sharpens the sense of existence till I hardly know if it is pain or pleasure, to think that I owe it to one - nay, you must, you shall hear - to one whom I love, as I do not believe man ever loved woman before.'\nHe held her hand tight in his, listening for what should come - and threw the hand away with indignation, as he heard her icy tone. For icy it was, though the words came faltering.\n'Your way of speaking shocks me. It is blasphemous. I cannot help it, if that is my first feeling. It might not be so, I dare say, if I understood the kind of feeling you describe. I do not want to vex you; and we must speak gently, for mamma is asleep; but your whole manner offends me-'\n'How!' exclaimed he. 'Offends you!'\n'Yes!' said she, with recovered dignity. 'I do feel offended; and, I think, justly. You seem to fancy that my conduct of yesterday' - again the deep blush, but this time with eyes kindling with indignation rather than shame - 'was a personal act; and that you may come and thank me for it, instead of perceiving, as a gentleman would, that any woman worthy of the name of woman would come forward and use her helplessness to shield a man in danger from the violence of a mob.'\n'And the gentleman is forbidden the relief of thanks!' he broke in contemptuously. 'I am a man. I claim the right of expressing my feelings.'\n'And I yielded to the right,' she replied, proudly. 'But you seem to have imagined, that I was not merely guided by womanly instinct, but' - and here the passionate tears came up at last into her eyes, and choked her voice - 'but that I was prompted by some particular feeling for you - for you! Why, there was not a poor desperate man in all that crowd for whom I had not more sympathy.'\n'Miss Hale, I am aware of all these misplaced sympathies of yours. I now believe that it was only your innate sense of oppression (yes; I, though a master, may be oppressed) that made you act so nobly as you did. I know you despise me; but it is because you do not understand me.'\n'I do not care to understand,' she replied, taking hold of the table to steady herself; for she thought him cruel, and she was weak with indignation.\n'No, I see you do not. You are unfair and unjust.'\nMargaret compressed her lips. She would not speak in answer. But, for all his savage words, he could have thrown himself at her feet. She did not speak; she did not move. Her tears of wounded pride fell hot and fast. He waited awhile, longing for her to say something, even a taunt, to which he might reply. But she was silent. He took up his hat.\n'One word more. You look as if you thought it tainted you to be loved by me. I cannot cleanse you from it. But I would not, if I could. I have never loved any woman before: my life has been too busy, my thoughts too much absorbed. Now I love, and will love. But do not be afraid of too much expression on my part.'\n'I am not afraid,' she replied, lifting herself straight up. 'No one yet has ever dared to be impertinent to me, and no one ever shall. But, Mr. Thornton, you have been very kind to my father,' said she, changing her whole tone to a most womanly softness. 'Don't let us go on making each other angry. Pray don't!'\nHe took no notice of her words: he occupied himself in smoothing his hat with his coat-sleeve; and then, rejecting her offered hand, and acting as if he did not see her grave look of regret, he turned abruptly away, and left the room. Margaret caught one glance at his face before he went.\nShe thought she had seen the gleam of unshed tears in his eyes; and that turned her proud dislike into something different and kinder: self-reproach for having caused such pain.\n'But how could I help it?' she asked herself. 'I never liked him. I was civil; but I did not conceal my indifference to him. About yesterday, he might mistake. But that is his fault, not mine. I would do it again, if need were, though it does lead me into all this shame and trouble.'",
        "paragraph_chars": [
            [
                0,
                323
            ],
            [
                323,
                778
            ],
            [
                778,
                808
            ],
            [
                808,
                866
            ],
            [
                866,
                895
            ],
            [
                895,
                931
            ],
            [
                931,
                976
            ],
            [
                976,
                1044
            ],
            [
                1044,
                1934
            ],
            [
                1934,
                2045
            ],
            [
                2045,
                2621
            ],
            [
                2621,
                2921
            ],
            [
                2921,
                2967
            ],
            [
                2967,
                3424
            ],
            [
                3424,
                3683
            ],
            [
                3683,
                3888
            ],
            [
                3888,
                4657
            ],
            [
                4657,
                4838
            ],
            [
                4838,
                5127
            ],
            [
                5127,
                5163
            ],
            [
                5163,
                5640
            ],
            [
                5640,
                5782
            ],
            [
                5782,
                6171
            ],
            [
                6171,
                6452
            ],
            [
                6452,
                6602
            ],
            [
                6602,
                6653
            ],
            [
                6653,
                7001
            ],
            [
                7001,
                7316
            ],
            [
                7316,
                7630
            ],
            [
                7630,
                7920
            ],
            [
                7920,
                8098
            ],
            [
                8098,
                8382
            ]
        ],
        "segment_chars": [
            [
                0,
                107
            ],
            [
                107,
                323
            ],
            [
                323,
                364
            ],
            [
                364,
                493
            ],
            [
                493,
                551
            ],
            [
                551,
                778
            ],
            [
                778,
                808
            ],
            [
                808,
                813
            ],
            [
                813,
                838
            ],
            [
                838,
                866
            ],
            [
                866,
                895
            ],
            [
                895,
                915
            ],
            [
                915,
                931
            ],
            [
                931,
                976
            ],
            [
                976,
                1026
            ],
            [
                1026,
                1044
            ],
            [
                1044,
                1143
            ],
            [
                1143,
                1179
            ],
            [
                1179,
                1230
            ],
            [
                1230,
                1483
            ],
            [
                1483,
                1574
            ],
            [
                1574,
                1609
            ],
            [
                1609,
                1716
            ],
            [
                1716,
                1782
            ],
            [
                1782,
                1934
            ],
            [
                1934,
                1990
            ],
            [
                1990,
                2045
            ],
            [
                2045,
                2069
            ],
            [
                2069,
                2206
            ],
            [
                2206,
                2440
            ],
            [
                2440,
                2502
            ],
            [
                2502,
                2533
            ],
            [
                2533,
                2621
            ],
            [
                2621,
                2742
            ],
            [
                2742,
                2921
            ],
            [
                2921,
                2967
            ],
            [
                2967,
                3071
            ],
            [
                3071,
                3149
            ],
            [
                3149,
                3247
            ],
            [
                3247,
                3316
            ],
            [
                3316,
                3424
            ],
            [
                3424,
                3480
            ],
            [
                3480,
                3657
            ],
            [
                3657,
                3683
            ],
            [
                3683,
                3733
            ],
            [
                3733,
                3815
            ],
            [
                3815,
                3888
            ],
            [
                3888,
                3976
            ],
            [
                3976,
                4084
            ],
            [
                4084,
                4162
            ],
            [
                4162,
                4231
            ],
            [
                4231,
                4388
            ],
            [
                4388,
                4657
            ],
            [
                4657,
                4789
            ],
            [
                4789,
                4838
            ],
            [
                4838,
                4871
            ],
            [
                4871,
                4890
            ],
            [
                4890,
                4937
            ],
            [
                4937,
                5019
            ],
            [
                5019,
                5127
            ],
            [
                5127,
                5134
            ],
            [
                5134,
                5148
            ],
            [
                5148,
                5163
            ],
            [
                5163,
                5170
            ],
            [
                5170,
                5204
            ],
            [
                5204,
                5247
            ],
            [
                5247,
                5640
            ],
            [
                5640,
                5695
            ],
            [
                5695,
                5723
            ],
            [
                5723,
                5736
            ],
            [
                5736,
                5782
            ],
            [
                5782,
                5834
            ],
            [
                5834,
                6078
            ],
            [
                6078,
                6171
            ],
            [
                6171,
                6238
            ],
            [
                6238,
                6384
            ],
            [
                6384,
                6452
            ],
            [
                6452,
                6602
            ],
            [
                6602,
                6625
            ],
            [
                6625,
                6653
            ],
            [
                6653,
                6683
            ],
            [
                6683,
                6714
            ],
            [
                6714,
                6787
            ],
            [
                6787,
                6824
            ],
            [
                6824,
                6870
            ],
            [
                6870,
                6961
            ],
            [
                6961,
                6981
            ],
            [
                6981,
                7001
            ],
            [
                7001,
                7017
            ],
            [
                7017,
                7078
            ],
            [
                7078,
                7108
            ],
            [
                7108,
                7137
            ],
            [
                7137,
                7232
            ],
            [
                7232,
                7259
            ],
            [
                7259,
                7316
            ],
            [
                7316,
                7377
            ],
            [
                7377,
                7452
            ],
            [
                7452,
                7572
            ],
            [
                7572,
                7617
            ],
            [
                7617,
                7630
            ],
            [
                7630,
                7865
            ],
            [
                7865,
                7920
            ],
            [
                7920,
                8098
            ],
            [
                8098,
                8125
            ],
            [
                8125,
                8144
            ],
            [
                8144,
                8164
            ],
            [
                8164,
                8223
            ],
            [
                8223,
                8258
            ],
            [
                8258,
                8291
            ],
            [
                8291,
                8382
            ]
        ],
        "overlap_chars": [
            [
                0,
                79
            ],
            [
                82,
                107
            ],
            [
                107,
                155
            ],
            [
                160,
                182
            ],
            [
                188,
                189
            ],
            [
                190,
                217
            ],
            [
                227,
                248
            ],
            [
                248,
                249
            ],
            [
                250,
                263
            ],
            [
                265,
                268
            ],
            [
                269,
                276
            ],
            [
                277,
                291
            ],
            [
                300,
                323
            ],
            [
                323,
                364
            ],
            [
                364,
                374
            ],
            [
                379,
                385
            ],
            [
                396,
                432
            ],
            [
                433,
                493
            ],
            [
                493,
                549
            ],
            [
                549,
                551
            ],
            [
                551,
                707
            ],
            [
                709,
                733
            ],
            [
                739,
                748
            ],
            [
                749,
                778
            ],
            [
                778,
                799
            ],
            [
                800,
                806
            ],
            [
                806,
                808
            ],
            [
                811,
                812
            ],
            [
                813,
                838
            ],
            [
                838,
                863
            ],
            [
                866,
                895
            ],
            [
                900,
                915
            ],
            [
                915,
                925
            ],
            [
                926,
                928
            ],
            [
                932,
                973
            ],
            [
                982,
                999
            ],
            [
                1002,
                1026
            ],
            [
                1026,
                1042
            ],
            [
                1042,
                1044
            ],
            [
                1044,
                1085
            ],
            [
                1086,
                1143
            ],
            [
                1143,
                1179
            ],
            [
                1179,
                1230
            ],
            [
                1230,
                1298
            ],
            [
                1299,
                1301
            ],
            [
                1305,
                1375
            ],
            [
                1376,
                1416
            ],
            [
                1419,
                1431
            ],
            [
                1432,
                1458
            ],
            [
                1464,
                1483
            ],
            [
                1483,
                1532
            ],
            [
                1533,
                1572
            ],
            [
                1572,
                1574
            ],
            [
                1574,
                1609
            ],
            [
                1609,
                1716
            ],
            [
                1716,
                1725
            ],
            [
                1726,
                1780
            ],
            [
                1780,
                1782
            ],
            [
                1785,
                1794
            ],
            [
                1803,
                1807
            ],
            [
                1808,
                1835
            ],
            [
                1841,
                1933
            ],
            [
                1934,
                1965
            ],
            [
                1968,
                1976
            ],
            [
                1977,
                1990
            ],
            [
                1990,
                2015
            ],
            [
                2016,
                2043
            ],
            [
                2043,
                2045
            ],
            [
                2045,
                2067
            ],
            [
                2067,
                2069
            ],
            [
                2069,
                2117
            ],
            [
                2118,
                2139
            ],
            [
                2139,
                2164
            ],
            [
                2168,
                2173
            ],
            [
                2174,
                2206
            ],
            [
                2206,
                2307
            ],
            [
                2308,
                2309
            ],
            [
                2310,
                2313
            ],
            [
                2314,
                2318
            ],
            [
                2319,
                2331
            ],
            [
                2337,
                2338
            ],
            [
                2345,
                2392
            ],
            [
                2393,
                2440
            ],
            [
                2440,
                2448
            ],
            [
                2449,
                2502
            ],
            [
                2502,
                2531
            ],
            [
                2531,
                2533
            ],
            [
                2533,
                2610
            ],
            [
                2611,
                2619
            ],
            [
                2619,
                2621
            ],
            [
                2621,
                2728
            ],
            [
                2729,
                2742
            ],
            [
                2742,
                2749
            ],
            [
                2750,
                2921
            ],
            [
                2927,
                2964
            ],
            [
                2968,
                3002
            ],
            [
                3005,
                3013
            ],
            [
                3015,
                3071
            ],
            [
                3072,
                3146
            ],
            [
                3149,
                3160
            ],
            [
                3161,
                3170
            ],
            [
                3170,
                3171
            ],
            [
                3172,
                3175
            ],
            [
                3176,
                3183
            ],
            [
                3184,
                3189
            ],
            [
                3190,
                3198
            ],
            [
                3198,
                3199
            ],
            [
                3204,
                3207
            ],
            [
                3208,
                3212
            ],
            [
                3218,
                3247
            ],
            [
                3248,
                3305
            ],
            [
                3306,
                3316
            ],
            [
                3316,
                3330
            ],
            [
                3331,
                3421
            ],
            [
                3425,
                3478
            ],
            [
                3478,
                3480
            ],
            [
                3480,
                3497
            ],
            [
                3498,
                3547
            ],
            [
                3550,
                3574
            ],
            [
                3579,
                3657
            ],
            [
                3657,
                3683
            ],
            [
                3684,
                3720
            ],
            [
                3723,
                3733
            ],
            [
                3734,
                3783
            ],
            [
                3784,
                3815
            ],
            [
                3815,
                3885
            ],
            [
                3889,
                3937
            ],
            [
                3940,
                3976
            ],
            [
                3977,
                4027
            ],
            [
                4033,
                4034
            ],
            [
                4040,
                4084
            ],
            [
                4084,
                4143
            ],
            [
                4146,
                4159
            ],
            [
                4162,
                4171
            ],
            [
                4177,
                4229
            ],
            [
                4231,
                4232
            ],
            [
                4237,
                4266
            ],
            [
                4267,
                4268
            ],
            [
                4268,
                4385
            ],
            [
                4388,
                4521
            ],
            [
                4521,
                4522
            ],
            [
                4523,
                4552
            ],
            [
                4555,
                4584
            ],
            [
                4587,
                4654
            ],
            [
                4657,
                4686
            ],
            [
                4686,
                4687
            ],
            [
                4698,
                4718
            ],
            [
                4725,
                4787
            ],
            [
                4787,
                4788
            ],
            [
                4789,
                4836
            ],
            [
                4836,
                4838
            ],
            [
                4839,
                4871
            ],
            [
                4871,
                4890
            ],
            [
                4890,
                4937
            ],
            [
                4937,
                5019
            ],
            [
                5019,
                5048
            ],
            [
                5049,
                5124
            ],
            [
                5128,
                5131
            ],
            [
                5134,
                5148
            ],
            [
                5149,
                5160
            ],
            [
                5164,
                5167
            ],
            [
                5170,
                5178
            ],
            [
                5180,
                5204
            ],
            [
                5205,
                5247
            ],
            [
                5247,
                5293
            ],
            [
                5297,
                5311
            ],
            [
                5312,
                5386
            ],
            [
                5390,
                5408
            ],
            [
                5408,
                5496
            ],
            [
                5496,
                5497
            ],
            [
                5498,
                5512
            ],
            [
                5513,
                5540
            ],
            [
                5541,
                5559
            ],
            [
                5560,
                5563
            ],
            [
                5568,
                5571
            ],
            [
                5572,
                5584
            ],
            [
                5585,
                5594
            ],
            [
                5595,
                5631
            ],
            [
                5632,
                5633
            ],
            [
                5641,
                5658
            ],
            [
                5659,
                5692
            ],
            [
                5695,
                5723
            ],
            [
                5724,
                5736
            ],
            [
                5736,
                5779
            ],
            [
                5783,
                5809
            ],
            [
                5812,
                5834
            ],
            [
                5835,
                5919
            ],
            [
                5923,
                5952
            ],
            [
                5953,
                5960
            ],
            [
                5969,
                5982
            ],
            [
                5984,
                6004
            ],
            [
                6008,
                6066
            ],
            [
                6069,
                6072
            ],
            [
                6073,
                6078
            ],
            [
                6078,
                6092
            ],
            [
                6093,
                6135
            ],
            [
                6136,
                6168
            ],
            [
                6177,
                6181
            ],
            [
                6181,
                6182
            ],
            [
                6183,
                6196
            ],
            [
                6201,
                6238
            ],
            [
                6238,
                6300
            ],
            [
                6301,
                6343
            ],
            [
                6345,
                6384
            ],
            [
                6384,
                6406
            ],
            [
                6411,
                6449
            ],
            [
                6453,
                6480
            ],
            [
                6483,
                6565
            ],
            [
                6565,
                6566
            ],
            [
                6567,
                6588
            ],
            [
                6589,
                6602
            ],
            [
                6603,
                6625
            ],
            [
                6625,
                6650
            ],
            [
                6653,
                6683
            ],
            [
                6683,
                6712
            ],
            [
                6712,
                6714
            ],
            [
                6714,
                6718
            ],
            [
                6719,
                6785
            ],
            [
                6785,
                6787
            ],
            [
                6787,
                6824
            ],
            [
                6828,
                6870
            ],
            [
                6870,
                6961
            ],
            [
                6961,
                6981
            ],
            [
                6981,
                7001
            ],
            [
                7002,
                7017
            ],
            [
                7017,
                7078
            ],
            [
                7078,
                7079
            ],
            [
                7080,
                7108
            ],
            [
                7108,
                7123
            ],
            [
                7125,
                7137
            ],
            [
                7137,
                7230
            ],
            [
                7230,
                7232
            ],
            [
                7232,
                7259
            ],
            [
                7259,
                7313
            ],
            [
                7317,
                7332
            ],
            [
                7335,
                7377
            ],
            [
                7378,
                7452
            ],
            [
                7452,
                7507
            ],
            [
                7510,
                7543
            ],
            [
                7544,
                7572
            ],
            [
                7576,
                7617
            ],
            [
                7617,
                7627
            ],
            [
                7630,
                7660
            ],
            [
                7662,
                7694
            ],
            [
                7695,
                7723
            ],
            [
                7723,
                7766
            ],
            [
                7774,
                7865
            ],
            [
                7865,
                7920
            ],
            [
                7920,
                7957
            ],
            [
                7965,
                8053
            ],
            [
                8055,
                8091
            ],
            [
                8096,
                8098
            ],
            [
                8099,
                8122
            ],
            [
                8125,
                8128
            ],
            [
                8135,
                8144
            ],
            [
                8145,
                8164
            ],
            [
                8164,
                8182
            ],
            [
                8191,
                8214
            ],
            [
                8215,
                8217
            ],
            [
                8221,
                8223
            ],
            [
                8223,
                8228
            ],
            [
                8229,
                8258
            ],
            [
                8258,
                8291
            ],
            [
                8291,
                8380
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                107
            ],
            [
                107,
                107
            ],
            [
                107,
                323
            ],
            [
                323,
                364
            ],
            [
                364,
                493
            ],
            [
                493,
                551
            ],
            [
                551,
                778
            ],
            [
                778,
                808
            ],
            [
                808,
                838
            ],
            [
                838,
                866
            ],
            [
                866,
                895
            ],
            [
                895,
                915
            ],
            [
                915,
                931
            ],
            [
                931,
                976
            ],
            [
                976,
                1026
            ],
            [
                1026,
                1044
            ],
            [
                1044,
                1143
            ],
            [
                1143,
                1179
            ],
            [
                1179,
                1230
            ],
            [
                1230,
                1483
            ],
            [
                1483,
                1574
            ],
            [
                1574,
                1609
            ],
            [
                1609,
                1716
            ],
            [
                1716,
                1782
            ],
            [
                1782,
                1934
            ],
            [
                1934,
                1990
            ],
            [
                1990,
                1990
            ],
            [
                1990,
                2045
            ],
            [
                2045,
                2069
            ],
            [
                2069,
                2206
            ],
            [
                2206,
                2206
            ],
            [
                2206,
                2440
            ],
            [
                2440,
                2502
            ],
            [
                2502,
                2533
            ],
            [
                2533,
                2621
            ],
            [
                2621,
                2742
            ],
            [
                2742,
                2921
            ],
            [
                2921,
                2967
            ],
            [
                2967,
                3071
            ],
            [
                3071,
                3149
            ],
            [
                3149,
                3247
            ],
            [
                3247,
                3316
            ],
            [
                3316,
                3316
            ],
            [
                3316,
                3424
            ],
            [
                3424,
                3480
            ],
            [
                3480,
                3657
            ],
            [
                3657,
                3657
            ],
            [
                3657,
                3683
            ],
            [
                3683,
                3733
            ],
            [
                3733,
                3815
            ],
            [
                3815,
                3888
            ],
            [
                3888,
                3976
            ],
            [
                3976,
                4084
            ],
            [
                4084,
                4162
            ],
            [
                4162,
                4388
            ],
            [
                4388,
                4657
            ],
            [
                4657,
                4838
            ],
            [
                4838,
                4871
            ],
            [
                4871,
                4890
            ],
            [
                4890,
                4937
            ],
            [
                4937,
                5019
            ],
            [
                5019,
                5127
            ],
            [
                5127,
                5134
            ],
            [
                5134,
                5148
            ],
            [
                5148,
                5163
            ],
            [
                5163,
                5163
            ],
            [
                5163,
                5170
            ],
            [
                5170,
                5204
            ],
            [
                5204,
                5247
            ],
            [
                5247,
                5640
            ],
            [
                5640,
                5695
            ],
            [
                5695,
                5723
            ],
            [
                5723,
                5736
            ],
            [
                5736,
                5782
            ],
            [
                5782,
                5834
            ],
            [
                5834,
                6078
            ],
            [
                6078,
                6171
            ],
            [
                6171,
                6238
            ],
            [
                6238,
                6384
            ],
            [
                6384,
                6452
            ],
            [
                6452,
                6602
            ],
            [
                6602,
                6625
            ],
            [
                6625,
                6653
            ],
            [
                6653,
                6683
            ],
            [
                6683,
                6714
            ],
            [
                6714,
                6787
            ],
            [
                6787,
                6824
            ],
            [
                6824,
                6870
            ],
            [
                6870,
                6961
            ],
            [
                6961,
                6981
            ],
            [
                6981,
                7001
            ],
            [
                7001,
                7017
            ],
            [
                7017,
                7078
            ],
            [
                7078,
                7078
            ],
            [
                7078,
                7108
            ],
            [
                7108,
                7137
            ],
            [
                7137,
                7232
            ],
            [
                7232,
                7259
            ],
            [
                7259,
                7316
            ],
            [
                7316,
                7377
            ],
            [
                7377,
                7452
            ],
            [
                7452,
                7572
            ],
            [
                7572,
                7617
            ],
            [
                7617,
                7630
            ],
            [
                7630,
                7865
            ],
            [
                7865,
                7920
            ],
            [
                7920,
                8098
            ],
            [
                8098,
                8125
            ],
            [
                8125,
                8144
            ],
            [
                8144,
                8164
            ],
            [
                8164,
                8223
            ],
            [
                8223,
                8258
            ],
            [
                8258,
                8291
            ],
            [
                8291,
                8382
            ]
        ]
    }
}