{
    "original": {
        "text": "\"Revenge may have her own; Roused discipline aloud proclaims their cause, And injured navies urge their broken laws.\" BYRON.\nMargaret began to wonder whether all offers were as unexpected beforehand,--as distressing at the time of their occurrence, as the two she had had. An involuntary comparison between Mr. Lennox and Mr. Thornton arose in her mind. She had been sorry, that an expression of any other feeling than friendship had been lured out by circumstances from Henry Lennox. That regret was the predominant feeling, on the first occasion of her receiving a proposal. She had not felt so stunned--so impressed as she did now, when echoes of Mr. Thornton's voice yet lingered about the room. In Lennox's case, he seemed for a moment to have slid over the boundary between friendship and love; and the instant afterwards, to regret it nearly as much as she did, although for different reasons. In Mr. Thornton's case, as far as Margaret knew, there was no intervening stage of friendship. Their intercourse had been one continued series of opposition. Their opinions clashed; and indeed, she had never perceived that he had cared for her opinions, as belonging to her, the individual. As far as they defied his rock-like power of character, his passion-strength, he seemed to throw them off from him with contempt, until she felt the weariness of the exertion of making useless protests; and now, he had come, in this strange wild passionate way, to make known his love! For, although at first it had struck her, that his offer was forced and goaded out of him by sharp compassion for the exposure she had made of herself,--which he, like others, might misunderstand--yet, even before he left the room,--and certainly not five minutes after, the clear conviction dawned upon her, shined bright upon her, that he did love her; that he had loved her; that he would love her. And she shrank and shuddered as under the fascination of some great power, repugnant to her whole previous life. She crept away, and hid from his idea. But it was of no use. To parody a line out of Fairfax's Tasso--\n\"His strong idea wandered through her thought.\"\nShe disliked him the more for having mastered her inner will. How dared he say that he would love her still, even though she shook him off with contempt? She wished she had spoken more--stronger. Sharp, decisive speeches came thronging into her mind, now that it was too late to utter them. The deep impression made by the interview, was like that of a horror in a dream; that will not leave the room although we waken up, and rub our eyes, and force a stiff rigid smile upon our lips. It is there--there, cowering and gibbering, with fixed ghastly eyes, in some corner of the chamber, listening to hear whether we dare to breathe of its presence to any one. And we dare not; poor cowards that we are!\nAnd so she shuddered away from the threat of his enduring love. What did he mean? Had she not the power to daunt him? She would see. It was more daring than became a man to threaten her so. Did he ground it upon the miserable yesterday? If need were, she would do the same to-morrow,--by a crippled beggar, willingly and gladly,--but by him, she would do it, just as bravely, in spite of his deductions, and the cold slime of woman's impertinence. She did it because it was right, and simple, and true to save where she could save; even to try to save. \"Fais ce que dois, advienne que pourra.\"\nHitherto she had not stirred from where he had left her; no outward circumstances had roused her out of the trance of thought in which she had been plunged by his last words, and by the look of his deep intent passionate eyes, as their flames had made her own fall before them. She went to the window, and threw it open, to dispel the oppression which hung around her. Then she went and opened the door, with a sort of impetuous wish to shake off the recollection of the past hour, in the company of others, or in active exertion. But all was profoundly hushed in the noonday stillness of a house, where an invalid catches the unrefreshing sleep that is denied to the night-hours. Margaret would not be alone. What should she do? \"Go and see Bessy Higgins, of course,\" thought she, as the recollection of the message sent the night before flashed into her mind. And away she went.\nWhen she got there, she found Bessy lying on the settle, moved close to the fire, though the day was sultry and oppressive. She was laid down quite flat, as if resting languidly after some paroxysm of pain. Margaret felt sure she ought to have the greater freedom of breathing which a more sitting posture would procure; and, without a word, she raised her up, and so arranged the pillows, that Bessy was more at ease, though very languid.\n\"I thought I should na' ha' seen yo' again,\" said she, at last, looking wistfully in Margaret's face.\n\"I'm afraid you're much worse. But I could not have come yesterday, my mother was so ill--for many reasons,\" said Margaret, colouring.\n\"Yo'd m'appen think I went beyond my place in sending Mary for yo'. But the wraglin' and the loud voices had just torn me to pieces, and I thought when father left, oh! if I could just hear her voice, reading me some words o' peace and promise, I could die away into the silence and rest o' God, just as a baby is hushed up to sleep by its mother's lullaby.\"\n\"Shall I read you a chapter, now?\"\n\"Ay, do! M'appen I shan't listen to th' sense, at first; it will seem far away--but when yo' come to words I like--to th' comforting texts--it'll seem close in my ear, and going through me as it were.\"\nMargaret began. Bessy tossed to and fro. If, by an effort, she attended for one moment, it seemed as though she were convulsed into double restlessness the next. At last, she burst out: \"Don't go on reading. It's no use. I'm blaspheming all the time in my mind, wi' thinking angrily on what canna be helped.--Yo'd hear of th' riot, m'appen, yesterday at Marlborough Mills? Thornton's factory, yo' know.\"\n\"Your father was not there, was he?\" said Margaret colouring deeply.\n\"Not he. He'd ya' given his right hand if it had never come to pass. It's that that's fretting me. He's fairly knocked down in his mind by it. It's no use telling him, fools will always break out o' bounds. Yo' never saw a man so downhearted as he is.\"\n\"But why?\" asked Margaret. \"I don't understand.\"\n\"Why, yo' see, he's a committee-man on this special strike. Th' Union appointed him because, though I say it as shouldn't say it, he's reckoned a deep chap, and true to th' back-bone. And he and t'other committee-men laid their plans. They were to hou'd together through thick and thin; what the major part thought, t'others were to think, whether they would or no. And above all there was to be no going again the law of the land. Folk would go with them if they saw them striving and starving wi' dumb patience; but if there was once any noise o' fighting and struggling--even wi' knobsticks--all was up, as they know by th' experience of many, and many a time before. They would try and get speech o' th' knobsticks, and coax 'em, and reason wi' 'em, and m'appen warn 'em off; but whatever came, the Committee charged all members o' th' Union to lie down and die, if need were, without striking a blow; and then they reckoned they were sure o' carrying th' public with them. And besides all that, Committee knew they were right in their demand, and they didn't want to have right all mixed up wi' wrong, till folk can't separate it, no more nor I can the physic-powder from th' jelly yo' gave me to mix it in; jelly is much the biggest, but powder tastes it all through. Well, I've told yo' at length about this'n, but I am tired out. Yo' just think for yor'sel, what it mun be for father to have a' his work undone, and by such a fool as Boucher, who must needs go right again the orders of Committee, and ruin th' strike, just as bad as if he meant to be a Judas. Eh! but father giv'd it him last night! He went so far as to say, he'd go and tell police where they might find th' ringleader o' th' riot; he'd give him up to th' mill-owners to do what they would wi' him. He'd show the world that th' real leaders o' the strike were not such as Boucher, but steady thoughtful men; good hands, and good citizens, who were friendly to law and judgment, and would uphold order; who only wanted their right wage, and wouldn't work, even though they starved, till they got 'em; but who would ne'er injure property or life. For,\" dropping her voice, \"they do say, that Boucher threw a stone at Thornton's sister, that welly killed her.\"\n\"That's not true,\" said Margaret. \"It was not Boucher that threw the stone\"--she went first red, then white.\n\"Yo'd be there then, were yo'?\" asked Bessie languidly: for indeed, she had spoken with many pauses, as if speech was unusually difficult to her.\n\"Yes. Never mind. Go on. Only it was not Boucher that threw the stone. But what did he answer to your father?\"\n\"He did na' speak words. He were all in such a tremble wi' spent passion, I could na' bear to look at him. I heard his breath coming quick, and at one time I thought he were sobbing. But when father said he'd give him up to police, he gave a great cry, and struck father on th' face wi' his closed fist, and he off like lightning. Father were stunned wi' the blow at first, for all Boucher were weak wi' passion and wi' clemming. He sat down a bit, and put his hand afore his eyes; and then made for th' door. I dunno' where I got strength, but I threw mysel' oh th' settle and clung to him. 'Father, father!' said I. 'Thou'll never go peach on that poor clemmed man. I'll never leave go on thee, till thou sayst thou wunnot.' 'Dunnot be a fool,' says he, 'words come readier than deeds to most men. I never thought o' telling th' police on him; though by G--, he deserves it, and I should na' ha' minded if some one else had done the dirty work, and got him clapped up. But now he has strucken me, I could do it less nor ever, for it would be getting other men to take up my quarrel. But if ever he gets well o'er this clemming, and is in good condition, he and I'll have an up and down fight, purring an' a', and I'll see what I can do for him.' And so father shook me off,--for indeed I was low and faint enough, and his face was all clay white, where it weren't bloody, and turned me sick to look at. And I know not if I slept or waked, or were in a dead swoon, till Mary come in; and I telled her to fetch yo' to me. And now dunnot talk to me, but just read out th' chapter. I'm easier in my mind for having spit it out; but I want some thoughts of the world that's far away to take the weary taste of it out of my mouth. Read me not a sermon chapter, but a story chapter; they've pictures in them, which I see when my eyes are shut. Read about the New Heavens, and the New Earth; and m'appen I'll forget this.\"\nMargaret read in her soft low voice. Though Bessy's eyes were shut, she was listening for some time, for the moisture of tears gathered heavy on her eyelashes. At last she slept; with many starts, and muttered pleadings. Margaret covered her up, and left her, for she had an uneasy consciousness that she might be wanted at home, and yet, until now, it seemed cruel to leave the dying girl.\nMrs. Hale was in the drawing-room on her daughter's return. It was one of her better days, and she was full of praises of the water-bed. It had been more like the beds at Sir John Beresford's than anything she had slept on since. She did not know how it was, but people seemed to have lost the art of making the same kind of beds as they used to do in her youth. One would think it was easy enough; there was the same kind of feathers to be had, and yet somehow, till this last night she did not know when she had had a good sound resting sleep.\nMr. Hale suggested, that something of the merits of the feather-beds of former days might be attributed to the activity of youth, which gave a relish to rest; but this idea was not kindly received by his wife.\n\"No, indeed, Mr. Hale, it was those beds at Sir John's. Now, Margaret, you're young enough, and go about in the day; are the beds comfortable? I appeal to you. Do they give you a feeling of perfect repose when you lie down upon them; or rather, don't you toss about, and try in vain to find an easy position, and wake in the morning as tired as when you went to bed?\"\nMargaret laughed. \"To tell the truth, mamma, I've never thought about my bed at all, what kind it is. I'm so sleepy at night, that if I only lie down anywhere, I nap off directly. So I don't think I'm a competent witness. But then, you know, I never had the opportunity of trying Sir John Beresford's beds. I never was at Oxenham.\"\n\"Were you not? Oh, no! to be sure. It was poor darling Fred I took with me, I remember. I only went to Oxenham once after I was married,--to your Aunt Shaw's wedding; and poor little Fred was the baby then. And I know Dixon did not like changing from lady's maid to nurse, and I was afraid that if I took her near her old home, and amongst her own people, she might want to leave me. But poor baby was taken ill at Oxenham, with his teething; and, what with my being a great deal with Anna just before her marriage, and not being very strong myself, Dixon had more of the charge of him than she ever had before; and it made her so fond of him, and she was so proud when he would turn away from every one and cling to her, that I don't believe she ever thought of leaving me again; though it was very different from what she'd been accustomed to. Poor Fred! Everybody loved him. He was born with the gift of winning hearts. It makes me think very badly of Captain Reid when I know that he disliked my own dear boy. I think it a certain proof he had a bad heart. Ah! Your poor father, Margaret. He has left the room. He can't bear to hear Fred spoken of.\"\n\"I love to hear about him, mamma. Tell me all you like; you never can tell me too much. Tell me what he was like as a baby.\"\n\"Why, Margaret, you must not be hurt, but he was much prettier than you were. I remember, when I first saw you in Dixon's arms, I said, 'Dear, what an ugly little thing!' And she said, 'It's not every child that's like Master Fred, bless him!' Dear! how well I remember it. Then I could have had Fred in my arms every minute of the day, and his cot was close by my bed; and now, now--Margaret--I don't know where my boy is, and sometimes I think I shall never see him again.\"\nMargaret sat down by her mother's sofa on a little stool, and softly took hold of her hand, caressing it and kissing it, as if to comfort. Mrs. Hale cried without restraint. At last, she sat straight, stiff up on the sofa, and turning round to her daughter, she said with tearful, almost solemn earnestness, \"Margaret, if I can get better,--if God lets me have a chance of recovery, it must be through seeing my son Frederick once more. It will waken up all the poor springs of health left in me.\"\nShe paused, and seemed to try and gather strength for something more yet to be said. Her voice was choked as she went on--was quavering as with the contemplation of some strange, yet closely-present idea.\n\"And, Margaret, if I am to die--if I am one of those appointed to die before many weeks are over--I must see my child first. I cannot think how it must be managed; but I charge you, Margaret, as you yourself hope for comfort in your last illness, bring him to me that I may bless him. Only for five minutes, Margaret. There could be no danger in five minutes. Oh, Margaret, let me see him before I die!\"\nMargaret did not think of anything that might be utterly unreasonable in this speech: we do not look for reason or logic in the passionate entreaties of those who are sick unto death; we are stung with the recollection of a thousand slighted opportunities of fulfilling the wishes of those who will soon pass away from among us: and do they ask us for the future happiness of our lives, we lay it at their feet, and will it away from us. But this wish of Mrs. Hale's was so natural, so just, so right to both parties, that Margaret felt as if, on Frederick's account as well as on her mother's, she ought to overlook all intermediate chances of danger, and pledge herself to do everything in her power for its realization. The large, pleading, dilated eyes were fixed upon her wistfully, steady in their gaze, though the poor white lips quivered like those of a child. Margaret gently rose up and stood opposite to her frail mother; so that she might gather the secure fulfilment of her wish from the calm steadiness of her daughter's face.\n\"Mamma, I will write to-night, and tell Frederick what you say. I am as sure that he will come directly to us, as I am sure of my life. Be easy, mamma, you shall see him as far as anything earthly can be promised.\"\n\"You will write to-night? Oh, Margaret! the post goes out at five--you will write by it, won't you? I have so few hours left--I feel dear, as if I should not recover, though sometimes your father over-persuades me into hoping; you will write directly, won't you? Don't lose a single post; for just by that very post I may miss him.\"\n\"But, mamma, papa is out.\"\n\"Papa is out! and what then? Do you mean that he would deny me this last wish, Margaret? Why, I should not be ill, be dying--if he had not taken me away from Helstone, to this unhealthy, smoky, sunless place.\"\n\"Oh, mamma!\" said Margaret.\n\"Yes; it is so, indeed. He knows it himself; he has said so many a time. He would do anything for me; you don't mean he would refuse me this last wish--prayer, if you will. And, indeed, Margaret, the longing to see Frederick stands between me and God. I cannot pray till I have this one thing; indeed, I cannot. Don't lose time, dear, dear Margaret. Write by this very next post. Then he may be here--here in twenty-two days! For he is sure to come. No cords or chains can keep him. In twenty-two days I shall see my boy.\" She fell back, and for a short time she took no notice of the fact that Margaret sat motionless, her hand shading her eyes.\n\"You are not writing!\" said her mother at last. \"Bring me some pens and paper; I will try and write myself.\" She sat up, trembling all over with feverish eagerness. Margaret took her hand down, and looked at her mother sadly.\n\"Only wait till papa comes in. Let us ask him how best to do it?\"\n\"You promised, Margaret, not a quarter of an hour ago,--you said he should come.\"\n\"And so he shall, mamma; don't cry, my own dear mother. I'll write here, now--you shall see me write--and it shall go by this very post; and if papa thinks fit he can write again when he comes in--it is only a day's delay. Oh, mamma, don't cry so pitifully, it cuts me to the heart.\"\nMrs. Hale could not stop her tears; they came hysterically; and, in truth, she made no effort to control them, but rather called up all the pictures of the happy past, and the probable future--painting the scene when she should lie a corpse, with the son she had longed to see in life weeping over her, and she unconscious of his presence--till she was melted by self-pity into a state of sobbing and exhaustion that made Margaret's heart ache. But at last she was calm, and greedily watched her daughter, as she began her letter; wrote it with swift urgent entreaty; sealed it up hurriedly, for fear her mother should ask to see it: and then to make security most sure, at Mrs. Hale's own bidding, took it herself to the post-office. She was coming home when her father overtook her.\n\"And where have you been, my pretty maid?\" asked he.\n\"To the post-office--with a letter; a letter to Frederick. Oh, papa, perhaps I have done wrong: but mamma was seized with such a passionate yearning to see him--she said it would make her well again--and then she said that she must see him before she died--I cannot tell you how urgent she was! Did I do wrong?\"\nMr. Hale did not reply at first. Then he said:\n\"You should have waited till I came in, Margaret.\"\n\"I tried to persuade her--\" and then she was silent.\n\"I don't know,\" said Mr. Hale, after a pause. \"She ought to see him if she wishes it so much; for I believe it would do her much more good than all the doctor's medicine--and, perhaps, set her up altogether; but the danger to him, I'm afraid, is very great.\"\n\"All these years since the mutiny, papa?\"\n\"Yes; it is necessary, of course, for government to take very stringent measures for the repression of offences against authority, more particularly in the navy, where a commanding officer needs to be surrounded in his men's eyes with a vivid consciousness of all the power there is at home to back him, and take up his cause, and avenge any injuries offered to him, if need be. Ah! it's no matter to them how far their authorities have tyrannised--galled hasty tempers to madness--or, if that can be any excuse afterwards, it is never allowed for in the first instance; they spare no expense, they send out ships--they scour the seas to lay hold of the offenders--the lapse of years does not wash out the memory of the offence--it is a fresh and vivid crime on the Admiralty books till it is blotted out by blood.\"\n\"Oh, papa, what have I done! And yet it seemed so right at the time. I'm sure Frederick himself, would run the risk.\"\n\"So he would; so he should! Nay, Margaret, I'm glad it is done, though I durst not have done it myself. I'm thankful it is as it is; I should have hesitated till, perhaps, it might have been too late to do any good. Dear Margaret, you have done what is right about it; and the end is beyond our control.\"\nIt was all very well; but her father's account of the relentless manner in which mutinies were punished made Margaret shiver and creep. If she had decoyed her brother home to blot out the memory of his error by his blood! She saw her father's anxiety lap deeper than the source of his latter cheering words. She took his arm and walked home pensively and wearily by his side.",
        "paragraph_chars": [
            [
                0,
                125
            ],
            [
                125,
                2096
            ],
            [
                2096,
                2144
            ],
            [
                2144,
                2846
            ],
            [
                2846,
                3440
            ],
            [
                3440,
                4321
            ],
            [
                4321,
                4761
            ],
            [
                4761,
                4863
            ],
            [
                4863,
                4998
            ],
            [
                4998,
                5357
            ],
            [
                5357,
                5392
            ],
            [
                5392,
                5594
            ],
            [
                5594,
                5998
            ],
            [
                5998,
                6067
            ],
            [
                6067,
                6320
            ],
            [
                6320,
                6369
            ],
            [
                6369,
                8604
            ],
            [
                8604,
                8713
            ],
            [
                8713,
                8859
            ],
            [
                8859,
                8970
            ],
            [
                8970,
                10887
            ],
            [
                10887,
                11278
            ],
            [
                11278,
                11824
            ],
            [
                11824,
                12034
            ],
            [
                12034,
                12402
            ],
            [
                12402,
                12734
            ],
            [
                12734,
                13888
            ],
            [
                13888,
                14013
            ],
            [
                14013,
                14489
            ],
            [
                14489,
                14987
            ],
            [
                14987,
                15192
            ],
            [
                15192,
                15596
            ],
            [
                15596,
                16637
            ],
            [
                16637,
                16852
            ],
            [
                16852,
                17185
            ],
            [
                17185,
                17212
            ],
            [
                17212,
                17422
            ],
            [
                17422,
                17450
            ],
            [
                17450,
                18097
            ],
            [
                18097,
                18323
            ],
            [
                18323,
                18389
            ],
            [
                18389,
                18471
            ],
            [
                18471,
                18755
            ],
            [
                18755,
                19540
            ],
            [
                19540,
                19593
            ],
            [
                19593,
                19905
            ],
            [
                19905,
                19952
            ],
            [
                19952,
                20003
            ],
            [
                20003,
                20056
            ],
            [
                20056,
                20315
            ],
            [
                20315,
                20357
            ],
            [
                20357,
                21173
            ],
            [
                21173,
                21291
            ],
            [
                21291,
                21596
            ],
            [
                21596,
                21971
            ]
        ],
        "segment_chars": [
            [
                0,
                118
            ],
            [
                118,
                125
            ],
            [
                125,
                273
            ],
            [
                273,
                354
            ],
            [
                354,
                485
            ],
            [
                485,
                577
            ],
            [
                577,
                700
            ],
            [
                700,
                901
            ],
            [
                901,
                996
            ],
            [
                996,
                1059
            ],
            [
                1059,
                1192
            ],
            [
                1192,
                1478
            ],
            [
                1478,
                1880
            ],
            [
                1880,
                1993
            ],
            [
                1993,
                2032
            ],
            [
                2032,
                2054
            ],
            [
                2054,
                2096
            ],
            [
                2096,
                2144
            ],
            [
                2144,
                2206
            ],
            [
                2206,
                2298
            ],
            [
                2298,
                2340
            ],
            [
                2340,
                2435
            ],
            [
                2435,
                2630
            ],
            [
                2630,
                2803
            ],
            [
                2803,
                2846
            ],
            [
                2846,
                2910
            ],
            [
                2910,
                2928
            ],
            [
                2928,
                2964
            ],
            [
                2964,
                2979
            ],
            [
                2979,
                3036
            ],
            [
                3036,
                3083
            ],
            [
                3083,
                3294
            ],
            [
                3294,
                3399
            ],
            [
                3399,
                3440
            ],
            [
                3440,
                3718
            ],
            [
                3718,
                3809
            ],
            [
                3809,
                3971
            ],
            [
                3971,
                4121
            ],
            [
                4121,
                4150
            ],
            [
                4150,
                4170
            ],
            [
                4170,
                4302
            ],
            [
                4302,
                4321
            ],
            [
                4321,
                4445
            ],
            [
                4445,
                4528
            ],
            [
                4528,
                4761
            ],
            [
                4761,
                4863
            ],
            [
                4863,
                4894
            ],
            [
                4894,
                4998
            ],
            [
                4998,
                5066
            ],
            [
                5066,
                5167
            ],
            [
                5167,
                5357
            ],
            [
                5357,
                5392
            ],
            [
                5392,
                5401
            ],
            [
                5401,
                5594
            ],
            [
                5594,
                5610
            ],
            [
                5610,
                5635
            ],
            [
                5635,
                5756
            ],
            [
                5756,
                5802
            ],
            [
                5802,
                5815
            ],
            [
                5815,
                5967
            ],
            [
                5967,
                5998
            ],
            [
                5998,
                6035
            ],
            [
                6035,
                6067
            ],
            [
                6067,
                6076
            ],
            [
                6076,
                6136
            ],
            [
                6136,
                6166
            ],
            [
                6166,
                6210
            ],
            [
                6210,
                6274
            ],
            [
                6274,
                6320
            ],
            [
                6320,
                6331
            ],
            [
                6331,
                6347
            ],
            [
                6347,
                6369
            ],
            [
                6369,
                6429
            ],
            [
                6429,
                6553
            ],
            [
                6553,
                6604
            ],
            [
                6604,
                6735
            ],
            [
                6735,
                6801
            ],
            [
                6801,
                7040
            ],
            [
                7040,
                7347
            ],
            [
                7347,
                7643
            ],
            [
                7643,
                7707
            ],
            [
                7707,
                7938
            ],
            [
                7938,
                7942
            ],
            [
                7942,
                7978
            ],
            [
                7978,
                8145
            ],
            [
                8145,
                8491
            ],
            [
                8491,
                8604
            ],
            [
                8604,
                8638
            ],
            [
                8638,
                8713
            ],
            [
                8713,
                8745
            ],
            [
                8745,
                8859
            ],
            [
                8859,
                8865
            ],
            [
                8865,
                8877
            ],
            [
                8877,
                8884
            ],
            [
                8884,
                8930
            ],
            [
                8930,
                8970
            ],
            [
                8970,
                8995
            ],
            [
                8995,
                9077
            ],
            [
                9077,
                9153
            ],
            [
                9153,
                9301
            ],
            [
                9301,
                9400
            ],
            [
                9400,
                9480
            ],
            [
                9480,
                9562
            ],
            [
                9562,
                9580
            ],
            [
                9580,
                9588
            ],
            [
                9588,
                9638
            ],
            [
                9638,
                9697
            ],
            [
                9697,
                9770
            ],
            [
                9770,
                9941
            ],
            [
                9941,
                10055
            ],
            [
                10055,
                10218
            ],
            [
                10218,
                10375
            ],
            [
                10375,
                10492
            ],
            [
                10492,
                10550
            ],
            [
                10550,
                10697
            ],
            [
                10697,
                10809
            ],
            [
                10809,
                10887
            ],
            [
                10887,
                10924
            ],
            [
                10924,
                11047
            ],
            [
                11047,
                11108
            ],
            [
                11108,
                11278
            ],
            [
                11278,
                11338
            ],
            [
                11338,
                11415
            ],
            [
                11415,
                11508
            ],
            [
                11508,
                11641
            ],
            [
                11641,
                11824
            ],
            [
                11824,
                12034
            ],
            [
                12034,
                12090
            ],
            [
                12090,
                12177
            ],
            [
                12177,
                12194
            ],
            [
                12194,
                12402
            ],
            [
                12402,
                12420
            ],
            [
                12420,
                12504
            ],
            [
                12504,
                12582
            ],
            [
                12582,
                12624
            ],
            [
                12624,
                12709
            ],
            [
                12709,
                12734
            ],
            [
                12734,
                12749
            ],
            [
                12749,
                12757
            ],
            [
                12757,
                12769
            ],
            [
                12769,
                12822
            ],
            [
                12822,
                12941
            ],
            [
                12941,
                13118
            ],
            [
                13118,
                13580
            ],
            [
                13580,
                13591
            ],
            [
                13591,
                13612
            ],
            [
                13612,
                13657
            ],
            [
                13657,
                13748
            ],
            [
                13748,
                13795
            ],
            [
                13795,
                13799
            ],
            [
                13799,
                13827
            ],
            [
                13827,
                13849
            ],
            [
                13849,
                13888
            ],
            [
                13888,
                13922
            ],
            [
                13922,
                13976
            ],
            [
                13976,
                14013
            ],
            [
                14013,
                14091
            ],
            [
                14091,
                14184
            ],
            [
                14184,
                14257
            ],
            [
                14257,
                14263
            ],
            [
                14263,
                14287
            ],
            [
                14287,
                14489
            ],
            [
                14489,
                14628
            ],
            [
                14628,
                14663
            ],
            [
                14663,
                14926
            ],
            [
                14926,
                14987
            ],
            [
                14987,
                15072
            ],
            [
                15072,
                15192
            ],
            [
                15192,
                15317
            ],
            [
                15317,
                15477
            ],
            [
                15477,
                15510
            ],
            [
                15510,
                15552
            ],
            [
                15552,
                15596
            ],
            [
                15596,
                16034
            ],
            [
                16034,
                16319
            ],
            [
                16319,
                16465
            ],
            [
                16465,
                16637
            ],
            [
                16637,
                16701
            ],
            [
                16701,
                16773
            ],
            [
                16773,
                16852
            ],
            [
                16852,
                16878
            ],
            [
                16878,
                16892
            ],
            [
                16892,
                16952
            ],
            [
                16952,
                17115
            ],
            [
                17115,
                17185
            ],
            [
                17185,
                17212
            ],
            [
                17212,
                17226
            ],
            [
                17226,
                17241
            ],
            [
                17241,
                17301
            ],
            [
                17301,
                17422
            ],
            [
                17422,
                17435
            ],
            [
                17435,
                17450
            ],
            [
                17450,
                17474
            ],
            [
                17474,
                17523
            ],
            [
                17523,
                17623
            ],
            [
                17623,
                17702
            ],
            [
                17702,
                17762
            ],
            [
                17762,
                17800
            ],
            [
                17800,
                17830
            ],
            [
                17830,
                17876
            ],
            [
                17876,
                17900
            ],
            [
                17900,
                17933
            ],
            [
                17933,
                17973
            ],
            [
                17973,
                18097
            ],
            [
                18097,
                18120
            ],
            [
                18120,
                18145
            ],
            [
                18145,
                18206
            ],
            [
                18206,
                18262
            ],
            [
                18262,
                18323
            ],
            [
                18323,
                18354
            ],
            [
                18354,
                18389
            ],
            [
                18389,
                18471
            ],
            [
                18471,
                18527
            ],
            [
                18527,
                18694
            ],
            [
                18694,
                18755
            ],
            [
                18755,
                19200
            ],
            [
                19200,
                19490
            ],
            [
                19490,
                19540
            ],
            [
                19540,
                19583
            ],
            [
                19583,
                19593
            ],
            [
                19593,
                19652
            ],
            [
                19652,
                19888
            ],
            [
                19888,
                19905
            ],
            [
                19905,
                19938
            ],
            [
                19938,
                19952
            ],
            [
                19952,
                20003
            ],
            [
                20003,
                20056
            ],
            [
                20056,
                20102
            ],
            [
                20102,
                20315
            ],
            [
                20315,
                20357
            ],
            [
                20357,
                20736
            ],
            [
                20736,
                20740
            ],
            [
                20740,
                21173
            ],
            [
                21173,
                21202
            ],
            [
                21202,
                21242
            ],
            [
                21242,
                21291
            ],
            [
                21291,
                21319
            ],
            [
                21319,
                21395
            ],
            [
                21395,
                21507
            ],
            [
                21507,
                21596
            ],
            [
                21596,
                21732
            ],
            [
                21732,
                21818
            ],
            [
                21818,
                21904
            ],
            [
                21904,
                21971
            ]
        ],
        "overlap_chars": [
            [
                125,
                187
            ],
            [
                204,
                215
            ],
            [
                249,
                273
            ],
            [
                307,
                334
            ],
            [
                341,
                354
            ],
            [
                483,
                484
            ],
            [
                477,
                483
            ],
            [
                372,
                373
            ],
            [
                551,
                554
            ],
            [
                406,
                413
            ],
            [
                358,
                366
            ],
            [
                490,
                496
            ],
            [
                374,
                378
            ],
            [
                430,
                433
            ],
            [
                565,
                566
            ],
            [
                517,
                524
            ],
            [
                400,
                405
            ],
            [
                414,
                429
            ],
            [
                575,
                577
            ],
            [
                577,
                604
            ],
            [
                606,
                699
            ],
            [
                700,
                867
            ],
            [
                899,
                901
            ],
            [
                901,
                923
            ],
            [
                950,
                962
            ],
            [
                975,
                994
            ],
            [
                923,
                924
            ],
            [
                1047,
                1059
            ],
            [
                1059,
                1153
            ],
            [
                1190,
                1192
            ],
            [
                1270,
                1297
            ],
            [
                1307,
                1336
            ],
            [
                1351,
                1402
            ],
            [
                1404,
                1476
            ],
            [
                1478,
                1518
            ],
            [
                1520,
                1545
            ],
            [
                1557,
                1628
            ],
            [
                1631,
                1673
            ],
            [
                1675,
                1678
            ],
            [
                1729,
                1785
            ],
            [
                1811,
                1831
            ],
            [
                1878,
                1880
            ],
            [
                1880,
                1993
            ],
            [
                1993,
                2007
            ],
            [
                2009,
                2021
            ],
            [
                2026,
                2030
            ],
            [
                2007,
                2008
            ],
            [
                2032,
                2035
            ],
            [
                2030,
                2031
            ],
            [
                2144,
                2206
            ],
            [
                2206,
                2282
            ],
            [
                2296,
                2298
            ],
            [
                2298,
                2328
            ],
            [
                2338,
                2340
            ],
            [
                2340,
                2369
            ],
            [
                2380,
                2422
            ],
            [
                2429,
                2435
            ],
            [
                2435,
                2476
            ],
            [
                2478,
                2514
            ],
            [
                2476,
                2477
            ],
            [
                2516,
                2535
            ],
            [
                2554,
                2562
            ],
            [
                2628,
                2630
            ],
            [
                2630,
                2635
            ],
            [
                2643,
                2658
            ],
            [
                2674,
                2720
            ],
            [
                2728,
                2793
            ],
            [
                2801,
                2803
            ],
            [
                2803,
                2818
            ],
            [
                2844,
                2846
            ],
            [
                2846,
                2910
            ],
            [
                2910,
                2928
            ],
            [
                2928,
                2964
            ],
            [
                2964,
                2979
            ],
            [
                3036,
                3042
            ],
            [
                3053,
                3057
            ],
            [
                3072,
                3083
            ],
            [
                3083,
                3118
            ],
            [
                3128,
                3129
            ],
            [
                3134,
                3152
            ],
            [
                3183,
                3186
            ],
            [
                3220,
                3248
            ],
            [
                3376,
                3377
            ],
            [
                3305,
                3325
            ],
            [
                3383,
                3389
            ],
            [
                3348,
                3376
            ],
            [
                3292,
                3293
            ],
            [
                3440,
                3468
            ],
            [
                3522,
                3602
            ],
            [
                3608,
                3618
            ],
            [
                3622,
                3665
            ],
            [
                3716,
                3718
            ],
            [
                3718,
                3760
            ],
            [
                3823,
                3848
            ],
            [
                3859,
                3920
            ],
            [
                3969,
                3971
            ],
            [
                3971,
                4028
            ],
            [
                4063,
                4066
            ],
            [
                4047,
                4054
            ],
            [
                4031,
                4036
            ],
            [
                4119,
                4121
            ],
            [
                4121,
                4129
            ],
            [
                4136,
                4139
            ],
            [
                4140,
                4150
            ],
            [
                4150,
                4169
            ],
            [
                4171,
                4206
            ],
            [
                4209,
                4220
            ],
            [
                4302,
                4321
            ],
            [
                4321,
                4376
            ],
            [
                4384,
                4421
            ],
            [
                4429,
                4445
            ],
            [
                4445,
                4462
            ],
            [
                4469,
                4488
            ],
            [
                4499,
                4528
            ],
            [
                4528,
                4550
            ],
            [
                4627,
                4632
            ],
            [
                4606,
                4610
            ],
            [
                4604,
                4605
            ],
            [
                4611,
                4626
            ],
            [
                4640,
                4645
            ],
            [
                4663,
                4685
            ],
            [
                4689,
                4710
            ],
            [
                4716,
                4761
            ],
            [
                4762,
                4803
            ],
            [
                4806,
                4815
            ],
            [
                4833,
                4842
            ],
            [
                4861,
                4863
            ],
            [
                4864,
                4894
            ],
            [
                4894,
                4909
            ],
            [
                4915,
                4951
            ],
            [
                4962,
                4969
            ],
            [
                4972,
                4998
            ],
            [
                5005,
                5006
            ],
            [
                4999,
                5001
            ],
            [
                5012,
                5066
            ],
            [
                5066,
                5076
            ],
            [
                5078,
                5134
            ],
            [
                5145,
                5162
            ],
            [
                5135,
                5144
            ],
            [
                5163,
                5167
            ],
            [
                5167,
                5229
            ],
            [
                5241,
                5276
            ],
            [
                5286,
                5293
            ],
            [
                5302,
                5303
            ],
            [
                5309,
                5318
            ],
            [
                5322,
                5354
            ],
            [
                5364,
                5389
            ],
            [
                5393,
                5401
            ],
            [
                5403,
                5448
            ],
            [
                5472,
                5492
            ],
            [
                5510,
                5530
            ],
            [
                5532,
                5591
            ],
            [
                5594,
                5610
            ],
            [
                5610,
                5635
            ],
            [
                5635,
                5637
            ],
            [
                5653,
                5681
            ],
            [
                5702,
                5705
            ],
            [
                5711,
                5725
            ],
            [
                5733,
                5756
            ],
            [
                5756,
                5779
            ],
            [
                5784,
                5802
            ],
            [
                5802,
                5815
            ],
            [
                5815,
                5855
            ],
            [
                5860,
                5900
            ],
            [
                5903,
                5905
            ],
            [
                5858,
                5859
            ],
            [
                5913,
                5924
            ],
            [
                5935,
                5965
            ],
            [
                5999,
                6032
            ],
            [
                6035,
                6048
            ],
            [
                6049,
                6067
            ],
            [
                6068,
                6076
            ],
            [
                6076,
                6080
            ],
            [
                6083,
                6136
            ],
            [
                6136,
                6166
            ],
            [
                6166,
                6210
            ],
            [
                6210,
                6274
            ],
            [
                6274,
                6301
            ],
            [
                6301,
                6308
            ],
            [
                6321,
                6328
            ],
            [
                6331,
                6346
            ],
            [
                6375,
                6412
            ],
            [
                6421,
                6429
            ],
            [
                6429,
                6460
            ],
            [
                6499,
                6512
            ],
            [
                6530,
                6553
            ],
            [
                6553,
                6602
            ],
            [
                6614,
                6616
            ],
            [
                6623,
                6735
            ],
            [
                6735,
                6801
            ],
            [
                6801,
                6850
            ],
            [
                6881,
                6899
            ],
            [
                6905,
                6908
            ],
            [
                6918,
                6926
            ],
            [
                7014,
                7015
            ],
            [
                6964,
                6983
            ],
            [
                7020,
                7040
            ],
            [
                7168,
                7214
            ],
            [
                7215,
                7217
            ],
            [
                7267,
                7274
            ],
            [
                7421,
                7451
            ],
            [
                7456,
                7474
            ],
            [
                7345,
                7346
            ],
            [
                7770,
                7771
            ],
            [
                7733,
                7734
            ],
            [
                7707,
                7721
            ],
            [
                7735,
                7742
            ],
            [
                7747,
                7768
            ],
            [
                7772,
                7894
            ],
            [
                7908,
                7938
            ],
            [
                7938,
                7942
            ],
            [
                7942,
                7978
            ],
            [
                7978,
                7980
            ],
            [
                8004,
                8064
            ],
            [
                8076,
                8145
            ],
            [
                8145,
                8288
            ],
            [
                8328,
                8375
            ],
            [
                8322,
                8327
            ],
            [
                8454,
                8491
            ],
            [
                8491,
                8494
            ],
            [
                8518,
                8584
            ],
            [
                8591,
                8601
            ],
            [
                8609,
                8620
            ],
            [
                8623,
                8636
            ],
            [
                8636,
                8638
            ],
            [
                8639,
                8678
            ],
            [
                8714,
                8742
            ],
            [
                8745,
                8755
            ],
            [
                8758,
                8767
            ],
            [
                8857,
                8859
            ],
            [
                8860,
                8865
            ],
            [
                8865,
                8877
            ],
            [
                8877,
                8884
            ],
            [
                8934,
                8942
            ],
            [
                8900,
                8907
            ],
            [
                8946,
                8967
            ],
            [
                8971,
                8987
            ],
            [
                8993,
                8995
            ],
            [
                8995,
                9024
            ],
            [
                9042,
                9077
            ],
            [
                9077,
                9153
            ],
            [
                9153,
                9193
            ],
            [
                9194,
                9260
            ],
            [
                9268,
                9277
            ],
            [
                9281,
                9301
            ],
            [
                9301,
                9342
            ],
            [
                9398,
                9400
            ],
            [
                9400,
                9411
            ],
            [
                9417,
                9480
            ],
            [
                9480,
                9529
            ],
            [
                9533,
                9562
            ],
            [
                9563,
                9577
            ],
            [
                9580,
                9588
            ],
            [
                9593,
                9605
            ],
            [
                9612,
                9638
            ],
            [
                9638,
                9657
            ],
            [
                9665,
                9694
            ],
            [
                9699,
                9714
            ],
            [
                9717,
                9724
            ],
            [
                9768,
                9770
            ],
            [
                9770,
                9827
            ],
            [
                9831,
                9845
            ],
            [
                9939,
                9941
            ],
            [
                10055,
                10099
            ],
            [
                10126,
                10142
            ],
            [
                10177,
                10178
            ],
            [
                10158,
                10163
            ],
            [
                10218,
                10221
            ],
            [
                10225,
                10244
            ],
            [
                10284,
                10374
            ],
            [
                10483,
                10484
            ],
            [
                10375,
                10483
            ],
            [
                10492,
                10532
            ],
            [
                10548,
                10550
            ],
            [
                10550,
                10683
            ],
            [
                10687,
                10697
            ],
            [
                10697,
                10704
            ],
            [
                10731,
                10747
            ],
            [
                10809,
                10859
            ],
            [
                10861,
                10884
            ],
            [
                10887,
                10924
            ],
            [
                10924,
                10972
            ],
            [
                10986,
                10991
            ],
            [
                11008,
                11047
            ],
            [
                11047,
                11064
            ],
            [
                11066,
                11108
            ],
            [
                11108,
                11146
            ],
            [
                11183,
                11215
            ],
            [
                11217,
                11224
            ],
            [
                11237,
                11278
            ],
            [
                11278,
                11338
            ],
            [
                11338,
                11415
            ],
            [
                11529,
                11535
            ],
            [
                11432,
                11440
            ],
            [
                11576,
                11578
            ],
            [
                11630,
                11639
            ],
            [
                11446,
                11469
            ],
            [
                11506,
                11507
            ],
            [
                12099,
                12103
            ],
            [
                12093,
                12094
            ],
            [
                12151,
                12163
            ],
            [
                12164,
                12177
            ],
            [
                12279,
                12346
            ],
            [
                12352,
                12399
            ],
            [
                12402,
                12420
            ],
            [
                12424,
                12485
            ],
            [
                12502,
                12504
            ],
            [
                12533,
                12537
            ],
            [
                12543,
                12563
            ],
            [
                12572,
                12582
            ],
            [
                12624,
                12651
            ],
            [
                12682,
                12709
            ],
            [
                12709,
                12731
            ],
            [
                12735,
                12739
            ],
            [
                12744,
                12747
            ],
            [
                12740,
                12743
            ],
            [
                12747,
                12749
            ],
            [
                12749,
                12757
            ],
            [
                12757,
                12769
            ],
            [
                12769,
                12808
            ],
            [
                12872,
                12899
            ],
            [
                12939,
                12941
            ],
            [
                13118,
                13131
            ],
            [
                13132,
                13175
            ],
            [
                13248,
                13253
            ],
            [
                13284,
                13293
            ],
            [
                13306,
                13319
            ],
            [
                13344,
                13376
            ],
            [
                13456,
                13460
            ],
            [
                13382,
                13389
            ],
            [
                13393,
                13427
            ],
            [
                13438,
                13454
            ],
            [
                13578,
                13580
            ],
            [
                13580,
                13591
            ],
            [
                13591,
                13612
            ],
            [
                13612,
                13657
            ],
            [
                13657,
                13748
            ],
            [
                13756,
                13758
            ],
            [
                13775,
                13795
            ],
            [
                13795,
                13799
            ],
            [
                13799,
                13815
            ],
            [
                13830,
                13847
            ],
            [
                13815,
                13826
            ],
            [
                13849,
                13885
            ],
            [
                13889,
                13922
            ],
            [
                13976,
                14010
            ],
            [
                14014,
                14091
            ],
            [
                14091,
                14148
            ],
            [
                14150,
                14181
            ],
            [
                14184,
                14197
            ],
            [
                14199,
                14254
            ],
            [
                14263,
                14287
            ],
            [
                14292,
                14365
            ],
            [
                14372,
                14390
            ],
            [
                14407,
                14486
            ],
            [
                14489,
                14520
            ],
            [
                14545,
                14562
            ],
            [
                14571,
                14590
            ],
            [
                14594,
                14608
            ],
            [
                14626,
                14628
            ],
            [
                14628,
                14663
            ],
            [
                14663,
                14670
            ],
            [
                14672,
                14679
            ],
            [
                14696,
                14698
            ],
            [
                14710,
                14715
            ],
            [
                14751,
                14768
            ],
            [
                14784,
                14796
            ],
            [
                14798,
                14828
            ],
            [
                14872,
                14897
            ],
            [
                14905,
                14924
            ],
            [
                14987,
                14997
            ],
            [
                15010,
                15012
            ],
            [
                15021,
                15036
            ],
            [
                15093,
                15107
            ],
            [
                14997,
                14998
            ],
            [
                15072,
                15092
            ],
            [
                14999,
                15002
            ],
            [
                15113,
                15122
            ],
            [
                15190,
                15192
            ],
            [
                15193,
                15222
            ],
            [
                15290,
                15317
            ],
            [
                15317,
                15338
            ],
            [
                15344,
                15359
            ],
            [
                15372,
                15382
            ],
            [
                15437,
                15454
            ],
            [
                15455,
                15477
            ],
            [
                15477,
                15498
            ],
            [
                15508,
                15510
            ],
            [
                15510,
                15552
            ],
            [
                15552,
                15593
            ],
            [
                15682,
                15748
            ],
            [
                15798,
                15801
            ],
            [
                15778,
                15779
            ],
            [
                15932,
                16006
            ],
            [
                16032,
                16034
            ],
            [
                16034,
                16087
            ],
            [
                16114,
                16138
            ],
            [
                16191,
                16212
            ],
            [
                16241,
                16259
            ],
            [
                16268,
                16297
            ],
            [
                16097,
                16099
            ],
            [
                16317,
                16319
            ],
            [
                16319,
                16338
            ],
            [
                16348,
                16383
            ],
            [
                16413,
                16446
            ],
            [
                16456,
                16463
            ],
            [
                16463,
                16465
            ],
            [
                16465,
                16492
            ],
            [
                16511,
                16527
            ],
            [
                16597,
                16612
            ],
            [
                16635,
                16637
            ],
            [
                16639,
                16657
            ],
            [
                16666,
                16701
            ],
            [
                16701,
                16705
            ],
            [
                16709,
                16746
            ],
            [
                16853,
                16867
            ],
            [
                16876,
                16878
            ],
            [
                16878,
                16892
            ],
            [
                16892,
                16905
            ],
            [
                16910,
                16917
            ],
            [
                17052,
                17053
            ],
            [
                16952,
                16976
            ],
            [
                17115,
                17139
            ],
            [
                17186,
                17205
            ],
            [
                17206,
                17209
            ],
            [
                17230,
                17234
            ],
            [
                17239,
                17241
            ],
            [
                17241,
                17301
            ],
            [
                17301,
                17325
            ],
            [
                17337,
                17404
            ],
            [
                17414,
                17419
            ],
            [
                17423,
                17432
            ],
            [
                17451,
                17474
            ],
            [
                17474,
                17485
            ],
            [
                17493,
                17523
            ],
            [
                17523,
                17551
            ],
            [
                17567,
                17575
            ],
            [
                17576,
                17600
            ],
            [
                17621,
                17623
            ],
            [
                17634,
                17645
            ],
            [
                17702,
                17742
            ],
            [
                17760,
                17762
            ],
            [
                17762,
                17783
            ],
            [
                17790,
                17800
            ],
            [
                17800,
                17830
            ],
            [
                17830,
                17844
            ],
            [
                17851,
                17876
            ],
            [
                17876,
                17900
            ],
            [
                17933,
                17970
            ],
            [
                17973,
                18008
            ],
            [
                18013,
                18030
            ],
            [
                18045,
                18053
            ],
            [
                18095,
                18097
            ],
            [
                18098,
                18117
            ],
            [
                18120,
                18124
            ],
            [
                18136,
                18145
            ],
            [
                18146,
                18154
            ],
            [
                18160,
                18203
            ],
            [
                18206,
                18227
            ],
            [
                18237,
                18262
            ],
            [
                18262,
                18270
            ],
            [
                18295,
                18308
            ],
            [
                18316,
                18323
            ],
            [
                18324,
                18354
            ],
            [
                18354,
                18386
            ],
            [
                18390,
                18412
            ],
            [
                18445,
                18468
            ],
            [
                18472,
                18487
            ],
            [
                18494,
                18527
            ],
            [
                18527,
                18547
            ],
            [
                18549,
                18571
            ],
            [
                18573,
                18606
            ],
            [
                18612,
                18630
            ],
            [
                18631,
                18666
            ],
            [
                18606,
                18607
            ],
            [
                18668,
                18694
            ],
            [
                18694,
                18717
            ],
            [
                18729,
                18752
            ],
            [
                18820,
                18829
            ],
            [
                18755,
                18764
            ],
            [
                18834,
                18859
            ],
            [
                18780,
                18789
            ],
            [
                18864,
                18930
            ],
            [
                18940,
                18946
            ],
            [
                18967,
                18975
            ],
            [
                18983,
                19001
            ],
            [
                19006,
                19009
            ],
            [
                19040,
                19056
            ],
            [
                19100,
                19151
            ],
            [
                19156,
                19166
            ],
            [
                19198,
                19200
            ],
            [
                19200,
                19259
            ],
            [
                19261,
                19267
            ],
            [
                19286,
                19291
            ],
            [
                19278,
                19284
            ],
            [
                19259,
                19260
            ],
            [
                19389,
                19392
            ],
            [
                19323,
                19345
            ],
            [
                19432,
                19433
            ],
            [
                19454,
                19490
            ],
            [
                19490,
                19540
            ],
            [
                19541,
                19580
            ],
            [
                19583,
                19593
            ],
            [
                19597,
                19612
            ],
            [
                19614,
                19652
            ],
            [
                19652,
                19698
            ],
            [
                19742,
                19752
            ],
            [
                19754,
                19791
            ],
            [
                19793,
                19796
            ],
            [
                19802,
                19848
            ],
            [
                19888,
                19902
            ],
            [
                19905,
                19938
            ],
            [
                20072,
                20076
            ],
            [
                20057,
                20069
            ],
            [
                20100,
                20102
            ],
            [
                20103,
                20148
            ],
            [
                20230,
                20231
            ],
            [
                20150,
                20179
            ],
            [
                20185,
                20225
            ],
            [
                20262,
                20312
            ],
            [
                20316,
                20354
            ],
            [
                20358,
                20362
            ],
            [
                20442,
                20445
            ],
            [
                20395,
                20405
            ],
            [
                20477,
                20486
            ],
            [
                20506,
                20517
            ],
            [
                20682,
                20707
            ],
            [
                20406,
                20408
            ],
            [
                20734,
                20736
            ],
            [
                20736,
                20740
            ],
            [
                20740,
                20804
            ],
            [
                20926,
                20950
            ],
            [
                20972,
                21020
            ],
            [
                21022,
                21084
            ],
            [
                21086,
                21170
            ],
            [
                21174,
                21202
            ],
            [
                21202,
                21242
            ],
            [
                21242,
                21268
            ],
            [
                21270,
                21288
            ],
            [
                21295,
                21303
            ],
            [
                21317,
                21319
            ],
            [
                21319,
                21353
            ],
            [
                21393,
                21395
            ],
            [
                21395,
                21396
            ],
            [
                21433,
                21447
            ],
            [
                21448,
                21490
            ],
            [
                21505,
                21507
            ],
            [
                21507,
                21549
            ],
            [
                21558,
                21593
            ],
            [
                21596,
                21634
            ],
            [
                21700,
                21720
            ],
            [
                21730,
                21732
            ],
            [
                21732,
                21770
            ],
            [
                21794,
                21818
            ],
            [
                21818,
                21836
            ],
            [
                21902,
                21904
            ],
            [
                21904,
                21971
            ]
        ],
        "row_chars": [
            [
                0,
                118
            ],
            [
                118,
                125
            ],
            [
                125,
                273
            ],
            [
                273,
                354
            ],
            [
                354,
                577
            ],
            [
                577,
                700
            ],
            [
                700,
                901
            ],
            [
                901,
                1059
            ],
            [
                1059,
                1192
            ],
            [
                1192,
                1478
            ],
            [
                1478,
                1880
            ],
            [
                1880,
                1993
            ],
            [
                1993,
                2054
            ],
            [
                2054,
                2096
            ],
            [
                2096,
                2144
            ],
            [
                2144,
                2206
            ],
            [
                2206,
                2298
            ],
            [
                2298,
                2340
            ],
            [
                2340,
                2435
            ],
            [
                2435,
                2630
            ],
            [
                2630,
                2803
            ],
            [
                2803,
                2846
            ],
            [
                2846,
                2910
            ],
            [
                2910,
                2928
            ],
            [
                2928,
                2964
            ],
            [
                2964,
                2979
            ],
            [
                2979,
                3036
            ],
            [
                3036,
                3083
            ],
            [
                3083,
                3399
            ],
            [
                3399,
                3440
            ],
            [
                3440,
                3718
            ],
            [
                3718,
                3971
            ],
            [
                3971,
                4121
            ],
            [
                4121,
                4150
            ],
            [
                4150,
                4170
            ],
            [
                4170,
                4321
            ],
            [
                4321,
                4445
            ],
            [
                4445,
                4528
            ],
            [
                4528,
                4761
            ],
            [
                4761,
                4863
            ],
            [
                4863,
                4894
            ],
            [
                4894,
                4998
            ],
            [
                4998,
                5066
            ],
            [
                5066,
                5167
            ],
            [
                5167,
                5357
            ],
            [
                5357,
                5392
            ],
            [
                5392,
                5401
            ],
            [
                5401,
                5594
            ],
            [
                5594,
                5610
            ],
            [
                5610,
                5635
            ],
            [
                5635,
                5756
            ],
            [
                5756,
                5802
            ],
            [
                5802,
                5815
            ],
            [
                5815,
                5967
            ],
            [
                5967,
                5998
            ],
            [
                5998,
                6035
            ],
            [
                6035,
                6067
            ],
            [
                6067,
                6076
            ],
            [
                6076,
                6136
            ],
            [
                6136,
                6166
            ],
            [
                6166,
                6210
            ],
            [
                6210,
                6274
            ],
            [
                6274,
                6320
            ],
            [
                6320,
                6331
            ],
            [
                6331,
                6347
            ],
            [
                6347,
                6369
            ],
            [
                6369,
                6429
            ],
            [
                6429,
                6553
            ],
            [
                6553,
                6735
            ],
            [
                6735,
                6801
            ],
            [
                6801,
                7040
            ],
            [
                7040,
                7643
            ],
            [
                7643,
                7707
            ],
            [
                7707,
                7938
            ],
            [
                7938,
                7942
            ],
            [
                7942,
                7978
            ],
            [
                7978,
                8145
            ],
            [
                8145,
                8491
            ],
            [
                8491,
                8604
            ],
            [
                8604,
                8638
            ],
            [
                8638,
                8713
            ],
            [
                8713,
                8745
            ],
            [
                8745,
                8859
            ],
            [
                8859,
                8865
            ],
            [
                8865,
                8877
            ],
            [
                8877,
                8884
            ],
            [
                8884,
                8970
            ],
            [
                8970,
                8995
            ],
            [
                8995,
                9077
            ],
            [
                9077,
                9153
            ],
            [
                9153,
                9301
            ],
            [
                9301,
                9400
            ],
            [
                9400,
                9480
            ],
            [
                9480,
                9562
            ],
            [
                9562,
                9580
            ],
            [
                9580,
                9588
            ],
            [
                9588,
                9638
            ],
            [
                9638,
                9697
            ],
            [
                9697,
                9770
            ],
            [
                9770,
                9941
            ],
            [
                9941,
                10055
            ],
            [
                10055,
                10218
            ],
            [
                10218,
                10375
            ],
            [
                10375,
                10492
            ],
            [
                10492,
                10550
            ],
            [
                10550,
                10697
            ],
            [
                10697,
                10887
            ],
            [
                10887,
                10924
            ],
            [
                10924,
                11047
            ],
            [
                11047,
                11108
            ],
            [
                11108,
                11278
            ],
            [
                11278,
                11338
            ],
            [
                11338,
                11415
            ],
            [
                11415,
                11641
            ],
            [
                11641,
                11824
            ],
            [
                11824,
                12034
            ],
            [
                12034,
                12090
            ],
            [
                12090,
                12177
            ],
            [
                12177,
                12194
            ],
            [
                12194,
                12402
            ],
            [
                12402,
                12420
            ],
            [
                12420,
                12504
            ],
            [
                12504,
                12582
            ],
            [
                12582,
                12624
            ],
            [
                12624,
                12709
            ],
            [
                12709,
                12734
            ],
            [
                12734,
                12749
            ],
            [
                12749,
                12757
            ],
            [
                12757,
                12769
            ],
            [
                12769,
                12941
            ],
            [
                12941,
                13118
            ],
            [
                13118,
                13580
            ],
            [
                13580,
                13591
            ],
            [
                13591,
                13612
            ],
            [
                13612,
                13657
            ],
            [
                13657,
                13748
            ],
            [
                13748,
                13795
            ],
            [
                13795,
                13799
            ],
            [
                13799,
                13849
            ],
            [
                13849,
                13888
            ],
            [
                13888,
                13922
            ],
            [
                13922,
                13976
            ],
            [
                13976,
                14013
            ],
            [
                14013,
                14091
            ],
            [
                14091,
                14184
            ],
            [
                14184,
                14257
            ],
            [
                14257,
                14263
            ],
            [
                14263,
                14287
            ],
            [
                14287,
                14489
            ],
            [
                14489,
                14628
            ],
            [
                14628,
                14663
            ],
            [
                14663,
                14926
            ],
            [
                14926,
                14987
            ],
            [
                14987,
                15192
            ],
            [
                15192,
                15317
            ],
            [
                15317,
                15477
            ],
            [
                15477,
                15510
            ],
            [
                15510,
                15552
            ],
            [
                15552,
                15596
            ],
            [
                15596,
                16034
            ],
            [
                16034,
                16319
            ],
            [
                16319,
                16465
            ],
            [
                16465,
                16637
            ],
            [
                16637,
                16701
            ],
            [
                16701,
                16773
            ],
            [
                16773,
                16852
            ],
            [
                16852,
                16878
            ],
            [
                16878,
                16892
            ],
            [
                16892,
                17115
            ],
            [
                17115,
                17185
            ],
            [
                17185,
                17212
            ],
            [
                17212,
                17226
            ],
            [
                17226,
                17241
            ],
            [
                17241,
                17301
            ],
            [
                17301,
                17422
            ],
            [
                17422,
                17435
            ],
            [
                17435,
                17450
            ],
            [
                17450,
                17474
            ],
            [
                17474,
                17523
            ],
            [
                17523,
                17623
            ],
            [
                17623,
                17762
            ],
            [
                17762,
                17800
            ],
            [
                17800,
                17830
            ],
            [
                17830,
                17876
            ],
            [
                17876,
                17900
            ],
            [
                17900,
                17933
            ],
            [
                17933,
                17973
            ],
            [
                17973,
                18097
            ],
            [
                18097,
                18120
            ],
            [
                18120,
                18145
            ],
            [
                18145,
                18206
            ],
            [
                18206,
                18262
            ],
            [
                18262,
                18323
            ],
            [
                18323,
                18354
            ],
            [
                18354,
                18389
            ],
            [
                18389,
                18471
            ],
            [
                18471,
                18527
            ],
            [
                18527,
                18694
            ],
            [
                18694,
                18755
            ],
            [
                18755,
                19200
            ],
            [
                19200,
                19490
            ],
            [
                19490,
                19540
            ],
            [
                19540,
                19583
            ],
            [
                19583,
                19593
            ],
            [
                19593,
                19652
            ],
            [
                19652,
                19888
            ],
            [
                19888,
                19905
            ],
            [
                19905,
                19938
            ],
            [
                19938,
                19952
            ],
            [
                19952,
                20003
            ],
            [
                20003,
                20056
            ],
            [
                20056,
                20102
            ],
            [
                20102,
                20315
            ],
            [
                20315,
                20357
            ],
            [
                20357,
                20736
            ],
            [
                20736,
                20740
            ],
            [
                20740,
                21173
            ],
            [
                21173,
                21202
            ],
            [
                21202,
                21242
            ],
            [
                21242,
                21291
            ],
            [
                21291,
                21319
            ],
            [
                21319,
                21395
            ],
            [
                21395,
                21507
            ],
            [
                21507,
                21596
            ],
            [
                21596,
                21732
            ],
            [
                21732,
                21818
            ],
            [
                21818,
                21904
            ],
            [
                21904,
                21971
            ]
        ]
    },
    "abridged": {
        "text": "Margaret began to wonder whether all offers were as unexpected and distressing as the two she had had. She compared Mr. Lennox and Mr. Thornton in her mind. When Mr. Lennox proposed, her main feeling had been regret that he had expressed a feeling other than friendship. She had not felt so stunned - so impressed as she did now, when echoes of Mr. Thornton's voice yet lingered about the room.\nIn Lennox's case, he seemed for a moment to have slid over the boundary between friendship and love; and the instant afterwards, to regret it nearly as much as she did. In Mr. Thornton's case there was no stage of friendship, only opposition. Their opinions clashed; and indeed, she had never perceived that he had cared for her opinions. He seemed to throw them off with contempt, until she felt weary of the exertion of making useless protests; and now he had come, in this strange wild passionate way, to make known his love.\nFor, although at first it had struck her that his offer was forced out of him by sharp compassion for the exposure she had made of herself - which he, like others, might misunderstand - yet five minutes after, the clear conviction dawned upon her that he did love her. And she shrank and shuddered as under the fascination of some great power, repugnant to her whole previous life. She crept away and hid from the idea, but in vain.\nShe disliked him the more for having mastered her inner will. How dared he say that he would love her still, even though she shook him off? She wished she had spoken more strongly. Sharp, decisive speeches came into her mind, now that it was too late to say them. The deep impression made by the interview was like that of a horror in a dream, that will not leave when we waken. It is there, cowering with fixed ghastly eyes, in some corner of the room, listening to hear whether we dare to breathe of its presence to anyone. And we dare not!\nAnd so she shuddered away from the threat of his enduring love. What did he mean? Had she not the power to daunt him? She would see. Did he base his vow upon yesterday? If need were, she would do the same tomorrow, for a crippled beggar, or for him, in spite of his deductions; because it was right to try to save where she could save.\nHitherto she had not stirred. Nothing had roused her out of the trance of thought in which she had been plunged by his words, and the look of his deep intent passionate eyes. Now she went to the window, and threw it open, and opened the door, with an impetuous wish to shake off the recollection of the past hour. But all was profoundly hushed in the noonday stillness of the invalid's house. Margaret did not wish to be alone. What should she do?\n'Go and see Bessy Higgins, of course,' thought she; and away she went.\nWhen she got there, she found Bessy lying on the settle close to the fire, though the day was warm and oppressive. She was laid down flat, as if resting after some paroxysm of pain. Margaret felt sure she would breathe more easily in a sitting posture; and she raised her up, and arranged the pillows, until Bessy was more at ease, though very languid.\n'I thought I should na' ha' seen yo' again,' said she, wistfully.\n'I'm afraid you're much worse. But I could not come yesterday, my mother was so ill - and other reasons,' said Margaret, colouring.\n'Yo' may think I went beyond my place in sending Mary for yo'. But the wranglin' and the loud voices had just torn me to pieces, and when father left, I thought oh! if I could just hear her voice, reading me some words o' peace, I could die away into the silence o' God, like a babby is hushed to sleep by its mother's lullaby.'\n'Shall I read you a chapter, now?'\n'Ay, do! Happen I shan't listen to th' sense, at first; but when yo' come to th' comforting texts, it'll seem close in my ear, and going through me as it were.'\nMargaret began. Bessy tossed to and fro. If she attended for one moment, she was convulsed into restlessness the next. At last, she burst out:\n'Don't go on reading. It's no use. I'm blaspheming all the time in my mind, thinking angrily on what canna be helped. Yo' heard of th' riot yesterday at Marlborough Mills?'\n'Your father was not there, was he?' said Margaret, colouring deeply.\n'Not he. He'd ha' given his right hand if it had never come to pass. It's that that's fretting me. He's fairly knocked down in his mind by it. It's no use telling him, fools will always break out o' bounds. Yo' never saw a man so down-hearted.'\n'But why?' asked Margaret.\n'Yo' see, he's a committee-man on this strike. Th' Union appointed him because he's reckoned true to th' back-bone. And he and t'other committee-men laid their plans, to hold together through thick and thin; what the major part thought, t'others were to think, whether they would or no. And above all there was to be no going again the law of the land. Folk would go with them if they saw them striving patiently; but if there was any fighting, all was up, as they knew from many a time before. The Committee charged all members o' th' Union not to strike a blow; they didn't want to have right mixed up wi' wrong.\n'Well, yo' just think what it must be for father to have his work undone, and by such a fool as Boucher, who must needs go right again the orders of Committee, and ruin th' strike as if he meant to be a Judas. Eh! but father giv'd it him last night! He even said he'd go and tell police where they might find th' ringleader; he'd give him up to th' mill-owners to do what they would wi' him. He'd show the world that th' real leaders o' the strike were not such as Boucher, but steady thoughtful men; good hands, and good citizens, who would uphold order; who only wanted their right wages, and would ne'er injure property or life. For they do say, that Boucher threw a stone at Thornton's sister, that nearly killed her.'\n'That's not true,' said Margaret, flushing. 'It was not Boucher that threw the stone.'\n'Yo'd be there then, were yo'?' asked Bessy languidly.\n'Yes. Never mind. Go on. What did Boucher answer to your father?'\n'He did na' speak. He were all in such a tremble, I could na' bear to look at him. I heard his breath coming quick, and at one time I thought he were sobbing. But when father said he'd give him up to the police, he gave a great cry, and struck father on th' face wi' his fist, and be off like lightning. Father were stunned wi' the blow at first. He sat down, and put his hand afore his eyes; and then made for th' door. I dunno' where I got strength, but I threw mysel' off th' settle and clung to him. \"Father, father!\" said I. \"Thou'll never go tell on that poor clemmed man. I'll never leave go, till thou sayst thou wunnot.\" \"Dunnot be a fool,\" says he. \"I never thought o' telling th' police on him; though by G-, he deserves it. But if ever he gets well o'er this clemming, he and I'll have a fight.\" And father shook me off, and his face was all clay white, where it weren't bloody, and turned me sick to look at.\n'And I know not if I slept or waked, or were in a dead swoon, till Mary come in; and I telled her to fetch yo'. And now dunnot talk to me, but just read. I'm easier in my mind for having spit it out; but I want some thoughts of the world that's far away to take the weary taste of it out o' my mouth. Read me a story chapter; read about the New Heavens, and the New Earth; and 'appen I'll forget this.'\nMargaret read in her soft low voice. Though Bessy's eyes were shut, she was listening, for tears gathered heavy on her eyelashes. At last she slept, with many starts, and muttered pleadings. Margaret covered her up, and left her, uneasily aware that she might be wanted at home; and yet it seemed cruel to leave the dying girl.\nMrs. Hale was in the drawing-room on her daughter's return. It was one of her better days, and she was full of praises of the water-bed. It was like the feather-beds of her youth at Sir John Beresford's.\n'Margaret,' she said, 'are the beds today comfortable? Don't you toss about, and try in vain to find an easy position, and waken in the morning as tired as when you went to bed?'\nMargaret laughed. 'To tell the truth, mamma, I've never thought about my bed at all. If I lie down anywhere, I go to sleep directly. But then, you know, I never tried Sir John Beresford's beds. I never was at Oxenham.'\n'Were not you? Oh, no! to be sure. It was poor darling Fred I took with me to your Aunt Shaw's wedding. But poor baby Fred was taken ill at Oxenham, with his teething, and Dixon had charge of him; and it made her so fond of him that she was proud when he would turn away from everyone and cling to her. Poor Fred! Everybody loved him. He was born with the gift of winning hearts. It makes me think very badly of Captain Reid when I know that he disliked my own dear boy. It proves he had a bad heart. Ah! Your poor father has left the room, Margaret. He can't bear to hear Fred spoken of.'\n'I love to hear about him, mamma. Tell me what he was like as a baby.'\n'Why, Margaret, you must not be hurt, but he was much prettier than you were. I remember, when I first saw you in Dixon's arms, I said, \"Dear, what an ugly little thing!\" And she said, \"It's not every child that's like Master Fred, bless him!\" How well I remember it. I could have had Fred in my arms every minute of the day, and his cot was by my bed; and now - I don't know where my boy is, and sometimes I think I shall never see him again.'\nMargaret sat down by her mother, and softly took her hand, caressing and kissing it. Mrs. Hale cried without restraint. At last she sat up, and said with tearful earnestness, 'Margaret, if I can get better, it must be through seeing Frederick once more.'\nShe paused to gather strength; as she went on, her voice was choked and quavering.\n'And, Margaret, if I am to die - I must see my child first. I cannot think how it may be managed; but, Margaret, bring him to me so that I may bless him. Only for five minutes. There could be no danger in five minutes. Oh, Margaret, let me see him before I die!'\nWe do not look for reason or logic in the passionate entreaties of the dying; if they ask us for the future happiness of our lives, we lay it at their feet. But this wish of Mrs. Hale's was so natural, so just, that Margaret felt as if she ought to overlook any danger, and pledge to do everything in her power to fulfil it. The large, pleading eyes were fixed upon her wistfully, and the poor white lips quivered like a child's. Margaret gently rose up and faced her frail mother with calm steadiness.\n'Mamma, I will write tonight, and tell Frederick what you say. I am sure that he will come directly to us.'\n'You will write tonight? Oh, Margaret! the post goes at five - I have so few hours left. Don't lose a single post.'\n'But, mamma, papa is gone out.'\n'What of it? Do you mean that he would deny me this last wish, Margaret? Why, I should not be ill if he had not taken me away from Helstone, to this unhealthy, smoky place.'\n'Oh, mamma!'\n'Yes; it is so, indeed. He knows it; he has said so many a time. He would do anything for me; he would not refuse me this last wish. Indeed, Margaret, I cannot pray till I have this one thing. Don't lose time, dear Margaret. Write by this very next post. Then he may be here in twenty-two days! For he is sure to come. In twenty-two days I shall see my boy.' She fell back, and for a short time took no notice of Margaret.\n'You are not writing!' she said at last. 'Bring me pens and paper; I will try and write myself.' She sat up, trembling with feverish eagerness. Margaret looked at her sadly.\n'Only wait till papa comes in. Let us ask him how best to do it.'\n'You promised, Margaret - you said he should come.'\n'And so he shall; don't cry, my own dear mother. I'll write here, now - you shall see me write - and it shall go by this very post. If papa thinks fit, he can write again when he comes in; it is only a day's delay. Oh, mamma, don't cry so - it cuts me to the heart.'\nIn truth, Mrs. Hale made no effort to control her tears, but rather called up all the pictures of the happy past, and the sad future - when she might lie a corpse, with her son weeping over her - till she was melted by self-pity into a state of sobbing exhaustion. But at last she was calm, and greedily watched her daughter as she wrote the letter, and sealed it up hurriedly.\nMargaret took it herself to the post-office. She was coming home when her father overtook her.\n'And where have you been, my pretty maid?' asked he.\n'To the post-office with a letter; a letter to Frederick. Oh, papa, perhaps I have done wrong: but mamma so longed to see him - she said it would make her well again - and she said that she must see him before she died. Did I do wrong?'\nMr. Hale did not reply at first. Then he said: 'I don't know. She ought to see him if she wishes it so much, for I believe it would do her more good than all the doctor's medicine; but the danger to him, I'm afraid, is very great.'\n'All these years since the mutiny, papa?'\n'Yes; the government must uphold authority in the navy, and avenge any injuries to its officers. Ah! it's no matter to them how far their authorities have tyrannised; they spare no expense, they scour the seas to lay hold of the offenders. The lapse of years does not wash out the memory of the offence. It is a fresh and vivid crime on the Admiralty books till it is blotted out by blood.'\n'Oh, papa, what have I done! And yet it seemed so right at the time. I'm sure Frederick himself would run the risk.'\n'So he would! Nay, Margaret, I'm glad it is done. I would have hesitated myself, till, perhaps, it might have been too late. Dear Margaret, you have done what is right; and the end is beyond our control.'\nIt was all very well; but her father's words made Margaret shiver. If she had decoyed her brother home to pay for his error by his blood! She saw her father was anxious. She took his arm and walked home pensively and wearily by his side.",
        "paragraph_chars": [
            [
                0,
                395
            ],
            [
                395,
                924
            ],
            [
                924,
                1357
            ],
            [
                1357,
                1900
            ],
            [
                1900,
                2236
            ],
            [
                2236,
                2684
            ],
            [
                2684,
                2755
            ],
            [
                2755,
                3108
            ],
            [
                3108,
                3174
            ],
            [
                3174,
                3306
            ],
            [
                3306,
                3635
            ],
            [
                3635,
                3670
            ],
            [
                3670,
                3831
            ],
            [
                3831,
                3974
            ],
            [
                3974,
                4147
            ],
            [
                4147,
                4217
            ],
            [
                4217,
                4462
            ],
            [
                4462,
                4489
            ],
            [
                4489,
                5104
            ],
            [
                5104,
                5827
            ],
            [
                5827,
                5914
            ],
            [
                5914,
                5969
            ],
            [
                5969,
                6035
            ],
            [
                6035,
                6957
            ],
            [
                6957,
                7360
            ],
            [
                7360,
                7688
            ],
            [
                7688,
                7892
            ],
            [
                7892,
                8071
            ],
            [
                8071,
                8290
            ],
            [
                8290,
                8880
            ],
            [
                8880,
                8951
            ],
            [
                8951,
                9396
            ],
            [
                9396,
                9651
            ],
            [
                9651,
                9734
            ],
            [
                9734,
                9997
            ],
            [
                9997,
                10500
            ],
            [
                10500,
                10608
            ],
            [
                10608,
                10724
            ],
            [
                10724,
                10756
            ],
            [
                10756,
                10930
            ],
            [
                10930,
                10943
            ],
            [
                10943,
                11366
            ],
            [
                11366,
                11540
            ],
            [
                11540,
                11606
            ],
            [
                11606,
                11658
            ],
            [
                11658,
                11925
            ],
            [
                11925,
                12303
            ],
            [
                12303,
                12398
            ],
            [
                12398,
                12451
            ],
            [
                12451,
                12688
            ],
            [
                12688,
                12920
            ],
            [
                12920,
                12962
            ],
            [
                12962,
                13353
            ],
            [
                13353,
                13470
            ],
            [
                13470,
                13675
            ],
            [
                13675,
                13912
            ]
        ],
        "segment_chars": [
            [
                0,
                103
            ],
            [
                103,
                157
            ],
            [
                157,
                271
            ],
            [
                271,
                395
            ],
            [
                395,
                564
            ],
            [
                564,
                638
            ],
            [
                638,
                734
            ],
            [
                734,
                924
            ],
            [
                924,
                1193
            ],
            [
                1193,
                1306
            ],
            [
                1306,
                1357
            ],
            [
                1357,
                1419
            ],
            [
                1419,
                1497
            ],
            [
                1497,
                1538
            ],
            [
                1538,
                1621
            ],
            [
                1621,
                1736
            ],
            [
                1736,
                1883
            ],
            [
                1883,
                1900
            ],
            [
                1900,
                1964
            ],
            [
                1964,
                1982
            ],
            [
                1982,
                2018
            ],
            [
                2018,
                2033
            ],
            [
                2033,
                2069
            ],
            [
                2069,
                2236
            ],
            [
                2236,
                2266
            ],
            [
                2266,
                2411
            ],
            [
                2411,
                2550
            ],
            [
                2550,
                2629
            ],
            [
                2629,
                2664
            ],
            [
                2664,
                2684
            ],
            [
                2684,
                2755
            ],
            [
                2755,
                2870
            ],
            [
                2870,
                2937
            ],
            [
                2937,
                3108
            ],
            [
                3108,
                3174
            ],
            [
                3174,
                3205
            ],
            [
                3205,
                3306
            ],
            [
                3306,
                3369
            ],
            [
                3369,
                3471
            ],
            [
                3471,
                3635
            ],
            [
                3635,
                3670
            ],
            [
                3670,
                3679
            ],
            [
                3679,
                3831
            ],
            [
                3831,
                3847
            ],
            [
                3847,
                3872
            ],
            [
                3872,
                3950
            ],
            [
                3950,
                3974
            ],
            [
                3974,
                3996
            ],
            [
                3996,
                4009
            ],
            [
                4009,
                4092
            ],
            [
                4092,
                4147
            ],
            [
                4147,
                4184
            ],
            [
                4184,
                4217
            ],
            [
                4217,
                4226
            ],
            [
                4226,
                4286
            ],
            [
                4286,
                4316
            ],
            [
                4316,
                4360
            ],
            [
                4360,
                4424
            ],
            [
                4424,
                4462
            ],
            [
                4462,
                4473
            ],
            [
                4473,
                4489
            ],
            [
                4489,
                4536
            ],
            [
                4536,
                4605
            ],
            [
                4605,
                4776
            ],
            [
                4776,
                4842
            ],
            [
                4842,
                4984
            ],
            [
                4984,
                5104
            ],
            [
                5104,
                5314
            ],
            [
                5314,
                5318
            ],
            [
                5318,
                5354
            ],
            [
                5354,
                5496
            ],
            [
                5496,
                5736
            ],
            [
                5736,
                5827
            ],
            [
                5827,
                5871
            ],
            [
                5871,
                5914
            ],
            [
                5914,
                5946
            ],
            [
                5946,
                5969
            ],
            [
                5969,
                5975
            ],
            [
                5975,
                5987
            ],
            [
                5987,
                5994
            ],
            [
                5994,
                6035
            ],
            [
                6035,
                6054
            ],
            [
                6054,
                6118
            ],
            [
                6118,
                6194
            ],
            [
                6194,
                6339
            ],
            [
                6339,
                6382
            ],
            [
                6382,
                6456
            ],
            [
                6456,
                6539
            ],
            [
                6539,
                6557
            ],
            [
                6557,
                6565
            ],
            [
                6565,
                6614
            ],
            [
                6614,
                6665
            ],
            [
                6665,
                6694
            ],
            [
                6694,
                6771
            ],
            [
                6771,
                6843
            ],
            [
                6843,
                6957
            ],
            [
                6957,
                7069
            ],
            [
                7069,
                7111
            ],
            [
                7111,
                7258
            ],
            [
                7258,
                7360
            ],
            [
                7360,
                7397
            ],
            [
                7397,
                7490
            ],
            [
                7490,
                7551
            ],
            [
                7551,
                7688
            ],
            [
                7688,
                7748
            ],
            [
                7748,
                7825
            ],
            [
                7825,
                7892
            ],
            [
                7892,
                7947
            ],
            [
                7947,
                8071
            ],
            [
                8071,
                8089
            ],
            [
                8089,
                8156
            ],
            [
                8156,
                8204
            ],
            [
                8204,
                8265
            ],
            [
                8265,
                8290
            ],
            [
                8290,
                8305
            ],
            [
                8305,
                8313
            ],
            [
                8313,
                8325
            ],
            [
                8325,
                8394
            ],
            [
                8394,
                8593
            ],
            [
                8593,
                8604
            ],
            [
                8604,
                8625
            ],
            [
                8625,
                8670
            ],
            [
                8670,
                8761
            ],
            [
                8761,
                8791
            ],
            [
                8791,
                8795
            ],
            [
                8795,
                8841
            ],
            [
                8841,
                8880
            ],
            [
                8880,
                8914
            ],
            [
                8914,
                8951
            ],
            [
                8951,
                9029
            ],
            [
                9029,
                9122
            ],
            [
                9122,
                9195
            ],
            [
                9195,
                9219
            ],
            [
                9219,
                9396
            ],
            [
                9396,
                9481
            ],
            [
                9481,
                9516
            ],
            [
                9516,
                9651
            ],
            [
                9651,
                9734
            ],
            [
                9734,
                9794
            ],
            [
                9794,
                9888
            ],
            [
                9888,
                9911
            ],
            [
                9911,
                9953
            ],
            [
                9953,
                9997
            ],
            [
                9997,
                10154
            ],
            [
                10154,
                10322
            ],
            [
                10322,
                10427
            ],
            [
                10427,
                10500
            ],
            [
                10500,
                10563
            ],
            [
                10563,
                10608
            ],
            [
                10608,
                10633
            ],
            [
                10633,
                10647
            ],
            [
                10647,
                10697
            ],
            [
                10697,
                10724
            ],
            [
                10724,
                10756
            ],
            [
                10756,
                10769
            ],
            [
                10769,
                10829
            ],
            [
                10829,
                10930
            ],
            [
                10930,
                10943
            ],
            [
                10943,
                10967
            ],
            [
                10967,
                11008
            ],
            [
                11008,
                11076
            ],
            [
                11076,
                11136
            ],
            [
                11136,
                11168
            ],
            [
                11168,
                11198
            ],
            [
                11198,
                11238
            ],
            [
                11238,
                11262
            ],
            [
                11262,
                11302
            ],
            [
                11302,
                11366
            ],
            [
                11366,
                11389
            ],
            [
                11389,
                11407
            ],
            [
                11407,
                11463
            ],
            [
                11463,
                11510
            ],
            [
                11510,
                11540
            ],
            [
                11540,
                11571
            ],
            [
                11571,
                11606
            ],
            [
                11606,
                11658
            ],
            [
                11658,
                11707
            ],
            [
                11707,
                11790
            ],
            [
                11790,
                11873
            ],
            [
                11873,
                11925
            ],
            [
                11925,
                12190
            ],
            [
                12190,
                12303
            ],
            [
                12303,
                12348
            ],
            [
                12348,
                12398
            ],
            [
                12398,
                12441
            ],
            [
                12441,
                12451
            ],
            [
                12451,
                12509
            ],
            [
                12509,
                12671
            ],
            [
                12671,
                12688
            ],
            [
                12688,
                12721
            ],
            [
                12721,
                12750
            ],
            [
                12750,
                12920
            ],
            [
                12920,
                12962
            ],
            [
                12962,
                13059
            ],
            [
                13059,
                13063
            ],
            [
                13063,
                13202
            ],
            [
                13202,
                13266
            ],
            [
                13266,
                13353
            ],
            [
                13353,
                13382
            ],
            [
                13382,
                13422
            ],
            [
                13422,
                13470
            ],
            [
                13470,
                13484
            ],
            [
                13484,
                13520
            ],
            [
                13520,
                13595
            ],
            [
                13595,
                13675
            ],
            [
                13675,
                13742
            ],
            [
                13742,
                13813
            ],
            [
                13813,
                13845
            ],
            [
                13845,
                13912
            ]
        ],
        "overlap_chars": [
            [
                0,
                62
            ],
            [
                67,
                78
            ],
            [
                79,
                103
            ],
            [
                116,
                143
            ],
            [
                144,
                157
            ],
            [
                164,
                165
            ],
            [
                166,
                172
            ],
            [
                181,
                182
            ],
            [
                183,
                186
            ],
            [
                192,
                199
            ],
            [
                200,
                208
            ],
            [
                209,
                215
            ],
            [
                216,
                220
            ],
            [
                224,
                227
            ],
            [
                238,
                239
            ],
            [
                240,
                247
            ],
            [
                248,
                253
            ],
            [
                254,
                269
            ],
            [
                269,
                271
            ],
            [
                271,
                298
            ],
            [
                301,
                394
            ],
            [
                395,
                562
            ],
            [
                562,
                564
            ],
            [
                564,
                586
            ],
            [
                587,
                599
            ],
            [
                600,
                619
            ],
            [
                619,
                620
            ],
            [
                626,
                638
            ],
            [
                638,
                732
            ],
            [
                732,
                734
            ],
            [
                734,
                761
            ],
            [
                762,
                791
            ],
            [
                798,
                849
            ],
            [
                850,
                922
            ],
            [
                924,
                964
            ],
            [
                965,
                990
            ],
            [
                991,
                1062
            ],
            [
                1065,
                1107
            ],
            [
                1110,
                1113
            ],
            [
                1114,
                1170
            ],
            [
                1171,
                1191
            ],
            [
                1191,
                1193
            ],
            [
                1193,
                1306
            ],
            [
                1306,
                1320
            ],
            [
                1321,
                1333
            ],
            [
                1338,
                1342
            ],
            [
                1342,
                1343
            ],
            [
                1344,
                1347
            ],
            [
                1355,
                1356
            ],
            [
                1357,
                1419
            ],
            [
                1419,
                1495
            ],
            [
                1495,
                1497
            ],
            [
                1497,
                1527
            ],
            [
                1536,
                1538
            ],
            [
                1538,
                1567
            ],
            [
                1568,
                1610
            ],
            [
                1615,
                1621
            ],
            [
                1621,
                1662
            ],
            [
                1663,
                1699
            ],
            [
                1699,
                1700
            ],
            [
                1701,
                1720
            ],
            [
                1726,
                1734
            ],
            [
                1734,
                1736
            ],
            [
                1736,
                1741
            ],
            [
                1742,
                1757
            ],
            [
                1758,
                1804
            ],
            [
                1809,
                1874
            ],
            [
                1881,
                1883
            ],
            [
                1883,
                1898
            ],
            [
                1898,
                1900
            ],
            [
                1900,
                1964
            ],
            [
                1964,
                1982
            ],
            [
                1982,
                2018
            ],
            [
                2018,
                2033
            ],
            [
                2033,
                2039
            ],
            [
                2053,
                2057
            ],
            [
                2058,
                2069
            ],
            [
                2069,
                2104
            ],
            [
                2113,
                2114
            ],
            [
                2119,
                2137
            ],
            [
                2145,
                2148
            ],
            [
                2148,
                2176
            ],
            [
                2176,
                2177
            ],
            [
                2178,
                2198
            ],
            [
                2199,
                2205
            ],
            [
                2206,
                2234
            ],
            [
                2234,
                2235
            ],
            [
                2236,
                2264
            ],
            [
                2274,
                2354
            ],
            [
                2355,
                2365
            ],
            [
                2366,
                2409
            ],
            [
                2409,
                2411
            ],
            [
                2415,
                2457
            ],
            [
                2458,
                2483
            ],
            [
                2487,
                2548
            ],
            [
                2548,
                2550
            ],
            [
                2550,
                2607
            ],
            [
                2608,
                2611
            ],
            [
                2612,
                2619
            ],
            [
                2622,
                2627
            ],
            [
                2627,
                2629
            ],
            [
                2629,
                2637
            ],
            [
                2642,
                2645
            ],
            [
                2654,
                2664
            ],
            [
                2664,
                2683
            ],
            [
                2685,
                2720
            ],
            [
                2723,
                2734
            ],
            [
                2736,
                2755
            ],
            [
                2755,
                2810
            ],
            [
                2811,
                2848
            ],
            [
                2854,
                2870
            ],
            [
                2870,
                2887
            ],
            [
                2888,
                2907
            ],
            [
                2908,
                2937
            ],
            [
                2937,
                2959
            ],
            [
                2960,
                2965
            ],
            [
                2974,
                2978
            ],
            [
                2989,
                2990
            ],
            [
                2991,
                3006
            ],
            [
                3006,
                3011
            ],
            [
                3012,
                3034
            ],
            [
                3035,
                3056
            ],
            [
                3063,
                3108
            ],
            [
                3109,
                3150
            ],
            [
                3153,
                3162
            ],
            [
                3163,
                3172
            ],
            [
                3172,
                3174
            ],
            [
                3175,
                3205
            ],
            [
                3205,
                3220
            ],
            [
                3221,
                3257
            ],
            [
                3270,
                3277
            ],
            [
                3280,
                3306
            ],
            [
                3306,
                3307
            ],
            [
                3307,
                3309
            ],
            [
                3315,
                3369
            ],
            [
                3369,
                3379
            ],
            [
                3382,
                3438
            ],
            [
                3439,
                3456
            ],
            [
                3457,
                3466
            ],
            [
                3467,
                3471
            ],
            [
                3471,
                3533
            ],
            [
                3533,
                3568
            ],
            [
                3569,
                3576
            ],
            [
                3582,
                3583
            ],
            [
                3590,
                3599
            ],
            [
                3600,
                3632
            ],
            [
                3642,
                3667
            ],
            [
                3671,
                3679
            ],
            [
                3680,
                3725
            ],
            [
                3726,
                3746
            ],
            [
                3747,
                3767
            ],
            [
                3769,
                3828
            ],
            [
                3831,
                3847
            ],
            [
                3847,
                3872
            ],
            [
                3872,
                3874
            ],
            [
                3875,
                3903
            ],
            [
                3904,
                3907
            ],
            [
                3912,
                3926
            ],
            [
                3927,
                3950
            ],
            [
                3950,
                3973
            ],
            [
                3978,
                3996
            ],
            [
                3996,
                4009
            ],
            [
                4009,
                4049
            ],
            [
                4050,
                4090
            ],
            [
                4092,
                4094
            ],
            [
                4094,
                4095
            ],
            [
                4102,
                4113
            ],
            [
                4114,
                4144
            ],
            [
                4148,
                4181
            ],
            [
                4184,
                4197
            ],
            [
                4199,
                4217
            ],
            [
                4218,
                4226
            ],
            [
                4226,
                4230
            ],
            [
                4233,
                4286
            ],
            [
                4286,
                4316
            ],
            [
                4316,
                4360
            ],
            [
                4360,
                4424
            ],
            [
                4424,
                4451
            ],
            [
                4452,
                4459
            ],
            [
                4463,
                4470
            ],
            [
                4473,
                4488
            ],
            [
                4490,
                4527
            ],
            [
                4528,
                4536
            ],
            [
                4536,
                4567
            ],
            [
                4568,
                4581
            ],
            [
                4582,
                4605
            ],
            [
                4605,
                4654
            ],
            [
                4656,
                4658
            ],
            [
                4664,
                4776
            ],
            [
                4776,
                4842
            ],
            [
                4842,
                4891
            ],
            [
                4901,
                4919
            ],
            [
                4920,
                4923
            ],
            [
                4924,
                4932
            ],
            [
                4932,
                4933
            ],
            [
                4934,
                4953
            ],
            [
                4964,
                4984
            ],
            [
                4984,
                5030
            ],
            [
                5035,
                5037
            ],
            [
                5045,
                5052
            ],
            [
                5053,
                5083
            ],
            [
                5084,
                5102
            ],
            [
                5102,
                5103
            ],
            [
                5104,
                5105
            ],
            [
                5109,
                5110
            ],
            [
                5111,
                5125
            ],
            [
                5126,
                5133
            ],
            [
                5139,
                5160
            ],
            [
                5161,
                5283
            ],
            [
                5284,
                5314
            ],
            [
                5314,
                5318
            ],
            [
                5318,
                5354
            ],
            [
                5354,
                5356
            ],
            [
                5367,
                5427
            ],
            [
                5427,
                5496
            ],
            [
                5496,
                5639
            ],
            [
                5640,
                5687
            ],
            [
                5693,
                5698
            ],
            [
                5699,
                5736
            ],
            [
                5736,
                5739
            ],
            [
                5740,
                5806
            ],
            [
                5814,
                5824
            ],
            [
                5832,
                5843
            ],
            [
                5846,
                5859
            ],
            [
                5869,
                5871
            ],
            [
                5872,
                5911
            ],
            [
                5915,
                5943
            ],
            [
                5946,
                5956
            ],
            [
                5958,
                5967
            ],
            [
                5967,
                5969
            ],
            [
                5970,
                5975
            ],
            [
                5975,
                5987
            ],
            [
                5987,
                5994
            ],
            [
                5994,
                6002
            ],
            [
                6003,
                6010
            ],
            [
                6011,
                6032
            ],
            [
                6036,
                6052
            ],
            [
                6052,
                6054
            ],
            [
                6054,
                6083
            ],
            [
                6083,
                6118
            ],
            [
                6118,
                6194
            ],
            [
                6194,
                6234
            ],
            [
                6239,
                6305
            ],
            [
                6306,
                6315
            ],
            [
                6319,
                6339
            ],
            [
                6339,
                6380
            ],
            [
                6380,
                6382
            ],
            [
                6382,
                6393
            ],
            [
                6393,
                6456
            ],
            [
                6456,
                6505
            ],
            [
                6510,
                6539
            ],
            [
                6540,
                6554
            ],
            [
                6557,
                6565
            ],
            [
                6570,
                6582
            ],
            [
                6588,
                6614
            ],
            [
                6614,
                6633
            ],
            [
                6633,
                6662
            ],
            [
                6667,
                6682
            ],
            [
                6685,
                6692
            ],
            [
                6692,
                6694
            ],
            [
                6695,
                6752
            ],
            [
                6755,
                6769
            ],
            [
                6769,
                6771
            ],
            [
                6771,
                6815
            ],
            [
                6816,
                6832
            ],
            [
                6833,
                6834
            ],
            [
                6835,
                6840
            ],
            [
                6843,
                6846
            ],
            [
                6847,
                6866
            ],
            [
                6866,
                6956
            ],
            [
                6957,
                6958
            ],
            [
                6958,
                7066
            ],
            [
                7069,
                7109
            ],
            [
                7109,
                7111
            ],
            [
                7111,
                7244
            ],
            [
                7248,
                7258
            ],
            [
                7258,
                7265
            ],
            [
                7266,
                7282
            ],
            [
                7283,
                7333
            ],
            [
                7334,
                7357
            ],
            [
                7360,
                7397
            ],
            [
                7397,
                7445
            ],
            [
                7445,
                7450
            ],
            [
                7451,
                7490
            ],
            [
                7490,
                7507
            ],
            [
                7509,
                7551
            ],
            [
                7551,
                7589
            ],
            [
                7605,
                7637
            ],
            [
                7639,
                7646
            ],
            [
                7647,
                7688
            ],
            [
                7688,
                7748
            ],
            [
                7748,
                7825
            ],
            [
                7825,
                7831
            ],
            [
                7832,
                7840
            ],
            [
                7854,
                7856
            ],
            [
                7857,
                7866
            ],
            [
                7867,
                7890
            ],
            [
                7890,
                7891
            ],
            [
                7897,
                7901
            ],
            [
                7912,
                7913
            ],
            [
                7915,
                7927
            ],
            [
                7934,
                7947
            ],
            [
                7947,
                8014
            ],
            [
                8021,
                8068
            ],
            [
                8071,
                8089
            ],
            [
                8093,
                8154
            ],
            [
                8154,
                8156
            ],
            [
                8156,
                8160
            ],
            [
                8161,
                8181
            ],
            [
                8194,
                8204
            ],
            [
                8204,
                8231
            ],
            [
                8238,
                8265
            ],
            [
                8265,
                8287
            ],
            [
                8291,
                8295
            ],
            [
                8296,
                8299
            ],
            [
                8300,
                8303
            ],
            [
                8303,
                8305
            ],
            [
                8305,
                8313
            ],
            [
                8313,
                8325
            ],
            [
                8325,
                8364
            ],
            [
                8365,
                8392
            ],
            [
                8392,
                8394
            ],
            [
                8394,
                8407
            ],
            [
                8413,
                8456
            ],
            [
                8456,
                8461
            ],
            [
                8462,
                8471
            ],
            [
                8472,
                8485
            ],
            [
                8485,
                8517
            ],
            [
                8518,
                8522
            ],
            [
                8523,
                8530
            ],
            [
                8531,
                8565
            ],
            [
                8575,
                8591
            ],
            [
                8591,
                8593
            ],
            [
                8593,
                8604
            ],
            [
                8604,
                8625
            ],
            [
                8625,
                8670
            ],
            [
                8670,
                8761
            ],
            [
                8761,
                8763
            ],
            [
                8771,
                8791
            ],
            [
                8791,
                8795
            ],
            [
                8795,
                8811
            ],
            [
                8812,
                8829
            ],
            [
                8829,
                8840
            ],
            [
                8841,
                8877
            ],
            [
                8881,
                8914
            ],
            [
                8914,
                8948
            ],
            [
                8952,
                9029
            ],
            [
                9029,
                9086
            ],
            [
                9088,
                9119
            ],
            [
                9122,
                9135
            ],
            [
                9137,
                9192
            ],
            [
                9195,
                9219
            ],
            [
                9219,
                9292
            ],
            [
                9293,
                9311
            ],
            [
                9314,
                9393
            ],
            [
                9396,
                9427
            ],
            [
                9427,
                9444
            ],
            [
                9445,
                9464
            ],
            [
                9465,
                9479
            ],
            [
                9479,
                9481
            ],
            [
                9481,
                9516
            ],
            [
                9516,
                9523
            ],
            [
                9524,
                9531
            ],
            [
                9532,
                9534
            ],
            [
                9534,
                9539
            ],
            [
                9540,
                9557
            ],
            [
                9558,
                9570
            ],
            [
                9572,
                9602
            ],
            [
                9603,
                9628
            ],
            [
                9629,
                9648
            ],
            [
                9651,
                9661
            ],
            [
                9662,
                9664
            ],
            [
                9665,
                9680
            ],
            [
                9682,
                9696
            ],
            [
                9696,
                9697
            ],
            [
                9698,
                9718
            ],
            [
                9719,
                9722
            ],
            [
                9723,
                9732
            ],
            [
                9732,
                9734
            ],
            [
                9735,
                9764
            ],
            [
                9767,
                9794
            ],
            [
                9794,
                9815
            ],
            [
                9820,
                9835
            ],
            [
                9835,
                9845
            ],
            [
                9845,
                9862
            ],
            [
                9866,
                9888
            ],
            [
                9888,
                9909
            ],
            [
                9909,
                9911
            ],
            [
                9911,
                9953
            ],
            [
                9953,
                9994
            ],
            [
                9997,
                10063
            ],
            [
                10064,
                10067
            ],
            [
                10073,
                10074
            ],
            [
                10078,
                10152
            ],
            [
                10152,
                10154
            ],
            [
                10154,
                10207
            ],
            [
                10208,
                10232
            ],
            [
                10233,
                10254
            ],
            [
                10259,
                10277
            ],
            [
                10278,
                10307
            ],
            [
                10308,
                10310
            ],
            [
                10320,
                10322
            ],
            [
                10322,
                10341
            ],
            [
                10342,
                10377
            ],
            [
                10382,
                10415
            ],
            [
                10416,
                10423
            ],
            [
                10425,
                10427
            ],
            [
                10427,
                10454
            ],
            [
                10461,
                10477
            ],
            [
                10483,
                10498
            ],
            [
                10498,
                10500
            ],
            [
                10502,
                10520
            ],
            [
                10528,
                10563
            ],
            [
                10563,
                10567
            ],
            [
                10568,
                10605
            ],
            [
                10609,
                10623
            ],
            [
                10631,
                10633
            ],
            [
                10633,
                10647
            ],
            [
                10647,
                10660
            ],
            [
                10661,
                10668
            ],
            [
                10669,
                10670
            ],
            [
                10671,
                10695
            ],
            [
                10697,
                10721
            ],
            [
                10725,
                10744
            ],
            [
                10750,
                10753
            ],
            [
                10757,
                10761
            ],
            [
                10767,
                10769
            ],
            [
                10769,
                10829
            ],
            [
                10829,
                10853
            ],
            [
                10854,
                10921
            ],
            [
                10922,
                10927
            ],
            [
                10931,
                10940
            ],
            [
                10944,
                10967
            ],
            [
                10967,
                10978
            ],
            [
                10978,
                11008
            ],
            [
                11008,
                11036
            ],
            [
                11037,
                11045
            ],
            [
                11050,
                11074
            ],
            [
                11074,
                11076
            ],
            [
                11082,
                11093
            ],
            [
                11094,
                11134
            ],
            [
                11134,
                11136
            ],
            [
                11136,
                11157
            ],
            [
                11158,
                11168
            ],
            [
                11168,
                11198
            ],
            [
                11198,
                11212
            ],
            [
                11213,
                11238
            ],
            [
                11238,
                11262
            ],
            [
                11262,
                11299
            ],
            [
                11302,
                11337
            ],
            [
                11338,
                11355
            ],
            [
                11356,
                11364
            ],
            [
                11364,
                11366
            ],
            [
                11367,
                11386
            ],
            [
                11393,
                11397
            ],
            [
                11398,
                11407
            ],
            [
                11408,
                11416
            ],
            [
                11417,
                11460
            ],
            [
                11463,
                11484
            ],
            [
                11485,
                11510
            ],
            [
                11510,
                11518
            ],
            [
                11519,
                11532
            ],
            [
                11533,
                11540
            ],
            [
                11541,
                11571
            ],
            [
                11571,
                11603
            ],
            [
                11607,
                11629
            ],
            [
                11632,
                11655
            ],
            [
                11659,
                11674
            ],
            [
                11674,
                11707
            ],
            [
                11707,
                11727
            ],
            [
                11730,
                11752
            ],
            [
                11755,
                11788
            ],
            [
                11790,
                11808
            ],
            [
                11810,
                11845
            ],
            [
                11845,
                11846
            ],
            [
                11847,
                11873
            ],
            [
                11873,
                11896
            ],
            [
                11899,
                11922
            ],
            [
                11925,
                11934
            ],
            [
                11935,
                11944
            ],
            [
                11945,
                11970
            ],
            [
                11971,
                11980
            ],
            [
                11980,
                12046
            ],
            [
                12051,
                12057
            ],
            [
                12060,
                12068
            ],
            [
                12075,
                12093
            ],
            [
                12098,
                12101
            ],
            [
                12102,
                12118
            ],
            [
                12126,
                12177
            ],
            [
                12178,
                12188
            ],
            [
                12188,
                12190
            ],
            [
                12190,
                12249
            ],
            [
                12250,
                12256
            ],
            [
                12257,
                12262
            ],
            [
                12267,
                12273
            ],
            [
                12273,
                12274
            ],
            [
                12275,
                12278
            ],
            [
                12279,
                12301
            ],
            [
                12301,
                12302
            ],
            [
                12312,
                12348
            ],
            [
                12348,
                12398
            ],
            [
                12399,
                12438
            ],
            [
                12441,
                12451
            ],
            [
                12455,
                12470
            ],
            [
                12471,
                12509
            ],
            [
                12509,
                12555
            ],
            [
                12566,
                12576
            ],
            [
                12579,
                12616
            ],
            [
                12619,
                12622
            ],
            [
                12623,
                12669
            ],
            [
                12671,
                12685
            ],
            [
                12688,
                12721
            ],
            [
                12729,
                12733
            ],
            [
                12736,
                12748
            ],
            [
                12748,
                12750
            ],
            [
                12750,
                12795
            ],
            [
                12795,
                12796
            ],
            [
                12797,
                12826
            ],
            [
                12827,
                12867
            ],
            [
                12867,
                12917
            ],
            [
                12921,
                12959
            ],
            [
                12963,
                12967
            ],
            [
                12968,
                12971
            ],
            [
                12972,
                12982
            ],
            [
                12995,
                13004
            ],
            [
                13005,
                13016
            ],
            [
                13016,
                13041
            ],
            [
                13042,
                13044
            ],
            [
                13057,
                13059
            ],
            [
                13059,
                13063
            ],
            [
                13063,
                13127
            ],
            [
                13127,
                13151
            ],
            [
                13152,
                13200
            ],
            [
                13202,
                13264
            ],
            [
                13266,
                13350
            ],
            [
                13354,
                13382
            ],
            [
                13382,
                13422
            ],
            [
                13422,
                13448
            ],
            [
                13449,
                13467
            ],
            [
                13474,
                13482
            ],
            [
                13482,
                13484
            ],
            [
                13484,
                13518
            ],
            [
                13518,
                13520
            ],
            [
                13520,
                13521
            ],
            [
                13528,
                13542
            ],
            [
                13551,
                13593
            ],
            [
                13593,
                13595
            ],
            [
                13595,
                13637
            ],
            [
                13637,
                13672
            ],
            [
                13675,
                13713
            ],
            [
                13720,
                13740
            ],
            [
                13740,
                13742
            ],
            [
                13742,
                13780
            ],
            [
                13789,
                13813
            ],
            [
                13813,
                13831
            ],
            [
                13843,
                13845
            ],
            [
                13845,
                13912
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                103
            ],
            [
                103,
                157
            ],
            [
                157,
                271
            ],
            [
                271,
                395
            ],
            [
                395,
                564
            ],
            [
                564,
                638
            ],
            [
                638,
                734
            ],
            [
                734,
                924
            ],
            [
                924,
                1193
            ],
            [
                1193,
                1306
            ],
            [
                1306,
                1357
            ],
            [
                1357,
                1357
            ],
            [
                1357,
                1357
            ],
            [
                1357,
                1419
            ],
            [
                1419,
                1497
            ],
            [
                1497,
                1538
            ],
            [
                1538,
                1621
            ],
            [
                1621,
                1736
            ],
            [
                1736,
                1883
            ],
            [
                1883,
                1900
            ],
            [
                1900,
                1964
            ],
            [
                1964,
                1982
            ],
            [
                1982,
                2018
            ],
            [
                2018,
                2033
            ],
            [
                2033,
                2033
            ],
            [
                2033,
                2069
            ],
            [
                2069,
                2236
            ],
            [
                2236,
                2236
            ],
            [
                2236,
                2411
            ],
            [
                2411,
                2550
            ],
            [
                2550,
                2629
            ],
            [
                2629,
                2664
            ],
            [
                2664,
                2684
            ],
            [
                2684,
                2755
            ],
            [
                2755,
                2870
            ],
            [
                2870,
                2937
            ],
            [
                2937,
                3108
            ],
            [
                3108,
                3174
            ],
            [
                3174,
                3205
            ],
            [
                3205,
                3306
            ],
            [
                3306,
                3369
            ],
            [
                3369,
                3471
            ],
            [
                3471,
                3635
            ],
            [
                3635,
                3670
            ],
            [
                3670,
                3679
            ],
            [
                3679,
                3831
            ],
            [
                3831,
                3847
            ],
            [
                3847,
                3872
            ],
            [
                3872,
                3950
            ],
            [
                3950,
                3996
            ],
            [
                3996,
                4009
            ],
            [
                4009,
                4147
            ],
            [
                4147,
                4147
            ],
            [
                4147,
                4184
            ],
            [
                4184,
                4217
            ],
            [
                4217,
                4226
            ],
            [
                4226,
                4286
            ],
            [
                4286,
                4316
            ],
            [
                4316,
                4360
            ],
            [
                4360,
                4424
            ],
            [
                4424,
                4462
            ],
            [
                4462,
                4473
            ],
            [
                4473,
                4489
            ],
            [
                4489,
                4489
            ],
            [
                4489,
                4536
            ],
            [
                4536,
                4605
            ],
            [
                4605,
                4776
            ],
            [
                4776,
                4842
            ],
            [
                4842,
                4984
            ],
            [
                4984,
                5104
            ],
            [
                5104,
                5104
            ],
            [
                5104,
                5314
            ],
            [
                5314,
                5318
            ],
            [
                5318,
                5354
            ],
            [
                5354,
                5496
            ],
            [
                5496,
                5736
            ],
            [
                5736,
                5827
            ],
            [
                5827,
                5871
            ],
            [
                5871,
                5914
            ],
            [
                5914,
                5946
            ],
            [
                5946,
                5969
            ],
            [
                5969,
                5975
            ],
            [
                5975,
                5987
            ],
            [
                5987,
                5994
            ],
            [
                5994,
                6035
            ],
            [
                6035,
                6054
            ],
            [
                6054,
                6118
            ],
            [
                6118,
                6194
            ],
            [
                6194,
                6339
            ],
            [
                6339,
                6382
            ],
            [
                6382,
                6456
            ],
            [
                6456,
                6539
            ],
            [
                6539,
                6557
            ],
            [
                6557,
                6565
            ],
            [
                6565,
                6614
            ],
            [
                6614,
                6665
            ],
            [
                6665,
                6694
            ],
            [
                6694,
                6771
            ],
            [
                6771,
                6771
            ],
            [
                6771,
                6843
            ],
            [
                6843,
                6957
            ],
            [
                6957,
                7069
            ],
            [
                7069,
                7111
            ],
            [
                7111,
                7258
            ],
            [
                7258,
                7360
            ],
            [
                7360,
                7397
            ],
            [
                7397,
                7490
            ],
            [
                7490,
                7551
            ],
            [
                7551,
                7688
            ],
            [
                7688,
                7748
            ],
            [
                7748,
                7825
            ],
            [
                7825,
                7892
            ],
            [
                7892,
                7892
            ],
            [
                7892,
                7892
            ],
            [
                7892,
                7892
            ],
            [
                7892,
                7947
            ],
            [
                7947,
                7947
            ],
            [
                7947,
                8071
            ],
            [
                8071,
                8089
            ],
            [
                8089,
                8156
            ],
            [
                8156,
                8204
            ],
            [
                8204,
                8204
            ],
            [
                8204,
                8265
            ],
            [
                8265,
                8290
            ],
            [
                8290,
                8305
            ],
            [
                8305,
                8313
            ],
            [
                8313,
                8325
            ],
            [
                8325,
                8394
            ],
            [
                8394,
                8394
            ],
            [
                8394,
                8593
            ],
            [
                8593,
                8604
            ],
            [
                8604,
                8625
            ],
            [
                8625,
                8670
            ],
            [
                8670,
                8761
            ],
            [
                8761,
                8791
            ],
            [
                8791,
                8795
            ],
            [
                8795,
                8841
            ],
            [
                8841,
                8880
            ],
            [
                8880,
                8914
            ],
            [
                8914,
                8914
            ],
            [
                8914,
                8951
            ],
            [
                8951,
                9029
            ],
            [
                9029,
                9122
            ],
            [
                9122,
                9195
            ],
            [
                9195,
                9195
            ],
            [
                9195,
                9219
            ],
            [
                9219,
                9396
            ],
            [
                9396,
                9481
            ],
            [
                9481,
                9516
            ],
            [
                9516,
                9651
            ],
            [
                9651,
                9651
            ],
            [
                9651,
                9734
            ],
            [
                9734,
                9794
            ],
            [
                9794,
                9888
            ],
            [
                9888,
                9911
            ],
            [
                9911,
                9953
            ],
            [
                9953,
                9997
            ],
            [
                9997,
                10154
            ],
            [
                10154,
                10322
            ],
            [
                10322,
                10427
            ],
            [
                10427,
                10500
            ],
            [
                10500,
                10563
            ],
            [
                10563,
                10608
            ],
            [
                10608,
                10608
            ],
            [
                10608,
                10633
            ],
            [
                10633,
                10647
            ],
            [
                10647,
                10697
            ],
            [
                10697,
                10724
            ],
            [
                10724,
                10756
            ],
            [
                10756,
                10756
            ],
            [
                10756,
                10769
            ],
            [
                10769,
                10829
            ],
            [
                10829,
                10930
            ],
            [
                10930,
                10943
            ],
            [
                10943,
                10943
            ],
            [
                10943,
                10967
            ],
            [
                10967,
                11008
            ],
            [
                11008,
                11076
            ],
            [
                11076,
                11136
            ],
            [
                11136,
                11168
            ],
            [
                11168,
                11198
            ],
            [
                11198,
                11238
            ],
            [
                11238,
                11262
            ],
            [
                11262,
                11262
            ],
            [
                11262,
                11302
            ],
            [
                11302,
                11366
            ],
            [
                11366,
                11389
            ],
            [
                11389,
                11407
            ],
            [
                11407,
                11463
            ],
            [
                11463,
                11510
            ],
            [
                11510,
                11540
            ],
            [
                11540,
                11571
            ],
            [
                11571,
                11606
            ],
            [
                11606,
                11658
            ],
            [
                11658,
                11707
            ],
            [
                11707,
                11873
            ],
            [
                11873,
                11925
            ],
            [
                11925,
                12190
            ],
            [
                12190,
                12348
            ],
            [
                12348,
                12398
            ],
            [
                12398,
                12441
            ],
            [
                12441,
                12451
            ],
            [
                12451,
                12509
            ],
            [
                12509,
                12671
            ],
            [
                12671,
                12688
            ],
            [
                12688,
                12721
            ],
            [
                12721,
                12721
            ],
            [
                12721,
                12721
            ],
            [
                12721,
                12721
            ],
            [
                12721,
                12750
            ],
            [
                12750,
                12920
            ],
            [
                12920,
                12962
            ],
            [
                12962,
                13059
            ],
            [
                13059,
                13063
            ],
            [
                13063,
                13353
            ],
            [
                13353,
                13382
            ],
            [
                13382,
                13422
            ],
            [
                13422,
                13470
            ],
            [
                13470,
                13484
            ],
            [
                13484,
                13520
            ],
            [
                13520,
                13595
            ],
            [
                13595,
                13675
            ],
            [
                13675,
                13742
            ],
            [
                13742,
                13813
            ],
            [
                13813,
                13845
            ],
            [
                13845,
                13912
            ]
        ]
    }
}