{
    "original": {
        "text": "\"Some wishes crossed my mind and dimly cheered it, And one or two poor melancholy pleasures, Each in the pale unwarming light of hope, Silvering its flimsy wing, flew silent by-- Moths in the moonbeam!\" COLERIDGE.\nThe next morning brought Margaret a letter from Edith. It was affectionate and inconsequent like the writer. But the affection was charming to Margaret's own affectionate nature; and she had grown up with the inconsequence, so she did not perceive it. It was as follows:--\n\"Oh, Margaret, it is worth a journey from England to see my boy! He is a superb little fellow, especially in his caps, and most especially in the one you sent him, you good, dainty-fingered, persevering little lady! Having made all the mothers here envious, I want to show him to somebody new, and hear a fresh set of admiring expressions; perhaps, that's all the reason; perhaps it is not--nay, possibly, there is just a little cousinly love mixed with it; but I do want you so much to come here, Margaret! I'm sure it would be the very best thing for Aunt Hale's health; everybody here is young and well, and our skies are always blue, and our sun always shines, and the band plays deliciously from morning till night; and, to come back to the burden of my ditty, my baby always smiles. I am constantly wanting you to draw him from me, Margaret. It does not signify what he is doing; that very thing is prettiest, gracefullest, best. I think I love him a great deal better than my husband, who is getting stout, and grumpy--what he calls 'busy.' No! he is not. He has just come in with news of such a charming pic-nic, given by the officers of the Hazard, at anchor in the bay below. Because he has brought in such a pleasant piece of news, I retract all I said just now. Did not somebody burn his hand for having said or done something he was sorry for? Well, I can't burn mine, because it would hurt me, and the scar would be ugly; but I'll retract all I said as fast as I can. Cosmo is quite as great a darling as baby, and not a bit stout, and as ungrumpy as ever husband was; only, sometimes he is very, very busy. I may say that without love--wifely duty--- where was I?--I had something very particular to say, I know, once. Oh, it is this--Dearest Margaret!--you must come and see me; it would do Aunt Hale good, as I said before. Get the doctor to order it for her. Tell him that it's the smoke of Milton that does her harm. I have no doubt it is that, really. Three months (you must not come for less) of this delicious climate--all sunshine, and grapes as common as blackberries, would quite cure her. I don't ask my uncle\"--(Here the letter became more constrained, and better written. Mr. Hale was in the corner, like a naughty child, for having given up his living.)--\"because, I dare say, he disapproves of war, soldiers, and bands of music; at least, I know that many Dissenters are members of the Peace Society, and I am afraid he would not like to come; but, if he would, dear, pray say that Cosmo and I will do our best to make him happy; and I'll hide up Cosmo's red coat and sword, and make the band play all sorts of grave, solemn things; or, if they do play pomps and vanities, it shall be in double slow time. Dear Margaret, if he would like to accompany you and Aunt Hale, we will try and make it pleasant, though I'm rather afraid of any one who has done anything for conscience' sake. You never did, I hope. Tell Aunt Hale not to bring any warm clothes, though I'm afraid it will be late in the year before you can come. But you have no idea of the heat here! I tried to wear my great beauty Indian shawl at a pic-nic. I kept myself up with proverbs as long as I could; 'Pride must abide,'--and such wholesome pieces of pith; but it was no use. I was like mamma's little dog Tiny with an elephant's trappings on; smothered, hidden, killed with my finery; so I made it into a capital carpet for us all to sit down upon. Here's this boy of mine, Margaret--if you don't pack up your things as soon as you get this letter, and come straight off to see him, I shall think you're descended from King Herod!\"\nMargaret did long for a day of Edith's life--her freedom from care, her cheerful home, her sunny skies. If a wish could have transported her, she would have gone off; just for one day. She yearned for the strength which such a change would give--even for a few hours to be in the midst of that bright life, and to feel young again. Not yet twenty! and she had had to bear up against such hard pressure that she felt quite old. That was her first feeling after reading Edith's letter. Then she read it again, and, forgetting herself, was amused at its likeness to Edith's self, and was laughing merrily over it when Mrs. Hale came into the drawing-room, leaning on Dixon's arm. Margaret flew to adjust the pillows. Her mother seemed more than usually feeble.\n\"What were you laughing at, Margaret?\" asked she, as soon as she had recovered from the exertion of settling herself on the sofa.\n\"A letter I have had this morning from Edith. Shall I read it to you, mamma?\"\nShe read it aloud, and for a time it seemed to interest her mother, who kept wondering what name Edith had given to her boy, and suggesting all probable names, and all possible reasons why each and all of these names should be given. Into the very midst of these wonders Mr. Thornton came, bringing another offering of fruit for Mrs. Hale. He could not--say rather, he would not--deny himself the chance of the pleasure of seeing Margaret. He had no end in this but the present gratification. It was the sturdy wilfulness of a man usually most reasonable and self-controlled. He entered the room, taking in at a glance the fact of Margaret's presence; but after the first cold distant bow, he never seemed to let his eyes fall on her again. He only stayed to present his peaches--to speak some gentle kindly words--and then his cold offended eyes met Margaret's with a grave farewell, as he left the room. She sat down silent and pale.\n\"Do you know, Margaret, I really begin to like Mr. Thornton.\"\nNo answer at first. Then Margaret forced out an icy \"Do you?\"\n\"Yes! I think he is really getting quite polished in his manners.\"\nMargaret's voice was more in order now. She replied,\n\"He is very kind and attentive--there is no doubt of that.\"\n\"I wonder Mrs. Thornton never calls. She must know I am ill, because of the water-bed.\"\n\"I dare say, she hears how you are from her son.\"\n\"Still, I should like to see her. You have so few friends here, Margaret.\"\nMargaret felt what was in her mother's thoughts--a tender craving to bespeak the kindness of some woman towards the daughter that might soon be left motherless. But she could not speak.\n\"Do you think,\" said Mrs. Hale, after a pause, \"that you could go and ask Mrs. Thornton to come and see me? Only once--I don't want to be troublesome.\"\n\"I will do anything, if you wish it, mamma--but if--but when Frederick comes----\"\n\"Ah, to be sure! we must keep our doors shut--we must let no one in. I hardly know whether I dare wish him to come or not. Sometimes I think I would rather not. Sometimes I have such frightful dreams about him.\"\n\"Oh, mamma! we'll take good care. I will put my arm in the bolt sooner than he should come to the slightest harm. Trust the care of him to me, mamma. I will watch over him like a lioness over her young.\"\n\"When can we hear from him?\"\n\"Not for a week yet, certainly--perhaps more.\"\n\"We must send Martha away in good time. It would never do to have her here when he comes, and then send her off in a hurry.\"\n\"Dixon is sure to remind us of that. I was thinking that, if we wanted any help in the house while he is here, we could perhaps get Mary Higgins. She is very slack of work, and is a good girl, and would take pains to do her best, I am sure, and would sleep at home, and need never come upstairs, so as to know who is in the house.\"\n\"As you please. As Dixon pleases. But, Margaret, don't get to use these horrid Milton words. 'Slack of work:' it is a provincialism. What will your aunt Shaw say, if she hears you use it on her return?\"\n\"Oh, mamma! don't try and make a bugbear of aunt Shaw,\" said Margaret, laughing. \"Edith picked up all sorts of military slang from Captain Lennox, and aunt Shaw never took any notice of it.\"\n\"But yours is factory slang.\"\n\"And if I live in a factory town, I must speak factory language when I want it. Why, mamma, I could astonish you with a great many words you never heard in your life. I don't believe you know what a knobstick is.\"\n\"Not I, child. I only know it has a very vulgar sound; and I don't want to hear you using it.\"\n\"Very well, dearest mother, I won't. Only I shall have to use a whole explanatory sentence instead.\"\n\"I don't like this Milton,\" said Mrs. Hale. \"Edith is right enough in saying it's the smoke that has made me so ill.\"\nMargaret started up as her mother said this. Her father had just entered the room, and she was most anxious that the faint impression she had seen on his mind that the Milton air had injured her mother's health, should not be deepened--should not receive any confirmation. She could not tell whether he had heard what Mrs. Hale had said or not; but she began speaking hurriedly of other things, unaware that Mr. Thornton was following him.\n\"Mamma is accusing me of having picked up a great deal of vulgarity since we came to Milton.\"\nThe \"vulgarity\" Margaret spoke of, referred purely to the use of local words, and the expression arose out of the conversation they had just been holding. But Mr. Thornton's brow darkened; and Margaret suddenly felt how her speech might be misunderstood by him; so, in the natural sweet desire to avoid giving unnecessary pain, she forced herself to go forwards with a little greeting, and continue what she was saying, addressing herself to him expressly.\n\"Now, Mr. Thornton, though 'knobstick' has not a very pretty sound, is it not expressive? Could I do without it, in speaking of the thing it represents? If using local words is vulgar, I was very vulgar in the Forest,--was I not, mamma?\"\nIt was unusual with Margaret to obtrude her own subject of conversation on others; but, in this case, she was so anxious to prevent Mr. Thornton from feeling annoyance at the words he had accidentally overheard, that it was not until she had done speaking that she coloured all over with consciousness, more especially as Mr. Thornton seemed hardly to understand the exact gist or bearing of what she was saying, but passed her by, with a cold reserve of ceremonious movement, to speak to Mrs. Hale.\nThe sight of him reminded her of the wish to see his mother, and commend Margaret to her care. Margaret, sitting in burning silence, vexed and ashamed of her difficulty in keeping her right place, and her calm unconsciousness of heart, when Mr. Thornton was by, heard her mother's slow entreaty that Mrs. Thornton would come and see her; see her soon; to-morrow, if it were possible. Mr. Thornton promised that she should--conversed a little, and then took his leave; and Margaret's movements and voice seemed at once released from some invisible chains. He never looked at her; and yet, the careful avoidance of his eyes betokened that in some way he knew exactly where, if they fell by chance, they would rest on her. If she spoke, he gave no sign of attention, and yet his next speech to any one else was modified by what she had said; sometimes there was an express answer to what she had remarked, but given to another person as though unsuggested by her. It was not the bad manners of ignorance; it was the wilful bad manners arising from deep offence. It was wilful at the time; repented of afterwards. But no deep plan, no careful cunning could have stood him in such good stead. Margaret thought about him more than she had ever done before; not with any tinge of what is called love, but with regret that she had wounded him so deeply,--and with a gentle, patient striving to return to their former position of antagonistic friendship; for a friend's position was what she found that he had held in her regard, as well as in that of the rest of the family. There was a pretty humility in her behaviour to him, as if mutely apologising for the over-strong words which were the reaction from the deeds of the day of the riot.\nBut he resented those words bitterly. They rung in his ears; and he was proud of the sense of justice which made him go in every kindness he could offer to her parents. He exulted in the power he showed in compelling himself to face her, whenever he could think of any action which might give her father or mother pleasure. He thought that he disliked seeing one who had mortified him so keenly; but he was mistaken. It was a stinging pleasure to be in the room with her, and feel her presence. But he was no great analyser of his own motives and was mistaken, as I have said.",
        "paragraph_chars": [
            [
                0,
                214
            ],
            [
                214,
                487
            ],
            [
                487,
                4118
            ],
            [
                4118,
                4876
            ],
            [
                4876,
                5006
            ],
            [
                5006,
                5084
            ],
            [
                5084,
                6020
            ],
            [
                6020,
                6082
            ],
            [
                6082,
                6144
            ],
            [
                6144,
                6211
            ],
            [
                6211,
                6264
            ],
            [
                6264,
                6324
            ],
            [
                6324,
                6412
            ],
            [
                6412,
                6462
            ],
            [
                6462,
                6537
            ],
            [
                6537,
                6723
            ],
            [
                6723,
                6875
            ],
            [
                6875,
                6957
            ],
            [
                6957,
                7169
            ],
            [
                7169,
                7373
            ],
            [
                7373,
                7402
            ],
            [
                7402,
                7449
            ],
            [
                7449,
                7574
            ],
            [
                7574,
                7906
            ],
            [
                7906,
                8109
            ],
            [
                8109,
                8300
            ],
            [
                8300,
                8330
            ],
            [
                8330,
                8544
            ],
            [
                8544,
                8639
            ],
            [
                8639,
                8740
            ],
            [
                8740,
                8858
            ],
            [
                8858,
                9298
            ],
            [
                9298,
                9392
            ],
            [
                9392,
                9849
            ],
            [
                9849,
                10087
            ],
            [
                10087,
                10587
            ],
            [
                10587,
                12321
            ],
            [
                12321,
                12897
            ]
        ],
        "segment_chars": [
            [
                0,
                203
            ],
            [
                203,
                214
            ],
            [
                214,
                269
            ],
            [
                269,
                323
            ],
            [
                323,
                466
            ],
            [
                466,
                487
            ],
            [
                487,
                552
            ],
            [
                552,
                703
            ],
            [
                703,
                995
            ],
            [
                995,
                1276
            ],
            [
                1276,
                1335
            ],
            [
                1335,
                1423
            ],
            [
                1423,
                1535
            ],
            [
                1535,
                1539
            ],
            [
                1539,
                1550
            ],
            [
                1550,
                1673
            ],
            [
                1673,
                1761
            ],
            [
                1761,
                1844
            ],
            [
                1844,
                1969
            ],
            [
                1969,
                2109
            ],
            [
                2109,
                2221
            ],
            [
                2221,
                2328
            ],
            [
                2328,
                2364
            ],
            [
                2364,
                2423
            ],
            [
                2423,
                2459
            ],
            [
                2459,
                2602
            ],
            [
                2602,
                2687
            ],
            [
                2687,
                2769
            ],
            [
                2769,
                3223
            ],
            [
                3223,
                3401
            ],
            [
                3401,
                3424
            ],
            [
                3424,
                3537
            ],
            [
                3537,
                3576
            ],
            [
                3576,
                3635
            ],
            [
                3635,
                3761
            ],
            [
                3761,
                3935
            ],
            [
                3935,
                4118
            ],
            [
                4118,
                4222
            ],
            [
                4222,
                4303
            ],
            [
                4303,
                4450
            ],
            [
                4450,
                4466
            ],
            [
                4466,
                4545
            ],
            [
                4545,
                4602
            ],
            [
                4602,
                4795
            ],
            [
                4795,
                4832
            ],
            [
                4832,
                4876
            ],
            [
                4876,
                4915
            ],
            [
                4915,
                5006
            ],
            [
                5006,
                5052
            ],
            [
                5052,
                5084
            ],
            [
                5084,
                5318
            ],
            [
                5318,
                5424
            ],
            [
                5424,
                5524
            ],
            [
                5524,
                5577
            ],
            [
                5577,
                5660
            ],
            [
                5660,
                5825
            ],
            [
                5825,
                5990
            ],
            [
                5990,
                6020
            ],
            [
                6020,
                6082
            ],
            [
                6082,
                6102
            ],
            [
                6102,
                6144
            ],
            [
                6144,
                6150
            ],
            [
                6150,
                6211
            ],
            [
                6211,
                6251
            ],
            [
                6251,
                6264
            ],
            [
                6264,
                6324
            ],
            [
                6324,
                6361
            ],
            [
                6361,
                6412
            ],
            [
                6412,
                6462
            ],
            [
                6462,
                6496
            ],
            [
                6496,
                6537
            ],
            [
                6537,
                6698
            ],
            [
                6698,
                6723
            ],
            [
                6723,
                6831
            ],
            [
                6831,
                6875
            ],
            [
                6875,
                6957
            ],
            [
                6957,
                6974
            ],
            [
                6974,
                7026
            ],
            [
                7026,
                7080
            ],
            [
                7080,
                7118
            ],
            [
                7118,
                7169
            ],
            [
                7169,
                7181
            ],
            [
                7181,
                7203
            ],
            [
                7203,
                7283
            ],
            [
                7283,
                7319
            ],
            [
                7319,
                7373
            ],
            [
                7373,
                7402
            ],
            [
                7402,
                7449
            ],
            [
                7449,
                7489
            ],
            [
                7489,
                7574
            ],
            [
                7574,
                7611
            ],
            [
                7611,
                7720
            ],
            [
                7720,
                7906
            ],
            [
                7906,
                7922
            ],
            [
                7922,
                7940
            ],
            [
                7940,
                7999
            ],
            [
                7999,
                8039
            ],
            [
                8039,
                8109
            ],
            [
                8109,
                8121
            ],
            [
                8121,
                8190
            ],
            [
                8190,
                8300
            ],
            [
                8300,
                8330
            ],
            [
                8330,
                8410
            ],
            [
                8410,
                8497
            ],
            [
                8497,
                8544
            ],
            [
                8544,
                8559
            ],
            [
                8559,
                8639
            ],
            [
                8639,
                8676
            ],
            [
                8676,
                8740
            ],
            [
                8740,
                8784
            ],
            [
                8784,
                8858
            ],
            [
                8858,
                8903
            ],
            [
                8903,
                9131
            ],
            [
                9131,
                9298
            ],
            [
                9298,
                9392
            ],
            [
                9392,
                9547
            ],
            [
                9547,
                9849
            ],
            [
                9849,
                9939
            ],
            [
                9939,
                10002
            ],
            [
                10002,
                10087
            ],
            [
                10087,
                10587
            ],
            [
                10587,
                10682
            ],
            [
                10682,
                10971
            ],
            [
                10971,
                11142
            ],
            [
                11142,
                11307
            ],
            [
                11307,
                11548
            ],
            [
                11548,
                11646
            ],
            [
                11646,
                11697
            ],
            [
                11697,
                11775
            ],
            [
                11775,
                12154
            ],
            [
                12154,
                12321
            ],
            [
                12321,
                12359
            ],
            [
                12359,
                12490
            ],
            [
                12490,
                12645
            ],
            [
                12645,
                12738
            ],
            [
                12738,
                12816
            ],
            [
                12816,
                12897
            ]
        ],
        "overlap_chars": [
            [
                214,
                238
            ],
            [
                248,
                269
            ],
            [
                269,
                323
            ],
            [
                323,
                365
            ],
            [
                391,
                466
            ],
            [
                466,
                484
            ],
            [
                488,
                501
            ],
            [
                540,
                552
            ],
            [
                552,
                676
            ],
            [
                690,
                703
            ],
            [
                703,
                779
            ],
            [
                949,
                995
            ],
            [
                995,
                1211
            ],
            [
                1253,
                1276
            ],
            [
                1423,
                1511
            ],
            [
                1513,
                1526
            ],
            [
                1528,
                1532
            ],
            [
                1535,
                1539
            ],
            [
                1539,
                1550
            ],
            [
                1550,
                1582
            ],
            [
                1588,
                1598
            ],
            [
                1606,
                1671
            ],
            [
                1730,
                1761
            ],
            [
                1969,
                2042
            ],
            [
                2042,
                2096
            ],
            [
                2103,
                2108
            ],
            [
                2153,
                2165
            ],
            [
                2221,
                2224
            ],
            [
                2237,
                2253
            ],
            [
                2256,
                2280
            ],
            [
                2326,
                2328
            ],
            [
                2328,
                2358
            ],
            [
                2362,
                2364
            ],
            [
                2364,
                2423
            ],
            [
                2504,
                2526
            ],
            [
                2528,
                2602
            ],
            [
                2602,
                2622
            ],
            [
                2665,
                2666
            ],
            [
                2772,
                2779
            ],
            [
                2781,
                2791
            ],
            [
                2793,
                2815
            ],
            [
                2667,
                2670
            ],
            [
                2816,
                2829
            ],
            [
                2830,
                2835
            ],
            [
                2959,
                2964
            ],
            [
                2966,
                2977
            ],
            [
                2947,
                2959
            ],
            [
                2713,
                2714
            ],
            [
                2999,
                3060
            ],
            [
                3064,
                3148
            ],
            [
                3202,
                3223
            ],
            [
                3424,
                3451
            ],
            [
                3456,
                3468
            ],
            [
                3535,
                3537
            ],
            [
                3541,
                3576
            ],
            [
                3576,
                3600
            ],
            [
                3608,
                3625
            ],
            [
                3838,
                3839
            ],
            [
                3742,
                3745
            ],
            [
                3761,
                3827
            ],
            [
                3846,
                3847
            ],
            [
                3829,
                3838
            ],
            [
                3855,
                3923
            ],
            [
                3929,
                3935
            ],
            [
                3983,
                4063
            ],
            [
                4118,
                4161
            ],
            [
                4163,
                4222
            ],
            [
                4222,
                4283
            ],
            [
                4285,
                4303
            ],
            [
                4303,
                4362
            ],
            [
                4364,
                4384
            ],
            [
                4391,
                4424
            ],
            [
                4429,
                4450
            ],
            [
                4450,
                4466
            ],
            [
                4525,
                4545
            ],
            [
                4602,
                4615
            ],
            [
                4586,
                4600
            ],
            [
                4619,
                4650
            ],
            [
                4699,
                4778
            ],
            [
                4779,
                4794
            ],
            [
                4877,
                4912
            ],
            [
                4915,
                4924
            ],
            [
                5004,
                5006
            ],
            [
                5007,
                5015
            ],
            [
                5040,
                5050
            ],
            [
                5084,
                5207
            ],
            [
                5316,
                5317
            ],
            [
                5318,
                5326
            ],
            [
                5332,
                5382
            ],
            [
                5403,
                5424
            ],
            [
                5424,
                5436
            ],
            [
                5453,
                5462
            ],
            [
                5469,
                5524
            ],
            [
                5577,
                5622
            ],
            [
                5628,
                5659
            ],
            [
                5660,
                5776
            ],
            [
                5814,
                5817
            ],
            [
                5823,
                5825
            ],
            [
                5825,
                5862
            ],
            [
                5864,
                5897
            ],
            [
                5899,
                5990
            ],
            [
                5990,
                6020
            ],
            [
                6024,
                6058
            ],
            [
                6059,
                6079
            ],
            [
                6107,
                6133
            ],
            [
                6135,
                6141
            ],
            [
                6145,
                6150
            ],
            [
                6150,
                6208
            ],
            [
                6211,
                6251
            ],
            [
                6251,
                6263
            ],
            [
                6265,
                6294
            ],
            [
                6325,
                6361
            ],
            [
                6361,
                6409
            ],
            [
                6470,
                6496
            ],
            [
                6496,
                6534
            ],
            [
                6537,
                6584
            ],
            [
                6586,
                6587
            ],
            [
                6595,
                6605
            ],
            [
                6614,
                6672
            ],
            [
                6673,
                6680
            ],
            [
                6686,
                6698
            ],
            [
                6702,
                6723
            ],
            [
                6727,
                6736
            ],
            [
                6739,
                6754
            ],
            [
                6771,
                6831
            ],
            [
                6831,
                6840
            ],
            [
                6842,
                6872
            ],
            [
                6896,
                6917
            ],
            [
                6927,
                6951
            ],
            [
                6958,
                6974
            ],
            [
                7003,
                7026
            ],
            [
                7026,
                7049
            ],
            [
                7055,
                7080
            ],
            [
                7118,
                7166
            ],
            [
                7170,
                7181
            ],
            [
                7181,
                7203
            ],
            [
                7283,
                7288
            ],
            [
                7308,
                7310
            ],
            [
                7319,
                7370
            ],
            [
                7374,
                7399
            ],
            [
                7403,
                7422
            ],
            [
                7434,
                7446
            ],
            [
                7450,
                7487
            ],
            [
                7576,
                7611
            ],
            [
                7611,
                7630
            ],
            [
                7632,
                7720
            ],
            [
                7720,
                7776
            ],
            [
                7791,
                7868
            ],
            [
                7907,
                7913
            ],
            [
                7925,
                7930
            ],
            [
                7914,
                7921
            ],
            [
                7940,
                7960
            ],
            [
                7968,
                7999
            ],
            [
                8002,
                8013
            ],
            [
                8039,
                8085
            ],
            [
                8093,
                8106
            ],
            [
                8110,
                8119
            ],
            [
                8165,
                8190
            ],
            [
                8191,
                8291
            ],
            [
                8301,
                8327
            ],
            [
                8338,
                8362
            ],
            [
                8408,
                8410
            ],
            [
                8410,
                8497
            ],
            [
                8513,
                8541
            ],
            [
                8603,
                8633
            ],
            [
                8741,
                8765
            ],
            [
                8768,
                8784
            ],
            [
                8785,
                8855
            ],
            [
                8858,
                8903
            ],
            [
                8903,
                8970
            ],
            [
                9070,
                9080
            ],
            [
                9129,
                9131
            ],
            [
                9207,
                9298
            ],
            [
                9300,
                9389
            ],
            [
                9397,
                9406
            ],
            [
                9408,
                9416
            ],
            [
                9427,
                9468
            ],
            [
                9545,
                9547
            ],
            [
                9547,
                9607
            ],
            [
                9623,
                9810
            ],
            [
                9847,
                9849
            ],
            [
                9876,
                9877
            ],
            [
                9850,
                9875
            ],
            [
                9849,
                9850
            ],
            [
                9877,
                9886
            ],
            [
                9888,
                9939
            ],
            [
                10002,
                10065
            ],
            [
                10068,
                10084
            ],
            [
                10087,
                10244
            ],
            [
                10255,
                10257
            ],
            [
                10262,
                10267
            ],
            [
                10297,
                10303
            ],
            [
                10334,
                10342
            ],
            [
                10348,
                10369
            ],
            [
                10395,
                10449
            ],
            [
                10479,
                10530
            ],
            [
                10542,
                10587
            ],
            [
                10682,
                10719
            ],
            [
                10720,
                10766
            ],
            [
                10792,
                10796
            ],
            [
                10823,
                10847
            ],
            [
                10849,
                10923
            ],
            [
                10933,
                10938
            ],
            [
                10948,
                10952
            ],
            [
                10961,
                10971
            ],
            [
                10971,
                11008
            ],
            [
                11017,
                11038
            ],
            [
                11053,
                11118
            ],
            [
                11124,
                11141
            ],
            [
                11142,
                11173
            ],
            [
                11175,
                11208
            ],
            [
                11219,
                11223
            ],
            [
                11236,
                11257
            ],
            [
                11305,
                11307
            ],
            [
                11307,
                11377
            ],
            [
                11386,
                11435
            ],
            [
                11446,
                11448
            ],
            [
                11457,
                11517
            ],
            [
                11546,
                11548
            ],
            [
                11548,
                11646
            ],
            [
                11673,
                11684
            ],
            [
                11646,
                11648
            ],
            [
                11685,
                11696
            ],
            [
                11697,
                11775
            ],
            [
                11775,
                11850
            ],
            [
                11875,
                11931
            ],
            [
                12031,
                12032
            ],
            [
                11934,
                12031
            ],
            [
                12152,
                12154
            ],
            [
                12154,
                12263
            ],
            [
                12269,
                12286
            ],
            [
                12300,
                12321
            ],
            [
                12321,
                12359
            ],
            [
                12359,
                12437
            ],
            [
                12468,
                12473
            ],
            [
                12444,
                12467
            ],
            [
                12474,
                12490
            ],
            [
                12490,
                12557
            ],
            [
                12643,
                12645
            ],
            [
                12645,
                12738
            ],
            [
                12738,
                12816
            ],
            [
                12816,
                12863
            ],
            [
                12896,
                12897
            ]
        ],
        "row_chars": [
            [
                0,
                203
            ],
            [
                203,
                214
            ],
            [
                214,
                269
            ],
            [
                269,
                323
            ],
            [
                323,
                466
            ],
            [
                466,
                487
            ],
            [
                487,
                552
            ],
            [
                552,
                703
            ],
            [
                703,
                995
            ],
            [
                995,
                1276
            ],
            [
                1276,
                1335
            ],
            [
                1335,
                1423
            ],
            [
                1423,
                1535
            ],
            [
                1535,
                1539
            ],
            [
                1539,
                1550
            ],
            [
                1550,
                1761
            ],
            [
                1761,
                1844
            ],
            [
                1844,
                1969
            ],
            [
                1969,
                2109
            ],
            [
                2109,
                2221
            ],
            [
                2221,
                2328
            ],
            [
                2328,
                2364
            ],
            [
                2364,
                2423
            ],
            [
                2423,
                2459
            ],
            [
                2459,
                2602
            ],
            [
                2602,
                3223
            ],
            [
                3223,
                3401
            ],
            [
                3401,
                3424
            ],
            [
                3424,
                3537
            ],
            [
                3537,
                3576
            ],
            [
                3576,
                3935
            ],
            [
                3935,
                4118
            ],
            [
                4118,
                4222
            ],
            [
                4222,
                4303
            ],
            [
                4303,
                4450
            ],
            [
                4450,
                4466
            ],
            [
                4466,
                4545
            ],
            [
                4545,
                4795
            ],
            [
                4795,
                4832
            ],
            [
                4832,
                4876
            ],
            [
                4876,
                4915
            ],
            [
                4915,
                5006
            ],
            [
                5006,
                5052
            ],
            [
                5052,
                5084
            ],
            [
                5084,
                5318
            ],
            [
                5318,
                5424
            ],
            [
                5424,
                5524
            ],
            [
                5524,
                5577
            ],
            [
                5577,
                5660
            ],
            [
                5660,
                5825
            ],
            [
                5825,
                5990
            ],
            [
                5990,
                6020
            ],
            [
                6020,
                6082
            ],
            [
                6082,
                6102
            ],
            [
                6102,
                6144
            ],
            [
                6144,
                6150
            ],
            [
                6150,
                6211
            ],
            [
                6211,
                6251
            ],
            [
                6251,
                6324
            ],
            [
                6324,
                6361
            ],
            [
                6361,
                6412
            ],
            [
                6412,
                6462
            ],
            [
                6462,
                6496
            ],
            [
                6496,
                6537
            ],
            [
                6537,
                6698
            ],
            [
                6698,
                6723
            ],
            [
                6723,
                6831
            ],
            [
                6831,
                6875
            ],
            [
                6875,
                6957
            ],
            [
                6957,
                6974
            ],
            [
                6974,
                7026
            ],
            [
                7026,
                7080
            ],
            [
                7080,
                7118
            ],
            [
                7118,
                7169
            ],
            [
                7169,
                7181
            ],
            [
                7181,
                7203
            ],
            [
                7203,
                7283
            ],
            [
                7283,
                7373
            ],
            [
                7373,
                7402
            ],
            [
                7402,
                7449
            ],
            [
                7449,
                7489
            ],
            [
                7489,
                7574
            ],
            [
                7574,
                7611
            ],
            [
                7611,
                7720
            ],
            [
                7720,
                7906
            ],
            [
                7906,
                7940
            ],
            [
                7940,
                7999
            ],
            [
                7999,
                8039
            ],
            [
                8039,
                8109
            ],
            [
                8109,
                8121
            ],
            [
                8121,
                8190
            ],
            [
                8190,
                8300
            ],
            [
                8300,
                8330
            ],
            [
                8330,
                8410
            ],
            [
                8410,
                8497
            ],
            [
                8497,
                8544
            ],
            [
                8544,
                8559
            ],
            [
                8559,
                8639
            ],
            [
                8639,
                8676
            ],
            [
                8676,
                8740
            ],
            [
                8740,
                8784
            ],
            [
                8784,
                8858
            ],
            [
                8858,
                8903
            ],
            [
                8903,
                9131
            ],
            [
                9131,
                9298
            ],
            [
                9298,
                9392
            ],
            [
                9392,
                9547
            ],
            [
                9547,
                9849
            ],
            [
                9849,
                9939
            ],
            [
                9939,
                10002
            ],
            [
                10002,
                10087
            ],
            [
                10087,
                10587
            ],
            [
                10587,
                10682
            ],
            [
                10682,
                10971
            ],
            [
                10971,
                11142
            ],
            [
                11142,
                11307
            ],
            [
                11307,
                11548
            ],
            [
                11548,
                11646
            ],
            [
                11646,
                11697
            ],
            [
                11697,
                11775
            ],
            [
                11775,
                12154
            ],
            [
                12154,
                12321
            ],
            [
                12321,
                12359
            ],
            [
                12359,
                12490
            ],
            [
                12490,
                12645
            ],
            [
                12645,
                12738
            ],
            [
                12738,
                12816
            ],
            [
                12816,
                12897
            ]
        ]
    },
    "abridged": {
        "text": "The next morning brought a letter from Edith. It was affectionate and inconsequent like the writer. But the affection was charming to Margaret; and she had grown up with the inconsequence, so she did not perceive it. It was as follows:\n'Oh, Margaret, you should see my boy! He is a superb little fellow, especially in his caps, and most especially in the one you sent him, you good, dainty-fingered little lady! Having made all the mothers here envious, I want to show him to somebody new - I do want you so much to come here, Margaret! I'm sure it would be the very best thing for Aunt Hale's health; everybody here is young and well, and our skies are always blue, and our sun always shines, and the band plays deliciously from morning till night; and my baby always smiles. I think I love him a great deal better than my husband, who is getting stout, and grumpy - what he calls \"busy.\" No! he is not. He has just come in with news of a charming picnic, given by the officers of the Hazard, at anchor in the bay below; so I retract all I said just now. Cosmo is quite as great a darling as baby, and not a bit stout, and as un-grumpy as ever husband was; only, sometimes he is very busy.\n'Where was I? Oh, yes - Dearest Margaret! - you must come and see me. Get the doctor to order it for your mother. Tell him that it's the smoke of Milton that does her harm. This delicious climate - all sunshine, and grapes as common as blackberries, would quite cure her. I don't ask my uncle, because I dare say he disapproves of war, and soldiers, and military bands; but if he would like to come, Cosmo and I will do our best to make him happy; and I'll hide Cosmo's red coat and sword, and make the band play all sorts of grave, solemn things in double slow time. Tell Aunt Hale not to bring many warm clothes. You have no idea of the heat here! I tried to wear my great Indian shawl at a picnic, but I was like mamma's little dog Tiny with an elephant's trappings on, smothered with my finery; so I made it into a capital carpet for us all to sit upon. Pack up your things as soon as you get this letter, and come straight off to see us!'\nMargaret did long for a day of Edith's life - her freedom from care, her cheerful home, her sunny skies. If a wish could have transported her, she would have gone off, just for one day. She yearned for the strength which such a change would give - even for a few hours in the midst of that bright life, to feel young again. Not yet twenty! She felt quite old. Then she read Edith's letter again, and, forgetting herself, was laughing merrily over it when Mrs. Hale came into the drawing-room, leaning feebly on Dixon's arm.\n'What were you laughing at, Margaret?' asked she.\n'A letter from Edith.' She read it aloud, and for a time it seemed to interest her mother, who kept wondering what name Edith had given to her boy.\nInto the midst of these wonders Mr. Thornton came, bringing more fruit for Mrs. Hale. He could not - or would not - deny himself the chance of the pleasure of seeing Margaret. It was the sturdy wilfulness of a man usually reasonable and self-controlled.\nHe entered the room, taking in at a glance the fact of Margaret's presence; but after the first cold distant bow, he did not look at her. He only stayed to present his peaches - to speak some gentle kindly words - and then his cold offended eyes met Margaret's with a grave farewell, as he left the room. She sat down silent and pale.\n'Do you know, Margaret, I really begin quite to like Mr. Thornton.'\nMargaret forced out an icy 'Do you?'\n'Yes! I think he is really getting quite polished in his manners.'\nMargaret's voice was more in order now. She replied, 'He is very kind and attentive.'\n'I wonder Mrs. Thornton never calls. She must know I am ill, because of the water-bed. I should like to see her. You have so few friends here, Margaret.'\nMargaret felt what was in her mother's thoughts - a craving to ask for the kindness of some woman towards the daughter that might so soon be motherless. She could not speak.\n'Do you think,' said Mrs. Hale, 'that you could go and ask Mrs. Thornton to come and see me? Only once. I don't want to be troublesome.'\n'If you wish it, mamma - but when Frederick comes-'\n'Ah, to be sure! we must let no one in. I hardly know whether I wish him to come or not. Sometimes I have such frightful dreams about him.'\n'Oh, mamma! we'll take good care. Trust me; I will watch over him like a lioness over her young.'\n'When can we hear from him?'\n'Not for a week yet, perhaps more.'\n'We must send Martha away in good time.'\n'Dixon is sure to remind us of that. I was thinking that if we wanted any help in the house while he is here, we could perhaps get Mary Higgins. She is very slack of work, and is a good girl, and would do her best, I am sure, and would sleep at home, and need never come upstairs.'\n'As you and Dixon please. But, Margaret, don't use these horrid Milton words. \"Slack of work!\" What will your aunt Shaw say, if she hears you on her return?'\n'Oh, mamma!' said Margaret, laughing. 'Edith picked up all sorts of military slang from Captain Lennox, and aunt Shaw never took any notice.'\n'But yours is factory slang.'\n'I live in a factory town. Why, mamma, I could astonish you with a great many words you never heard in your life. Do you know what a knobstick is? It means a strike-breaker.'\n'I don't want to hear you using such words. I don't like this Milton,' said Mrs. Hale. 'Edith is right enough in saying it's the smoke that has made me so ill.'\nMargaret started up as her mother said this. Her father had just entered the room, and she was most anxious that he should not hear. She began speaking hurriedly of other things, unaware that Mr. Thornton was following him.\n'Mamma is accusing me of having picked up a great deal of vulgarity since we came to Milton.'\nBy 'vulgarity' Margaret referred purely to the use of local words. But Mr. Thornton's brow darkened; and Margaret suddenly felt she might be misunderstood by him; so, in the natural sweet desire to avoid giving unnecessary pain, she forced herself to go forwards with a little greeting, and continue what she was saying.\n'Now, Mr. Thornton, though \"knobstick\" has not a very pretty sound, is it not expressive? If using local words is vulgar, I was very vulgar in the Forest - was I not, mamma?'\nIt was unusual with Margaret to obtrude her own subject of conversation on others; but, in this case, she was so anxious to prevent Mr. Thornton from feeling annoyed at her words, that after speaking she coloured all over; especially as Mr. Thornton seemed hardly to understand what she was saying, but passed her by, with a cold ceremonious movement, to speak to Mrs. Hale.\nMargaret, sitting in burning silence, was vexed and ashamed of her difficulty in keeping calm when Mr. Thornton was by. She heard her mother's slow entreaty that Mrs. Thornton would come and see her soon; tomorrow, if possible. Mr. Thornton promised that she should - conversed a little, and then left; and Margaret's movements and voice seemed at once released from invisible chains.\nHe never looked at her; and yet the careful avoidance of his eyes showed that he knew exactly where she was. If she spoke, he gave no sign of attention, and yet his next speech to anyone else was modified by what she had said; sometimes with an answer to what she had remarked, but given to another person. It was not the bad manners of ignorance; it was the wilful bad manners arising from deep offence. He repented of it afterwards.\nBut no deep plan, no careful cunning could have stood him in such good stead. Margaret thought about him more than she had ever done before; not with any love, but with regret that she had wounded him so deeply; and with a gentle, patient striving to return to their former position of antagonistic friendship. There was a pretty humility in her behaviour to him, as if mutely apologising for the over-strong words which had been the reaction from the day of the riot.\nBut he resented those words bitterly. They rung in his ears; and he was proud of the sense of justice which made him offer every kindness he could to her parents. He exulted in the power he showed in compelling himself to face her. He thought that he disliked seeing one who had mortified him so keenly; but he was mistaken. It was a stinging pleasure to be in the room with her, and feel her presence. But he was no great analyser of his own motives.",
        "paragraph_chars": [
            [
                0,
                236
            ],
            [
                236,
                1191
            ],
            [
                1191,
                2135
            ],
            [
                2135,
                2659
            ],
            [
                2659,
                2709
            ],
            [
                2709,
                2857
            ],
            [
                2857,
                3111
            ],
            [
                3111,
                3446
            ],
            [
                3446,
                3514
            ],
            [
                3514,
                3551
            ],
            [
                3551,
                3618
            ],
            [
                3618,
                3704
            ],
            [
                3704,
                3858
            ],
            [
                3858,
                4032
            ],
            [
                4032,
                4169
            ],
            [
                4169,
                4221
            ],
            [
                4221,
                4361
            ],
            [
                4361,
                4459
            ],
            [
                4459,
                4488
            ],
            [
                4488,
                4524
            ],
            [
                4524,
                4565
            ],
            [
                4565,
                4847
            ],
            [
                4847,
                5005
            ],
            [
                5005,
                5147
            ],
            [
                5147,
                5177
            ],
            [
                5177,
                5352
            ],
            [
                5352,
                5513
            ],
            [
                5513,
                5737
            ],
            [
                5737,
                5831
            ],
            [
                5831,
                6152
            ],
            [
                6152,
                6327
            ],
            [
                6327,
                6702
            ],
            [
                6702,
                7087
            ],
            [
                7087,
                7522
            ],
            [
                7522,
                7991
            ],
            [
                7991,
                8442
            ]
        ],
        "segment_chars": [
            [
                0,
                46
            ],
            [
                46,
                100
            ],
            [
                100,
                217
            ],
            [
                217,
                236
            ],
            [
                236,
                274
            ],
            [
                274,
                412
            ],
            [
                412,
                537
            ],
            [
                537,
                777
            ],
            [
                777,
                890
            ],
            [
                890,
                894
            ],
            [
                894,
                905
            ],
            [
                905,
                1056
            ],
            [
                1056,
                1191
            ],
            [
                1191,
                1205
            ],
            [
                1205,
                1233
            ],
            [
                1233,
                1261
            ],
            [
                1261,
                1305
            ],
            [
                1305,
                1364
            ],
            [
                1364,
                1463
            ],
            [
                1463,
                1759
            ],
            [
                1759,
                1806
            ],
            [
                1806,
                1841
            ],
            [
                1841,
                2049
            ],
            [
                2049,
                2135
            ],
            [
                2135,
                2240
            ],
            [
                2240,
                2321
            ],
            [
                2321,
                2459
            ],
            [
                2459,
                2475
            ],
            [
                2475,
                2495
            ],
            [
                2495,
                2659
            ],
            [
                2659,
                2698
            ],
            [
                2698,
                2709
            ],
            [
                2709,
                2732
            ],
            [
                2732,
                2857
            ],
            [
                2857,
                2943
            ],
            [
                2943,
                3033
            ],
            [
                3033,
                3111
            ],
            [
                3111,
                3249
            ],
            [
                3249,
                3416
            ],
            [
                3416,
                3446
            ],
            [
                3446,
                3514
            ],
            [
                3514,
                3551
            ],
            [
                3551,
                3557
            ],
            [
                3557,
                3618
            ],
            [
                3618,
                3658
            ],
            [
                3658,
                3704
            ],
            [
                3704,
                3741
            ],
            [
                3741,
                3791
            ],
            [
                3791,
                3817
            ],
            [
                3817,
                3858
            ],
            [
                3858,
                4011
            ],
            [
                4011,
                4032
            ],
            [
                4032,
                4125
            ],
            [
                4125,
                4136
            ],
            [
                4136,
                4169
            ],
            [
                4169,
                4221
            ],
            [
                4221,
                4238
            ],
            [
                4238,
                4261
            ],
            [
                4261,
                4310
            ],
            [
                4310,
                4361
            ],
            [
                4361,
                4373
            ],
            [
                4373,
                4395
            ],
            [
                4395,
                4459
            ],
            [
                4459,
                4488
            ],
            [
                4488,
                4524
            ],
            [
                4524,
                4565
            ],
            [
                4565,
                4602
            ],
            [
                4602,
                4710
            ],
            [
                4710,
                4847
            ],
            [
                4847,
                4873
            ],
            [
                4873,
                4925
            ],
            [
                4925,
                4942
            ],
            [
                4942,
                5005
            ],
            [
                5005,
                5018
            ],
            [
                5018,
                5043
            ],
            [
                5043,
                5147
            ],
            [
                5147,
                5177
            ],
            [
                5177,
                5204
            ],
            [
                5204,
                5291
            ],
            [
                5291,
                5324
            ],
            [
                5324,
                5352
            ],
            [
                5352,
                5396
            ],
            [
                5396,
                5439
            ],
            [
                5439,
                5513
            ],
            [
                5513,
                5558
            ],
            [
                5558,
                5646
            ],
            [
                5646,
                5737
            ],
            [
                5737,
                5831
            ],
            [
                5831,
                5898
            ],
            [
                5898,
                6152
            ],
            [
                6152,
                6242
            ],
            [
                6242,
                6327
            ],
            [
                6327,
                6702
            ],
            [
                6702,
                6822
            ],
            [
                6822,
                6930
            ],
            [
                6930,
                7087
            ],
            [
                7087,
                7196
            ],
            [
                7196,
                7394
            ],
            [
                7394,
                7492
            ],
            [
                7492,
                7522
            ],
            [
                7522,
                7600
            ],
            [
                7600,
                7833
            ],
            [
                7833,
                7991
            ],
            [
                7991,
                8029
            ],
            [
                8029,
                8154
            ],
            [
                8154,
                8223
            ],
            [
                8223,
                8316
            ],
            [
                8316,
                8394
            ],
            [
                8394,
                8442
            ]
        ],
        "overlap_chars": [
            [
                0,
                24
            ],
            [
                25,
                46
            ],
            [
                46,
                100
            ],
            [
                100,
                142
            ],
            [
                142,
                217
            ],
            [
                217,
                235
            ],
            [
                237,
                250
            ],
            [
                262,
                274
            ],
            [
                274,
                398
            ],
            [
                399,
                412
            ],
            [
                412,
                488
            ],
            [
                491,
                537
            ],
            [
                537,
                753
            ],
            [
                754,
                777
            ],
            [
                777,
                865
            ],
            [
                868,
                881
            ],
            [
                883,
                887
            ],
            [
                890,
                894
            ],
            [
                894,
                905
            ],
            [
                905,
                937
            ],
            [
                938,
                948
            ],
            [
                955,
                1020
            ],
            [
                1025,
                1056
            ],
            [
                1056,
                1129
            ],
            [
                1130,
                1184
            ],
            [
                1185,
                1190
            ],
            [
                1192,
                1204
            ],
            [
                1205,
                1208
            ],
            [
                1215,
                1231
            ],
            [
                1235,
                1259
            ],
            [
                1259,
                1261
            ],
            [
                1261,
                1291
            ],
            [
                1303,
                1305
            ],
            [
                1305,
                1364
            ],
            [
                1364,
                1386
            ],
            [
                1389,
                1463
            ],
            [
                1463,
                1483
            ],
            [
                1483,
                1484
            ],
            [
                1485,
                1492
            ],
            [
                1493,
                1503
            ],
            [
                1504,
                1526
            ],
            [
                1527,
                1530
            ],
            [
                1531,
                1544
            ],
            [
                1554,
                1559
            ],
            [
                1559,
                1564
            ],
            [
                1565,
                1576
            ],
            [
                1577,
                1589
            ],
            [
                1589,
                1590
            ],
            [
                1591,
                1652
            ],
            [
                1653,
                1737
            ],
            [
                1738,
                1759
            ],
            [
                1759,
                1786
            ],
            [
                1792,
                1804
            ],
            [
                1804,
                1806
            ],
            [
                1806,
                1841
            ],
            [
                1841,
                1865
            ],
            [
                1866,
                1883
            ],
            [
                1890,
                1891
            ],
            [
                1892,
                1895
            ],
            [
                1896,
                1962
            ],
            [
                1962,
                1963
            ],
            [
                1964,
                1973
            ],
            [
                1974,
                2042
            ],
            [
                2043,
                2049
            ],
            [
                2049,
                2129
            ],
            [
                2135,
                2178
            ],
            [
                2181,
                2240
            ],
            [
                2240,
                2301
            ],
            [
                2303,
                2321
            ],
            [
                2321,
                2380
            ],
            [
                2383,
                2403
            ],
            [
                2404,
                2437
            ],
            [
                2438,
                2459
            ],
            [
                2459,
                2475
            ],
            [
                2475,
                2495
            ],
            [
                2495,
                2508
            ],
            [
                2509,
                2523
            ],
            [
                2524,
                2555
            ],
            [
                2556,
                2635
            ],
            [
                2643,
                2658
            ],
            [
                2660,
                2695
            ],
            [
                2698,
                2707
            ],
            [
                2707,
                2709
            ],
            [
                2710,
                2718
            ],
            [
                2719,
                2729
            ],
            [
                2732,
                2855
            ],
            [
                2855,
                2856
            ],
            [
                2857,
                2865
            ],
            [
                2866,
                2916
            ],
            [
                2922,
                2943
            ],
            [
                2943,
                2955
            ],
            [
                2961,
                2970
            ],
            [
                2978,
                3033
            ],
            [
                3033,
                3078
            ],
            [
                3079,
                3110
            ],
            [
                3111,
                3227
            ],
            [
                3244,
                3247
            ],
            [
                3247,
                3249
            ],
            [
                3249,
                3286
            ],
            [
                3289,
                3322
            ],
            [
                3325,
                3416
            ],
            [
                3416,
                3446
            ],
            [
                3450,
                3484
            ],
            [
                3491,
                3511
            ],
            [
                3514,
                3540
            ],
            [
                3542,
                3548
            ],
            [
                3552,
                3557
            ],
            [
                3557,
                3615
            ],
            [
                3618,
                3658
            ],
            [
                3658,
                3670
            ],
            [
                3672,
                3701
            ],
            [
                3705,
                3741
            ],
            [
                3741,
                3789
            ],
            [
                3791,
                3817
            ],
            [
                3817,
                3855
            ],
            [
                3858,
                3905
            ],
            [
                3908,
                3909
            ],
            [
                3910,
                3920
            ],
            [
                3929,
                3987
            ],
            [
                3991,
                3998
            ],
            [
                3999,
                4011
            ],
            [
                4011,
                4032
            ],
            [
                4036,
                4045
            ],
            [
                4048,
                4063
            ],
            [
                4065,
                4125
            ],
            [
                4125,
                4134
            ],
            [
                4136,
                4166
            ],
            [
                4170,
                4191
            ],
            [
                4194,
                4218
            ],
            [
                4222,
                4238
            ],
            [
                4238,
                4261
            ],
            [
                4261,
                4284
            ],
            [
                4285,
                4310
            ],
            [
                4310,
                4358
            ],
            [
                4362,
                4373
            ],
            [
                4373,
                4395
            ],
            [
                4395,
                4400
            ],
            [
                4401,
                4403
            ],
            [
                4405,
                4456
            ],
            [
                4460,
                4485
            ],
            [
                4489,
                4508
            ],
            [
                4509,
                4521
            ],
            [
                4525,
                4562
            ],
            [
                4567,
                4602
            ],
            [
                4602,
                4621
            ],
            [
                4622,
                4710
            ],
            [
                4710,
                4766
            ],
            [
                4767,
                4844
            ],
            [
                4848,
                4854
            ],
            [
                4859,
                4864
            ],
            [
                4865,
                4872
            ],
            [
                4873,
                4893
            ],
            [
                4894,
                4925
            ],
            [
                4928,
                4939
            ],
            [
                4942,
                4988
            ],
            [
                4989,
                5002
            ],
            [
                5006,
                5015
            ],
            [
                5018,
                5043
            ],
            [
                5044,
                5144
            ],
            [
                5148,
                5174
            ],
            [
                5178,
                5202
            ],
            [
                5202,
                5204
            ],
            [
                5204,
                5291
            ],
            [
                5294,
                5322
            ],
            [
                5353,
                5383
            ],
            [
                5396,
                5420
            ],
            [
                5423,
                5439
            ],
            [
                5440,
                5510
            ],
            [
                5513,
                5558
            ],
            [
                5558,
                5625
            ],
            [
                5629,
                5639
            ],
            [
                5644,
                5646
            ],
            [
                5646,
                5737
            ],
            [
                5739,
                5828
            ],
            [
                5835,
                5844
            ],
            [
                5846,
                5854
            ],
            [
                5855,
                5896
            ],
            [
                5896,
                5898
            ],
            [
                5898,
                5958
            ],
            [
                5963,
                6150
            ],
            [
                6150,
                6152
            ],
            [
                6152,
                6153
            ],
            [
                6153,
                6178
            ],
            [
                6179,
                6180
            ],
            [
                6180,
                6189
            ],
            [
                6191,
                6242
            ],
            [
                6242,
                6305
            ],
            [
                6308,
                6324
            ],
            [
                6327,
                6484
            ],
            [
                6493,
                6495
            ],
            [
                6500,
                6505
            ],
            [
                6505,
                6511
            ],
            [
                6518,
                6526
            ],
            [
                6527,
                6548
            ],
            [
                6550,
                6604
            ],
            [
                6605,
                6656
            ],
            [
                6657,
                6702
            ],
            [
                6702,
                6739
            ],
            [
                6744,
                6790
            ],
            [
                6791,
                6795
            ],
            [
                6796,
                6820
            ],
            [
                6826,
                6900
            ],
            [
                6901,
                6906
            ],
            [
                6915,
                6919
            ],
            [
                6920,
                6930
            ],
            [
                6930,
                6967
            ],
            [
                6977,
                6998
            ],
            [
                7003,
                7068
            ],
            [
                7069,
                7086
            ],
            [
                7087,
                7118
            ],
            [
                7119,
                7152
            ],
            [
                7160,
                7164
            ],
            [
                7165,
                7186
            ],
            [
                7194,
                7196
            ],
            [
                7196,
                7266
            ],
            [
                7274,
                7323
            ],
            [
                7329,
                7331
            ],
            [
                7332,
                7392
            ],
            [
                7392,
                7394
            ],
            [
                7394,
                7492
            ],
            [
                7495,
                7506
            ],
            [
                7507,
                7509
            ],
            [
                7510,
                7521
            ],
            [
                7522,
                7600
            ],
            [
                7600,
                7675
            ],
            [
                7676,
                7732
            ],
            [
                7732,
                7733
            ],
            [
                7734,
                7831
            ],
            [
                7831,
                7833
            ],
            [
                7833,
                7942
            ],
            [
                7952,
                7969
            ],
            [
                7970,
                7991
            ],
            [
                7991,
                8029
            ],
            [
                8029,
                8107
            ],
            [
                8108,
                8113
            ],
            [
                8114,
                8137
            ],
            [
                8138,
                8154
            ],
            [
                8154,
                8221
            ],
            [
                8221,
                8223
            ],
            [
                8223,
                8316
            ],
            [
                8316,
                8394
            ],
            [
                8394,
                8441
            ],
            [
                8441,
                8442
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                46
            ],
            [
                46,
                100
            ],
            [
                100,
                217
            ],
            [
                217,
                236
            ],
            [
                236,
                274
            ],
            [
                274,
                412
            ],
            [
                412,
                537
            ],
            [
                537,
                777
            ],
            [
                777,
                777
            ],
            [
                777,
                777
            ],
            [
                777,
                890
            ],
            [
                890,
                894
            ],
            [
                894,
                905
            ],
            [
                905,
                1056
            ],
            [
                1056,
                1056
            ],
            [
                1056,
                1056
            ],
            [
                1056,
                1191
            ],
            [
                1191,
                1205
            ],
            [
                1205,
                1261
            ],
            [
                1261,
                1305
            ],
            [
                1305,
                1364
            ],
            [
                1364,
                1364
            ],
            [
                1364,
                1463
            ],
            [
                1463,
                1759
            ],
            [
                1759,
                1759
            ],
            [
                1759,
                1759
            ],
            [
                1759,
                1806
            ],
            [
                1806,
                1841
            ],
            [
                1841,
                2049
            ],
            [
                2049,
                2135
            ],
            [
                2135,
                2240
            ],
            [
                2240,
                2321
            ],
            [
                2321,
                2459
            ],
            [
                2459,
                2475
            ],
            [
                2475,
                2495
            ],
            [
                2495,
                2659
            ],
            [
                2659,
                2659
            ],
            [
                2659,
                2659
            ],
            [
                2659,
                2698
            ],
            [
                2698,
                2709
            ],
            [
                2709,
                2732
            ],
            [
                2732,
                2732
            ],
            [
                2732,
                2857
            ],
            [
                2857,
                2943
            ],
            [
                2943,
                3033
            ],
            [
                3033,
                3033
            ],
            [
                3033,
                3111
            ],
            [
                3111,
                3249
            ],
            [
                3249,
                3416
            ],
            [
                3416,
                3446
            ],
            [
                3446,
                3514
            ],
            [
                3514,
                3514
            ],
            [
                3514,
                3551
            ],
            [
                3551,
                3557
            ],
            [
                3557,
                3618
            ],
            [
                3618,
                3658
            ],
            [
                3658,
                3704
            ],
            [
                3704,
                3741
            ],
            [
                3741,
                3791
            ],
            [
                3791,
                3791
            ],
            [
                3791,
                3817
            ],
            [
                3817,
                3858
            ],
            [
                3858,
                4011
            ],
            [
                4011,
                4032
            ],
            [
                4032,
                4125
            ],
            [
                4125,
                4169
            ],
            [
                4169,
                4221
            ],
            [
                4221,
                4238
            ],
            [
                4238,
                4261
            ],
            [
                4261,
                4310
            ],
            [
                4310,
                4310
            ],
            [
                4310,
                4361
            ],
            [
                4361,
                4373
            ],
            [
                4373,
                4395
            ],
            [
                4395,
                4395
            ],
            [
                4395,
                4459
            ],
            [
                4459,
                4488
            ],
            [
                4488,
                4524
            ],
            [
                4524,
                4565
            ],
            [
                4565,
                4565
            ],
            [
                4565,
                4602
            ],
            [
                4602,
                4710
            ],
            [
                4710,
                4847
            ],
            [
                4847,
                4873
            ],
            [
                4873,
                4925
            ],
            [
                4925,
                4942
            ],
            [
                4942,
                5005
            ],
            [
                5005,
                5018
            ],
            [
                5018,
                5043
            ],
            [
                5043,
                5147
            ],
            [
                5147,
                5177
            ],
            [
                5177,
                5204
            ],
            [
                5204,
                5291
            ],
            [
                5291,
                5352
            ],
            [
                5352,
                5352
            ],
            [
                5352,
                5396
            ],
            [
                5396,
                5396
            ],
            [
                5396,
                5396
            ],
            [
                5396,
                5439
            ],
            [
                5439,
                5513
            ],
            [
                5513,
                5558
            ],
            [
                5558,
                5646
            ],
            [
                5646,
                5737
            ],
            [
                5737,
                5831
            ],
            [
                5831,
                5898
            ],
            [
                5898,
                6152
            ],
            [
                6152,
                6242
            ],
            [
                6242,
                6242
            ],
            [
                6242,
                6327
            ],
            [
                6327,
                6702
            ],
            [
                6702,
                6702
            ],
            [
                6702,
                6930
            ],
            [
                6930,
                7087
            ],
            [
                7087,
                7196
            ],
            [
                7196,
                7394
            ],
            [
                7394,
                7492
            ],
            [
                7492,
                7522
            ],
            [
                7522,
                7600
            ],
            [
                7600,
                7833
            ],
            [
                7833,
                7991
            ],
            [
                7991,
                8029
            ],
            [
                8029,
                8154
            ],
            [
                8154,
                8223
            ],
            [
                8223,
                8316
            ],
            [
                8316,
                8394
            ],
            [
                8394,
                8442
            ]
        ]
    }
}