{
    "original": {
        "text": "\"What! remain to be. Denounced--dragged, it may be, in chains.\" WERNER.\nAll the next day they sate together--they three. Mr. Hale hardly ever spoke but when his children asked him questions, and forced him, as it were, into the present. Frederick's grief was no more to be seen or heard; the first paroxysm had passed over, and now he was ashamed of having been so battered down by emotion; and though his sorrow for the loss of his mother was a deep real feeling, and would last out his life, it was never to be spoken of again. Margaret, not so passionate at first, was more suffering now. At times she cried a good deal; and her manner, even when speaking on different things, had a mournful tenderness about it, which was deepened whenever her looks fell upon Frederick, and she thought of his rapidly approaching departure. She was glad he was going, on her father's account, however much she might grieve over it on her own. The anxious terror in which Mr. Hale lived lest his son should be detected and captured, far outweighed the pleasure he derived from his presence. The nervousness had increased since Mrs. Hale's death, probably because he dwelt upon it more exclusively. He started at every unusual sound, and was never comfortable unless Frederick sate out of the immediate view of any one entering the room. Towards evening he said:\n\"You will go with Frederick to the station, Margaret? I shall want to know he is safely off. You will bring me word that he is clear of Milton, at any rate?\"\n\"Certainly,\" said Margaret. \"I shall like it, if you won't be lonely without me, papa.\"\n\"No, no! I should always be fancying some one had known him, and that he had been stopped, unless you could tell me you had seen him off. And go to the Outwood station. It is quite as near, and not so many people about. Take a cab there. There is less risk of his being seen. What time is your train, Fred?\"\n\"Ten minutes past six; very nearly dark. So what will you do, Margaret?\"\n\"Oh, I can manage. I am getting very brave and very hard. It is a well-lighted road all the way home, if it should be dark. But I was out last week much later.\"\nMargaret was thankful when the parting was over--the parting from the dead mother and the living father. She hurried Frederick into the cab, in order to shorten a scene which she saw was so bitterly painful to her father, who would accompany his son as he took his last look at his mother. Partly in consequence of this, and partly owing to one of the very common mistakes in the \"Railway Guide\" as to the times when trains arrive at the smaller stations, they found, on reaching Outwood, that they had nearly twenty minutes to spare. The booking-office was not open, so they could not even take the ticket. They accordingly went down the flight of steps that led to the level of the ground below the railway. There was a broad cinder-path diagonally crossing a field which lay alongside of the carriage-road, and they went there to walk backwards and forwards for the few minutes they had to spare.\nMargaret's hand lay in Frederick's arm. He took hold of it affectionately.\n\"Margaret! I am going to consult Mr. Lennox as to the chance of exculpating myself so that I may return to England whenever I choose, more for your sake than for the sake of anyone else. I can't bear to think of your lonely position if any thing should happen to my father. He looks sadly changed--terribly shaken. I wish you could get him to think of the Cadiz plan, for many reasons. What could you do if he were taken away? You have no friend near. We are curiously bare of relations.\"\nMargaret could hardly keep from crying at the tender anxiety with which Frederick was bringing before her an event which she herself felt was not very improbable, so severely had the cares of the last few months told upon Mr. Hale. But she tried to rally as she said:\n\"There have been such strange unexpected changes in my life during these last two years, that I feel more than ever that it is not worth while to calculate too closely what I should do if any future event took place. I try to think only upon the present.\" She paused; they were standing still for a moment, close on the field side of the stile leading into the road; the setting sun fell on their faces. Frederick held her hand in his, and looked with wistful anxiety into her face, reading there more care and trouble than she would betray by words. She went on:\n\"We shall write often to one another, and I will promise--for I see it will set your mind at ease--to tell you every worry I have. Papa is\"--she started a little, a hardly visible start--but Frederick felt the sudden motion of the hand he held, and turned his full face to the road, along which a horseman was slowly riding, just passing the very stile where they stood. Margaret bowed; her bow was stiffly returned.\n\"Who is that?\" said Frederick, almost before he was out of hearing.\nMargaret was a little drooping, a little flushed, as she replied: \"Mr. Thornton; you saw him before, you know.\"\n\"Only his back. He is an unprepossessing-looking fellow. What a scowl he has!\"\n\"Something has happened to vex him,\" said Margaret apologetically. \"You would not have thought him unprepossessing if you had seen him with mamma.\"\n\"I fancy it must be time to go and take my ticket. If I had known how dark it would be, we wouldn't have sent back the cab, Margaret.\"\n\"Oh, don't fidget about that. I can take a cab here, if I like; or go back by the rail-road, when I should have shops and people and lamps all the way from the Milton station-house. Don't think of me; take care of yourself. I am sick with the thought that Leonards may be in the same train with you. Look well into the carriage before you get in.\"\nThey went back to the station. Margaret insisted on going into the full light of the flaring gas inside to take the ticket. Some idle-looking young men were lounging about with the station-master. Margaret thought she had seen the face of one of them before, and returned him a proud look of offended dignity for his somewhat impertinent stare of undisguised admiration. She went hastily to her brother, who was standing outside, and took hold of his arm. \"Have you got your bag? Let us walk about here on the platform,\" said she, a little flurried at the idea of so soon being left alone, and her bravery oozing out rather faster than she liked to acknowledge even to herself. She heard a step following them along the flags; it stopped when they stopped, looking out along the line and hearing the whizz of the coming train. They did not speak; their hearts were too full. Another moment, and the train would be here; a minute more, and he would be gone. Margaret almost repented the urgency with which she had entreated him to go to London; it was throwing more chances of detection in his way. If he had sailed for Spain by Liverpool, he might have been off in two or three hours.\nFrederick turned round, right facing the lamp, where the gas darted up in vivid anticipation of the train. A man in the dress of a railway porter started forward; a bad-looking man, who seemed to have drunk himself into a state of brutality, although his senses were in perfect order.\n\"By your leave, miss!\" said he, pushing Margaret rudely on one side, and seizing Frederick by the collar.\n\"Your name is Hale, I believe?\"\nIn an instant, how, Margaret did not see, for everything danced before her eyes--but by some sleight of wrestling, Frederick had tripped him up, and he fell from the height of three or four feet, which the platform was elevated above the space of soft ground, by the side of the railroad. There he lay.\n\"Run, run!\" gasped Margaret. \"The train is here. It was Leonards, was it? oh, run! I will carry your bag.\" And she took him by the arm to push him along with all her feeble force. A door was opened in a carriage--he jumped in; and as he leant out to say, \"God bless you, Margaret!\" the train rushed past her; and she was left standing alone. She was so terribly sick and faint that she was thankful to be able to turn into the ladies' waiting-room, and sit down for an instant. At first she could do nothing but gasp for breath. It was such a hurry; such a sickening alarm; such a near chance. If the train had not been there at the moment, the man would have jumped up again and called for assistance to arrest him. She wondered if the man had got up: she tried to remember if she had seen him move: she wondered if he could have been seriously hurt. She ventured out; the platform was all alight, but still quite deserted; she went to the end, and looked over, somewhat fearfully. No one was there; and then she was glad she had made herself go, and inspect, for otherwise terrible thoughts would have haunted her dreams. And even as it was, she was so trembling and affrighted that she felt she could not walk home along the road, which did indeed seem lonely and dark, as she gazed down upon it from the blaze of the station. She would wait till the down train passed and take her seat in it. But what if Leonards recognized her as Frederick's companion! She peered about, before venturing into the booking-office to take her ticket. There were only some railway officials standing about; and talking loud to one another.\n\"So Leonards has been drinking again!\" said one, seemingly in authority. \"He'll need all his boasted influence to keep his place this time.\"\n\"Where is he?\" asked another, while Margaret, her back towards them, was counting her change with trembling fingers, not daring to turn round until she heard the answer to this question.\n\"I don't know. He came in not five minutes ago, with some long story or other about a fall he'd had, swearing awfully: and wanted to borrow some money from me to go to London by the next up-train. He made all sorts of tipsy promises, but I'd something else to do than listen to him; I told him to go about his business; and he went off at the front door.\"\n\"He's at the nearest vaults, I'll be bound,\" said the first speaker. \"Your money would have gone there too, if you'd been such a fool as to lend it.\"\n\"Catch me! I knew better what his London meant. Why, he has never paid me off that five shillings\"--and so they went on.\nAnd now all Margaret's anxiety was for the train to come. She hid herself once more in the ladies' waiting-room, and fancied every noise was Leonards' step--every loud and boisterous voice was his. But no one came near her until the train drew up; when she was civilly helped into a carriage by a porter, into whose face she durst not look till they were in motion, and then she saw that it was not Leonards'.",
        "paragraph_chars": [
            [
                0,
                72
            ],
            [
                72,
                1349
            ],
            [
                1349,
                1507
            ],
            [
                1507,
                1595
            ],
            [
                1595,
                1903
            ],
            [
                1903,
                1976
            ],
            [
                1976,
                2137
            ],
            [
                2137,
                3037
            ],
            [
                3037,
                3112
            ],
            [
                3112,
                3601
            ],
            [
                3601,
                3869
            ],
            [
                3869,
                4433
            ],
            [
                4433,
                4850
            ],
            [
                4850,
                4918
            ],
            [
                4918,
                5030
            ],
            [
                5030,
                5109
            ],
            [
                5109,
                5257
            ],
            [
                5257,
                5392
            ],
            [
                5392,
                5740
            ],
            [
                5740,
                6925
            ],
            [
                6925,
                7210
            ],
            [
                7210,
                7316
            ],
            [
                7316,
                7348
            ],
            [
                7348,
                7651
            ],
            [
                7651,
                9277
            ],
            [
                9277,
                9418
            ],
            [
                9418,
                9605
            ],
            [
                9605,
                9961
            ],
            [
                9961,
                10111
            ],
            [
                10111,
                10232
            ],
            [
                10232,
                10641
            ]
        ],
        "segment_chars": [
            [
                0,
                7
            ],
            [
                7,
                21
            ],
            [
                21,
                64
            ],
            [
                64,
                72
            ],
            [
                72,
                121
            ],
            [
                121,
                237
            ],
            [
                237,
                530
            ],
            [
                530,
                592
            ],
            [
                592,
                829
            ],
            [
                829,
                931
            ],
            [
                931,
                1078
            ],
            [
                1078,
                1185
            ],
            [
                1185,
                1324
            ],
            [
                1324,
                1349
            ],
            [
                1349,
                1403
            ],
            [
                1403,
                1442
            ],
            [
                1442,
                1507
            ],
            [
                1507,
                1535
            ],
            [
                1535,
                1595
            ],
            [
                1595,
                1604
            ],
            [
                1604,
                1733
            ],
            [
                1733,
                1764
            ],
            [
                1764,
                1815
            ],
            [
                1815,
                1833
            ],
            [
                1833,
                1871
            ],
            [
                1871,
                1903
            ],
            [
                1903,
                1944
            ],
            [
                1944,
                1976
            ],
            [
                1976,
                1995
            ],
            [
                1995,
                2034
            ],
            [
                2034,
                2100
            ],
            [
                2100,
                2137
            ],
            [
                2137,
                2242
            ],
            [
                2242,
                2427
            ],
            [
                2427,
                2672
            ],
            [
                2672,
                2745
            ],
            [
                2745,
                2847
            ],
            [
                2847,
                3037
            ],
            [
                3037,
                3077
            ],
            [
                3077,
                3112
            ],
            [
                3112,
                3123
            ],
            [
                3123,
                3299
            ],
            [
                3299,
                3386
            ],
            [
                3386,
                3427
            ],
            [
                3427,
                3498
            ],
            [
                3498,
                3539
            ],
            [
                3539,
                3564
            ],
            [
                3564,
                3601
            ],
            [
                3601,
                3833
            ],
            [
                3833,
                3869
            ],
            [
                3869,
                4086
            ],
            [
                4086,
                4125
            ],
            [
                4125,
                4273
            ],
            [
                4273,
                4420
            ],
            [
                4420,
                4433
            ],
            [
                4433,
                4564
            ],
            [
                4564,
                4804
            ],
            [
                4804,
                4850
            ],
            [
                4850,
                4865
            ],
            [
                4865,
                4918
            ],
            [
                4918,
                5030
            ],
            [
                5030,
                5046
            ],
            [
                5046,
                5087
            ],
            [
                5087,
                5109
            ],
            [
                5109,
                5176
            ],
            [
                5176,
                5257
            ],
            [
                5257,
                5308
            ],
            [
                5308,
                5392
            ],
            [
                5392,
                5422
            ],
            [
                5422,
                5574
            ],
            [
                5574,
                5616
            ],
            [
                5616,
                5692
            ],
            [
                5692,
                5740
            ],
            [
                5740,
                5771
            ],
            [
                5771,
                5864
            ],
            [
                5864,
                5937
            ],
            [
                5937,
                6111
            ],
            [
                6111,
                6196
            ],
            [
                6196,
                6220
            ],
            [
                6220,
                6418
            ],
            [
                6418,
                6567
            ],
            [
                6567,
                6615
            ],
            [
                6615,
                6697
            ],
            [
                6697,
                6838
            ],
            [
                6838,
                6925
            ],
            [
                6925,
                7032
            ],
            [
                7032,
                7210
            ],
            [
                7210,
                7233
            ],
            [
                7233,
                7316
            ],
            [
                7316,
                7348
            ],
            [
                7348,
                7637
            ],
            [
                7637,
                7651
            ],
            [
                7651,
                7663
            ],
            [
                7663,
                7680
            ],
            [
                7680,
                7700
            ],
            [
                7700,
                7725
            ],
            [
                7725,
                7734
            ],
            [
                7734,
                7758
            ],
            [
                7758,
                7831
            ],
            [
                7831,
                7933
            ],
            [
                7933,
                7993
            ],
            [
                7993,
                8129
            ],
            [
                8129,
                8180
            ],
            [
                8180,
                8245
            ],
            [
                8245,
                8368
            ],
            [
                8368,
                8503
            ],
            [
                8503,
                8634
            ],
            [
                8634,
                8775
            ],
            [
                8775,
                8981
            ],
            [
                8981,
                9048
            ],
            [
                9048,
                9110
            ],
            [
                9110,
                9189
            ],
            [
                9189,
                9277
            ],
            [
                9277,
                9316
            ],
            [
                9316,
                9350
            ],
            [
                9350,
                9418
            ],
            [
                9418,
                9433
            ],
            [
                9433,
                9605
            ],
            [
                9605,
                9620
            ],
            [
                9620,
                9802
            ],
            [
                9802,
                9961
            ],
            [
                9961,
                10030
            ],
            [
                10030,
                10111
            ],
            [
                10111,
                10122
            ],
            [
                10122,
                10159
            ],
            [
                10159,
                10232
            ],
            [
                10232,
                10290
            ],
            [
                10290,
                10430
            ],
            [
                10430,
                10641
            ]
        ],
        "overlap_chars": [
            [
                72,
                93
            ],
            [
                99,
                107
            ],
            [
                109,
                121
            ],
            [
                121,
                136
            ],
            [
                142,
                147
            ],
            [
                152,
                237
            ],
            [
                237,
                287
            ],
            [
                413,
                416
            ],
            [
                328,
                412
            ],
            [
                440,
                443
            ],
            [
                446,
                450
            ],
            [
                324,
                327
            ],
            [
                451,
                455
            ],
            [
                463,
                529
            ],
            [
                530,
                571
            ],
            [
                577,
                586
            ],
            [
                572,
                576
            ],
            [
                587,
                592
            ],
            [
                592,
                631
            ],
            [
                686,
                705
            ],
            [
                722,
                743
            ],
            [
                779,
                782
            ],
            [
                764,
                778
            ],
            [
                783,
                829
            ],
            [
                829,
                855
            ],
            [
                881,
                888
            ],
            [
                879,
                880
            ],
            [
                856,
                879
            ],
            [
                929,
                931
            ],
            [
                931,
                1005
            ],
            [
                1020,
                1023
            ],
            [
                1029,
                1050
            ],
            [
                1059,
                1078
            ],
            [
                1185,
                1218
            ],
            [
                1220,
                1227
            ],
            [
                1234,
                1262
            ],
            [
                1268,
                1274
            ],
            [
                1289,
                1296
            ],
            [
                1305,
                1324
            ],
            [
                1324,
                1349
            ],
            [
                1350,
                1403
            ],
            [
                1665,
                1667
            ],
            [
                1604,
                1612
            ],
            [
                1620,
                1631
            ],
            [
                1641,
                1644
            ],
            [
                1651,
                1659
            ],
            [
                1677,
                1684
            ],
            [
                1684,
                1733
            ],
            [
                1733,
                1764
            ],
            [
                1789,
                1815
            ],
            [
                1871,
                1900
            ],
            [
                1908,
                1942
            ],
            [
                2034,
                2047
            ],
            [
                2055,
                2076
            ],
            [
                2098,
                2100
            ],
            [
                2104,
                2134
            ],
            [
                2137,
                2163
            ],
            [
                2168,
                2175
            ],
            [
                2234,
                2240
            ],
            [
                2176,
                2184
            ],
            [
                2240,
                2242
            ],
            [
                2242,
                2323
            ],
            [
                2327,
                2357
            ],
            [
                2425,
                2427
            ],
            [
                2434,
                2448
            ],
            [
                2593,
                2672
            ],
            [
                2672,
                2727
            ],
            [
                2733,
                2745
            ],
            [
                2745,
                2749
            ],
            [
                2762,
                2791
            ],
            [
                2828,
                2845
            ],
            [
                2847,
                2858
            ],
            [
                2872,
                2876
            ],
            [
                2888,
                2904
            ],
            [
                2915,
                2924
            ],
            [
                2804,
                2807
            ],
            [
                2941,
                2950
            ],
            [
                2975,
                3001
            ],
            [
                3006,
                3017
            ],
            [
                3035,
                3037
            ],
            [
                3064,
                3069
            ],
            [
                3080,
                3084
            ],
            [
                3045,
                3052
            ],
            [
                3096,
                3112
            ],
            [
                3117,
                3123
            ],
            [
                3123,
                3124
            ],
            [
                3137,
                3194
            ],
            [
                3244,
                3245
            ],
            [
                3195,
                3244
            ],
            [
                3297,
                3299
            ],
            [
                3299,
                3347
            ],
            [
                3358,
                3386
            ],
            [
                3386,
                3408
            ],
            [
                3419,
                3427
            ],
            [
                3427,
                3478
            ],
            [
                3496,
                3498
            ],
            [
                3498,
                3539
            ],
            [
                3539,
                3562
            ],
            [
                3601,
                3639
            ],
            [
                3673,
                3746
            ],
            [
                3752,
                3812
            ],
            [
                3823,
                3833
            ],
            [
                3833,
                3836
            ],
            [
                3859,
                3869
            ],
            [
                3876,
                3890
            ],
            [
                3899,
                3962
            ],
            [
                3990,
                4011
            ],
            [
                4012,
                4014
            ],
            [
                4061,
                4067
            ],
            [
                4084,
                4086
            ],
            [
                4086,
                4105
            ],
            [
                4111,
                4122
            ],
            [
                4125,
                4141
            ],
            [
                4156,
                4175
            ],
            [
                4203,
                4273
            ],
            [
                4273,
                4296
            ],
            [
                4303,
                4351
            ],
            [
                4420,
                4433
            ],
            [
                4434,
                4489
            ],
            [
                4532,
                4564
            ],
            [
                4564,
                4571
            ],
            [
                4574,
                4595
            ],
            [
                4678,
                4681
            ],
            [
                4624,
                4633
            ],
            [
                4682,
                4688
            ],
            [
                4703,
                4705
            ],
            [
                4706,
                4774
            ],
            [
                4780,
                4804
            ],
            [
                4804,
                4850
            ],
            [
                4851,
                4862
            ],
            [
                4865,
                4880
            ],
            [
                4895,
                4901
            ],
            [
                4916,
                4917
            ],
            [
                4918,
                4983
            ],
            [
                4987,
                4988
            ],
            [
                4989,
                5027
            ],
            [
                5031,
                5046
            ],
            [
                5046,
                5087
            ],
            [
                5087,
                5106
            ],
            [
                5120,
                5143
            ],
            [
                5146,
                5159
            ],
            [
                5160,
                5175
            ],
            [
                5266,
                5291
            ],
            [
                5297,
                5308
            ],
            [
                5308,
                5366
            ],
            [
                5372,
                5379
            ],
            [
                5393,
                5422
            ],
            [
                5422,
                5469
            ],
            [
                5483,
                5503
            ],
            [
                5514,
                5547
            ],
            [
                5552,
                5566
            ],
            [
                5572,
                5574
            ],
            [
                5574,
                5616
            ],
            [
                5616,
                5692
            ],
            [
                5707,
                5737
            ],
            [
                5740,
                5769
            ],
            [
                5771,
                5779
            ],
            [
                5852,
                5864
            ],
            [
                5864,
                5911
            ],
            [
                5935,
                5937
            ],
            [
                5937,
                5966
            ],
            [
                5979,
                6056
            ],
            [
                6066,
                6086
            ],
            [
                6099,
                6111
            ],
            [
                6111,
                6127
            ],
            [
                6161,
                6168
            ],
            [
                6128,
                6142
            ],
            [
                6168,
                6195
            ],
            [
                6197,
                6220
            ],
            [
                6220,
                6258
            ],
            [
                6261,
                6288
            ],
            [
                6328,
                6329
            ],
            [
                6334,
                6418
            ],
            [
                6418,
                6459
            ],
            [
                6465,
                6566
            ],
            [
                6567,
                6615
            ],
            [
                6615,
                6658
            ],
            [
                6673,
                6697
            ],
            [
                6697,
                6721
            ],
            [
                6753,
                6756
            ],
            [
                6763,
                6838
            ],
            [
                6838,
                6864
            ],
            [
                6868,
                6925
            ],
            [
                6925,
                6948
            ],
            [
                6955,
                6965
            ],
            [
                6982,
                6985
            ],
            [
                7030,
                7032
            ],
            [
                7032,
                7037
            ],
            [
                7054,
                7165
            ],
            [
                7208,
                7210
            ],
            [
                7211,
                7230
            ],
            [
                7233,
                7265
            ],
            [
                7277,
                7315
            ],
            [
                7317,
                7345
            ],
            [
                7348,
                7361
            ],
            [
                7363,
                7427
            ],
            [
                7463,
                7504
            ],
            [
                7524,
                7542
            ],
            [
                7505,
                7513
            ],
            [
                7554,
                7562
            ],
            [
                7550,
                7553
            ],
            [
                7595,
                7606
            ],
            [
                7635,
                7637
            ],
            [
                7637,
                7651
            ],
            [
                7652,
                7660
            ],
            [
                7663,
                7680
            ],
            [
                7685,
                7700
            ],
            [
                7700,
                7725
            ],
            [
                7725,
                7734
            ],
            [
                7734,
                7755
            ],
            [
                7831,
                7837
            ],
            [
                7842,
                7862
            ],
            [
                7864,
                7905
            ],
            [
                7907,
                7920
            ],
            [
                7933,
                7992
            ],
            [
                7993,
                8000
            ],
            [
                8004,
                8027
            ],
            [
                8033,
                8129
            ],
            [
                8129,
                8180
            ],
            [
                8180,
                8223
            ],
            [
                8243,
                8245
            ],
            [
                8245,
                8265
            ],
            [
                8290,
                8362
            ],
            [
                8366,
                8368
            ],
            [
                8368,
                8402
            ],
            [
                8452,
                8502
            ],
            [
                8503,
                8537
            ],
            [
                8548,
                8553
            ],
            [
                8560,
                8574
            ],
            [
                8576,
                8634
            ],
            [
                8634,
                8697
            ],
            [
                8699,
                8710
            ],
            [
                8710,
                8775
            ],
            [
                8779,
                8805
            ],
            [
                8831,
                8868
            ],
            [
                8979,
                8981
            ],
            [
                8981,
                8995
            ],
            [
                9001,
                9015
            ],
            [
                9046,
                9047
            ],
            [
                9048,
                9068
            ],
            [
                9080,
                9110
            ],
            [
                9110,
                9171
            ],
            [
                9177,
                9189
            ],
            [
                9189,
                9242
            ],
            [
                9248,
                9255
            ],
            [
                9275,
                9277
            ],
            [
                9281,
                9313
            ],
            [
                9316,
                9324
            ],
            [
                9348,
                9350
            ],
            [
                9351,
                9415
            ],
            [
                9419,
                9430
            ],
            [
                9433,
                9586
            ],
            [
                9603,
                9605
            ],
            [
                9606,
                9620
            ],
            [
                9620,
                9662
            ],
            [
                9668,
                9722
            ],
            [
                9724,
                9755
            ],
            [
                9764,
                9802
            ],
            [
                9843,
                9846
            ],
            [
                9862,
                9887
            ],
            [
                9888,
                9940
            ],
            [
                9962,
                9981
            ],
            [
                9988,
                10003
            ],
            [
                10006,
                10030
            ],
            [
                10031,
                10108
            ],
            [
                10112,
                10120
            ],
            [
                10120,
                10122
            ],
            [
                10122,
                10123
            ],
            [
                10129,
                10135
            ],
            [
                10157,
                10159
            ],
            [
                10159,
                10184
            ],
            [
                10189,
                10208
            ],
            [
                10211,
                10232
            ],
            [
                10236,
                10290
            ],
            [
                10290,
                10297
            ],
            [
                10306,
                10387
            ],
            [
                10389,
                10430
            ],
            [
                10430,
                10433
            ],
            [
                10461,
                10479
            ],
            [
                10485,
                10536
            ],
            [
                10553,
                10556
            ],
            [
                10563,
                10639
            ]
        ],
        "row_chars": [
            [
                0,
                7
            ],
            [
                7,
                21
            ],
            [
                21,
                64
            ],
            [
                64,
                72
            ],
            [
                72,
                121
            ],
            [
                121,
                237
            ],
            [
                237,
                530
            ],
            [
                530,
                592
            ],
            [
                592,
                829
            ],
            [
                829,
                931
            ],
            [
                931,
                1078
            ],
            [
                1078,
                1185
            ],
            [
                1185,
                1324
            ],
            [
                1324,
                1349
            ],
            [
                1349,
                1403
            ],
            [
                1403,
                1442
            ],
            [
                1442,
                1507
            ],
            [
                1507,
                1535
            ],
            [
                1535,
                1595
            ],
            [
                1595,
                1604
            ],
            [
                1604,
                1733
            ],
            [
                1733,
                1764
            ],
            [
                1764,
                1815
            ],
            [
                1815,
                1833
            ],
            [
                1833,
                1871
            ],
            [
                1871,
                1903
            ],
            [
                1903,
                1944
            ],
            [
                1944,
                1976
            ],
            [
                1976,
                1995
            ],
            [
                1995,
                2034
            ],
            [
                2034,
                2100
            ],
            [
                2100,
                2137
            ],
            [
                2137,
                2242
            ],
            [
                2242,
                2427
            ],
            [
                2427,
                2672
            ],
            [
                2672,
                2745
            ],
            [
                2745,
                3037
            ],
            [
                3037,
                3112
            ],
            [
                3112,
                3123
            ],
            [
                3123,
                3299
            ],
            [
                3299,
                3386
            ],
            [
                3386,
                3427
            ],
            [
                3427,
                3498
            ],
            [
                3498,
                3539
            ],
            [
                3539,
                3564
            ],
            [
                3564,
                3601
            ],
            [
                3601,
                3833
            ],
            [
                3833,
                3869
            ],
            [
                3869,
                4086
            ],
            [
                4086,
                4125
            ],
            [
                4125,
                4273
            ],
            [
                4273,
                4433
            ],
            [
                4433,
                4564
            ],
            [
                4564,
                4804
            ],
            [
                4804,
                4850
            ],
            [
                4850,
                4865
            ],
            [
                4865,
                4918
            ],
            [
                4918,
                5030
            ],
            [
                5030,
                5046
            ],
            [
                5046,
                5087
            ],
            [
                5087,
                5109
            ],
            [
                5109,
                5176
            ],
            [
                5176,
                5257
            ],
            [
                5257,
                5308
            ],
            [
                5308,
                5392
            ],
            [
                5392,
                5422
            ],
            [
                5422,
                5574
            ],
            [
                5574,
                5616
            ],
            [
                5616,
                5692
            ],
            [
                5692,
                5740
            ],
            [
                5740,
                5864
            ],
            [
                5864,
                5937
            ],
            [
                5937,
                6111
            ],
            [
                6111,
                6196
            ],
            [
                6196,
                6220
            ],
            [
                6220,
                6418
            ],
            [
                6418,
                6567
            ],
            [
                6567,
                6615
            ],
            [
                6615,
                6697
            ],
            [
                6697,
                6838
            ],
            [
                6838,
                6925
            ],
            [
                6925,
                7032
            ],
            [
                7032,
                7210
            ],
            [
                7210,
                7233
            ],
            [
                7233,
                7316
            ],
            [
                7316,
                7348
            ],
            [
                7348,
                7637
            ],
            [
                7637,
                7651
            ],
            [
                7651,
                7663
            ],
            [
                7663,
                7680
            ],
            [
                7680,
                7700
            ],
            [
                7700,
                7725
            ],
            [
                7725,
                7734
            ],
            [
                7734,
                7758
            ],
            [
                7758,
                7831
            ],
            [
                7831,
                7933
            ],
            [
                7933,
                7993
            ],
            [
                7993,
                8129
            ],
            [
                8129,
                8180
            ],
            [
                8180,
                8245
            ],
            [
                8245,
                8368
            ],
            [
                8368,
                8503
            ],
            [
                8503,
                8634
            ],
            [
                8634,
                8775
            ],
            [
                8775,
                8981
            ],
            [
                8981,
                9048
            ],
            [
                9048,
                9110
            ],
            [
                9110,
                9189
            ],
            [
                9189,
                9277
            ],
            [
                9277,
                9316
            ],
            [
                9316,
                9350
            ],
            [
                9350,
                9418
            ],
            [
                9418,
                9433
            ],
            [
                9433,
                9605
            ],
            [
                9605,
                9620
            ],
            [
                9620,
                9802
            ],
            [
                9802,
                9961
            ],
            [
                9961,
                10030
            ],
            [
                10030,
                10111
            ],
            [
                10111,
                10122
            ],
            [
                10122,
                10159
            ],
            [
                10159,
                10232
            ],
            [
                10232,
                10290
            ],
            [
                10290,
                10430
            ],
            [
                10430,
                10641
            ]
        ]
    },
    "abridged": {
        "text": "All the next day they sat together - they three. Mr. Hale hardly spoke except when his children asked him questions, and forced him, as it were, into the present. Frederick's grief was no more to be seen or heard; for now he was ashamed of having been so battered down by emotion; and though his sorrow was deep and real, and would last out his life, it was never to be spoken of again.\nMargaret, not so passionate at first, was suffering more now. At times she cried a good deal; and her mournful tenderness was deepened whenever she looked at Frederick, and thought of his rapidly approaching departure. She was glad he was going, however, on her father's account. The anxious terror in which Mr. Hale lived lest his son should be detected far out-weighed the pleasure he took from his presence. He started at every unusual sound; and was not comfortable unless Frederick sat out of view of anyone entering the room. Towards evening he said:\n'You will go with Frederick to the station, Margaret? I shall want to know he is safely off - I should be fancying someone had recognised him, and stopped him, unless you could tell me you had seen him off. And go to the Outwood station. There are not so many people about. What time is your train, Fred?'\n'Ten minutes past six; very nearly dark.'\n'But it is a well-lit road all the way home,' said Margaret. 'I was out last week much later.'\nMargaret was thankful when Frederick's parting with his father was over. She hurried Frederick into the cab, in order to shorten a scene which she saw was bitterly painful to her father. In consequence they found, on reaching Outwood, that they had nearly twenty minutes to spare. The booking-office was not open, so they could not even buy the ticket. So they went down the flight of steps below the railway, where there was a path crossing a field alongside the road, and walked backwards and forwards for a few minutes.\nFrederick took his sister's hand affectionately.\n'Margaret! I will consult Mr. Lennox as to the chance of exculpating myself, so that I may return to England whenever I choose. I can't bear to think of your lonely position if anything should happen to my father. He looks sadly changed - terribly shaken. I wish you could get him to think of the Cadiz plan. What could you do if he were taken away? You have no friend near.'\nMargaret could hardly keep from crying. Frederick was bringing before her an event which she herself felt was not improbable, so severely had the cares of the last few months affected Mr. Hale. But she said:\n'There have been such unexpected changes in my life during these last two years, that it is not worth while trying to predict the future. I try to think only of the present.' She paused; they stood still for a moment, by the stile leading into the road; the setting sun fell on their faces. Frederick held her hand, and looked with wistful anxiety into her face, as she went on:\n'We shall write often to one another, and I will promise to tell you every worry I have. Papa is' - she started a little, and Frederick turned to look at the road, along which a horseman was slowly riding, just passing the stile where they stood. Margaret bowed; her bow was stiffly returned.\n'Who is that?' said Frederick, once he was past. Margaret was a little drooping, a little flushed, as she replied:\n'Mr. Thornton; you saw him before, you know.'\n'Only his back. He is an unprepossessing-looking fellow. What a scowl he has!'\n'Something has happened to vex him,' said Margaret, apologetically.\n'It must be time to go and get my ticket. If I had known how dark it would be, we wouldn't have sent away the cab.'\n'Oh, don't fidget about that. I can take a cab here, if I like; or go back by train, when I should have people and lamps all the way from Milton Station. Don't think of me; take care of yourself. I am sick with the thought that Leonards may be in the same train with you. Check the carriage before you get in.'\nThey went back to the station, and Margaret bought the ticket. Some idle-looking young men were lounging about. Margaret thought she had seen one of them before, and returned him a proud look of offended dignity for his impertinent stare of admiration. She went hastily outside to her brother, and took hold of his arm.\n'Have you got your bag? Let us walk about here on the platform,' said she, a little flurried, her bravery oozing out rather faster than she liked to acknowledge even to herself. She heard a step following them along the flagstones; it stopped when they stopped, looking out along the line and hearing the whizz of the coming train.\nThey did not speak; their hearts were too full. Another moment, and the train would be here, and he would be gone. Margaret almost repented entreating him to go to London; it was throwing more chances of detection in his way. If he had sailed for Spain from Liverpool, he might have been off in two or three hours.\nFrederick turned round, facing the gas-lamp. A man dressed as a railway porter started forward; a bad-looking man, who seemed to have drunk himself into a state of brutality.\n'By your leave, miss!' said he, pushing Margaret rudely aside, and seizing Frederick by the collar. 'Your name is Hale, I believe?'\nIn an instant - how, Margaret did not see, for everything danced before her eyes - Frederick had tripped him up, and he fell three or four feet from the platform to the soft ground below. There he lay.\n'Run, run!' gasped Margaret. 'The train is here. It was Leonards, was it? oh, run! I will carry your bag.' A door opened in a carriage - he jumped in; and as he leant out to say, 'God bless you!' the train rushed past her; and she was left standing alone.\nShe was terribly sick and faint. She was thankful to be able to turn into the ladies' waiting-room, and sit down for an instant. At first she could do nothing but gasp for breath. It was such a hurry; such a sickening alarm. If the train had not arrived, the man would have jumped up again and called for assistance to arrest Frederick. She wondered if the man had got up; she wondered if he could have been seriously hurt.\nShe ventured out; the platform was lit, but quite deserted. She went to the end, and looked over, somewhat fearfully. No one was there; and then she was glad she had made herself go and inspect it, for otherwise terrible thoughts would have haunted her dreams. Even as it was, she was so frightened that she felt she could not walk home. She would wait for the down train.\nBut what if Leonards recognised her as Frederick's companion! She peered about, before venturing into the booking-office to buy her ticket. There were only some railway officials standing about, talking loudly.\n'So Leonards has been drinking again!' said one. 'He'll need all his boasted influence to keep his place this time.'\n'Where is he?' asked another, while Margaret, her back towards them, was counting her change with trembling fingers, not daring to turn round until she heard the answer.\n'I don't know. He came in not five minutes ago, with some story or other about a fall he'd had, swearing awfully; and wanted to borrow some money to go to London by the next up-train. I'd better things to do than listen to him; so I told him to go about his business; and he went off.'\n'He's at the nearest inn, I'll be bound,' said the first speaker. 'Your money would have gone there too, if you'd been such a fool as to lend it.'\n'Catch me doing that! I know better. Why, he has never paid me back that five shillings' - and so they went on.\nNow all Margaret's anxiety was for the train to come. She hid once more in the ladies' waiting-room, and fancied every noise was Leonards' step - every loud and boisterous voice was his. But the train drew up; she was civilly helped into a carriage by a porter, at whom she dared not look till they were in motion, and then she saw that it was not Leonards.",
        "paragraph_chars": [
            [
                0,
                387
            ],
            [
                387,
                944
            ],
            [
                944,
                1250
            ],
            [
                1250,
                1292
            ],
            [
                1292,
                1387
            ],
            [
                1387,
                1910
            ],
            [
                1910,
                1959
            ],
            [
                1959,
                2335
            ],
            [
                2335,
                2543
            ],
            [
                2543,
                2922
            ],
            [
                2922,
                3215
            ],
            [
                3215,
                3330
            ],
            [
                3330,
                3376
            ],
            [
                3376,
                3455
            ],
            [
                3455,
                3523
            ],
            [
                3523,
                3639
            ],
            [
                3639,
                3950
            ],
            [
                3950,
                4270
            ],
            [
                4270,
                4602
            ],
            [
                4602,
                4917
            ],
            [
                4917,
                5092
            ],
            [
                5092,
                5224
            ],
            [
                5224,
                5426
            ],
            [
                5426,
                5682
            ],
            [
                5682,
                6106
            ],
            [
                6106,
                6479
            ],
            [
                6479,
                6690
            ],
            [
                6690,
                6807
            ],
            [
                6807,
                6977
            ],
            [
                6977,
                7263
            ],
            [
                7263,
                7410
            ],
            [
                7410,
                7522
            ],
            [
                7522,
                7879
            ]
        ],
        "segment_chars": [
            [
                0,
                49
            ],
            [
                49,
                163
            ],
            [
                163,
                387
            ],
            [
                387,
                449
            ],
            [
                449,
                606
            ],
            [
                606,
                667
            ],
            [
                667,
                798
            ],
            [
                798,
                919
            ],
            [
                919,
                944
            ],
            [
                944,
                998
            ],
            [
                998,
                1151
            ],
            [
                1151,
                1182
            ],
            [
                1182,
                1218
            ],
            [
                1218,
                1250
            ],
            [
                1250,
                1292
            ],
            [
                1292,
                1353
            ],
            [
                1353,
                1387
            ],
            [
                1387,
                1460
            ],
            [
                1460,
                1574
            ],
            [
                1574,
                1668
            ],
            [
                1668,
                1740
            ],
            [
                1740,
                1910
            ],
            [
                1910,
                1959
            ],
            [
                1959,
                1970
            ],
            [
                1970,
                2087
            ],
            [
                2087,
                2173
            ],
            [
                2173,
                2215
            ],
            [
                2215,
                2268
            ],
            [
                2268,
                2309
            ],
            [
                2309,
                2335
            ],
            [
                2335,
                2375
            ],
            [
                2375,
                2529
            ],
            [
                2529,
                2543
            ],
            [
                2543,
                2681
            ],
            [
                2681,
                2718
            ],
            [
                2718,
                2834
            ],
            [
                2834,
                2922
            ],
            [
                2922,
                3011
            ],
            [
                3011,
                3169
            ],
            [
                3169,
                3215
            ],
            [
                3215,
                3230
            ],
            [
                3230,
                3264
            ],
            [
                3264,
                3330
            ],
            [
                3330,
                3335
            ],
            [
                3335,
                3376
            ],
            [
                3376,
                3392
            ],
            [
                3392,
                3433
            ],
            [
                3433,
                3455
            ],
            [
                3455,
                3523
            ],
            [
                3523,
                3565
            ],
            [
                3565,
                3639
            ],
            [
                3639,
                3669
            ],
            [
                3669,
                3793
            ],
            [
                3793,
                3835
            ],
            [
                3835,
                3911
            ],
            [
                3911,
                3950
            ],
            [
                3950,
                4013
            ],
            [
                4013,
                4062
            ],
            [
                4062,
                4203
            ],
            [
                4203,
                4270
            ],
            [
                4270,
                4294
            ],
            [
                4294,
                4448
            ],
            [
                4448,
                4602
            ],
            [
                4602,
                4650
            ],
            [
                4650,
                4717
            ],
            [
                4717,
                4828
            ],
            [
                4828,
                4917
            ],
            [
                4917,
                4962
            ],
            [
                4962,
                5092
            ],
            [
                5092,
                5115
            ],
            [
                5115,
                5192
            ],
            [
                5192,
                5224
            ],
            [
                5224,
                5412
            ],
            [
                5412,
                5426
            ],
            [
                5426,
                5438
            ],
            [
                5438,
                5455
            ],
            [
                5455,
                5475
            ],
            [
                5475,
                5500
            ],
            [
                5500,
                5509
            ],
            [
                5509,
                5533
            ],
            [
                5533,
                5622
            ],
            [
                5622,
                5682
            ],
            [
                5682,
                5715
            ],
            [
                5715,
                5811
            ],
            [
                5811,
                5862
            ],
            [
                5862,
                5907
            ],
            [
                5907,
                6019
            ],
            [
                6019,
                6106
            ],
            [
                6106,
                6166
            ],
            [
                6166,
                6224
            ],
            [
                6224,
                6367
            ],
            [
                6367,
                6444
            ],
            [
                6444,
                6479
            ],
            [
                6479,
                6541
            ],
            [
                6541,
                6619
            ],
            [
                6619,
                6690
            ],
            [
                6690,
                6729
            ],
            [
                6729,
                6739
            ],
            [
                6739,
                6807
            ],
            [
                6807,
                6822
            ],
            [
                6822,
                6977
            ],
            [
                6977,
                6992
            ],
            [
                6992,
                7161
            ],
            [
                7161,
                7263
            ],
            [
                7263,
                7329
            ],
            [
                7329,
                7410
            ],
            [
                7410,
                7432
            ],
            [
                7432,
                7447
            ],
            [
                7447,
                7522
            ],
            [
                7522,
                7576
            ],
            [
                7576,
                7709
            ],
            [
                7709,
                7879
            ]
        ],
        "overlap_chars": [
            [
                0,
                21
            ],
            [
                26,
                34
            ],
            [
                37,
                49
            ],
            [
                49,
                64
            ],
            [
                65,
                70
            ],
            [
                78,
                163
            ],
            [
                163,
                213
            ],
            [
                214,
                217
            ],
            [
                218,
                302
            ],
            [
                303,
                306
            ],
            [
                307,
                311
            ],
            [
                312,
                315
            ],
            [
                316,
                320
            ],
            [
                320,
                386
            ],
            [
                387,
                428
            ],
            [
                429,
                438
            ],
            [
                439,
                443
            ],
            [
                444,
                449
            ],
            [
                449,
                488
            ],
            [
                489,
                508
            ],
            [
                509,
                530
            ],
            [
                531,
                534
            ],
            [
                545,
                559
            ],
            [
                560,
                606
            ],
            [
                606,
                632
            ],
            [
                633,
                640
            ],
            [
                640,
                641
            ],
            [
                642,
                665
            ],
            [
                665,
                667
            ],
            [
                667,
                741
            ],
            [
                742,
                745
            ],
            [
                752,
                773
            ],
            [
                779,
                798
            ],
            [
                798,
                831
            ],
            [
                833,
                840
            ],
            [
                845,
                873
            ],
            [
                878,
                884
            ],
            [
                885,
                892
            ],
            [
                900,
                919
            ],
            [
                919,
                944
            ],
            [
                945,
                998
            ],
            [
                1019,
                1021
            ],
            [
                1038,
                1046
            ],
            [
                1047,
                1058
            ],
            [
                1067,
                1070
            ],
            [
                1082,
                1090
            ],
            [
                1091,
                1098
            ],
            [
                1102,
                1151
            ],
            [
                1151,
                1182
            ],
            [
                1192,
                1218
            ],
            [
                1218,
                1247
            ],
            [
                1255,
                1289
            ],
            [
                1297,
                1310
            ],
            [
                1314,
                1335
            ],
            [
                1351,
                1353
            ],
            [
                1354,
                1384
            ],
            [
                1387,
                1413
            ],
            [
                1426,
                1433
            ],
            [
                1443,
                1449
            ],
            [
                1450,
                1458
            ],
            [
                1458,
                1460
            ],
            [
                1460,
                1541
            ],
            [
                1542,
                1572
            ],
            [
                1572,
                1574
            ],
            [
                1574,
                1588
            ],
            [
                1589,
                1668
            ],
            [
                1668,
                1723
            ],
            [
                1728,
                1740
            ],
            [
                1743,
                1747
            ],
            [
                1748,
                1777
            ],
            [
                1778,
                1795
            ],
            [
                1803,
                1814
            ],
            [
                1815,
                1819
            ],
            [
                1820,
                1836
            ],
            [
                1837,
                1846
            ],
            [
                1847,
                1850
            ],
            [
                1851,
                1860
            ],
            [
                1868,
                1894
            ],
            [
                1897,
                1908
            ],
            [
                1908,
                1910
            ],
            [
                1914,
                1919
            ],
            [
                1920,
                1924
            ],
            [
                1935,
                1942
            ],
            [
                1943,
                1959
            ],
            [
                1964,
                1970
            ],
            [
                1970,
                1971
            ],
            [
                1977,
                2034
            ],
            [
                2034,
                2035
            ],
            [
                2036,
                2085
            ],
            [
                2085,
                2087
            ],
            [
                2087,
                2135
            ],
            [
                2145,
                2173
            ],
            [
                2173,
                2195
            ],
            [
                2207,
                2215
            ],
            [
                2215,
                2266
            ],
            [
                2266,
                2268
            ],
            [
                2268,
                2309
            ],
            [
                2309,
                2332
            ],
            [
                2335,
                2373
            ],
            [
                2375,
                2448
            ],
            [
                2449,
                2509
            ],
            [
                2519,
                2529
            ],
            [
                2529,
                2532
            ],
            [
                2533,
                2543
            ],
            [
                2550,
                2564
            ],
            [
                2565,
                2628
            ],
            [
                2629,
                2650
            ],
            [
                2658,
                2660
            ],
            [
                2673,
                2679
            ],
            [
                2679,
                2681
            ],
            [
                2681,
                2700
            ],
            [
                2704,
                2715
            ],
            [
                2718,
                2734
            ],
            [
                2741,
                2760
            ],
            [
                2764,
                2834
            ],
            [
                2834,
                2857
            ],
            [
                2857,
                2905
            ],
            [
                2909,
                2922
            ],
            [
                2923,
                2978
            ],
            [
                2979,
                3011
            ],
            [
                3011,
                3018
            ],
            [
                3022,
                3043
            ],
            [
                3044,
                3047
            ],
            [
                3048,
                3057
            ],
            [
                3058,
                3064
            ],
            [
                3065,
                3067
            ],
            [
                3076,
                3144
            ],
            [
                3145,
                3169
            ],
            [
                3169,
                3215
            ],
            [
                3216,
                3227
            ],
            [
                3230,
                3245
            ],
            [
                3251,
                3257
            ],
            [
                3262,
                3263
            ],
            [
                3264,
                3329
            ],
            [
                3333,
                3334
            ],
            [
                3335,
                3373
            ],
            [
                3377,
                3392
            ],
            [
                3392,
                3433
            ],
            [
                3433,
                3452
            ],
            [
                3466,
                3489
            ],
            [
                3492,
                3505
            ],
            [
                3507,
                3522
            ],
            [
                3524,
                3549
            ],
            [
                3554,
                3565
            ],
            [
                3565,
                3623
            ],
            [
                3629,
                3636
            ],
            [
                3640,
                3669
            ],
            [
                3669,
                3716
            ],
            [
                3722,
                3742
            ],
            [
                3743,
                3776
            ],
            [
                3777,
                3791
            ],
            [
                3791,
                3793
            ],
            [
                3793,
                3835
            ],
            [
                3835,
                3911
            ],
            [
                3917,
                3947
            ],
            [
                3950,
                3979
            ],
            [
                3985,
                3993
            ],
            [
                4001,
                4013
            ],
            [
                4013,
                4060
            ],
            [
                4060,
                4062
            ],
            [
                4062,
                4091
            ],
            [
                4092,
                4169
            ],
            [
                4170,
                4190
            ],
            [
                4191,
                4203
            ],
            [
                4203,
                4219
            ],
            [
                4220,
                4227
            ],
            [
                4228,
                4242
            ],
            [
                4242,
                4269
            ],
            [
                4271,
                4294
            ],
            [
                4294,
                4332
            ],
            [
                4335,
                4362
            ],
            [
                4362,
                4363
            ],
            [
                4364,
                4448
            ],
            [
                4448,
                4489
            ],
            [
                4500,
                4601
            ],
            [
                4602,
                4650
            ],
            [
                4650,
                4693
            ],
            [
                4693,
                4717
            ],
            [
                4717,
                4741
            ],
            [
                4742,
                4745
            ],
            [
                4753,
                4828
            ],
            [
                4828,
                4854
            ],
            [
                4860,
                4917
            ],
            [
                4917,
                4940
            ],
            [
                4941,
                4951
            ],
            [
                4952,
                4955
            ],
            [
                4960,
                4962
            ],
            [
                4962,
                4967
            ],
            [
                4979,
                5090
            ],
            [
                5090,
                5092
            ],
            [
                5093,
                5112
            ],
            [
                5115,
                5147
            ],
            [
                5153,
                5191
            ],
            [
                5193,
                5221
            ],
            [
                5224,
                5237
            ],
            [
                5240,
                5304
            ],
            [
                5307,
                5348
            ],
            [
                5349,
                5367
            ],
            [
                5368,
                5376
            ],
            [
                5377,
                5385
            ],
            [
                5389,
                5392
            ],
            [
                5393,
                5404
            ],
            [
                5410,
                5412
            ],
            [
                5412,
                5426
            ],
            [
                5427,
                5435
            ],
            [
                5438,
                5455
            ],
            [
                5460,
                5475
            ],
            [
                5475,
                5500
            ],
            [
                5500,
                5509
            ],
            [
                5509,
                5530
            ],
            [
                5533,
                5539
            ],
            [
                5540,
                5560
            ],
            [
                5563,
                5604
            ],
            [
                5606,
                5619
            ],
            [
                5622,
                5681
            ],
            [
                5682,
                5689
            ],
            [
                5690,
                5713
            ],
            [
                5715,
                5811
            ],
            [
                5811,
                5862
            ],
            [
                5862,
                5905
            ],
            [
                5905,
                5907
            ],
            [
                5907,
                5927
            ],
            [
                5935,
                6007
            ],
            [
                6017,
                6019
            ],
            [
                6019,
                6053
            ],
            [
                6055,
                6105
            ],
            [
                6106,
                6140
            ],
            [
                6144,
                6149
            ],
            [
                6150,
                6164
            ],
            [
                6166,
                6224
            ],
            [
                6224,
                6287
            ],
            [
                6288,
                6299
            ],
            [
                6302,
                6367
            ],
            [
                6367,
                6393
            ],
            [
                6405,
                6442
            ],
            [
                6442,
                6444
            ],
            [
                6444,
                6458
            ],
            [
                6463,
                6477
            ],
            [
                6477,
                6478
            ],
            [
                6479,
                6499
            ],
            [
                6511,
                6541
            ],
            [
                6541,
                6602
            ],
            [
                6607,
                6619
            ],
            [
                6619,
                6672
            ],
            [
                6674,
                6681
            ],
            [
                6688,
                6690
            ],
            [
                6694,
                6726
            ],
            [
                6729,
                6737
            ],
            [
                6737,
                6739
            ],
            [
                6740,
                6804
            ],
            [
                6808,
                6819
            ],
            [
                6822,
                6975
            ],
            [
                6975,
                6977
            ],
            [
                6978,
                6992
            ],
            [
                6992,
                7034
            ],
            [
                7035,
                7089
            ],
            [
                7091,
                7122
            ],
            [
                7123,
                7161
            ],
            [
                7161,
                7164
            ],
            [
                7179,
                7204
            ],
            [
                7208,
                7260
            ],
            [
                7264,
                7283
            ],
            [
                7287,
                7302
            ],
            [
                7305,
                7329
            ],
            [
                7330,
                7407
            ],
            [
                7411,
                7419
            ],
            [
                7430,
                7432
            ],
            [
                7432,
                7433
            ],
            [
                7439,
                7445
            ],
            [
                7445,
                7447
            ],
            [
                7447,
                7472
            ],
            [
                7478,
                7497
            ],
            [
                7501,
                7522
            ],
            [
                7522,
                7576
            ],
            [
                7576,
                7583
            ],
            [
                7584,
                7665
            ],
            [
                7668,
                7709
            ],
            [
                7709,
                7712
            ],
            [
                7713,
                7731
            ],
            [
                7732,
                7783
            ],
            [
                7792,
                7795
            ],
            [
                7802,
                7878
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                49
            ],
            [
                49,
                163
            ],
            [
                163,
                387
            ],
            [
                387,
                449
            ],
            [
                449,
                606
            ],
            [
                606,
                667
            ],
            [
                667,
                798
            ],
            [
                798,
                798
            ],
            [
                798,
                919
            ],
            [
                919,
                944
            ],
            [
                944,
                998
            ],
            [
                998,
                998
            ],
            [
                998,
                998
            ],
            [
                998,
                998
            ],
            [
                998,
                998
            ],
            [
                998,
                998
            ],
            [
                998,
                1151
            ],
            [
                1151,
                1182
            ],
            [
                1182,
                1218
            ],
            [
                1218,
                1218
            ],
            [
                1218,
                1218
            ],
            [
                1218,
                1250
            ],
            [
                1250,
                1292
            ],
            [
                1292,
                1292
            ],
            [
                1292,
                1292
            ],
            [
                1292,
                1292
            ],
            [
                1292,
                1353
            ],
            [
                1353,
                1387
            ],
            [
                1387,
                1460
            ],
            [
                1460,
                1574
            ],
            [
                1574,
                1668
            ],
            [
                1668,
                1740
            ],
            [
                1740,
                1910
            ],
            [
                1910,
                1959
            ],
            [
                1959,
                1970
            ],
            [
                1970,
                2087
            ],
            [
                2087,
                2173
            ],
            [
                2173,
                2215
            ],
            [
                2215,
                2268
            ],
            [
                2268,
                2309
            ],
            [
                2309,
                2335
            ],
            [
                2335,
                2335
            ],
            [
                2335,
                2529
            ],
            [
                2529,
                2543
            ],
            [
                2543,
                2681
            ],
            [
                2681,
                2718
            ],
            [
                2718,
                2834
            ],
            [
                2834,
                2922
            ],
            [
                2922,
                3011
            ],
            [
                3011,
                3169
            ],
            [
                3169,
                3215
            ],
            [
                3215,
                3230
            ],
            [
                3230,
                3264
            ],
            [
                3264,
                3376
            ],
            [
                3376,
                3392
            ],
            [
                3392,
                3433
            ],
            [
                3433,
                3455
            ],
            [
                3455,
                3523
            ],
            [
                3523,
                3523
            ],
            [
                3523,
                3565
            ],
            [
                3565,
                3639
            ],
            [
                3639,
                3669
            ],
            [
                3669,
                3793
            ],
            [
                3793,
                3835
            ],
            [
                3835,
                3911
            ],
            [
                3911,
                3950
            ],
            [
                3950,
                4013
            ],
            [
                4013,
                4062
            ],
            [
                4062,
                4203
            ],
            [
                4203,
                4270
            ],
            [
                4270,
                4294
            ],
            [
                4294,
                4448
            ],
            [
                4448,
                4602
            ],
            [
                4602,
                4650
            ],
            [
                4650,
                4717
            ],
            [
                4717,
                4828
            ],
            [
                4828,
                4917
            ],
            [
                4917,
                4962
            ],
            [
                4962,
                5092
            ],
            [
                5092,
                5115
            ],
            [
                5115,
                5192
            ],
            [
                5192,
                5224
            ],
            [
                5224,
                5412
            ],
            [
                5412,
                5426
            ],
            [
                5426,
                5438
            ],
            [
                5438,
                5455
            ],
            [
                5455,
                5475
            ],
            [
                5475,
                5500
            ],
            [
                5500,
                5509
            ],
            [
                5509,
                5533
            ],
            [
                5533,
                5533
            ],
            [
                5533,
                5622
            ],
            [
                5622,
                5682
            ],
            [
                5682,
                5811
            ],
            [
                5811,
                5862
            ],
            [
                5862,
                5907
            ],
            [
                5907,
                6019
            ],
            [
                6019,
                6106
            ],
            [
                6106,
                6224
            ],
            [
                6224,
                6367
            ],
            [
                6367,
                6444
            ],
            [
                6444,
                6479
            ],
            [
                6479,
                6541
            ],
            [
                6541,
                6619
            ],
            [
                6619,
                6690
            ],
            [
                6690,
                6729
            ],
            [
                6729,
                6739
            ],
            [
                6739,
                6807
            ],
            [
                6807,
                6822
            ],
            [
                6822,
                6977
            ],
            [
                6977,
                6992
            ],
            [
                6992,
                7161
            ],
            [
                7161,
                7263
            ],
            [
                7263,
                7329
            ],
            [
                7329,
                7410
            ],
            [
                7410,
                7432
            ],
            [
                7432,
                7447
            ],
            [
                7447,
                7522
            ],
            [
                7522,
                7576
            ],
            [
                7576,
                7709
            ],
            [
                7709,
                7879
            ]
        ]
    }
}