{
    "original": {
        "text": "\"Sleep on, my love, in thy cold bed, Never to be disquieted! My last Good Night--thou wilt not wake Till I thy fate shall overtake.\" DR. KING.\nHome seemed unnaturally quiet after all this terror and noisy commotion. Her father had seen all due preparation made for her refreshment on her return; and then sate down again in his accustomed chair, to fall into one of his sad waking dreams. Dixon had got Mary Higgins to scold and direct in the kitchen; and her scolding was not the less energetic because it was delivered in an angry whisper; for, speaking above her breath she would have thought irreverent, as long as there was any one lying dead in the house. Margaret had resolved not to mention the crowning and closing affright to her father. There was no use in speaking about it; it had ended well; the only thing to be feared was lest Leonards should in some way borrow money enough to effect his purpose of following Frederick to London, and hunting him out there. But there were immense chances against the success of any such plan; and Margaret determined not to torment herself by thinking of what she could do nothing to prevent. Frederick would be as much on his guard as she could put him; and in a day or two at most he would be safely out of England.\n\"I suppose we shall hear from Mr. Bell to-morrow,\" said Margaret.\n\"Yes,\" replied her father. \"I suppose so.\"\n\"If he can come, he will be here to-morrow evening, I should think.\"\n\"If he cannot come, I shall ask Mr. Thornton to go with me to the funeral. I cannot go alone. I should break down utterly.\"\n\"Don't ask Mr. Thornton, papa. Let me go with you,\" said Margaret, impetuously.\n\"You! My dear, women do not generally go.\"\n\"No; because they can't control themselves. Women of our class don't go, because they have no power over their emotions, and yet are ashamed of showing them. Poor women go, and don't care if they are seen overwhelmed with grief. But I promise you, papa, that if you will let me go, I will be no trouble. Don't have a stranger, and leave me out. Dear papa! if Mr. Bell cannot come, I shall go. I won't urge my wish against your will, if he does.\"\nMr. Bell could not come. He had the gout. It was a most affectionate letter, and expressed great and true regret for his inability to attend. He hoped to come and pay them a visit soon, if they would have him; his Milton property required some looking after, and his agent had written to him to say that his presence was absolutely necessary; or else he had avoided coming near Milton as long as he could, and now the only thing that would reconcile him to this necessary visit was the idea that he should see, and might possibly be able to comfort his old friend.\nMargaret had all the difficulty in the world to persuade her father not to invite Mr. Thornton. She had an indescribable repugnance to this step being taken. The night before the funeral, came a stately note from Mrs. Thornton to Miss Hale, saying that, at her son's desire, their carriage should attend the funeral, if it would not be disagreeable to the family. Margaret tossed the note to her father.\n\"Oh, don't let us have these forms,\" said she. \"Let us go alone--you and me, papa. They don't care for us, or else he would have offered to go himself, and not have proposed this sending an empty carriage.\"\n\"I thought you were so extremely averse to his going, Margaret,\" said Mr. Hale in some surprise.\n\"And so I am. I don't want him to come at all; and I should especially dislike the idea of our asking him. But this seems such a mockery of mourning that I did not expect it from him.\" She startled her father by bursting into tears. She had been so subdued in her grief, so thoughtful for others, so gentle and patient in all things, that he could not understand her impatient ways to-night; she seemed agitated and restless; and at all the tenderness which her father in his turn now lavished upon her, she only cried the more.\nShe passed so bad a night that she was ill prepared for the additional anxiety caused by a letter received from Frederick. Mr. Lennox was out of town; his clerk said that he would return by the following Tuesday at the latest; that he might possibly be home on Monday. Consequently, after some consideration, Frederick had determined upon remaining in London a day or two longer. He had thought of coming down to Milton again; the temptation had been very strong; but the idea of Mr. Bell domesticated in his father's house, and the alarm he had received at the last moment at the railway station, had made him resolve to stay in London. Margaret might be assured he would take every precaution against being tracked by Leonards. Margaret was thankful that she received this letter while her father was absent in her mother's room. If he had been present, he would have expected her to read it aloud to him, and it would have raised in him a state of nervous alarm which she would have found it impossible to soothe away. There was not merely the fact, which disturbed her excessively, of Frederick's detention in London, but there were allusions to the recognition at the last moment at Milton, and the possibility of a pursuit, which made her blood run cold; and how then would it have affected her father? Many a time did Margaret repent of having suggested and urged on the plan of consulting Mr. Lennox. At the moment, it had seemed as if it would occasion so little delay--add so little to the apparently small chances of detection; and yet everything that had since occurred had tended to make it so undesirable. Margaret battled hard against this regret of hers for what could not now be helped; this self-reproach for having said what at the time appeared to be wise, but which after events were proving to have been so foolish. But her father was in too depressed a state of mind and body to struggle healthily; he would succumb to all these causes for morbid regret over what could not be recalled. Margaret summoned up all her forces to her aid. Her father seemed to have forgotten that they had any reason to expect a letter from Frederick that morning. He was absorbed in one idea--that the last visible token of the presence of his wife was to be carried away from him, and hidden from his sight. He trembled pitifully as the undertaker's man was arranging his crape draperies around him. He looked wistfully at Margaret; and, when released, he tottered towards her, murmuring, \"Pray for me, Margaret. I have no strength left in me. I cannot pray. I give her up because I must. I try to bear it: indeed I do. I know it is God's will. But I cannot see why she died. Pray for me, Margaret, that I may have faith to pray. It is a great strait, my child.\"\nMargaret sat by him in the coach, almost supporting him in her arms; and repeating all the noble verses of holy comfort, or texts expressive of faithful resignation, that she could remember. Her voice never faltered; and she herself gained strength by doing this. Her father's lips moved after her, repeating the well-known texts as her words suggested them; it was terrible to see the patient struggling effort to obtain the resignation which he had not strength to take into his heart as part of himself.\nMargaret's fortitude nearly gave way as Dixon, with a slight motion of her hand, directed her notice to Nicholas Higgins and his daughter, standing a little aloof, but deeply attentive to the ceremonial. Nicholas wore his usual fustian clothes, but had a bit of black stuff sown round his hat--a mark of mourning which he had never shown to his daughter Bessy's memory. But Mr. Hale saw nothing. He went on repeating to himself, mechanically as it were, all the funeral service as it was read by the officiating clergyman; he sighed twice or thrice when all was ended; and then, putting his hand on Margaret's arm, he mutely entreated to be led away, as if he were blind, and she his faithful guide.\nDixon sobbed aloud; she covered her face with her handkerchief, and was so absorbed in her own grief that she did not perceive that the crowd, attracted on such occasions, was dispersing, till she was spoken to by some one close at hand. It was Mr. Thornton. He had been present all the time, standing, with bent head, behind a group of people, so that, in fact, no one had recognised him.\n\"I beg your pardon,--but, can you tell me how Mr. Hale is? And Miss Hale, too? I should like to know how they both are.\"\n\"Of course, sir. They are much as is to be expected. Master is terribly broke down. Miss Hale bears up better than likely.\"\nMr. Thornton would rather have heard that she was suffering the natural sorrow. In the first place, there was selfishness enough in him to have taken pleasure in the idea that his great love might come in to comfort and console her; much the same kind of passionate pleasure which comes stinging through a mother's heart, when her drooping infant nestles close to her, and is dependent upon her for everything. But this delicious vision of what might have been--in which, in spite of all Margaret's repulse, he would have indulged only a few days ago--was miserably disturbed by the recollection of what he had seen near the Outwood station. \"Miserably disturbed!\" that is not strong enough. He was haunted by the remembrance of the handsome young man, with whom she stood in an attitude of such familiar confidence; and the remembrance shot through him like an agony, till it made him clench his hands tight in order to subdue the pain. At that late hour, so far from home! It took a great moral effort to galvanise his trust--erewhile so perfect--in Margaret's pure and exquisite maidenliness into life; as soon as the effort ceased, his trust dropped down dead and powerless: and all sorts of wild fancies chased each other like dreams, through his mind. Here was a little bit of miserable, gnawing confirmation. \"She bore up better than likely\" under this grief. She had then some hope to look to, so bright that even in her affectionate nature it could come in to lighten the dark hours of a daughter newly made motherless. Yes! he knew how she would love. He had not loved her without gaining that instinctive knowledge of what capabilities were in her. Her soul would walk in glorious sunlight if any man was worthy, by his power of loving, to win back her love. Even in her mourning she would rest with a peaceful faith upon his sympathy. His sympathy! Whose? That other man's. And that it was another was enough to make Mr. Thornton's pale grave face grow doubly wan and stern at Dixon's answer.\n\"I suppose I may call,\" said he coldly. \"On Mr. Hale, I mean. He will perhaps admit me after to-morrow or so.\"\nHe spoke as if the answer were a matter of indifference to him. But it was not so. For all his pain, he longed to see the author of it. Although he hated Margaret at times, when he thought of that gentle, familiar attitude and all the attendant circumstances, he had a restless desire to renew her picture in his mind--a longing for the very atmosphere she breathed. He was in the Charybdis of passion, and must perforce circle and circle ever nearer round the fatal centre.\n\"I dare say, sir, master will see you. He was very sorry to have to deny you the other day; but circumstances was not agreeable just then.\"\nFor some reason or other, Dixon never named this interview that she had had with Mr. Thornton to Margaret. It might have been mere chance, but so it was that Margaret never heard that he had attended her poor mother's funeral.",
        "paragraph_chars": [
            [
                0,
                143
            ],
            [
                143,
                1268
            ],
            [
                1268,
                1334
            ],
            [
                1334,
                1377
            ],
            [
                1377,
                1446
            ],
            [
                1446,
                1570
            ],
            [
                1570,
                1650
            ],
            [
                1650,
                1693
            ],
            [
                1693,
                2139
            ],
            [
                2139,
                2704
            ],
            [
                2704,
                3108
            ],
            [
                3108,
                3315
            ],
            [
                3315,
                3412
            ],
            [
                3412,
                3941
            ],
            [
                3941,
                6708
            ],
            [
                6708,
                7215
            ],
            [
                7215,
                7915
            ],
            [
                7915,
                8305
            ],
            [
                8305,
                8426
            ],
            [
                8426,
                8550
            ],
            [
                8550,
                10555
            ],
            [
                10555,
                10666
            ],
            [
                10666,
                11141
            ],
            [
                11141,
                11281
            ],
            [
                11281,
                11507
            ]
        ],
        "segment_chars": [
            [
                0,
                61
            ],
            [
                61,
                133
            ],
            [
                133,
                143
            ],
            [
                143,
                216
            ],
            [
                216,
                389
            ],
            [
                389,
                662
            ],
            [
                662,
                748
            ],
            [
                748,
                974
            ],
            [
                974,
                1143
            ],
            [
                1143,
                1268
            ],
            [
                1268,
                1334
            ],
            [
                1334,
                1361
            ],
            [
                1361,
                1377
            ],
            [
                1377,
                1446
            ],
            [
                1446,
                1521
            ],
            [
                1521,
                1540
            ],
            [
                1540,
                1570
            ],
            [
                1570,
                1601
            ],
            [
                1601,
                1650
            ],
            [
                1650,
                1656
            ],
            [
                1656,
                1693
            ],
            [
                1693,
                1737
            ],
            [
                1737,
                1851
            ],
            [
                1851,
                1922
            ],
            [
                1922,
                1997
            ],
            [
                1997,
                2038
            ],
            [
                2038,
                2049
            ],
            [
                2049,
                2086
            ],
            [
                2086,
                2139
            ],
            [
                2139,
                2164
            ],
            [
                2164,
                2181
            ],
            [
                2181,
                2281
            ],
            [
                2281,
                2704
            ],
            [
                2704,
                2800
            ],
            [
                2800,
                2862
            ],
            [
                2862,
                3068
            ],
            [
                3068,
                3108
            ],
            [
                3108,
                3155
            ],
            [
                3155,
                3191
            ],
            [
                3191,
                3315
            ],
            [
                3315,
                3412
            ],
            [
                3412,
                3426
            ],
            [
                3426,
                3519
            ],
            [
                3519,
                3597
            ],
            [
                3597,
                3645
            ],
            [
                3645,
                3941
            ],
            [
                3941,
                4064
            ],
            [
                4064,
                4210
            ],
            [
                4210,
                4321
            ],
            [
                4321,
                4579
            ],
            [
                4579,
                4671
            ],
            [
                4671,
                4773
            ],
            [
                4773,
                4963
            ],
            [
                4963,
                5250
            ],
            [
                5250,
                5350
            ],
            [
                5350,
                5561
            ],
            [
                5561,
                5779
            ],
            [
                5779,
                5951
            ],
            [
                5951,
                5999
            ],
            [
                5999,
                6108
            ],
            [
                6108,
                6253
            ],
            [
                6253,
                6345
            ],
            [
                6345,
                6458
            ],
            [
                6458,
                6489
            ],
            [
                6489,
                6504
            ],
            [
                6504,
                6534
            ],
            [
                6534,
                6565
            ],
            [
                6565,
                6590
            ],
            [
                6590,
                6621
            ],
            [
                6621,
                6675
            ],
            [
                6675,
                6708
            ],
            [
                6708,
                6899
            ],
            [
                6899,
                6972
            ],
            [
                6972,
                7215
            ],
            [
                7215,
                7419
            ],
            [
                7419,
                7585
            ],
            [
                7585,
                7611
            ],
            [
                7611,
                7915
            ],
            [
                7915,
                8153
            ],
            [
                8153,
                8174
            ],
            [
                8174,
                8305
            ],
            [
                8305,
                8364
            ],
            [
                8364,
                8384
            ],
            [
                8384,
                8426
            ],
            [
                8426,
                8443
            ],
            [
                8443,
                8479
            ],
            [
                8479,
                8510
            ],
            [
                8510,
                8550
            ],
            [
                8550,
                8630
            ],
            [
                8630,
                8961
            ],
            [
                8961,
                9192
            ],
            [
                9192,
                9215
            ],
            [
                9215,
                9242
            ],
            [
                9242,
                9488
            ],
            [
                9488,
                9525
            ],
            [
                9525,
                9808
            ],
            [
                9808,
                9866
            ],
            [
                9866,
                9917
            ],
            [
                9917,
                10079
            ],
            [
                10079,
                10084
            ],
            [
                10084,
                10112
            ],
            [
                10112,
                10210
            ],
            [
                10210,
                10320
            ],
            [
                10320,
                10397
            ],
            [
                10397,
                10411
            ],
            [
                10411,
                10418
            ],
            [
                10418,
                10436
            ],
            [
                10436,
                10555
            ],
            [
                10555,
                10595
            ],
            [
                10595,
                10617
            ],
            [
                10617,
                10666
            ],
            [
                10666,
                10730
            ],
            [
                10730,
                10749
            ],
            [
                10749,
                10802
            ],
            [
                10802,
                11033
            ],
            [
                11033,
                11141
            ],
            [
                11141,
                11180
            ],
            [
                11180,
                11281
            ],
            [
                11281,
                11388
            ],
            [
                11388,
                11507
            ]
        ],
        "overlap_chars": [
            [
                143,
                198
            ],
            [
                214,
                216
            ],
            [
                216,
                226
            ],
            [
                321,
                327
            ],
            [
                339,
                345
            ],
            [
                359,
                389
            ],
            [
                436,
                450
            ],
            [
                545,
                546
            ],
            [
                389,
                394
            ],
            [
                469,
                472
            ],
            [
                460,
                468
            ],
            [
                403,
                415
            ],
            [
                521,
                526
            ],
            [
                486,
                495
            ],
            [
                606,
                607
            ],
            [
                527,
                540
            ],
            [
                416,
                418
            ],
            [
                477,
                480
            ],
            [
                643,
                647
            ],
            [
                633,
                642
            ],
            [
                648,
                661
            ],
            [
                662,
                698
            ],
            [
                733,
                748
            ],
            [
                748,
                858
            ],
            [
                891,
                893
            ],
            [
                926,
                950
            ],
            [
                959,
                974
            ],
            [
                974,
                977
            ],
            [
                1041,
                1119
            ],
            [
                1134,
                1143
            ],
            [
                1143,
                1161
            ],
            [
                1170,
                1182
            ],
            [
                1203,
                1224
            ],
            [
                1233,
                1268
            ],
            [
                1269,
                1306
            ],
            [
                1319,
                1323
            ],
            [
                1307,
                1309
            ],
            [
                1332,
                1333
            ],
            [
                1381,
                1383
            ],
            [
                1402,
                1409
            ],
            [
                1420,
                1427
            ],
            [
                1447,
                1521
            ],
            [
                1521,
                1540
            ],
            [
                1540,
                1559
            ],
            [
                1574,
                1601
            ],
            [
                1601,
                1619
            ],
            [
                1622,
                1650
            ],
            [
                1651,
                1656
            ],
            [
                1656,
                1690
            ],
            [
                1694,
                1696
            ],
            [
                1737,
                1786
            ],
            [
                1717,
                1724
            ],
            [
                1793,
                1851
            ],
            [
                1851,
                1922
            ],
            [
                1922,
                1946
            ],
            [
                1975,
                1997
            ],
            [
                1997,
                2038
            ],
            [
                2038,
                2049
            ],
            [
                2049,
                2084
            ],
            [
                2139,
                2164
            ],
            [
                2164,
                2181
            ],
            [
                2181,
                2207
            ],
            [
                2216,
                2219
            ],
            [
                2245,
                2251
            ],
            [
                2208,
                2214
            ],
            [
                2279,
                2281
            ],
            [
                2281,
                2292
            ],
            [
                2302,
                2323
            ],
            [
                2347,
                2348
            ],
            [
                2402,
                2415
            ],
            [
                2344,
                2347
            ],
            [
                2438,
                2442
            ],
            [
                2490,
                2492
            ],
            [
                2424,
                2426
            ],
            [
                2431,
                2433
            ],
            [
                2349,
                2368
            ],
            [
                2480,
                2481
            ],
            [
                2535,
                2537
            ],
            [
                2497,
                2523
            ],
            [
                2543,
                2637
            ],
            [
                2538,
                2543
            ],
            [
                2645,
                2648
            ],
            [
                2298,
                2301
            ],
            [
                2680,
                2704
            ],
            [
                2704,
                2716
            ],
            [
                2725,
                2738
            ],
            [
                2761,
                2800
            ],
            [
                2800,
                2862
            ],
            [
                2862,
                2891
            ],
            [
                2897,
                2911
            ],
            [
                2892,
                2896
            ],
            [
                2912,
                2930
            ],
            [
                2943,
                3026
            ],
            [
                3033,
                3036
            ],
            [
                3040,
                3068
            ],
            [
                3068,
                3108
            ],
            [
                3109,
                3136
            ],
            [
                3145,
                3155
            ],
            [
                3156,
                3171
            ],
            [
                3173,
                3191
            ],
            [
                3191,
                3281
            ],
            [
                3287,
                3312
            ],
            [
                3316,
                3334
            ],
            [
                3348,
                3377
            ],
            [
                3380,
                3412
            ],
            [
                3413,
                3426
            ],
            [
                3426,
                3457
            ],
            [
                3517,
                3519
            ],
            [
                3519,
                3594
            ],
            [
                3597,
                3645
            ],
            [
                3645,
                3696
            ],
            [
                3719,
                3730
            ],
            [
                3744,
                3778
            ],
            [
                3804,
                3844
            ],
            [
                3870,
                3880
            ],
            [
                3853,
                3863
            ],
            [
                3914,
                3941
            ],
            [
                3941,
                4038
            ],
            [
                4048,
                4064
            ],
            [
                4064,
                4166
            ],
            [
                4208,
                4210
            ],
            [
                4250,
                4263
            ],
            [
                4290,
                4321
            ],
            [
                4579,
                4604
            ],
            [
                4474,
                4479
            ],
            [
                4515,
                4538
            ],
            [
                4605,
                4670
            ],
            [
                4671,
                4750
            ],
            [
                4771,
                4773
            ],
            [
                4773,
                4866
            ],
            [
                4877,
                4880
            ],
            [
                4961,
                4963
            ],
            [
                4963,
                4992
            ],
            [
                5027,
                5041
            ],
            [
                5052,
                5066
            ],
            [
                5078,
                5106
            ],
            [
                5126,
                5201
            ],
            [
                5206,
                5250
            ],
            [
                5250,
                5291
            ],
            [
                5306,
                5311
            ],
            [
                5315,
                5350
            ],
            [
                5350,
                5356
            ],
            [
                5363,
                5393
            ],
            [
                5403,
                5418
            ],
            [
                5480,
                5483
            ],
            [
                5542,
                5544
            ],
            [
                5545,
                5560
            ],
            [
                5999,
                6009
            ],
            [
                6025,
                6108
            ],
            [
                6108,
                6123
            ],
            [
                6124,
                6126
            ],
            [
                6142,
                6145
            ],
            [
                6224,
                6229
            ],
            [
                6168,
                6171
            ],
            [
                6181,
                6192
            ],
            [
                6237,
                6253
            ],
            [
                6253,
                6344
            ],
            [
                6435,
                6456
            ],
            [
                6345,
                6347
            ],
            [
                6423,
                6427
            ],
            [
                6456,
                6458
            ],
            [
                6458,
                6481
            ],
            [
                6487,
                6489
            ],
            [
                6489,
                6504
            ],
            [
                6534,
                6565
            ],
            [
                6565,
                6590
            ],
            [
                6590,
                6619
            ],
            [
                6708,
                6827
            ],
            [
                6874,
                6899
            ],
            [
                6899,
                6972
            ],
            [
                6972,
                7037
            ],
            [
                7065,
                7089
            ],
            [
                7185,
                7188
            ],
            [
                7094,
                7101
            ],
            [
                7134,
                7145
            ],
            [
                7213,
                7215
            ],
            [
                7403,
                7406
            ],
            [
                7260,
                7261
            ],
            [
                7215,
                7251
            ],
            [
                7319,
                7377
            ],
            [
                7417,
                7419
            ],
            [
                7419,
                7488
            ],
            [
                7494,
                7507
            ],
            [
                7509,
                7585
            ],
            [
                7585,
                7611
            ],
            [
                7611,
                7621
            ],
            [
                7644,
                7656
            ],
            [
                7622,
                7642
            ],
            [
                7669,
                7714
            ],
            [
                7727,
                7747
            ],
            [
                7764,
                7885
            ],
            [
                7913,
                7915
            ],
            [
                7915,
                7982
            ],
            [
                8025,
                8056
            ],
            [
                8087,
                8128
            ],
            [
                8138,
                8153
            ],
            [
                8153,
                8174
            ],
            [
                8174,
                8216
            ],
            [
                8218,
                8232
            ],
            [
                8234,
                8267
            ],
            [
                8278,
                8288
            ],
            [
                8300,
                8305
            ],
            [
                8306,
                8323
            ],
            [
                8326,
                8329
            ],
            [
                8331,
                8364
            ],
            [
                8364,
                8382
            ],
            [
                8427,
                8443
            ],
            [
                8443,
                8479
            ],
            [
                8479,
                8510
            ],
            [
                8510,
                8547
            ],
            [
                8550,
                8609
            ],
            [
                8614,
                8630
            ],
            [
                8630,
                8804
            ],
            [
                8805,
                8830
            ],
            [
                8837,
                8839
            ],
            [
                8854,
                8870
            ],
            [
                8872,
                8917
            ],
            [
                8959,
                8961
            ],
            [
                8961,
                9010
            ],
            [
                9102,
                9191
            ],
            [
                9193,
                9212
            ],
            [
                9215,
                9242
            ],
            [
                9242,
                9325
            ],
            [
                9341,
                9345
            ],
            [
                9346,
                9354
            ],
            [
                9329,
                9337
            ],
            [
                9365,
                9458
            ],
            [
                9468,
                9488
            ],
            [
                9496,
                9500
            ],
            [
                9505,
                9524
            ],
            [
                9525,
                9556
            ],
            [
                9567,
                9576
            ],
            [
                9599,
                9617
            ],
            [
                9632,
                9644
            ],
            [
                9654,
                9713
            ],
            [
                9727,
                9732
            ],
            [
                9746,
                9788
            ],
            [
                9790,
                9808
            ],
            [
                9808,
                9825
            ],
            [
                9830,
                9866
            ],
            [
                9871,
                9897
            ],
            [
                9917,
                9966
            ],
            [
                9999,
                10007
            ],
            [
                10019,
                10078
            ],
            [
                10079,
                10084
            ],
            [
                10084,
                10112
            ],
            [
                10112,
                10210
            ],
            [
                10210,
                10272
            ],
            [
                10298,
                10320
            ],
            [
                10320,
                10397
            ],
            [
                10397,
                10411
            ],
            [
                10411,
                10418
            ],
            [
                10418,
                10436
            ],
            [
                10436,
                10439
            ],
            [
                10479,
                10555
            ],
            [
                10556,
                10576
            ],
            [
                10579,
                10595
            ],
            [
                10596,
                10615
            ],
            [
                10666,
                10680
            ],
            [
                10692,
                10730
            ],
            [
                10730,
                10749
            ],
            [
                10749,
                10802
            ],
            [
                10802,
                10837
            ],
            [
                10924,
                10983
            ],
            [
                10985,
                11032
            ],
            [
                11142,
                11178
            ],
            [
                11281,
                11318
            ],
            [
                11325,
                11339
            ],
            [
                11357,
                11388
            ],
            [
                11388,
                11507
            ]
        ],
        "row_chars": [
            [
                0,
                61
            ],
            [
                61,
                133
            ],
            [
                133,
                143
            ],
            [
                143,
                216
            ],
            [
                216,
                389
            ],
            [
                389,
                662
            ],
            [
                662,
                748
            ],
            [
                748,
                974
            ],
            [
                974,
                1143
            ],
            [
                1143,
                1268
            ],
            [
                1268,
                1334
            ],
            [
                1334,
                1361
            ],
            [
                1361,
                1377
            ],
            [
                1377,
                1446
            ],
            [
                1446,
                1521
            ],
            [
                1521,
                1540
            ],
            [
                1540,
                1570
            ],
            [
                1570,
                1601
            ],
            [
                1601,
                1650
            ],
            [
                1650,
                1656
            ],
            [
                1656,
                1693
            ],
            [
                1693,
                1851
            ],
            [
                1851,
                1922
            ],
            [
                1922,
                1997
            ],
            [
                1997,
                2038
            ],
            [
                2038,
                2049
            ],
            [
                2049,
                2086
            ],
            [
                2086,
                2139
            ],
            [
                2139,
                2164
            ],
            [
                2164,
                2181
            ],
            [
                2181,
                2281
            ],
            [
                2281,
                2704
            ],
            [
                2704,
                2800
            ],
            [
                2800,
                2862
            ],
            [
                2862,
                3068
            ],
            [
                3068,
                3108
            ],
            [
                3108,
                3155
            ],
            [
                3155,
                3191
            ],
            [
                3191,
                3315
            ],
            [
                3315,
                3412
            ],
            [
                3412,
                3426
            ],
            [
                3426,
                3519
            ],
            [
                3519,
                3597
            ],
            [
                3597,
                3645
            ],
            [
                3645,
                3941
            ],
            [
                3941,
                4064
            ],
            [
                4064,
                4210
            ],
            [
                4210,
                4321
            ],
            [
                4321,
                4671
            ],
            [
                4671,
                4773
            ],
            [
                4773,
                4963
            ],
            [
                4963,
                5250
            ],
            [
                5250,
                5350
            ],
            [
                5350,
                5561
            ],
            [
                5561,
                5779
            ],
            [
                5779,
                5951
            ],
            [
                5951,
                5999
            ],
            [
                5999,
                6108
            ],
            [
                6108,
                6253
            ],
            [
                6253,
                6345
            ],
            [
                6345,
                6458
            ],
            [
                6458,
                6489
            ],
            [
                6489,
                6504
            ],
            [
                6504,
                6534
            ],
            [
                6534,
                6565
            ],
            [
                6565,
                6590
            ],
            [
                6590,
                6621
            ],
            [
                6621,
                6675
            ],
            [
                6675,
                6708
            ],
            [
                6708,
                6899
            ],
            [
                6899,
                6972
            ],
            [
                6972,
                7215
            ],
            [
                7215,
                7419
            ],
            [
                7419,
                7585
            ],
            [
                7585,
                7611
            ],
            [
                7611,
                7915
            ],
            [
                7915,
                8153
            ],
            [
                8153,
                8174
            ],
            [
                8174,
                8305
            ],
            [
                8305,
                8364
            ],
            [
                8364,
                8384
            ],
            [
                8384,
                8426
            ],
            [
                8426,
                8443
            ],
            [
                8443,
                8479
            ],
            [
                8479,
                8510
            ],
            [
                8510,
                8550
            ],
            [
                8550,
                8630
            ],
            [
                8630,
                8961
            ],
            [
                8961,
                9192
            ],
            [
                9192,
                9215
            ],
            [
                9215,
                9242
            ],
            [
                9242,
                9488
            ],
            [
                9488,
                9525
            ],
            [
                9525,
                9808
            ],
            [
                9808,
                9866
            ],
            [
                9866,
                9917
            ],
            [
                9917,
                10079
            ],
            [
                10079,
                10084
            ],
            [
                10084,
                10112
            ],
            [
                10112,
                10210
            ],
            [
                10210,
                10320
            ],
            [
                10320,
                10397
            ],
            [
                10397,
                10411
            ],
            [
                10411,
                10418
            ],
            [
                10418,
                10436
            ],
            [
                10436,
                10555
            ],
            [
                10555,
                10595
            ],
            [
                10595,
                10617
            ],
            [
                10617,
                10666
            ],
            [
                10666,
                10730
            ],
            [
                10730,
                10749
            ],
            [
                10749,
                10802
            ],
            [
                10802,
                11033
            ],
            [
                11033,
                11141
            ],
            [
                11141,
                11180
            ],
            [
                11180,
                11281
            ],
            [
                11281,
                11388
            ],
            [
                11388,
                11507
            ]
        ]
    },
    "abridged": {
        "text": "Home seemed unnaturally quiet after all this terror and noise. Her father sat in his usual chair, in one of his sad waking dreams. In the kitchen, Dixon was scolding Mary Higgins in an energetic, angry whisper, in deference to the dead one lying in the house.\nMargaret had resolved not to mention her fright to her father. There was no use in speaking about it; it had ended well; the only thing to be feared was lest Leonards should manage to follow Frederick to London, and hunt him out there. But that was unlikely; and Margaret determined not to torment herself by thinking of what she could not prevent. Frederick would be on his guard; and in a day or two he would be safely out of England.\n'I suppose we shall hear from Mr. Bell tomorrow,' she said to her father. 'He may be here tomorrow evening.'\n'If he cannot come, I shall ask Mr. Thornton to go with me to the funeral. I cannot go alone. I should break down.'\n'Don't ask Mr. Thornton, papa. Let me go with you,' said Margaret, impetuously.\n'You! My dear, women do not generally go.'\n'No: women of our class don't go, because they have no control over their emotions, and yet are ashamed of showing them. Poor women go, and don't care if they are seen overwhelmed with grief. But I promise you, papa, I will be no trouble. Don't have a stranger, and leave me out. Dear papa! if Mr. Bell cannot come, I shall go.'\nMr. Bell could not come. He had the gout. It was a most affectionate and regretful letter. He hoped to pay them a visit soon; his agent had told him that he needed to attend to his Milton property; otherwise he avoided coming near Milton, and now the only thing that would reconcile him to this necessary visit was the idea that he could see and comfort his old friend.\nMargaret had great difficulty in persuading her father not to invite Mr. Thornton. She had an indescribable repugnance to this step being taken. The night before the funeral, a stately note came from Mrs. Thornton, saying that, at her son's desire, their carriage should attend the funeral, if it was not disagreeable to the family. Margaret tossed the note to her father.\n'Oh, don't let us have these formalities,' said she. 'Let us go alone - you and me, papa. They don't care for us, or else he would have offered to go himself, and not have proposed sending an empty carriage.'\n'I thought you were averse to his going, Margaret,' said Mr. Hale in some surprise.\n'And so I am. I don't want him to come at all. But this seems such a mockery of mourning that I did not expect it from him.' She startled her father by bursting into tears. She had been so subdued in her grief, so thoughtful and patient, that he could not understand her. She seemed agitated and restless; and at her father's tenderness, she only cried the more.\nShe passed so bad a night that she was ill prepared for the additional anxiety caused by a letter from Frederick. Mr. Lennox was out of town; his clerk said that he would return by the following Tuesday at the latest. Therefore Frederick had decided to stay in London a day or two longer. Margaret might be assured that after their alarm at the railway station, he would take every precaution against being tracked by Leonards.\nMargaret was thankful that she received this letter while her father was absent. If he had been present, he would have expected her to read it aloud to him, and it would have worried him greatly. There was not merely the fact of Frederick's delay in London, but allusions to the recognition at Milton, and the possibility of a pursuit, which made her blood run cold; how then would it have affected her father? Many a time did Margaret repent of having urged the plan of consulting Mr. Lennox. At the time, it had seemed as if it would cause so little delay - and now it seemed so undesirable.\nHer father had forgotten that they had any reason to expect a letter from Frederick that morning. He was absorbed only in the coming funeral, and the final removal of his wife from his sight. He trembled pitifully as the undertaker's man was arranging his crape draperies around him.\n'Pray for me, Margaret,' he murmured. 'I have no strength left. I cannot pray. I try to bear it: indeed I do. I know it is God's will. But I cannot see why she died.'\nMargaret sat by him in the coach, almost supporting him in her arms; and repeating all the noble verses of holy comfort that she could remember. Her voice never faltered; and she herself gained strength by doing this. Her father's lips moved after her, repeating the well-known texts; it was terrible to see his patient struggle for resignation.\nAt the church, Margaret's fortitude nearly gave way when she noticed Nicholas Higgins and his daughter, standing a little aloof. Nicholas wore his usual fustian clothes, but had a bit of black stuff sewn round his hat - a mark of mourning which he had never shown to his daughter Bessy's memory. But Mr. Hale saw nothing. He went on mechanically repeating to himself all the funeral service as it was read by the clergyman; he sighed when all was ended; and then, putting his hand on Margaret's arm, he mutely entreated to be led away, as if he were blind.\nDixon sobbed aloud; she covered her face with her handkerchief, and did not perceive that the crowd was dispersing, till she was spoken to by someone close at hand. It was Mr. Thornton. He had been present all the time, standing with bent head behind a group of people, so that no one had seen him.\n'I beg your pardon - but can you tell me how Mr. Hale is? And Miss Hale, too?'\n'Of course, sir. They are much as is to be expected. Master is terribly broke down. Miss Hale bears up better than likely.'\nMr. Thornton would rather have heard that she was suffering natural sorrow. In the first place, there was selfishness enough in him to have taken pleasure in the idea that his great love might come in to comfort and console her; much the same kind of strange passionate pleasure which stings a mother's heart when her drooping infant nestles close to her. But this delicious vision of what might have been was miserably disturbed by the recollection of what he had seen near the Outwood station.\nMiserably disturbed! That is not strong enough. He was haunted by the remembrance of the handsome young man, with whom she stood in such a familiar attitude; and the remembrance shot through him like an agony, till it made him clench his hands tight to subdue the pain. So late, so far from home!\nIt took a great moral effort to rouse his trust in Margaret's pure maidenliness; as soon as the effort ceased, his trust dropped down dead: and wild fancies chased each other like dreams through his mind. Here was a little piece of miserable, gnawing confirmation. 'She bore up better than likely.' She had then some hope to look to, so bright that it could lighten the dark hours of a daughter newly made motherless.\nYes! he knew how she would love. He had not loved her without gaining that instinctive knowledge of what capabilities were in her. Her soul would walk in glorious sunlight if any man was worthy to win back her love. Even in her mourning she would rest with a peaceful faith upon his sympathy. His sympathy! Whose? That other man's. And Mr. Thornton's pale grave face grow doubly wan and stern at Dixon's answer.\n'I suppose I may call,' said he coldly. 'On Mr. Hale, I mean.'\nHe spoke as if it were a matter of indifference to him. But it was not so. For all his pain, he longed to see the author of it. Although he hated Margaret at times, he had a restless desire to renew her picture in his mind - a longing for the very atmosphere she breathed.\n'I dare say, sir, master will see you.'\nFor some reason or other, Dixon never mentioned this interview with Mr. Thornton to Margaret. It might have been mere chance, but so it was that Margaret never heard that he had attended her poor mother's funeral.",
        "paragraph_chars": [
            [
                0,
                260
            ],
            [
                260,
                697
            ],
            [
                697,
                806
            ],
            [
                806,
                922
            ],
            [
                922,
                1002
            ],
            [
                1002,
                1045
            ],
            [
                1045,
                1374
            ],
            [
                1374,
                1744
            ],
            [
                1744,
                2117
            ],
            [
                2117,
                2326
            ],
            [
                2326,
                2410
            ],
            [
                2410,
                2773
            ],
            [
                2773,
                3201
            ],
            [
                3201,
                3795
            ],
            [
                3795,
                4079
            ],
            [
                4079,
                4246
            ],
            [
                4246,
                4592
            ],
            [
                4592,
                5149
            ],
            [
                5149,
                5448
            ],
            [
                5448,
                5527
            ],
            [
                5527,
                5651
            ],
            [
                5651,
                6147
            ],
            [
                6147,
                6444
            ],
            [
                6444,
                6862
            ],
            [
                6862,
                7274
            ],
            [
                7274,
                7337
            ],
            [
                7337,
                7610
            ],
            [
                7610,
                7650
            ],
            [
                7650,
                7863
            ]
        ],
        "segment_chars": [
            [
                0,
                63
            ],
            [
                63,
                131
            ],
            [
                131,
                260
            ],
            [
                260,
                323
            ],
            [
                323,
                496
            ],
            [
                496,
                609
            ],
            [
                609,
                697
            ],
            [
                697,
                771
            ],
            [
                771,
                806
            ],
            [
                806,
                881
            ],
            [
                881,
                900
            ],
            [
                900,
                922
            ],
            [
                922,
                953
            ],
            [
                953,
                1002
            ],
            [
                1002,
                1008
            ],
            [
                1008,
                1045
            ],
            [
                1045,
                1166
            ],
            [
                1166,
                1237
            ],
            [
                1237,
                1284
            ],
            [
                1284,
                1325
            ],
            [
                1325,
                1336
            ],
            [
                1336,
                1374
            ],
            [
                1374,
                1399
            ],
            [
                1399,
                1416
            ],
            [
                1416,
                1465
            ],
            [
                1465,
                1744
            ],
            [
                1744,
                1827
            ],
            [
                1827,
                1889
            ],
            [
                1889,
                2077
            ],
            [
                2077,
                2117
            ],
            [
                2117,
                2170
            ],
            [
                2170,
                2207
            ],
            [
                2207,
                2326
            ],
            [
                2326,
                2410
            ],
            [
                2410,
                2424
            ],
            [
                2424,
                2457
            ],
            [
                2457,
                2535
            ],
            [
                2535,
                2583
            ],
            [
                2583,
                2682
            ],
            [
                2682,
                2773
            ],
            [
                2773,
                2887
            ],
            [
                2887,
                2991
            ],
            [
                2991,
                3062
            ],
            [
                3062,
                3201
            ],
            [
                3201,
                3282
            ],
            [
                3282,
                3397
            ],
            [
                3397,
                3612
            ],
            [
                3612,
                3695
            ],
            [
                3695,
                3795
            ],
            [
                3795,
                3893
            ],
            [
                3893,
                3987
            ],
            [
                3987,
                4079
            ],
            [
                4079,
                4117
            ],
            [
                4117,
                4143
            ],
            [
                4143,
                4158
            ],
            [
                4158,
                4189
            ],
            [
                4189,
                4214
            ],
            [
                4214,
                4246
            ],
            [
                4246,
                4391
            ],
            [
                4391,
                4464
            ],
            [
                4464,
                4592
            ],
            [
                4592,
                4721
            ],
            [
                4721,
                4888
            ],
            [
                4888,
                4914
            ],
            [
                4914,
                5149
            ],
            [
                5149,
                5314
            ],
            [
                5314,
                5335
            ],
            [
                5335,
                5448
            ],
            [
                5448,
                5506
            ],
            [
                5506,
                5527
            ],
            [
                5527,
                5544
            ],
            [
                5544,
                5580
            ],
            [
                5580,
                5611
            ],
            [
                5611,
                5651
            ],
            [
                5651,
                5727
            ],
            [
                5727,
                6007
            ],
            [
                6007,
                6147
            ],
            [
                6147,
                6168
            ],
            [
                6168,
                6195
            ],
            [
                6195,
                6417
            ],
            [
                6417,
                6444
            ],
            [
                6444,
                6649
            ],
            [
                6649,
                6709
            ],
            [
                6709,
                6743
            ],
            [
                6743,
                6862
            ],
            [
                6862,
                6867
            ],
            [
                6867,
                6895
            ],
            [
                6895,
                6993
            ],
            [
                6993,
                7078
            ],
            [
                7078,
                7155
            ],
            [
                7155,
                7169
            ],
            [
                7169,
                7176
            ],
            [
                7176,
                7194
            ],
            [
                7194,
                7274
            ],
            [
                7274,
                7314
            ],
            [
                7314,
                7337
            ],
            [
                7337,
                7393
            ],
            [
                7393,
                7412
            ],
            [
                7412,
                7465
            ],
            [
                7465,
                7610
            ],
            [
                7610,
                7650
            ],
            [
                7650,
                7744
            ],
            [
                7744,
                7863
            ]
        ],
        "overlap_chars": [
            [
                0,
                55
            ],
            [
                61,
                63
            ],
            [
                63,
                73
            ],
            [
                78,
                84
            ],
            [
                91,
                97
            ],
            [
                101,
                131
            ],
            [
                131,
                145
            ],
            [
                145,
                146
            ],
            [
                147,
                152
            ],
            [
                153,
                156
            ],
            [
                157,
                165
            ],
            [
                166,
                178
            ],
            [
                179,
                184
            ],
            [
                185,
                194
            ],
            [
                194,
                195
            ],
            [
                196,
                209
            ],
            [
                224,
                226
            ],
            [
                227,
                230
            ],
            [
                231,
                235
            ],
            [
                236,
                245
            ],
            [
                246,
                259
            ],
            [
                260,
                296
            ],
            [
                308,
                323
            ],
            [
                323,
                433
            ],
            [
                441,
                443
            ],
            [
                451,
                475
            ],
            [
                481,
                496
            ],
            [
                496,
                499
            ],
            [
                517,
                595
            ],
            [
                600,
                609
            ],
            [
                609,
                627
            ],
            [
                628,
                640
            ],
            [
                640,
                661
            ],
            [
                662,
                697
            ],
            [
                698,
                735
            ],
            [
                751,
                755
            ],
            [
                756,
                758
            ],
            [
                769,
                770
            ],
            [
                772,
                774
            ],
            [
                779,
                786
            ],
            [
                796,
                803
            ],
            [
                807,
                881
            ],
            [
                881,
                900
            ],
            [
                900,
                919
            ],
            [
                926,
                953
            ],
            [
                953,
                971
            ],
            [
                974,
                1002
            ],
            [
                1003,
                1008
            ],
            [
                1008,
                1042
            ],
            [
                1046,
                1048
            ],
            [
                1050,
                1099
            ],
            [
                1100,
                1107
            ],
            [
                1108,
                1166
            ],
            [
                1166,
                1237
            ],
            [
                1237,
                1261
            ],
            [
                1262,
                1284
            ],
            [
                1284,
                1325
            ],
            [
                1325,
                1336
            ],
            [
                1336,
                1371
            ],
            [
                1374,
                1399
            ],
            [
                1399,
                1416
            ],
            [
                1416,
                1442
            ],
            [
                1443,
                1446
            ],
            [
                1447,
                1453
            ],
            [
                1457,
                1463
            ],
            [
                1463,
                1465
            ],
            [
                1465,
                1476
            ],
            [
                1477,
                1498
            ],
            [
                1498,
                1499
            ],
            [
                1500,
                1513
            ],
            [
                1519,
                1522
            ],
            [
                1523,
                1527
            ],
            [
                1528,
                1530
            ],
            [
                1538,
                1540
            ],
            [
                1548,
                1550
            ],
            [
                1551,
                1570
            ],
            [
                1570,
                1571
            ],
            [
                1582,
                1584
            ],
            [
                1585,
                1611
            ],
            [
                1611,
                1705
            ],
            [
                1706,
                1711
            ],
            [
                1712,
                1715
            ],
            [
                1716,
                1719
            ],
            [
                1720,
                1744
            ],
            [
                1744,
                1756
            ],
            [
                1763,
                1776
            ],
            [
                1788,
                1827
            ],
            [
                1827,
                1889
            ],
            [
                1889,
                1918
            ],
            [
                1919,
                1933
            ],
            [
                1934,
                1938
            ],
            [
                1939,
                1957
            ],
            [
                1957,
                2040
            ],
            [
                2045,
                2048
            ],
            [
                2049,
                2077
            ],
            [
                2077,
                2117
            ],
            [
                2118,
                2145
            ],
            [
                2160,
                2170
            ],
            [
                2171,
                2186
            ],
            [
                2189,
                2207
            ],
            [
                2207,
                2297
            ],
            [
                2298,
                2323
            ],
            [
                2327,
                2345
            ],
            [
                2346,
                2375
            ],
            [
                2378,
                2410
            ],
            [
                2411,
                2424
            ],
            [
                2424,
                2455
            ],
            [
                2455,
                2457
            ],
            [
                2457,
                2532
            ],
            [
                2535,
                2583
            ],
            [
                2583,
                2634
            ],
            [
                2635,
                2646
            ],
            [
                2646,
                2680
            ],
            [
                2682,
                2722
            ],
            [
                2723,
                2733
            ],
            [
                2736,
                2746
            ],
            [
                2746,
                2773
            ],
            [
                2773,
                2870
            ],
            [
                2871,
                2887
            ],
            [
                2887,
                2989
            ],
            [
                2989,
                2991
            ],
            [
                3001,
                3014
            ],
            [
                3031,
                3062
            ],
            [
                3062,
                3087
            ],
            [
                3105,
                3110
            ],
            [
                3111,
                3134
            ],
            [
                3135,
                3200
            ],
            [
                3201,
                3280
            ],
            [
                3280,
                3282
            ],
            [
                3282,
                3375
            ],
            [
                3384,
                3387
            ],
            [
                3395,
                3397
            ],
            [
                3397,
                3426
            ],
            [
                3427,
                3441
            ],
            [
                3448,
                3462
            ],
            [
                3463,
                3491
            ],
            [
                3492,
                3567
            ],
            [
                3568,
                3612
            ],
            [
                3612,
                3653
            ],
            [
                3654,
                3659
            ],
            [
                3660,
                3695
            ],
            [
                3695,
                3701
            ],
            [
                3706,
                3736
            ],
            [
                3743,
                3758
            ],
            [
                3761,
                3764
            ],
            [
                3769,
                3771
            ],
            [
                3779,
                3794
            ],
            [
                3795,
                3805
            ],
            [
                3810,
                3893
            ],
            [
                3893,
                3908
            ],
            [
                3914,
                3916
            ],
            [
                3917,
                3920
            ],
            [
                3935,
                3940
            ],
            [
                3941,
                3944
            ],
            [
                3959,
                3970
            ],
            [
                3971,
                3987
            ],
            [
                3987,
                4078
            ],
            [
                4080,
                4101
            ],
            [
                4104,
                4106
            ],
            [
                4107,
                4111
            ],
            [
                4115,
                4117
            ],
            [
                4118,
                4141
            ],
            [
                4141,
                4143
            ],
            [
                4143,
                4158
            ],
            [
                4158,
                4189
            ],
            [
                4189,
                4214
            ],
            [
                4214,
                4243
            ],
            [
                4246,
                4365
            ],
            [
                4366,
                4391
            ],
            [
                4391,
                4464
            ],
            [
                4464,
                4529
            ],
            [
                4529,
                4553
            ],
            [
                4554,
                4557
            ],
            [
                4558,
                4565
            ],
            [
                4579,
                4590
            ],
            [
                4590,
                4592
            ],
            [
                4595,
                4598
            ],
            [
                4605,
                4606
            ],
            [
                4607,
                4643
            ],
            [
                4661,
                4719
            ],
            [
                4719,
                4721
            ],
            [
                4721,
                4790
            ],
            [
                4796,
                4809
            ],
            [
                4812,
                4888
            ],
            [
                4888,
                4914
            ],
            [
                4914,
                4924
            ],
            [
                4925,
                4937
            ],
            [
                4938,
                4958
            ],
            [
                4959,
                5004
            ],
            [
                5005,
                5025
            ],
            [
                5026,
                5147
            ],
            [
                5147,
                5149
            ],
            [
                5149,
                5216
            ],
            [
                5217,
                5248
            ],
            [
                5249,
                5290
            ],
            [
                5299,
                5314
            ],
            [
                5314,
                5335
            ],
            [
                5335,
                5377
            ],
            [
                5378,
                5392
            ],
            [
                5393,
                5426
            ],
            [
                5427,
                5437
            ],
            [
                5443,
                5448
            ],
            [
                5449,
                5466
            ],
            [
                5469,
                5472
            ],
            [
                5473,
                5506
            ],
            [
                5506,
                5524
            ],
            [
                5528,
                5544
            ],
            [
                5544,
                5580
            ],
            [
                5580,
                5611
            ],
            [
                5611,
                5648
            ],
            [
                5651,
                5710
            ],
            [
                5711,
                5727
            ],
            [
                5727,
                5901
            ],
            [
                5910,
                5935
            ],
            [
                5936,
                5938
            ],
            [
                5943,
                5959
            ],
            [
                5960,
                6005
            ],
            [
                6005,
                6007
            ],
            [
                6007,
                6056
            ],
            [
                6057,
                6146
            ],
            [
                6147,
                6166
            ],
            [
                6168,
                6195
            ],
            [
                6195,
                6278
            ],
            [
                6279,
                6283
            ],
            [
                6286,
                6294
            ],
            [
                6295,
                6303
            ],
            [
                6303,
                6396
            ],
            [
                6397,
                6417
            ],
            [
                6420,
                6424
            ],
            [
                6424,
                6443
            ],
            [
                6444,
                6475
            ],
            [
                6482,
                6491
            ],
            [
                6492,
                6510
            ],
            [
                6511,
                6523
            ],
            [
                6523,
                6582
            ],
            [
                6582,
                6587
            ],
            [
                6588,
                6630
            ],
            [
                6631,
                6649
            ],
            [
                6649,
                6666
            ],
            [
                6673,
                6709
            ],
            [
                6714,
                6740
            ],
            [
                6743,
                6792
            ],
            [
                6793,
                6801
            ],
            [
                6802,
                6861
            ],
            [
                6862,
                6867
            ],
            [
                6867,
                6895
            ],
            [
                6895,
                6993
            ],
            [
                6993,
                7055
            ],
            [
                7056,
                7078
            ],
            [
                7078,
                7155
            ],
            [
                7155,
                7169
            ],
            [
                7169,
                7176
            ],
            [
                7176,
                7194
            ],
            [
                7194,
                7197
            ],
            [
                7198,
                7274
            ],
            [
                7275,
                7295
            ],
            [
                7298,
                7314
            ],
            [
                7315,
                7334
            ],
            [
                7337,
                7351
            ],
            [
                7355,
                7393
            ],
            [
                7393,
                7412
            ],
            [
                7412,
                7465
            ],
            [
                7465,
                7500
            ],
            [
                7500,
                7559
            ],
            [
                7562,
                7609
            ],
            [
                7611,
                7647
            ],
            [
                7650,
                7687
            ],
            [
                7698,
                7712
            ],
            [
                7713,
                7744
            ],
            [
                7744,
                7863
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                63
            ],
            [
                63,
                131
            ],
            [
                131,
                260
            ],
            [
                260,
                323
            ],
            [
                323,
                496
            ],
            [
                496,
                609
            ],
            [
                609,
                697
            ],
            [
                697,
                771
            ],
            [
                771,
                771
            ],
            [
                771,
                771
            ],
            [
                771,
                806
            ],
            [
                806,
                881
            ],
            [
                881,
                900
            ],
            [
                900,
                922
            ],
            [
                922,
                953
            ],
            [
                953,
                1002
            ],
            [
                1002,
                1008
            ],
            [
                1008,
                1045
            ],
            [
                1045,
                1166
            ],
            [
                1166,
                1237
            ],
            [
                1237,
                1284
            ],
            [
                1284,
                1325
            ],
            [
                1325,
                1336
            ],
            [
                1336,
                1374
            ],
            [
                1374,
                1374
            ],
            [
                1374,
                1399
            ],
            [
                1399,
                1416
            ],
            [
                1416,
                1465
            ],
            [
                1465,
                1744
            ],
            [
                1744,
                1827
            ],
            [
                1827,
                1889
            ],
            [
                1889,
                2077
            ],
            [
                2077,
                2117
            ],
            [
                2117,
                2170
            ],
            [
                2170,
                2207
            ],
            [
                2207,
                2326
            ],
            [
                2326,
                2410
            ],
            [
                2410,
                2424
            ],
            [
                2424,
                2457
            ],
            [
                2457,
                2535
            ],
            [
                2535,
                2583
            ],
            [
                2583,
                2773
            ],
            [
                2773,
                2887
            ],
            [
                2887,
                2991
            ],
            [
                2991,
                3062
            ],
            [
                3062,
                3201
            ],
            [
                3201,
                3282
            ],
            [
                3282,
                3397
            ],
            [
                3397,
                3612
            ],
            [
                3612,
                3695
            ],
            [
                3695,
                3795
            ],
            [
                3795,
                3795
            ],
            [
                3795,
                3795
            ],
            [
                3795,
                3795
            ],
            [
                3795,
                3893
            ],
            [
                3893,
                3987
            ],
            [
                3987,
                4079
            ],
            [
                4079,
                4117
            ],
            [
                4117,
                4143
            ],
            [
                4143,
                4158
            ],
            [
                4158,
                4158
            ],
            [
                4158,
                4189
            ],
            [
                4189,
                4214
            ],
            [
                4214,
                4246
            ],
            [
                4246,
                4246
            ],
            [
                4246,
                4246
            ],
            [
                4246,
                4391
            ],
            [
                4391,
                4464
            ],
            [
                4464,
                4592
            ],
            [
                4592,
                4721
            ],
            [
                4721,
                4888
            ],
            [
                4888,
                4914
            ],
            [
                4914,
                5149
            ],
            [
                5149,
                5314
            ],
            [
                5314,
                5335
            ],
            [
                5335,
                5448
            ],
            [
                5448,
                5506
            ],
            [
                5506,
                5527
            ],
            [
                5527,
                5527
            ],
            [
                5527,
                5544
            ],
            [
                5544,
                5580
            ],
            [
                5580,
                5611
            ],
            [
                5611,
                5651
            ],
            [
                5651,
                5727
            ],
            [
                5727,
                6007
            ],
            [
                6007,
                6147
            ],
            [
                6147,
                6168
            ],
            [
                6168,
                6195
            ],
            [
                6195,
                6417
            ],
            [
                6417,
                6444
            ],
            [
                6444,
                6649
            ],
            [
                6649,
                6709
            ],
            [
                6709,
                6743
            ],
            [
                6743,
                6862
            ],
            [
                6862,
                6867
            ],
            [
                6867,
                6895
            ],
            [
                6895,
                6993
            ],
            [
                6993,
                7078
            ],
            [
                7078,
                7155
            ],
            [
                7155,
                7169
            ],
            [
                7169,
                7176
            ],
            [
                7176,
                7194
            ],
            [
                7194,
                7274
            ],
            [
                7274,
                7314
            ],
            [
                7314,
                7337
            ],
            [
                7337,
                7337
            ],
            [
                7337,
                7393
            ],
            [
                7393,
                7412
            ],
            [
                7412,
                7465
            ],
            [
                7465,
                7610
            ],
            [
                7610,
                7610
            ],
            [
                7610,
                7650
            ],
            [
                7650,
                7650
            ],
            [
                7650,
                7744
            ],
            [
                7744,
                7863
            ]
        ]
    }
}