{
    "original": {
        "text": "\"Truth will fail thee never, never! Though thy bark be tempest-driven, Though each plank be rent and riven, Truth will bear thee on for ever!\" ANON.\nThe \"bearing up better than likely\" was a terrible strain upon Margaret. Sometimes she thought she must give way, and cry out with pain, as the sudden sharp thought came across her, even during her apparently cheerful conversations with her father, that she had no longer a mother. About Frederick, too, there was great uneasiness. The Sunday post intervened, and interfered with their London letters; and on Tuesday Margaret was surprised and disheartened to find that there was still no letter. She was quite in the dark as to his plans, and her father was miserable at all this uncertainty. It broke in upon his lately acquired habit of sitting still in one easy chair for half a day together. He kept pacing up and down the room; then out of it; and she heard him upon the landing opening and shutting the bed-room doors, without any apparent object. She tried to tranquillise him by reading aloud; but it was evident he could not listen for long together. How thankful she was then, that she had kept to herself the additional cause for anxiety produced by their encounter with Leonards. She was thankful to hear Mr. Thornton announced. His visit would force her father's thoughts into another channel.\nHe came up straight to her father, whose hands he took and wrung without a word--holding them in his for a minute or two, during which time his face, his eyes, his look, told of more sympathy than could be put into words. Then he turned to Margaret. Not \"better than likely\" did she look. Her stately beauty was dimmed with much watching and with many tears. The expression on her countenance was of gentle patient sadness--nay of positive present suffering. He had not meant to greet her otherwise than with his late studied coldness of demeanour; but he could not help going up to her, as she stood a little aside, rendered timid by the uncertainty of his manner of late, and saying the few necessary common-place words in so tender a voice, that her eyes filled with tears, and she turned away to hide her emotion. She took her work and sate down very quiet and silent. Mr. Thornton's heart beat quick and strong, and for the time he utterly forgot the Outwood lane. He tried to talk to Mr. Hale: and--his presence always a certain kind of pleasure to Mr. Hale, as his power and decision made him, and his opinions, a safe, sure port--was unusually agreeable to her father, as Margaret saw.\nPresently Dixon came to the door and said, \"Miss Hale, you are wanted.\"\nDixon's manner was so flurried that Margaret turned sick at heart. Something had happened to Fred. She had no doubt of that. It was well that her father and Mr. Thornton were so much occupied by their conversation.\n\"What is it, Dixon?\" asked Margaret, the moment she had shut the drawing-room door.\n\"Come this way, miss,\" said Dixon, opening the door of what had been Mrs. Hale's bed-chamber, now Margaret's, for her father refused to sleep there again after his wife's death. \"It's nothing, miss,\" said Dixon, choking a little. \"Only a police-inspector. He wants to see you, miss. But I dare say, it's about nothing at all.\"\n\"Did he name--\" asked Margaret, almost inaudibly.\n\"No, miss; he named nothing. He only asked if you lived here, and if he could speak to you. Martha went to the door, and let him in; she has shown him into master's study. I went to him myself, to try if that would do; but no--it's you, miss, he wants.\"\nMargaret did not speak again till her hand was on the lock of the study door. Here she turned round and said, \"Take care papa does not come down. Mr. Thornton is with him now.\"\nThe inspector was almost daunted by the haughtiness of her manner as she entered. There was something of indignation expressed in her countenance, but so kept down and controlled, that it gave her a superb air of disdain. There was no surprise, no curiosity. She stood awaiting the opening of his business there. Not a question did she ask.\n\"I beg your pardon, ma'am, but my duty obliges me to ask you a few plain questions. A man has died at the Infirmary, in consequence of a fall, received at Outwood station, between the hours of five and six on Thursday evening, the twenty-sixth instant. At the time, this fall did not seem of much consequence; but it was rendered fatal, the doctors say, by the presence of some internal complaint, and the man's own habit of drinking.\"\nThe large dark eyes, gazing straight into the inspector's face, dilated a little. Otherwise there was no motion perceptible to his experienced observation. Her lips swelled out into a richer curve than ordinary, owing to the enforced tension of the muscles, but he did not know what was their usual appearance, so as to recognise the unwonted sullen defiance of the firm sweeping lines. She never blenched or trembled. She fixed him with her eye. Now--as he paused before going on, she said, almost as if she would encourage him in telling his tale--\"Well--go on!\"\n\"It is supposed that an inquest will have to be held; there is some slight evidence to prove that the blow, or push, or scuffle that caused the fall, was provoked by this poor fellow's half-tipsy impertinence to a young lady, walking with the man who pushed the deceased over the edge of the platform. This much was observed by some one on the platform, who, however, thought no more about the matter, as the blow seemed of slight consequence. There is also some reason to identify the lady with yourself; in which case--\"\n\"I was not there,\" said Margaret, still keeping her expressionless eyes fixed on his face, with the unconscious look of a sleep-walker.\nThe inspector bowed but did not speak. The lady standing before him showed no emotion, no fluttering fear, no anxiety, no desire to end the interview. The information he had received was very vague; one of the porters, rushing out to be in readiness for the train, had seen a scuffle, at the other end of the platform, between Leonards and a gentleman accompanied by a lady, but heard no noise; and before the train had got to its full speed after starting, he had been almost knocked down by the headlong run of the enraged half-intoxicated Leonards, swearing and cursing awfully. He had not thought any more about it, till his evidence was routed out by the inspector, who, on making some farther inquiry at the railroad station, had heard from the station-master that a young lady and gentleman had been there about that hour--the lady remarkably handsome--and said, by some grocer's assistant present at the time, to be a Miss Hale, living at Crampton, whose family dealt at his shop. There was no certainty that the one lady and gentleman were identical with the other pair, but there was great probability. Leonards himself had gone, half-mad with rage and pain, to the nearest gin-palace for comfort; and his tipsy words had not been attended to by the busy waiters there; they, however, remembered his starting up and cursing himself for not having sooner thought of the electric telegraph, for some purpose unknown; and they believed that he left with the idea of going there. On his way, overcome by pain or drink, he had lain down in the road, where the police had found him and taken him to the Infirmary: there he had never recovered sufficient consciousness to give any distinct account of his fall, although once or twice he had had glimmerings of sense sufficient to make the authorities send for the nearest magistrate, in hopes that he might be able to take down the dying man's deposition of the cause of his death. But when the magistrate had come, he was rambling about being at sea, and mixing up names of captains and lieutenants in an indistinct manner with those of his fellow porters at the railway; and his last words were a curse on the \"Cornish trick\" which had, he said, made him a hundred pounds poorer than he ought to have been. The inspector ran all this over in his mind--the vagueness of the evidence to prove that Margaret had been at the station--the unflinching, calm denial which she gave to such a supposition. She stood awaiting his next word with a composure that appeared supreme.\n\"Then, madam, I have your denial that you were the lady accompanying the gentleman who struck the blow, or gave the push, which caused the death of this poor man?\"\nA quick, sharp pain went through Margaret's brain. \"Oh God! that I knew Frederick were safe!\" A deep observer of human countenances might have seen the momentary agony shoot out of her great gloomy eyes, like the torture of some creature brought to bay. But the inspector though a very keen, was not a very deep observer. He was a little struck, notwithstanding, by the form of the answer, which sounded like a mechanical repetition of her first reply--not changed and modified in shape so as to meet his last question.\n\"I was not there,\" said she, slowly and heavily. And all this time she never closed her eyes, or ceased from that glassy, dream-like stare. His quick suspicions were aroused by this dull echo of her former denial. It was as if she had forced herself to one untruth, and had been stunned out of all power of varying it.\nHe put up his book of notes in a very deliberate manner. Then he looked up; she had not moved any more than if she had been some great Egyptian statue.\n\"I hope you will not think me impertinent when I say, that I may have to call on you again. I may have to summon you to appear on the inquest, and prove an alibi, if my witnesses\" (it was but one who had recognised her) \"persist in deposing to your presence at the unfortunate event.\" He looked at her sharply. She was still perfectly quiet--no change of colour, or darker shadow of guilt, on her proud face. He thought to have seen her wince: he did not know Margaret Hale. He was a little abashed by her real composure. It must have been a mistake of identity. He went on:\n\"It is very unlikely, ma'am, that I shall have to do anything of the kind. I hope you will excuse me for doing what is only my duty, although it may appear impertinent.\"\nMargaret bowed her head as he went towards the door. Her lips were stiff and dry. She could not speak even the common words of farewell. But suddenly she walked forwards, and opened the study door, and preceded him to the door of the house, which she threw wide open for his exit. She kept her eyes upon him in the same dull, fixed manner, until he was fairly out of the house. She shut the door, and went half-way into the study; then turned back, as if moved by some passionate impulse, and locked the door inside.\nThen she went into the study, paused--tottered forward--paused again--swayed for an instant where she stood, and fell prone on the floor in a dead swoon.",
        "paragraph_chars": [
            [
                0,
                149
            ],
            [
                149,
                1357
            ],
            [
                1357,
                2551
            ],
            [
                2551,
                2623
            ],
            [
                2623,
                2838
            ],
            [
                2838,
                2922
            ],
            [
                2922,
                3249
            ],
            [
                3249,
                3299
            ],
            [
                3299,
                3553
            ],
            [
                3553,
                3730
            ],
            [
                3730,
                4071
            ],
            [
                4071,
                4507
            ],
            [
                4507,
                5072
            ],
            [
                5072,
                5595
            ],
            [
                5595,
                5731
            ],
            [
                5731,
                8256
            ],
            [
                8256,
                8420
            ],
            [
                8420,
                8940
            ],
            [
                8940,
                9259
            ],
            [
                9259,
                9411
            ],
            [
                9411,
                9986
            ],
            [
                9986,
                10156
            ],
            [
                10156,
                10673
            ],
            [
                10673,
                10826
            ]
        ],
        "segment_chars": [
            [
                0,
                36
            ],
            [
                36,
                143
            ],
            [
                143,
                149
            ],
            [
                149,
                222
            ],
            [
                222,
                431
            ],
            [
                431,
                481
            ],
            [
                481,
                646
            ],
            [
                646,
                743
            ],
            [
                743,
                846
            ],
            [
                846,
                1004
            ],
            [
                1004,
                1110
            ],
            [
                1110,
                1242
            ],
            [
                1242,
                1291
            ],
            [
                1291,
                1357
            ],
            [
                1357,
                1579
            ],
            [
                1579,
                1607
            ],
            [
                1607,
                1646
            ],
            [
                1646,
                1716
            ],
            [
                1716,
                1816
            ],
            [
                1816,
                2175
            ],
            [
                2175,
                2230
            ],
            [
                2230,
                2327
            ],
            [
                2327,
                2551
            ],
            [
                2551,
                2623
            ],
            [
                2623,
                2690
            ],
            [
                2690,
                2722
            ],
            [
                2722,
                2748
            ],
            [
                2748,
                2838
            ],
            [
                2838,
                2859
            ],
            [
                2859,
                2922
            ],
            [
                2922,
                3100
            ],
            [
                3100,
                3152
            ],
            [
                3152,
                3178
            ],
            [
                3178,
                3205
            ],
            [
                3205,
                3249
            ],
            [
                3249,
                3299
            ],
            [
                3299,
                3328
            ],
            [
                3328,
                3391
            ],
            [
                3391,
                3471
            ],
            [
                3471,
                3553
            ],
            [
                3553,
                3631
            ],
            [
                3631,
                3699
            ],
            [
                3699,
                3730
            ],
            [
                3730,
                3812
            ],
            [
                3812,
                3952
            ],
            [
                3952,
                3989
            ],
            [
                3989,
                4043
            ],
            [
                4043,
                4071
            ],
            [
                4071,
                4155
            ],
            [
                4155,
                4324
            ],
            [
                4324,
                4507
            ],
            [
                4507,
                4589
            ],
            [
                4589,
                4663
            ],
            [
                4663,
                4894
            ],
            [
                4894,
                4926
            ],
            [
                4926,
                4954
            ],
            [
                4954,
                5072
            ],
            [
                5072,
                5374
            ],
            [
                5374,
                5516
            ],
            [
                5516,
                5595
            ],
            [
                5595,
                5731
            ],
            [
                5731,
                5770
            ],
            [
                5770,
                5882
            ],
            [
                5882,
                6313
            ],
            [
                6313,
                6720
            ],
            [
                6720,
                6844
            ],
            [
                6844,
                7217
            ],
            [
                7217,
                7666
            ],
            [
                7666,
                7993
            ],
            [
                7993,
                8183
            ],
            [
                8183,
                8256
            ],
            [
                8256,
                8420
            ],
            [
                8420,
                8471
            ],
            [
                8471,
                8480
            ],
            [
                8480,
                8514
            ],
            [
                8514,
                8674
            ],
            [
                8674,
                8742
            ],
            [
                8742,
                8940
            ],
            [
                8940,
                8989
            ],
            [
                8989,
                9080
            ],
            [
                9080,
                9154
            ],
            [
                9154,
                9259
            ],
            [
                9259,
                9316
            ],
            [
                9316,
                9411
            ],
            [
                9411,
                9503
            ],
            [
                9503,
                9696
            ],
            [
                9696,
                9722
            ],
            [
                9722,
                9820
            ],
            [
                9820,
                9886
            ],
            [
                9886,
                9933
            ],
            [
                9933,
                9974
            ],
            [
                9974,
                9986
            ],
            [
                9986,
                10061
            ],
            [
                10061,
                10156
            ],
            [
                10156,
                10209
            ],
            [
                10209,
                10238
            ],
            [
                10238,
                10293
            ],
            [
                10293,
                10437
            ],
            [
                10437,
                10534
            ],
            [
                10534,
                10673
            ],
            [
                10673,
                10826
            ]
        ],
        "overlap_chars": [
            [
                149,
                152
            ],
            [
                154,
                183
            ],
            [
                185,
                222
            ],
            [
                222,
                406
            ],
            [
                411,
                420
            ],
            [
                407,
                410
            ],
            [
                421,
                430
            ],
            [
                431,
                481
            ],
            [
                558,
                646
            ],
            [
                646,
                717
            ],
            [
                973,
                974
            ],
            [
                899,
                902
            ],
            [
                849,
                881
            ],
            [
                1002,
                1004
            ],
            [
                1004,
                1055
            ],
            [
                1071,
                1099
            ],
            [
                1108,
                1110
            ],
            [
                1123,
                1130
            ],
            [
                1137,
                1149
            ],
            [
                1211,
                1241
            ],
            [
                1242,
                1291
            ],
            [
                1291,
                1357
            ],
            [
                1357,
                1364
            ],
            [
                1368,
                1376
            ],
            [
                1365,
                1367
            ],
            [
                1377,
                1411
            ],
            [
                1438,
                1478
            ],
            [
                1517,
                1525
            ],
            [
                1527,
                1579
            ],
            [
                1579,
                1607
            ],
            [
                1636,
                1639
            ],
            [
                1632,
                1635
            ],
            [
                1607,
                1610
            ],
            [
                1640,
                1644
            ],
            [
                1612,
                1630
            ],
            [
                1646,
                1716
            ],
            [
                1716,
                1737
            ],
            [
                1750,
                1779
            ],
            [
                1781,
                1784
            ],
            [
                1785,
                1796
            ],
            [
                1805,
                1816
            ],
            [
                1816,
                1822
            ],
            [
                1827,
                1845
            ],
            [
                1883,
                1887
            ],
            [
                1904,
                1944
            ],
            [
                2031,
                2059
            ],
            [
                2073,
                2175
            ],
            [
                2175,
                2187
            ],
            [
                2188,
                2196
            ],
            [
                2202,
                2217
            ],
            [
                2228,
                2229
            ],
            [
                2230,
                2327
            ],
            [
                2327,
                2360
            ],
            [
                2362,
                2374
            ],
            [
                2522,
                2532
            ],
            [
                2400,
                2408
            ],
            [
                2420,
                2421
            ],
            [
                2537,
                2551
            ],
            [
                2551,
                2593
            ],
            [
                2595,
                2620
            ],
            [
                2623,
                2690
            ],
            [
                2690,
                2722
            ],
            [
                2722,
                2748
            ],
            [
                2748,
                2797
            ],
            [
                2836,
                2838
            ],
            [
                2839,
                2856
            ],
            [
                2859,
                2874
            ],
            [
                2899,
                2922
            ],
            [
                3101,
                3119
            ],
            [
                3122,
                3152
            ],
            [
                3153,
                3178
            ],
            [
                3178,
                3205
            ],
            [
                3205,
                3246
            ],
            [
                3254,
                3261
            ],
            [
                3265,
                3299
            ],
            [
                3300,
                3328
            ],
            [
                3328,
                3391
            ],
            [
                3391,
                3397
            ],
            [
                3420,
                3469
            ],
            [
                3553,
                3606
            ],
            [
                3619,
                3631
            ],
            [
                3636,
                3646
            ],
            [
                3653,
                3662
            ],
            [
                3664,
                3699
            ],
            [
                3699,
                3727
            ],
            [
                3730,
                3812
            ],
            [
                3812,
                3821
            ],
            [
                3898,
                3908
            ],
            [
                3835,
                3846
            ],
            [
                3857,
                3863
            ],
            [
                3910,
                3914
            ],
            [
                3918,
                3952
            ],
            [
                3989,
                3992
            ],
            [
                3962,
                3987
            ],
            [
                3993,
                3998
            ],
            [
                3987,
                3988
            ],
            [
                4072,
                4155
            ],
            [
                4155,
                4212
            ],
            [
                4214,
                4296
            ],
            [
                4322,
                4324
            ],
            [
                4324,
                4504
            ],
            [
                4507,
                4589
            ],
            [
                4589,
                4598
            ],
            [
                4609,
                4618
            ],
            [
                4661,
                4663
            ],
            [
                4894,
                4903
            ],
            [
                4916,
                4924
            ],
            [
                4930,
                4954
            ],
            [
                4954,
                4957
            ],
            [
                4959,
                4971
            ],
            [
                4987,
                4998
            ],
            [
                5058,
                5062
            ],
            [
                5064,
                5069
            ],
            [
                5093,
                5155
            ],
            [
                5165,
                5256
            ],
            [
                5262,
                5310
            ],
            [
                5315,
                5374
            ],
            [
                5374,
                5399
            ],
            [
                5409,
                5516
            ],
            [
                5516,
                5524
            ],
            [
                5530,
                5591
            ],
            [
                5596,
                5611
            ],
            [
                5614,
                5684
            ],
            [
                5729,
                5731
            ],
            [
                5731,
                5770
            ],
            [
                5770,
                5778
            ],
            [
                5788,
                5840
            ],
            [
                5853,
                5882
            ],
            [
                5882,
                5948
            ],
            [
                5996,
                6014
            ],
            [
                6016,
                6082
            ],
            [
                6098,
                6129
            ],
            [
                6173,
                6178
            ],
            [
                6137,
                6150
            ],
            [
                6187,
                6255
            ],
            [
                6273,
                6282
            ],
            [
                6296,
                6313
            ],
            [
                6478,
                6496
            ],
            [
                6316,
                6319
            ],
            [
                6387,
                6400
            ],
            [
                6497,
                6559
            ],
            [
                6561,
                6589
            ],
            [
                6349,
                6350
            ],
            [
                6591,
                6599
            ],
            [
                6384,
                6386
            ],
            [
                6609,
                6627
            ],
            [
                6402,
                6405
            ],
            [
                6369,
                6372
            ],
            [
                6649,
                6666
            ],
            [
                6678,
                6686
            ],
            [
                6718,
                6719
            ],
            [
                6844,
                6860
            ],
            [
                6869,
                6899
            ],
            [
                6861,
                6869
            ],
            [
                6900,
                6925
            ],
            [
                7015,
                7016
            ],
            [
                6987,
                7003
            ],
            [
                6963,
                6966
            ],
            [
                6981,
                6983
            ],
            [
                6943,
                6958
            ],
            [
                7017,
                7025
            ],
            [
                7011,
                7015
            ],
            [
                7026,
                7087
            ],
            [
                7095,
                7154
            ],
            [
                7215,
                7217
            ],
            [
                7577,
                7584
            ],
            [
                7403,
                7405
            ],
            [
                7670,
                7674
            ],
            [
                7227,
                7347
            ],
            [
                7664,
                7665
            ],
            [
                7349,
                7377
            ],
            [
                7389,
                7402
            ],
            [
                7443,
                7453
            ],
            [
                7556,
                7566
            ],
            [
                7568,
                7570
            ],
            [
                7468,
                7470
            ],
            [
                7855,
                7856
            ],
            [
                7666,
                7669
            ],
            [
                7700,
                7840
            ],
            [
                7861,
                7895
            ],
            [
                7897,
                7910
            ],
            [
                7912,
                7993
            ],
            [
                7993,
                8010
            ],
            [
                8020,
                8024
            ],
            [
                8011,
                8019
            ],
            [
                8025,
                8036
            ],
            [
                8082,
                8090
            ],
            [
                8187,
                8210
            ],
            [
                8216,
                8220
            ],
            [
                8247,
                8254
            ],
            [
                8223,
                8232
            ],
            [
                8254,
                8256
            ],
            [
                8261,
                8417
            ],
            [
                8420,
                8471
            ],
            [
                8472,
                8480
            ],
            [
                8480,
                8511
            ],
            [
                8678,
                8691
            ],
            [
                8745,
                8764
            ],
            [
                8783,
                8797
            ],
            [
                8802,
                8871
            ],
            [
                8938,
                8940
            ],
            [
                8941,
                8956
            ],
            [
                8959,
                8987
            ],
            [
                9032,
                9033
            ],
            [
                9011,
                9016
            ],
            [
                9044,
                9080
            ],
            [
                9080,
                9153
            ],
            [
                9259,
                9265
            ],
            [
                9269,
                9272
            ],
            [
                9287,
                9316
            ],
            [
                9335,
                9338
            ],
            [
                9343,
                9346
            ],
            [
                9409,
                9411
            ],
            [
                9463,
                9464
            ],
            [
                9470,
                9503
            ],
            [
                9503,
                9537
            ],
            [
                9541,
                9589
            ],
            [
                9640,
                9693
            ],
            [
                9696,
                9722
            ],
            [
                9722,
                9751
            ],
            [
                9799,
                9800
            ],
            [
                9753,
                9773
            ],
            [
                9886,
                9916
            ],
            [
                9922,
                9933
            ],
            [
                9936,
                9945
            ],
            [
                9964,
                9974
            ],
            [
                9974,
                9986
            ],
            [
                9987,
                10061
            ],
            [
                10061,
                10117
            ],
            [
                10156,
                10209
            ],
            [
                10209,
                10238
            ],
            [
                10238,
                10257
            ],
            [
                10291,
                10293
            ],
            [
                10293,
                10296
            ],
            [
                10306,
                10316
            ],
            [
                10367,
                10417
            ],
            [
                10423,
                10437
            ],
            [
                10502,
                10508
            ],
            [
                10516,
                10519
            ],
            [
                10480,
                10481
            ],
            [
                10534,
                10556
            ],
            [
                10649,
                10655
            ],
            [
                10671,
                10673
            ],
            [
                10673,
                10709
            ],
            [
                10714,
                10727
            ],
            [
                10750,
                10764
            ],
            [
                10780,
                10790
            ],
            [
                10797,
                10826
            ]
        ],
        "row_chars": [
            [
                0,
                36
            ],
            [
                36,
                143
            ],
            [
                143,
                149
            ],
            [
                149,
                222
            ],
            [
                222,
                431
            ],
            [
                431,
                481
            ],
            [
                481,
                646
            ],
            [
                646,
                1004
            ],
            [
                1004,
                1110
            ],
            [
                1110,
                1242
            ],
            [
                1242,
                1291
            ],
            [
                1291,
                1357
            ],
            [
                1357,
                1579
            ],
            [
                1579,
                1607
            ],
            [
                1607,
                1646
            ],
            [
                1646,
                1716
            ],
            [
                1716,
                1816
            ],
            [
                1816,
                2175
            ],
            [
                2175,
                2230
            ],
            [
                2230,
                2327
            ],
            [
                2327,
                2551
            ],
            [
                2551,
                2623
            ],
            [
                2623,
                2690
            ],
            [
                2690,
                2722
            ],
            [
                2722,
                2748
            ],
            [
                2748,
                2838
            ],
            [
                2838,
                2859
            ],
            [
                2859,
                2922
            ],
            [
                2922,
                3100
            ],
            [
                3100,
                3152
            ],
            [
                3152,
                3178
            ],
            [
                3178,
                3205
            ],
            [
                3205,
                3249
            ],
            [
                3249,
                3299
            ],
            [
                3299,
                3328
            ],
            [
                3328,
                3391
            ],
            [
                3391,
                3471
            ],
            [
                3471,
                3553
            ],
            [
                3553,
                3631
            ],
            [
                3631,
                3699
            ],
            [
                3699,
                3730
            ],
            [
                3730,
                3812
            ],
            [
                3812,
                3952
            ],
            [
                3952,
                4043
            ],
            [
                4043,
                4071
            ],
            [
                4071,
                4155
            ],
            [
                4155,
                4324
            ],
            [
                4324,
                4507
            ],
            [
                4507,
                4589
            ],
            [
                4589,
                4663
            ],
            [
                4663,
                4894
            ],
            [
                4894,
                4954
            ],
            [
                4954,
                5072
            ],
            [
                5072,
                5374
            ],
            [
                5374,
                5516
            ],
            [
                5516,
                5595
            ],
            [
                5595,
                5731
            ],
            [
                5731,
                5770
            ],
            [
                5770,
                5882
            ],
            [
                5882,
                6313
            ],
            [
                6313,
                6720
            ],
            [
                6720,
                6844
            ],
            [
                6844,
                7217
            ],
            [
                7217,
                7993
            ],
            [
                7993,
                8256
            ],
            [
                8256,
                8420
            ],
            [
                8420,
                8471
            ],
            [
                8471,
                8480
            ],
            [
                8480,
                8514
            ],
            [
                8514,
                8674
            ],
            [
                8674,
                8940
            ],
            [
                8940,
                9080
            ],
            [
                9080,
                9154
            ],
            [
                9154,
                9259
            ],
            [
                9259,
                9316
            ],
            [
                9316,
                9411
            ],
            [
                9411,
                9503
            ],
            [
                9503,
                9696
            ],
            [
                9696,
                9722
            ],
            [
                9722,
                9933
            ],
            [
                9933,
                9974
            ],
            [
                9974,
                9986
            ],
            [
                9986,
                10061
            ],
            [
                10061,
                10156
            ],
            [
                10156,
                10209
            ],
            [
                10209,
                10238
            ],
            [
                10238,
                10293
            ],
            [
                10293,
                10437
            ],
            [
                10437,
                10673
            ],
            [
                10673,
                10826
            ]
        ]
    },
    "abridged": {
        "text": "The 'bearing up better than likely' was a terrible strain upon Margaret. Sometimes she thought she must give way, and cry out with pain, as the sudden sharp thought came across her, even during her apparently cheerful conversations with her father, that she no longer had a mother.\nAbout Frederick, too, there was great uneasiness. By Tuesday Margaret was surprised and disheartened to find that there was still no letter. She was quite in the dark as to his plans, and her father was miserable, and kept pacing up and down the room. She tried to tranquillise him by reading aloud; but he could not listen for long. She was glad that she had not told him about their encounter with Leonards.\nShe was thankful to hear Mr. Thornton announced. His visit would force her father's thoughts into another channel.\nHe came straight up to her father, whose hands he took silently - holding them in his for a minute or two, while his look told of more sympathy than could be put into words. Then he turned to Margaret. She did not look 'better than likely'. Her stately beauty was dimmed with much watching and with many tears. The expression on her face was of gentle patient sadness, nay, of positive suffering. He had meant to greet her coldly; but he could not help going up to her, and saying the few necessary commonplace words in so tender a voice, that her eyes filled with tears, and she turned away to hide her emotion. She took her needlework and sat down very quiet.\nMr. Thornton's heart beat quick and strong, and for the time he utterly forgot the Outwood lane. He tried to talk to Mr. Hale: and his presence gave her father pleasure, Margaret saw.\nPresently Dixon came to the door and said, 'Miss Hale, you are wanted.'\nDixon's manner was so flurried that Margaret turned sick at heart. Something had happened to Fred. She had no doubt of that. It was well that her father and Mr. Thornton were busy talking.\n'What is it, Dixon?' asked Margaret, after shutting the drawing-room door.\n'It's nothing, miss,' said Dixon, choking a little. 'Only a police-inspector. He wants to see you, miss. But I dare say, it's about nothing at all.'\n'Did he name-' asked Margaret, almost inaudibly.\n'No, miss; he named nothing. He only asked if you lived here, and if he could speak to you. Martha let him in; she has shown him into master's study.'\nMargaret did not speak again till her hand was on the study door. Then she turned and said, 'Take care papa does not come down. Mr. Thornton is with him now.'\nThe inspector was almost daunted by the haughtiness of her manner as she entered. There was a controlled indignation in her face that gave her a superb air of disdain. She showed no surprise, no curiosity, but stood waiting for him to speak.\n'I beg your pardon, ma'am, but my duty obliges me to ask you a few plain questions. A man has died at the Infirmary, in consequence of a fall received at Outwood station, between the hours of five and six on Thursday evening. At the time, this fall did not seem of much consequence; but it was rendered fatal, the doctors say, by the presence of some internal complaint, and the man's own habit of drinking.'\nThe large dark eyes, gazing straight into the inspector's face, dilated a little. Otherwise he observed no motion. She never trembled, but fixed him with her eye. Now, as he paused, she said, 'Well - go on!'\n'An inquest will have to be held; there is some slight evidence that the blow, or push, or scuffle that caused the fall, was provoked by this poor fellow's tipsy impertinence to a young lady, walking with a man who pushed the deceased over the edge of the platform. This much was observed by someone on the platform, who, however, thought no more about the matter, as the blow seemed of slight consequence. There is some reason to identify the lady with yourself; in which case-'\n'I was not there,' said Margaret, still keeping her expressionless eyes fixed on his face.\nThe inspector bowed but did not speak. The lady before him showed no emotion, no fluttering fear, no desire to end the interview. The information he had received was very vague; one of the porters had seen a scuffle at the other end of the platform, between Leonards and a gentleman with a lady, but heard no noise; and soon after the train had started, he had been almost knocked down by the headlong run of the enraged Leonards, who was cursing awfully. The station-master had told the inspector that a young lady and gentleman had been there about that hour - the lady remarkably handsome, and said by a grocer's assistant who was there to be a Miss Hale of Crampton.\nLeonards himself, half-mad with rage and pain, had gone to the nearest gin-palace, where the busy waiters did not attend much to his tipsy words. However, they remembered his starting up and cursing himself for not having thought of the electric telegraph, for some purpose unknown. They believed that he was going to telegraph when, overcome by pain or drink, he had lain down in the road, where the police had found him and taken him to the Infirmary.\nThere he had never recovered full consciousness, although a magistrate was fetched in case he spoke; but he was rambling about being at sea, and mixing up names of captains and lieutenants in an indistinct manner with those of his fellow porters. His last words were a curse on the 'Cornish trick' which had, he said, made him a hundred pounds poorer than he ought to have been. The inspector ran over all this in his mind while Margaret stood awaiting his next words with supreme composure.\n'Then, madam, I have your denial that you were the lady accompanying the gentleman who struck the blow, or gave the push, which caused the death of this poor man?'\nA quick, sharp pain went through Margaret's brain. 'Oh God! that I knew Frederick were safe!' The inspector was a little struck by the form of her answer, which sounded like a mechanical repetition of her first reply.\n'I was not there,' said she, slowly and heavily, never ceasing from that glassy, dream-like stare. His quick suspicions were aroused by this dull echo of her former denial.\nHe put away his notebook in a very deliberate manner. Still she did not move.\n'Miss Hale, I may have to call on you again. I may have to summon you to appear at the inquest, and prove an alibi, if my witnesses persist in deposing to your presence at the unfortunate event.' He looked at her sharply. She was still perfectly quiet, with no change of colour, and he was a little abashed by her regal composure. His one witness must have mistaken her identity. He went on:\n'It is very unlikely, ma'am, that I shall have to do anything of the kind. I hope you will excuse me for doing what is only my duty.'\nMargaret bowed her head as he went towards the door. Her lips were stiff and dry. She could not speak. But she walked before him to the door of the house, which she threw wide for his exit. Once he was out, she shut the door, and locked it.\nThen she went into the study, paused - tottered forward - swayed for an instant, and fell on the floor in a dead swoon.",
        "paragraph_chars": [
            [
                0,
                282
            ],
            [
                282,
                692
            ],
            [
                692,
                807
            ],
            [
                807,
                1469
            ],
            [
                1469,
                1653
            ],
            [
                1653,
                1725
            ],
            [
                1725,
                1914
            ],
            [
                1914,
                1989
            ],
            [
                1989,
                2138
            ],
            [
                2138,
                2187
            ],
            [
                2187,
                2338
            ],
            [
                2338,
                2497
            ],
            [
                2497,
                2739
            ],
            [
                2739,
                3148
            ],
            [
                3148,
                3356
            ],
            [
                3356,
                3836
            ],
            [
                3836,
                3927
            ],
            [
                3927,
                4598
            ],
            [
                4598,
                5052
            ],
            [
                5052,
                5544
            ],
            [
                5544,
                5708
            ],
            [
                5708,
                5926
            ],
            [
                5926,
                6099
            ],
            [
                6099,
                6177
            ],
            [
                6177,
                6569
            ],
            [
                6569,
                6703
            ],
            [
                6703,
                6944
            ],
            [
                6944,
                7063
            ]
        ],
        "segment_chars": [
            [
                0,
                73
            ],
            [
                73,
                282
            ],
            [
                282,
                332
            ],
            [
                332,
                423
            ],
            [
                423,
                534
            ],
            [
                534,
                616
            ],
            [
                616,
                692
            ],
            [
                692,
                741
            ],
            [
                741,
                807
            ],
            [
                807,
                981
            ],
            [
                981,
                1009
            ],
            [
                1009,
                1048
            ],
            [
                1048,
                1118
            ],
            [
                1118,
                1204
            ],
            [
                1204,
                1420
            ],
            [
                1420,
                1469
            ],
            [
                1469,
                1566
            ],
            [
                1566,
                1653
            ],
            [
                1653,
                1725
            ],
            [
                1725,
                1792
            ],
            [
                1792,
                1824
            ],
            [
                1824,
                1850
            ],
            [
                1850,
                1914
            ],
            [
                1914,
                1935
            ],
            [
                1935,
                1989
            ],
            [
                1989,
                2041
            ],
            [
                2041,
                2067
            ],
            [
                2067,
                2094
            ],
            [
                2094,
                2138
            ],
            [
                2138,
                2187
            ],
            [
                2187,
                2216
            ],
            [
                2216,
                2279
            ],
            [
                2279,
                2338
            ],
            [
                2338,
                2404
            ],
            [
                2404,
                2466
            ],
            [
                2466,
                2497
            ],
            [
                2497,
                2579
            ],
            [
                2579,
                2665
            ],
            [
                2665,
                2739
            ],
            [
                2739,
                2823
            ],
            [
                2823,
                2965
            ],
            [
                2965,
                3148
            ],
            [
                3148,
                3230
            ],
            [
                3230,
                3263
            ],
            [
                3263,
                3311
            ],
            [
                3311,
                3356
            ],
            [
                3356,
                3622
            ],
            [
                3622,
                3763
            ],
            [
                3763,
                3836
            ],
            [
                3836,
                3927
            ],
            [
                3927,
                3966
            ],
            [
                3966,
                4057
            ],
            [
                4057,
                4383
            ],
            [
                4383,
                4598
            ],
            [
                4598,
                4744
            ],
            [
                4744,
                4881
            ],
            [
                4881,
                5052
            ],
            [
                5052,
                5299
            ],
            [
                5299,
                5431
            ],
            [
                5431,
                5544
            ],
            [
                5544,
                5708
            ],
            [
                5708,
                5759
            ],
            [
                5759,
                5768
            ],
            [
                5768,
                5802
            ],
            [
                5802,
                5926
            ],
            [
                5926,
                6025
            ],
            [
                6025,
                6099
            ],
            [
                6099,
                6153
            ],
            [
                6153,
                6177
            ],
            [
                6177,
                6222
            ],
            [
                6222,
                6373
            ],
            [
                6373,
                6399
            ],
            [
                6399,
                6508
            ],
            [
                6508,
                6557
            ],
            [
                6557,
                6569
            ],
            [
                6569,
                6644
            ],
            [
                6644,
                6703
            ],
            [
                6703,
                6756
            ],
            [
                6756,
                6785
            ],
            [
                6785,
                6806
            ],
            [
                6806,
                6893
            ],
            [
                6893,
                6944
            ],
            [
                6944,
                7063
            ]
        ],
        "overlap_chars": [
            [
                0,
                3
            ],
            [
                5,
                34
            ],
            [
                36,
                73
            ],
            [
                73,
                257
            ],
            [
                258,
                267
            ],
            [
                268,
                271
            ],
            [
                272,
                281
            ],
            [
                282,
                332
            ],
            [
                335,
                423
            ],
            [
                423,
                494
            ],
            [
                494,
                495
            ],
            [
                496,
                499
            ],
            [
                500,
                532
            ],
            [
                532,
                534
            ],
            [
                534,
                585
            ],
            [
                586,
                614
            ],
            [
                614,
                616
            ],
            [
                616,
                623
            ],
            [
                629,
                641
            ],
            [
                661,
                691
            ],
            [
                692,
                741
            ],
            [
                741,
                807
            ],
            [
                807,
                814
            ],
            [
                815,
                823
            ],
            [
                824,
                826
            ],
            [
                827,
                861
            ],
            [
                873,
                913
            ],
            [
                920,
                928
            ],
            [
                929,
                981
            ],
            [
                981,
                1009
            ],
            [
                1009,
                1012
            ],
            [
                1013,
                1016
            ],
            [
                1017,
                1020
            ],
            [
                1021,
                1025
            ],
            [
                1027,
                1045
            ],
            [
                1048,
                1118
            ],
            [
                1118,
                1139
            ],
            [
                1145,
                1174
            ],
            [
                1176,
                1179
            ],
            [
                1181,
                1192
            ],
            [
                1193,
                1204
            ],
            [
                1204,
                1210
            ],
            [
                1211,
                1229
            ],
            [
                1230,
                1234
            ],
            [
                1236,
                1276
            ],
            [
                1277,
                1305
            ],
            [
                1318,
                1420
            ],
            [
                1420,
                1432
            ],
            [
                1439,
                1447
            ],
            [
                1452,
                1467
            ],
            [
                1467,
                1468
            ],
            [
                1469,
                1566
            ],
            [
                1566,
                1599
            ],
            [
                1600,
                1612
            ],
            [
                1618,
                1628
            ],
            [
                1629,
                1637
            ],
            [
                1637,
                1638
            ],
            [
                1639,
                1653
            ],
            [
                1653,
                1695
            ],
            [
                1697,
                1722
            ],
            [
                1725,
                1792
            ],
            [
                1792,
                1824
            ],
            [
                1824,
                1850
            ],
            [
                1850,
                1899
            ],
            [
                1912,
                1914
            ],
            [
                1915,
                1932
            ],
            [
                1935,
                1950
            ],
            [
                1966,
                1989
            ],
            [
                1990,
                2008
            ],
            [
                2011,
                2041
            ],
            [
                2042,
                2067
            ],
            [
                2067,
                2094
            ],
            [
                2094,
                2135
            ],
            [
                2143,
                2150
            ],
            [
                2153,
                2187
            ],
            [
                2188,
                2216
            ],
            [
                2216,
                2279
            ],
            [
                2279,
                2285
            ],
            [
                2286,
                2335
            ],
            [
                2338,
                2391
            ],
            [
                2392,
                2404
            ],
            [
                2409,
                2419
            ],
            [
                2420,
                2429
            ],
            [
                2431,
                2466
            ],
            [
                2466,
                2494
            ],
            [
                2497,
                2579
            ],
            [
                2579,
                2588
            ],
            [
                2591,
                2601
            ],
            [
                2602,
                2613
            ],
            [
                2614,
                2620
            ],
            [
                2626,
                2630
            ],
            [
                2631,
                2665
            ],
            [
                2665,
                2668
            ],
            [
                2676,
                2701
            ],
            [
                2707,
                2712
            ],
            [
                2737,
                2738
            ],
            [
                2740,
                2823
            ],
            [
                2823,
                2880
            ],
            [
                2881,
                2963
            ],
            [
                2963,
                2965
            ],
            [
                2965,
                3145
            ],
            [
                3148,
                3230
            ],
            [
                3230,
                3239
            ],
            [
                3252,
                3261
            ],
            [
                3261,
                3263
            ],
            [
                3263,
                3272
            ],
            [
                3273,
                3281
            ],
            [
                3287,
                3311
            ],
            [
                3311,
                3314
            ],
            [
                3316,
                3328
            ],
            [
                3328,
                3339
            ],
            [
                3341,
                3345
            ],
            [
                3348,
                3353
            ],
            [
                3357,
                3419
            ],
            [
                3420,
                3511
            ],
            [
                3512,
                3560
            ],
            [
                3563,
                3622
            ],
            [
                3622,
                3647
            ],
            [
                3656,
                3763
            ],
            [
                3763,
                3771
            ],
            [
                3772,
                3833
            ],
            [
                3837,
                3852
            ],
            [
                3855,
                3925
            ],
            [
                3925,
                3927
            ],
            [
                3927,
                3966
            ],
            [
                3966,
                3974
            ],
            [
                3975,
                4027
            ],
            [
                4028,
                4057
            ],
            [
                4057,
                4123
            ],
            [
                4124,
                4142
            ],
            [
                4143,
                4209
            ],
            [
                4215,
                4246
            ],
            [
                4252,
                4257
            ],
            [
                4258,
                4271
            ],
            [
                4279,
                4347
            ],
            [
                4348,
                4357
            ],
            [
                4366,
                4383
            ],
            [
                4383,
                4401
            ],
            [
                4402,
                4405
            ],
            [
                4411,
                4424
            ],
            [
                4425,
                4487
            ],
            [
                4490,
                4518
            ],
            [
                4518,
                4519
            ],
            [
                4520,
                4528
            ],
            [
                4529,
                4531
            ],
            [
                4534,
                4552
            ],
            [
                4553,
                4556
            ],
            [
                4557,
                4560
            ],
            [
                4567,
                4584
            ],
            [
                4588,
                4596
            ],
            [
                4596,
                4597
            ],
            [
                4598,
                4614
            ],
            [
                4614,
                4644
            ],
            [
                4645,
                4653
            ],
            [
                4654,
                4679
            ],
            [
                4679,
                4680
            ],
            [
                4687,
                4703
            ],
            [
                4708,
                4711
            ],
            [
                4724,
                4726
            ],
            [
                4727,
                4742
            ],
            [
                4744,
                4752
            ],
            [
                4753,
                4757
            ],
            [
                4758,
                4819
            ],
            [
                4820,
                4879
            ],
            [
                4879,
                4881
            ],
            [
                4895,
                4902
            ],
            [
                4913,
                4915
            ],
            [
                4926,
                4930
            ],
            [
                4930,
                5050
            ],
            [
                5050,
                5051
            ],
            [
                5052,
                5080
            ],
            [
                5086,
                5099
            ],
            [
                5099,
                5109
            ],
            [
                5112,
                5122
            ],
            [
                5135,
                5137
            ],
            [
                5143,
                5145
            ],
            [
                5151,
                5152
            ],
            [
                5153,
                5156
            ],
            [
                5157,
                5297
            ],
            [
                5299,
                5333
            ],
            [
                5335,
                5348
            ],
            [
                5350,
                5431
            ],
            [
                5431,
                5448
            ],
            [
                5449,
                5453
            ],
            [
                5454,
                5462
            ],
            [
                5463,
                5474
            ],
            [
                5481,
                5489
            ],
            [
                5490,
                5513
            ],
            [
                5520,
                5524
            ],
            [
                5525,
                5532
            ],
            [
                5533,
                5542
            ],
            [
                5542,
                5544
            ],
            [
                5549,
                5705
            ],
            [
                5708,
                5759
            ],
            [
                5760,
                5768
            ],
            [
                5768,
                5799
            ],
            [
                5802,
                5815
            ],
            [
                5816,
                5835
            ],
            [
                5836,
                5850
            ],
            [
                5855,
                5924
            ],
            [
                5924,
                5926
            ],
            [
                5927,
                5942
            ],
            [
                5945,
                5973
            ],
            [
                5973,
                5974
            ],
            [
                5975,
                5980
            ],
            [
                5989,
                6025
            ],
            [
                6025,
                6098
            ],
            [
                6099,
                6105
            ],
            [
                6111,
                6114
            ],
            [
                6124,
                6153
            ],
            [
                6159,
                6162
            ],
            [
                6167,
                6170
            ],
            [
                6175,
                6177
            ],
            [
                6187,
                6188
            ],
            [
                6189,
                6222
            ],
            [
                6222,
                6256
            ],
            [
                6260,
                6308
            ],
            [
                6317,
                6370
            ],
            [
                6373,
                6399
            ],
            [
                6399,
                6428
            ],
            [
                6428,
                6429
            ],
            [
                6435,
                6455
            ],
            [
                6460,
                6490
            ],
            [
                6497,
                6508
            ],
            [
                6524,
                6533
            ],
            [
                6547,
                6557
            ],
            [
                6557,
                6569
            ],
            [
                6570,
                6644
            ],
            [
                6644,
                6700
            ],
            [
                6703,
                6756
            ],
            [
                6756,
                6785
            ],
            [
                6785,
                6804
            ],
            [
                6804,
                6806
            ],
            [
                6806,
                6809
            ],
            [
                6810,
                6820
            ],
            [
                6828,
                6878
            ],
            [
                6879,
                6893
            ],
            [
                6898,
                6904
            ],
            [
                6905,
                6908
            ],
            [
                6908,
                6909
            ],
            [
                6910,
                6932
            ],
            [
                6933,
                6939
            ],
            [
                6942,
                6944
            ],
            [
                6944,
                6980
            ],
            [
                6986,
                6999
            ],
            [
                7009,
                7023
            ],
            [
                7023,
                7033
            ],
            [
                7034,
                7063
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                73
            ],
            [
                73,
                282
            ],
            [
                282,
                332
            ],
            [
                332,
                423
            ],
            [
                423,
                534
            ],
            [
                534,
                616
            ],
            [
                616,
                692
            ],
            [
                692,
                741
            ],
            [
                741,
                807
            ],
            [
                807,
                981
            ],
            [
                981,
                1009
            ],
            [
                1009,
                1048
            ],
            [
                1048,
                1118
            ],
            [
                1118,
                1204
            ],
            [
                1204,
                1420
            ],
            [
                1420,
                1469
            ],
            [
                1469,
                1566
            ],
            [
                1566,
                1653
            ],
            [
                1653,
                1725
            ],
            [
                1725,
                1792
            ],
            [
                1792,
                1824
            ],
            [
                1824,
                1850
            ],
            [
                1850,
                1914
            ],
            [
                1914,
                1935
            ],
            [
                1935,
                1989
            ],
            [
                1989,
                1989
            ],
            [
                1989,
                2041
            ],
            [
                2041,
                2067
            ],
            [
                2067,
                2094
            ],
            [
                2094,
                2138
            ],
            [
                2138,
                2187
            ],
            [
                2187,
                2216
            ],
            [
                2216,
                2279
            ],
            [
                2279,
                2338
            ],
            [
                2338,
                2338
            ],
            [
                2338,
                2404
            ],
            [
                2404,
                2466
            ],
            [
                2466,
                2497
            ],
            [
                2497,
                2579
            ],
            [
                2579,
                2665
            ],
            [
                2665,
                2739
            ],
            [
                2739,
                2739
            ],
            [
                2739,
                2823
            ],
            [
                2823,
                2965
            ],
            [
                2965,
                3148
            ],
            [
                3148,
                3230
            ],
            [
                3230,
                3263
            ],
            [
                3263,
                3263
            ],
            [
                3263,
                3311
            ],
            [
                3311,
                3356
            ],
            [
                3356,
                3622
            ],
            [
                3622,
                3763
            ],
            [
                3763,
                3836
            ],
            [
                3836,
                3927
            ],
            [
                3927,
                3966
            ],
            [
                3966,
                4057
            ],
            [
                4057,
                4383
            ],
            [
                4383,
                4598
            ],
            [
                4598,
                4598
            ],
            [
                4598,
                4881
            ],
            [
                4881,
                5431
            ],
            [
                5431,
                5544
            ],
            [
                5544,
                5708
            ],
            [
                5708,
                5759
            ],
            [
                5759,
                5768
            ],
            [
                5768,
                5802
            ],
            [
                5802,
                5802
            ],
            [
                5802,
                5926
            ],
            [
                5926,
                6025
            ],
            [
                6025,
                6099
            ],
            [
                6099,
                6099
            ],
            [
                6099,
                6153
            ],
            [
                6153,
                6177
            ],
            [
                6177,
                6222
            ],
            [
                6222,
                6373
            ],
            [
                6373,
                6399
            ],
            [
                6399,
                6508
            ],
            [
                6508,
                6557
            ],
            [
                6557,
                6569
            ],
            [
                6569,
                6644
            ],
            [
                6644,
                6703
            ],
            [
                6703,
                6756
            ],
            [
                6756,
                6785
            ],
            [
                6785,
                6806
            ],
            [
                6806,
                6893
            ],
            [
                6893,
                6944
            ],
            [
                6944,
                7063
            ]
        ]
    }
}