{
    "original": {
        "text": "\"The steps of the bearers, heavy and slow, The sobs of the mourners, deep and low.\" SHELLEY.\nAt the time arranged the previous day, they set out on their walk to see Nicholas Higgins and his daughter. They both were reminded of their recent loss, by a strange kind of shyness in their new habiliments, and in the fact that it was the first time, for many weeks, that they had deliberately gone out together. They drew very close to each other in unspoken sympathy.\nNicholas was sitting by the fire-side in his accustomed corner; but he had not his accustomed pipe. He was leaning his head upon his hand, his arm resting on his knee. He did not get up when he saw them, though Margaret could read the welcome in his eye.\n\"Sit ye down, sit ye down. Fire's welly out,\" said he, giving it a vigorous poke, as if to turn attention away from himself. He was rather disorderly, to be sure, with a black unshaven beard of several days' growth, making his pale face look yet paler, and a jacket which would have been all the better for patching.\n\"We thought we should have a good chance of finding you, just after dinner-time,\" said Margaret.\n\"We have had our sorrows too, since we saw you,\" said Mr. Hale.\n\"Ay, ay. Sorrows is more plentiful than dinners just now; I reckon, my dinner hour stretches all o'er the day; yo're pretty sure of finding me.\"\n\"Are you out of work?\" asked Margaret.\n\"Ay,\" he replied shortly. Then, after a moment's silence, he added, looking up for the first time: \"I'm not wanting brass. Dunno yo' think it. Bess, poor lass, had a little stock under her pillow, ready to slip into my hand, last moment, and Mary is fustian-cutting. But I'm out of work a' the same.\"\n\"We owe Mary some money,\" said Mr. Hale, before Margaret's sharp pressure on his arm could arrest the words.\n\"If hoo takes it, I'll turn her out o' doors. I'll bide inside these four walls, and she'll bide out. That's a'.\"\n\"But we owe her many thanks for her kind service,\" began Mr. Hale again.\n\"I ne'er thanken your daughter theer for her deeds o' love to my poor wench. I ne'er could find th' words. I'se have to begin to try now, if yo' start making an ado about what little Mary could sarve yo'.\"\n\"Is it because of the strike you're out of work?\" asked Margaret gently.\n\"Strike's ended. It's o'er for this time. I'm out o' work because I ne'er asked for it. And I ne'er asked for it, because good words is scarce, and bad words is plentiful.\"\nHe was in a mood to take a surly pleasure in giving answers that were like riddles. But Margaret saw that he would like to be asked for the explanation.\n\"And good words are--?\"\n\"Asking for work. I reckon them's almost the best words that men can say. 'Gi' me work' means 'and I'll do it like a man.' Them's good words.\"\n\"And bad words are refusing you work when you ask for it.\"\n\"Ay. Bad words is saying 'Aha, my fine chap! Yo've been true to yo'r order, and I'll be true to mine. Yo' did the best yo' could for them as wanted help; that's yo're way of being true to yo're kind: and I'll be true to mine. Yo've been a poor fool, as knowed no better nor be a true faithful fool. So go and be d--d to yo'. There's no work for yo' here.' Them's bad words. I'm not a fool; and if I was, folk ought to ha' taught me how to be wise after their fashion. I could m'appen ha' learnt, if any one had tried to teach me.\"\n\"Would it not be worth while,\" said Mr. Hale, \"to ask your old master if he would take you back again? It might be a poor chance, but it would be a chance.\"\nHe looked up again, with a sharp glance at the questioner; and then tittered a low and bitter laugh.\n\"Measter! if it's no offence, I'll ask yo' a question or two in my turn.\"\n\"You're quite welcome,\" said Mr. Hale.\n\"I reckon yo'n some way of earning your bread. Folk seldom lives i' Milton just for pleasure, if they can live anywhere else.\"\n\"You are quite right. I have some independent property, but my intention in settling in Milton was to become a private tutor.\"\n\"To teach folk. Well! I reckon they pay yo' for teaching them, dunnot they?\"\n\"Yes,\" replied Mr. Hale, smiling. \"I teach in order to get paid.\"\n\"And them that pays yo', dun they tell yo' whatten to do, or whatten not to do wi' the money they gives you in just payment for your pains--in fair exchange like?\"\n\"No; to be sure not!\"\n\"They dunnot say, 'Yo' may have a brother, or a friend as dear as a brother, who wants this here brass for a purpose both yo' and he think right; but yo' mun promise not give it to him. Yo' may see a good use, as yo' think, to put yo'r money to; but we don't think it good, and so if yo' spend it a-thatens we'll just leave off dealing with yo'.' They dunnot say that, dun they?\"\n\"No: to be sure not!\"\n\"Would yo' stand it if they did?\"\n\"It would be some very hard pressure that would make me even think of submitting to such dictation.\"\n\"There's not the pressure on all the broad earth that would make me,\" said Nicholas Higgins. \"Now yo've got it. Yo've hit the bull's eye. Hampers--that's where I worked--makes their men pledge 'emselves they'll not give a penny to help th' Union or keep turn-outs fro' clemming. They may pledge and make pledge,\" continued he, scornfully; \"they nobbut make liars and hypocrites. And that's a less sin, to my mind, to make men's hearts so hard that they'll not do a kindness to them as needs it, or help on the right and just cause, though it goes again the strong hand. But I'll ne'er forswear mysel' for a' the work the king could gi'e me. I'm a member o' the Union; and I think it's the only thing to do the workmen any good. And I've been a turn-out, and known what it was to clem; so if I get a shilling, sixpence shall go to them if they axe it from me. Consequence is, I dunnot see where I'm to get a shilling.\"\n\"Is that rule about not contributing to the Union in force at all the mills?\" asked Margaret.\n\"I cannot say. It's a new regulation at ours; and I reckon they'll find that they cannot stick to it. But it's in force now. By-and-by they'll find out, tyrants makes liars.\"\nThere was a little pause. Margaret was hesitating whether she should say what was in her mind; she was unwilling to irritate one who was always gloomy and despondent enough. At last out it came. But in her soft tones, and with her reluctant manner, shewing that she was unwilling to say anything unpleasant, it did not seem to annoy Higgins, only to perplex him.\n\"Do you remember poor Boucher saying that the Union was a tyrant? I think he said it was the worse tyrant of all. And I remember, at the time I agreed with him.\"\nIt was a long while before he spoke. He was resting his head on his two hands, and looking down into the fire, so she could not read the expression on his face.\n\"I'll not deny but what th' Union finds it necessary to force a man into his own good. I'll speak truth. A man leads a dree life who's not i' th' Union. But once i' th' Union, his interests are taken care on better nor he could do it for himsel', or by himsel', for that matter. It's the only way working men can get their rights, by all joining together. More the members, more chance for each one separate man having justice done him. Government takes care o' fools and madmen; and if any man is inclined to do himsel' or his neighbour a hurt, it puts a bit of a check on him, whether he likes it or no. That's all we do 'i th' Union. We can't clap folk into prison; but we can make a man's life so heavy to be borne, that he's obliged to come in, and be wise and helpful in spite of himsel'. Boucher were a fool all along, and ne'er a worse fool than at th' last.\"\n\"He did you harm?\" asked Margaret.\n\"Aye, that did he. We had public opinion on our side, till he and his sort began rioting and breaking laws. It were all o'er wi' the strike then.\"\n\"Then would it not have been far better to have left him alone, and not forced him to join the Union? He did you no good; and you drove him mad.\"\n\"Margaret,\" said her father, in a low and warning tone, for he saw the cloud gathering on Higgins's face.\n\"I like her,\" said Higgins, suddenly. \"Hoo speaks plain out what's in her mind. Hoo doesn't comprehend th' Union for all that. It's a great power: it's our only power. I ha' read a bit o' poetry about a plough going o'er a daisy, as made tears come into my eyes, afore I'd other cause for crying. But the chap ne'er stopped driving the plough, I'se warrant, for all he was pitiful about the daisy. He'd too much mother-wit for that. Th' Union's the plough, making ready the land for harvest-time. Such as Boucher--'twould be settin' him up too much to liken him to a daisy; he's liker a weed lounging over the ground--mun just made up their mind to be put out o' the way. I'm sore vexed wi' him just now. So m'appen, I dunnot speak him fair. I could go o'er him wi' a plough mysel', wi' a' the pleasure in life.\"\n\"Why? What has he been doing? Anything fresh?\"\n\"Ay, to be sure. He's ne'er out o' mischief, that man. First of a' he must go raging like a mad fool, and kick up yon riot. Then he'd to go into hiding, where he'd a been yet, if Thornton had followed him out as I'd hoped he would ha' done. But Thornton, having got his own purpose, didn't care to go on wi' the prosecution for the riot. So Boucher slunk back again to his house. He ne'er showed himsel' abroad for a day or two. He had that grace. And then, where think ye that he went? Why, to Hampers'. Damn him! He went wi' his mealy-mouthed face, that turns me sick to look at, a-asking for work, though he knowed well enough the new rule, o' pledging themselves to give nought to th' Unions; nought to help the starving turn-out! Why he'd a clemmed to death, if th' Union had na helped him in his pinch. There he went, ossing to promise aught, and pledge himsel' to aught--to tell a' he know'd on our proceedings, the good-for-nothing Judas! But I'll say this for Hamper, and thank him for it at my dying day, he drove Boucher away, and would na listen to him--ne'er a word--though folk standing by, says the traitor cried like a babby!\"\n\"Oh! how shocking! how pitiful!\" exclaimed Margaret. \"Higgins, I don't know you to-day. Don't you see how you've made Boucher what he is, by driving him into the Union against his will--without his heart going with it. You have made him what he is!\"\nMade him what he is! What was he?\nGathering, gathering along the narrow street, came a hollow, measured sound; now forcing itself on their attention. Many voices were hushed and low: many steps were heard, not moving onwards, at least not with any rapidity or steadiness of motion, but as if circling round one spot. Yes, there was one distinct, slow tramp of feet, which made itself a clear path through the air, and reached their ears; the measured laboured walk of men carrying a heavy burden. They were all drawn towards the house-door by some irresistible impulse; impelled thither--not by a poor curiosity, but as if by some solemn blast.\nSix men walked in the middle of the road, three of them being policemen. They carried a door, taken off its hinges, upon their shoulders, on which lay some dead human creature; and from each side of the door there were constant droppings. All the street turned out to see, and, seeing, to accompany the procession, each one questioning the bearers, who answered almost reluctantly at last, so often had they told the tale.\n\"We found him i' th' brook in the field beyond there.\"\n\"Th' brook!--why there's not water enough to drown him!\"\n\"He was a determined chap. He lay with his face downwards. He was sick enough o' living, choose what cause he had for it.\"\nHiggins crept up to Margaret's side, and said in a weak piping kind of voice: \"It's not John Boucher? He had na spunk enough. Sure! It's not John Boucher! Why, they are a' looking this way! Listen! I've a singing in my head, and I cannot hear.\"\nThey put the door down carefully upon the stones, and all might see the poor drowned wretch--his glassy eyes, one half-open, staring right upwards to the sky. Owing to the position in which he had been found lying, his face was swollen and discoloured; besides, his skin was stained by the water in the brook, which had been used for dyeing purposes. The fore part of his head was bald; but the hair grew thin and long behind, and every separate lock was a conduit for water. Through all these disfigurements, Margaret recognised John Boucher. It seemed to her so sacrilegious to be peering into that poor distorted, agonised face, that, by a flash of instinct, she went forwards and softly covered the dead man's countenance with her handkerchief. The eyes that saw her do this followed her, as she turned away from her pious office, and were thus led to the place where Nicholas Higgins stood, like one rooted to the spot. The men spoke together, and then one of them came up to Higgins, who would have fain shrunk back into his house.\n\"Higgins, thou knowed him! Thou mun go tell the wife. Do it gently, man, but do it quick, for we canna leave him here long.\"\n\"I canna go,\" said Higgins. \"Dunnot ask me. I canna face her.\"\n\"Thou knows her best,\" said the man. \"We'n done a deal in bringing him here--thou take thy share.\"\n\"I canna do it,\" said Higgins. \"I'm welly felled wi' seeing him. We wasn't friends; and now he's dead.\"\n\"Well, if thou wunnot thou wunnot. Some one mun though. It's a dree task; but it's a chance, every minute, as she doesn't hear on it in some rougher way nor a person going to make her let on by degrees, as it were.\"\n\"Papa, do you go,\" said Margaret, in a low voice.\n\"If I could--if I had time to think of what I had better say; but all at once----\" Margaret saw that her father was indeed unable. He was trembling from head to foot.\n\"I will go,\" said she.\n\"Bless yo' miss, it will be a kind act; for she's been but a sickly sort o' body, I hear, and few hereabouts know much on her.\"\nMargaret knocked at the closed door; but there was such a noise, as of many little ill-ordered children, that she could hear no reply; indeed, she doubted if she was heard, and as every moment of delay made her recoil from her task more and more, she opened the door and went in, shutting it after her, and even, unseen by the woman, fastening the bolt.\nMrs. Boucher was sitting in a rocking-chair, on the other side of the ill-redd-up fireplace; it looked as if the house had been untouched for days by any effort at cleanliness.\nMargaret said something, she hardly knew what, her throat and mouth were so dry, and the children's noise completely prevented her from being heard. She tried again.\n\"How are you, Mrs. Boucher? But very poorly, I'm afraid.\"\n\"I've chance o' being well,\" said she querulously. \"I'm left alone to manage these childer, and nought for to give 'em for to keep 'em quiet. John should na ha' left me, and me so poorly.\"\n\"How long is it since he went away?\"\n\"Four days sin'. No one would give him work here, and he'd to go on tramp toward Greenfield. But he might ha' been back afore this, or sent me some word if he'd getten work. He might----\"\n\"Oh, don't blame him,\" said Margaret. \"He felt it deeply, I'm sure----\"\n\"Willto' hold thy din, and let me hear the lady speak!\" addressing herself, in no very gentle voice, to a little urchin of about a year old. She apologetically continued to Margaret, \"He's always mithering me for 'daddy' and 'butty'; and I ha' no butties to give him, and daddy's away, and forgotten us a', I think. He's his father's darling, he is,\" said she, with a sudden turn of mood, and, dragging the child up to her knee, she began kissing it fondly.\nMargaret laid her hand on the woman's arm to arrest her attention. Their eyes met.\n\"Poor little fellow!\" said Margaret, slowly; \"he _was_ his father's darling.\"\n\"He _is_ his father's darling,\" said the woman, rising hastily, and standing face to face with Margaret. Neither of them spoke for a moment or two. Then Mrs. Boucher began in a low growling tone, gathering in wildness as she went on: \"He _is_ his father's darling, I say. Poor folk can love their childer as well as rich. Why dunno yo' speak? Why dun yo' stare at me wi' your great pitiful eyes? Where's John?\" Weak as she was, she shook Margaret to force out an answer. \"Oh, my God!\" said she, understanding the meaning of that tearful look. She sank back into the chair. Margaret took up the child and put him into her arms.\n\"He loved him,\" said she.\n\"Ay,\" said the woman, shaking her head, \"he loved us a'. We had some one to love us once. It's a long time ago; but when he were in life and with us he did love us, he did. He loved this babby mappen the best on us; but he loved me and I loved him, though I was calling him five minutes agone. Are yo' sure he's dead?\" said she, trying to get up. \"If it's only that he's ill and like to die, they may bring him round yet. I'm but an ailing creature mysel'--I've been ailing this long time.\"\n\"But he is dead--he is drowned!\"\n\"Folk are brought round after they're dead-drowned. Whatten was I thinking of, to sit still when I should be stirring mysel'? Here, whisth thee, child--whisth thee! tak' this, tak' aught to play wi', but dunnot cry while my heart's breaking! Oh, where is my strength gone to? Oh John--husband!\"\nMargaret saved her from falling by catching her in her arms. She sate down in the rocking chair, and held the woman upon her knees, her head lying on Margaret's shoulder. The other children, clustered together in affright, began to understand the mystery of the scene; but the ideas came slowly, for their brains were dull and languid of perception. They set up such a cry of despair as they guessed the truth, that Margaret knew not how to bear it. Johnny's cry was loudest of them all, though he knew not why he cried, poor little fellow.\nThe mother quivered as she lay in Margaret's arms. Margaret heard a noise at the door.\n\"Open it. Open it quick,\" said she to the eldest child. \"It's bolted; make no noise--be very still. Oh, papa, let them go upstairs very softly and carefully, and perhaps she will not hear them. She has fainted--that's all.\"\n\"It's as well for her, poor creature,\" said a woman following in the wake of the bearers of the dead. \"But yo're not fit to hold her. Stay, I'll run fetch a pillow, and we'll let her down easy on the floor.\"\nThis helpful neighbour was a great relief to Margaret; she was evidently a stranger to the house, a new-comer in the district, indeed; but she was so kind and thoughtful that Margaret felt she was no longer needed; and that it would be better, perhaps, to set an example of clearing the house, which was filled with idle, if sympathising gazers.\nShe looked round for Nicholas Higgins. He was not there. So she spoke to the woman who had taken the lead in placing Mrs. Boucher on the floor.\n\"Can you give all these people a hint that they had better leave in quietness? So that when she comes round, she could only find one or two that she knows about her. Papa, will you speak to the men, and get them to go away. She cannot breathe, poor thing, with this crowd about her.\"\nMargaret was kneeling down by Mrs. Boucher and bathing her face with vinegar; but in a few minutes she was surprised at the gush of fresh air. She looked round, and saw a smile pass between her father and the woman.\n\"What is it?\" asked she.\n\"Only our good friend here,\" replied her father, \"hit on a capital expedient for clearing the place.\"\n\"I did 'em begone, and each take a child with 'em, and to mind that they were orphans, and their mother a widow. It was who could do most, and the childer are sure of a bellyful to-day, and of kindness too. Does hoo know how he died?\"\n\"No,\" said Margaret; \"I could not tell her all at once.\"\n\"Hoo mun be told because of th' Inquest. See! Hoo's coming round; shall you or I do it? or mappen your father would be best?\"\n\"No; you, you,\" said Margaret.\nThey awaited her perfect recovery in silence. Then the neighbour woman sat down on the floor, and took Mrs. Boucher's head and shoulders on her lap.\n\"Neighbour,\" said she, \"your man is dead. Guess yo' how he died?\"\n\"He were drowned,\" said Mrs. Boucher, feebly, beginning to cry for the first time, at this rough probing of her sorrows.\n\"He were found drowned. He were coming home very hopeless o' aught on earth. He thought God could na be harder than men; mappen not so hard; mappen as tender as a mother; mappen tenderer. I'm not saying he did right, and I'm not saying he did wrong. All I say is, may neither me nor mine ever have his sore heart, or we may do like things.\"\n\"He has left me alone wi' a' these children!\" moaned the widow, less distressed at the manner of the death than Margaret expected; but it was of a piece with her helpless character to feel his loss as principally affecting herself and her children.\n\"Not alone,\" said Mr. Hale, solemnly. \"Who is with you? Who will take up your cause?\" The widow opened her eyes wide, and looked at the new speaker, of whose presence she had not been aware till then.\n\"Who has promised to be a father to the fatherless?\" continued he.\n\"But I've getten six children, sir, and the eldest not eight years of age. I'm not meaning for to doubt His power, sir,--only it needs a deal o' trust\"; and she began to cry afresh.\n\"Hoo'll be better able to talk to-morrow, sir,\" said the neighbour. \"Best comfort now would be the feel of a child at her heart. I'm sorry they took the babby.\"\n\"I'll go for it,\" said Margaret. And in a few minutes she returned, carrying Johnnie, his face all smeared with eating, and his hands loaded with treasures in the shape of shells, and bits of crystal, and the head of a plaster figure. She placed him on his mother's arms.\n\"There!\" said the woman, \"now you go. They'll cry together, and comfort together, better nor any one but a child can do. I'll stop with her as long as I'm needed, and if you come to-morrow, you' can have a deal o' wise talk with her, that she's not up to to-day.\"\nAs Margaret and her father went slowly up the street, she paused at Higgins's closed door.\n\"Shall we go in?\" asked her father. \"I was thinking of him too.\"\nThey knocked. There was no answer, so they tried the door. It was bolted, but they thought they heard him moving within.\n\"Nicholas!\" said Margaret. There was no answer, and they might have gone away, believing the house to be empty, if there had not been some accidental fall, as of a book, within.\n\"Nicholas!\" said Margaret again. \"It is only us. Won't you let us come in?\"\n\"No,\" said he. \"I spoke as plain as I could, 'bout using words, when I bolted th' door. Let me be, this day.\"\nMr. Hale would have urged their desire, but Margaret placed her finger on his lips.\n\"I don't wonder at it,\" said she. \"I myself long to be alone. It seems the only thing to do one good after a day like this.\"",
        "paragraph_chars": [
            [
                0,
                93
            ],
            [
                93,
                465
            ],
            [
                465,
                720
            ],
            [
                720,
                1037
            ],
            [
                1037,
                1134
            ],
            [
                1134,
                1198
            ],
            [
                1198,
                1343
            ],
            [
                1343,
                1382
            ],
            [
                1382,
                1683
            ],
            [
                1683,
                1792
            ],
            [
                1792,
                1906
            ],
            [
                1906,
                1979
            ],
            [
                1979,
                2185
            ],
            [
                2185,
                2258
            ],
            [
                2258,
                2431
            ],
            [
                2431,
                2584
            ],
            [
                2584,
                2608
            ],
            [
                2608,
                2751
            ],
            [
                2751,
                2810
            ],
            [
                2810,
                3341
            ],
            [
                3341,
                3498
            ],
            [
                3498,
                3599
            ],
            [
                3599,
                3673
            ],
            [
                3673,
                3712
            ],
            [
                3712,
                3839
            ],
            [
                3839,
                3966
            ],
            [
                3966,
                4043
            ],
            [
                4043,
                4109
            ],
            [
                4109,
                4273
            ],
            [
                4273,
                4295
            ],
            [
                4295,
                4675
            ],
            [
                4675,
                4697
            ],
            [
                4697,
                4731
            ],
            [
                4731,
                4832
            ],
            [
                4832,
                5750
            ],
            [
                5750,
                5844
            ],
            [
                5844,
                6019
            ],
            [
                6019,
                6382
            ],
            [
                6382,
                6544
            ],
            [
                6544,
                6705
            ],
            [
                6705,
                7573
            ],
            [
                7573,
                7608
            ],
            [
                7608,
                7755
            ],
            [
                7755,
                7901
            ],
            [
                7901,
                8007
            ],
            [
                8007,
                8820
            ],
            [
                8820,
                8867
            ],
            [
                8867,
                10010
            ],
            [
                10010,
                10260
            ],
            [
                10260,
                10294
            ],
            [
                10294,
                10905
            ],
            [
                10905,
                11328
            ],
            [
                11328,
                11383
            ],
            [
                11383,
                11440
            ],
            [
                11440,
                11563
            ],
            [
                11563,
                11808
            ],
            [
                11808,
                12846
            ],
            [
                12846,
                12971
            ],
            [
                12971,
                13034
            ],
            [
                13034,
                13133
            ],
            [
                13133,
                13237
            ],
            [
                13237,
                13453
            ],
            [
                13453,
                13503
            ],
            [
                13503,
                13670
            ],
            [
                13670,
                13693
            ],
            [
                13693,
                13821
            ],
            [
                13821,
                14175
            ],
            [
                14175,
                14352
            ],
            [
                14352,
                14518
            ],
            [
                14518,
                14576
            ],
            [
                14576,
                14765
            ],
            [
                14765,
                14802
            ],
            [
                14802,
                14990
            ],
            [
                14990,
                15062
            ],
            [
                15062,
                15520
            ],
            [
                15520,
                15603
            ],
            [
                15603,
                15681
            ],
            [
                15681,
                16308
            ],
            [
                16308,
                16334
            ],
            [
                16334,
                16825
            ],
            [
                16825,
                16858
            ],
            [
                16858,
                17153
            ],
            [
                17153,
                17694
            ],
            [
                17694,
                17781
            ],
            [
                17781,
                18005
            ],
            [
                18005,
                18213
            ],
            [
                18213,
                18559
            ],
            [
                18559,
                18703
            ],
            [
                18703,
                18987
            ],
            [
                18987,
                19203
            ],
            [
                19203,
                19228
            ],
            [
                19228,
                19330
            ],
            [
                19330,
                19565
            ],
            [
                19565,
                19622
            ],
            [
                19622,
                19748
            ],
            [
                19748,
                19779
            ],
            [
                19779,
                19928
            ],
            [
                19928,
                19994
            ],
            [
                19994,
                20115
            ],
            [
                20115,
                20456
            ],
            [
                20456,
                20705
            ],
            [
                20705,
                20906
            ],
            [
                20906,
                20973
            ],
            [
                20973,
                21155
            ],
            [
                21155,
                21316
            ],
            [
                21316,
                21588
            ],
            [
                21588,
                21852
            ],
            [
                21852,
                21943
            ],
            [
                21943,
                22008
            ],
            [
                22008,
                22129
            ],
            [
                22129,
                22307
            ],
            [
                22307,
                22383
            ],
            [
                22383,
                22493
            ],
            [
                22493,
                22577
            ],
            [
                22577,
                22701
            ]
        ],
        "segment_chars": [
            [
                0,
                84
            ],
            [
                84,
                93
            ],
            [
                93,
                201
            ],
            [
                201,
                408
            ],
            [
                408,
                465
            ],
            [
                465,
                565
            ],
            [
                565,
                633
            ],
            [
                633,
                720
            ],
            [
                720,
                747
            ],
            [
                747,
                845
            ],
            [
                845,
                1037
            ],
            [
                1037,
                1134
            ],
            [
                1134,
                1198
            ],
            [
                1198,
                1207
            ],
            [
                1207,
                1343
            ],
            [
                1343,
                1366
            ],
            [
                1366,
                1382
            ],
            [
                1382,
                1408
            ],
            [
                1408,
                1505
            ],
            [
                1505,
                1525
            ],
            [
                1525,
                1649
            ],
            [
                1649,
                1683
            ],
            [
                1683,
                1792
            ],
            [
                1792,
                1838
            ],
            [
                1838,
                1894
            ],
            [
                1894,
                1906
            ],
            [
                1906,
                1979
            ],
            [
                1979,
                2056
            ],
            [
                2056,
                2086
            ],
            [
                2086,
                2185
            ],
            [
                2185,
                2235
            ],
            [
                2235,
                2258
            ],
            [
                2258,
                2275
            ],
            [
                2275,
                2300
            ],
            [
                2300,
                2346
            ],
            [
                2346,
                2431
            ],
            [
                2431,
                2515
            ],
            [
                2515,
                2584
            ],
            [
                2584,
                2608
            ],
            [
                2608,
                2626
            ],
            [
                2626,
                2682
            ],
            [
                2682,
                2731
            ],
            [
                2731,
                2751
            ],
            [
                2751,
                2810
            ],
            [
                2810,
                2815
            ],
            [
                2815,
                2855
            ],
            [
                2855,
                2912
            ],
            [
                2912,
                3036
            ],
            [
                3036,
                3109
            ],
            [
                3109,
                3135
            ],
            [
                3135,
                3166
            ],
            [
                3166,
                3184
            ],
            [
                3184,
                3278
            ],
            [
                3278,
                3341
            ],
            [
                3341,
                3444
            ],
            [
                3444,
                3498
            ],
            [
                3498,
                3599
            ],
            [
                3599,
                3609
            ],
            [
                3609,
                3673
            ],
            [
                3673,
                3712
            ],
            [
                3712,
                3759
            ],
            [
                3759,
                3839
            ],
            [
                3839,
                3861
            ],
            [
                3861,
                3966
            ],
            [
                3966,
                3982
            ],
            [
                3982,
                3988
            ],
            [
                3988,
                4043
            ],
            [
                4043,
                4077
            ],
            [
                4077,
                4109
            ],
            [
                4109,
                4273
            ],
            [
                4273,
                4295
            ],
            [
                4295,
                4481
            ],
            [
                4481,
                4642
            ],
            [
                4642,
                4675
            ],
            [
                4675,
                4697
            ],
            [
                4697,
                4731
            ],
            [
                4731,
                4832
            ],
            [
                4832,
                4925
            ],
            [
                4925,
                4944
            ],
            [
                4944,
                4970
            ],
            [
                4970,
                5111
            ],
            [
                5111,
                5211
            ],
            [
                5211,
                5402
            ],
            [
                5402,
                5473
            ],
            [
                5473,
                5560
            ],
            [
                5560,
                5691
            ],
            [
                5691,
                5750
            ],
            [
                5750,
                5828
            ],
            [
                5828,
                5844
            ],
            [
                5844,
                5859
            ],
            [
                5859,
                5946
            ],
            [
                5946,
                5969
            ],
            [
                5969,
                6019
            ],
            [
                6019,
                6045
            ],
            [
                6045,
                6193
            ],
            [
                6193,
                6214
            ],
            [
                6214,
                6382
            ],
            [
                6382,
                6448
            ],
            [
                6448,
                6496
            ],
            [
                6496,
                6544
            ],
            [
                6544,
                6581
            ],
            [
                6581,
                6705
            ],
            [
                6705,
                6792
            ],
            [
                6792,
                6810
            ],
            [
                6810,
                6858
            ],
            [
                6858,
                6984
            ],
            [
                6984,
                7061
            ],
            [
                7061,
                7142
            ],
            [
                7142,
                7311
            ],
            [
                7311,
                7342
            ],
            [
                7342,
                7500
            ],
            [
                7500,
                7573
            ],
            [
                7573,
                7592
            ],
            [
                7592,
                7608
            ],
            [
                7608,
                7627
            ],
            [
                7627,
                7716
            ],
            [
                7716,
                7755
            ],
            [
                7755,
                7857
            ],
            [
                7857,
                7901
            ],
            [
                7901,
                8007
            ],
            [
                8007,
                8045
            ],
            [
                8045,
                8087
            ],
            [
                8087,
                8134
            ],
            [
                8134,
                8175
            ],
            [
                8175,
                8304
            ],
            [
                8304,
                8405
            ],
            [
                8405,
                8440
            ],
            [
                8440,
                8504
            ],
            [
                8504,
                8679
            ],
            [
                8679,
                8712
            ],
            [
                8712,
                8749
            ],
            [
                8749,
                8820
            ],
            [
                8820,
                8826
            ],
            [
                8826,
                8850
            ],
            [
                8850,
                8867
            ],
            [
                8867,
                8884
            ],
            [
                8884,
                8922
            ],
            [
                8922,
                8991
            ],
            [
                8991,
                9108
            ],
            [
                9108,
                9205
            ],
            [
                9205,
                9247
            ],
            [
                9247,
                9296
            ],
            [
                9296,
                9315
            ],
            [
                9315,
                9354
            ],
            [
                9354,
                9372
            ],
            [
                9372,
                9382
            ],
            [
                9382,
                9602
            ],
            [
                9602,
                9676
            ],
            [
                9676,
                9814
            ],
            [
                9814,
                10010
            ],
            [
                10010,
                10015
            ],
            [
                10015,
                10029
            ],
            [
                10029,
                10043
            ],
            [
                10043,
                10063
            ],
            [
                10063,
                10098
            ],
            [
                10098,
                10229
            ],
            [
                10229,
                10260
            ],
            [
                10260,
                10281
            ],
            [
                10281,
                10294
            ],
            [
                10294,
                10410
            ],
            [
                10410,
                10577
            ],
            [
                10577,
                10757
            ],
            [
                10757,
                10905
            ],
            [
                10905,
                10978
            ],
            [
                10978,
                11144
            ],
            [
                11144,
                11328
            ],
            [
                11328,
                11383
            ],
            [
                11383,
                11440
            ],
            [
                11440,
                11467
            ],
            [
                11467,
                11499
            ],
            [
                11499,
                11563
            ],
            [
                11563,
                11665
            ],
            [
                11665,
                11689
            ],
            [
                11689,
                11695
            ],
            [
                11695,
                11718
            ],
            [
                11718,
                11753
            ],
            [
                11753,
                11761
            ],
            [
                11761,
                11808
            ],
            [
                11808,
                11967
            ],
            [
                11967,
                12159
            ],
            [
                12159,
                12284
            ],
            [
                12284,
                12352
            ],
            [
                12352,
                12557
            ],
            [
                12557,
                12733
            ],
            [
                12733,
                12846
            ],
            [
                12846,
                12873
            ],
            [
                12873,
                12900
            ],
            [
                12900,
                12971
            ],
            [
                12971,
                12999
            ],
            [
                12999,
                13015
            ],
            [
                13015,
                13034
            ],
            [
                13034,
                13071
            ],
            [
                13071,
                13133
            ],
            [
                13133,
                13164
            ],
            [
                13164,
                13198
            ],
            [
                13198,
                13237
            ],
            [
                13237,
                13272
            ],
            [
                13272,
                13293
            ],
            [
                13293,
                13453
            ],
            [
                13453,
                13503
            ],
            [
                13503,
                13634
            ],
            [
                13634,
                13670
            ],
            [
                13670,
                13693
            ],
            [
                13693,
                13821
            ],
            [
                13821,
                14175
            ],
            [
                14175,
                14352
            ],
            [
                14352,
                14501
            ],
            [
                14501,
                14518
            ],
            [
                14518,
                14546
            ],
            [
                14546,
                14576
            ],
            [
                14576,
                14627
            ],
            [
                14627,
                14718
            ],
            [
                14718,
                14765
            ],
            [
                14765,
                14802
            ],
            [
                14802,
                14819
            ],
            [
                14819,
                14895
            ],
            [
                14895,
                14976
            ],
            [
                14976,
                14990
            ],
            [
                14990,
                15028
            ],
            [
                15028,
                15062
            ],
            [
                15062,
                15118
            ],
            [
                15118,
                15203
            ],
            [
                15203,
                15378
            ],
            [
                15378,
                15520
            ],
            [
                15520,
                15587
            ],
            [
                15587,
                15603
            ],
            [
                15603,
                15625
            ],
            [
                15625,
                15681
            ],
            [
                15681,
                15786
            ],
            [
                15786,
                15829
            ],
            [
                15829,
                15953
            ],
            [
                15953,
                16003
            ],
            [
                16003,
                16024
            ],
            [
                16024,
                16077
            ],
            [
                16077,
                16092
            ],
            [
                16092,
                16152
            ],
            [
                16152,
                16166
            ],
            [
                16166,
                16224
            ],
            [
                16224,
                16254
            ],
            [
                16254,
                16308
            ],
            [
                16308,
                16334
            ],
            [
                16334,
                16391
            ],
            [
                16391,
                16424
            ],
            [
                16424,
                16507
            ],
            [
                16507,
                16628
            ],
            [
                16628,
                16653
            ],
            [
                16653,
                16681
            ],
            [
                16681,
                16756
            ],
            [
                16756,
                16825
            ],
            [
                16825,
                16858
            ],
            [
                16858,
                16910
            ],
            [
                16910,
                16984
            ],
            [
                16984,
                17023
            ],
            [
                17023,
                17100
            ],
            [
                17100,
                17134
            ],
            [
                17134,
                17153
            ],
            [
                17153,
                17214
            ],
            [
                17214,
                17324
            ],
            [
                17324,
                17503
            ],
            [
                17503,
                17603
            ],
            [
                17603,
                17694
            ],
            [
                17694,
                17745
            ],
            [
                17745,
                17781
            ],
            [
                17781,
                17791
            ],
            [
                17791,
                17837
            ],
            [
                17837,
                17881
            ],
            [
                17881,
                17975
            ],
            [
                17975,
                18005
            ],
            [
                18005,
                18107
            ],
            [
                18107,
                18139
            ],
            [
                18139,
                18213
            ],
            [
                18213,
                18559
            ],
            [
                18559,
                18598
            ],
            [
                18598,
                18616
            ],
            [
                18616,
                18703
            ],
            [
                18703,
                18782
            ],
            [
                18782,
                18869
            ],
            [
                18869,
                18927
            ],
            [
                18927,
                18987
            ],
            [
                18987,
                19130
            ],
            [
                19130,
                19203
            ],
            [
                19203,
                19217
            ],
            [
                19217,
                19228
            ],
            [
                19228,
                19330
            ],
            [
                19330,
                19443
            ],
            [
                19443,
                19537
            ],
            [
                19537,
                19565
            ],
            [
                19565,
                19622
            ],
            [
                19622,
                19663
            ],
            [
                19663,
                19668
            ],
            [
                19668,
                19710
            ],
            [
                19710,
                19748
            ],
            [
                19748,
                19779
            ],
            [
                19779,
                19825
            ],
            [
                19825,
                19928
            ],
            [
                19928,
                19970
            ],
            [
                19970,
                19994
            ],
            [
                19994,
                20115
            ],
            [
                20115,
                20139
            ],
            [
                20139,
                20192
            ],
            [
                20192,
                20303
            ],
            [
                20303,
                20365
            ],
            [
                20365,
                20456
            ],
            [
                20456,
                20502
            ],
            [
                20502,
                20705
            ],
            [
                20705,
                20743
            ],
            [
                20743,
                20761
            ],
            [
                20761,
                20791
            ],
            [
                20791,
                20906
            ],
            [
                20906,
                20959
            ],
            [
                20959,
                20973
            ],
            [
                20973,
                21048
            ],
            [
                21048,
                21155
            ],
            [
                21155,
                21223
            ],
            [
                21223,
                21284
            ],
            [
                21284,
                21316
            ],
            [
                21316,
                21349
            ],
            [
                21349,
                21551
            ],
            [
                21551,
                21588
            ],
            [
                21588,
                21597
            ],
            [
                21597,
                21626
            ],
            [
                21626,
                21709
            ],
            [
                21709,
                21852
            ],
            [
                21852,
                21943
            ],
            [
                21943,
                21961
            ],
            [
                21961,
                21979
            ],
            [
                21979,
                22008
            ],
            [
                22008,
                22022
            ],
            [
                22022,
                22067
            ],
            [
                22067,
                22129
            ],
            [
                22129,
                22141
            ],
            [
                22141,
                22156
            ],
            [
                22156,
                22307
            ],
            [
                22307,
                22319
            ],
            [
                22319,
                22340
            ],
            [
                22340,
                22356
            ],
            [
                22356,
                22383
            ],
            [
                22383,
                22398
            ],
            [
                22398,
                22471
            ],
            [
                22471,
                22493
            ],
            [
                22493,
                22577
            ],
            [
                22577,
                22611
            ],
            [
                22611,
                22639
            ],
            [
                22639,
                22701
            ]
        ],
        "overlap_chars": [
            [
                93,
                113
            ],
            [
                130,
                201
            ],
            [
                201,
                210
            ],
            [
                250,
                284
            ],
            [
                300,
                305
            ],
            [
                413,
                417
            ],
            [
                423,
                465
            ],
            [
                465,
                527
            ],
            [
                572,
                633
            ],
            [
                633,
                667
            ],
            [
                718,
                720
            ],
            [
                725,
                747
            ],
            [
                747,
                753
            ],
            [
                760,
                763
            ],
            [
                766,
                845
            ],
            [
                845,
                887
            ],
            [
                914,
                927
            ],
            [
                890,
                895
            ],
            [
                928,
                934
            ],
            [
                911,
                913
            ],
            [
                905,
                910
            ],
            [
                936,
                978
            ],
            [
                979,
                985
            ],
            [
                1035,
                1037
            ],
            [
                1038,
                1092
            ],
            [
                1094,
                1116
            ],
            [
                1119,
                1134
            ],
            [
                1135,
                1157
            ],
            [
                1159,
                1180
            ],
            [
                1183,
                1198
            ],
            [
                1199,
                1207
            ],
            [
                1207,
                1255
            ],
            [
                1266,
                1294
            ],
            [
                1304,
                1307
            ],
            [
                1307,
                1340
            ],
            [
                1344,
                1363
            ],
            [
                1366,
                1382
            ],
            [
                1383,
                1385
            ],
            [
                1388,
                1408
            ],
            [
                1408,
                1480
            ],
            [
                1482,
                1505
            ],
            [
                1525,
                1577
            ],
            [
                1579,
                1587
            ],
            [
                1618,
                1647
            ],
            [
                1684,
                1706
            ],
            [
                1709,
                1722
            ],
            [
                1790,
                1792
            ],
            [
                1793,
                1836
            ],
            [
                1907,
                1954
            ],
            [
                1957,
                1979
            ],
            [
                1980,
                1987
            ],
            [
                1996,
                2009
            ],
            [
                2016,
                2056
            ],
            [
                2056,
                2084
            ],
            [
                2186,
                2232
            ],
            [
                2235,
                2258
            ],
            [
                2265,
                2275
            ],
            [
                2300,
                2346
            ],
            [
                2346,
                2428
            ],
            [
                2431,
                2515
            ],
            [
                2515,
                2584
            ],
            [
                2585,
                2603
            ],
            [
                2609,
                2626
            ],
            [
                2683,
                2694
            ],
            [
                2696,
                2701
            ],
            [
                2703,
                2728
            ],
            [
                2731,
                2748
            ],
            [
                2752,
                2755
            ],
            [
                2815,
                2834
            ],
            [
                2751,
                2752
            ],
            [
                2836,
                2855
            ],
            [
                2855,
                2873
            ],
            [
                2879,
                2912
            ],
            [
                3036,
                3053
            ],
            [
                3094,
                3107
            ],
            [
                3058,
                3059
            ],
            [
                3109,
                3123
            ],
            [
                3125,
                3135
            ],
            [
                3135,
                3163
            ],
            [
                3166,
                3184
            ],
            [
                3184,
                3256
            ],
            [
                3276,
                3278
            ],
            [
                3278,
                3285
            ],
            [
                3294,
                3308
            ],
            [
                3317,
                3338
            ],
            [
                3342,
                3369
            ],
            [
                3372,
                3386
            ],
            [
                3388,
                3442
            ],
            [
                3575,
                3599
            ],
            [
                3602,
                3609
            ],
            [
                3609,
                3670
            ],
            [
                3674,
                3694
            ],
            [
                3697,
                3712
            ],
            [
                3713,
                3757
            ],
            [
                3840,
                3861
            ],
            [
                3861,
                3862
            ],
            [
                3948,
                3963
            ],
            [
                3976,
                3980
            ],
            [
                4002,
                4027
            ],
            [
                4044,
                4047
            ],
            [
                4050,
                4076
            ],
            [
                4110,
                4156
            ],
            [
                4182,
                4206
            ],
            [
                4213,
                4216
            ],
            [
                4274,
                4292
            ],
            [
                4551,
                4553
            ],
            [
                4301,
                4312
            ],
            [
                4295,
                4296
            ],
            [
                4314,
                4342
            ],
            [
                4353,
                4357
            ],
            [
                4343,
                4349
            ],
            [
                4370,
                4375
            ],
            [
                4382,
                4386
            ],
            [
                4392,
                4397
            ],
            [
                4439,
                4464
            ],
            [
                4519,
                4521
            ],
            [
                4465,
                4479
            ],
            [
                4503,
                4504
            ],
            [
                4602,
                4638
            ],
            [
                4642,
                4662
            ],
            [
                4676,
                4694
            ],
            [
                4735,
                4740
            ],
            [
                4812,
                4814
            ],
            [
                4768,
                4772
            ],
            [
                4926,
                4942
            ],
            [
                4902,
                4924
            ],
            [
                5025,
                5026
            ],
            [
                4983,
                4985
            ],
            [
                5090,
                5091
            ],
            [
                4986,
                5000
            ],
            [
                5002,
                5024
            ],
            [
                5035,
                5090
            ],
            [
                5091,
                5111
            ],
            [
                5111,
                5115
            ],
            [
                5131,
                5135
            ],
            [
                5177,
                5183
            ],
            [
                5189,
                5211
            ],
            [
                5211,
                5245
            ],
            [
                5254,
                5325
            ],
            [
                5400,
                5402
            ],
            [
                5402,
                5431
            ],
            [
                5473,
                5546
            ],
            [
                5550,
                5560
            ],
            [
                5560,
                5603
            ],
            [
                5608,
                5666
            ],
            [
                5679,
                5681
            ],
            [
                5689,
                5691
            ],
            [
                5691,
                5747
            ],
            [
                5751,
                5763
            ],
            [
                5800,
                5825
            ],
            [
                5828,
                5844
            ],
            [
                5845,
                5859
            ],
            [
                5859,
                5883
            ],
            [
                5944,
                5946
            ],
            [
                5969,
                6016
            ],
            [
                6019,
                6045
            ],
            [
                6045,
                6076
            ],
            [
                6088,
                6155
            ],
            [
                6163,
                6169
            ],
            [
                6185,
                6193
            ],
            [
                6193,
                6214
            ],
            [
                6214,
                6235
            ],
            [
                6327,
                6382
            ],
            [
                6386,
                6448
            ],
            [
                6448,
                6474
            ],
            [
                6481,
                6494
            ],
            [
                6544,
                6581
            ],
            [
                6581,
                6587
            ],
            [
                6627,
                6705
            ],
            [
                6792,
                6810
            ],
            [
                6810,
                6823
            ],
            [
                6829,
                6858
            ],
            [
                6858,
                6869
            ],
            [
                6872,
                6949
            ],
            [
                6984,
                7061
            ],
            [
                7061,
                7099
            ],
            [
                7113,
                7142
            ],
            [
                7189,
                7260
            ],
            [
                7270,
                7282
            ],
            [
                7309,
                7311
            ],
            [
                7311,
                7327
            ],
            [
                7329,
                7330
            ],
            [
                7328,
                7329
            ],
            [
                7331,
                7342
            ],
            [
                7342,
                7411
            ],
            [
                7425,
                7466
            ],
            [
                7479,
                7490
            ],
            [
                7500,
                7570
            ],
            [
                7627,
                7716
            ],
            [
                7716,
                7752
            ],
            [
                7761,
                7783
            ],
            [
                7788,
                7857
            ],
            [
                7857,
                7898
            ],
            [
                7906,
                7910
            ],
            [
                7913,
                7955
            ],
            [
                8005,
                8007
            ],
            [
                8008,
                8018
            ],
            [
                8021,
                8045
            ],
            [
                8046,
                8087
            ],
            [
                8087,
                8134
            ],
            [
                8154,
                8175
            ],
            [
                8175,
                8268
            ],
            [
                8302,
                8304
            ],
            [
                8304,
                8350
            ],
            [
                8365,
                8375
            ],
            [
                8380,
                8383
            ],
            [
                8394,
                8405
            ],
            [
                8405,
                8418
            ],
            [
                8430,
                8440
            ],
            [
                8440,
                8504
            ],
            [
                8504,
                8519
            ],
            [
                8574,
                8623
            ],
            [
                8639,
                8679
            ],
            [
                8679,
                8712
            ],
            [
                8749,
                8787
            ],
            [
                8792,
                8793
            ],
            [
                8821,
                8826
            ],
            [
                8826,
                8848
            ],
            [
                8884,
                8922
            ],
            [
                8922,
                8927
            ],
            [
                8934,
                8991
            ],
            [
                8991,
                9018
            ],
            [
                9106,
                9108
            ],
            [
                9112,
                9120
            ],
            [
                9150,
                9156
            ],
            [
                9165,
                9190
            ],
            [
                9120,
                9121
            ],
            [
                9208,
                9247
            ],
            [
                9315,
                9354
            ],
            [
                9354,
                9361
            ],
            [
                9372,
                9382
            ],
            [
                9382,
                9417
            ],
            [
                9451,
                9522
            ],
            [
                9534,
                9562
            ],
            [
                9600,
                9602
            ],
            [
                9602,
                9605
            ],
            [
                9606,
                9661
            ],
            [
                9674,
                9676
            ],
            [
                9786,
                9814
            ],
            [
                9814,
                9842
            ],
            [
                9880,
                9931
            ],
            [
                9842,
                9843
            ],
            [
                9947,
                9958
            ],
            [
                9972,
                10007
            ],
            [
                10011,
                10015
            ],
            [
                10015,
                10029
            ],
            [
                10029,
                10040
            ],
            [
                10043,
                10063
            ],
            [
                10064,
                10089
            ],
            [
                10096,
                10098
            ],
            [
                10098,
                10194
            ],
            [
                10238,
                10257
            ],
            [
                10281,
                10294
            ],
            [
                10294,
                10303
            ],
            [
                10315,
                10369
            ],
            [
                10303,
                10304
            ],
            [
                10375,
                10410
            ],
            [
                10410,
                10442
            ],
            [
                10582,
                10591
            ],
            [
                10644,
                10645
            ],
            [
                10596,
                10625
            ],
            [
                10665,
                10668
            ],
            [
                10711,
                10757
            ],
            [
                10757,
                10807
            ],
            [
                10821,
                10828
            ],
            [
                10903,
                10905
            ],
            [
                10905,
                10960
            ],
            [
                10967,
                10978
            ],
            [
                11021,
                11041
            ],
            [
                10978,
                11020
            ],
            [
                11043,
                11085
            ],
            [
                11104,
                11112
            ],
            [
                11142,
                11144
            ],
            [
                11144,
                11176
            ],
            [
                11204,
                11219
            ],
            [
                11229,
                11266
            ],
            [
                11274,
                11293
            ],
            [
                11326,
                11328
            ],
            [
                11329,
                11380
            ],
            [
                11386,
                11393
            ],
            [
                11396,
                11399
            ],
            [
                11400,
                11437
            ],
            [
                11441,
                11467
            ],
            [
                11467,
                11499
            ],
            [
                11499,
                11510
            ],
            [
                11518,
                11527
            ],
            [
                11563,
                11570
            ],
            [
                11604,
                11618
            ],
            [
                11598,
                11599
            ],
            [
                11634,
                11640
            ],
            [
                11642,
                11665
            ],
            [
                11665,
                11674
            ],
            [
                11681,
                11689
            ],
            [
                11689,
                11695
            ],
            [
                11695,
                11718
            ],
            [
                11761,
                11791
            ],
            [
                11794,
                11805
            ],
            [
                11808,
                11840
            ],
            [
                11856,
                11899
            ],
            [
                11926,
                11927
            ],
            [
                11901,
                11916
            ],
            [
                11933,
                11940
            ],
            [
                11947,
                11967
            ],
            [
                12023,
                12060
            ],
            [
                12070,
                12159
            ],
            [
                12277,
                12282
            ],
            [
                12176,
                12179
            ],
            [
                12203,
                12207
            ],
            [
                12282,
                12283
            ],
            [
                12284,
                12352
            ],
            [
                12352,
                12364
            ],
            [
                12369,
                12423
            ],
            [
                12434,
                12444
            ],
            [
                12470,
                12473
            ],
            [
                12474,
                12557
            ],
            [
                12680,
                12702
            ],
            [
                12713,
                12733
            ],
            [
                12733,
                12796
            ],
            [
                12844,
                12846
            ],
            [
                12847,
                12873
            ],
            [
                12873,
                12877
            ],
            [
                12882,
                12900
            ],
            [
                12900,
                12968
            ],
            [
                12972,
                12982
            ],
            [
                12985,
                12999
            ],
            [
                13001,
                13015
            ],
            [
                13015,
                13031
            ],
            [
                13040,
                13054
            ],
            [
                13057,
                13070
            ],
            [
                13134,
                13147
            ],
            [
                13150,
                13164
            ],
            [
                13165,
                13168
            ],
            [
                13175,
                13196
            ],
            [
                13238,
                13272
            ],
            [
                13272,
                13280
            ],
            [
                13285,
                13293
            ],
            [
                13293,
                13343
            ],
            [
                13347,
                13350
            ],
            [
                13359,
                13369
            ],
            [
                13373,
                13389
            ],
            [
                13454,
                13459
            ],
            [
                13463,
                13469
            ],
            [
                13472,
                13503
            ],
            [
                13516,
                13546
            ],
            [
                13560,
                13580
            ],
            [
                13586,
                13618
            ],
            [
                13632,
                13633
            ],
            [
                13671,
                13680
            ],
            [
                13683,
                13693
            ],
            [
                13702,
                13703
            ],
            [
                13694,
                13702
            ],
            [
                13704,
                13747
            ],
            [
                13754,
                13760
            ],
            [
                13773,
                13806
            ],
            [
                13815,
                13818
            ],
            [
                13821,
                13884
            ],
            [
                13889,
                13903
            ],
            [
                13916,
                13992
            ],
            [
                14032,
                14052
            ],
            [
                14066,
                14099
            ],
            [
                14173,
                14175
            ],
            [
                14175,
                14218
            ],
            [
                14322,
                14324
            ],
            [
                14223,
                14226
            ],
            [
                14257,
                14297
            ],
            [
                14298,
                14302
            ],
            [
                14313,
                14321
            ],
            [
                14350,
                14352
            ],
            [
                14352,
                14457
            ],
            [
                14499,
                14501
            ],
            [
                14501,
                14518
            ],
            [
                14519,
                14546
            ],
            [
                14550,
                14573
            ],
            [
                14577,
                14581
            ],
            [
                14582,
                14602
            ],
            [
                14605,
                14627
            ],
            [
                14691,
                14692
            ],
            [
                14628,
                14671
            ],
            [
                14699,
                14718
            ],
            [
                14718,
                14744
            ],
            [
                14766,
                14799
            ],
            [
                14803,
                14812
            ],
            [
                14819,
                14895
            ],
            [
                14895,
                14911
            ],
            [
                14937,
                14954
            ],
            [
                14991,
                15010
            ],
            [
                15013,
                15028
            ],
            [
                15029,
                15056
            ],
            [
                15063,
                15115
            ],
            [
                15136,
                15143
            ],
            [
                15149,
                15203
            ],
            [
                15203,
                15206
            ],
            [
                15232,
                15243
            ],
            [
                15275,
                15276
            ],
            [
                15246,
                15274
            ],
            [
                15245,
                15246
            ],
            [
                15276,
                15281
            ],
            [
                15283,
                15286
            ],
            [
                15288,
                15293
            ],
            [
                15296,
                15341
            ],
            [
                15352,
                15364
            ],
            [
                15243,
                15244
            ],
            [
                15369,
                15378
            ],
            [
                15378,
                15410
            ],
            [
                15423,
                15450
            ],
            [
                15491,
                15508
            ],
            [
                15465,
                15474
            ],
            [
                15512,
                15520
            ],
            [
                15520,
                15561
            ],
            [
                15585,
                15587
            ],
            [
                15587,
                15603
            ],
            [
                15604,
                15622
            ],
            [
                15625,
                15647
            ],
            [
                15649,
                15651
            ],
            [
                15653,
                15656
            ],
            [
                15658,
                15678
            ],
            [
                15682,
                15684
            ],
            [
                15686,
                15688
            ],
            [
                15690,
                15710
            ],
            [
                15713,
                15743
            ],
            [
                15763,
                15770
            ],
            [
                15784,
                15786
            ],
            [
                15786,
                15820
            ],
            [
                15827,
                15829
            ],
            [
                15829,
                15861
            ],
            [
                15871,
                15898
            ],
            [
                15913,
                15914
            ],
            [
                15916,
                15918
            ],
            [
                15920,
                15922
            ],
            [
                15924,
                15953
            ],
            [
                15953,
                16003
            ],
            [
                16003,
                16024
            ],
            [
                16024,
                16047
            ],
            [
                16075,
                16077
            ],
            [
                16077,
                16089
            ],
            [
                16153,
                16163
            ],
            [
                16224,
                16254
            ],
            [
                16254,
                16262
            ],
            [
                16271,
                16308
            ],
            [
                16309,
                16321
            ],
            [
                16324,
                16334
            ],
            [
                16335,
                16337
            ],
            [
                16340,
                16373
            ],
            [
                16375,
                16391
            ],
            [
                16391,
                16397
            ],
            [
                16407,
                16424
            ],
            [
                16424,
                16449
            ],
            [
                16483,
                16507
            ],
            [
                16507,
                16526
            ],
            [
                16534,
                16542
            ],
            [
                16548,
                16620
            ],
            [
                16626,
                16628
            ],
            [
                16628,
                16650
            ],
            [
                16653,
                16680
            ],
            [
                16830,
                16840
            ],
            [
                16848,
                16855
            ],
            [
                16859,
                16910
            ],
            [
                16984,
                17008
            ],
            [
                17015,
                17023
            ],
            [
                17065,
                17100
            ],
            [
                17100,
                17134
            ],
            [
                17134,
                17136
            ],
            [
                17137,
                17141
            ],
            [
                17143,
                17150
            ],
            [
                17153,
                17214
            ],
            [
                17214,
                17217
            ],
            [
                17223,
                17227
            ],
            [
                17250,
                17268
            ],
            [
                17283,
                17324
            ],
            [
                17324,
                17384
            ],
            [
                17441,
                17447
            ],
            [
                17385,
                17421
            ],
            [
                17449,
                17487
            ],
            [
                17501,
                17503
            ],
            [
                17503,
                17536
            ],
            [
                17564,
                17603
            ],
            [
                17603,
                17607
            ],
            [
                17609,
                17694
            ],
            [
                17714,
                17720
            ],
            [
                17694,
                17697
            ],
            [
                17705,
                17707
            ],
            [
                17698,
                17704
            ],
            [
                17745,
                17781
            ],
            [
                17791,
                17804
            ],
            [
                17807,
                17837
            ],
            [
                17856,
                17864
            ],
            [
                17881,
                17923
            ],
            [
                17937,
                17975
            ],
            [
                17975,
                17990
            ],
            [
                18006,
                18041
            ],
            [
                18044,
                18066
            ],
            [
                18082,
                18107
            ],
            [
                18143,
                18168
            ],
            [
                18170,
                18210
            ],
            [
                18213,
                18275
            ],
            [
                18311,
                18339
            ],
            [
                18348,
                18351
            ],
            [
                18360,
                18468
            ],
            [
                18469,
                18559
            ],
            [
                18559,
                18598
            ],
            [
                18598,
                18616
            ],
            [
                18616,
                18649
            ],
            [
                18665,
                18703
            ],
            [
                18704,
                18716
            ],
            [
                18721,
                18767
            ],
            [
                18780,
                18782
            ],
            [
                18790,
                18815
            ],
            [
                18822,
                18857
            ],
            [
                18867,
                18869
            ],
            [
                18869,
                18883
            ],
            [
                18893,
                18900
            ],
            [
                18915,
                18925
            ],
            [
                18927,
                18984
            ],
            [
                18987,
                19089
            ],
            [
                19116,
                19130
            ],
            [
                19130,
                19203
            ],
            [
                19204,
                19214
            ],
            [
                19217,
                19228
            ],
            [
                19234,
                19254
            ],
            [
                19257,
                19276
            ],
            [
                19278,
                19327
            ],
            [
                19331,
                19332
            ],
            [
                19337,
                19407
            ],
            [
                19415,
                19443
            ],
            [
                19473,
                19507
            ],
            [
                19514,
                19537
            ],
            [
                19537,
                19562
            ],
            [
                19566,
                19568
            ],
            [
                19571,
                19585
            ],
            [
                19587,
                19611
            ],
            [
                19652,
                19653
            ],
            [
                19623,
                19626
            ],
            [
                19631,
                19638
            ],
            [
                19661,
                19663
            ],
            [
                19663,
                19668
            ],
            [
                19668,
                19710
            ],
            [
                19710,
                19712
            ],
            [
                19720,
                19731
            ],
            [
                19749,
                19756
            ],
            [
                19764,
                19779
            ],
            [
                19823,
                19824
            ],
            [
                19830,
                19928
            ],
            [
                19929,
                19938
            ],
            [
                19941,
                19950
            ],
            [
                19952,
                19970
            ],
            [
                19970,
                19991
            ],
            [
                19995,
                20010
            ],
            [
                20013,
                20075
            ],
            [
                20113,
                20115
            ],
            [
                20116,
                20139
            ],
            [
                20139,
                20192
            ],
            [
                20192,
                20235
            ],
            [
                20263,
                20284
            ],
            [
                20293,
                20303
            ],
            [
                20303,
                20365
            ],
            [
                20365,
                20427
            ],
            [
                20457,
                20499
            ],
            [
                20502,
                20585
            ],
            [
                20703,
                20705
            ],
            [
                20706,
                20715
            ],
            [
                20718,
                20743
            ],
            [
                20744,
                20761
            ],
            [
                20907,
                20956
            ],
            [
                20974,
                21048
            ],
            [
                21048,
                21091
            ],
            [
                21094,
                21123
            ],
            [
                21126,
                21155
            ],
            [
                21156,
                21185
            ],
            [
                21195,
                21200
            ],
            [
                21203,
                21223
            ],
            [
                21224,
                21284
            ],
            [
                21284,
                21313
            ],
            [
                21317,
                21331
            ],
            [
                21334,
                21349
            ],
            [
                21349,
                21499
            ],
            [
                21521,
                21551
            ],
            [
                21551,
                21565
            ],
            [
                21569,
                21588
            ],
            [
                21597,
                21612
            ],
            [
                21614,
                21626
            ],
            [
                21626,
                21668
            ],
            [
                21707,
                21709
            ],
            [
                21709,
                21757
            ],
            [
                21800,
                21801
            ],
            [
                21762,
                21766
            ],
            [
                21776,
                21777
            ],
            [
                21781,
                21786
            ],
            [
                21807,
                21820
            ],
            [
                21852,
                21943
            ],
            [
                21950,
                21958
            ],
            [
                21961,
                21978
            ],
            [
                22008,
                22022
            ],
            [
                22022,
                22067
            ],
            [
                22067,
                22129
            ],
            [
                22130,
                22138
            ],
            [
                22141,
                22156
            ],
            [
                22308,
                22316
            ],
            [
                22341,
                22356
            ],
            [
                22356,
                22372
            ],
            [
                22378,
                22380
            ],
            [
                22384,
                22386
            ],
            [
                22389,
                22398
            ],
            [
                22471,
                22490
            ],
            [
                22493,
                22512
            ],
            [
                22531,
                22577
            ],
            [
                22578,
                22598
            ],
            [
                22601,
                22611
            ],
            [
                22612,
                22637
            ],
            [
                22678,
                22699
            ]
        ],
        "row_chars": [
            [
                0,
                84
            ],
            [
                84,
                93
            ],
            [
                93,
                201
            ],
            [
                201,
                465
            ],
            [
                465,
                633
            ],
            [
                633,
                720
            ],
            [
                720,
                747
            ],
            [
                747,
                845
            ],
            [
                845,
                1037
            ],
            [
                1037,
                1134
            ],
            [
                1134,
                1198
            ],
            [
                1198,
                1207
            ],
            [
                1207,
                1343
            ],
            [
                1343,
                1366
            ],
            [
                1366,
                1382
            ],
            [
                1382,
                1408
            ],
            [
                1408,
                1505
            ],
            [
                1505,
                1525
            ],
            [
                1525,
                1649
            ],
            [
                1649,
                1683
            ],
            [
                1683,
                1792
            ],
            [
                1792,
                1838
            ],
            [
                1838,
                1894
            ],
            [
                1894,
                1906
            ],
            [
                1906,
                1979
            ],
            [
                1979,
                2056
            ],
            [
                2056,
                2086
            ],
            [
                2086,
                2185
            ],
            [
                2185,
                2235
            ],
            [
                2235,
                2258
            ],
            [
                2258,
                2275
            ],
            [
                2275,
                2300
            ],
            [
                2300,
                2346
            ],
            [
                2346,
                2431
            ],
            [
                2431,
                2515
            ],
            [
                2515,
                2584
            ],
            [
                2584,
                2608
            ],
            [
                2608,
                2626
            ],
            [
                2626,
                2682
            ],
            [
                2682,
                2731
            ],
            [
                2731,
                2751
            ],
            [
                2751,
                2855
            ],
            [
                2855,
                2912
            ],
            [
                2912,
                3036
            ],
            [
                3036,
                3135
            ],
            [
                3135,
                3166
            ],
            [
                3166,
                3184
            ],
            [
                3184,
                3278
            ],
            [
                3278,
                3341
            ],
            [
                3341,
                3444
            ],
            [
                3444,
                3498
            ],
            [
                3498,
                3599
            ],
            [
                3599,
                3609
            ],
            [
                3609,
                3673
            ],
            [
                3673,
                3712
            ],
            [
                3712,
                3759
            ],
            [
                3759,
                3839
            ],
            [
                3839,
                3861
            ],
            [
                3861,
                3966
            ],
            [
                3966,
                4043
            ],
            [
                4043,
                4077
            ],
            [
                4077,
                4109
            ],
            [
                4109,
                4273
            ],
            [
                4273,
                4295
            ],
            [
                4295,
                4642
            ],
            [
                4642,
                4675
            ],
            [
                4675,
                4697
            ],
            [
                4697,
                4731
            ],
            [
                4731,
                4832
            ],
            [
                4832,
                4944
            ],
            [
                4944,
                4970
            ],
            [
                4970,
                5111
            ],
            [
                5111,
                5211
            ],
            [
                5211,
                5402
            ],
            [
                5402,
                5473
            ],
            [
                5473,
                5560
            ],
            [
                5560,
                5691
            ],
            [
                5691,
                5750
            ],
            [
                5750,
                5828
            ],
            [
                5828,
                5844
            ],
            [
                5844,
                5859
            ],
            [
                5859,
                5946
            ],
            [
                5946,
                5969
            ],
            [
                5969,
                6019
            ],
            [
                6019,
                6045
            ],
            [
                6045,
                6193
            ],
            [
                6193,
                6214
            ],
            [
                6214,
                6382
            ],
            [
                6382,
                6448
            ],
            [
                6448,
                6496
            ],
            [
                6496,
                6544
            ],
            [
                6544,
                6581
            ],
            [
                6581,
                6705
            ],
            [
                6705,
                6792
            ],
            [
                6792,
                6810
            ],
            [
                6810,
                6858
            ],
            [
                6858,
                6984
            ],
            [
                6984,
                7061
            ],
            [
                7061,
                7142
            ],
            [
                7142,
                7311
            ],
            [
                7311,
                7342
            ],
            [
                7342,
                7500
            ],
            [
                7500,
                7573
            ],
            [
                7573,
                7592
            ],
            [
                7592,
                7608
            ],
            [
                7608,
                7627
            ],
            [
                7627,
                7716
            ],
            [
                7716,
                7755
            ],
            [
                7755,
                7857
            ],
            [
                7857,
                7901
            ],
            [
                7901,
                8007
            ],
            [
                8007,
                8045
            ],
            [
                8045,
                8087
            ],
            [
                8087,
                8134
            ],
            [
                8134,
                8175
            ],
            [
                8175,
                8304
            ],
            [
                8304,
                8405
            ],
            [
                8405,
                8440
            ],
            [
                8440,
                8504
            ],
            [
                8504,
                8679
            ],
            [
                8679,
                8712
            ],
            [
                8712,
                8749
            ],
            [
                8749,
                8820
            ],
            [
                8820,
                8826
            ],
            [
                8826,
                8850
            ],
            [
                8850,
                8867
            ],
            [
                8867,
                8884
            ],
            [
                8884,
                8922
            ],
            [
                8922,
                8991
            ],
            [
                8991,
                9108
            ],
            [
                9108,
                9247
            ],
            [
                9247,
                9296
            ],
            [
                9296,
                9315
            ],
            [
                9315,
                9354
            ],
            [
                9354,
                9372
            ],
            [
                9372,
                9382
            ],
            [
                9382,
                9602
            ],
            [
                9602,
                9676
            ],
            [
                9676,
                9814
            ],
            [
                9814,
                10010
            ],
            [
                10010,
                10015
            ],
            [
                10015,
                10029
            ],
            [
                10029,
                10043
            ],
            [
                10043,
                10063
            ],
            [
                10063,
                10098
            ],
            [
                10098,
                10229
            ],
            [
                10229,
                10260
            ],
            [
                10260,
                10281
            ],
            [
                10281,
                10294
            ],
            [
                10294,
                10410
            ],
            [
                10410,
                10757
            ],
            [
                10757,
                10905
            ],
            [
                10905,
                10978
            ],
            [
                10978,
                11144
            ],
            [
                11144,
                11328
            ],
            [
                11328,
                11383
            ],
            [
                11383,
                11440
            ],
            [
                11440,
                11467
            ],
            [
                11467,
                11499
            ],
            [
                11499,
                11563
            ],
            [
                11563,
                11665
            ],
            [
                11665,
                11689
            ],
            [
                11689,
                11695
            ],
            [
                11695,
                11718
            ],
            [
                11718,
                11753
            ],
            [
                11753,
                11761
            ],
            [
                11761,
                11808
            ],
            [
                11808,
                11967
            ],
            [
                11967,
                12159
            ],
            [
                12159,
                12284
            ],
            [
                12284,
                12352
            ],
            [
                12352,
                12557
            ],
            [
                12557,
                12733
            ],
            [
                12733,
                12846
            ],
            [
                12846,
                12873
            ],
            [
                12873,
                12900
            ],
            [
                12900,
                12971
            ],
            [
                12971,
                12999
            ],
            [
                12999,
                13015
            ],
            [
                13015,
                13034
            ],
            [
                13034,
                13071
            ],
            [
                13071,
                13133
            ],
            [
                13133,
                13164
            ],
            [
                13164,
                13198
            ],
            [
                13198,
                13237
            ],
            [
                13237,
                13272
            ],
            [
                13272,
                13293
            ],
            [
                13293,
                13453
            ],
            [
                13453,
                13503
            ],
            [
                13503,
                13634
            ],
            [
                13634,
                13670
            ],
            [
                13670,
                13693
            ],
            [
                13693,
                13821
            ],
            [
                13821,
                14175
            ],
            [
                14175,
                14352
            ],
            [
                14352,
                14501
            ],
            [
                14501,
                14518
            ],
            [
                14518,
                14546
            ],
            [
                14546,
                14576
            ],
            [
                14576,
                14627
            ],
            [
                14627,
                14718
            ],
            [
                14718,
                14765
            ],
            [
                14765,
                14802
            ],
            [
                14802,
                14819
            ],
            [
                14819,
                14895
            ],
            [
                14895,
                14976
            ],
            [
                14976,
                14990
            ],
            [
                14990,
                15028
            ],
            [
                15028,
                15062
            ],
            [
                15062,
                15118
            ],
            [
                15118,
                15203
            ],
            [
                15203,
                15378
            ],
            [
                15378,
                15520
            ],
            [
                15520,
                15587
            ],
            [
                15587,
                15603
            ],
            [
                15603,
                15625
            ],
            [
                15625,
                15681
            ],
            [
                15681,
                15786
            ],
            [
                15786,
                15829
            ],
            [
                15829,
                15953
            ],
            [
                15953,
                16003
            ],
            [
                16003,
                16024
            ],
            [
                16024,
                16077
            ],
            [
                16077,
                16092
            ],
            [
                16092,
                16152
            ],
            [
                16152,
                16166
            ],
            [
                16166,
                16224
            ],
            [
                16224,
                16254
            ],
            [
                16254,
                16308
            ],
            [
                16308,
                16334
            ],
            [
                16334,
                16391
            ],
            [
                16391,
                16424
            ],
            [
                16424,
                16507
            ],
            [
                16507,
                16628
            ],
            [
                16628,
                16653
            ],
            [
                16653,
                16681
            ],
            [
                16681,
                16756
            ],
            [
                16756,
                16825
            ],
            [
                16825,
                16858
            ],
            [
                16858,
                16910
            ],
            [
                16910,
                16984
            ],
            [
                16984,
                17023
            ],
            [
                17023,
                17100
            ],
            [
                17100,
                17134
            ],
            [
                17134,
                17153
            ],
            [
                17153,
                17214
            ],
            [
                17214,
                17324
            ],
            [
                17324,
                17503
            ],
            [
                17503,
                17603
            ],
            [
                17603,
                17694
            ],
            [
                17694,
                17781
            ],
            [
                17781,
                17791
            ],
            [
                17791,
                17837
            ],
            [
                17837,
                17881
            ],
            [
                17881,
                17975
            ],
            [
                17975,
                18005
            ],
            [
                18005,
                18107
            ],
            [
                18107,
                18139
            ],
            [
                18139,
                18213
            ],
            [
                18213,
                18559
            ],
            [
                18559,
                18598
            ],
            [
                18598,
                18616
            ],
            [
                18616,
                18703
            ],
            [
                18703,
                18782
            ],
            [
                18782,
                18869
            ],
            [
                18869,
                18927
            ],
            [
                18927,
                18987
            ],
            [
                18987,
                19130
            ],
            [
                19130,
                19203
            ],
            [
                19203,
                19217
            ],
            [
                19217,
                19228
            ],
            [
                19228,
                19330
            ],
            [
                19330,
                19443
            ],
            [
                19443,
                19537
            ],
            [
                19537,
                19565
            ],
            [
                19565,
                19622
            ],
            [
                19622,
                19663
            ],
            [
                19663,
                19668
            ],
            [
                19668,
                19710
            ],
            [
                19710,
                19748
            ],
            [
                19748,
                19779
            ],
            [
                19779,
                19928
            ],
            [
                19928,
                19970
            ],
            [
                19970,
                19994
            ],
            [
                19994,
                20115
            ],
            [
                20115,
                20139
            ],
            [
                20139,
                20192
            ],
            [
                20192,
                20303
            ],
            [
                20303,
                20365
            ],
            [
                20365,
                20456
            ],
            [
                20456,
                20502
            ],
            [
                20502,
                20705
            ],
            [
                20705,
                20743
            ],
            [
                20743,
                20761
            ],
            [
                20761,
                20791
            ],
            [
                20791,
                20906
            ],
            [
                20906,
                20959
            ],
            [
                20959,
                20973
            ],
            [
                20973,
                21048
            ],
            [
                21048,
                21155
            ],
            [
                21155,
                21223
            ],
            [
                21223,
                21284
            ],
            [
                21284,
                21316
            ],
            [
                21316,
                21349
            ],
            [
                21349,
                21551
            ],
            [
                21551,
                21588
            ],
            [
                21588,
                21597
            ],
            [
                21597,
                21626
            ],
            [
                21626,
                21709
            ],
            [
                21709,
                21852
            ],
            [
                21852,
                21943
            ],
            [
                21943,
                21961
            ],
            [
                21961,
                21979
            ],
            [
                21979,
                22008
            ],
            [
                22008,
                22022
            ],
            [
                22022,
                22067
            ],
            [
                22067,
                22129
            ],
            [
                22129,
                22141
            ],
            [
                22141,
                22156
            ],
            [
                22156,
                22307
            ],
            [
                22307,
                22319
            ],
            [
                22319,
                22340
            ],
            [
                22340,
                22356
            ],
            [
                22356,
                22383
            ],
            [
                22383,
                22398
            ],
            [
                22398,
                22471
            ],
            [
                22471,
                22493
            ],
            [
                22493,
                22577
            ],
            [
                22577,
                22611
            ],
            [
                22611,
                22701
            ]
        ]
    },
    "abridged": {
        "text": "At the time arranged, they set out on their walk to see Nicholas Higgins and his daughter. They both felt a strange kind of shyness in their mourning clothes, and drew close to each other in unspoken sympathy.\nNicholas was sitting by the fire-side in his accustomed corner, leaning his head upon his hand, his arm resting on his knee. He did not get up when he saw them.\n'Sit ye down, sit ye down. Fire's nearly out,' said he, giving it a vigorous poke, as if to turn attention away from himself. He was rather disorderly, to be sure, with several days' black growth of beard making his pale face look yet paler, and a well-worn jacket.\n'We thought we should have a good chance of finding you just after dinner-time,' said Margaret.\n'We have had our sorrow too, since we saw you,' said Mr. Hale.\n'Ay, ay. Sorrows is more plentiful than dinners just now; and my dinner hour stretches all day long; yo're pretty sure of finding me.'\n'Are you out of work?' asked Margaret.\n'Ay,' he replied shortly. Then, after a moment's silence, he added, looking up for the first time: 'I'm not wanting brass. Bess, poor lass, had a little stock under her pillow ready to give me, and Mary is fustian-cutting.'\n'We owe Mary some money,' said Mr. Hale.\n'If hoo takes it, I'll turn her out o' doors.'\n'But we owe her many thanks for her kind service,' began Mr. Hale again.\n'I ne'er thanked your daughter there for her deeds o' love to my poor wench. I ne'er could find th' words.'\n'Is it because of the strike you're out of work?' asked Margaret gently.\n'Strike's ended. I'm out o' work because I ne'er asked for it. And I ne'er asked for it, because good words is scarce, and bad words is plentiful.'\nHe was in a mood to take a surly pleasure in giving answers that were like riddles. But Margaret saw that he would like to be asked for the explanation.\n'And good words are-?'\n'Asking for work. \"Gi' me work\" means \"and I'll do it like a man.\" Them's good words. And bad words is saying \"Aha, my fine chap! Yo've been true to your order, and I'll be true to mine. Yo've been a poor faithful fool, so go and be d__d to yo'. There's no work for yo' here.\" Them's bad words. I'm not a fool; and if I was, folk ought to ha' taught me how to be wise. I could ha' learnt, if anyone had tried to teach me.'\n'Would it not be worth while,' said Mr. Hale, 'to ask your old master if he would take you back again?'\nHiggins uttered a low and bitter laugh.\n'Measter! if it's no offence, I'll ask yo' a question or two in my turn.'\n'You're quite welcome,' said Mr. Hale.\n'I reckon yo'n some way of earning your bread.'\n'You are quite right. I am a private tutor.'\n'So folk pay yo' for teaching them?'\n'Yes,' replied Mr. Hale, smiling.\n'And them that pays yo', dun they tell yo' what to do wi' the money they give you?'\n'No; to be sure not!'\n'They dunnot say, \"Yo' may have a brother, or a dear friend, who needs this brass; but yo' mun promise not to give it to him, or we'll just leave off dealing with yo'.\" They dunnot say that?'\n'No: to be sure not! I would not submit to that.'\n'Now yo've got it,' said Nicholas Higgins. 'Hamper's - where I worked - makes their men pledge they'll not give a penny to help th' Union or keep turnouts fro' clemming. They make nobbut liars and hypocrites. And that's a less sin, to my mind, than making men's hearts so hard that they'll not do a kindness to them as needs it. But I'll ne'er forswear mysel'. I'm a member o' the Union; and I think it's the only thing to do the workman any good. And I've been a turn-out, and known what it were to clem; so if I get a shilling, sixpence shall go to them who needs it. Consequence is, I dunnot see where I'm to get a shilling.'\n'Is that rule in force at all the mills?' asked Margaret.\n'I cannot say. It's a new regulation at ourn. But by-and-by they'll find out, tyrants makes liars.'\nThere was a little pause. Margaret was hesitating whether to say what was in her mind; she was unwilling to irritate one who was already gloomy enough. At last out it came. But in her soft tones it did not seem to annoy Higgins, only to perplex him.\n'Do you remember poor Boucher saying that the Union was a tyrant? I think he said it was the worst tyrant of all.'\nIt was a long while before he spoke. He was looking down into the fire, so she could not read the expression on his face.\n'I'll speak truth. A man leads a hard life who's not i' th' Union. But once i' the' Union, his interests are taken care on better nor he could do it for himsel'. It's the only way working men can get their rights, by all joining together. More the members, more chance for each man having justice done him. If any man is inclined to do himsel' or his neighbour a hurt, it puts a check on him. That's all we do i' th' Union. We can't clap folk into prison; but we can make a man's life so heavy that he's obliged to come in, and be wise in spite of himself. Boucher were a fool all along, and ne'er a worse fool than at th' last. We had public opinion on our side, till he and his sort began rioting and breaking laws. It were all o'er wi' the strike then.'\n'Then would it not have been better to have left him alone, and not forced him to join the Union? He did you no good; and you drove him mad.'\n'Margaret,' said her father, in a low and warning tone.\n'I like her,' said Higgins, suddenly. 'Hoo speaks plain out what's in her mind. Hoo doesn't comprehend th' Union for all that. It's our only power. I ha' read a bit o' poetry about a plough going o'er a daisy, as made tears come into my eyes. But the chap ne'er stopped driving the plough, for all he pitied the daisy. He'd too much sense for that. Th' Union's the plough, making ready the land for harvest-time. Such as Boucher - he's no daisy; he's liker a weed lounging over the ground - they must make up their mind to be put out o' the way. I'm sore vexed wi' him just now. I could go o'er him wi' a plough mysel'.'\n'Why? What has he been doing?'\n'He's ne'er out o' mischief, that man. First he must go raging like a mad fool, and kick up yon riot. Then he'd to go into hiding. And when Thornton didn't follow him nor go on wi' the prosecution, Boucher slunk back again to his house. And then, where think ye that he went? Why, to Hamper's. Damn him! He went wi' his mealy-mouthed face, asking for work, though he knowed well enough the new rule, o' pledging to give nought to th' Unions! Why, he'd a clemmed to death, if th' Union had na helped him. The good-for-nothing Judas! But I'll say this for Hamper, he drove Boucher away, and would na listen to him, though folk says the traitor cried like a babby!'\n'Oh! how shocking! how pitiful!' exclaimed Margaret. 'Higgins, I don't know you today. Don't you see how you've made Boucher what he is, by driving him into the Union against his will!'\nMade him what he is! What was he?\nGathering along the narrow street, came a hollow, measured sound, forcing itself on their attention. Many voices were hushed and low: there was a distinct, slow tramp of feet, the laboured walk of men carrying a heavy burden. They were all drawn towards the house-door by some impulse.\nSix men walked in the middle of the road, three of them policemen. Upon their shoulders they carried a door, taken off its hinges, on which lay some dead human creature; and the door was dripping. All the street turned out to see the procession, questioning the bearers, who answered reluctantly at last.\n'We found him i' th' brook in the field beyond there.'\n'Th' brook! - why, there's not water enough to drown him!'\n'He was a determined chap. He lay with his face downwards. He was sick o' living.'\nHiggins said in a weak, high voice: 'It's not John Boucher? He had na pluck enough. Sure! It's not John Boucher! I've a singing in my head, and cannot hear.'\nThey put the door down carefully, and all might see the poor drowned wretch - his glassy eyes staring upwards to the sky. His face was swollen and discoloured; his skin was stained by the water in the brook, which had been used for dyeing purposes. Water trickled through his hair.\nThrough all these disfigurements, Margaret recognised John Boucher. It seemed to be so sacrilegious to be peering into that poor distorted face, that she instinctively went forwards and softly covered the dead man's countenance with her handkerchief. Nicholas Higgins stood rooted to the spot. The men spoke together, and then one of them came up to Higgins.\n'Higgins, thou knowed him! Thou must go tell the wife. Do it gently, man, but do it quick, for we canna leave him here long.'\n'I canna go,' said Higgins. 'Dunnot ask me. I canna face her.'\n'Thou knows her best,' said the man.\n'I canna do it,' said Higgins. 'I'm felled wi' seeing him.'\n'Well, if thou wunnot thou wunnot. Some one must, though. It's a dree task; but it's a chance, every minute, that she'll hear on it some rougher way.'\n'Papa, you go,' said Margaret, in a low voice.\n'If I had time to think of what to say; but all at once-' Margaret saw that her father was trembling.\n'I will go,' said she.\n'Bless yo', miss, it will be a kind act; for she's been sickly, I hear, and few hereabouts know her.'\nMargaret knocked at the closed door; but there was such a noise of many little children, that she could hear no reply; indeed, she doubted if she was heard. Before she could recoil from her task, she opened the door and went in.\nMrs. Boucher was sitting in a rocking-chair by the dirty fireplace; it looked as if the house had not been cleaned for days.\nMargaret said something, she hardly knew what, her throat and mouth were so dry, and the children's noise so great. She tried again.\n'How are you, Mrs. Boucher? Very poorly, I'm afraid.'\n'I've no chance o' being well,' said she querulously. 'I'm left alone to manage these childer, and no food to keep 'em quiet. John should na ha' left me.'\n'How long is it since he went away?'\n'Four days. No one would give him work here, and he'd to go on tramp toward Greenfield. But he might ha' sent me some word.'\n'Oh, don't blame him,' said Margaret. 'He felt it deeply, I'm sure-'\n'Willto' hold thy din, and let me hear the lady speak!' she said, in no gentle voice, to a little urchin of about a year old. She apologised to Margaret. 'He's always mithering me for \"daddy\" and \"butty;\" and I ha' no butties to give him, and daddy's forgotten us, I think. He's his father's darling, he is.' With a sudden turn of mood, she began kissing the child fondly.\nMargaret laid her hand on the woman's arm. Their eyes met.\n'Poor little fellow!' said Margaret, slowly; 'he was his father's darling.'\n'He is his father's darling,' said the woman, rising hastily to face her. Neither of them spoke for a moment. Then Mrs. Boucher began in a low tone, gathering in wildness: 'He is his father's darling, I say. Poor folk can love their childer as well as rich. Why dunno yo' speak? Why dun yo' stare at me? Where's John? Oh, my God!' She sank back into the chair. Margaret lifted the child and put him into her arms.\n'He loved him,' said she.\n'Ay,' said the woman, shaking her head, 'he loved us a'. We had someone to love us once. It's a long time ago; but he did love us, he did. He loved this babby the best; but he loved me and I loved him, though I was calling him five minutes ago. Are yo' sure he's dead?' said she, trying to get up.\n'He is dead - drowned!'\n'Folk are brought round after they're dead-drowned. Here, whisth thee, child - whisth thee! Dunnot cry while my heart's breaking! Oh, where is my strength gone to? Oh, John - husband!'\nMargaret saved her from falling by catching her in her arms. She sat down and held the woman, her head lying on Margaret's shoulder. The other children, clustered together in affright, began to slowly understand the mystery of the scene; for their brains were dull and languid. Then they set up such a cry of despair that Margaret knew not how to bear it. Johnnie's cry was loudest of them all, though he knew not why he cried, poor little fellow.\nAs she held the quivering mother, Margaret heard a noise at the door.\n'Open it quick,' said she to the eldest child. 'Make no noise.' Seeing her father with the other men, she told him, 'Oh, papa, let them go upstairs very softly, and perhaps she will not hear them. She has fainted.'\n'It's as well for her, poor creature,' said a woman following the bearers of the dead. 'Stay, I'll run fetch a pillow and we'll let her down easy on the floor.'\nThis helpful neighbour was a great relief to Margaret; she was a new-comer in the district, but so kind and thoughtful that Margaret felt she was no longer needed; and that it would be better, perhaps, to leave and set an example of clearing the house, which was filled with idle, if sympathising gazers.\nShe looked round for Nicholas Higgins. He was not there. So she spoke to the woman who had helped in placing Mrs. Boucher on the floor.\n'Can you give these people a hint that they had better leave quietly? When she comes round, she should only find one or two that she knows. Papa, will you ask the men to go away? She cannot breathe, poor thing, with this crowd about her.'\nMargaret was kneeling down by Mrs. Boucher and bathing her face with vinegar; but in a few minutes she felt a gust of fresh air. She looked round, and saw a smile pass between her father and the woman.\n'What is it?' asked she.\n'Our good friend here,' replied her father, 'hit on a capital expedient for clearing the place.'\n'I bid 'em begone, and each take a child with 'em, and to mind that they were fatherless, and their mother a widow. The childer are sure of a bellyful today, and of kindness too. Does hoo know how he died?'\n'No,' said Margaret; 'I could not tell her all.'\n'Hoo must be told. See! Hoo's coming round; shall you or I do it? Or your father?'\n'No; you,' said Margaret.\nAs Mrs. Boucher recovered, the neighbour woman sat down on the floor, and took Mrs. Boucher's head and shoulders on her lap.\n'Neighbour,' said she, 'your man is dead. Guess yo' how he died?'\n'He were drowned,' said Mrs. Boucher, feebly, beginning to cry for the first time.\n'He were found drowned. He were coming home very hopeless o' aught on earth. He thought God could na be harder than men; happen as tender as a mother, or tenderer. I'm not saying he did right, and I'm not saying he did wrong. All I say is, may neither me nor mine ever have his sore heart.'\n'He has left me alone wi' a' these children!' moaned the widow, less distressed at the manner of the death than Margaret expected.\n'Not alone,' said Mr. Hale, solemnly. 'Who is with you? Who has promised to be a father to the fatherless?'\n'But I've getten six children, sir, and the eldest not eight years of age. I'm not meaning for to doubt His power, sir - only it needs a deal o' trust;' and she began to cry afresh.\n'Hoo'll be better able to talk tomorrow, sir,' said the neighbour. 'Best comfort now would be the feel of a child at her heart. I'm sorry they took the babby.'\n'I'll go for it,' said Margaret. And in a few minutes she returned, carrying Johnnie, his face all smeared with eating, and his hands loaded with treasures in the shape of shells, and the head of a plaster figure. She placed him in his mother's arms.\n'There!' said the woman, 'now you go. They'll cry together, and comfort together. I'll stop with her as long as I'm needed, and if yo' come tomorrow, yo' can talk with her.'\nAs Margaret and her father went slowly up the street, she paused at Higgins's closed door.\n'Shall we go in?' asked her father.\nThey knocked. There was no answer, so they tried the door. It was bolted, but they thought they heard him moving within.\n'Nicholas!' said Margaret. 'Nicholas! It is only us. Won't you let us in?'\n'No,' said he. 'Let me be, this day.'\nMr. Hale would have protested, but Margaret placed her finger on his lips.\n'I don't wonder at it,' said she. 'I myself long to be alone, after a day like this.'",
        "paragraph_chars": [
            [
                0,
                210
            ],
            [
                210,
                371
            ],
            [
                371,
                637
            ],
            [
                637,
                733
            ],
            [
                733,
                796
            ],
            [
                796,
                931
            ],
            [
                931,
                970
            ],
            [
                970,
                1194
            ],
            [
                1194,
                1235
            ],
            [
                1235,
                1282
            ],
            [
                1282,
                1355
            ],
            [
                1355,
                1463
            ],
            [
                1463,
                1536
            ],
            [
                1536,
                1684
            ],
            [
                1684,
                1837
            ],
            [
                1837,
                1860
            ],
            [
                1860,
                2283
            ],
            [
                2283,
                2387
            ],
            [
                2387,
                2427
            ],
            [
                2427,
                2501
            ],
            [
                2501,
                2540
            ],
            [
                2540,
                2588
            ],
            [
                2588,
                2633
            ],
            [
                2633,
                2670
            ],
            [
                2670,
                2704
            ],
            [
                2704,
                2788
            ],
            [
                2788,
                2810
            ],
            [
                2810,
                3002
            ],
            [
                3002,
                3052
            ],
            [
                3052,
                3681
            ],
            [
                3681,
                3739
            ],
            [
                3739,
                3839
            ],
            [
                3839,
                4089
            ],
            [
                4089,
                4204
            ],
            [
                4204,
                4326
            ],
            [
                4326,
                5083
            ],
            [
                5083,
                5225
            ],
            [
                5225,
                5281
            ],
            [
                5281,
                5902
            ],
            [
                5902,
                5933
            ],
            [
                5933,
                6596
            ],
            [
                6596,
                6782
            ],
            [
                6782,
                6816
            ],
            [
                6816,
                7102
            ],
            [
                7102,
                7407
            ],
            [
                7407,
                7462
            ],
            [
                7462,
                7521
            ],
            [
                7521,
                7604
            ],
            [
                7604,
                7762
            ],
            [
                7762,
                8044
            ],
            [
                8044,
                8403
            ],
            [
                8403,
                8529
            ],
            [
                8529,
                8592
            ],
            [
                8592,
                8629
            ],
            [
                8629,
                8689
            ],
            [
                8689,
                8840
            ],
            [
                8840,
                8887
            ],
            [
                8887,
                8989
            ],
            [
                8989,
                9012
            ],
            [
                9012,
                9114
            ],
            [
                9114,
                9343
            ],
            [
                9343,
                9468
            ],
            [
                9468,
                9601
            ],
            [
                9601,
                9655
            ],
            [
                9655,
                9810
            ],
            [
                9810,
                9847
            ],
            [
                9847,
                9972
            ],
            [
                9972,
                10041
            ],
            [
                10041,
                10414
            ],
            [
                10414,
                10473
            ],
            [
                10473,
                10549
            ],
            [
                10549,
                10963
            ],
            [
                10963,
                10989
            ],
            [
                10989,
                11287
            ],
            [
                11287,
                11311
            ],
            [
                11311,
                11496
            ],
            [
                11496,
                11944
            ],
            [
                11944,
                12014
            ],
            [
                12014,
                12229
            ],
            [
                12229,
                12390
            ],
            [
                12390,
                12695
            ],
            [
                12695,
                12831
            ],
            [
                12831,
                13070
            ],
            [
                13070,
                13272
            ],
            [
                13272,
                13297
            ],
            [
                13297,
                13394
            ],
            [
                13394,
                13601
            ],
            [
                13601,
                13650
            ],
            [
                13650,
                13733
            ],
            [
                13733,
                13759
            ],
            [
                13759,
                13884
            ],
            [
                13884,
                13950
            ],
            [
                13950,
                14033
            ],
            [
                14033,
                14324
            ],
            [
                14324,
                14455
            ],
            [
                14455,
                14563
            ],
            [
                14563,
                14745
            ],
            [
                14745,
                14905
            ],
            [
                14905,
                15156
            ],
            [
                15156,
                15330
            ],
            [
                15330,
                15421
            ],
            [
                15421,
                15457
            ],
            [
                15457,
                15578
            ],
            [
                15578,
                15653
            ],
            [
                15653,
                15691
            ],
            [
                15691,
                15766
            ],
            [
                15766,
                15851
            ]
        ],
        "segment_chars": [
            [
                0,
                91
            ],
            [
                91,
                210
            ],
            [
                210,
                335
            ],
            [
                335,
                371
            ],
            [
                371,
                398
            ],
            [
                398,
                497
            ],
            [
                497,
                637
            ],
            [
                637,
                733
            ],
            [
                733,
                796
            ],
            [
                796,
                805
            ],
            [
                805,
                931
            ],
            [
                931,
                954
            ],
            [
                954,
                970
            ],
            [
                970,
                996
            ],
            [
                996,
                1093
            ],
            [
                1093,
                1194
            ],
            [
                1194,
                1235
            ],
            [
                1235,
                1282
            ],
            [
                1282,
                1355
            ],
            [
                1355,
                1432
            ],
            [
                1432,
                1463
            ],
            [
                1463,
                1513
            ],
            [
                1513,
                1536
            ],
            [
                1536,
                1553
            ],
            [
                1553,
                1599
            ],
            [
                1599,
                1684
            ],
            [
                1684,
                1768
            ],
            [
                1768,
                1837
            ],
            [
                1837,
                1860
            ],
            [
                1860,
                1878
            ],
            [
                1878,
                1927
            ],
            [
                1927,
                1946
            ],
            [
                1946,
                1990
            ],
            [
                1990,
                2047
            ],
            [
                2047,
                2106
            ],
            [
                2106,
                2137
            ],
            [
                2137,
                2155
            ],
            [
                2155,
                2229
            ],
            [
                2229,
                2283
            ],
            [
                2283,
                2387
            ],
            [
                2387,
                2427
            ],
            [
                2427,
                2437
            ],
            [
                2437,
                2501
            ],
            [
                2501,
                2540
            ],
            [
                2540,
                2588
            ],
            [
                2588,
                2610
            ],
            [
                2610,
                2633
            ],
            [
                2633,
                2670
            ],
            [
                2670,
                2704
            ],
            [
                2704,
                2788
            ],
            [
                2788,
                2810
            ],
            [
                2810,
                2979
            ],
            [
                2979,
                3002
            ],
            [
                3002,
                3023
            ],
            [
                3023,
                3052
            ],
            [
                3052,
                3095
            ],
            [
                3095,
                3222
            ],
            [
                3222,
                3261
            ],
            [
                3261,
                3381
            ],
            [
                3381,
                3413
            ],
            [
                3413,
                3500
            ],
            [
                3500,
                3622
            ],
            [
                3622,
                3681
            ],
            [
                3681,
                3723
            ],
            [
                3723,
                3739
            ],
            [
                3739,
                3754
            ],
            [
                3754,
                3785
            ],
            [
                3785,
                3839
            ],
            [
                3839,
                3865
            ],
            [
                3865,
                3991
            ],
            [
                3991,
                4012
            ],
            [
                4012,
                4089
            ],
            [
                4089,
                4155
            ],
            [
                4155,
                4204
            ],
            [
                4204,
                4241
            ],
            [
                4241,
                4326
            ],
            [
                4326,
                4345
            ],
            [
                4345,
                4393
            ],
            [
                4393,
                4488
            ],
            [
                4488,
                4565
            ],
            [
                4565,
                4633
            ],
            [
                4633,
                4719
            ],
            [
                4719,
                4750
            ],
            [
                4750,
                4883
            ],
            [
                4883,
                4955
            ],
            [
                4955,
                5044
            ],
            [
                5044,
                5083
            ],
            [
                5083,
                5181
            ],
            [
                5181,
                5225
            ],
            [
                5225,
                5281
            ],
            [
                5281,
                5319
            ],
            [
                5319,
                5361
            ],
            [
                5361,
                5408
            ],
            [
                5408,
                5429
            ],
            [
                5429,
                5524
            ],
            [
                5524,
                5600
            ],
            [
                5600,
                5630
            ],
            [
                5630,
                5694
            ],
            [
                5694,
                5827
            ],
            [
                5827,
                5860
            ],
            [
                5860,
                5902
            ],
            [
                5902,
                5908
            ],
            [
                5908,
                5933
            ],
            [
                5933,
                5972
            ],
            [
                5972,
                6035
            ],
            [
                6035,
                6064
            ],
            [
                6064,
                6170
            ],
            [
                6170,
                6209
            ],
            [
                6209,
                6227
            ],
            [
                6227,
                6237
            ],
            [
                6237,
                6375
            ],
            [
                6375,
                6437
            ],
            [
                6437,
                6465
            ],
            [
                6465,
                6596
            ],
            [
                6596,
                6601
            ],
            [
                6601,
                6615
            ],
            [
                6615,
                6629
            ],
            [
                6629,
                6649
            ],
            [
                6649,
                6683
            ],
            [
                6683,
                6782
            ],
            [
                6782,
                6803
            ],
            [
                6803,
                6816
            ],
            [
                6816,
                6917
            ],
            [
                6917,
                7042
            ],
            [
                7042,
                7102
            ],
            [
                7102,
                7169
            ],
            [
                7169,
                7299
            ],
            [
                7299,
                7407
            ],
            [
                7407,
                7462
            ],
            [
                7462,
                7474
            ],
            [
                7474,
                7521
            ],
            [
                7521,
                7548
            ],
            [
                7548,
                7580
            ],
            [
                7580,
                7604
            ],
            [
                7604,
                7664
            ],
            [
                7664,
                7688
            ],
            [
                7688,
                7694
            ],
            [
                7694,
                7717
            ],
            [
                7717,
                7762
            ],
            [
                7762,
                7884
            ],
            [
                7884,
                8011
            ],
            [
                8011,
                8044
            ],
            [
                8044,
                8112
            ],
            [
                8112,
                8295
            ],
            [
                8295,
                8338
            ],
            [
                8338,
                8403
            ],
            [
                8403,
                8430
            ],
            [
                8430,
                8458
            ],
            [
                8458,
                8529
            ],
            [
                8529,
                8557
            ],
            [
                8557,
                8573
            ],
            [
                8573,
                8592
            ],
            [
                8592,
                8629
            ],
            [
                8629,
                8660
            ],
            [
                8660,
                8689
            ],
            [
                8689,
                8724
            ],
            [
                8724,
                8747
            ],
            [
                8747,
                8840
            ],
            [
                8840,
                8887
            ],
            [
                8887,
                8989
            ],
            [
                8989,
                9012
            ],
            [
                9012,
                9114
            ],
            [
                9114,
                9271
            ],
            [
                9271,
                9343
            ],
            [
                9343,
                9468
            ],
            [
                9468,
                9584
            ],
            [
                9584,
                9601
            ],
            [
                9601,
                9629
            ],
            [
                9629,
                9655
            ],
            [
                9655,
                9709
            ],
            [
                9709,
                9781
            ],
            [
                9781,
                9810
            ],
            [
                9810,
                9847
            ],
            [
                9847,
                9859
            ],
            [
                9859,
                9935
            ],
            [
                9935,
                9972
            ],
            [
                9972,
                10010
            ],
            [
                10010,
                10041
            ],
            [
                10041,
                10097
            ],
            [
                10097,
                10167
            ],
            [
                10167,
                10195
            ],
            [
                10195,
                10315
            ],
            [
                10315,
                10350
            ],
            [
                10350,
                10414
            ],
            [
                10414,
                10457
            ],
            [
                10457,
                10473
            ],
            [
                10473,
                10495
            ],
            [
                10495,
                10549
            ],
            [
                10549,
                10623
            ],
            [
                10623,
                10659
            ],
            [
                10659,
                10757
            ],
            [
                10757,
                10807
            ],
            [
                10807,
                10828
            ],
            [
                10828,
                10853
            ],
            [
                10853,
                10867
            ],
            [
                10867,
                10880
            ],
            [
                10880,
                10910
            ],
            [
                10910,
                10963
            ],
            [
                10963,
                10989
            ],
            [
                10989,
                11046
            ],
            [
                11046,
                11078
            ],
            [
                11078,
                11128
            ],
            [
                11128,
                11234
            ],
            [
                11234,
                11259
            ],
            [
                11259,
                11287
            ],
            [
                11287,
                11311
            ],
            [
                11311,
                11363
            ],
            [
                11363,
                11403
            ],
            [
                11403,
                11441
            ],
            [
                11441,
                11475
            ],
            [
                11475,
                11496
            ],
            [
                11496,
                11557
            ],
            [
                11557,
                11629
            ],
            [
                11629,
                11774
            ],
            [
                11774,
                11852
            ],
            [
                11852,
                11944
            ],
            [
                11944,
                12014
            ],
            [
                12014,
                12061
            ],
            [
                12061,
                12078
            ],
            [
                12078,
                12211
            ],
            [
                12211,
                12229
            ],
            [
                12229,
                12316
            ],
            [
                12316,
                12390
            ],
            [
                12390,
                12695
            ],
            [
                12695,
                12734
            ],
            [
                12734,
                12752
            ],
            [
                12752,
                12831
            ],
            [
                12831,
                12901
            ],
            [
                12901,
                12971
            ],
            [
                12971,
                13010
            ],
            [
                13010,
                13070
            ],
            [
                13070,
                13199
            ],
            [
                13199,
                13272
            ],
            [
                13272,
                13286
            ],
            [
                13286,
                13297
            ],
            [
                13297,
                13394
            ],
            [
                13394,
                13510
            ],
            [
                13510,
                13573
            ],
            [
                13573,
                13601
            ],
            [
                13601,
                13650
            ],
            [
                13650,
                13669
            ],
            [
                13669,
                13674
            ],
            [
                13674,
                13716
            ],
            [
                13716,
                13733
            ],
            [
                13733,
                13759
            ],
            [
                13759,
                13884
            ],
            [
                13884,
                13926
            ],
            [
                13926,
                13950
            ],
            [
                13950,
                14033
            ],
            [
                14033,
                14057
            ],
            [
                14057,
                14110
            ],
            [
                14110,
                14197
            ],
            [
                14197,
                14259
            ],
            [
                14259,
                14324
            ],
            [
                14324,
                14370
            ],
            [
                14370,
                14455
            ],
            [
                14455,
                14493
            ],
            [
                14493,
                14511
            ],
            [
                14511,
                14563
            ],
            [
                14563,
                14638
            ],
            [
                14638,
                14745
            ],
            [
                14745,
                14812
            ],
            [
                14812,
                14873
            ],
            [
                14873,
                14905
            ],
            [
                14905,
                14938
            ],
            [
                14938,
                15119
            ],
            [
                15119,
                15156
            ],
            [
                15156,
                15165
            ],
            [
                15165,
                15194
            ],
            [
                15194,
                15238
            ],
            [
                15238,
                15330
            ],
            [
                15330,
                15421
            ],
            [
                15421,
                15439
            ],
            [
                15439,
                15457
            ],
            [
                15457,
                15471
            ],
            [
                15471,
                15516
            ],
            [
                15516,
                15578
            ],
            [
                15578,
                15590
            ],
            [
                15590,
                15605
            ],
            [
                15605,
                15616
            ],
            [
                15616,
                15631
            ],
            [
                15631,
                15653
            ],
            [
                15653,
                15668
            ],
            [
                15668,
                15691
            ],
            [
                15691,
                15766
            ],
            [
                15766,
                15800
            ],
            [
                15800,
                15851
            ]
        ],
        "overlap_chars": [
            [
                0,
                20
            ],
            [
                20,
                91
            ],
            [
                91,
                100
            ],
            [
                106,
                140
            ],
            [
                157,
                162
            ],
            [
                163,
                167
            ],
            [
                168,
                210
            ],
            [
                210,
                272
            ],
            [
                274,
                335
            ],
            [
                335,
                369
            ],
            [
                369,
                371
            ],
            [
                376,
                398
            ],
            [
                398,
                404
            ],
            [
                412,
                415
            ],
            [
                418,
                497
            ],
            [
                497,
                539
            ],
            [
                540,
                553
            ],
            [
                554,
                559
            ],
            [
                560,
                566
            ],
            [
                567,
                569
            ],
            [
                570,
                575
            ],
            [
                576,
                618
            ],
            [
                629,
                635
            ],
            [
                635,
                637
            ],
            [
                638,
                692
            ],
            [
                693,
                715
            ],
            [
                718,
                733
            ],
            [
                734,
                756
            ],
            [
                757,
                778
            ],
            [
                781,
                796
            ],
            [
                797,
                805
            ],
            [
                805,
                853
            ],
            [
                858,
                886
            ],
            [
                887,
                890
            ],
            [
                895,
                928
            ],
            [
                932,
                951
            ],
            [
                954,
                970
            ],
            [
                971,
                973
            ],
            [
                976,
                996
            ],
            [
                996,
                1068
            ],
            [
                1070,
                1093
            ],
            [
                1093,
                1145
            ],
            [
                1146,
                1154
            ],
            [
                1162,
                1191
            ],
            [
                1195,
                1217
            ],
            [
                1220,
                1233
            ],
            [
                1233,
                1235
            ],
            [
                1236,
                1279
            ],
            [
                1283,
                1330
            ],
            [
                1333,
                1355
            ],
            [
                1356,
                1363
            ],
            [
                1372,
                1385
            ],
            [
                1392,
                1432
            ],
            [
                1432,
                1460
            ],
            [
                1464,
                1510
            ],
            [
                1513,
                1536
            ],
            [
                1543,
                1553
            ],
            [
                1553,
                1599
            ],
            [
                1599,
                1681
            ],
            [
                1684,
                1768
            ],
            [
                1768,
                1837
            ],
            [
                1838,
                1856
            ],
            [
                1861,
                1878
            ],
            [
                1879,
                1890
            ],
            [
                1892,
                1897
            ],
            [
                1899,
                1924
            ],
            [
                1927,
                1944
            ],
            [
                1946,
                1949
            ],
            [
                1950,
                1969
            ],
            [
                1970,
                1971
            ],
            [
                1971,
                1990
            ],
            [
                1990,
                2008
            ],
            [
                2014,
                2047
            ],
            [
                2047,
                2064
            ],
            [
                2065,
                2078
            ],
            [
                2078,
                2079
            ],
            [
                2080,
                2094
            ],
            [
                2096,
                2106
            ],
            [
                2106,
                2134
            ],
            [
                2137,
                2155
            ],
            [
                2155,
                2227
            ],
            [
                2227,
                2229
            ],
            [
                2229,
                2236
            ],
            [
                2237,
                2251
            ],
            [
                2259,
                2280
            ],
            [
                2284,
                2311
            ],
            [
                2314,
                2328
            ],
            [
                2330,
                2384
            ],
            [
                2403,
                2427
            ],
            [
                2430,
                2437
            ],
            [
                2437,
                2498
            ],
            [
                2502,
                2522
            ],
            [
                2525,
                2540
            ],
            [
                2541,
                2585
            ],
            [
                2589,
                2610
            ],
            [
                2610,
                2611
            ],
            [
                2615,
                2630
            ],
            [
                2637,
                2641
            ],
            [
                2642,
                2667
            ],
            [
                2671,
                2674
            ],
            [
                2677,
                2703
            ],
            [
                2705,
                2751
            ],
            [
                2752,
                2776
            ],
            [
                2782,
                2785
            ],
            [
                2789,
                2807
            ],
            [
                2810,
                2812
            ],
            [
                2816,
                2827
            ],
            [
                2828,
                2829
            ],
            [
                2829,
                2857
            ],
            [
                2858,
                2862
            ],
            [
                2863,
                2869
            ],
            [
                2869,
                2874
            ],
            [
                2881,
                2885
            ],
            [
                2886,
                2891
            ],
            [
                2891,
                2916
            ],
            [
                2917,
                2919
            ],
            [
                2920,
                2934
            ],
            [
                2934,
                2935
            ],
            [
                2939,
                2975
            ],
            [
                2979,
                2999
            ],
            [
                3003,
                3021
            ],
            [
                3025,
                3030
            ],
            [
                3042,
                3044
            ],
            [
                3045,
                3049
            ],
            [
                3053,
                3069
            ],
            [
                3072,
                3094
            ],
            [
                3095,
                3096
            ],
            [
                3102,
                3104
            ],
            [
                3105,
                3106
            ],
            [
                3107,
                3121
            ],
            [
                3124,
                3146
            ],
            [
                3147,
                3202
            ],
            [
                3202,
                3222
            ],
            [
                3222,
                3226
            ],
            [
                3227,
                3231
            ],
            [
                3232,
                3238
            ],
            [
                3239,
                3261
            ],
            [
                3261,
                3295
            ],
            [
                3308,
                3379
            ],
            [
                3379,
                3381
            ],
            [
                3381,
                3410
            ],
            [
                3413,
                3486
            ],
            [
                3490,
                3500
            ],
            [
                3500,
                3543
            ],
            [
                3549,
                3607
            ],
            [
                3618,
                3620
            ],
            [
                3620,
                3622
            ],
            [
                3622,
                3678
            ],
            [
                3682,
                3694
            ],
            [
                3695,
                3720
            ],
            [
                3723,
                3739
            ],
            [
                3740,
                3754
            ],
            [
                3754,
                3778
            ],
            [
                3783,
                3785
            ],
            [
                3789,
                3836
            ],
            [
                3839,
                3865
            ],
            [
                3865,
                3896
            ],
            [
                3900,
                3967
            ],
            [
                3976,
                3982
            ],
            [
                3983,
                3991
            ],
            [
                3991,
                4012
            ],
            [
                4012,
                4033
            ],
            [
                4034,
                4089
            ],
            [
                4093,
                4155
            ],
            [
                4155,
                4181
            ],
            [
                4188,
                4201
            ],
            [
                4204,
                4241
            ],
            [
                4241,
                4247
            ],
            [
                4248,
                4326
            ],
            [
                4327,
                4345
            ],
            [
                4345,
                4358
            ],
            [
                4364,
                4393
            ],
            [
                4393,
                4404
            ],
            [
                4408,
                4485
            ],
            [
                4488,
                4565
            ],
            [
                4565,
                4603
            ],
            [
                4604,
                4633
            ],
            [
                4633,
                4704
            ],
            [
                4705,
                4717
            ],
            [
                4717,
                4719
            ],
            [
                4719,
                4735
            ],
            [
                4736,
                4737
            ],
            [
                4737,
                4738
            ],
            [
                4739,
                4750
            ],
            [
                4750,
                4819
            ],
            [
                4820,
                4861
            ],
            [
                4862,
                4873
            ],
            [
                4883,
                4953
            ],
            [
                4955,
                5044
            ],
            [
                5044,
                5080
            ],
            [
                5089,
                5111
            ],
            [
                5112,
                5181
            ],
            [
                5181,
                5222
            ],
            [
                5230,
                5234
            ],
            [
                5237,
                5279
            ],
            [
                5279,
                5281
            ],
            [
                5282,
                5292
            ],
            [
                5295,
                5319
            ],
            [
                5320,
                5361
            ],
            [
                5361,
                5408
            ],
            [
                5408,
                5429
            ],
            [
                5429,
                5522
            ],
            [
                5522,
                5524
            ],
            [
                5524,
                5570
            ],
            [
                5571,
                5581
            ],
            [
                5582,
                5585
            ],
            [
                5589,
                5600
            ],
            [
                5600,
                5613
            ],
            [
                5620,
                5630
            ],
            [
                5630,
                5694
            ],
            [
                5694,
                5709
            ],
            [
                5720,
                5769
            ],
            [
                5787,
                5827
            ],
            [
                5827,
                5860
            ],
            [
                5860,
                5898
            ],
            [
                5898,
                5899
            ],
            [
                5903,
                5908
            ],
            [
                5908,
                5930
            ],
            [
                5934,
                5972
            ],
            [
                5972,
                5977
            ],
            [
                5978,
                6035
            ],
            [
                6035,
                6062
            ],
            [
                6062,
                6064
            ],
            [
                6073,
                6081
            ],
            [
                6082,
                6088
            ],
            [
                6104,
                6129
            ],
            [
                6129,
                6130
            ],
            [
                6131,
                6170
            ],
            [
                6170,
                6209
            ],
            [
                6209,
                6216
            ],
            [
                6227,
                6237
            ],
            [
                6237,
                6272
            ],
            [
                6273,
                6344
            ],
            [
                6345,
                6373
            ],
            [
                6373,
                6375
            ],
            [
                6375,
                6378
            ],
            [
                6380,
                6435
            ],
            [
                6435,
                6437
            ],
            [
                6437,
                6465
            ],
            [
                6465,
                6493
            ],
            [
                6493,
                6544
            ],
            [
                6544,
                6545
            ],
            [
                6546,
                6557
            ],
            [
                6558,
                6593
            ],
            [
                6597,
                6601
            ],
            [
                6601,
                6615
            ],
            [
                6615,
                6626
            ],
            [
                6629,
                6649
            ],
            [
                6650,
                6675
            ],
            [
                6681,
                6683
            ],
            [
                6683,
                6779
            ],
            [
                6782,
                6801
            ],
            [
                6803,
                6816
            ],
            [
                6816,
                6825
            ],
            [
                6826,
                6880
            ],
            [
                6880,
                6881
            ],
            [
                6882,
                6917
            ],
            [
                6917,
                6949
            ],
            [
                6950,
                6959
            ],
            [
                6960,
                6961
            ],
            [
                6962,
                6991
            ],
            [
                6992,
                6995
            ],
            [
                6996,
                7042
            ],
            [
                7042,
                7092
            ],
            [
                7093,
                7100
            ],
            [
                7100,
                7102
            ],
            [
                7102,
                7157
            ],
            [
                7158,
                7169
            ],
            [
                7169,
                7189
            ],
            [
                7190,
                7232
            ],
            [
                7233,
                7275
            ],
            [
                7276,
                7284
            ],
            [
                7297,
                7299
            ],
            [
                7299,
                7331
            ],
            [
                7332,
                7347
            ],
            [
                7348,
                7385
            ],
            [
                7386,
                7405
            ],
            [
                7405,
                7407
            ],
            [
                7408,
                7459
            ],
            [
                7465,
                7472
            ],
            [
                7476,
                7479
            ],
            [
                7481,
                7518
            ],
            [
                7522,
                7548
            ],
            [
                7548,
                7580
            ],
            [
                7580,
                7591
            ],
            [
                7592,
                7601
            ],
            [
                7604,
                7611
            ],
            [
                7612,
                7626
            ],
            [
                7626,
                7627
            ],
            [
                7633,
                7639
            ],
            [
                7641,
                7664
            ],
            [
                7664,
                7673
            ],
            [
                7680,
                7688
            ],
            [
                7688,
                7694
            ],
            [
                7694,
                7717
            ],
            [
                7717,
                7747
            ],
            [
                7748,
                7759
            ],
            [
                7762,
                7794
            ],
            [
                7794,
                7837
            ],
            [
                7838,
                7839
            ],
            [
                7840,
                7855
            ],
            [
                7856,
                7863
            ],
            [
                7864,
                7884
            ],
            [
                7884,
                7921
            ],
            [
                7922,
                8011
            ],
            [
                8011,
                8016
            ],
            [
                8034,
                8037
            ],
            [
                8038,
                8042
            ],
            [
                8042,
                8043
            ],
            [
                8044,
                8112
            ],
            [
                8112,
                8124
            ],
            [
                8128,
                8182
            ],
            [
                8183,
                8193
            ],
            [
                8194,
                8197
            ],
            [
                8212,
                8295
            ],
            [
                8295,
                8317
            ],
            [
                8318,
                8338
            ],
            [
                8338,
                8401
            ],
            [
                8401,
                8403
            ],
            [
                8404,
                8430
            ],
            [
                8430,
                8434
            ],
            [
                8440,
                8458
            ],
            [
                8458,
                8526
            ],
            [
                8530,
                8540
            ],
            [
                8543,
                8557
            ],
            [
                8559,
                8573
            ],
            [
                8573,
                8589
            ],
            [
                8598,
                8612
            ],
            [
                8615,
                8628
            ],
            [
                8630,
                8643
            ],
            [
                8646,
                8660
            ],
            [
                8661,
                8664
            ],
            [
                8665,
                8686
            ],
            [
                8690,
                8724
            ],
            [
                8724,
                8732
            ],
            [
                8739,
                8747
            ],
            [
                8747,
                8797
            ],
            [
                8803,
                8806
            ],
            [
                8810,
                8820
            ],
            [
                8821,
                8837
            ],
            [
                8841,
                8846
            ],
            [
                8847,
                8853
            ],
            [
                8856,
                8887
            ],
            [
                8888,
                8918
            ],
            [
                8922,
                8942
            ],
            [
                8945,
                8977
            ],
            [
                8987,
                8988
            ],
            [
                8990,
                8999
            ],
            [
                9002,
                9012
            ],
            [
                9012,
                9013
            ],
            [
                9013,
                9021
            ],
            [
                9024,
                9067
            ],
            [
                9068,
                9074
            ],
            [
                9074,
                9107
            ],
            [
                9108,
                9111
            ],
            [
                9114,
                9177
            ],
            [
                9178,
                9192
            ],
            [
                9193,
                9269
            ],
            [
                9288,
                9308
            ],
            [
                9308,
                9341
            ],
            [
                9341,
                9343
            ],
            [
                9343,
                9386
            ],
            [
                9387,
                9389
            ],
            [
                9390,
                9393
            ],
            [
                9400,
                9440
            ],
            [
                9445,
                9449
            ],
            [
                9458,
                9466
            ],
            [
                9466,
                9468
            ],
            [
                9468,
                9573
            ],
            [
                9582,
                9584
            ],
            [
                9584,
                9601
            ],
            [
                9602,
                9629
            ],
            [
                9629,
                9652
            ],
            [
                9656,
                9660
            ],
            [
                9664,
                9684
            ],
            [
                9687,
                9709
            ],
            [
                9709,
                9710
            ],
            [
                9710,
                9753
            ],
            [
                9762,
                9781
            ],
            [
                9781,
                9807
            ],
            [
                9811,
                9844
            ],
            [
                9848,
                9857
            ],
            [
                9859,
                9935
            ],
            [
                9935,
                9951
            ],
            [
                9952,
                9969
            ],
            [
                9973,
                9992
            ],
            [
                9995,
                10010
            ],
            [
                10011,
                10038
            ],
            [
                10042,
                10094
            ],
            [
                10105,
                10112
            ],
            [
                10113,
                10167
            ],
            [
                10167,
                10170
            ],
            [
                10182,
                10193
            ],
            [
                10195,
                10196
            ],
            [
                10196,
                10224
            ],
            [
                10225,
                10226
            ],
            [
                10226,
                10231
            ],
            [
                10233,
                10236
            ],
            [
                10238,
                10243
            ],
            [
                10246,
                10291
            ],
            [
                10292,
                10304
            ],
            [
                10304,
                10305
            ],
            [
                10306,
                10315
            ],
            [
                10315,
                10347
            ],
            [
                10350,
                10377
            ],
            [
                10378,
                10395
            ],
            [
                10396,
                10405
            ],
            [
                10406,
                10414
            ],
            [
                10414,
                10455
            ],
            [
                10455,
                10457
            ],
            [
                10457,
                10473
            ],
            [
                10474,
                10492
            ],
            [
                10495,
                10517
            ],
            [
                10519,
                10521
            ],
            [
                10522,
                10525
            ],
            [
                10526,
                10546
            ],
            [
                10550,
                10552
            ],
            [
                10553,
                10555
            ],
            [
                10556,
                10576
            ],
            [
                10579,
                10609
            ],
            [
                10610,
                10617
            ],
            [
                10621,
                10623
            ],
            [
                10623,
                10657
            ],
            [
                10657,
                10659
            ],
            [
                10659,
                10691
            ],
            [
                10692,
                10719
            ],
            [
                10719,
                10720
            ],
            [
                10722,
                10724
            ],
            [
                10725,
                10727
            ],
            [
                10728,
                10757
            ],
            [
                10757,
                10807
            ],
            [
                10807,
                10828
            ],
            [
                10828,
                10851
            ],
            [
                10851,
                10853
            ],
            [
                10853,
                10865
            ],
            [
                10867,
                10877
            ],
            [
                10880,
                10910
            ],
            [
                10910,
                10918
            ],
            [
                10926,
                10963
            ],
            [
                10964,
                10976
            ],
            [
                10979,
                10989
            ],
            [
                10990,
                10992
            ],
            [
                10995,
                11028
            ],
            [
                11030,
                11046
            ],
            [
                11046,
                11052
            ],
            [
                11061,
                11078
            ],
            [
                11078,
                11103
            ],
            [
                11104,
                11128
            ],
            [
                11128,
                11147
            ],
            [
                11148,
                11156
            ],
            [
                11156,
                11228
            ],
            [
                11232,
                11234
            ],
            [
                11234,
                11256
            ],
            [
                11259,
                11286
            ],
            [
                11288,
                11298
            ],
            [
                11301,
                11308
            ],
            [
                11312,
                11363
            ],
            [
                11363,
                11387
            ],
            [
                11395,
                11403
            ],
            [
                11406,
                11441
            ],
            [
                11441,
                11475
            ],
            [
                11475,
                11477
            ],
            [
                11479,
                11483
            ],
            [
                11486,
                11493
            ],
            [
                11496,
                11557
            ],
            [
                11557,
                11560
            ],
            [
                11565,
                11569
            ],
            [
                11570,
                11588
            ],
            [
                11588,
                11629
            ],
            [
                11629,
                11689
            ],
            [
                11690,
                11696
            ],
            [
                11697,
                11733
            ],
            [
                11734,
                11772
            ],
            [
                11772,
                11774
            ],
            [
                11779,
                11812
            ],
            [
                11813,
                11852
            ],
            [
                11852,
                11856
            ],
            [
                11859,
                11944
            ],
            [
                11944,
                11950
            ],
            [
                11956,
                11959
            ],
            [
                11960,
                11962
            ],
            [
                11970,
                11976
            ],
            [
                11978,
                12014
            ],
            [
                12015,
                12028
            ],
            [
                12031,
                12061
            ],
            [
                12067,
                12075
            ],
            [
                12131,
                12173
            ],
            [
                12173,
                12211
            ],
            [
                12211,
                12226
            ],
            [
                12230,
                12265
            ],
            [
                12268,
                12290
            ],
            [
                12291,
                12316
            ],
            [
                12321,
                12346
            ],
            [
                12347,
                12387
            ],
            [
                12390,
                12452
            ],
            [
                12453,
                12481
            ],
            [
                12482,
                12485
            ],
            [
                12486,
                12594
            ],
            [
                12605,
                12695
            ],
            [
                12695,
                12734
            ],
            [
                12734,
                12752
            ],
            [
                12752,
                12785
            ],
            [
                12793,
                12831
            ],
            [
                12832,
                12844
            ],
            [
                12845,
                12891
            ],
            [
                12899,
                12901
            ],
            [
                12901,
                12926
            ],
            [
                12934,
                12969
            ],
            [
                12969,
                12971
            ],
            [
                12971,
                12985
            ],
            [
                12990,
                12997
            ],
            [
                12998,
                13008
            ],
            [
                13010,
                13067
            ],
            [
                13070,
                13172
            ],
            [
                13185,
                13199
            ],
            [
                13199,
                13272
            ],
            [
                13273,
                13283
            ],
            [
                13286,
                13297
            ],
            [
                13298,
                13318
            ],
            [
                13321,
                13340
            ],
            [
                13342,
                13391
            ],
            [
                13395,
                13396
            ],
            [
                13401,
                13471
            ],
            [
                13482,
                13510
            ],
            [
                13510,
                13544
            ],
            [
                13550,
                13573
            ],
            [
                13573,
                13598
            ],
            [
                13602,
                13604
            ],
            [
                13607,
                13621
            ],
            [
                13623,
                13647
            ],
            [
                13650,
                13651
            ],
            [
                13651,
                13654
            ],
            [
                13660,
                13667
            ],
            [
                13667,
                13669
            ],
            [
                13669,
                13674
            ],
            [
                13674,
                13716
            ],
            [
                13716,
                13718
            ],
            [
                13719,
                13730
            ],
            [
                13734,
                13741
            ],
            [
                13744,
                13759
            ],
            [
                13765,
                13766
            ],
            [
                13786,
                13884
            ],
            [
                13885,
                13894
            ],
            [
                13897,
                13906
            ],
            [
                13908,
                13926
            ],
            [
                13926,
                13947
            ],
            [
                13951,
                13966
            ],
            [
                13969,
                14031
            ],
            [
                14031,
                14033
            ],
            [
                14034,
                14057
            ],
            [
                14057,
                14110
            ],
            [
                14110,
                14153
            ],
            [
                14161,
                14182
            ],
            [
                14187,
                14197
            ],
            [
                14197,
                14259
            ],
            [
                14259,
                14321
            ],
            [
                14325,
                14367
            ],
            [
                14370,
                14453
            ],
            [
                14453,
                14455
            ],
            [
                14456,
                14465
            ],
            [
                14468,
                14493
            ],
            [
                14494,
                14511
            ],
            [
                14511,
                14560
            ],
            [
                14564,
                14638
            ],
            [
                14638,
                14681
            ],
            [
                14684,
                14713
            ],
            [
                14716,
                14745
            ],
            [
                14746,
                14775
            ],
            [
                14784,
                14789
            ],
            [
                14792,
                14812
            ],
            [
                14813,
                14873
            ],
            [
                14873,
                14902
            ],
            [
                14906,
                14920
            ],
            [
                14923,
                14938
            ],
            [
                14938,
                15088
            ],
            [
                15089,
                15119
            ],
            [
                15119,
                15133
            ],
            [
                15137,
                15156
            ],
            [
                15165,
                15180
            ],
            [
                15182,
                15194
            ],
            [
                15194,
                15236
            ],
            [
                15236,
                15238
            ],
            [
                15238,
                15286
            ],
            [
                15289,
                15290
            ],
            [
                15291,
                15295
            ],
            [
                15304,
                15305
            ],
            [
                15308,
                15313
            ],
            [
                15314,
                15327
            ],
            [
                15330,
                15421
            ],
            [
                15428,
                15436
            ],
            [
                15439,
                15456
            ],
            [
                15457,
                15471
            ],
            [
                15471,
                15516
            ],
            [
                15516,
                15578
            ],
            [
                15579,
                15587
            ],
            [
                15590,
                15605
            ],
            [
                15606,
                15614
            ],
            [
                15616,
                15631
            ],
            [
                15631,
                15647
            ],
            [
                15648,
                15650
            ],
            [
                15654,
                15656
            ],
            [
                15659,
                15668
            ],
            [
                15669,
                15688
            ],
            [
                15691,
                15710
            ],
            [
                15720,
                15766
            ],
            [
                15767,
                15787
            ],
            [
                15790,
                15800
            ],
            [
                15801,
                15826
            ],
            [
                15828,
                15849
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                91
            ],
            [
                91,
                210
            ],
            [
                210,
                335
            ],
            [
                335,
                371
            ],
            [
                371,
                398
            ],
            [
                398,
                497
            ],
            [
                497,
                637
            ],
            [
                637,
                733
            ],
            [
                733,
                796
            ],
            [
                796,
                805
            ],
            [
                805,
                931
            ],
            [
                931,
                954
            ],
            [
                954,
                970
            ],
            [
                970,
                996
            ],
            [
                996,
                1093
            ],
            [
                1093,
                1093
            ],
            [
                1093,
                1194
            ],
            [
                1194,
                1194
            ],
            [
                1194,
                1235
            ],
            [
                1235,
                1282
            ],
            [
                1282,
                1282
            ],
            [
                1282,
                1282
            ],
            [
                1282,
                1355
            ],
            [
                1355,
                1432
            ],
            [
                1432,
                1463
            ],
            [
                1463,
                1463
            ],
            [
                1463,
                1513
            ],
            [
                1513,
                1536
            ],
            [
                1536,
                1553
            ],
            [
                1553,
                1553
            ],
            [
                1553,
                1599
            ],
            [
                1599,
                1684
            ],
            [
                1684,
                1768
            ],
            [
                1768,
                1837
            ],
            [
                1837,
                1860
            ],
            [
                1860,
                1878
            ],
            [
                1878,
                1878
            ],
            [
                1878,
                1927
            ],
            [
                1927,
                1946
            ],
            [
                1946,
                1990
            ],
            [
                1990,
                2047
            ],
            [
                2047,
                2047
            ],
            [
                2047,
                2106
            ],
            [
                2106,
                2137
            ],
            [
                2137,
                2155
            ],
            [
                2155,
                2229
            ],
            [
                2229,
                2283
            ],
            [
                2283,
                2387
            ],
            [
                2387,
                2387
            ],
            [
                2387,
                2427
            ],
            [
                2427,
                2437
            ],
            [
                2437,
                2501
            ],
            [
                2501,
                2540
            ],
            [
                2540,
                2588
            ],
            [
                2588,
                2588
            ],
            [
                2588,
                2610
            ],
            [
                2610,
                2633
            ],
            [
                2633,
                2670
            ],
            [
                2670,
                2704
            ],
            [
                2704,
                2704
            ],
            [
                2704,
                2788
            ],
            [
                2788,
                2810
            ],
            [
                2810,
                2979
            ],
            [
                2979,
                3002
            ],
            [
                3002,
                3023
            ],
            [
                3023,
                3023
            ],
            [
                3023,
                3052
            ],
            [
                3052,
                3095
            ],
            [
                3095,
                3095
            ],
            [
                3095,
                3222
            ],
            [
                3222,
                3261
            ],
            [
                3261,
                3381
            ],
            [
                3381,
                3413
            ],
            [
                3413,
                3500
            ],
            [
                3500,
                3622
            ],
            [
                3622,
                3681
            ],
            [
                3681,
                3723
            ],
            [
                3723,
                3739
            ],
            [
                3739,
                3754
            ],
            [
                3754,
                3785
            ],
            [
                3785,
                3785
            ],
            [
                3785,
                3839
            ],
            [
                3839,
                3865
            ],
            [
                3865,
                3991
            ],
            [
                3991,
                4012
            ],
            [
                4012,
                4089
            ],
            [
                4089,
                4155
            ],
            [
                4155,
                4204
            ],
            [
                4204,
                4204
            ],
            [
                4204,
                4241
            ],
            [
                4241,
                4326
            ],
            [
                4326,
                4326
            ],
            [
                4326,
                4345
            ],
            [
                4345,
                4393
            ],
            [
                4393,
                4488
            ],
            [
                4488,
                4565
            ],
            [
                4565,
                4633
            ],
            [
                4633,
                4719
            ],
            [
                4719,
                4750
            ],
            [
                4750,
                4883
            ],
            [
                4883,
                4955
            ],
            [
                4955,
                4955
            ],
            [
                4955,
                4955
            ],
            [
                4955,
                4955
            ],
            [
                4955,
                5044
            ],
            [
                5044,
                5083
            ],
            [
                5083,
                5181
            ],
            [
                5181,
                5225
            ],
            [
                5225,
                5281
            ],
            [
                5281,
                5319
            ],
            [
                5319,
                5361
            ],
            [
                5361,
                5408
            ],
            [
                5408,
                5429
            ],
            [
                5429,
                5524
            ],
            [
                5524,
                5600
            ],
            [
                5600,
                5630
            ],
            [
                5630,
                5694
            ],
            [
                5694,
                5827
            ],
            [
                5827,
                5860
            ],
            [
                5860,
                5860
            ],
            [
                5860,
                5902
            ],
            [
                5902,
                5908
            ],
            [
                5908,
                5933
            ],
            [
                5933,
                5933
            ],
            [
                5933,
                5933
            ],
            [
                5933,
                5972
            ],
            [
                5972,
                6035
            ],
            [
                6035,
                6064
            ],
            [
                6064,
                6170
            ],
            [
                6170,
                6170
            ],
            [
                6170,
                6170
            ],
            [
                6170,
                6209
            ],
            [
                6209,
                6227
            ],
            [
                6227,
                6237
            ],
            [
                6237,
                6375
            ],
            [
                6375,
                6437
            ],
            [
                6437,
                6465
            ],
            [
                6465,
                6596
            ],
            [
                6596,
                6601
            ],
            [
                6601,
                6615
            ],
            [
                6615,
                6629
            ],
            [
                6629,
                6649
            ],
            [
                6649,
                6683
            ],
            [
                6683,
                6782
            ],
            [
                6782,
                6803
            ],
            [
                6803,
                6803
            ],
            [
                6803,
                6816
            ],
            [
                6816,
                6917
            ],
            [
                6917,
                7042
            ],
            [
                7042,
                7102
            ],
            [
                7102,
                7169
            ],
            [
                7169,
                7299
            ],
            [
                7299,
                7407
            ],
            [
                7407,
                7462
            ],
            [
                7462,
                7521
            ],
            [
                7521,
                7548
            ],
            [
                7548,
                7580
            ],
            [
                7580,
                7604
            ],
            [
                7604,
                7664
            ],
            [
                7664,
                7688
            ],
            [
                7688,
                7694
            ],
            [
                7694,
                7717
            ],
            [
                7717,
                7717
            ],
            [
                7717,
                7717
            ],
            [
                7717,
                7762
            ],
            [
                7762,
                7884
            ],
            [
                7884,
                8011
            ],
            [
                8011,
                8044
            ],
            [
                8044,
                8112
            ],
            [
                8112,
                8295
            ],
            [
                8295,
                8338
            ],
            [
                8338,
                8403
            ],
            [
                8403,
                8430
            ],
            [
                8430,
                8458
            ],
            [
                8458,
                8529
            ],
            [
                8529,
                8557
            ],
            [
                8557,
                8573
            ],
            [
                8573,
                8592
            ],
            [
                8592,
                8629
            ],
            [
                8629,
                8629
            ],
            [
                8629,
                8660
            ],
            [
                8660,
                8689
            ],
            [
                8689,
                8689
            ],
            [
                8689,
                8724
            ],
            [
                8724,
                8747
            ],
            [
                8747,
                8840
            ],
            [
                8840,
                8887
            ],
            [
                8887,
                8989
            ],
            [
                8989,
                8989
            ],
            [
                8989,
                9012
            ],
            [
                9012,
                9114
            ],
            [
                9114,
                9343
            ],
            [
                9343,
                9468
            ],
            [
                9468,
                9584
            ],
            [
                9584,
                9601
            ],
            [
                9601,
                9629
            ],
            [
                9629,
                9655
            ],
            [
                9655,
                9709
            ],
            [
                9709,
                9781
            ],
            [
                9781,
                9810
            ],
            [
                9810,
                9847
            ],
            [
                9847,
                9859
            ],
            [
                9859,
                9935
            ],
            [
                9935,
                9972
            ],
            [
                9972,
                9972
            ],
            [
                9972,
                10010
            ],
            [
                10010,
                10041
            ],
            [
                10041,
                10097
            ],
            [
                10097,
                10167
            ],
            [
                10167,
                10315
            ],
            [
                10315,
                10414
            ],
            [
                10414,
                10457
            ],
            [
                10457,
                10473
            ],
            [
                10473,
                10495
            ],
            [
                10495,
                10549
            ],
            [
                10549,
                10623
            ],
            [
                10623,
                10659
            ],
            [
                10659,
                10757
            ],
            [
                10757,
                10807
            ],
            [
                10807,
                10828
            ],
            [
                10828,
                10853
            ],
            [
                10853,
                10867
            ],
            [
                10867,
                10867
            ],
            [
                10867,
                10880
            ],
            [
                10880,
                10880
            ],
            [
                10880,
                10910
            ],
            [
                10910,
                10963
            ],
            [
                10963,
                10989
            ],
            [
                10989,
                11046
            ],
            [
                11046,
                11078
            ],
            [
                11078,
                11128
            ],
            [
                11128,
                11234
            ],
            [
                11234,
                11259
            ],
            [
                11259,
                11287
            ],
            [
                11287,
                11287
            ],
            [
                11287,
                11287
            ],
            [
                11287,
                11311
            ],
            [
                11311,
                11363
            ],
            [
                11363,
                11363
            ],
            [
                11363,
                11403
            ],
            [
                11403,
                11441
            ],
            [
                11441,
                11475
            ],
            [
                11475,
                11496
            ],
            [
                11496,
                11557
            ],
            [
                11557,
                11629
            ],
            [
                11629,
                11774
            ],
            [
                11774,
                11852
            ],
            [
                11852,
                11944
            ],
            [
                11944,
                12014
            ],
            [
                12014,
                12014
            ],
            [
                12014,
                12061
            ],
            [
                12061,
                12078
            ],
            [
                12078,
                12211
            ],
            [
                12211,
                12229
            ],
            [
                12229,
                12316
            ],
            [
                12316,
                12316
            ],
            [
                12316,
                12390
            ],
            [
                12390,
                12695
            ],
            [
                12695,
                12734
            ],
            [
                12734,
                12752
            ],
            [
                12752,
                12831
            ],
            [
                12831,
                12901
            ],
            [
                12901,
                12971
            ],
            [
                12971,
                13010
            ],
            [
                13010,
                13070
            ],
            [
                13070,
                13199
            ],
            [
                13199,
                13272
            ],
            [
                13272,
                13286
            ],
            [
                13286,
                13297
            ],
            [
                13297,
                13394
            ],
            [
                13394,
                13510
            ],
            [
                13510,
                13573
            ],
            [
                13573,
                13601
            ],
            [
                13601,
                13650
            ],
            [
                13650,
                13669
            ],
            [
                13669,
                13674
            ],
            [
                13674,
                13716
            ],
            [
                13716,
                13733
            ],
            [
                13733,
                13759
            ],
            [
                13759,
                13884
            ],
            [
                13884,
                13926
            ],
            [
                13926,
                13950
            ],
            [
                13950,
                14033
            ],
            [
                14033,
                14057
            ],
            [
                14057,
                14110
            ],
            [
                14110,
                14197
            ],
            [
                14197,
                14259
            ],
            [
                14259,
                14324
            ],
            [
                14324,
                14370
            ],
            [
                14370,
                14455
            ],
            [
                14455,
                14493
            ],
            [
                14493,
                14511
            ],
            [
                14511,
                14511
            ],
            [
                14511,
                14511
            ],
            [
                14511,
                14563
            ],
            [
                14563,
                14563
            ],
            [
                14563,
                14638
            ],
            [
                14638,
                14745
            ],
            [
                14745,
                14812
            ],
            [
                14812,
                14873
            ],
            [
                14873,
                14905
            ],
            [
                14905,
                14938
            ],
            [
                14938,
                15119
            ],
            [
                15119,
                15156
            ],
            [
                15156,
                15165
            ],
            [
                15165,
                15194
            ],
            [
                15194,
                15238
            ],
            [
                15238,
                15330
            ],
            [
                15330,
                15421
            ],
            [
                15421,
                15439
            ],
            [
                15439,
                15457
            ],
            [
                15457,
                15457
            ],
            [
                15457,
                15471
            ],
            [
                15471,
                15516
            ],
            [
                15516,
                15578
            ],
            [
                15578,
                15590
            ],
            [
                15590,
                15605
            ],
            [
                15605,
                15605
            ],
            [
                15605,
                15616
            ],
            [
                15616,
                15616
            ],
            [
                15616,
                15631
            ],
            [
                15631,
                15653
            ],
            [
                15653,
                15668
            ],
            [
                15668,
                15668
            ],
            [
                15668,
                15691
            ],
            [
                15691,
                15766
            ],
            [
                15766,
                15800
            ],
            [
                15800,
                15851
            ]
        ]
    }
}