{
    "original": {
        "text": "\"Then proudly, proudly up she rose, Tho' the tear was in her e'e, Whate'er ye say, think what ye may, Ye's get na word frae me!\" SCOTCH BALLAD.\nIt was not merely that Margaret was known to Mr. Thornton to have spoken falsely,--though she imagined that for this reason only was she so turned in his opinion,--but that this falsehood of hers bore a distinct reference in his mind to some other lover. He could not forget the fond and earnest look that had passed between her and some other man--the attitude of familiar confidence, if not of positive endearment. The thought of this perpetually stung him; it was a picture before his eyes, wherever he went and whatever he was doing. In addition to this (and he ground his teeth as he remembered it), was the hour, dusky twilight; the place, so far away from home, and comparatively unfrequented. His nobler self had said at first, that all this last might be accidental, innocent, justifiable; but once allow her right to love and be beloved (and had he any reason to deny her right?--had not her words been severely explicit when she cast his love away from her?), she might easily have been beguiled into a longer walk, on to a later hour than she had anticipated. But that falsehood! which showed a fatal consciousness of something wrong, and to be concealed, which was unlike her. He did her that justice, though all the time it would have been a relief to believe her utterly unworthy of his esteem. It was this that made the misery--that he passionately loved her, and thought her, even with all her faults, more lovely and more excellent than any other woman; yet he deemed her so attached to some other man, so led away by her affection for him, as to violate her truthful nature. The very falsehood that stained her, was a proof how blindly she loved another--this dark, slight, elegant, handsome man--while he himself was rough, and stern, and strongly made. He lashed himself into an agony of fierce jealousy. He thought of that look, that attitude!--how he would have laid his life at her feet for such tender glances, such fond detention! He mocked at himself, for having valued the mechanical way in which she had protected him from the fury of the mob; now he had seen how soft and bewitching she looked when with a man she really loved. He remembered, point by point, the sharpness of her words--\"There was not a man in all that crowd for whom she would not have done as much, far more readily than for him.\" He shared with the mob, in her desire of averting bloodshed from them; but this man, this hidden lover, shared with nobody; he had looks, words, hand-cleavings, lies, concealment, all to himself.\nMr. Thornton was conscious that he had never been so irritable as he was now, in all his life long; he felt inclined to give a short abrupt answer, more like a bark than a speech, to every one that asked him a question; and this consciousness hurt his pride: he had always piqued himself on his self-control, and control himself he would. So the manner was subdued to a quiet deliberation, but the matter was even harder and sterner than common. He was more than usually silent at home; employing his evenings in a continual pace backwards and forwards, which would have annoyed his mother exceedingly if it had been practised by any one else; and did not tend to promote any forbearance on her part even to this beloved son.\n\"Can you stop--can you sit down for a moment? I have something to say to you, if you would give up that everlasting walk, walk, walk.\"\nHe sat down instantly, on a chair against the wall.\n\"I want to speak to you about Betsy. She says she must leave us; that her lover's death has so affected her spirits she can't give her heart to her work.\"\n\"Very well. I suppose other cooks are to be met with.\"\n\"That's so like a man. It's not merely the cooking, it is that she knows all the ways of the house. Besides, she tells me something about your friend Miss Hale.\"\n\"Miss Hale is no friend of mine. Mr. Hale is my friend.\"\n\"I am glad to hear you say so, for if she had been your friend, what Betsy says would have annoyed you.\"\n\"Let me hear it,\" said he, with the extreme quietness of manner he had been assuming for the last few days.\n\"Betsy says, that the night on which her lover--I forget his name--for she always calls him 'he'----\"\n\"Leonards.\"\n\"The night on which Leonards was last seen at the station--when he was last seen on duty, in fact--Miss Hale was there, walking about with a young man who, Bessy believes, killed Leonards by some blow or push.\"\n\"Leonards was not killed by any blow or push.\"\n\"How do you know?\"\n\"Because I distinctly put the question to the surgeon of the Infirmary. He told me there was an internal disease of long standing, caused by Leonards' habit of drinking to excess; that the fact of his becoming rapidly worse while in a state of intoxication, settled the question as to whether the last fatal attack was caused by excess of drinking, or the fall.\"\n\"The fall! What fall?\"\n\"Caused by the blow or push of which Betsy speaks.\"\n\"Then there was a blow or push?\"\n\"I believe so.\"\n\"And who did it?\"\n\"As there was no inquest, in consequence of the doctor's opinion I cannot tell you.\"\n\"But Miss Hale was there?\"\nNo answer.\n\"And with a young man?\"\nStill no answer. At last he said: \"I tell you, mother, that there was no inquest--no inquiry. No judicial inquiry, I mean.\"\n\"Betsy says that Woolmer (some man she knows, who is in a grocer's shop out at Crampton) can swear that Miss Hale was at the station at that hour, walking backwards and forwards with a young man.\"\n\"I don't see what we have to do with that. Miss Hale is at liberty to please herself.\"\n\"I'm glad to hear you say so,\" says Mrs. Thornton, eagerly. \"It certainly signifies very little to us--not at all to you, after what has passed! but I--I made a promise to Mrs. Hale, that I would not allow her daughter to go wrong without advising and remonstrating with her. I shall certainly let her know my opinion of such conduct.\"\n\"I do not see any harm in what she did that evening,\" said Mr. Thornton, getting up, and coming near to his mother; he stood by the chimney-piece with his face turned away from the room.\n\"You would not have approved of Fanny's being seen out, after dark, in rather a lonely place, walking about with a young man. I say nothing of the taste which could choose the time, when her mother lay unburied, for such a promenade. Should you have liked your sister to have been noticed by a grocer's assistant for doing so?\"\n\"In the first place, as it is not many years since I myself was a draper's assistant, the mere circumstance of a grocer's assistant noticing any act does not alter the character of the act to me. And in the next place, I see a great deal of difference between Miss Hale and Fanny. I can imagine that the one may have weighty reasons, which may and ought to make her overlook any seeming impropriety in her conduct. I never knew Fanny have weighty reasons for anything. Other people must guard her. I believe Miss Hale is a guardian to herself.\"\n\"A pretty character of your sister, indeed! Really, John, one would have thought Miss Hale had done enough to make you clear-sighted. She drew you on to an offer, by a bold display of pretended regard for you,--to play you off against this very young man, I've no doubt. Her whole conduct is clear to me now. You believe he is her lover, I suppose--you agree to that.\"\nHe turned round to his mother; his face was very gray and grim. \"Yes, mother. I do believe he is her lover.\" When he had spoken, he turned round again; he writhed himself about, like one in bodily pain. He leant his face against his hand. Then before she could speak, he turned sharp again:\n\"Mother. He is her lover, whoever he is; but she may need help and womanly counsel;--there may be difficulties or temptations which I don't know. I fear there are. I don't want to know what they are; but as you have ever been a good--ay! and a tender mother to me, go to her, and gain her confidence, and tell her what is best to be done. I know that something is wrong; some dread, which must be a terrible torture to her.\"\n\"For God's sake, John!\" said his mother, now really shocked, \"what do you mean? What do you mean? What do you know?\"\nHe did not reply to her.\n\"John! I don't know what I shan't think unless you speak. You have no right to say what you have done against her.\"\n\"Not against her, mother! I _could_ not speak against her.\"\n\"Well! you have no right to say what you have done, unless you say more. These half-expressions are what ruin a woman's character.\"\n\"Her character! Mother, you do not dare--\" he faced about, and looked into her face with his flaming eyes. Then, drawing himself up into determined composure and dignity, he said, \"I will not say any more than this, which is neither more nor less than the simple truth, and I am sure you believe me,--I have good reason to believe, that Miss Hale is in some strait and difficulty connected with an attachment which, of itself, from my knowledge of Miss Hale's character, is perfectly innocent and right. What my reason is, I refuse to tell. But never let me hear any one say a word against her, implying any more serious imputation than that she now needs the counsel of some kind and gentle woman. You promised Mrs. Hale to be that woman!\"\n\"No!\" said Mrs. Thornton. \"I am happy to say, I did not promise kindness and gentleness, for I felt at the time that it might be out of my power to render these to one of Miss Hale's character and disposition. I promised counsel and advice, such as I would give to my own daughter; I shall speak to her as I would do to Fanny, if she had gone gallivanting with a young man in the dusk. I shall speak with relation to the circumstances I know, without being influenced either one way or another by the 'strong reasons' which you will not confide to me. Then I shall have fulfilled my promise, and done my duty.\n\"She will never bear it,\" said he passionately.\n\"She will have to bear it, if I speak in her dead mother's name.\"\n\"Well!\" said he, breaking away, \"don't tell me any more about it. I cannot endure to think of it. It will be better that you should speak to her any way, than that she should not be spoken to at all.--Oh! that look of love!\" continued he, between his teeth, as he bolted himself into his own private room. \"And that cursed lie; which showed some terrible shame in the background, to be kept from the light in which I thought she lived perpetually! Oh, Margaret, Margaret! Mother, how you have tortured me! Oh! Margaret, could you not have loved me? I am but uncouth and hard, but I would never have led you into any falsehood for me.\"\nThe more Mrs. Thornton thought over what her son had said, in pleading for a merciful judgment for Margaret's indiscretion, the more bitterly she felt inclined towards her. She took a savage pleasure in the idea of \"speaking her mind\" to her, in the guise of fulfilment of a duty. She enjoyed the thought of showing herself untouched by the \"glamour,\" which she was well aware Margaret had the power of throwing over many people. She snorted scornfully over the picture of the beauty of her victim; her jet black hair, her clear smooth skin, her lucid eyes would not help to save her one word of the just and stern reproach which Mrs. Thornton spent half the night in preparing to her mind.\n\"Is Miss Hale within?\" She knew she was, for she had seen her at the window, and she had her feet inside the little hall before Martha had half answered the question.\nMargaret was sitting alone, writing to Edith, and giving her many particulars of her mother's last days. It was a softening employment, and she had to brush away the unbidden tears as Mrs. Thornton was announced.\nShe was so gentle and ladylike in her mode of reception that her visitor was somewhat daunted; and it became impossible to utter the speech, so easy of arrangement with no one to address it to. Margaret's low rich voice was softer than usual; her manner more gracious, because in her heart she was feeling very grateful to Mrs. Thornton for the courteous attention of her call. She exerted herself to find subjects of interest for conversation; praised Martha, the servant whom Mrs. Thornton had found for them: had asked Edith for a little Greek air, about which she had spoken to Miss Thornton. Mrs. Thornton was fairly discomfited. Her sharp Damascus blade seemed out of place, and useless among rose-leaves. She was silent because she was trying to task herself up to her duty. At last she stung herself into its performance by a suspicion which, in spite of all probability, she allowed to cross her mind, that all this sweetness was put on with a view of propitiating Mr. Thornton; that, somehow, the other attachment had fallen through, and that it suited Miss Hale's purpose to recall her rejected lover. Poor Margaret! there was perhaps so much truth in the suspicion as this; that Mrs. Thornton was the mother of one whose regard she valued, and feared to have lost; and this thought unconsciously added to her natural desire of pleasing one who was showing her kindness by her visit. Mrs. Thornton stood up to go, but yet she seemed to have something more to say. She cleared her throat and began:\n\"Miss Hale, I have a duty to perform. I promised your poor mother that, as far as my poor judgment went, I would not allow you to act in any way wrongly, or (she softened her speech down a little here) inadvertently, without remonstrating; at least without offering advice, whether you took it or not.\"\nMargaret stood before her, blushing like any culprit, with her eyes dilating as she gazed at Mrs. Thornton. She thought she had come to speak to her about the falsehood she had told--that Mr. Thornton had employed her to explain the danger she had exposed herself to, of being confuted in full court! and although her heart sank to think he had not rather chosen to come himself, and upbraid her, and receive her penitence, and restore her again to his good opinion, yet she was too much humbled not to bear any blame on this subject patiently and meekly.\nMrs. Thornton went on:\n\"At first, when I heard from one of my servants, that you had been seen walking about with a gentleman, so far from home as the Outwood station, at such a time of the evening, I could hardly believe it. But my son, I am sorry to say, confirmed her story. It was indiscreet, to say the least; many a young woman has lost her character before now----\"\nMargaret's eyes flashed fire. This was a new idea--this was too insulting. If Mrs. Thornton had spoken to her about the lie she had told, well and good--she would have owned it, and humiliated herself. But to interfere with her conduct--to speak of her character! she--Mrs. Thornton, a mere stranger--it was too impertinent! She would not answer her--not one word. Mrs. Thornton saw the battle-spirit in Margaret's eyes, and it called up her combativeness also.\n\"For your mother's sake, I have thought it right to warn you against such improprieties; they must degrade you in the long run in the estimation of the world, even if in fact they do not lead you to positive harm.\"\n\"For my mother's sake,\" said Margaret, in a tearful voice, \"I will bear much; but I cannot bear everything. She never meant me to be exposed to insult, I am sure.\"\n\"Insult, Miss Hale!\"\n\"Yes, madam,\" said Margaret more steadily, \"it is insult. What do you know of me that should lead you to suspect--Oh!\" said she, breaking down, and covering her face with her hands--\"I know now, Mr. Thornton has told you----\"\n\"No, Miss Hale,\" said Mrs. Thornton, her truthfulness causing her to arrest the confession Margaret was on the point of making, though her curiosity was itching to hear it. \"Stop. Mr. Thornton has told me nothing. You do not know my son. You are not worthy to know him. He said this. Listen, young lady, that you may understand, if you can, what sort of a man you rejected. This Milton manufacturer, his great tender heart scorned as it was scorned, said to me only last night, 'Go to her. I have good reason to know that she is in some strait arising out of some attachment; and she needs womanly counsel.' I believe those were his very words. Farther than that--beyond admitting the fact of your being at the Outwood station with a gentleman, on the evening of the twenty-sixth--he has said nothing--not one word against you. If he has knowledge of anything which should make you sob so, he keeps it to himself.\"\nMargaret's face was still hidden in her hands, the fingers of which were wet with tears. Mrs. Thornton was a little mollified.\n\"Come, Miss Hale. There may be circumstances, I'll allow, that, if explained, may take off from the seeming impropriety.\"\nStill no answer. Margaret was considering what to say; she wished to stand well with Mrs. Thornton; and yet she could not, might not, give any explanation. Mrs. Thornton grew impatient.\n\"I shall be sorry to break off an acquaintance; but for Fanny's sake--as I told my son, if Fanny had done so we should consider it a great disgrace--and Fanny might be led away----\"\n\"I can give you no explanation,\" said Margaret, in a low voice. \"I have done wrong, but not in the way you think or know about. I think Mr. Thornton judges me more mercifully than you;\"--she had hard work to keep herself from choking with her tears--\"but, I believe, madam, you mean to do rightly.\"\n\"Thank you,\" said Mrs. Thornton, drawing herself up; \"I was not aware that my meaning was doubted. It is the last time I shall interfere. I was unwilling to consent to do it, when your mother asked me. I had not approved of my son's attachment to you, while I only suspected it. You did not appear to me worthy of him. But when you compromised yourself as you did at the time of the riot, and exposed yourself to the comments of servants and workpeople, I felt it was no longer right to set myself against my son's wish of proposing to you--a wish, by the way, which he had always denied entertaining until the day of the riot.\" Margaret winced, and drew in her breath with a long, hissing sound; of which, however, Mrs. Thornton took no notice. \"He came; you had apparently changed your mind. I told my son yesterday, that I thought it possible, short as was the interval, you might have heard or learnt something of this other lover----\"\n\"What must you think of me, madam?\" asked Margaret, throwing her head back with proud disdain, till her throat curved outwards like a swan's. \"You can say nothing more, Mrs. Thornton. I decline every attempt to justify myself for anything. You must allow me to leave the room.\"\nAnd she swept out of it with the noiseless grace of an offended princess. Mrs. Thornton had quite enough of natural humour to make her feel the ludricrousness of the position in which she was left. There was nothing for it but to show herself out. She was not particularly annoyed at Margaret's way of behaving. She did not care enough for her for that. She had taken Mrs. Thornton's remonstrance to the full as keenly to heart as that lady expected; and Margaret's passion at once mollified her visitor, far more than any silence or reserve could have done. It showed the effect of her words. \"My young lady,\" thought Mrs. Thornton to herself; \"you've a pretty good temper of your own. If John and you had come together, he would have had to keep a tight hand over you, to make you know your place. But I don't think you will go a-walking again with your beau, at such an hour of the day, in a hurry. You've too much pride and spirit in you for that. I like to see a girl fly out at the notion of being talked about. It shows they're neither giddy, nor bold by nature. As for that girl, she might be bold, but she'd never be giddy. I'll do her that justice. Now as to Fanny, she'd be giddy, and not bold. She's no courage in her, poor thing!\"\nMr. Thornton was not spending the morning so satisfactorily as his mother. She, at any rate, was fulfilling her determined purpose. He was trying to understand where he stood; what damage the strike had done him. A good deal of his capital was locked up in new and expensive machinery; and he had also bought cotton largely, with a view to some great orders which he had in hand. The strike had thrown him terribly behindhand, as to the completion of these orders. Even with his own accustomed and skilled workpeople, he would have had some difficulty in fulfilling his engagements; as it was, the incompetence of the Irish hands, who had to be trained to their work, at a time requiring unusual activity, was a daily annoyance.\nIt was not a favourable hour for Higgins to make his request. But he had promised Margaret to do it at any cost. So, though every moment added to his repugnance, his pride, and his sullenness of temper, he stood leaning against the dead wall, hour after hour, first on one leg, then on the other. At last the latch was sharply lifted, and out came Mr. Thornton.\n\"I want for to speak to yo', sir.\"\n\"Can't stay now, my man. I'm too late as it is.\"\n\"Well, sir, I reckon I can wait till yo' come back.\"\nMr. Thornton was half way down the street. Higgins sighed. But it was no use. To catch him in the street, was his only chance of seeing \"the measter!\" if he had rung the lodge bell or even gone up to the house to ask for him, he would have been referred to the overlooker. So he stood still again, vouchsafing no answer, but a short nod of recognition to the few men who knew and spoke to him, as the crowd drove out the millyard at dinner-time, and scowling with all his might at the Irish \"knobsticks\" who had just been imported. At last Mr. Thornton returned.\n\"What! you there still!\"\n\"Ay, sir, I mun speak to yo'.\"\n\"Come in here, then. Stay, we'll go across the yard; the men are not come back, and we shall have it to ourselves. These good people, I see, are at dinner;\" said he, closing the door of the porter's lodge.\nHe stopped to speak to the overlooker. The latter said in a low tone:\n\"I suppose you know, sir, that that man is Higgins, one of the leaders of the Union; he that made that speech in Hurstfield.\"\n\"No, I didn't,\" said Mr. Thornton, looking round sharply at his follower. Higgins was known to him by name as a turbulent spirit.\n\"Come along,\" said he, and his tone was rougher than before. \"It is men such as this,\" thought he, \"who interrupt commerce and injure the very town they live in: mere demagogues, lovers of power at whatever cost to others.\"\n\"Well, sir! what do you want with me?\" said Mr. Thornton, facing round at him, as soon as they were in the counting-house of the mill.\n\"My name is Higgins\"--\n\"I know that,\" broke in Mr. Thornton. \"What do you want, Mr. Higgins? That's the question.\"\n\"I want work.\"\n\"Work! You're a pretty chap to come asking me for work. You don't want impudence, that's very clear.\"\n\"I've getten enemies and backbiters, like my betters; but I ne'er heerd o' ony of them calling me o'er-modest,\" said Higgins. His blood was a little roused by Mr. Thornton's manner, more than by his words.\nMr. Thornton saw a letter addressed to himself on the table. He took it up and read it through. At the end, he looked up and said, \"What are you waiting for?\"\n\"An answer to th' question I axed.\"\n\"I gave it you before. Don't waste any more of your time.\"\n\"Yo' made a remark, sir, on my impudence' but I were taught that it was manners to say either 'yes' or 'no,' when I were axed a civil question. I should be thankfu' to yo' if yo'd give me work. Hamper will speak to my being a good hand.\"\n\"I've a notion you'd better not send me to Hamper to ask for a character, my man. I might hear more than you'd like.\"\n\"I'd take th' risk. Worst they could say of me is, that I did what I thought best, even to my own wrong.\"\n\"You'd better go and try them, then, and see whether they'll give you work. I've turned off upwards of a hundred of my best hands, for no other fault than following you and such as you; and d'ye think I'll take you on? I might as well put a fire-brand into the midst of the cotton-waste.\"\nHiggins turned away: then the recollection of Boucher came over him, and he faced round with the greatest concession he could persuade himself to make.\n\"I'd promise yo', measter, I'd not speak a word as could do harm, if so be yo' did right by us; and I'd promise more: I'd promise that when I seed yo' going wrong, and acting unfair, I'd speak to yo' in private first; and that would be a fair warning. If yo' and I did na agree in our opinion o' your conduct, yo' might turn me off at an hour's notice.\"\n\"Upon my word, you don't think small beer of yourself! Hamper has had a loss of you. How came he to let you and your wisdom go?\"\n\"Well, we parted wi' mutual dissatisfaction. I wouldn't gi'e the pledge they were asking; and they wouldn't have me at no rate. So I'm free to make another engagement; and as I said before, though I should na' say it, I'm a good hand, measter, and a steady man--specially when I can keep fro' drink; and that I shall do now, if I ne'er did afore.\"\n\"That you may have more money laid up for another strike, I suppose?\"\n\"No! I'd be thankful if I was free to do that; it's for to keep th' widow and childer of a man who was drove mad by them knobsticks o' yourn; put out of his place by a Paddy that did na know weft fro' warp.\"\n\"Well! you'd better turn to something else, if you've any such good intention in your head. I shouldn't advise you to stay in Milton: you're too well known here.\"\n\"If it were summer,\" said Higgins, \"I'd take to Paddy's work, and go as a navvy, or haymaking, or summat, and ne'er see Milton again. But it's winter, and th' childer will clem.\"\n\"A pretty navvy you'd make! why you couldn't do half a day's work at digging against an Irishman.\"\n\"I'd only charge half-a-day for th' twelve hours, if I could only do half-a-day's work in th' time. Yo're not knowing of any place, where they could gi' me a trial, away fro' the mills, if I'm such a firebrand? I'd take any wage they thought I was worth, for the sake of those childer.\"\n\"Don't you see what you would be? You'd be a knobstick. You'd be taking less wages than the other labourers--all for the sake of another man's children. Think how you'd abuse any poor fellow who was willing to take what he could get to keep his own children. You and your Union would soon be down upon him. No! no! if it's only for the recollection of the way in which you've used the poor knobsticks before now, I say No! to your question. I'll not give you work. I won't say, I don't believe your pretext for coming and asking for work; I know nothing about it. It may be true, or it may not. It's a very unlikely story, at any rate. Let me pass. I'll not give you work. There's your answer.\"\n\"I hear, sir. I would na ha' troubled you', but that I were bid to come, by one as seemed to think yo'd getten some place in your heart. Hoo were mistook, and I were misled. But I'm not the first man as is misled by a woman.\"\n\"Tell her to mind her own business the next time, instead of taking up your time and mine too. I believe women are at the bottom of every plague in this world. Be off with you.\"\n\"I'm obleeged to you for a' yo'r kindness, measter, and most of a' for yo'r civil way o' saying good-bye.\"\nMr. Thornton did not deign a reply. But, looking out of the window a minute later, he was struck with the lean, bent figure going out of the yard; the heavy walk was in strange contrast with the resolute, clear determination of the man to speak to him. He crossed to the porter's lodge:\n\"How long has that man Higgins been waiting to speak to me?\"\n\"He was outside the gate before eight o'clock, sir. I think he's been there ever since.\"\n\"And it is now--?\"\n\"Just one, sir.\"\n\"Five hours,\" thought Mr. Thornton; \"it's a long time for a man to wait, doing nothing but first hoping and then fearing.\"",
        "paragraph_chars": [
            [
                0,
                144
            ],
            [
                144,
                2670
            ],
            [
                2670,
                3396
            ],
            [
                3396,
                3531
            ],
            [
                3531,
                3583
            ],
            [
                3583,
                3738
            ],
            [
                3738,
                3793
            ],
            [
                3793,
                3955
            ],
            [
                3955,
                4012
            ],
            [
                4012,
                4117
            ],
            [
                4117,
                4225
            ],
            [
                4225,
                4327
            ],
            [
                4327,
                4339
            ],
            [
                4339,
                4550
            ],
            [
                4550,
                4597
            ],
            [
                4597,
                4616
            ],
            [
                4616,
                4979
            ],
            [
                4979,
                5002
            ],
            [
                5002,
                5054
            ],
            [
                5054,
                5087
            ],
            [
                5087,
                5103
            ],
            [
                5103,
                5121
            ],
            [
                5121,
                5206
            ],
            [
                5206,
                5233
            ],
            [
                5233,
                5244
            ],
            [
                5244,
                5268
            ],
            [
                5268,
                5392
            ],
            [
                5392,
                5589
            ],
            [
                5589,
                5676
            ],
            [
                5676,
                6012
            ],
            [
                6012,
                6199
            ],
            [
                6199,
                6527
            ],
            [
                6527,
                7072
            ],
            [
                7072,
                7441
            ],
            [
                7441,
                7732
            ],
            [
                7732,
                8157
            ],
            [
                8157,
                8274
            ],
            [
                8274,
                8299
            ],
            [
                8299,
                8415
            ],
            [
                8415,
                8475
            ],
            [
                8475,
                8607
            ],
            [
                8607,
                9348
            ],
            [
                9348,
                9958
            ],
            [
                9958,
                10006
            ],
            [
                10006,
                10072
            ],
            [
                10072,
                10707
            ],
            [
                10707,
                11398
            ],
            [
                11398,
                11565
            ],
            [
                11565,
                11778
            ],
            [
                11778,
                13287
            ],
            [
                13287,
                13590
            ],
            [
                13590,
                14146
            ],
            [
                14146,
                14169
            ],
            [
                14169,
                14519
            ],
            [
                14519,
                14981
            ],
            [
                14981,
                15196
            ],
            [
                15196,
                15360
            ],
            [
                15360,
                15381
            ],
            [
                15381,
                15607
            ],
            [
                15607,
                16522
            ],
            [
                16522,
                16649
            ],
            [
                16649,
                16771
            ],
            [
                16771,
                16957
            ],
            [
                16957,
                17139
            ],
            [
                17139,
                17438
            ],
            [
                17438,
                18378
            ],
            [
                18378,
                18656
            ],
            [
                18656,
                19900
            ],
            [
                19900,
                20629
            ],
            [
                20629,
                20991
            ],
            [
                20991,
                21026
            ],
            [
                21026,
                21075
            ],
            [
                21075,
                21128
            ],
            [
                21128,
                21691
            ],
            [
                21691,
                21716
            ],
            [
                21716,
                21747
            ],
            [
                21747,
                21953
            ],
            [
                21953,
                22023
            ],
            [
                22023,
                22149
            ],
            [
                22149,
                22279
            ],
            [
                22279,
                22503
            ],
            [
                22503,
                22638
            ],
            [
                22638,
                22661
            ],
            [
                22661,
                22753
            ],
            [
                22753,
                22768
            ],
            [
                22768,
                22870
            ],
            [
                22870,
                23076
            ],
            [
                23076,
                23235
            ],
            [
                23235,
                23271
            ],
            [
                23271,
                23330
            ],
            [
                23330,
                23568
            ],
            [
                23568,
                23686
            ],
            [
                23686,
                23792
            ],
            [
                23792,
                24081
            ],
            [
                24081,
                24233
            ],
            [
                24233,
                24587
            ],
            [
                24587,
                24716
            ],
            [
                24716,
                25064
            ],
            [
                25064,
                25134
            ],
            [
                25134,
                25342
            ],
            [
                25342,
                25505
            ],
            [
                25505,
                25684
            ],
            [
                25684,
                25783
            ],
            [
                25783,
                26070
            ],
            [
                26070,
                26765
            ],
            [
                26765,
                26991
            ],
            [
                26991,
                27169
            ],
            [
                27169,
                27276
            ],
            [
                27276,
                27563
            ],
            [
                27563,
                27624
            ],
            [
                27624,
                27713
            ],
            [
                27713,
                27732
            ],
            [
                27732,
                27749
            ],
            [
                27749,
                27871
            ]
        ],
        "segment_chars": [
            [
                0,
                129
            ],
            [
                129,
                144
            ],
            [
                144,
                399
            ],
            [
                399,
                561
            ],
            [
                561,
                682
            ],
            [
                682,
                845
            ],
            [
                845,
                1112
            ],
            [
                1112,
                1216
            ],
            [
                1216,
                1236
            ],
            [
                1236,
                1334
            ],
            [
                1334,
                1454
            ],
            [
                1454,
                1738
            ],
            [
                1738,
                1918
            ],
            [
                1918,
                1970
            ],
            [
                1970,
                2101
            ],
            [
                2101,
                2302
            ],
            [
                2302,
                2474
            ],
            [
                2474,
                2670
            ],
            [
                2670,
                3009
            ],
            [
                3009,
                3116
            ],
            [
                3116,
                3396
            ],
            [
                3396,
                3442
            ],
            [
                3442,
                3531
            ],
            [
                3531,
                3583
            ],
            [
                3583,
                3620
            ],
            [
                3620,
                3738
            ],
            [
                3738,
                3750
            ],
            [
                3750,
                3793
            ],
            [
                3793,
                3816
            ],
            [
                3816,
                3893
            ],
            [
                3893,
                3955
            ],
            [
                3955,
                3988
            ],
            [
                3988,
                4012
            ],
            [
                4012,
                4117
            ],
            [
                4117,
                4225
            ],
            [
                4225,
                4327
            ],
            [
                4327,
                4339
            ],
            [
                4339,
                4550
            ],
            [
                4550,
                4597
            ],
            [
                4597,
                4616
            ],
            [
                4616,
                4688
            ],
            [
                4688,
                4979
            ],
            [
                4979,
                4990
            ],
            [
                4990,
                5002
            ],
            [
                5002,
                5054
            ],
            [
                5054,
                5087
            ],
            [
                5087,
                5103
            ],
            [
                5103,
                5121
            ],
            [
                5121,
                5206
            ],
            [
                5206,
                5233
            ],
            [
                5233,
                5244
            ],
            [
                5244,
                5268
            ],
            [
                5268,
                5285
            ],
            [
                5285,
                5362
            ],
            [
                5362,
                5392
            ],
            [
                5392,
                5589
            ],
            [
                5589,
                5632
            ],
            [
                5632,
                5676
            ],
            [
                5676,
                5736
            ],
            [
                5736,
                5821
            ],
            [
                5821,
                5952
            ],
            [
                5952,
                6012
            ],
            [
                6012,
                6199
            ],
            [
                6199,
                6325
            ],
            [
                6325,
                6433
            ],
            [
                6433,
                6527
            ],
            [
                6527,
                6723
            ],
            [
                6723,
                6808
            ],
            [
                6808,
                6942
            ],
            [
                6942,
                6996
            ],
            [
                6996,
                7025
            ],
            [
                7025,
                7072
            ],
            [
                7072,
                7116
            ],
            [
                7116,
                7206
            ],
            [
                7206,
                7343
            ],
            [
                7343,
                7381
            ],
            [
                7381,
                7441
            ],
            [
                7441,
                7505
            ],
            [
                7505,
                7519
            ],
            [
                7519,
                7550
            ],
            [
                7550,
                7644
            ],
            [
                7644,
                7680
            ],
            [
                7680,
                7732
            ],
            [
                7732,
                7741
            ],
            [
                7741,
                7878
            ],
            [
                7878,
                7896
            ],
            [
                7896,
                7970
            ],
            [
                7970,
                8071
            ],
            [
                8071,
                8157
            ],
            [
                8157,
                8181
            ],
            [
                8181,
                8237
            ],
            [
                8237,
                8255
            ],
            [
                8255,
                8274
            ],
            [
                8274,
                8299
            ],
            [
                8299,
                8306
            ],
            [
                8306,
                8357
            ],
            [
                8357,
                8415
            ],
            [
                8415,
                8441
            ],
            [
                8441,
                8475
            ],
            [
                8475,
                8482
            ],
            [
                8482,
                8548
            ],
            [
                8548,
                8607
            ],
            [
                8607,
                8623
            ],
            [
                8623,
                8714
            ],
            [
                8714,
                9111
            ],
            [
                9111,
                9148
            ],
            [
                9148,
                9306
            ],
            [
                9306,
                9348
            ],
            [
                9348,
                9354
            ],
            [
                9354,
                9374
            ],
            [
                9374,
                9558
            ],
            [
                9558,
                9734
            ],
            [
                9734,
                9900
            ],
            [
                9900,
                9958
            ],
            [
                9958,
                10006
            ],
            [
                10006,
                10072
            ],
            [
                10072,
                10080
            ],
            [
                10080,
                10138
            ],
            [
                10138,
                10170
            ],
            [
                10170,
                10277
            ],
            [
                10277,
                10297
            ],
            [
                10297,
                10378
            ],
            [
                10378,
                10520
            ],
            [
                10520,
                10544
            ],
            [
                10544,
                10578
            ],
            [
                10578,
                10582
            ],
            [
                10582,
                10621
            ],
            [
                10621,
                10707
            ],
            [
                10707,
                10880
            ],
            [
                10880,
                10988
            ],
            [
                10988,
                11137
            ],
            [
                11137,
                11398
            ],
            [
                11398,
                11421
            ],
            [
                11421,
                11565
            ],
            [
                11565,
                11670
            ],
            [
                11670,
                11778
            ],
            [
                11778,
                11972
            ],
            [
                11972,
                12156
            ],
            [
                12156,
                12375
            ],
            [
                12375,
                12413
            ],
            [
                12413,
                12490
            ],
            [
                12490,
                12560
            ],
            [
                12560,
                12891
            ],
            [
                12891,
                12906
            ],
            [
                12906,
                13173
            ],
            [
                13173,
                13253
            ],
            [
                13253,
                13287
            ],
            [
                13287,
                13325
            ],
            [
                13325,
                13590
            ],
            [
                13590,
                13698
            ],
            [
                13698,
                13891
            ],
            [
                13891,
                14146
            ],
            [
                14146,
                14169
            ],
            [
                14169,
                14372
            ],
            [
                14372,
                14424
            ],
            [
                14424,
                14519
            ],
            [
                14519,
                14549
            ],
            [
                14549,
                14594
            ],
            [
                14594,
                14721
            ],
            [
                14721,
                14783
            ],
            [
                14783,
                14844
            ],
            [
                14844,
                14884
            ],
            [
                14884,
                14981
            ],
            [
                14981,
                15196
            ],
            [
                15196,
                15304
            ],
            [
                15304,
                15360
            ],
            [
                15360,
                15381
            ],
            [
                15381,
                15439
            ],
            [
                15439,
                15500
            ],
            [
                15500,
                15607
            ],
            [
                15607,
                15780
            ],
            [
                15780,
                15787
            ],
            [
                15787,
                15821
            ],
            [
                15821,
                15845
            ],
            [
                15845,
                15877
            ],
            [
                15877,
                15891
            ],
            [
                15891,
                15981
            ],
            [
                15981,
                16097
            ],
            [
                16097,
                16215
            ],
            [
                16215,
                16252
            ],
            [
                16252,
                16435
            ],
            [
                16435,
                16522
            ],
            [
                16522,
                16611
            ],
            [
                16611,
                16649
            ],
            [
                16649,
                16667
            ],
            [
                16667,
                16771
            ],
            [
                16771,
                16788
            ],
            [
                16788,
                16927
            ],
            [
                16927,
                16957
            ],
            [
                16957,
                17139
            ],
            [
                17139,
                17203
            ],
            [
                17203,
                17267
            ],
            [
                17267,
                17438
            ],
            [
                17438,
                17537
            ],
            [
                17537,
                17576
            ],
            [
                17576,
                17640
            ],
            [
                17640,
                17717
            ],
            [
                17717,
                17757
            ],
            [
                17757,
                18067
            ],
            [
                18067,
                18184
            ],
            [
                18184,
                18232
            ],
            [
                18232,
                18378
            ],
            [
                18378,
                18414
            ],
            [
                18414,
                18520
            ],
            [
                18520,
                18562
            ],
            [
                18562,
                18618
            ],
            [
                18618,
                18656
            ],
            [
                18656,
                18730
            ],
            [
                18730,
                18854
            ],
            [
                18854,
                18904
            ],
            [
                18904,
                18968
            ],
            [
                18968,
                19010
            ],
            [
                19010,
                19215
            ],
            [
                19215,
                19250
            ],
            [
                19250,
                19343
            ],
            [
                19343,
                19456
            ],
            [
                19456,
                19558
            ],
            [
                19558,
                19608
            ],
            [
                19608,
                19674
            ],
            [
                19674,
                19726
            ],
            [
                19726,
                19789
            ],
            [
                19789,
                19815
            ],
            [
                19815,
                19862
            ],
            [
                19862,
                19900
            ],
            [
                19900,
                19975
            ],
            [
                19975,
                20032
            ],
            [
                20032,
                20113
            ],
            [
                20113,
                20280
            ],
            [
                20280,
                20365
            ],
            [
                20365,
                20629
            ],
            [
                20629,
                20691
            ],
            [
                20691,
                20742
            ],
            [
                20742,
                20926
            ],
            [
                20926,
                20991
            ],
            [
                20991,
                21026
            ],
            [
                21026,
                21051
            ],
            [
                21051,
                21075
            ],
            [
                21075,
                21128
            ],
            [
                21128,
                21171
            ],
            [
                21171,
                21187
            ],
            [
                21187,
                21206
            ],
            [
                21206,
                21279
            ],
            [
                21279,
                21401
            ],
            [
                21401,
                21660
            ],
            [
                21660,
                21691
            ],
            [
                21691,
                21698
            ],
            [
                21698,
                21716
            ],
            [
                21716,
                21747
            ],
            [
                21747,
                21768
            ],
            [
                21768,
                21862
            ],
            [
                21862,
                21953
            ],
            [
                21953,
                21992
            ],
            [
                21992,
                22023
            ],
            [
                22023,
                22149
            ],
            [
                22149,
                22223
            ],
            [
                22223,
                22279
            ],
            [
                22279,
                22340
            ],
            [
                22340,
                22503
            ],
            [
                22503,
                22515
            ],
            [
                22515,
                22542
            ],
            [
                22542,
                22638
            ],
            [
                22638,
                22661
            ],
            [
                22661,
                22699
            ],
            [
                22699,
                22731
            ],
            [
                22731,
                22753
            ],
            [
                22753,
                22768
            ],
            [
                22768,
                22775
            ],
            [
                22775,
                22824
            ],
            [
                22824,
                22870
            ],
            [
                22870,
                22996
            ],
            [
                22996,
                23076
            ],
            [
                23076,
                23137
            ],
            [
                23137,
                23172
            ],
            [
                23172,
                23235
            ],
            [
                23235,
                23271
            ],
            [
                23271,
                23294
            ],
            [
                23294,
                23330
            ],
            [
                23330,
                23474
            ],
            [
                23474,
                23524
            ],
            [
                23524,
                23568
            ],
            [
                23568,
                23650
            ],
            [
                23650,
                23686
            ],
            [
                23686,
                23706
            ],
            [
                23706,
                23792
            ],
            [
                23792,
                23868
            ],
            [
                23868,
                24011
            ],
            [
                24011,
                24081
            ],
            [
                24081,
                24233
            ],
            [
                24233,
                24485
            ],
            [
                24485,
                24587
            ],
            [
                24587,
                24642
            ],
            [
                24642,
                24672
            ],
            [
                24672,
                24716
            ],
            [
                24716,
                24761
            ],
            [
                24761,
                24844
            ],
            [
                24844,
                25064
            ],
            [
                25064,
                25134
            ],
            [
                25134,
                25139
            ],
            [
                25139,
                25342
            ],
            [
                25342,
                25349
            ],
            [
                25349,
                25434
            ],
            [
                25434,
                25505
            ],
            [
                25505,
                25639
            ],
            [
                25639,
                25684
            ],
            [
                25684,
                25712
            ],
            [
                25712,
                25783
            ],
            [
                25783,
                25883
            ],
            [
                25883,
                25994
            ],
            [
                25994,
                26070
            ],
            [
                26070,
                26104
            ],
            [
                26104,
                26126
            ],
            [
                26126,
                26223
            ],
            [
                26223,
                26329
            ],
            [
                26329,
                26377
            ],
            [
                26377,
                26381
            ],
            [
                26381,
                26385
            ],
            [
                26385,
                26493
            ],
            [
                26493,
                26511
            ],
            [
                26511,
                26535
            ],
            [
                26535,
                26634
            ],
            [
                26634,
                26665
            ],
            [
                26665,
                26706
            ],
            [
                26706,
                26719
            ],
            [
                26719,
                26743
            ],
            [
                26743,
                26765
            ],
            [
                26765,
                26779
            ],
            [
                26779,
                26902
            ],
            [
                26902,
                26939
            ],
            [
                26939,
                26991
            ],
            [
                26991,
                27086
            ],
            [
                27086,
                27151
            ],
            [
                27151,
                27169
            ],
            [
                27169,
                27276
            ],
            [
                27276,
                27312
            ],
            [
                27312,
                27529
            ],
            [
                27529,
                27563
            ],
            [
                27563,
                27624
            ],
            [
                27624,
                27676
            ],
            [
                27676,
                27713
            ],
            [
                27713,
                27732
            ],
            [
                27732,
                27749
            ],
            [
                27749,
                27871
            ]
        ],
        "overlap_chars": [
            [
                144,
                224
            ],
            [
                227,
                233
            ],
            [
                256,
                260
            ],
            [
                273,
                276
            ],
            [
                268,
                272
            ],
            [
                261,
                267
            ],
            [
                234,
                246
            ],
            [
                308,
                316
            ],
            [
                322,
                331
            ],
            [
                366,
                399
            ],
            [
                399,
                476
            ],
            [
                482,
                491
            ],
            [
                493,
                528
            ],
            [
                559,
                561
            ],
            [
                561,
                580
            ],
            [
                593,
                602
            ],
            [
                680,
                681
            ],
            [
                682,
                693
            ],
            [
                702,
                746
            ],
            [
                749,
                816
            ],
            [
                843,
                845
            ],
            [
                845,
                878
            ],
            [
                880,
                893
            ],
            [
                899,
                918
            ],
            [
                920,
                928
            ],
            [
                941,
                961
            ],
            [
                962,
                1021
            ],
            [
                1026,
                1031
            ],
            [
                1115,
                1170
            ],
            [
                1174,
                1215
            ],
            [
                1216,
                1236
            ],
            [
                1236,
                1334
            ],
            [
                1334,
                1349
            ],
            [
                1350,
                1365
            ],
            [
                1379,
                1454
            ],
            [
                1454,
                1486
            ],
            [
                1488,
                1622
            ],
            [
                1630,
                1663
            ],
            [
                1709,
                1738
            ],
            [
                1738,
                1741
            ],
            [
                1747,
                1756
            ],
            [
                1775,
                1778
            ],
            [
                1781,
                1786
            ],
            [
                1787,
                1816
            ],
            [
                1818,
                1836
            ],
            [
                1846,
                1858
            ],
            [
                1860,
                1917
            ],
            [
                1918,
                1970
            ],
            [
                1970,
                2008
            ],
            [
                2015,
                2078
            ],
            [
                2099,
                2101
            ],
            [
                2101,
                2110
            ],
            [
                2114,
                2302
            ],
            [
                2549,
                2577
            ],
            [
                2601,
                2604
            ],
            [
                2501,
                2504
            ],
            [
                2605,
                2670
            ],
            [
                2670,
                2732
            ],
            [
                2748,
                2750
            ],
            [
                2755,
                2763
            ],
            [
                2733,
                2746
            ],
            [
                2770,
                2817
            ],
            [
                2823,
                2834
            ],
            [
                2848,
                2858
            ],
            [
                2880,
                2898
            ],
            [
                2913,
                2927
            ],
            [
                2746,
                2747
            ],
            [
                2929,
                2977
            ],
            [
                3007,
                3009
            ],
            [
                3009,
                3011
            ],
            [
                3027,
                3034
            ],
            [
                3016,
                3022
            ],
            [
                3058,
                3063
            ],
            [
                3023,
                3026
            ],
            [
                3038,
                3039
            ],
            [
                3114,
                3116
            ],
            [
                3116,
                3156
            ],
            [
                3167,
                3179
            ],
            [
                3200,
                3286
            ],
            [
                3297,
                3299
            ],
            [
                3308,
                3317
            ],
            [
                3370,
                3374
            ],
            [
                3180,
                3182
            ],
            [
                3378,
                3396
            ],
            [
                3411,
                3442
            ],
            [
                3442,
                3528
            ],
            [
                3531,
                3552
            ],
            [
                3581,
                3583
            ],
            [
                3584,
                3620
            ],
            [
                3620,
                3708
            ],
            [
                3731,
                3735
            ],
            [
                3744,
                3750
            ],
            [
                3750,
                3781
            ],
            [
                3798,
                3816
            ],
            [
                3816,
                3893
            ],
            [
                3893,
                3952
            ],
            [
                3961,
                3988
            ],
            [
                3988,
                4009
            ],
            [
                4013,
                4114
            ],
            [
                4118,
                4132
            ],
            [
                4135,
                4225
            ],
            [
                4317,
                4318
            ],
            [
                4226,
                4271
            ],
            [
                4273,
                4290
            ],
            [
                4328,
                4336
            ],
            [
                4403,
                4405
            ],
            [
                4344,
                4396
            ],
            [
                4438,
                4466
            ],
            [
                4473,
                4494
            ],
            [
                4501,
                4547
            ],
            [
                4551,
                4594
            ],
            [
                4598,
                4613
            ],
            [
                4617,
                4688
            ],
            [
                4688,
                4708
            ],
            [
                4849,
                4850
            ],
            [
                4732,
                4736
            ],
            [
                4737,
                4745
            ],
            [
                4721,
                4728
            ],
            [
                4745,
                4800
            ],
            [
                4813,
                4816
            ],
            [
                4913,
                4944
            ],
            [
                4955,
                4964
            ],
            [
                4968,
                4976
            ],
            [
                4984,
                4990
            ],
            [
                4990,
                4999
            ],
            [
                5003,
                5051
            ],
            [
                5060,
                5084
            ],
            [
                5088,
                5100
            ],
            [
                5104,
                5118
            ],
            [
                5122,
                5146
            ],
            [
                5186,
                5203
            ],
            [
                5207,
                5230
            ],
            [
                5233,
                5244
            ],
            [
                5245,
                5265
            ],
            [
                5268,
                5285
            ],
            [
                5285,
                5301
            ],
            [
                5303,
                5340
            ],
            [
                5353,
                5360
            ],
            [
                5393,
                5408
            ],
            [
                5418,
                5426
            ],
            [
                5438,
                5463
            ],
            [
                5468,
                5479
            ],
            [
                5481,
                5524
            ],
            [
                5537,
                5546
            ],
            [
                5570,
                5586
            ],
            [
                5590,
                5632
            ],
            [
                5632,
                5673
            ],
            [
                5677,
                5704
            ],
            [
                5712,
                5736
            ],
            [
                5737,
                5749
            ],
            [
                5790,
                5821
            ],
            [
                5821,
                5826
            ],
            [
                5848,
                5857
            ],
            [
                5859,
                5923
            ],
            [
                5947,
                5952
            ],
            [
                5952,
                6009
            ],
            [
                6013,
                6063
            ],
            [
                6066,
                6100
            ],
            [
                6137,
                6199
            ],
            [
                6200,
                6269
            ],
            [
                6277,
                6292
            ],
            [
                6307,
                6325
            ],
            [
                6325,
                6345
            ],
            [
                6375,
                6433
            ],
            [
                6433,
                6524
            ],
            [
                6528,
                6612
            ],
            [
                6622,
                6634
            ],
            [
                6676,
                6694
            ],
            [
                6705,
                6723
            ],
            [
                6723,
                6808
            ],
            [
                6808,
                6866
            ],
            [
                6884,
                6942
            ],
            [
                6942,
                6994
            ],
            [
                7073,
                7116
            ],
            [
                7116,
                7206
            ],
            [
                7206,
                7272
            ],
            [
                7283,
                7343
            ],
            [
                7343,
                7381
            ],
            [
                7381,
                7419
            ],
            [
                7441,
                7489
            ],
            [
                7495,
                7505
            ],
            [
                7506,
                7519
            ],
            [
                7519,
                7547
            ],
            [
                7550,
                7579
            ],
            [
                7586,
                7591
            ],
            [
                7647,
                7680
            ],
            [
                7680,
                7711
            ],
            [
                7730,
                7732
            ],
            [
                7739,
                7741
            ],
            [
                7741,
                7756
            ],
            [
                7771,
                7815
            ],
            [
                7817,
                7878
            ],
            [
                7878,
                7896
            ],
            [
                7896,
                7947
            ],
            [
                7953,
                7964
            ],
            [
                7970,
                7973
            ],
            [
                7976,
                8071
            ],
            [
                8071,
                8102
            ],
            [
                8121,
                8154
            ],
            [
                8158,
                8178
            ],
            [
                8181,
                8217
            ],
            [
                8219,
                8237
            ],
            [
                8255,
                8271
            ],
            [
                8274,
                8290
            ],
            [
                8297,
                8299
            ],
            [
                8300,
                8306
            ],
            [
                8306,
                8323
            ],
            [
                8333,
                8357
            ],
            [
                8482,
                8485
            ],
            [
                8546,
                8548
            ],
            [
                8548,
                8604
            ],
            [
                8608,
                8623
            ],
            [
                8623,
                8646
            ],
            [
                8650,
                8652
            ],
            [
                8670,
                8676
            ],
            [
                8682,
                8685
            ],
            [
                8686,
                8695
            ],
            [
                8700,
                8714
            ],
            [
                8714,
                8738
            ],
            [
                8744,
                8764
            ],
            [
                8776,
                8786
            ],
            [
                8788,
                8821
            ],
            [
                8908,
                8937
            ],
            [
                8939,
                8964
            ],
            [
                8976,
                9021
            ],
            [
                9023,
                9111
            ],
            [
                9130,
                9146
            ],
            [
                9116,
                9125
            ],
            [
                9146,
                9148
            ],
            [
                9148,
                9169
            ],
            [
                9178,
                9210
            ],
            [
                9215,
                9227
            ],
            [
                9239,
                9306
            ],
            [
                9306,
                9345
            ],
            [
                9349,
                9351
            ],
            [
                9354,
                9374
            ],
            [
                9375,
                9447
            ],
            [
                9460,
                9495
            ],
            [
                9503,
                9540
            ],
            [
                9556,
                9558
            ],
            [
                9558,
                9628
            ],
            [
                9630,
                9734
            ],
            [
                9900,
                9956
            ],
            [
                9963,
                9981
            ],
            [
                9984,
                10006
            ],
            [
                10011,
                10069
            ],
            [
                10073,
                10077
            ],
            [
                10080,
                10103
            ],
            [
                10105,
                10138
            ],
            [
                10138,
                10168
            ],
            [
                10330,
                10335
            ],
            [
                10343,
                10359
            ],
            [
                10364,
                10376
            ],
            [
                10224,
                10225
            ],
            [
                10307,
                10309
            ],
            [
                10297,
                10306
            ],
            [
                10376,
                10377
            ],
            [
                10273,
                10276
            ],
            [
                10277,
                10294
            ],
            [
                10379,
                10432
            ],
            [
                10452,
                10462
            ],
            [
                10518,
                10520
            ],
            [
                10520,
                10544
            ],
            [
                10592,
                10621
            ],
            [
                10621,
                10625
            ],
            [
                10630,
                10704
            ],
            [
                10707,
                10801
            ],
            [
                10806,
                10814
            ],
            [
                10829,
                10839
            ],
            [
                10849,
                10857
            ],
            [
                10867,
                10880
            ],
            [
                10880,
                10921
            ],
            [
                10923,
                10940
            ],
            [
                10942,
                10965
            ],
            [
                10982,
                10988
            ],
            [
                10988,
                11047
            ],
            [
                11059,
                11068
            ],
            [
                11084,
                11096
            ],
            [
                11119,
                11137
            ],
            [
                11137,
                11164
            ],
            [
                11194,
                11204
            ],
            [
                11184,
                11190
            ],
            [
                11204,
                11229
            ],
            [
                11236,
                11273
            ],
            [
                11282,
                11371
            ],
            [
                11375,
                11384
            ],
            [
                11372,
                11374
            ],
            [
                11388,
                11398
            ],
            [
                11399,
                11418
            ],
            [
                11421,
                11536
            ],
            [
                11542,
                11550
            ],
            [
                11563,
                11565
            ],
            [
                11565,
                11609
            ],
            [
                11646,
                11670
            ],
            [
                11705,
                11726
            ],
            [
                11731,
                11778
            ],
            [
                11778,
                11808
            ],
            [
                11834,
                11926
            ],
            [
                11942,
                11972
            ],
            [
                11972,
                12054
            ],
            [
                12068,
                12156
            ],
            [
                12156,
                12178
            ],
            [
                12209,
                12222
            ],
            [
                12223,
                12288
            ],
            [
                12373,
                12374
            ],
            [
                12375,
                12413
            ],
            [
                12413,
                12422
            ],
            [
                12432,
                12490
            ],
            [
                12490,
                12504
            ],
            [
                12513,
                12516
            ],
            [
                12536,
                12543
            ],
            [
                12550,
                12558
            ],
            [
                12517,
                12520
            ],
            [
                12528,
                12530
            ],
            [
                12558,
                12560
            ],
            [
                12568,
                12571
            ],
            [
                12689,
                12693
            ],
            [
                12781,
                12825
            ],
            [
                12841,
                12850
            ],
            [
                12861,
                12890
            ],
            [
                12891,
                12906
            ],
            [
                12912,
                12915
            ],
            [
                12964,
                13125
            ],
            [
                13146,
                13149
            ],
            [
                13171,
                13173
            ],
            [
                13173,
                13186
            ],
            [
                13257,
                13287
            ],
            [
                13293,
                13325
            ],
            [
                13325,
                13357
            ],
            [
                13392,
                13468
            ],
            [
                13474,
                13535
            ],
            [
                13357,
                13358
            ],
            [
                13536,
                13587
            ],
            [
                13590,
                13604
            ],
            [
                13617,
                13625
            ],
            [
                13642,
                13666
            ],
            [
                13696,
                13698
            ],
            [
                13698,
                13709
            ],
            [
                13714,
                13771
            ],
            [
                13773,
                13878
            ],
            [
                13884,
                13889
            ],
            [
                13895,
                13938
            ],
            [
                13946,
                13968
            ],
            [
                14055,
                14092
            ],
            [
                14124,
                14146
            ],
            [
                14146,
                14169
            ],
            [
                14170,
                14272
            ],
            [
                14314,
                14316
            ],
            [
                14293,
                14313
            ],
            [
                14332,
                14372
            ],
            [
                14372,
                14424
            ],
            [
                14424,
                14513
            ],
            [
                14519,
                14549
            ],
            [
                14549,
                14568
            ],
            [
                14570,
                14578
            ],
            [
                14583,
                14594
            ],
            [
                14594,
                14642
            ],
            [
                14655,
                14670
            ],
            [
                14672,
                14692
            ],
            [
                14693,
                14695
            ],
            [
                14719,
                14721
            ],
            [
                14721,
                14724
            ],
            [
                14756,
                14783
            ],
            [
                14788,
                14818
            ],
            [
                14820,
                14844
            ],
            [
                14844,
                14868
            ],
            [
                14870,
                14883
            ],
            [
                14884,
                14981
            ],
            [
                14982,
                15007
            ],
            [
                15013,
                15114
            ],
            [
                15133,
                15138
            ],
            [
                15138,
                15147
            ],
            [
                15156,
                15193
            ],
            [
                15197,
                15217
            ],
            [
                15220,
                15233
            ],
            [
                15240,
                15244
            ],
            [
                15233,
                15234
            ],
            [
                15256,
                15277
            ],
            [
                15304,
                15357
            ],
            [
                15361,
                15378
            ],
            [
                15382,
                15392
            ],
            [
                15395,
                15423
            ],
            [
                15425,
                15439
            ],
            [
                15439,
                15493
            ],
            [
                15495,
                15497
            ],
            [
                15500,
                15561
            ],
            [
                15564,
                15601
            ],
            [
                15608,
                15621
            ],
            [
                15624,
                15675
            ],
            [
                15778,
                15780
            ],
            [
                15785,
                15787
            ],
            [
                15787,
                15821
            ],
            [
                15821,
                15845
            ],
            [
                15845,
                15877
            ],
            [
                15877,
                15891
            ],
            [
                15891,
                15910
            ],
            [
                15924,
                15981
            ],
            [
                16057,
                16067
            ],
            [
                16073,
                16084
            ],
            [
                16086,
                16097
            ],
            [
                16097,
                16143
            ],
            [
                16151,
                16165
            ],
            [
                16171,
                16212
            ],
            [
                16271,
                16277
            ],
            [
                16265,
                16269
            ],
            [
                16380,
                16381
            ],
            [
                16300,
                16317
            ],
            [
                16326,
                16350
            ],
            [
                16388,
                16399
            ],
            [
                16409,
                16435
            ],
            [
                16435,
                16519
            ],
            [
                16522,
                16567
            ],
            [
                16609,
                16611
            ],
            [
                16611,
                16649
            ],
            [
                16650,
                16667
            ],
            [
                16667,
                16730
            ],
            [
                16745,
                16748
            ],
            [
                16757,
                16768
            ],
            [
                16771,
                16788
            ],
            [
                16788,
                16892
            ],
            [
                16925,
                16927
            ],
            [
                16927,
                16957
            ],
            [
                16958,
                17025
            ],
            [
                17140,
                17169
            ],
            [
                17172,
                17203
            ],
            [
                17204,
                17251
            ],
            [
                17265,
                17267
            ],
            [
                17277,
                17322
            ],
            [
                17326,
                17387
            ],
            [
                17390,
                17435
            ],
            [
                17445,
                17448
            ],
            [
                17451,
                17490
            ],
            [
                17492,
                17537
            ],
            [
                17537,
                17576
            ],
            [
                17640,
                17641
            ],
            [
                17646,
                17649
            ],
            [
                17659,
                17688
            ],
            [
                17715,
                17717
            ],
            [
                17717,
                17757
            ],
            [
                17757,
                17790
            ],
            [
                17802,
                17977
            ],
            [
                17979,
                18025
            ],
            [
                18039,
                18064
            ],
            [
                18067,
                18106
            ],
            [
                18154,
                18167
            ],
            [
                18182,
                18184
            ],
            [
                18185,
                18232
            ],
            [
                18232,
                18326
            ],
            [
                18336,
                18372
            ],
            [
                18379,
                18411
            ],
            [
                18414,
                18471
            ],
            [
                18518,
                18520
            ],
            [
                18521,
                18562
            ],
            [
                18562,
                18603
            ],
            [
                18616,
                18618
            ],
            [
                18618,
                18653
            ],
            [
                18656,
                18730
            ],
            [
                18730,
                18747
            ],
            [
                18754,
                18760
            ],
            [
                18764,
                18799
            ],
            [
                18810,
                18854
            ],
            [
                18854,
                18904
            ],
            [
                18904,
                18936
            ],
            [
                18968,
                18991
            ],
            [
                18940,
                18948
            ],
            [
                19000,
                19010
            ],
            [
                19111,
                19129
            ],
            [
                19014,
                19017
            ],
            [
                19138,
                19186
            ],
            [
                19198,
                19215
            ],
            [
                19215,
                19249
            ],
            [
                19254,
                19264
            ],
            [
                19267,
                19288
            ],
            [
                19302,
                19343
            ],
            [
                19343,
                19425
            ],
            [
                19454,
                19456
            ],
            [
                19456,
                19533
            ],
            [
                19556,
                19558
            ],
            [
                19558,
                19579
            ],
            [
                19598,
                19608
            ],
            [
                19608,
                19674
            ],
            [
                19674,
                19714
            ],
            [
                19724,
                19726
            ],
            [
                19726,
                19789
            ],
            [
                19815,
                19821
            ],
            [
                19825,
                19862
            ],
            [
                19862,
                19878
            ],
            [
                19885,
                19897
            ],
            [
                19900,
                19975
            ],
            [
                20032,
                20059
            ],
            [
                20076,
                20113
            ],
            [
                20113,
                20208
            ],
            [
                20271,
                20273
            ],
            [
                20209,
                20215
            ],
            [
                20225,
                20244
            ],
            [
                20251,
                20257
            ],
            [
                20278,
                20280
            ],
            [
                20280,
                20325
            ],
            [
                20333,
                20365
            ],
            [
                20365,
                20382
            ],
            [
                20398,
                20465
            ],
            [
                20481,
                20552
            ],
            [
                20604,
                20609
            ],
            [
                20618,
                20629
            ],
            [
                20629,
                20691
            ],
            [
                20691,
                20728
            ],
            [
                20740,
                20742
            ],
            [
                20742,
                20790
            ],
            [
                20795,
                20800
            ],
            [
                20802,
                20805
            ],
            [
                20810,
                20820
            ],
            [
                20830,
                20860
            ],
            [
                20866,
                20926
            ],
            [
                20926,
                20933
            ],
            [
                20977,
                20989
            ],
            [
                20972,
                20976
            ],
            [
                20968,
                20971
            ],
            [
                20989,
                20991
            ],
            [
                20992,
                21023
            ],
            [
                21027,
                21051
            ],
            [
                21051,
                21054
            ],
            [
                21059,
                21072
            ],
            [
                21076,
                21125
            ],
            [
                21128,
                21171
            ],
            [
                21171,
                21187
            ],
            [
                21191,
                21206
            ],
            [
                21206,
                21232
            ],
            [
                21234,
                21263
            ],
            [
                21265,
                21276
            ],
            [
                21279,
                21308
            ],
            [
                21352,
                21401
            ],
            [
                21401,
                21424
            ],
            [
                21522,
                21544
            ],
            [
                21465,
                21467
            ],
            [
                21545,
                21573
            ],
            [
                21578,
                21586
            ],
            [
                21606,
                21612
            ],
            [
                21650,
                21658
            ],
            [
                21613,
                21618
            ],
            [
                21620,
                21630
            ],
            [
                21660,
                21691
            ],
            [
                21692,
                21698
            ],
            [
                21698,
                21713
            ],
            [
                21717,
                21724
            ],
            [
                21726,
                21743
            ],
            [
                21774,
                21860
            ],
            [
                21953,
                21990
            ],
            [
                22003,
                22023
            ],
            [
                22024,
                22106
            ],
            [
                22150,
                22162
            ],
            [
                22165,
                22205
            ],
            [
                22221,
                22223
            ],
            [
                22223,
                22279
            ],
            [
                22280,
                22290
            ],
            [
                22293,
                22301
            ],
            [
                22327,
                22340
            ],
            [
                22341,
                22363
            ],
            [
                22374,
                22376
            ],
            [
                22366,
                22373
            ],
            [
                22376,
                22377
            ],
            [
                22379,
                22473
            ],
            [
                22474,
                22500
            ],
            [
                22504,
                22515
            ],
            [
                22515,
                22531
            ],
            [
                22542,
                22546
            ],
            [
                22580,
                22624
            ],
            [
                22636,
                22638
            ],
            [
                22642,
                22657
            ],
            [
                22662,
                22673
            ],
            [
                22676,
                22699
            ],
            [
                22700,
                22729
            ],
            [
                22754,
                22765
            ],
            [
                22769,
                22775
            ],
            [
                22824,
                22833
            ],
            [
                22839,
                22867
            ],
            [
                22871,
                22890
            ],
            [
                22905,
                22979
            ],
            [
                22982,
                22996
            ],
            [
                22996,
                23050
            ],
            [
                23074,
                23076
            ],
            [
                23076,
                23088
            ],
            [
                23140,
                23144
            ],
            [
                23148,
                23150
            ],
            [
                23093,
                23101
            ],
            [
                23126,
                23135
            ],
            [
                23151,
                23172
            ],
            [
                23172,
                23206
            ],
            [
                23208,
                23232
            ],
            [
                23251,
                23252
            ],
            [
                23236,
                23245
            ],
            [
                23272,
                23294
            ],
            [
                23294,
                23327
            ],
            [
                23370,
                23371
            ],
            [
                23331,
                23370
            ],
            [
                23372,
                23423
            ],
            [
                23330,
                23331
            ],
            [
                23425,
                23428
            ],
            [
                23430,
                23432
            ],
            [
                23434,
                23436
            ],
            [
                23439,
                23443
            ],
            [
                23451,
                23474
            ],
            [
                23474,
                23524
            ],
            [
                23524,
                23565
            ],
            [
                23583,
                23650
            ],
            [
                23650,
                23683
            ],
            [
                23687,
                23706
            ],
            [
                23706,
                23789
            ],
            [
                23793,
                23868
            ],
            [
                23868,
                23883
            ],
            [
                23895,
                23956
            ],
            [
                23965,
                23976
            ],
            [
                23982,
                24011
            ],
            [
                24011,
                24037
            ],
            [
                24038,
                24078
            ],
            [
                24081,
                24100
            ],
            [
                24102,
                24106
            ],
            [
                24154,
                24156
            ],
            [
                24127,
                24134
            ],
            [
                24148,
                24153
            ],
            [
                24231,
                24233
            ],
            [
                24234,
                24301
            ],
            [
                24308,
                24485
            ],
            [
                24485,
                24525
            ],
            [
                24541,
                24584
            ],
            [
                24588,
                24642
            ],
            [
                24642,
                24672
            ],
            [
                24672,
                24713
            ],
            [
                24717,
                24761
            ],
            [
                24761,
                24771
            ],
            [
                24781,
                24787
            ],
            [
                24804,
                24831
            ],
            [
                24842,
                24844
            ],
            [
                24934,
                24976
            ],
            [
                24988,
                25061
            ],
            [
                25065,
                25077
            ],
            [
                25088,
                25093
            ],
            [
                25102,
                25131
            ],
            [
                25135,
                25139
            ],
            [
                25181,
                25339
            ],
            [
                25343,
                25349
            ],
            [
                25349,
                25384
            ],
            [
                25617,
                25618
            ],
            [
                25506,
                25523
            ],
            [
                25526,
                25539
            ],
            [
                25541,
                25544
            ],
            [
                25553,
                25606
            ],
            [
                25637,
                25639
            ],
            [
                25639,
                25681
            ],
            [
                25685,
                25712
            ],
            [
                25712,
                25715
            ],
            [
                25716,
                25744
            ],
            [
                25753,
                25780
            ],
            [
                25817,
                25818
            ],
            [
                25784,
                25814
            ],
            [
                25819,
                25883
            ],
            [
                25883,
                25946
            ],
            [
                25992,
                25994
            ],
            [
                25994,
                26067
            ],
            [
                26074,
                26104
            ],
            [
                26104,
                26126
            ],
            [
                26126,
                26177
            ],
            [
                26179,
                26223
            ],
            [
                26223,
                26302
            ],
            [
                26327,
                26329
            ],
            [
                26329,
                26377
            ],
            [
                26377,
                26381
            ],
            [
                26385,
                26387
            ],
            [
                26393,
                26397
            ],
            [
                26419,
                26493
            ],
            [
                26511,
                26535
            ],
            [
                26564,
                26607
            ],
            [
                26546,
                26547
            ],
            [
                26634,
                26665
            ],
            [
                26665,
                26706
            ],
            [
                26706,
                26719
            ],
            [
                26719,
                26743
            ],
            [
                26743,
                26762
            ],
            [
                26766,
                26779
            ],
            [
                26779,
                26802
            ],
            [
                26806,
                26880
            ],
            [
                26881,
                26902
            ],
            [
                26902,
                26939
            ],
            [
                26939,
                26988
            ],
            [
                26997,
                27039
            ],
            [
                27084,
                27086
            ],
            [
                27086,
                27151
            ],
            [
                27151,
                27166
            ],
            [
                27195,
                27196
            ],
            [
                27170,
                27185
            ],
            [
                27197,
                27200
            ],
            [
                27190,
                27193
            ],
            [
                27202,
                27224
            ],
            [
                27236,
                27239
            ],
            [
                27245,
                27273
            ],
            [
                27276,
                27302
            ],
            [
                27305,
                27312
            ],
            [
                27312,
                27351
            ],
            [
                27357,
                27421
            ],
            [
                27423,
                27479
            ],
            [
                27487,
                27529
            ],
            [
                27529,
                27561
            ],
            [
                27564,
                27621
            ],
            [
                27625,
                27674
            ],
            [
                27714,
                27727
            ],
            [
                27733,
                27746
            ],
            [
                27750,
                27760
            ],
            [
                27763,
                27784
            ],
            [
                27786,
                27839
            ],
            [
                27846,
                27856
            ],
            [
                27862,
                27869
            ]
        ],
        "row_chars": [
            [
                0,
                129
            ],
            [
                129,
                144
            ],
            [
                144,
                399
            ],
            [
                399,
                561
            ],
            [
                561,
                682
            ],
            [
                682,
                845
            ],
            [
                845,
                1112
            ],
            [
                1112,
                1216
            ],
            [
                1216,
                1236
            ],
            [
                1236,
                1334
            ],
            [
                1334,
                1454
            ],
            [
                1454,
                1738
            ],
            [
                1738,
                1918
            ],
            [
                1918,
                1970
            ],
            [
                1970,
                2101
            ],
            [
                2101,
                2302
            ],
            [
                2302,
                2474
            ],
            [
                2474,
                2670
            ],
            [
                2670,
                3009
            ],
            [
                3009,
                3116
            ],
            [
                3116,
                3396
            ],
            [
                3396,
                3442
            ],
            [
                3442,
                3531
            ],
            [
                3531,
                3583
            ],
            [
                3583,
                3620
            ],
            [
                3620,
                3738
            ],
            [
                3738,
                3750
            ],
            [
                3750,
                3793
            ],
            [
                3793,
                3816
            ],
            [
                3816,
                3893
            ],
            [
                3893,
                3955
            ],
            [
                3955,
                3988
            ],
            [
                3988,
                4012
            ],
            [
                4012,
                4117
            ],
            [
                4117,
                4225
            ],
            [
                4225,
                4327
            ],
            [
                4327,
                4339
            ],
            [
                4339,
                4550
            ],
            [
                4550,
                4597
            ],
            [
                4597,
                4616
            ],
            [
                4616,
                4688
            ],
            [
                4688,
                4979
            ],
            [
                4979,
                4990
            ],
            [
                4990,
                5002
            ],
            [
                5002,
                5054
            ],
            [
                5054,
                5087
            ],
            [
                5087,
                5103
            ],
            [
                5103,
                5121
            ],
            [
                5121,
                5206
            ],
            [
                5206,
                5233
            ],
            [
                5233,
                5244
            ],
            [
                5244,
                5268
            ],
            [
                5268,
                5285
            ],
            [
                5285,
                5362
            ],
            [
                5362,
                5392
            ],
            [
                5392,
                5589
            ],
            [
                5589,
                5632
            ],
            [
                5632,
                5676
            ],
            [
                5676,
                5736
            ],
            [
                5736,
                5821
            ],
            [
                5821,
                5952
            ],
            [
                5952,
                6012
            ],
            [
                6012,
                6199
            ],
            [
                6199,
                6325
            ],
            [
                6325,
                6433
            ],
            [
                6433,
                6527
            ],
            [
                6527,
                6723
            ],
            [
                6723,
                6808
            ],
            [
                6808,
                6942
            ],
            [
                6942,
                6996
            ],
            [
                6996,
                7025
            ],
            [
                7025,
                7072
            ],
            [
                7072,
                7116
            ],
            [
                7116,
                7206
            ],
            [
                7206,
                7343
            ],
            [
                7343,
                7381
            ],
            [
                7381,
                7441
            ],
            [
                7441,
                7505
            ],
            [
                7505,
                7519
            ],
            [
                7519,
                7550
            ],
            [
                7550,
                7680
            ],
            [
                7680,
                7732
            ],
            [
                7732,
                7741
            ],
            [
                7741,
                7878
            ],
            [
                7878,
                7896
            ],
            [
                7896,
                8071
            ],
            [
                8071,
                8157
            ],
            [
                8157,
                8181
            ],
            [
                8181,
                8237
            ],
            [
                8237,
                8255
            ],
            [
                8255,
                8274
            ],
            [
                8274,
                8299
            ],
            [
                8299,
                8306
            ],
            [
                8306,
                8357
            ],
            [
                8357,
                8415
            ],
            [
                8415,
                8441
            ],
            [
                8441,
                8475
            ],
            [
                8475,
                8482
            ],
            [
                8482,
                8548
            ],
            [
                8548,
                8607
            ],
            [
                8607,
                8623
            ],
            [
                8623,
                8714
            ],
            [
                8714,
                9111
            ],
            [
                9111,
                9148
            ],
            [
                9148,
                9306
            ],
            [
                9306,
                9348
            ],
            [
                9348,
                9354
            ],
            [
                9354,
                9374
            ],
            [
                9374,
                9558
            ],
            [
                9558,
                9734
            ],
            [
                9734,
                9900
            ],
            [
                9900,
                9958
            ],
            [
                9958,
                10006
            ],
            [
                10006,
                10072
            ],
            [
                10072,
                10080
            ],
            [
                10080,
                10138
            ],
            [
                10138,
                10170
            ],
            [
                10170,
                10378
            ],
            [
                10378,
                10520
            ],
            [
                10520,
                10544
            ],
            [
                10544,
                10578
            ],
            [
                10578,
                10582
            ],
            [
                10582,
                10621
            ],
            [
                10621,
                10707
            ],
            [
                10707,
                10880
            ],
            [
                10880,
                10988
            ],
            [
                10988,
                11137
            ],
            [
                11137,
                11398
            ],
            [
                11398,
                11421
            ],
            [
                11421,
                11565
            ],
            [
                11565,
                11670
            ],
            [
                11670,
                11778
            ],
            [
                11778,
                11972
            ],
            [
                11972,
                12156
            ],
            [
                12156,
                12375
            ],
            [
                12375,
                12413
            ],
            [
                12413,
                12490
            ],
            [
                12490,
                12560
            ],
            [
                12560,
                12891
            ],
            [
                12891,
                12906
            ],
            [
                12906,
                13173
            ],
            [
                13173,
                13287
            ],
            [
                13287,
                13325
            ],
            [
                13325,
                13590
            ],
            [
                13590,
                13698
            ],
            [
                13698,
                13891
            ],
            [
                13891,
                14146
            ],
            [
                14146,
                14169
            ],
            [
                14169,
                14372
            ],
            [
                14372,
                14424
            ],
            [
                14424,
                14519
            ],
            [
                14519,
                14549
            ],
            [
                14549,
                14594
            ],
            [
                14594,
                14721
            ],
            [
                14721,
                14783
            ],
            [
                14783,
                14844
            ],
            [
                14844,
                14884
            ],
            [
                14884,
                14981
            ],
            [
                14981,
                15196
            ],
            [
                15196,
                15360
            ],
            [
                15360,
                15381
            ],
            [
                15381,
                15439
            ],
            [
                15439,
                15500
            ],
            [
                15500,
                15607
            ],
            [
                15607,
                15780
            ],
            [
                15780,
                15787
            ],
            [
                15787,
                15821
            ],
            [
                15821,
                15845
            ],
            [
                15845,
                15877
            ],
            [
                15877,
                15891
            ],
            [
                15891,
                15981
            ],
            [
                15981,
                16097
            ],
            [
                16097,
                16215
            ],
            [
                16215,
                16252
            ],
            [
                16252,
                16435
            ],
            [
                16435,
                16522
            ],
            [
                16522,
                16611
            ],
            [
                16611,
                16649
            ],
            [
                16649,
                16667
            ],
            [
                16667,
                16771
            ],
            [
                16771,
                16788
            ],
            [
                16788,
                16927
            ],
            [
                16927,
                16957
            ],
            [
                16957,
                17139
            ],
            [
                17139,
                17203
            ],
            [
                17203,
                17267
            ],
            [
                17267,
                17438
            ],
            [
                17438,
                17537
            ],
            [
                17537,
                17576
            ],
            [
                17576,
                17640
            ],
            [
                17640,
                17717
            ],
            [
                17717,
                17757
            ],
            [
                17757,
                18067
            ],
            [
                18067,
                18184
            ],
            [
                18184,
                18232
            ],
            [
                18232,
                18378
            ],
            [
                18378,
                18414
            ],
            [
                18414,
                18520
            ],
            [
                18520,
                18562
            ],
            [
                18562,
                18618
            ],
            [
                18618,
                18656
            ],
            [
                18656,
                18730
            ],
            [
                18730,
                18854
            ],
            [
                18854,
                18904
            ],
            [
                18904,
                19010
            ],
            [
                19010,
                19215
            ],
            [
                19215,
                19250
            ],
            [
                19250,
                19343
            ],
            [
                19343,
                19456
            ],
            [
                19456,
                19558
            ],
            [
                19558,
                19608
            ],
            [
                19608,
                19674
            ],
            [
                19674,
                19726
            ],
            [
                19726,
                19789
            ],
            [
                19789,
                19815
            ],
            [
                19815,
                19862
            ],
            [
                19862,
                19900
            ],
            [
                19900,
                19975
            ],
            [
                19975,
                20032
            ],
            [
                20032,
                20113
            ],
            [
                20113,
                20280
            ],
            [
                20280,
                20365
            ],
            [
                20365,
                20629
            ],
            [
                20629,
                20691
            ],
            [
                20691,
                20742
            ],
            [
                20742,
                20926
            ],
            [
                20926,
                20991
            ],
            [
                20991,
                21026
            ],
            [
                21026,
                21051
            ],
            [
                21051,
                21075
            ],
            [
                21075,
                21128
            ],
            [
                21128,
                21171
            ],
            [
                21171,
                21187
            ],
            [
                21187,
                21206
            ],
            [
                21206,
                21401
            ],
            [
                21401,
                21660
            ],
            [
                21660,
                21691
            ],
            [
                21691,
                21698
            ],
            [
                21698,
                21716
            ],
            [
                21716,
                21747
            ],
            [
                21747,
                21768
            ],
            [
                21768,
                21862
            ],
            [
                21862,
                21953
            ],
            [
                21953,
                22023
            ],
            [
                22023,
                22149
            ],
            [
                22149,
                22223
            ],
            [
                22223,
                22279
            ],
            [
                22279,
                22340
            ],
            [
                22340,
                22503
            ],
            [
                22503,
                22515
            ],
            [
                22515,
                22542
            ],
            [
                22542,
                22638
            ],
            [
                22638,
                22661
            ],
            [
                22661,
                22699
            ],
            [
                22699,
                22731
            ],
            [
                22731,
                22753
            ],
            [
                22753,
                22768
            ],
            [
                22768,
                22775
            ],
            [
                22775,
                22824
            ],
            [
                22824,
                22870
            ],
            [
                22870,
                22996
            ],
            [
                22996,
                23076
            ],
            [
                23076,
                23172
            ],
            [
                23172,
                23235
            ],
            [
                23235,
                23271
            ],
            [
                23271,
                23294
            ],
            [
                23294,
                23330
            ],
            [
                23330,
                23474
            ],
            [
                23474,
                23524
            ],
            [
                23524,
                23568
            ],
            [
                23568,
                23650
            ],
            [
                23650,
                23686
            ],
            [
                23686,
                23706
            ],
            [
                23706,
                23792
            ],
            [
                23792,
                23868
            ],
            [
                23868,
                24011
            ],
            [
                24011,
                24081
            ],
            [
                24081,
                24233
            ],
            [
                24233,
                24485
            ],
            [
                24485,
                24587
            ],
            [
                24587,
                24642
            ],
            [
                24642,
                24672
            ],
            [
                24672,
                24716
            ],
            [
                24716,
                24761
            ],
            [
                24761,
                24844
            ],
            [
                24844,
                25064
            ],
            [
                25064,
                25134
            ],
            [
                25134,
                25139
            ],
            [
                25139,
                25342
            ],
            [
                25342,
                25349
            ],
            [
                25349,
                25434
            ],
            [
                25434,
                25505
            ],
            [
                25505,
                25639
            ],
            [
                25639,
                25684
            ],
            [
                25684,
                25712
            ],
            [
                25712,
                25783
            ],
            [
                25783,
                25883
            ],
            [
                25883,
                25994
            ],
            [
                25994,
                26070
            ],
            [
                26070,
                26104
            ],
            [
                26104,
                26126
            ],
            [
                26126,
                26223
            ],
            [
                26223,
                26329
            ],
            [
                26329,
                26377
            ],
            [
                26377,
                26381
            ],
            [
                26381,
                26385
            ],
            [
                26385,
                26493
            ],
            [
                26493,
                26511
            ],
            [
                26511,
                26535
            ],
            [
                26535,
                26665
            ],
            [
                26665,
                26706
            ],
            [
                26706,
                26719
            ],
            [
                26719,
                26743
            ],
            [
                26743,
                26765
            ],
            [
                26765,
                26779
            ],
            [
                26779,
                26902
            ],
            [
                26902,
                26939
            ],
            [
                26939,
                26991
            ],
            [
                26991,
                27086
            ],
            [
                27086,
                27151
            ],
            [
                27151,
                27169
            ],
            [
                27169,
                27276
            ],
            [
                27276,
                27312
            ],
            [
                27312,
                27529
            ],
            [
                27529,
                27563
            ],
            [
                27563,
                27624
            ],
            [
                27624,
                27676
            ],
            [
                27676,
                27713
            ],
            [
                27713,
                27732
            ],
            [
                27732,
                27749
            ],
            [
                27749,
                27871
            ]
        ]
    },
    "abridged": {
        "text": "It was not merely that Margaret was known to Mr. Thornton to have spoken falsely - though this was the only reason she imagined - but that her falsehood was linked in his mind to some other lover. He could not forget the fond and earnest look that had passed between her and the other man - the attitude of familiar confidence. The thought of this stung him.\nIn addition (and he ground his teeth as he remembered it) was the hour, dusky twilight; the place, so far away from home, and lonely. His nobler self had said at first that all this might be accidental and innocent; but once allow her the right to love and be beloved (and had he any reason to deny that right?) - she might easily have been beguiled into a longer walk, to a later hour than she had anticipated.\nBut that falsehood! which showed a fatal consciousness of something wrong, and to be concealed, which was unlike her. He did her that much justice, though it would have been a relief to believe her utterly unworthy of his esteem. It was this that made the misery - that he passionately loved her, and thought her, even with all her faults, more lovely and more excellent than any other woman; yet he believed her so attached to some other man that she would violate her truthful nature. The falsehood was proof of how blindly she loved another - this dark, slight, handsome man - while he himself was rough, and stern, and strongly made.\nHe lashed himself into an agony of fierce jealousy. He thought of that look, that attitude! He would have laid his life at her feet for such tender glances! He mocked himself, for having valued the mechanical way in which she had protected him from the fury of the mob; now he had seen how soft and bewitching she looked when with a man she really loved. This man, this hidden lover, had her looks, words, hand-cleavings, lies, concealment, all to himself.\nMr. Thornton was conscious that he had never been so irritable in his life as he was now. He felt inclined to give a short abrupt answer, like a bark, to every question; and this hurt his pride, for he had always piqued himself on his self-control. So he subdued his manner, but it was a hard task. He was more than usually silent at home; spending his evenings pacing backwards and forwards, which would have annoyed his mother exceedingly if it had been done by anyone else; and was tiresome even in this beloved son.\n'Can you sit down for a moment? I have something to say to you, if you would give up that everlasting walk, walk, walk.'\nHe sat down instantly.\n'I want to speak to you about Betsy. She says she must leave us; that her lover's death has so affected her spirits she can't work.'\n'Very well. I suppose other cooks are to be found.'\n'That's so like a man. It's not merely the cooking, it is that she knows all the ways of the house. Besides, she tells me something about your friend Miss Hale.'\n'Miss Hale is no friend of mine. Mr. Hale is my friend.'\n'I am glad to hear you say so, for if she had been your friend, what Betsy says would have annoyed you.'\n'Let me hear it,' said he, with the extreme quietness of manner he had been assuming for the last few days.\n'Betsy says, that the night on which her lover - I forget his name-'\n'Leonards.'\n'The night on which Leonards was last seen at the station - Miss Hale was there, walking with a young man who, Betsy believes, killed Leonards by some blow or push.'\n'Leonards was not killed by any blow or push.'\n'How do you know?'\n'Because I distinctly put the question to the surgeon of the Infirmary. He told me there was a long-standing disease, caused by Leonards' habit of drinking to excess; that his last fatal attack was caused by drinking, not the fall.'\n'The fall! What fall?'\n'Caused by the blow or push of which Betsy speaks.'\n'Then there was a blow or push?'\n'I believe so.'\n'And who did it?'\n'As there was no inquest, I cannot tell you.'\n'But Miss Hale was there?'\nNo answer.\n'And with a young man?'\nStill no answer. At last he said: 'I tell you, mother, that there was no judicial inquiry.'\n'Betsy says that some man who is in a grocer's shop at Crampton can swear that Miss Hale was at the station, walking with a young man.'\n'I don't see what we have to do with that. Miss Hale is at liberty to please herself.'\n'I'm glad to hear you say so,' said Mrs. Thornton, eagerly. 'It certainly means nothing to you, after what has passed! but I promised Mrs. Hale that I would not allow her daughter to go wrong without advising her. I shall certainly let her know my opinion of such conduct.'\n'I do not see any harm in what she did that evening,' said Mr. Thornton, getting up, and standing by the chimney-piece with his face turned away from the room.\n'You would not have approved of Fanny's being seen out, after dark, in a lonely place, with a young man. I say nothing of the choice of time, when her mother lay unburied, for such a promenade. Should you have liked your sister to have been noticed by a grocer's assistant for doing so?'\n'In the first place, as it is not many years since I myself was a draper's assistant, that circumstance does not alter the nature of the act to me. And in the next place, I see a great deal of difference between Miss Hale and Fanny. I can imagine that the one may have weighty reasons, which might make her overlook any seeming impropriety in her conduct. I never knew Fanny have weighty reasons for anything.'\n'A pretty character of your sister, indeed! Really, John, one would have thought Miss Hale had done enough to make you clear-sighted. She drew you on to an offer, by a bold display of pretended regard - to play you off against this very young man, I've no doubt. Her whole conduct is clear to me now. You believe he is her lover, I suppose?'\nHe turned round to his mother; his face was very grey and grim. 'Yes, mother. I do believe he is her lover.' When he had spoken, he turned again and leant his face against his hand. Then before she could speak, he added:\n'Mother. He is her lover; but she may need help and womanly counsel; there may be difficulties or temptations which I don't know. I fear there are. I don't want to know what they are; but as you have always been a good and tender mother to me, go to her, and gain her confidence, and tell her what is best to be done. I know that something is wrong; and it must be a terrible torture to her.'\n'For God's sake, John!' said his mother, now really shocked, 'what do you mean? What do you know?'\nHe did not reply.\n'John! I don't know what to think unless you speak. You must explain. These half-expressions are what ruin a woman's character.'\n'Her character! Mother, you do not dare-' He looked her in the face with flaming eyes. Then, drawing himself up with determined composure, he said, 'I will not say any more than this: that I have good reason to believe that Miss Hale is in some difficulty connected with an attachment which of itself, from my knowledge of Miss Hale's character, is perfectly innocent and right. I refuse to tell my reason. But never let me hear anyone say a word against her, implying anything more serious than that she now needs the counsel of some kind and gentle woman. You promised Mrs. Hale to be that woman!'\n'No!' said Mrs. Thornton. 'I am happy to say, I did not promise kindness and gentleness, for I felt that it might be out of my power to offer these to one of Miss Hale's character. I promised counsel and advice, such as I would give to my own daughter. I shall speak to her as I would do to Fanny, if she had gone gallivanting with a young man in the dusk. Then I shall have fulfilled my promise, and done my duty.'\n'She will never bear it,' said he passionately.\n'She will have to bear it, if I speak in her dead mother's name.'\n'Well!' said he, breaking away, 'don't tell me any more about it. I cannot endure to think of it.'\nAs he shut himself into his private room, he continued. 'Oh! that look of love! And that cursed lie; which showed some terrible shame to be kept dark! Oh, Margaret, Margaret! Could you not have loved me? I am uncouth and hard, but I would never have led you into any falsehood for me.'\nThe more Mrs. Thornton thought over what her son had said, in pleading for a merciful judgment on Margaret, the more bitter she felt towards her. She took a savage pleasure in the idea of 'speaking her mind' to her, in the guise of fulfilling her duty. She enjoyed the thought of showing herself untouched by the enchantment which she felt Margaret had thrown over many people. She snorted scornfully over her victim's beauty; her jet black hair, her smooth skin, her lucid eyes would not save her one word of the just and stern reproach which Mrs. Thornton spent half the night preparing in her mind.\n'Is Miss Hale within?' She knew she was, for she had seen her at the window, and she had her feet inside the little hall before Martha had answered.\nMargaret was sitting alone, writing to Edith about her mother's last days. She had to brush away unbidden tears as Mrs. Thornton was announced.\nShe was so gentle and ladylike that her visitor was somewhat daunted; and it became impossible to utter the speech, so easy to prepare with no one to address it to. Margaret's low rich voice was softer than usual; her manner more gracious, because she was feeling very grateful to Mrs. Thornton for the courteous attention of her call. She exerted herself to make conversation; and praised Martha, the servant whom Mrs. Thornton had found for them.\nMrs. Thornton was fairly discomfited. Her sharp blade seemed out of place, and useless among rose-leaves. She was silent until she stung herself into performing her duty by reflecting that all this sweetness was probably put on just to propitiate her. She suspected that the other attachment had fallen through, and Miss Hale hoped to recall her rejected lover.\nPoor Margaret! It was true that Mrs. Thornton was the mother of one whose regard she valued, and feared to have lost; and this thought unconsciously added to her natural desire of pleasing her. Mrs. Thornton cleared her throat and began:\n'Miss Hale, I have a duty to perform. I promised your poor mother that I would not allow you to act in any way wrongly, or (she softened her speech a little here) inadvertently, without remonstrating; at least, without offering advice, whether you took it or not.'\nMargaret stood blushing, with her eyes dilating. She thought Mrs. Thornton had come to speak to her about the falsehood she had told - that Mr. Thornton had employed her to explain the danger she had exposed herself to, of being confuted in court. Although her heart sank to think he had not chosen to come himself, yet she was too much humbled not to listen patiently and meekly.\nMrs. Thornton went on:\n'At first, when I heard from one of my servants, that you had been seen walking about with a gentleman, at the Outwood station, late in the evening, I could hardly believe it. But my son, I am sorry to say, confirmed her story. It was indiscreet, to say the least; many a young woman has lost her character before now-'\nMargaret's eyes flashed fire. This was a new idea - this was insulting. If Mrs. Thornton had spoken to her about the lie, well and good - she would have owned up to it. But to speak of her character! Mrs. Thornton, a mere stranger - it was too impertinent! She would not answer her - not one word.\nMrs. Thornton saw the battle-spirit in Margaret's eyes, and it called up her combativeness also.\n'For your mother's sake, I thought it right to warn you against such improprieties; they must degrade you in the long run in the world's eyes, even if they do not lead you to positive harm.'\n'For my mother's sake,' said Margaret tearfully, 'I will bear much; but she never meant me to be exposed to insult, I am sure.'\n'Insult, Miss Hale!'\n'Yes, madam,' said Margaret more steadily, 'it is insult. What do you know of me that should lead you to suspect - Oh!' said she, breaking down, and covering her face with her hands - 'I know now, Mr. Thornton has told you-'\n'No, Miss Hale,' said Mrs. Thornton, her truthfulness causing her to break in. 'Stop. Mr. Thornton has told me nothing. You do not know my son. You are not worthy to know him. He said this. Listen, young lady, and understand, if you can, what sort of a man you rejected. He said to me last night, \"Go to her. I have good reason to know that she is in some difficulty, arising out of an attachment; and she needs womanly counsel.\" Beyond that - and your being at the station with a gentleman - he has said not one word against you. If he has knowledge of anything which should make you sob so, he keeps it to himself.'\nMargaret's face was still hidden in her hands. Mrs. Thornton was a little mollified.\n'Come, Miss Hale. There may be circumstances, I'll allow, that, if explained, may lessen the impropriety.'\nStill no answer. Margaret was considering what to say; she wished to stand well with Mrs. Thornton; and yet she could not explain. Mrs. Thornton grew impatient.\n'I shall be sorry to break off an acquaintance; but for Fanny's sake-'\n'I can give you no explanation,' said Margaret, in a low voice. 'I have done wrong, but not in the way you think. Mr. Thornton judges me more mercifully than you;' - she had hard work to keep herself from choking with her tears - 'but, I believe, madam, you mean to do rightly.'\n'Thank you,' said Mrs. Thornton, drawing herself up; 'I was not aware that my meaning was doubted. It is the last time I shall interfere. I did not approve of my son's attachment to you. You did not appear to me worthy of him. But when you compromised yourself at the time of the riot, and exposed yourself to the comments of servants and workpeople, I felt it was no longer right to set myself against my son's wish of proposing to you - a wish, by the way, which he had always denied having until the day of the riot.' Margaret winced, and drew in her breath. Mrs. Thornton went on. 'He came; you had apparently changed your mind. I told my son yesterday, that I thought it possible, short as was the interval, you might have learnt something of this other lover-'\n'What must you think of me, madam?' asked Margaret, throwing her head back with proud disdain. 'You can say nothing more, Mrs. Thornton. I decline every attempt to justify myself. You must allow me to leave the room.'\nAnd she swept out of it with the noiseless grace of an offended princess. Mrs. Thornton had enough natural humour to make her feel the ludicrousness of the position in which she was left. There was nothing for it but to show herself out. She was not particularly annoyed; she did not care enough about Margaret for that. Margaret's passion had mollified her visitor, far more than any silence could have done. It showed the effect of her words.\n'My young lady,' thought Mrs. Thornton, 'you've a pretty good temper of your own. If John and you had come together, he would have had to keep a tight hand over you. But I don't think you will go a-walking again with your beau, at such an hour. You've too much pride for that. I like to see a girl fly out at the notion of being talked about. It shows they're neither giddy, nor bold. As for that girl, she might be bold, but she'd never be giddy. Now as for Fanny, she'd be giddy, and not bold. She's no courage, poor thing!'\nMr. Thornton was not spending the morning so satisfactorily as his mother. He was trying to understand what damage the strike had done him. A good deal of his capital was locked up in new and expensive machinery; and he had also bought in cotton with a view to some large orders. The strike had thrown him terribly behindhand in the completion of these orders. Even with his own skilled workpeople, he would have had some difficulty in fulfilling them; as it was, the incompetence of the Irish hands, who had to be trained, was an annoyance.\nIt was not a favourable hour for Higgins to make his request. But he had promised Margaret to do it. So, though every moment added to his repugnance, pride and sullenness, he stood leaning against the wall, hour after hour, first on one leg, then on the other. At last Mr. Thornton came out.\n'I want for to speak to yo', sir.'\n'Can't stay now, my man. I'm late as it is.'\n'Well, sir, I reckon I can wait till yo' come back.'\nMr. Thornton was half way down the street. Higgins sighed. It was no use. To catch him in the street was his only chance of seeing 'the measter;' if he had rung the lodge bell, he would have been referred to the overlooker. So he stood still again as the crowd drove out of the millyard at dinner-time, scowling at the imported Irish 'knobsticks'. At last Mr. Thornton returned.\n'What! you there still!'\n'Ay, sir. I mun speak to yo'.'\n'We'll go across the yard; the men are not come back, and we shall have it to ourselves.' He stopped to speak to the overlooker, who said in a low tone:\n'I suppose you know, sir, that that man is Higgins, one of the leaders of the Union.'\n'No, I didn't,' said Mr. Thornton, looking round sharply. Higgins was known to him by name as a turbulent spirit.\n'Come along,' said he, more roughly than before. 'It is men such as this,' he thought, 'who interrupt commerce and injure the very town they live in: mere demagogues, lovers of power, at whatever cost to others.'\n'Well, sir! what do you want?' he said, as soon as they were in the counting-house.\n'My name is Higgins-'\n'I know that,' broke in Mr. Thornton. 'What do you want, Mr. Higgins?'\n'I want work.'\n'Work! You don't lack impudence, that's very clear.'\n'I've getten enemies, like my betters; but I ne'er heerd o' ony of them calling me o'er-modest,' said Higgins. His blood was a little roused by Mr. Thornton's manner.\nMr. Thornton took up a letter from the table and read it through. At the end, he looked up and said, 'What are you waiting for?'\n'An answer.'\n'I gave it you before. Don't waste any more of your time.'\n'Yo' made a remark, sir, on my impudence: but I were taught that it was manners to say either \"yes\" or \"no,\" when axed a civil question. I should be thankfu' to yo' if yo'd give me work. Hamper will speak to my being a good hand.'\n'You'd better not send me to Hamper to ask for a character, my man. I might hear more than you'd like.'\n'I'd take th' risk. Worst they could say of me is, that I did what I thought best, even to my own wrong.'\n'You'd better go and try them, then, and see whether they'll give you work. I've turned off a hundred of my best hands, for no other fault than following such as you. D'ye think I'll take you on? I might as well put a firebrand into the midst of the cotton-waste.'\nHiggins turned away; then he remembered Boucher, and tried once more.\n'I'd promise yo', measter, I'd not speak a word as could do harm, if yo' did right by us; and I'd promise more: I'd promise that when I seed yo' going wrong, and acting unfair, I'd speak to yo' in private first; and that would be a fair warning. If yo' and I did na agree in our opinion, yo' might turn me off at an hour's notice.'\n'Upon my word, you don't think small beer of yourself! Hamper has had a loss of you. How came he to let you and your wisdom go?'\n'Well, we parted wi' mutual dissatisfaction. I wouldn't agree to their pledge; and they wouldn't have me. But I'm a good hand, measter, and a steady man - specially when I can keep fro' drink; and that I shall do now, if I ne'er did afore.'\n'So that you may save money for another strike, I suppose?'\n'No! It's for to keep th' widow and childer of a man who was drove mad by them knobsticks o' yourn; put out of his place by a Paddy that did na know weft fro' warp.'\n'Well! you'd better turn to something else.'\n'If it were summer,' said Higgins, 'I'd do Paddy's work, and go as a navvy, or haymaking, or summut. But it's winter, and th' childer will clem.'\n'A pretty navvy you'd make! why, you couldn't do half a day's digging against an Irishman.'\n'I'd only charge half-a-day for twelve hours, if I could only do half-a-day's work in th' time. Yo're not knowing of any place, where they could gi' me a trial? I'd take any wage they thought I was worth, for the sake of those childer.'\n'Don't you see what you would be? You'd be a knobstick. You'd be taking less wages than the other labourers - all for the sake of another man's children. Think how you'd abuse any poor fellow who was willing to take what he could get. You and your Union would soon be down upon him. No! if only because of the way in which you've used the poor knobsticks before now, I say No! I'll not give you work. As for your pretext for coming and asking for work, it may be true, or it may not. It's a very unlikely story, at any rate. Let me pass. I'll not give you work. There's your answer.'\n'I hear, sir. I would na ha' troubled yo', but that I were bid to come, by one as seemed to think yo'd getten some soft place in your heart. Hoo were mistook, and I were misled. But I'm not the first man as is misled by a woman.'\n'Tell her to mind her own business the next time. I believe women are at the bottom of every plague in this world. Be off with you.'\n'I'm obleeged to yo' for your kindness, measter, and for your civil way o' saying good-bye.'\nMr. Thornton did not deign to reply. But, looking out of the window a minute after, he was struck with the lean, bent figure going out of the yard: the heavy walk was in strange contrast with the resolute determination of the man to speak to him. He crossed to the porter's lodge.\n'How long has that man Higgins been waiting to speak to me?'\n'He was outside the gate before eight o'clock, sir.'\n'And it is now-?'\n'Just one, sir.'\n'Five hours,' thought Mr. Thornton; 'it's a long time for a man to wait, doing nothing but hoping and fearing.'",
        "paragraph_chars": [
            [
                0,
                359
            ],
            [
                359,
                771
            ],
            [
                771,
                1409
            ],
            [
                1409,
                1866
            ],
            [
                1866,
                2386
            ],
            [
                2386,
                2507
            ],
            [
                2507,
                2530
            ],
            [
                2530,
                2663
            ],
            [
                2663,
                2715
            ],
            [
                2715,
                2877
            ],
            [
                2877,
                2934
            ],
            [
                2934,
                3039
            ],
            [
                3039,
                3147
            ],
            [
                3147,
                3216
            ],
            [
                3216,
                3228
            ],
            [
                3228,
                3394
            ],
            [
                3394,
                3441
            ],
            [
                3441,
                3460
            ],
            [
                3460,
                3693
            ],
            [
                3693,
                3716
            ],
            [
                3716,
                3768
            ],
            [
                3768,
                3801
            ],
            [
                3801,
                3817
            ],
            [
                3817,
                3835
            ],
            [
                3835,
                3881
            ],
            [
                3881,
                3908
            ],
            [
                3908,
                3919
            ],
            [
                3919,
                3943
            ],
            [
                3943,
                4035
            ],
            [
                4035,
                4171
            ],
            [
                4171,
                4258
            ],
            [
                4258,
                4532
            ],
            [
                4532,
                4692
            ],
            [
                4692,
                4980
            ],
            [
                4980,
                5391
            ],
            [
                5391,
                5733
            ],
            [
                5733,
                5954
            ],
            [
                5954,
                6347
            ],
            [
                6347,
                6446
            ],
            [
                6446,
                6464
            ],
            [
                6464,
                6593
            ],
            [
                6593,
                7193
            ],
            [
                7193,
                7609
            ],
            [
                7609,
                7657
            ],
            [
                7657,
                7723
            ],
            [
                7723,
                7822
            ],
            [
                7822,
                8108
            ],
            [
                8108,
                8710
            ],
            [
                8710,
                8859
            ],
            [
                8859,
                9003
            ],
            [
                9003,
                9452
            ],
            [
                9452,
                9814
            ],
            [
                9814,
                10052
            ],
            [
                10052,
                10317
            ],
            [
                10317,
                10698
            ],
            [
                10698,
                10721
            ],
            [
                10721,
                11041
            ],
            [
                11041,
                11339
            ],
            [
                11339,
                11436
            ],
            [
                11436,
                11627
            ],
            [
                11627,
                11755
            ],
            [
                11755,
                11776
            ],
            [
                11776,
                12001
            ],
            [
                12001,
                12619
            ],
            [
                12619,
                12704
            ],
            [
                12704,
                12811
            ],
            [
                12811,
                12972
            ],
            [
                12972,
                13043
            ],
            [
                13043,
                13322
            ],
            [
                13322,
                14089
            ],
            [
                14089,
                14307
            ],
            [
                14307,
                14752
            ],
            [
                14752,
                15279
            ],
            [
                15279,
                15821
            ],
            [
                15821,
                16113
            ],
            [
                16113,
                16148
            ],
            [
                16148,
                16193
            ],
            [
                16193,
                16246
            ],
            [
                16246,
                16625
            ],
            [
                16625,
                16650
            ],
            [
                16650,
                16681
            ],
            [
                16681,
                16834
            ],
            [
                16834,
                16920
            ],
            [
                16920,
                17034
            ],
            [
                17034,
                17247
            ],
            [
                17247,
                17331
            ],
            [
                17331,
                17353
            ],
            [
                17353,
                17424
            ],
            [
                17424,
                17439
            ],
            [
                17439,
                17492
            ],
            [
                17492,
                17659
            ],
            [
                17659,
                17788
            ],
            [
                17788,
                17801
            ],
            [
                17801,
                17860
            ],
            [
                17860,
                18091
            ],
            [
                18091,
                18195
            ],
            [
                18195,
                18301
            ],
            [
                18301,
                18566
            ],
            [
                18566,
                18636
            ],
            [
                18636,
                18968
            ],
            [
                18968,
                19097
            ],
            [
                19097,
                19338
            ],
            [
                19338,
                19398
            ],
            [
                19398,
                19564
            ],
            [
                19564,
                19609
            ],
            [
                19609,
                19755
            ],
            [
                19755,
                19847
            ],
            [
                19847,
                20084
            ],
            [
                20084,
                20668
            ],
            [
                20668,
                20898
            ],
            [
                20898,
                21031
            ],
            [
                21031,
                21124
            ],
            [
                21124,
                21405
            ],
            [
                21405,
                21466
            ],
            [
                21466,
                21519
            ],
            [
                21519,
                21537
            ],
            [
                21537,
                21554
            ],
            [
                21554,
                21665
            ]
        ],
        "segment_chars": [
            [
                0,
                197
            ],
            [
                197,
                328
            ],
            [
                328,
                359
            ],
            [
                359,
                493
            ],
            [
                493,
                671
            ],
            [
                671,
                771
            ],
            [
                771,
                791
            ],
            [
                791,
                889
            ],
            [
                889,
                1001
            ],
            [
                1001,
                1258
            ],
            [
                1258,
                1409
            ],
            [
                1409,
                1461
            ],
            [
                1461,
                1501
            ],
            [
                1501,
                1566
            ],
            [
                1566,
                1764
            ],
            [
                1764,
                1866
            ],
            [
                1866,
                1956
            ],
            [
                1956,
                2115
            ],
            [
                2115,
                2165
            ],
            [
                2165,
                2386
            ],
            [
                2386,
                2418
            ],
            [
                2418,
                2507
            ],
            [
                2507,
                2530
            ],
            [
                2530,
                2567
            ],
            [
                2567,
                2663
            ],
            [
                2663,
                2675
            ],
            [
                2675,
                2715
            ],
            [
                2715,
                2738
            ],
            [
                2738,
                2815
            ],
            [
                2815,
                2877
            ],
            [
                2877,
                2910
            ],
            [
                2910,
                2934
            ],
            [
                2934,
                3039
            ],
            [
                3039,
                3147
            ],
            [
                3147,
                3216
            ],
            [
                3216,
                3228
            ],
            [
                3228,
                3394
            ],
            [
                3394,
                3441
            ],
            [
                3441,
                3460
            ],
            [
                3460,
                3532
            ],
            [
                3532,
                3693
            ],
            [
                3693,
                3704
            ],
            [
                3704,
                3716
            ],
            [
                3716,
                3768
            ],
            [
                3768,
                3801
            ],
            [
                3801,
                3817
            ],
            [
                3817,
                3835
            ],
            [
                3835,
                3881
            ],
            [
                3881,
                3908
            ],
            [
                3908,
                3919
            ],
            [
                3919,
                3943
            ],
            [
                3943,
                3960
            ],
            [
                3960,
                4035
            ],
            [
                4035,
                4171
            ],
            [
                4171,
                4214
            ],
            [
                4214,
                4258
            ],
            [
                4258,
                4318
            ],
            [
                4318,
                4377
            ],
            [
                4377,
                4472
            ],
            [
                4472,
                4532
            ],
            [
                4532,
                4692
            ],
            [
                4692,
                4797
            ],
            [
                4797,
                4886
            ],
            [
                4886,
                4980
            ],
            [
                4980,
                5128
            ],
            [
                5128,
                5213
            ],
            [
                5213,
                5336
            ],
            [
                5336,
                5391
            ],
            [
                5391,
                5435
            ],
            [
                5435,
                5525
            ],
            [
                5525,
                5654
            ],
            [
                5654,
                5692
            ],
            [
                5692,
                5733
            ],
            [
                5733,
                5797
            ],
            [
                5797,
                5811
            ],
            [
                5811,
                5842
            ],
            [
                5842,
                5915
            ],
            [
                5915,
                5954
            ],
            [
                5954,
                5963
            ],
            [
                5963,
                6084
            ],
            [
                6084,
                6102
            ],
            [
                6102,
                6272
            ],
            [
                6272,
                6347
            ],
            [
                6347,
                6371
            ],
            [
                6371,
                6427
            ],
            [
                6427,
                6446
            ],
            [
                6446,
                6464
            ],
            [
                6464,
                6471
            ],
            [
                6471,
                6516
            ],
            [
                6516,
                6534
            ],
            [
                6534,
                6593
            ],
            [
                6593,
                6609
            ],
            [
                6609,
                6680
            ],
            [
                6680,
                6972
            ],
            [
                6972,
                7000
            ],
            [
                7000,
                7151
            ],
            [
                7151,
                7193
            ],
            [
                7193,
                7199
            ],
            [
                7199,
                7219
            ],
            [
                7219,
                7374
            ],
            [
                7374,
                7446
            ],
            [
                7446,
                7550
            ],
            [
                7550,
                7609
            ],
            [
                7609,
                7657
            ],
            [
                7657,
                7723
            ],
            [
                7723,
                7731
            ],
            [
                7731,
                7789
            ],
            [
                7789,
                7822
            ],
            [
                7822,
                7878
            ],
            [
                7878,
                7883
            ],
            [
                7883,
                7902
            ],
            [
                7902,
                7973
            ],
            [
                7973,
                7997
            ],
            [
                7997,
                8026
            ],
            [
                8026,
                8108
            ],
            [
                8108,
                8254
            ],
            [
                8254,
                8361
            ],
            [
                8361,
                8486
            ],
            [
                8486,
                8710
            ],
            [
                8710,
                8733
            ],
            [
                8733,
                8859
            ],
            [
                8859,
                8934
            ],
            [
                8934,
                9003
            ],
            [
                9003,
                9168
            ],
            [
                9168,
                9339
            ],
            [
                9339,
                9452
            ],
            [
                9452,
                9490
            ],
            [
                9490,
                9558
            ],
            [
                9558,
                9704
            ],
            [
                9704,
                9814
            ],
            [
                9814,
                9829
            ],
            [
                9829,
                10008
            ],
            [
                10008,
                10052
            ],
            [
                10052,
                10090
            ],
            [
                10090,
                10317
            ],
            [
                10317,
                10366
            ],
            [
                10366,
                10565
            ],
            [
                10565,
                10698
            ],
            [
                10698,
                10721
            ],
            [
                10721,
                10897
            ],
            [
                10897,
                10949
            ],
            [
                10949,
                11041
            ],
            [
                11041,
                11071
            ],
            [
                11071,
                11113
            ],
            [
                11113,
                11210
            ],
            [
                11210,
                11241
            ],
            [
                11241,
                11298
            ],
            [
                11298,
                11339
            ],
            [
                11339,
                11436
            ],
            [
                11436,
                11627
            ],
            [
                11627,
                11755
            ],
            [
                11755,
                11776
            ],
            [
                11776,
                11834
            ],
            [
                11834,
                11896
            ],
            [
                11896,
                12001
            ],
            [
                12001,
                12080
            ],
            [
                12080,
                12087
            ],
            [
                12087,
                12121
            ],
            [
                12121,
                12145
            ],
            [
                12145,
                12177
            ],
            [
                12177,
                12191
            ],
            [
                12191,
                12272
            ],
            [
                12272,
                12310
            ],
            [
                12310,
                12431
            ],
            [
                12431,
                12532
            ],
            [
                12532,
                12619
            ],
            [
                12619,
                12666
            ],
            [
                12666,
                12704
            ],
            [
                12704,
                12722
            ],
            [
                12722,
                12811
            ],
            [
                12811,
                12828
            ],
            [
                12828,
                12942
            ],
            [
                12942,
                12972
            ],
            [
                12972,
                13043
            ],
            [
                13043,
                13107
            ],
            [
                13107,
                13157
            ],
            [
                13157,
                13322
            ],
            [
                13322,
                13421
            ],
            [
                13421,
                13460
            ],
            [
                13460,
                13509
            ],
            [
                13509,
                13549
            ],
            [
                13549,
                13843
            ],
            [
                13843,
                13884
            ],
            [
                13884,
                13907
            ],
            [
                13907,
                13955
            ],
            [
                13955,
                14089
            ],
            [
                14089,
                14125
            ],
            [
                14125,
                14184
            ],
            [
                14184,
                14226
            ],
            [
                14226,
                14269
            ],
            [
                14269,
                14307
            ],
            [
                14307,
                14381
            ],
            [
                14381,
                14495
            ],
            [
                14495,
                14545
            ],
            [
                14545,
                14628
            ],
            [
                14628,
                14717
            ],
            [
                14717,
                14752
            ],
            [
                14752,
                14834
            ],
            [
                14834,
                14918
            ],
            [
                14918,
                14997
            ],
            [
                14997,
                15029
            ],
            [
                15029,
                15095
            ],
            [
                15095,
                15137
            ],
            [
                15137,
                15200
            ],
            [
                15200,
                15248
            ],
            [
                15248,
                15279
            ],
            [
                15279,
                15354
            ],
            [
                15354,
                15419
            ],
            [
                15419,
                15559
            ],
            [
                15559,
                15640
            ],
            [
                15640,
                15821
            ],
            [
                15821,
                15883
            ],
            [
                15883,
                15922
            ],
            [
                15922,
                16082
            ],
            [
                16082,
                16113
            ],
            [
                16113,
                16148
            ],
            [
                16148,
                16173
            ],
            [
                16173,
                16193
            ],
            [
                16193,
                16246
            ],
            [
                16246,
                16289
            ],
            [
                16289,
                16305
            ],
            [
                16305,
                16320
            ],
            [
                16320,
                16470
            ],
            [
                16470,
                16594
            ],
            [
                16594,
                16625
            ],
            [
                16625,
                16632
            ],
            [
                16632,
                16650
            ],
            [
                16650,
                16660
            ],
            [
                16660,
                16681
            ],
            [
                16681,
                16771
            ],
            [
                16771,
                16834
            ],
            [
                16834,
                16920
            ],
            [
                16920,
                16978
            ],
            [
                16978,
                17034
            ],
            [
                17034,
                17083
            ],
            [
                17083,
                17247
            ],
            [
                17247,
                17259
            ],
            [
                17259,
                17278
            ],
            [
                17278,
                17331
            ],
            [
                17331,
                17353
            ],
            [
                17353,
                17391
            ],
            [
                17391,
                17424
            ],
            [
                17424,
                17439
            ],
            [
                17439,
                17446
            ],
            [
                17446,
                17492
            ],
            [
                17492,
                17603
            ],
            [
                17603,
                17659
            ],
            [
                17659,
                17725
            ],
            [
                17725,
                17788
            ],
            [
                17788,
                17801
            ],
            [
                17801,
                17824
            ],
            [
                17824,
                17860
            ],
            [
                17860,
                17997
            ],
            [
                17997,
                18047
            ],
            [
                18047,
                18091
            ],
            [
                18091,
                18159
            ],
            [
                18159,
                18195
            ],
            [
                18195,
                18215
            ],
            [
                18215,
                18301
            ],
            [
                18301,
                18377
            ],
            [
                18377,
                18468
            ],
            [
                18468,
                18497
            ],
            [
                18497,
                18566
            ],
            [
                18566,
                18636
            ],
            [
                18636,
                18882
            ],
            [
                18882,
                18968
            ],
            [
                18968,
                19023
            ],
            [
                19023,
                19053
            ],
            [
                19053,
                19097
            ],
            [
                19097,
                19142
            ],
            [
                19142,
                19203
            ],
            [
                19203,
                19338
            ],
            [
                19338,
                19398
            ],
            [
                19398,
                19403
            ],
            [
                19403,
                19564
            ],
            [
                19564,
                19571
            ],
            [
                19571,
                19609
            ],
            [
                19609,
                19710
            ],
            [
                19710,
                19755
            ],
            [
                19755,
                19783
            ],
            [
                19783,
                19847
            ],
            [
                19847,
                19943
            ],
            [
                19943,
                20008
            ],
            [
                20008,
                20084
            ],
            [
                20084,
                20118
            ],
            [
                20118,
                20140
            ],
            [
                20140,
                20238
            ],
            [
                20238,
                20319
            ],
            [
                20319,
                20367
            ],
            [
                20367,
                20371
            ],
            [
                20371,
                20461
            ],
            [
                20461,
                20485
            ],
            [
                20485,
                20568
            ],
            [
                20568,
                20609
            ],
            [
                20609,
                20622
            ],
            [
                20622,
                20646
            ],
            [
                20646,
                20668
            ],
            [
                20668,
                20682
            ],
            [
                20682,
                20809
            ],
            [
                20809,
                20846
            ],
            [
                20846,
                20898
            ],
            [
                20898,
                20948
            ],
            [
                20948,
                21013
            ],
            [
                21013,
                21031
            ],
            [
                21031,
                21124
            ],
            [
                21124,
                21161
            ],
            [
                21161,
                21371
            ],
            [
                21371,
                21405
            ],
            [
                21405,
                21466
            ],
            [
                21466,
                21519
            ],
            [
                21519,
                21537
            ],
            [
                21537,
                21554
            ],
            [
                21554,
                21665
            ]
        ],
        "overlap_chars": [
            [
                0,
                80
            ],
            [
                83,
                89
            ],
            [
                90,
                94
            ],
            [
                95,
                98
            ],
            [
                103,
                107
            ],
            [
                108,
                114
            ],
            [
                115,
                127
            ],
            [
                130,
                138
            ],
            [
                143,
                152
            ],
            [
                164,
                197
            ],
            [
                197,
                274
            ],
            [
                279,
                288
            ],
            [
                291,
                326
            ],
            [
                326,
                328
            ],
            [
                328,
                347
            ],
            [
                348,
                357
            ],
            [
                357,
                358
            ],
            [
                359,
                370
            ],
            [
                371,
                415
            ],
            [
                417,
                484
            ],
            [
                491,
                493
            ],
            [
                493,
                526
            ],
            [
                527,
                540
            ],
            [
                541,
                560
            ],
            [
                565,
                573
            ],
            [
                573,
                593
            ],
            [
                598,
                657
            ],
            [
                663,
                668
            ],
            [
                673,
                728
            ],
            [
                729,
                770
            ],
            [
                771,
                791
            ],
            [
                791,
                889
            ],
            [
                889,
                904
            ],
            [
                910,
                925
            ],
            [
                926,
                1001
            ],
            [
                1001,
                1033
            ],
            [
                1036,
                1170
            ],
            [
                1180,
                1213
            ],
            [
                1229,
                1258
            ],
            [
                1258,
                1261
            ],
            [
                1262,
                1271
            ],
            [
                1272,
                1275
            ],
            [
                1276,
                1281
            ],
            [
                1285,
                1314
            ],
            [
                1317,
                1335
            ],
            [
                1336,
                1348
            ],
            [
                1351,
                1408
            ],
            [
                1409,
                1461
            ],
            [
                1461,
                1499
            ],
            [
                1501,
                1564
            ],
            [
                1564,
                1566
            ],
            [
                1566,
                1575
            ],
            [
                1576,
                1764
            ],
            [
                1764,
                1792
            ],
            [
                1793,
                1796
            ],
            [
                1797,
                1800
            ],
            [
                1801,
                1866
            ],
            [
                1866,
                1928
            ],
            [
                1929,
                1931
            ],
            [
                1932,
                1940
            ],
            [
                1941,
                1954
            ],
            [
                1956,
                2003
            ],
            [
                2004,
                2015
            ],
            [
                2015,
                2025
            ],
            [
                2026,
                2044
            ],
            [
                2045,
                2059
            ],
            [
                2059,
                2060
            ],
            [
                2065,
                2113
            ],
            [
                2113,
                2115
            ],
            [
                2115,
                2117
            ],
            [
                2121,
                2128
            ],
            [
                2133,
                2139
            ],
            [
                2139,
                2144
            ],
            [
                2148,
                2151
            ],
            [
                2152,
                2153
            ],
            [
                2163,
                2165
            ],
            [
                2165,
                2205
            ],
            [
                2215,
                2227
            ],
            [
                2235,
                2321
            ],
            [
                2327,
                2329
            ],
            [
                2337,
                2346
            ],
            [
                2360,
                2364
            ],
            [
                2365,
                2367
            ],
            [
                2368,
                2386
            ],
            [
                2387,
                2418
            ],
            [
                2418,
                2504
            ],
            [
                2507,
                2528
            ],
            [
                2528,
                2530
            ],
            [
                2531,
                2567
            ],
            [
                2567,
                2655
            ],
            [
                2656,
                2660
            ],
            [
                2669,
                2675
            ],
            [
                2675,
                2706
            ],
            [
                2720,
                2738
            ],
            [
                2738,
                2815
            ],
            [
                2815,
                2874
            ],
            [
                2883,
                2910
            ],
            [
                2910,
                2931
            ],
            [
                2935,
                3036
            ],
            [
                3040,
                3054
            ],
            [
                3057,
                3147
            ],
            [
                3147,
                3148
            ],
            [
                3148,
                3193
            ],
            [
                3196,
                3213
            ],
            [
                3217,
                3225
            ],
            [
                3230,
                3232
            ],
            [
                3233,
                3285
            ],
            [
                3288,
                3316
            ],
            [
                3317,
                3338
            ],
            [
                3345,
                3391
            ],
            [
                3395,
                3438
            ],
            [
                3442,
                3457
            ],
            [
                3461,
                3532
            ],
            [
                3532,
                3552
            ],
            [
                3553,
                3554
            ],
            [
                3555,
                3559
            ],
            [
                3560,
                3568
            ],
            [
                3569,
                3576
            ],
            [
                3576,
                3631
            ],
            [
                3632,
                3635
            ],
            [
                3636,
                3667
            ],
            [
                3668,
                3677
            ],
            [
                3682,
                3690
            ],
            [
                3698,
                3704
            ],
            [
                3704,
                3713
            ],
            [
                3717,
                3765
            ],
            [
                3774,
                3798
            ],
            [
                3802,
                3814
            ],
            [
                3818,
                3832
            ],
            [
                3836,
                3860
            ],
            [
                3861,
                3878
            ],
            [
                3882,
                3905
            ],
            [
                3908,
                3919
            ],
            [
                3920,
                3940
            ],
            [
                3943,
                3960
            ],
            [
                3960,
                3976
            ],
            [
                3978,
                4015
            ],
            [
                4025,
                4032
            ],
            [
                4036,
                4051
            ],
            [
                4052,
                4060
            ],
            [
                4061,
                4086
            ],
            [
                4087,
                4098
            ],
            [
                4099,
                4142
            ],
            [
                4142,
                4151
            ],
            [
                4152,
                4168
            ],
            [
                4172,
                4214
            ],
            [
                4214,
                4255
            ],
            [
                4259,
                4286
            ],
            [
                4294,
                4318
            ],
            [
                4319,
                4331
            ],
            [
                4346,
                4377
            ],
            [
                4377,
                4382
            ],
            [
                4392,
                4401
            ],
            [
                4402,
                4466
            ],
            [
                4467,
                4472
            ],
            [
                4472,
                4529
            ],
            [
                4533,
                4583
            ],
            [
                4586,
                4620
            ],
            [
                4630,
                4692
            ],
            [
                4693,
                4762
            ],
            [
                4763,
                4778
            ],
            [
                4779,
                4797
            ],
            [
                4797,
                4817
            ],
            [
                4828,
                4886
            ],
            [
                4886,
                4977
            ],
            [
                4981,
                5065
            ],
            [
                5071,
                5083
            ],
            [
                5084,
                5102
            ],
            [
                5110,
                5128
            ],
            [
                5128,
                5213
            ],
            [
                5213,
                5271
            ],
            [
                5278,
                5336
            ],
            [
                5336,
                5388
            ],
            [
                5392,
                5435
            ],
            [
                5435,
                5525
            ],
            [
                5525,
                5591
            ],
            [
                5594,
                5654
            ],
            [
                5654,
                5692
            ],
            [
                5692,
                5730
            ],
            [
                5733,
                5781
            ],
            [
                5787,
                5797
            ],
            [
                5798,
                5811
            ],
            [
                5811,
                5839
            ],
            [
                5842,
                5871
            ],
            [
                5872,
                5877
            ],
            [
                5882,
                5915
            ],
            [
                5915,
                5946
            ],
            [
                5952,
                5954
            ],
            [
                5961,
                5963
            ],
            [
                5963,
                5978
            ],
            [
                5978,
                6022
            ],
            [
                6023,
                6084
            ],
            [
                6084,
                6102
            ],
            [
                6102,
                6153
            ],
            [
                6161,
                6172
            ],
            [
                6173,
                6176
            ],
            [
                6177,
                6272
            ],
            [
                6272,
                6303
            ],
            [
                6311,
                6344
            ],
            [
                6348,
                6368
            ],
            [
                6371,
                6407
            ],
            [
                6409,
                6427
            ],
            [
                6427,
                6443
            ],
            [
                6446,
                6462
            ],
            [
                6462,
                6464
            ],
            [
                6465,
                6471
            ],
            [
                6471,
                6488
            ],
            [
                6492,
                6516
            ],
            [
                6516,
                6519
            ],
            [
                6532,
                6534
            ],
            [
                6534,
                6590
            ],
            [
                6594,
                6609
            ],
            [
                6609,
                6632
            ],
            [
                6635,
                6637
            ],
            [
                6638,
                6644
            ],
            [
                6645,
                6648
            ],
            [
                6656,
                6665
            ],
            [
                6666,
                6680
            ],
            [
                6680,
                6704
            ],
            [
                6710,
                6730
            ],
            [
                6730,
                6740
            ],
            [
                6742,
                6775
            ],
            [
                6782,
                6811
            ],
            [
                6812,
                6837
            ],
            [
                6838,
                6883
            ],
            [
                6884,
                6972
            ],
            [
                6972,
                6988
            ],
            [
                6989,
                6998
            ],
            [
                6998,
                7000
            ],
            [
                7000,
                7021
            ],
            [
                7029,
                7061
            ],
            [
                7071,
                7083
            ],
            [
                7084,
                7151
            ],
            [
                7151,
                7190
            ],
            [
                7194,
                7196
            ],
            [
                7199,
                7219
            ],
            [
                7220,
                7292
            ],
            [
                7293,
                7328
            ],
            [
                7335,
                7372
            ],
            [
                7372,
                7374
            ],
            [
                7374,
                7444
            ],
            [
                7446,
                7550
            ],
            [
                7550,
                7606
            ],
            [
                7614,
                7632
            ],
            [
                7635,
                7657
            ],
            [
                7662,
                7720
            ],
            [
                7724,
                7728
            ],
            [
                7731,
                7754
            ],
            [
                7756,
                7789
            ],
            [
                7789,
                7819
            ],
            [
                7822,
                7827
            ],
            [
                7833,
                7849
            ],
            [
                7850,
                7862
            ],
            [
                7862,
                7863
            ],
            [
                7864,
                7866
            ],
            [
                7867,
                7876
            ],
            [
                7876,
                7877
            ],
            [
                7879,
                7882
            ],
            [
                7883,
                7900
            ],
            [
                7902,
                7955
            ],
            [
                7956,
                7966
            ],
            [
                7971,
                7973
            ],
            [
                7973,
                7997
            ],
            [
                7997,
                8026
            ],
            [
                8026,
                8030
            ],
            [
                8031,
                8105
            ],
            [
                8108,
                8202
            ],
            [
                8206,
                8214
            ],
            [
                8214,
                8224
            ],
            [
                8232,
                8240
            ],
            [
                8241,
                8254
            ],
            [
                8254,
                8295
            ],
            [
                8297,
                8314
            ],
            [
                8316,
                8339
            ],
            [
                8355,
                8361
            ],
            [
                8361,
                8420
            ],
            [
                8433,
                8442
            ],
            [
                8448,
                8460
            ],
            [
                8468,
                8486
            ],
            [
                8486,
                8513
            ],
            [
                8514,
                8524
            ],
            [
                8527,
                8533
            ],
            [
                8533,
                8558
            ],
            [
                8559,
                8596
            ],
            [
                8597,
                8686
            ],
            [
                8687,
                8696
            ],
            [
                8697,
                8699
            ],
            [
                8700,
                8710
            ],
            [
                8711,
                8730
            ],
            [
                8733,
                8848
            ],
            [
                8849,
                8857
            ],
            [
                8857,
                8859
            ],
            [
                8859,
                8903
            ],
            [
                8910,
                8934
            ],
            [
                8934,
                8955
            ],
            [
                8956,
                9003
            ],
            [
                9003,
                9033
            ],
            [
                9034,
                9126
            ],
            [
                9138,
                9168
            ],
            [
                9168,
                9250
            ],
            [
                9251,
                9339
            ],
            [
                9339,
                9361
            ],
            [
                9367,
                9380
            ],
            [
                9385,
                9450
            ],
            [
                9450,
                9451
            ],
            [
                9452,
                9490
            ],
            [
                9490,
                9499
            ],
            [
                9500,
                9558
            ],
            [
                9558,
                9572
            ],
            [
                9579,
                9582
            ],
            [
                9589,
                9596
            ],
            [
                9613,
                9621
            ],
            [
                9660,
                9663
            ],
            [
                9685,
                9687
            ],
            [
                9702,
                9704
            ],
            [
                9704,
                9707
            ],
            [
                9718,
                9722
            ],
            [
                9723,
                9767
            ],
            [
                9768,
                9777
            ],
            [
                9784,
                9813
            ],
            [
                9814,
                9829
            ],
            [
                9832,
                9835
            ],
            [
                9841,
                10002
            ],
            [
                10003,
                10006
            ],
            [
                10006,
                10008
            ],
            [
                10008,
                10021
            ],
            [
                10022,
                10052
            ],
            [
                10058,
                10090
            ],
            [
                10090,
                10122
            ],
            [
                10123,
                10199
            ],
            [
                10200,
                10261
            ],
            [
                10261,
                10262
            ],
            [
                10263,
                10314
            ],
            [
                10317,
                10331
            ],
            [
                10332,
                10340
            ],
            [
                10340,
                10364
            ],
            [
                10364,
                10366
            ],
            [
                10366,
                10377
            ],
            [
                10392,
                10449
            ],
            [
                10452,
                10557
            ],
            [
                10558,
                10563
            ],
            [
                10565,
                10608
            ],
            [
                10609,
                10631
            ],
            [
                10631,
                10668
            ],
            [
                10676,
                10698
            ],
            [
                10698,
                10721
            ],
            [
                10722,
                10824
            ],
            [
                10825,
                10827
            ],
            [
                10828,
                10848
            ],
            [
                10857,
                10897
            ],
            [
                10897,
                10949
            ],
            [
                10949,
                11038
            ],
            [
                11041,
                11071
            ],
            [
                11071,
                11090
            ],
            [
                11093,
                11101
            ],
            [
                11102,
                11113
            ],
            [
                11113,
                11161
            ],
            [
                11161,
                11176
            ],
            [
                11179,
                11199
            ],
            [
                11206,
                11208
            ],
            [
                11208,
                11210
            ],
            [
                11210,
                11213
            ],
            [
                11214,
                11241
            ],
            [
                11241,
                11271
            ],
            [
                11274,
                11298
            ],
            [
                11298,
                11322
            ],
            [
                11325,
                11338
            ],
            [
                11339,
                11436
            ],
            [
                11437,
                11462
            ],
            [
                11463,
                11564
            ],
            [
                11565,
                11570
            ],
            [
                11577,
                11586
            ],
            [
                11587,
                11624
            ],
            [
                11628,
                11648
            ],
            [
                11651,
                11664
            ],
            [
                11665,
                11669
            ],
            [
                11674,
                11675
            ],
            [
                11677,
                11698
            ],
            [
                11699,
                11752
            ],
            [
                11756,
                11773
            ],
            [
                11777,
                11787
            ],
            [
                11790,
                11818
            ],
            [
                11820,
                11834
            ],
            [
                11834,
                11888
            ],
            [
                11891,
                11893
            ],
            [
                11896,
                11957
            ],
            [
                11961,
                11998
            ],
            [
                12002,
                12015
            ],
            [
                12018,
                12069
            ],
            [
                12078,
                12080
            ],
            [
                12085,
                12087
            ],
            [
                12087,
                12121
            ],
            [
                12121,
                12145
            ],
            [
                12145,
                12177
            ],
            [
                12177,
                12191
            ],
            [
                12191,
                12210
            ],
            [
                12215,
                12272
            ],
            [
                12275,
                12285
            ],
            [
                12286,
                12297
            ],
            [
                12299,
                12310
            ],
            [
                12310,
                12356
            ],
            [
                12369,
                12383
            ],
            [
                12387,
                12428
            ],
            [
                12431,
                12437
            ],
            [
                12438,
                12442
            ],
            [
                12443,
                12444
            ],
            [
                12449,
                12466
            ],
            [
                12467,
                12491
            ],
            [
                12494,
                12505
            ],
            [
                12506,
                12532
            ],
            [
                12532,
                12616
            ],
            [
                12619,
                12664
            ],
            [
                12664,
                12666
            ],
            [
                12666,
                12704
            ],
            [
                12705,
                12722
            ],
            [
                12722,
                12785
            ],
            [
                12793,
                12796
            ],
            [
                12797,
                12808
            ],
            [
                12811,
                12828
            ],
            [
                12828,
                12932
            ],
            [
                12940,
                12942
            ],
            [
                12942,
                12972
            ],
            [
                12973,
                13040
            ],
            [
                13044,
                13073
            ],
            [
                13076,
                13107
            ],
            [
                13108,
                13155
            ],
            [
                13155,
                13157
            ],
            [
                13159,
                13204
            ],
            [
                13209,
                13270
            ],
            [
                13274,
                13319
            ],
            [
                13329,
                13332
            ],
            [
                13335,
                13374
            ],
            [
                13376,
                13421
            ],
            [
                13421,
                13460
            ],
            [
                13460,
                13461
            ],
            [
                13466,
                13469
            ],
            [
                13478,
                13507
            ],
            [
                13507,
                13509
            ],
            [
                13509,
                13549
            ],
            [
                13549,
                13582
            ],
            [
                13583,
                13758
            ],
            [
                13761,
                13807
            ],
            [
                13815,
                13840
            ],
            [
                13843,
                13882
            ],
            [
                13884,
                13897
            ],
            [
                13905,
                13907
            ],
            [
                13908,
                13955
            ],
            [
                13955,
                14049
            ],
            [
                14050,
                14086
            ],
            [
                14090,
                14122
            ],
            [
                14125,
                14182
            ],
            [
                14182,
                14184
            ],
            [
                14185,
                14226
            ],
            [
                14226,
                14267
            ],
            [
                14267,
                14269
            ],
            [
                14269,
                14304
            ],
            [
                14307,
                14381
            ],
            [
                14381,
                14398
            ],
            [
                14399,
                14405
            ],
            [
                14406,
                14441
            ],
            [
                14451,
                14495
            ],
            [
                14495,
                14545
            ],
            [
                14545,
                14577
            ],
            [
                14579,
                14602
            ],
            [
                14609,
                14617
            ],
            [
                14618,
                14628
            ],
            [
                14628,
                14646
            ],
            [
                14647,
                14650
            ],
            [
                14651,
                14699
            ],
            [
                14700,
                14717
            ],
            [
                14717,
                14751
            ],
            [
                14756,
                14766
            ],
            [
                14769,
                14790
            ],
            [
                14793,
                14834
            ],
            [
                14834,
                14916
            ],
            [
                14916,
                14918
            ],
            [
                14918,
                14995
            ],
            [
                14995,
                14997
            ],
            [
                14997,
                15018
            ],
            [
                15019,
                15029
            ],
            [
                15029,
                15095
            ],
            [
                15095,
                15135
            ],
            [
                15135,
                15137
            ],
            [
                15137,
                15200
            ],
            [
                15200,
                15206
            ],
            [
                15211,
                15248
            ],
            [
                15248,
                15264
            ],
            [
                15264,
                15276
            ],
            [
                15279,
                15354
            ],
            [
                15354,
                15381
            ],
            [
                15382,
                15419
            ],
            [
                15419,
                15514
            ],
            [
                15515,
                15517
            ],
            [
                15518,
                15524
            ],
            [
                15525,
                15544
            ],
            [
                15551,
                15557
            ],
            [
                15557,
                15559
            ],
            [
                15559,
                15604
            ],
            [
                15608,
                15640
            ],
            [
                15640,
                15657
            ],
            [
                15658,
                15725
            ],
            [
                15730,
                15801
            ],
            [
                15801,
                15806
            ],
            [
                15810,
                15821
            ],
            [
                15821,
                15883
            ],
            [
                15883,
                15920
            ],
            [
                15920,
                15922
            ],
            [
                15922,
                15970
            ],
            [
                15971,
                15976
            ],
            [
                15977,
                15980
            ],
            [
                15981,
                15991
            ],
            [
                15991,
                16021
            ],
            [
                16022,
                16082
            ],
            [
                16082,
                16089
            ],
            [
                16090,
                16102
            ],
            [
                16103,
                16107
            ],
            [
                16108,
                16111
            ],
            [
                16111,
                16113
            ],
            [
                16114,
                16145
            ],
            [
                16149,
                16173
            ],
            [
                16173,
                16176
            ],
            [
                16177,
                16190
            ],
            [
                16194,
                16243
            ],
            [
                16246,
                16289
            ],
            [
                16289,
                16305
            ],
            [
                16305,
                16320
            ],
            [
                16320,
                16346
            ],
            [
                16347,
                16376
            ],
            [
                16378,
                16389
            ],
            [
                16392,
                16421
            ],
            [
                16421,
                16470
            ],
            [
                16470,
                16493
            ],
            [
                16494,
                16516
            ],
            [
                16517,
                16519
            ],
            [
                16520,
                16548
            ],
            [
                16549,
                16557
            ],
            [
                16558,
                16564
            ],
            [
                16565,
                16573
            ],
            [
                16574,
                16579
            ],
            [
                16581,
                16591
            ],
            [
                16594,
                16625
            ],
            [
                16626,
                16632
            ],
            [
                16632,
                16647
            ],
            [
                16651,
                16658
            ],
            [
                16660,
                16677
            ],
            [
                16682,
                16768
            ],
            [
                16771,
                16808
            ],
            [
                16814,
                16834
            ],
            [
                16835,
                16917
            ],
            [
                16921,
                16933
            ],
            [
                16936,
                16976
            ],
            [
                16976,
                16978
            ],
            [
                16978,
                17034
            ],
            [
                17035,
                17045
            ],
            [
                17048,
                17056
            ],
            [
                17070,
                17083
            ],
            [
                17084,
                17106
            ],
            [
                17109,
                17111
            ],
            [
                17112,
                17119
            ],
            [
                17119,
                17120
            ],
            [
                17122,
                17216
            ],
            [
                17218,
                17244
            ],
            [
                17248,
                17259
            ],
            [
                17259,
                17275
            ],
            [
                17281,
                17285
            ],
            [
                17285,
                17329
            ],
            [
                17329,
                17331
            ],
            [
                17335,
                17350
            ],
            [
                17354,
                17365
            ],
            [
                17368,
                17391
            ],
            [
                17392,
                17421
            ],
            [
                17425,
                17436
            ],
            [
                17440,
                17446
            ],
            [
                17446,
                17455
            ],
            [
                17461,
                17489
            ],
            [
                17493,
                17512
            ],
            [
                17512,
                17586
            ],
            [
                17589,
                17603
            ],
            [
                17603,
                17657
            ],
            [
                17657,
                17659
            ],
            [
                17659,
                17671
            ],
            [
                17672,
                17676
            ],
            [
                17677,
                17679
            ],
            [
                17680,
                17688
            ],
            [
                17694,
                17703
            ],
            [
                17704,
                17725
            ],
            [
                17725,
                17759
            ],
            [
                17761,
                17785
            ],
            [
                17788,
                17789
            ],
            [
                17789,
                17798
            ],
            [
                17802,
                17824
            ],
            [
                17824,
                17857
            ],
            [
                17860,
                17861
            ],
            [
                17861,
                17900
            ],
            [
                17902,
                17953
            ],
            [
                17954,
                17955
            ],
            [
                17955,
                17958
            ],
            [
                17960,
                17962
            ],
            [
                17964,
                17966
            ],
            [
                17969,
                17973
            ],
            [
                17974,
                17997
            ],
            [
                17997,
                18047
            ],
            [
                18047,
                18088
            ],
            [
                18092,
                18159
            ],
            [
                18159,
                18192
            ],
            [
                18196,
                18215
            ],
            [
                18215,
                18298
            ],
            [
                18302,
                18377
            ],
            [
                18377,
                18392
            ],
            [
                18393,
                18454
            ],
            [
                18455,
                18466
            ],
            [
                18468,
                18497
            ],
            [
                18497,
                18523
            ],
            [
                18523,
                18563
            ],
            [
                18566,
                18585
            ],
            [
                18587,
                18591
            ],
            [
                18592,
                18594
            ],
            [
                18606,
                18613
            ],
            [
                18613,
                18618
            ],
            [
                18634,
                18636
            ],
            [
                18637,
                18704
            ],
            [
                18705,
                18882
            ],
            [
                18882,
                18922
            ],
            [
                18922,
                18965
            ],
            [
                18969,
                19023
            ],
            [
                19023,
                19053
            ],
            [
                19053,
                19094
            ],
            [
                19098,
                19142
            ],
            [
                19142,
                19152
            ],
            [
                19168,
                19174
            ],
            [
                19174,
                19201
            ],
            [
                19201,
                19203
            ],
            [
                19207,
                19249
            ],
            [
                19262,
                19335
            ],
            [
                19342,
                19354
            ],
            [
                19360,
                19365
            ],
            [
                19366,
                19395
            ],
            [
                19399,
                19403
            ],
            [
                19403,
                19561
            ],
            [
                19565,
                19571
            ],
            [
                19571,
                19606
            ],
            [
                19609,
                19610
            ],
            [
                19610,
                19627
            ],
            [
                19630,
                19643
            ],
            [
                19645,
                19648
            ],
            [
                19652,
                19705
            ],
            [
                19708,
                19710
            ],
            [
                19710,
                19752
            ],
            [
                19756,
                19783
            ],
            [
                19783,
                19786
            ],
            [
                19788,
                19816
            ],
            [
                19817,
                19844
            ],
            [
                19847,
                19848
            ],
            [
                19848,
                19878
            ],
            [
                19879,
                19943
            ],
            [
                19943,
                20006
            ],
            [
                20006,
                20008
            ],
            [
                20008,
                20081
            ],
            [
                20088,
                20118
            ],
            [
                20118,
                20140
            ],
            [
                20140,
                20191
            ],
            [
                20194,
                20238
            ],
            [
                20238,
                20317
            ],
            [
                20317,
                20319
            ],
            [
                20319,
                20367
            ],
            [
                20367,
                20371
            ],
            [
                20371,
                20373
            ],
            [
                20374,
                20378
            ],
            [
                20387,
                20461
            ],
            [
                20461,
                20485
            ],
            [
                20492,
                20535
            ],
            [
                20535,
                20536
            ],
            [
                20537,
                20568
            ],
            [
                20568,
                20609
            ],
            [
                20609,
                20622
            ],
            [
                20622,
                20646
            ],
            [
                20646,
                20665
            ],
            [
                20669,
                20682
            ],
            [
                20682,
                20705
            ],
            [
                20708,
                20782
            ],
            [
                20788,
                20809
            ],
            [
                20809,
                20846
            ],
            [
                20846,
                20895
            ],
            [
                20904,
                20946
            ],
            [
                20946,
                20948
            ],
            [
                20948,
                21013
            ],
            [
                21013,
                21028
            ],
            [
                21031,
                21032
            ],
            [
                21032,
                21047
            ],
            [
                21048,
                21051
            ],
            [
                21052,
                21055
            ],
            [
                21061,
                21083
            ],
            [
                21084,
                21087
            ],
            [
                21093,
                21121
            ],
            [
                21124,
                21150
            ],
            [
                21154,
                21161
            ],
            [
                21161,
                21200
            ],
            [
                21206,
                21270
            ],
            [
                21272,
                21328
            ],
            [
                21329,
                21371
            ],
            [
                21371,
                21403
            ],
            [
                21406,
                21463
            ],
            [
                21467,
                21516
            ],
            [
                21520,
                21533
            ],
            [
                21538,
                21551
            ],
            [
                21555,
                21565
            ],
            [
                21568,
                21589
            ],
            [
                21591,
                21644
            ],
            [
                21645,
                21655
            ],
            [
                21656,
                21663
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                197
            ],
            [
                197,
                328
            ],
            [
                328,
                359
            ],
            [
                359,
                493
            ],
            [
                493,
                671
            ],
            [
                671,
                771
            ],
            [
                771,
                791
            ],
            [
                791,
                889
            ],
            [
                889,
                1001
            ],
            [
                1001,
                1258
            ],
            [
                1258,
                1409
            ],
            [
                1409,
                1461
            ],
            [
                1461,
                1566
            ],
            [
                1566,
                1764
            ],
            [
                1764,
                1764
            ],
            [
                1764,
                1866
            ],
            [
                1866,
                2115
            ],
            [
                2115,
                2165
            ],
            [
                2165,
                2386
            ],
            [
                2386,
                2418
            ],
            [
                2418,
                2507
            ],
            [
                2507,
                2530
            ],
            [
                2530,
                2567
            ],
            [
                2567,
                2663
            ],
            [
                2663,
                2675
            ],
            [
                2675,
                2715
            ],
            [
                2715,
                2738
            ],
            [
                2738,
                2815
            ],
            [
                2815,
                2877
            ],
            [
                2877,
                2910
            ],
            [
                2910,
                2934
            ],
            [
                2934,
                3039
            ],
            [
                3039,
                3147
            ],
            [
                3147,
                3216
            ],
            [
                3216,
                3228
            ],
            [
                3228,
                3394
            ],
            [
                3394,
                3441
            ],
            [
                3441,
                3460
            ],
            [
                3460,
                3532
            ],
            [
                3532,
                3693
            ],
            [
                3693,
                3704
            ],
            [
                3704,
                3716
            ],
            [
                3716,
                3768
            ],
            [
                3768,
                3801
            ],
            [
                3801,
                3817
            ],
            [
                3817,
                3835
            ],
            [
                3835,
                3881
            ],
            [
                3881,
                3908
            ],
            [
                3908,
                3919
            ],
            [
                3919,
                3943
            ],
            [
                3943,
                3960
            ],
            [
                3960,
                4035
            ],
            [
                4035,
                4035
            ],
            [
                4035,
                4171
            ],
            [
                4171,
                4214
            ],
            [
                4214,
                4258
            ],
            [
                4258,
                4318
            ],
            [
                4318,
                4377
            ],
            [
                4377,
                4472
            ],
            [
                4472,
                4532
            ],
            [
                4532,
                4692
            ],
            [
                4692,
                4797
            ],
            [
                4797,
                4886
            ],
            [
                4886,
                4980
            ],
            [
                4980,
                5128
            ],
            [
                5128,
                5213
            ],
            [
                5213,
                5336
            ],
            [
                5336,
                5391
            ],
            [
                5391,
                5391
            ],
            [
                5391,
                5391
            ],
            [
                5391,
                5435
            ],
            [
                5435,
                5525
            ],
            [
                5525,
                5654
            ],
            [
                5654,
                5692
            ],
            [
                5692,
                5733
            ],
            [
                5733,
                5797
            ],
            [
                5797,
                5811
            ],
            [
                5811,
                5842
            ],
            [
                5842,
                5915
            ],
            [
                5915,
                5954
            ],
            [
                5954,
                5963
            ],
            [
                5963,
                6084
            ],
            [
                6084,
                6102
            ],
            [
                6102,
                6272
            ],
            [
                6272,
                6347
            ],
            [
                6347,
                6371
            ],
            [
                6371,
                6427
            ],
            [
                6427,
                6427
            ],
            [
                6427,
                6446
            ],
            [
                6446,
                6464
            ],
            [
                6464,
                6471
            ],
            [
                6471,
                6516
            ],
            [
                6516,
                6516
            ],
            [
                6516,
                6516
            ],
            [
                6516,
                6516
            ],
            [
                6516,
                6516
            ],
            [
                6516,
                6534
            ],
            [
                6534,
                6593
            ],
            [
                6593,
                6609
            ],
            [
                6609,
                6680
            ],
            [
                6680,
                6972
            ],
            [
                6972,
                7000
            ],
            [
                7000,
                7151
            ],
            [
                7151,
                7193
            ],
            [
                7193,
                7199
            ],
            [
                7199,
                7219
            ],
            [
                7219,
                7374
            ],
            [
                7374,
                7550
            ],
            [
                7550,
                7550
            ],
            [
                7550,
                7609
            ],
            [
                7609,
                7657
            ],
            [
                7657,
                7723
            ],
            [
                7723,
                7731
            ],
            [
                7731,
                7789
            ],
            [
                7789,
                7822
            ],
            [
                7822,
                7902
            ],
            [
                7902,
                7973
            ],
            [
                7973,
                7997
            ],
            [
                7997,
                7997
            ],
            [
                7997,
                7997
            ],
            [
                7997,
                8026
            ],
            [
                8026,
                8108
            ],
            [
                8108,
                8254
            ],
            [
                8254,
                8361
            ],
            [
                8361,
                8486
            ],
            [
                8486,
                8710
            ],
            [
                8710,
                8733
            ],
            [
                8733,
                8859
            ],
            [
                8859,
                8934
            ],
            [
                8934,
                9003
            ],
            [
                9003,
                9168
            ],
            [
                9168,
                9339
            ],
            [
                9339,
                9452
            ],
            [
                9452,
                9490
            ],
            [
                9490,
                9558
            ],
            [
                9558,
                9704
            ],
            [
                9704,
                9814
            ],
            [
                9814,
                9829
            ],
            [
                9829,
                10008
            ],
            [
                10008,
                10052
            ],
            [
                10052,
                10090
            ],
            [
                10090,
                10317
            ],
            [
                10317,
                10366
            ],
            [
                10366,
                10565
            ],
            [
                10565,
                10698
            ],
            [
                10698,
                10721
            ],
            [
                10721,
                10897
            ],
            [
                10897,
                10949
            ],
            [
                10949,
                11041
            ],
            [
                11041,
                11071
            ],
            [
                11071,
                11113
            ],
            [
                11113,
                11210
            ],
            [
                11210,
                11241
            ],
            [
                11241,
                11298
            ],
            [
                11298,
                11339
            ],
            [
                11339,
                11436
            ],
            [
                11436,
                11627
            ],
            [
                11627,
                11755
            ],
            [
                11755,
                11776
            ],
            [
                11776,
                11834
            ],
            [
                11834,
                11896
            ],
            [
                11896,
                12001
            ],
            [
                12001,
                12080
            ],
            [
                12080,
                12087
            ],
            [
                12087,
                12121
            ],
            [
                12121,
                12145
            ],
            [
                12145,
                12177
            ],
            [
                12177,
                12191
            ],
            [
                12191,
                12272
            ],
            [
                12272,
                12310
            ],
            [
                12310,
                12431
            ],
            [
                12431,
                12431
            ],
            [
                12431,
                12532
            ],
            [
                12532,
                12619
            ],
            [
                12619,
                12666
            ],
            [
                12666,
                12704
            ],
            [
                12704,
                12722
            ],
            [
                12722,
                12811
            ],
            [
                12811,
                12828
            ],
            [
                12828,
                12942
            ],
            [
                12942,
                12972
            ],
            [
                12972,
                13043
            ],
            [
                13043,
                13107
            ],
            [
                13107,
                13157
            ],
            [
                13157,
                13322
            ],
            [
                13322,
                13421
            ],
            [
                13421,
                13460
            ],
            [
                13460,
                13460
            ],
            [
                13460,
                13509
            ],
            [
                13509,
                13549
            ],
            [
                13549,
                13843
            ],
            [
                13843,
                13907
            ],
            [
                13907,
                13955
            ],
            [
                13955,
                14089
            ],
            [
                14089,
                14125
            ],
            [
                14125,
                14184
            ],
            [
                14184,
                14226
            ],
            [
                14226,
                14269
            ],
            [
                14269,
                14307
            ],
            [
                14307,
                14381
            ],
            [
                14381,
                14495
            ],
            [
                14495,
                14545
            ],
            [
                14545,
                14628
            ],
            [
                14628,
                14717
            ],
            [
                14717,
                14752
            ],
            [
                14752,
                14834
            ],
            [
                14834,
                14918
            ],
            [
                14918,
                14997
            ],
            [
                14997,
                15029
            ],
            [
                15029,
                15095
            ],
            [
                15095,
                15137
            ],
            [
                15137,
                15200
            ],
            [
                15200,
                15200
            ],
            [
                15200,
                15248
            ],
            [
                15248,
                15279
            ],
            [
                15279,
                15354
            ],
            [
                15354,
                15354
            ],
            [
                15354,
                15419
            ],
            [
                15419,
                15559
            ],
            [
                15559,
                15640
            ],
            [
                15640,
                15821
            ],
            [
                15821,
                15883
            ],
            [
                15883,
                15922
            ],
            [
                15922,
                16082
            ],
            [
                16082,
                16113
            ],
            [
                16113,
                16148
            ],
            [
                16148,
                16173
            ],
            [
                16173,
                16193
            ],
            [
                16193,
                16246
            ],
            [
                16246,
                16289
            ],
            [
                16289,
                16305
            ],
            [
                16305,
                16320
            ],
            [
                16320,
                16470
            ],
            [
                16470,
                16594
            ],
            [
                16594,
                16625
            ],
            [
                16625,
                16632
            ],
            [
                16632,
                16650
            ],
            [
                16650,
                16681
            ],
            [
                16681,
                16681
            ],
            [
                16681,
                16771
            ],
            [
                16771,
                16771
            ],
            [
                16771,
                16834
            ],
            [
                16834,
                16920
            ],
            [
                16920,
                16978
            ],
            [
                16978,
                17034
            ],
            [
                17034,
                17083
            ],
            [
                17083,
                17247
            ],
            [
                17247,
                17259
            ],
            [
                17259,
                17278
            ],
            [
                17278,
                17331
            ],
            [
                17331,
                17353
            ],
            [
                17353,
                17391
            ],
            [
                17391,
                17424
            ],
            [
                17424,
                17424
            ],
            [
                17424,
                17439
            ],
            [
                17439,
                17446
            ],
            [
                17446,
                17446
            ],
            [
                17446,
                17492
            ],
            [
                17492,
                17603
            ],
            [
                17603,
                17659
            ],
            [
                17659,
                17725
            ],
            [
                17725,
                17788
            ],
            [
                17788,
                17801
            ],
            [
                17801,
                17824
            ],
            [
                17824,
                17860
            ],
            [
                17860,
                17997
            ],
            [
                17997,
                18047
            ],
            [
                18047,
                18091
            ],
            [
                18091,
                18159
            ],
            [
                18159,
                18195
            ],
            [
                18195,
                18215
            ],
            [
                18215,
                18301
            ],
            [
                18301,
                18377
            ],
            [
                18377,
                18497
            ],
            [
                18497,
                18566
            ],
            [
                18566,
                18636
            ],
            [
                18636,
                18882
            ],
            [
                18882,
                18968
            ],
            [
                18968,
                19023
            ],
            [
                19023,
                19053
            ],
            [
                19053,
                19097
            ],
            [
                19097,
                19142
            ],
            [
                19142,
                19203
            ],
            [
                19203,
                19338
            ],
            [
                19338,
                19398
            ],
            [
                19398,
                19403
            ],
            [
                19403,
                19564
            ],
            [
                19564,
                19571
            ],
            [
                19571,
                19609
            ],
            [
                19609,
                19609
            ],
            [
                19609,
                19710
            ],
            [
                19710,
                19755
            ],
            [
                19755,
                19783
            ],
            [
                19783,
                19847
            ],
            [
                19847,
                19943
            ],
            [
                19943,
                20008
            ],
            [
                20008,
                20084
            ],
            [
                20084,
                20118
            ],
            [
                20118,
                20140
            ],
            [
                20140,
                20238
            ],
            [
                20238,
                20319
            ],
            [
                20319,
                20367
            ],
            [
                20367,
                20371
            ],
            [
                20371,
                20371
            ],
            [
                20371,
                20461
            ],
            [
                20461,
                20461
            ],
            [
                20461,
                20485
            ],
            [
                20485,
                20568
            ],
            [
                20568,
                20609
            ],
            [
                20609,
                20622
            ],
            [
                20622,
                20646
            ],
            [
                20646,
                20668
            ],
            [
                20668,
                20682
            ],
            [
                20682,
                20809
            ],
            [
                20809,
                20846
            ],
            [
                20846,
                20898
            ],
            [
                20898,
                20948
            ],
            [
                20948,
                21013
            ],
            [
                21013,
                21031
            ],
            [
                21031,
                21124
            ],
            [
                21124,
                21161
            ],
            [
                21161,
                21371
            ],
            [
                21371,
                21405
            ],
            [
                21405,
                21466
            ],
            [
                21466,
                21519
            ],
            [
                21519,
                21519
            ],
            [
                21519,
                21537
            ],
            [
                21537,
                21554
            ],
            [
                21554,
                21665
            ]
        ]
    }
}