{
    "original": {
        "text": "\"I have no wrong, where I can claim no right, Naught ta'en me fro, where I have nothing had, Yet of my woe I cannot so be quite; Namely, since that another may be glad With that, that thus in sorrow makes me sad.\" WYATT.\nMargaret had not expected much pleasure to herself from Mr. Bell's visit--she had only looked forward to it on her father's account, but when her godfather came, she at once fell into the most natural position of friendship in the world. He said she had no merit in being what she was, a girl so entirely after his own heart: it was an hereditary power which she had, to walk in and take possession of his regard; while she, in reply, gave him much credit for being so fresh and young under his Fellow's cap and gown.\n\"Fresh and young in warmth and kindness, I mean. I'm afraid I must own, that I think your opinions are the oldest and mustiest I have met with this long time.\"\n\"Hear this daughter of yours, Hale! Her residence in Milton has quite corrupted her. She's a democrat, a red republican, a member of the Peace Society, a socialist--\"\n\"Papa, it's all because I'm standing up for the progress of commerce. Mr. Bell would have had it keep still at exchanging wild-beast skins for acorns.\"\n\"No, no. I'd dig the ground and grow potatoes. And I'd shave the wild-beast skin and make the wool into broadcloth. Don't exaggerate, missy. But I'm tired of this bustle. Everybody rushing over everybody, in their hurry to get rich.\"\n\"It is not everyone who can sit comfortably in a set of college rooms and let his riches grow without any exertion of his own. No doubt there is many a man here who would be thankful if his property would increase as yours has done, without his taking any trouble about it,\" said Mr. Hale.\n\"I don't believe they would. It's the bustle and the struggle they like. As for sitting still, and learning from the past, or shaping out the future by faithful work done in a prophetic spirit--Why! Pooh! I don't believe there's a man in Milton who knows how to sit still; and it is a great art.\"\n\"Milton people, I suspect, think Oxford men don't know how to move. It would be a very good thing if they mixed a little more.\"\n\"It might be good for the Miltoners. Many things might be good for them which would be very disagreeable for other people.\"\n\"Are you not a Milton man yourself?\" asked Margaret. \"I should have thought you would have been proud of your town.\"\n\"I confess, I don't see what there is to be proud of. If you'll only come to Oxford, Margaret, I will show you a place to glory in.\"\n\"Well!\" said Mr. Hale, \"Mr. Thornton is coming to drink tea with us to-night, and he is as proud of Milton as you of Oxford. You two must try and make each other a little more liberal-minded.\"\n\"I don't want to be more liberal-minded, thank you,\" said Mr. Bell.\n\"Is Mr. Thornton coming to tea, papa!\" asked Margaret in a low voice.\n\"Either to tea or soon after. He could not tell. He told us not to wait.\"\nMr. Thornton had determined that he would make no inquiry of his mother as to how far she had put her project into execution of speaking to Margaret about the impropriety of her conduct. He felt pretty sure that, if this interview took place, his mother's account of what passed at it would only annoy and chagrin him, though he would all the time be aware of the colouring which it received by passing through her mind. He shrank from hearing Margaret's very name mentioned; he, while he blamed her--while he was jealous of her--while he renounced her--he loved her sorely, in spite of himself. He dreamt of her; he dreamt she came dancing towards him with outspread arms, and with a lightness and gaiety which made him loathe her, even while it allured him. But the impression of this figure of Margaret--with all Margaret's character taken out of it, as completely as if some evil spirit had got possession of her form--was so deeply stamped upon his imagination, that when he wakened he felt hardly able to separate the Una from the Duessa; and the dislike he had to the latter seemed to envelop and disfigure the former. Yet he was too proud to acknowledge his weakness by avoiding the sight of her. He would neither seek an opportunity of being in her company nor avoid it. To convince himself of his power of self-control, he lingered over every piece of business this afternoon; he forced every movement into unnatural slowness and deliberation; and it was consequently past eight o'clock before he reached Mr. Hale's. Then there were business arrangements to be transacted in the study with Mr. Bell; and the latter kept on, sitting over the fire, and talking wearily, long after all business was transacted, and when they might just as well have gone upstairs. But Mr. Thornton would not say a word about moving their quarters; he chafed and chafed, and thought Mr. Bell a most prosy companion; while Mr. Bell returned the compliment in secret, by considering Mr. Thornton about as brusque and curt a fellow as he had ever met with, and terribly gone off both in intelligence and manner. At last some slight noise in the room above suggested the desirableness of moving there. They found Margaret with a letter open before her, eagerly discussing its contents with her father. On the entrance of the gentlemen, it was immediately put aside; but Mr. Thornton's eager senses caught some few words of Mr. Hale's to Mr. Bell.\n\"A letter from Henry Lennox. It makes Margaret very hopeful.\"\nMr. Bell nodded. Margaret was red as a rose when Mr. Thornton looked at her. He had the greatest mind in the world to get up and go out of the room that very instant, and never set foot in the house again.\n\"We were thinking,\" said Mr. Hale, \"that you and Mr. Thornton had taken Margaret's advice, and were each trying to convert the other, you were so long in the study.\"\n\"And you thought there would be nothing left of us but an opinion, like the Kilkenny cat's tail. Pray whose opinion did you think would have the most obstinate vitality?\"\nMr. Thornton had not a notion what they were talking about, and disdained to inquire. Mr. Hale politely enlightened him.\n\"Mr. Thornton, we were accusing Mr. Bell this morning of a kind of Oxonian medival bigotry against his native town; and we--Margaret, I believe--suggested that it would do him good to associate a little with Milton manufacturers.\"\n\"I beg your pardon. Margaret thought it would do the Milton manufacturers good to associate a little more with Oxford men. Now wasn't it so, Margaret?\"\n\"I believe I thought it would do both good to see a little more of the other,--I did not know it was my idea any more than papa's.\"\n\"And so you see, Mr. Thornton, we ought to have been improving each other down-stairs, instead of talking over vanished families of Smith's and Harrison's. However, I am willing to do my part now. I wonder when you Milton men intend to live. All your lives seem to be spent in gathering together the materials for life.\"\n\"By living, I suppose you mean enjoyment.\"\n\"Yes, enjoyment,--I don't specify of what, because I trust we should both consider mere pleasure as very poor enjoyment.\"\n\"I would rather have the nature of the enjoyment defined.\"\n\"Well! enjoyment or leisure--enjoyment of the power and influence which money gives. You are all striving for money. What do you want it for?\"\nMr. Thornton was silent. Then he said, \"I really don't know. But money is not what _I_ strive for.\"\n\"What then?\"\n\"It is a home question. I shall have to lay myself open to such a catechist, and I am not sure that I am prepared to do it.\"\n\"No!\" said Mr. Hale; \"don't let us be personal in our catechism. You are neither of you representative men; you are each of you too individual for that.\"\n\"I am not sure whether to consider that as a compliment or not. I should like to be the representative of Oxford, with its beauty and its learning, and its proud old history. What do you say, Margaret; ought I to be flattered?\"\n\"I don't know Oxford. But there is a difference between being the representative of a city and the representative man of its inhabitants.\"\n\"Very true, Miss Margaret. Now I remember, you were against me this morning, and were quite Miltonian and manufacturing in your preferences.\"\nMargaret saw the quick glance of surprise that Mr. Thornton gave her, and she was annoyed at the construction which he might put on this speech of Mr. Bell's. Mr. Bell went on--\n\"Ah! I wish I could show you our High Street--our Radcliffe Square. I am leaving out our colleges, just as I give Mr. Thornton leave to omit his factories in speaking of the charms of Milton. I have a right to abuse my birth-place. Remember I am a Milton man.\"\nMr. Thornton was annoyed more than he ought to have been at all that Mr. Bell was saying. He was not in a mood for joking. At another time, he could have enjoyed Mr. Bell's half testy condemnation of a town where the life was so at variance with every habit he had formed; but now, he was galled enough to attempt to defend what was never meant to be seriously attacked.\n\"I don't set up Milton as a model of a town.\"\n\"Not in architecture?\" slyly asked Mr. Bell.\n\"No! We've been too busy to attend to mere outward appearances.\"\n\"Don't say _mere_ outward appearances,\" said Mr. Hale, gently. \"They impress us all, from childhood upward--every day of our life.\"\n\"Wait a little while,\" said Mr. Thornton. \"Remember we are of a different race from the Greeks, to whom beauty was everything, and to whom Mr. Bell might speak of a life of leisure and serene enjoyment, much of which entered in through their outward senses. I don't mean to despise them, any more than I would ape them. But I belong to Teutonic blood; it is little mingled in this part of England to what it is in others; we retain much of their language; we retain more of their spirit; we do not look upon life as a time for enjoyment, but as a time for action and exertion. Our glory and our beauty arise out of our outward strength, which makes us victorious over material resistance, and over greater difficulties still. We are Teutonic up here in Darkshire in another way. We hate to have laws made for us at a distance. We wish people would allow us to right ourselves, instead of continually meddling, with their imperfect legislation. We stand up for self-government, and oppose centralisation.\"\n\"In short, you would like the Heptarchy back again. Well, at any rate, I revoke what I said this morning--that you Milton people did not reverence the past. You are regular worshippers of Thor.\"\n\"If we do not reverence the past as you do in Oxford, it is because we want something which can apply to the present more directly. It is fine when the study of the past leads to a prophecy of the future. But to men groping in new circumstances, it would be finer if the words of experience could direct us how to act in what concerns us most intimately and immediately; which is full of difficulties to be encountered; and upon the mode in which they are met and conquered--not merely pushed aside for the time--depends our future. But no! People can speak of Utopia much more easily than of the next day's duty; and yet when that duty is all done by others, who so ready to cry, 'Fie, for shame!'\"\n\"And all this time I don't see what you are talking about. Would you Milton men condescend to send up your to-day's difficulty to Oxford? You have not tried us yet.\"\nMr. Thornton laughed outright at this. \"I believe I was talking with reference to a good deal that has been troubling us of late; I was thinking of the strikes we have gone through, which are troublesome and injurious things enough, as I am finding to my cost. And yet this last strike, under which I am smarting, has been respectable.\"\n\"A respectable strike!\" said Mr. Bell. \"That sounds as if you were far gone in the worship of Thor.\"\nMargaret felt, rather than saw, that Mr. Thornton was chagrined by the repeated turning into jest of what he was feeling as very serious. She tried to change the conversation from a subject about which one party cared little, while, to the other, it was deeply, because personally, interesting. She forced herself to say something.\n\"Edith says she finds the printed calicoes in Corfu better and cheaper than in London.\"\n\"Does she?\" said her father, \"I think that must be one of Edith's exaggerations. Are you sure of it, Margaret?\"\n\"I am sure she says so, papa.\"\n\"Then I am sure of the fact,\" said Mr. Bell. \"Margaret, I go so far in my idea of your truthfulness, that it shall cover your cousin's character. I don't believe a cousin of yours could exaggerate.\"\n\"Is Miss Hale so remarkable for truth?\" said Mr. Thornton, bitterly. The moment he had done so, he could have bitten his tongue out. What was he? And why should he stab her with her shame in this way? How evil he was to-night: possessed by ill-humour at being detained so long from her; irritated by the mention of some name, because he thought it belonged to a more successful lover; now ill-tempered because he had been unable to cope, with a light heart, against one who was trying, by gay and careless speeches, to make the evening pass pleasantly away,--the kind old friend to all parties, whose manner by this time might be well known to Mr. Thornton, who had been acquainted with him for many years. And then to speak to Margaret as he had done! She did not get up and leave the room, as she had done in former days, when his abruptness or his temper had annoyed her. She sat quite still, after the first momentary glance of grieved surprise, that made her eyes look like some child's who has met with an unexpected rebuff; they slowly dilated into mournful, reproachful sadness; and then they fell, and she bent over her work, and did not speak again. But he could not help looking at her, and he saw a sigh tremble over her body, as if she quivered in some unwonted chill. He felt as the mother would have done, in the midst of \"her rocking it, and rating it,\" had she been called away before her slow confiding smile, implying perfect trust in mother's love, had proved the renewing of its love. He gave short sharp answers; he was uneasy and cross, unable to discern between jest and earnest; anxious only for a look, a word of hers, before which to prostrate himself in penitent humility. But she neither looked nor spoke. Her round taper fingers flew in and out of her sewing, as steadily and swiftly as if that were the business of her life. She could not care for him, he thought, or else the passionate fervour of his wish would have forced her to raise those eyes, if but for an instant, to read the late repentance in his. He could have struck her before he left, in order that by some strange overt act of rudeness, he might earn the privilege of telling her the remorse that gnawed at his heart. It was well that the long walk in the open air wound up this evening for him. It sobered him back into grave resolution that henceforth he would see as little of her as possible,--since the very sight of that face and form, the very sounds of that voice (like the soft winds of pure melody) had such power to move him from his balance. Well! He had known what love was--a sharp pang, a fierce experience, in the midst of whose flames he was struggling! but, through the furnace he would fight his way out into the serenity of middle age,--all the richer and more human for having known this great passion.\nWhen he had somewhat abruptly left the room, Margaret rose from her seat, and began silently to fold up her work. The long seams were heavy, and had an unusual weight for her languid arms. The round lines in her face took a lengthened, straighter form, and her whole appearance was that of one who had gone through a day of great fatigue. As the three prepared for bed, Mr. Bell muttered a little condemnation of Mr. Thornton.\n\"I never saw a fellow so spoiled by success. He can't bear a word; a jest of any kind. Everything seems to touch on the soreness of his high dignity. Formerly, he was as simple and noble as the open day; you could not offend him, because he had no vanity.\"\n\"He is not vain now,\" said Margaret, turning round from the table, and speaking with quiet distinctness. \"To-night he has not been like himself. Something must have annoyed him before he came here.\"\nMr. Bell gave her one of his sharp glances from above his spectacles. She stood it quite calmly; but, after she had left the room, he suddenly asked,--\n\"Hale! did it ever strike you that Thornton and your daughter have what the French call a tendresse for each other?\"\n\"Never!\" said Mr. Hale, first startled and then flurried by the new idea. \"No, I am sure you are wrong, I am almost certain you are mistaken. If there is anything, it is all on Mr. Thornton's side. Poor fellow! I hope and trust he is not thinking of her, for I am sure she would not have him.\"\n\"Well! I'm a bachelor, and have steered clear of love affairs all my life; so perhaps my opinion is not worth having. Or else I should say there were very pretty symptoms about her!\"\n\"Then I am sure you are wrong,\" said Mr. Hale. \"He may care for her, though she really has been almost rude to him at times. But she!--why, Margaret would never think of him, I'm sure. Such a thing has never entered her head.\"\n\"Entering her heart would do. But I merely threw out a suggestion of what might be. I dare say I was wrong. And whether I was wrong or right, I'm very sleepy; so, having disturbed your night's rest (as I can see) with my untimely fancies, I'll betake myself with an easy mind to my own.\"\nBut Mr. Hale resolved that he would not be disturbed by any such nonsensical idea; so he lay awake, determining not to think about it.\nMr. Bell took his leave the next day, bidding Margaret look to him as one who had a right to help and protect her in all her troubles, of whatever nature they might be. To Mr. Hale he said,--\n\"That Margaret of yours has gone deep into my heart. Take care of her, for she is a very precious creature,--a great deal too good for Milton--only fit for Oxford, in fact. The town, I mean; not the men. I can't match her yet. When I can, I shall bring my young man to stand side by side with your young woman, just as the genii in the Arabian Nights brought Prince Caralmazan to match with the fairy's Princess Badoura.\"\n\"I beg you'll do no such thing. Remember the misfortunes that ensued; and besides, I can't spare Margaret.\"\n\"No; on second thoughts, we'll have her to nurse us ten years hence, when we shall be two cross old invalids. Seriously, Hale! I wish you'd leave Milton; which is a most unsuitable place for you, though it was my recommendation in the first instance. If you would, I'd swallow my shadows of doubts, and take a college living; and you and Margaret should come and live at the parsonage--you to be a sort of lay curate, and take the unwashed off my hands; and she to be our housekeeper--the village Lady Bountiful--by day; and read us to sleep in the evenings. I could be very happy in such a life. What do you think of it?\"\n\"Never,\" said Mr. Hale, decidedly. \"My one great change has been made and my price of suffering paid. Here I stay out my life; and here will I be buried, and lost in the crowd.\"\n\"I don't give up my plan yet. Only I won't bait you with it any more just now. Where's the Pearl. Come, Margaret, give me a farewell kiss; and remember, my dear, where you may find a true friend, as far as his capability goes. You are my child, Margaret. Remember that, and God bless you!\"\nSo they fell back into the monotony of the quiet life they would henceforth lead. There was no invalid to hope and fear about; even the Higginses--so long a vivid interest--seemed to have receded from any need of immediate thought. The Boucher children, left motherless orphans, claimed what of Margaret's care she could bestow; and she went pretty often to see Mary Higgins, who had charge of them. The two families were living in one house: the elder children were at humble schools, the younger ones were tended, in Mary's absence at her work, by the kind neighbour whose good sense had struck Margaret at the time of Boucher's death. Of course she was paid for her trouble; and, indeed, in all his little plans and arrangements for these orphan children, Nicholas showed a sober judgment, and regulated method of thinking, which were at variance with his former more eccentric jerks of action. He was so steady at his work, that Margaret did not often see him during these winter months; but when she did, she saw that he winced away from any reference to the father of those children, whom he had so fully and heartily taken under his care. He did not speak easily of Mr. Thornton.\n\"To tell the truth,\" said he, \"he fairly bamboozles me. He's two chaps. One chap I knowed of old as were measter all o'er. T'other chap hasn't an ounce of measter's flesh about him. How them two chaps is bound up in one body, is a craddy for me to find out. I'll not be beat by it, though. Meanwhile he comes here pretty often; that's how I know the chap that's a man, not a measter. And I reckon he's taken aback by me pretty much as I am by him; for he sits and listens and stares, as if I were some strange beast newly caught in some of the zones. But I'm none daunted. It would take a deal to daunt me in my own house, as he sees. And I tell him some of my mind that I reckon he'd ha' been the better of hearing when he were a younger man.\"\n\"And does he not answer you,\" asked Mr. Hale.\n\"Well! I'll not say th' advantage is all on his side, for all I take credit for improving him above a bit. Sometimes he says a rough thing or two, which is not agreeable to look at at first, but has a queer smack o' truth in it when yo' come to chew it. He'll be coming to-night, I reckon, about them childer's schooling. He's not satisfied wi' the make of it, and wants for t' examine 'em.\"\n\"What are they\"--began Mr. Hale; but Margaret, touching his arm, showed him her watch.\n\"It is nearly seven,\" she said. \"The evenings are getting longer now. Come, papa.\" She did not breathe freely till they were some distance from the house. Then, as she became more calm, she wished that she had not been in so great a hurry; for, somehow, they saw Mr. Thornton but very seldom now; and he might have come to see Higgins, and for the old friendship's sake she should like to have seen him to-night.\nYes! he came very seldom, even for the dull cold purpose of lessons. Mr. Hale was disappointed in his pupil's lukewarmness about Greek literature, which had but a short time ago so great an interest for him. And now it often happened that a hurried note from Mr. Thornton would arrive, just at the last moment, saying that he was so much engaged that he could not come to read with Mr. Hale that evening. And though other pupils had taken more than his place as to time, no one was like his first scholar in Mr. Hale's heart. He was depressed and sad at this partial cessation of an intercourse which had become dear to him; and he used to sit pondering over the reason that could have occasioned this change.\nHe startled Margaret, one evening as she sate at her work, by suddenly asking:\n\"Margaret! had you ever any reason for thinking that Mr. Thornton cared for you?\"\nHe almost blushed as he put this question; but Mr. Bell's scouted idea recurred to him, and the words were out of his mouth before he well knew what he was about.\nMargaret did not answer immediately; but by the bent drooping of her head, he guessed what her reply would be.\n\"Yes; I believe--oh, papa, I should have told you.\" And she dropped her work, and hid her face in her hands.\n\"No, dear; don't think that I am impertinently curious. I am sure you would have told me if you had felt that you could return his regard. Did he speak to you about it?\"\nNo answer at first; but by-and-by a little gentle reluctant \"Yes.\"\n\"And you refused him?\"\nA long sigh: a more helpless, nerveless attitude, and another \"Yes.\" But before her father could speak, Margaret lifted up her face, rosy with some beautiful shame, and, fixing her eyes upon him, said:\n\"Now, papa, I have told you all this, and I cannot tell you more; and then the whole thing is so painful to me; every word and action connected with it is so unspeakably bitter, that I cannot bear to think of it. Oh, papa, I am sorry to have lost you this friend, but I could not help it--but oh! I am very sorry.\" She sate down on the ground, and laid her head on his knees.\n\"I, too, am sorry, my dear. Mr. Bell quite startled me when he said, some idea of the kind--\"\n\"Mr. Bell! Oh did Mr. Bell see it?\"\n\"A little; but he took it into his head that you--how shall I say it?--that you were not ungraciously disposed towards Mr. Thornton. I knew that could never be. I hoped the whole thing was but an imagination; but I knew too well what your real feelings were to suppose that you could ever like Mr. Thornton in that way. But I am very sorry.\"\nThey were very quiet and still for some minutes. But, on stroking her cheek in a caressing way soon after, he was almost shocked to find her face wet with tears. As he touched her, she sprang up, and smiling with forced brightness, began to talk of the Lennoxes with such a vehement desire to turn the conversation, that Mr. Hale was too tender-hearted to try to force it back into the old channel.\n\"To-morrow--yes, to-morrow they will be back in Harley Street. Oh, how strange it will be! I wonder what room they will make into the nursery? Aunt Shaw will be happy with the baby. Fancy Edith a mamma! And Captain Lennox--I wonder what he will do with himself now he has sold out!\"\n\"I'll tell you what,\" said her father, anxious to indulge her in this fresh subject of interest, \"I think I must spare you for a fortnight just to run up to town and see the travellers. You could learn more by half an hour's conversation with Mr. Henry Lennox about Frederick's chances, than in a dozen of these letters of his; so it would, in fact, be uniting business with pleasure.\"\n\"No, papa, you cannot spare me, and what's more, I won't be spared.\" Then after a pause, she added: \"I am losing hope sadly about Frederick; he is letting us down gently, but I can see that Mr. Lennox himself has no hope of hunting up the witnesses under years and years of time. No,\" said she, \"that bubble was very pretty, and very dear to our hearts; but it has burst like many another; and we must console ourselves with being glad that Frederick is so happy, and with being a great deal to each other. So don't offend me by talking of being able to spare me, papa, for I assure you you can't.\"\nBut the idea of a change took root and germinated in Margaret's heart, although not in the way in which her father proposed it at first. She began to consider how desirable something of the kind would be to her father, whose spirits, always feeble, now became too frequently depressed, and whose health, though he never complained, had been seriously affected by his wife's illness and death. There were the regular hours of reading with his pupils, but that all giving and no receiving could no longer be called companionship, as in the old days when Mr. Thornton came to study under him. Margaret was conscious of the want under which he was suffering, unknown to himself; the want of a man's intercourse with men. At Helstone there had been perpetual occasion for an interchange of visits with neighbouring clergymen; and the poor labourers in the fields, or leisurely tramping home at eve, or tending their cattle in the forest, were always at liberty to speak or be spoken to. But in Milton every one was too busy for quiet speech, or any ripened intercourse of thought; what they said was about business, very present and actual; and when the tension of mind relating to their daily affairs was over, they sunk into fallow rest until next morning. The workman was not to be found after the day's work was done; he had gone away to some lecture, or some club, or some beershop, according to his degree of character. Mr. Hale thought of trying to deliver a course of lectures at some of the institutions, but he contemplated doing this so much as an effort of duty, and with so little of the genial impulse of love towards his work and its end, that Margaret was sure that it would not be well done until he could look upon it with some kind of zest.",
        "paragraph_chars": [
            [
                0,
                221
            ],
            [
                221,
                739
            ],
            [
                739,
                899
            ],
            [
                899,
                1066
            ],
            [
                1066,
                1218
            ],
            [
                1218,
                1452
            ],
            [
                1452,
                1742
            ],
            [
                1742,
                2039
            ],
            [
                2039,
                2167
            ],
            [
                2167,
                2291
            ],
            [
                2291,
                2408
            ],
            [
                2408,
                2541
            ],
            [
                2541,
                2734
            ],
            [
                2734,
                2802
            ],
            [
                2802,
                2872
            ],
            [
                2872,
                2946
            ],
            [
                2946,
                5378
            ],
            [
                5378,
                5440
            ],
            [
                5440,
                5646
            ],
            [
                5646,
                5812
            ],
            [
                5812,
                5983
            ],
            [
                5983,
                6104
            ],
            [
                6104,
                6335
            ],
            [
                6335,
                6487
            ],
            [
                6487,
                6619
            ],
            [
                6619,
                6940
            ],
            [
                6940,
                6983
            ],
            [
                6983,
                7105
            ],
            [
                7105,
                7164
            ],
            [
                7164,
                7307
            ],
            [
                7307,
                7407
            ],
            [
                7407,
                7420
            ],
            [
                7420,
                7545
            ],
            [
                7545,
                7699
            ],
            [
                7699,
                7927
            ],
            [
                7927,
                8066
            ],
            [
                8066,
                8208
            ],
            [
                8208,
                8386
            ],
            [
                8386,
                8647
            ],
            [
                8647,
                9018
            ],
            [
                9018,
                9064
            ],
            [
                9064,
                9109
            ],
            [
                9109,
                9174
            ],
            [
                9174,
                9306
            ],
            [
                9306,
                10311
            ],
            [
                10311,
                10506
            ],
            [
                10506,
                11206
            ],
            [
                11206,
                11372
            ],
            [
                11372,
                11709
            ],
            [
                11709,
                11810
            ],
            [
                11810,
                12142
            ],
            [
                12142,
                12230
            ],
            [
                12230,
                12342
            ],
            [
                12342,
                12373
            ],
            [
                12373,
                12572
            ],
            [
                12572,
                15394
            ],
            [
                15394,
                15821
            ],
            [
                15821,
                16078
            ],
            [
                16078,
                16277
            ],
            [
                16277,
                16429
            ],
            [
                16429,
                16546
            ],
            [
                16546,
                16840
            ],
            [
                16840,
                17023
            ],
            [
                17023,
                17250
            ],
            [
                17250,
                17538
            ],
            [
                17538,
                17673
            ],
            [
                17673,
                17865
            ],
            [
                17865,
                18287
            ],
            [
                18287,
                18395
            ],
            [
                18395,
                19018
            ],
            [
                19018,
                19196
            ],
            [
                19196,
                19486
            ],
            [
                19486,
                20673
            ],
            [
                20673,
                21418
            ],
            [
                21418,
                21464
            ],
            [
                21464,
                21856
            ],
            [
                21856,
                21943
            ],
            [
                21943,
                22356
            ],
            [
                22356,
                23066
            ],
            [
                23066,
                23145
            ],
            [
                23145,
                23227
            ],
            [
                23227,
                23390
            ],
            [
                23390,
                23501
            ],
            [
                23501,
                23610
            ],
            [
                23610,
                23780
            ],
            [
                23780,
                23847
            ],
            [
                23847,
                23870
            ],
            [
                23870,
                24072
            ],
            [
                24072,
                24448
            ],
            [
                24448,
                24542
            ],
            [
                24542,
                24578
            ],
            [
                24578,
                24920
            ],
            [
                24920,
                25319
            ],
            [
                25319,
                25602
            ],
            [
                25602,
                25988
            ],
            [
                25988,
                26587
            ],
            [
                26587,
                28341
            ]
        ],
        "segment_chars": [
            [
                0,
                214
            ],
            [
                214,
                221
            ],
            [
                221,
                459
            ],
            [
                459,
                739
            ],
            [
                739,
                788
            ],
            [
                788,
                899
            ],
            [
                899,
                935
            ],
            [
                935,
                984
            ],
            [
                984,
                1066
            ],
            [
                1066,
                1136
            ],
            [
                1136,
                1218
            ],
            [
                1218,
                1227
            ],
            [
                1227,
                1265
            ],
            [
                1265,
                1334
            ],
            [
                1334,
                1359
            ],
            [
                1359,
                1389
            ],
            [
                1389,
                1452
            ],
            [
                1452,
                1579
            ],
            [
                1579,
                1742
            ],
            [
                1742,
                1771
            ],
            [
                1771,
                1815
            ],
            [
                1815,
                1941
            ],
            [
                1941,
                1947
            ],
            [
                1947,
                2039
            ],
            [
                2039,
                2107
            ],
            [
                2107,
                2167
            ],
            [
                2167,
                2204
            ],
            [
                2204,
                2291
            ],
            [
                2291,
                2328
            ],
            [
                2328,
                2344
            ],
            [
                2344,
                2408
            ],
            [
                2408,
                2462
            ],
            [
                2462,
                2541
            ],
            [
                2541,
                2549
            ],
            [
                2549,
                2666
            ],
            [
                2666,
                2734
            ],
            [
                2734,
                2802
            ],
            [
                2802,
                2841
            ],
            [
                2841,
                2872
            ],
            [
                2872,
                2902
            ],
            [
                2902,
                2921
            ],
            [
                2921,
                2946
            ],
            [
                2946,
                3133
            ],
            [
                3133,
                3367
            ],
            [
                3367,
                3542
            ],
            [
                3542,
                3706
            ],
            [
                3706,
                4072
            ],
            [
                4072,
                4151
            ],
            [
                4151,
                4226
            ],
            [
                4226,
                4473
            ],
            [
                4473,
                4717
            ],
            [
                4717,
                5044
            ],
            [
                5044,
                5133
            ],
            [
                5133,
                5233
            ],
            [
                5233,
                5378
            ],
            [
                5378,
                5407
            ],
            [
                5407,
                5440
            ],
            [
                5440,
                5457
            ],
            [
                5457,
                5517
            ],
            [
                5517,
                5646
            ],
            [
                5646,
                5812
            ],
            [
                5812,
                5909
            ],
            [
                5909,
                5983
            ],
            [
                5983,
                6069
            ],
            [
                6069,
                6104
            ],
            [
                6104,
                6335
            ],
            [
                6335,
                6355
            ],
            [
                6355,
                6458
            ],
            [
                6458,
                6487
            ],
            [
                6487,
                6619
            ],
            [
                6619,
                6775
            ],
            [
                6775,
                6816
            ],
            [
                6816,
                6861
            ],
            [
                6861,
                6940
            ],
            [
                6940,
                6983
            ],
            [
                6983,
                7105
            ],
            [
                7105,
                7164
            ],
            [
                7164,
                7171
            ],
            [
                7171,
                7249
            ],
            [
                7249,
                7281
            ],
            [
                7281,
                7307
            ],
            [
                7307,
                7332
            ],
            [
                7332,
                7368
            ],
            [
                7368,
                7407
            ],
            [
                7407,
                7420
            ],
            [
                7420,
                7444
            ],
            [
                7444,
                7545
            ],
            [
                7545,
                7551
            ],
            [
                7551,
                7610
            ],
            [
                7610,
                7699
            ],
            [
                7699,
                7763
            ],
            [
                7763,
                7874
            ],
            [
                7874,
                7927
            ],
            [
                7927,
                7949
            ],
            [
                7949,
                8066
            ],
            [
                8066,
                8093
            ],
            [
                8093,
                8208
            ],
            [
                8208,
                8367
            ],
            [
                8367,
                8386
            ],
            [
                8386,
                8391
            ],
            [
                8391,
                8454
            ],
            [
                8454,
                8578
            ],
            [
                8578,
                8618
            ],
            [
                8618,
                8647
            ],
            [
                8647,
                8737
            ],
            [
                8737,
                8770
            ],
            [
                8770,
                9018
            ],
            [
                9018,
                9064
            ],
            [
                9064,
                9087
            ],
            [
                9087,
                9109
            ],
            [
                9109,
                9114
            ],
            [
                9114,
                9174
            ],
            [
                9174,
                9237
            ],
            [
                9237,
                9306
            ],
            [
                9306,
                9348
            ],
            [
                9348,
                9564
            ],
            [
                9564,
                9626
            ],
            [
                9626,
                9883
            ],
            [
                9883,
                10032
            ],
            [
                10032,
                10085
            ],
            [
                10085,
                10133
            ],
            [
                10133,
                10250
            ],
            [
                10250,
                10311
            ],
            [
                10311,
                10363
            ],
            [
                10363,
                10468
            ],
            [
                10468,
                10506
            ],
            [
                10506,
                10638
            ],
            [
                10638,
                10711
            ],
            [
                10711,
                11039
            ],
            [
                11039,
                11047
            ],
            [
                11047,
                11206
            ],
            [
                11206,
                11265
            ],
            [
                11265,
                11344
            ],
            [
                11344,
                11372
            ],
            [
                11372,
                11411
            ],
            [
                11411,
                11633
            ],
            [
                11633,
                11709
            ],
            [
                11709,
                11733
            ],
            [
                11733,
                11748
            ],
            [
                11748,
                11810
            ],
            [
                11810,
                11948
            ],
            [
                11948,
                12105
            ],
            [
                12105,
                12142
            ],
            [
                12142,
                12230
            ],
            [
                12230,
                12242
            ],
            [
                12242,
                12311
            ],
            [
                12311,
                12342
            ],
            [
                12342,
                12373
            ],
            [
                12373,
                12418
            ],
            [
                12418,
                12519
            ],
            [
                12519,
                12572
            ],
            [
                12572,
                12612
            ],
            [
                12612,
                12641
            ],
            [
                12641,
                12705
            ],
            [
                12705,
                12718
            ],
            [
                12718,
                12773
            ],
            [
                12773,
                13279
            ],
            [
                13279,
                13325
            ],
            [
                13325,
                13447
            ],
            [
                13447,
                13732
            ],
            [
                13732,
                13854
            ],
            [
                13854,
                14078
            ],
            [
                14078,
                14273
            ],
            [
                14273,
                14307
            ],
            [
                14307,
                14428
            ],
            [
                14428,
                14613
            ],
            [
                14613,
                14788
            ],
            [
                14788,
                14866
            ],
            [
                14866,
                15124
            ],
            [
                15124,
                15130
            ],
            [
                15130,
                15241
            ],
            [
                15241,
                15394
            ],
            [
                15394,
                15508
            ],
            [
                15508,
                15583
            ],
            [
                15583,
                15733
            ],
            [
                15733,
                15821
            ],
            [
                15821,
                15866
            ],
            [
                15866,
                15908
            ],
            [
                15908,
                15971
            ],
            [
                15971,
                16078
            ],
            [
                16078,
                16183
            ],
            [
                16183,
                16223
            ],
            [
                16223,
                16277
            ],
            [
                16277,
                16347
            ],
            [
                16347,
                16429
            ],
            [
                16429,
                16436
            ],
            [
                16436,
                16546
            ],
            [
                16546,
                16555
            ],
            [
                16555,
                16620
            ],
            [
                16620,
                16688
            ],
            [
                16688,
                16744
            ],
            [
                16744,
                16757
            ],
            [
                16757,
                16840
            ],
            [
                16840,
                16847
            ],
            [
                16847,
                16958
            ],
            [
                16958,
                17023
            ],
            [
                17023,
                17070
            ],
            [
                17070,
                17148
            ],
            [
                17148,
                17208
            ],
            [
                17208,
                17250
            ],
            [
                17250,
                17280
            ],
            [
                17280,
                17334
            ],
            [
                17334,
                17358
            ],
            [
                17358,
                17538
            ],
            [
                17538,
                17673
            ],
            [
                17673,
                17842
            ],
            [
                17842,
                17865
            ],
            [
                17865,
                17918
            ],
            [
                17918,
                18038
            ],
            [
                18038,
                18069
            ],
            [
                18069,
                18092
            ],
            [
                18092,
                18287
            ],
            [
                18287,
                18319
            ],
            [
                18319,
                18395
            ],
            [
                18395,
                18505
            ],
            [
                18505,
                18522
            ],
            [
                18522,
                18646
            ],
            [
                18646,
                18954
            ],
            [
                18954,
                18992
            ],
            [
                18992,
                19018
            ],
            [
                19018,
                19053
            ],
            [
                19053,
                19120
            ],
            [
                19120,
                19196
            ],
            [
                19196,
                19226
            ],
            [
                19226,
                19275
            ],
            [
                19275,
                19294
            ],
            [
                19294,
                19423
            ],
            [
                19423,
                19451
            ],
            [
                19451,
                19486
            ],
            [
                19486,
                19568
            ],
            [
                19568,
                19718
            ],
            [
                19718,
                19886
            ],
            [
                19886,
                20124
            ],
            [
                20124,
                20384
            ],
            [
                20384,
                20632
            ],
            [
                20632,
                20673
            ],
            [
                20673,
                20729
            ],
            [
                20729,
                20745
            ],
            [
                20745,
                20796
            ],
            [
                20796,
                20855
            ],
            [
                20855,
                20931
            ],
            [
                20931,
                20963
            ],
            [
                20963,
                21057
            ],
            [
                21057,
                21224
            ],
            [
                21224,
                21246
            ],
            [
                21246,
                21308
            ],
            [
                21308,
                21418
            ],
            [
                21418,
                21464
            ],
            [
                21464,
                21471
            ],
            [
                21471,
                21571
            ],
            [
                21571,
                21718
            ],
            [
                21718,
                21786
            ],
            [
                21786,
                21856
            ],
            [
                21856,
                21943
            ],
            [
                21943,
                21975
            ],
            [
                21975,
                22013
            ],
            [
                22013,
                22026
            ],
            [
                22026,
                22098
            ],
            [
                22098,
                22356
            ],
            [
                22356,
                22361
            ],
            [
                22361,
                22425
            ],
            [
                22425,
                22564
            ],
            [
                22564,
                22761
            ],
            [
                22761,
                22882
            ],
            [
                22882,
                23066
            ],
            [
                23066,
                23145
            ],
            [
                23145,
                23156
            ],
            [
                23156,
                23227
            ],
            [
                23227,
                23390
            ],
            [
                23390,
                23501
            ],
            [
                23501,
                23553
            ],
            [
                23553,
                23610
            ],
            [
                23610,
                23666
            ],
            [
                23666,
                23749
            ],
            [
                23749,
                23780
            ],
            [
                23780,
                23847
            ],
            [
                23847,
                23870
            ],
            [
                23870,
                23939
            ],
            [
                23939,
                24072
            ],
            [
                24072,
                24285
            ],
            [
                24285,
                24369
            ],
            [
                24369,
                24387
            ],
            [
                24387,
                24448
            ],
            [
                24448,
                24476
            ],
            [
                24476,
                24542
            ],
            [
                24542,
                24553
            ],
            [
                24553,
                24578
            ],
            [
                24578,
                24711
            ],
            [
                24711,
                24739
            ],
            [
                24739,
                24898
            ],
            [
                24898,
                24920
            ],
            [
                24920,
                24969
            ],
            [
                24969,
                25082
            ],
            [
                25082,
                25319
            ],
            [
                25319,
                25382
            ],
            [
                25382,
                25410
            ],
            [
                25410,
                25462
            ],
            [
                25462,
                25501
            ],
            [
                25501,
                25522
            ],
            [
                25522,
                25602
            ],
            [
                25602,
                25788
            ],
            [
                25788,
                25988
            ],
            [
                25988,
                26057
            ],
            [
                26057,
                26268
            ],
            [
                26268,
                26495
            ],
            [
                26495,
                26587
            ],
            [
                26587,
                26724
            ],
            [
                26724,
                26980
            ],
            [
                26980,
                27177
            ],
            [
                27177,
                27304
            ],
            [
                27304,
                27569
            ],
            [
                27569,
                27841
            ],
            [
                27841,
                28008
            ],
            [
                28008,
                28341
            ]
        ],
        "overlap_chars": [
            [
                221,
                293
            ],
            [
                354,
                382
            ],
            [
                395,
                399
            ],
            [
                400,
                404
            ],
            [
                434,
                444
            ],
            [
                457,
                459
            ],
            [
                459,
                461
            ],
            [
                690,
                737
            ],
            [
                505,
                506
            ],
            [
                467,
                470
            ],
            [
                661,
                664
            ],
            [
                545,
                546
            ],
            [
                740,
                788
            ],
            [
                788,
                798
            ],
            [
                816,
                896
            ],
            [
                900,
                933
            ],
            [
                935,
                984
            ],
            [
                984,
                1021
            ],
            [
                1053,
                1062
            ],
            [
                1067,
                1136
            ],
            [
                1136,
                1155
            ],
            [
                1168,
                1173
            ],
            [
                1177,
                1215
            ],
            [
                1219,
                1227
            ],
            [
                1227,
                1265
            ],
            [
                1334,
                1359
            ],
            [
                1359,
                1389
            ],
            [
                1389,
                1406
            ],
            [
                1438,
                1449
            ],
            [
                1453,
                1521
            ],
            [
                1683,
                1684
            ],
            [
                1522,
                1566
            ],
            [
                1727,
                1742
            ],
            [
                1809,
                1813
            ],
            [
                1776,
                1803
            ],
            [
                1813,
                1815
            ],
            [
                1815,
                1835
            ],
            [
                1936,
                1941
            ],
            [
                1941,
                1947
            ],
            [
                1947,
                2036
            ],
            [
                2041,
                2107
            ],
            [
                2107,
                2164
            ],
            [
                2292,
                2325
            ],
            [
                2334,
                2342
            ],
            [
                2342,
                2344
            ],
            [
                2345,
                2405
            ],
            [
                2409,
                2462
            ],
            [
                2462,
                2538
            ],
            [
                2542,
                2546
            ],
            [
                2549,
                2563
            ],
            [
                2565,
                2568
            ],
            [
                2569,
                2590
            ],
            [
                2606,
                2608
            ],
            [
                2617,
                2666
            ],
            [
                2666,
                2731
            ],
            [
                2735,
                2784
            ],
            [
                2787,
                2802
            ],
            [
                2946,
                2973
            ],
            [
                3021,
                3023
            ],
            [
                3007,
                3017
            ],
            [
                3095,
                3100
            ],
            [
                3044,
                3047
            ],
            [
                3086,
                3094
            ],
            [
                3131,
                3133
            ],
            [
                3133,
                3157
            ],
            [
                3189,
                3209
            ],
            [
                3231,
                3247
            ],
            [
                3260,
                3263
            ],
            [
                3365,
                3367
            ],
            [
                3367,
                3400
            ],
            [
                3406,
                3420
            ],
            [
                3426,
                3445
            ],
            [
                3456,
                3474
            ],
            [
                3485,
                3498
            ],
            [
                3500,
                3542
            ],
            [
                3542,
                3706
            ],
            [
                3710,
                3751
            ],
            [
                3911,
                3912
            ],
            [
                3753,
                3761
            ],
            [
                3859,
                3862
            ],
            [
                3773,
                3799
            ],
            [
                3869,
                3872
            ],
            [
                3876,
                3911
            ],
            [
                3918,
                3933
            ],
            [
                4070,
                4071
            ],
            [
                4072,
                4151
            ],
            [
                4151,
                4172
            ],
            [
                4197,
                4226
            ],
            [
                4226,
                4316
            ],
            [
                4322,
                4332
            ],
            [
                4404,
                4410
            ],
            [
                4424,
                4473
            ],
            [
                4473,
                4483
            ],
            [
                4648,
                4651
            ],
            [
                4489,
                4497
            ],
            [
                4511,
                4516
            ],
            [
                4528,
                4554
            ],
            [
                4578,
                4579
            ],
            [
                4571,
                4575
            ],
            [
                4607,
                4614
            ],
            [
                4624,
                4634
            ],
            [
                4601,
                4602
            ],
            [
                4668,
                4717
            ],
            [
                4918,
                4928
            ],
            [
                4798,
                4865
            ],
            [
                4721,
                4733
            ],
            [
                4935,
                4945
            ],
            [
                4955,
                4987
            ],
            [
                5042,
                5043
            ],
            [
                5044,
                5051
            ],
            [
                5133,
                5137
            ],
            [
                5138,
                5233
            ],
            [
                5267,
                5315
            ],
            [
                5322,
                5340
            ],
            [
                5345,
                5378
            ],
            [
                5379,
                5407
            ],
            [
                5407,
                5437
            ],
            [
                5440,
                5457
            ],
            [
                5457,
                5517
            ],
            [
                5517,
                5646
            ],
            [
                5647,
                5663
            ],
            [
                5666,
                5680
            ],
            [
                5682,
                5707
            ],
            [
                5741,
                5809
            ],
            [
                6105,
                6160
            ],
            [
                6187,
                6226
            ],
            [
                6228,
                6247
            ],
            [
                6259,
                6297
            ],
            [
                6307,
                6332
            ],
            [
                6336,
                6355
            ],
            [
                6355,
                6458
            ],
            [
                6458,
                6484
            ],
            [
                6488,
                6497
            ],
            [
                6500,
                6563
            ],
            [
                6756,
                6758
            ],
            [
                6627,
                6692
            ],
            [
                6773,
                6775
            ],
            [
                6775,
                6816
            ],
            [
                6816,
                6861
            ],
            [
                6861,
                6937
            ],
            [
                6941,
                6980
            ],
            [
                7203,
                7249
            ],
            [
                7249,
                7281
            ],
            [
                7281,
                7304
            ],
            [
                7307,
                7332
            ],
            [
                7332,
                7345
            ],
            [
                7347,
                7368
            ],
            [
                7368,
                7389
            ],
            [
                7391,
                7392
            ],
            [
                7394,
                7404
            ],
            [
                7408,
                7417
            ],
            [
                7421,
                7428
            ],
            [
                7434,
                7444
            ],
            [
                7501,
                7514
            ],
            [
                7520,
                7533
            ],
            [
                7457,
                7492
            ],
            [
                7546,
                7548
            ],
            [
                7551,
                7565
            ],
            [
                7567,
                7610
            ],
            [
                7653,
                7687
            ],
            [
                7700,
                7761
            ],
            [
                7761,
                7763
            ],
            [
                7763,
                7860
            ],
            [
                7865,
                7874
            ],
            [
                7874,
                7924
            ],
            [
                7928,
                7949
            ],
            [
                7949,
                8063
            ],
            [
                8072,
                8093
            ],
            [
                8093,
                8167
            ],
            [
                8186,
                8205
            ],
            [
                8208,
                8276
            ],
            [
                8365,
                8367
            ],
            [
                8367,
                8383
            ],
            [
                8387,
                8391
            ],
            [
                8391,
                8430
            ],
            [
                8432,
                8454
            ],
            [
                8454,
                8578
            ],
            [
                8578,
                8618
            ],
            [
                8618,
                8644
            ],
            [
                8647,
                8659
            ],
            [
                8740,
                8770
            ],
            [
                8929,
                8935
            ],
            [
                8943,
                9018
            ],
            [
                9019,
                9061
            ],
            [
                9065,
                9084
            ],
            [
                9087,
                9109
            ],
            [
                9110,
                9114
            ],
            [
                9114,
                9171
            ],
            [
                9349,
                9357
            ],
            [
                9431,
                9432
            ],
            [
                9358,
                9431
            ],
            [
                9329,
                9347
            ],
            [
                9630,
                9702
            ],
            [
                9728,
                9760
            ],
            [
                9772,
                9847
            ],
            [
                9858,
                9883
            ],
            [
                9883,
                9920
            ],
            [
                9933,
                9973
            ],
            [
                10012,
                10024
            ],
            [
                10030,
                10032
            ],
            [
                10056,
                10068
            ],
            [
                10085,
                10133
            ],
            [
                10133,
                10250
            ],
            [
                10250,
                10308
            ],
            [
                10363,
                10415
            ],
            [
                10417,
                10468
            ],
            [
                10468,
                10503
            ],
            [
                10507,
                10622
            ],
            [
                10636,
                10638
            ],
            [
                10752,
                10826
            ],
            [
                10935,
                10938
            ],
            [
                10894,
                10906
            ],
            [
                10910,
                10924
            ],
            [
                10944,
                10979
            ],
            [
                10981,
                11017
            ],
            [
                11027,
                11039
            ],
            [
                11047,
                11165
            ],
            [
                11173,
                11186
            ],
            [
                11188,
                11202
            ],
            [
                11187,
                11188
            ],
            [
                11265,
                11312
            ],
            [
                11319,
                11344
            ],
            [
                11344,
                11369
            ],
            [
                11372,
                11401
            ],
            [
                11409,
                11411
            ],
            [
                11502,
                11575
            ],
            [
                11597,
                11633
            ],
            [
                11633,
                11706
            ],
            [
                11710,
                11730
            ],
            [
                11733,
                11748
            ],
            [
                11754,
                11807
            ],
            [
                11810,
                11948
            ],
            [
                11948,
                11984
            ],
            [
                12034,
                12035
            ],
            [
                12109,
                12142
            ],
            [
                12143,
                12227
            ],
            [
                12236,
                12239
            ],
            [
                12242,
                12257
            ],
            [
                12309,
                12310
            ],
            [
                12260,
                12309
            ],
            [
                12519,
                12546
            ],
            [
                12419,
                12427
            ],
            [
                12505,
                12507
            ],
            [
                12553,
                12569
            ],
            [
                12403,
                12417
            ],
            [
                12573,
                12609
            ],
            [
                12612,
                12641
            ],
            [
                12641,
                12705
            ],
            [
                12722,
                12773
            ],
            [
                12773,
                12788
            ],
            [
                12857,
                12858
            ],
            [
                12799,
                12822
            ],
            [
                12896,
                12897
            ],
            [
                12994,
                13008
            ],
            [
                13017,
                13022
            ],
            [
                12791,
                12792
            ],
            [
                13010,
                13014
            ],
            [
                13038,
                13123
            ],
            [
                13277,
                13279
            ],
            [
                13279,
                13282
            ],
            [
                13288,
                13324
            ],
            [
                13325,
                13379
            ],
            [
                13394,
                13415
            ],
            [
                13430,
                13447
            ],
            [
                13447,
                13520
            ],
            [
                13532,
                13540
            ],
            [
                13546,
                13580
            ],
            [
                13595,
                13601
            ],
            [
                13520,
                13521
            ],
            [
                13638,
                13732
            ],
            [
                13732,
                13735
            ],
            [
                13774,
                13853
            ],
            [
                14078,
                14105
            ],
            [
                14230,
                14232
            ],
            [
                14105,
                14215
            ],
            [
                14271,
                14273
            ],
            [
                14273,
                14307
            ],
            [
                14307,
                14310
            ],
            [
                14323,
                14360
            ],
            [
                14386,
                14428
            ],
            [
                14428,
                14553
            ],
            [
                14577,
                14588
            ],
            [
                14594,
                14613
            ],
            [
                14613,
                14683
            ],
            [
                14690,
                14787
            ],
            [
                14805,
                14834
            ],
            [
                14861,
                14866
            ],
            [
                14891,
                14896
            ],
            [
                14908,
                14966
            ],
            [
                14968,
                14977
            ],
            [
                14983,
                14988
            ],
            [
                15002,
                15005
            ],
            [
                14989,
                14991
            ],
            [
                14877,
                14880
            ],
            [
                14869,
                14871
            ],
            [
                15115,
                15124
            ],
            [
                15124,
                15130
            ],
            [
                15130,
                15156
            ],
            [
                15158,
                15165
            ],
            [
                15191,
                15192
            ],
            [
                15174,
                15180
            ],
            [
                15166,
                15173
            ],
            [
                15222,
                15241
            ],
            [
                15241,
                15244
            ],
            [
                15246,
                15253
            ],
            [
                15258,
                15325
            ],
            [
                15327,
                15394
            ],
            [
                15394,
                15405
            ],
            [
                15424,
                15428
            ],
            [
                15437,
                15508
            ],
            [
                15684,
                15733
            ],
            [
                15733,
                15821
            ],
            [
                15822,
                15866
            ],
            [
                15866,
                15879
            ],
            [
                15888,
                15908
            ],
            [
                15908,
                15936
            ],
            [
                15953,
                15971
            ],
            [
                15971,
                15997
            ],
            [
                16008,
                16014
            ],
            [
                16020,
                16075
            ],
            [
                16079,
                16097
            ],
            [
                16100,
                16128
            ],
            [
                16181,
                16183
            ],
            [
                16193,
                16223
            ],
            [
                16223,
                16274
            ],
            [
                16277,
                16294
            ],
            [
                16306,
                16311
            ],
            [
                16345,
                16347
            ],
            [
                16379,
                16410
            ],
            [
                16420,
                16426
            ],
            [
                16430,
                16436
            ],
            [
                16436,
                16495
            ],
            [
                16517,
                16543
            ],
            [
                16547,
                16552
            ],
            [
                16555,
                16569
            ],
            [
                16576,
                16584
            ],
            [
                16618,
                16620
            ],
            [
                16621,
                16642
            ],
            [
                16678,
                16688
            ],
            [
                16688,
                16715
            ],
            [
                16720,
                16744
            ],
            [
                16744,
                16757
            ],
            [
                16757,
                16763
            ],
            [
                16774,
                16837
            ],
            [
                16841,
                16847
            ],
            [
                16847,
                16862
            ],
            [
                16915,
                16958
            ],
            [
                16958,
                16978
            ],
            [
                16995,
                17010
            ],
            [
                17167,
                17206
            ],
            [
                17208,
                17247
            ],
            [
                17251,
                17280
            ],
            [
                17280,
                17315
            ],
            [
                17332,
                17334
            ],
            [
                17334,
                17358
            ],
            [
                17358,
                17361
            ],
            [
                17392,
                17411
            ],
            [
                17489,
                17493
            ],
            [
                17501,
                17507
            ],
            [
                17526,
                17528
            ],
            [
                17538,
                17673
            ],
            [
                17673,
                17681
            ],
            [
                17697,
                17710
            ],
            [
                17719,
                17727
            ],
            [
                17733,
                17735
            ],
            [
                17728,
                17732
            ],
            [
                17736,
                17770
            ],
            [
                17783,
                17806
            ],
            [
                17840,
                17842
            ],
            [
                17842,
                17861
            ],
            [
                17871,
                17918
            ],
            [
                17918,
                17946
            ],
            [
                17949,
                17962
            ],
            [
                17974,
                18006
            ],
            [
                18008,
                18038
            ],
            [
                18038,
                18069
            ],
            [
                18505,
                18522
            ],
            [
                18522,
                18547
            ],
            [
                18549,
                18622
            ],
            [
                18644,
                18646
            ],
            [
                18646,
                18652
            ],
            [
                18664,
                18671
            ],
            [
                18686,
                18693
            ],
            [
                18781,
                18784
            ],
            [
                18698,
                18779
            ],
            [
                18791,
                18816
            ],
            [
                18853,
                18878
            ],
            [
                18880,
                18906
            ],
            [
                18952,
                18954
            ],
            [
                18954,
                18992
            ],
            [
                18992,
                19009
            ],
            [
                19019,
                19024
            ],
            [
                19027,
                19053
            ],
            [
                19057,
                19087
            ],
            [
                19088,
                19100
            ],
            [
                19114,
                19120
            ],
            [
                19120,
                19143
            ],
            [
                19197,
                19220
            ],
            [
                19224,
                19226
            ],
            [
                19226,
                19275
            ],
            [
                19275,
                19292
            ],
            [
                19294,
                19390
            ],
            [
                19421,
                19423
            ],
            [
                19423,
                19451
            ],
            [
                19451,
                19483
            ],
            [
                19486,
                19524
            ],
            [
                19529,
                19539
            ],
            [
                19566,
                19568
            ],
            [
                19568,
                19591
            ],
            [
                19611,
                19631
            ],
            [
                19666,
                19718
            ],
            [
                19718,
                19738
            ],
            [
                19765,
                19772
            ],
            [
                19781,
                19796
            ],
            [
                19813,
                19886
            ],
            [
                19886,
                19971
            ],
            [
                19972,
                20022
            ],
            [
                20027,
                20054
            ],
            [
                20122,
                20124
            ],
            [
                20134,
                20162
            ],
            [
                20169,
                20187
            ],
            [
                20205,
                20277
            ],
            [
                20324,
                20384
            ],
            [
                20384,
                20495
            ],
            [
                20509,
                20545
            ],
            [
                20630,
                20632
            ],
            [
                20632,
                20673
            ],
            [
                20677,
                20691
            ],
            [
                20694,
                20702
            ],
            [
                20704,
                20729
            ],
            [
                20729,
                20745
            ],
            [
                20745,
                20772
            ],
            [
                20778,
                20796
            ],
            [
                20796,
                20835
            ],
            [
                20844,
                20855
            ],
            [
                20855,
                20931
            ],
            [
                20973,
                21057
            ],
            [
                21057,
                21188
            ],
            [
                21222,
                21224
            ],
            [
                21224,
                21246
            ],
            [
                21308,
                21415
            ],
            [
                21419,
                21430
            ],
            [
                21435,
                21445
            ],
            [
                21448,
                21464
            ],
            [
                21465,
                21471
            ],
            [
                21471,
                21557
            ],
            [
                21569,
                21571
            ],
            [
                21571,
                21616
            ],
            [
                21659,
                21718
            ],
            [
                21718,
                21733
            ],
            [
                21742,
                21786
            ],
            [
                21786,
                21808
            ],
            [
                21821,
                21853
            ],
            [
                21857,
                21870
            ],
            [
                21879,
                21943
            ],
            [
                21944,
                21962
            ],
            [
                21965,
                21975
            ],
            [
                22013,
                22023
            ],
            [
                22026,
                22067
            ],
            [
                22082,
                22098
            ],
            [
                22098,
                22117
            ],
            [
                22127,
                22186
            ],
            [
                22197,
                22218
            ],
            [
                22223,
                22239
            ],
            [
                22279,
                22345
            ],
            [
                22354,
                22356
            ],
            [
                22356,
                22361
            ],
            [
                22361,
                22380
            ],
            [
                22423,
                22425
            ],
            [
                22425,
                22465
            ],
            [
                22466,
                22501
            ],
            [
                22562,
                22564
            ],
            [
                22564,
                22567
            ],
            [
                22575,
                22580
            ],
            [
                22595,
                22640
            ],
            [
                22647,
                22673
            ],
            [
                22702,
                22761
            ],
            [
                22765,
                22794
            ],
            [
                22805,
                22814
            ],
            [
                22825,
                22882
            ],
            [
                22882,
                22888
            ],
            [
                22899,
                22902
            ],
            [
                22988,
                23009
            ],
            [
                23015,
                23018
            ],
            [
                23053,
                23066
            ],
            [
                23066,
                23086
            ],
            [
                23088,
                23099
            ],
            [
                23125,
                23145
            ],
            [
                23150,
                23156
            ],
            [
                23156,
                23224
            ],
            [
                23390,
                23437
            ],
            [
                23443,
                23501
            ],
            [
                23502,
                23516
            ],
            [
                23518,
                23520
            ],
            [
                23522,
                23550
            ],
            [
                23553,
                23610
            ],
            [
                23666,
                23749
            ],
            [
                23749,
                23777
            ],
            [
                23814,
                23829
            ],
            [
                23830,
                23839
            ],
            [
                23841,
                23844
            ],
            [
                23848,
                23867
            ],
            [
                23870,
                23881
            ],
            [
                23920,
                23931
            ],
            [
                23933,
                23936
            ],
            [
                23939,
                24012
            ],
            [
                24018,
                24038
            ],
            [
                24066,
                24072
            ],
            [
                24073,
                24083
            ],
            [
                24114,
                24141
            ],
            [
                24147,
                24182
            ],
            [
                24250,
                24285
            ],
            [
                24285,
                24359
            ],
            [
                24365,
                24369
            ],
            [
                24369,
                24384
            ],
            [
                24387,
                24390
            ],
            [
                24396,
                24407
            ],
            [
                24414,
                24448
            ],
            [
                24449,
                24450
            ],
            [
                24452,
                24476
            ],
            [
                24476,
                24515
            ],
            [
                24517,
                24538
            ],
            [
                24553,
                24555
            ],
            [
                24556,
                24575
            ],
            [
                24593,
                24617
            ],
            [
                24649,
                24711
            ],
            [
                24711,
                24739
            ],
            [
                24791,
                24797
            ],
            [
                24812,
                24830
            ],
            [
                24785,
                24786
            ],
            [
                24852,
                24861
            ],
            [
                24867,
                24898
            ],
            [
                24898,
                24917
            ],
            [
                24920,
                24940
            ],
            [
                24951,
                24969
            ],
            [
                24969,
                24995
            ],
            [
                25001,
                25003
            ],
            [
                25025,
                25033
            ],
            [
                25041,
                25082
            ],
            [
                25082,
                25127
            ],
            [
                25150,
                25275
            ],
            [
                25283,
                25319
            ],
            [
                25346,
                25382
            ],
            [
                25410,
                25462
            ],
            [
                25462,
                25501
            ],
            [
                25501,
                25522
            ],
            [
                25522,
                25540
            ],
            [
                25542,
                25599
            ],
            [
                25603,
                25621
            ],
            [
                25624,
                25698
            ],
            [
                25700,
                25707
            ],
            [
                25721,
                25724
            ],
            [
                25749,
                25788
            ],
            [
                25788,
                25808
            ],
            [
                25862,
                25887
            ],
            [
                25943,
                25945
            ],
            [
                25812,
                25861
            ],
            [
                25889,
                25928
            ],
            [
                25933,
                25941
            ],
            [
                25952,
                25985
            ],
            [
                25989,
                26018
            ],
            [
                26062,
                26086
            ],
            [
                26089,
                26105
            ],
            [
                26112,
                26188
            ],
            [
                26197,
                26236
            ],
            [
                26243,
                26248
            ],
            [
                26266,
                26268
            ],
            [
                26382,
                26495
            ],
            [
                26495,
                26574
            ],
            [
                26575,
                26584
            ],
            [
                26587,
                26621
            ],
            [
                26637,
                26681
            ],
            [
                26691,
                26710
            ],
            [
                26722,
                26724
            ],
            [
                26724,
                26749
            ],
            [
                26782,
                26790
            ],
            [
                26794,
                26819
            ],
            [
                26836,
                26889
            ],
            [
                26919,
                26960
            ],
            [
                26973,
                26980
            ],
            [
                27025,
                27035
            ],
            [
                26991,
                26994
            ],
            [
                27100,
                27113
            ],
            [
                27041,
                27045
            ],
            [
                27139,
                27151
            ],
            [
                27175,
                27177
            ],
            [
                27177,
                27199
            ],
            [
                27250,
                27252
            ],
            [
                27294,
                27304
            ],
            [
                27304,
                27340
            ],
            [
                27369,
                27448
            ],
            [
                27484,
                27545
            ],
            [
                27567,
                27568
            ],
            [
                27569,
                27582
            ],
            [
                27593,
                27605
            ],
            [
                27661,
                27662
            ],
            [
                27668,
                27672
            ],
            [
                27682,
                27697
            ],
            [
                27711,
                27714
            ],
            [
                27804,
                27815
            ],
            [
                27821,
                27841
            ],
            [
                27841,
                27852
            ],
            [
                27916,
                27940
            ],
            [
                27946,
                27954
            ],
            [
                27968,
                27986
            ],
            [
                27997,
                28008
            ],
            [
                28008,
                28066
            ],
            [
                28094,
                28155
            ],
            [
                28236,
                28322
            ],
            [
                28336,
                28341
            ]
        ],
        "row_chars": [
            [
                0,
                214
            ],
            [
                214,
                221
            ],
            [
                221,
                459
            ],
            [
                459,
                739
            ],
            [
                739,
                788
            ],
            [
                788,
                899
            ],
            [
                899,
                935
            ],
            [
                935,
                984
            ],
            [
                984,
                1066
            ],
            [
                1066,
                1136
            ],
            [
                1136,
                1218
            ],
            [
                1218,
                1227
            ],
            [
                1227,
                1265
            ],
            [
                1265,
                1334
            ],
            [
                1334,
                1359
            ],
            [
                1359,
                1389
            ],
            [
                1389,
                1452
            ],
            [
                1452,
                1742
            ],
            [
                1742,
                1771
            ],
            [
                1771,
                1815
            ],
            [
                1815,
                1941
            ],
            [
                1941,
                1947
            ],
            [
                1947,
                2039
            ],
            [
                2039,
                2107
            ],
            [
                2107,
                2167
            ],
            [
                2167,
                2204
            ],
            [
                2204,
                2291
            ],
            [
                2291,
                2328
            ],
            [
                2328,
                2344
            ],
            [
                2344,
                2408
            ],
            [
                2408,
                2462
            ],
            [
                2462,
                2541
            ],
            [
                2541,
                2549
            ],
            [
                2549,
                2666
            ],
            [
                2666,
                2734
            ],
            [
                2734,
                2802
            ],
            [
                2802,
                2841
            ],
            [
                2841,
                2872
            ],
            [
                2872,
                2902
            ],
            [
                2902,
                2921
            ],
            [
                2921,
                2946
            ],
            [
                2946,
                3133
            ],
            [
                3133,
                3367
            ],
            [
                3367,
                3542
            ],
            [
                3542,
                3706
            ],
            [
                3706,
                4072
            ],
            [
                4072,
                4151
            ],
            [
                4151,
                4226
            ],
            [
                4226,
                4473
            ],
            [
                4473,
                4717
            ],
            [
                4717,
                5044
            ],
            [
                5044,
                5233
            ],
            [
                5233,
                5378
            ],
            [
                5378,
                5407
            ],
            [
                5407,
                5440
            ],
            [
                5440,
                5457
            ],
            [
                5457,
                5517
            ],
            [
                5517,
                5646
            ],
            [
                5646,
                5812
            ],
            [
                5812,
                5909
            ],
            [
                5909,
                5983
            ],
            [
                5983,
                6069
            ],
            [
                6069,
                6104
            ],
            [
                6104,
                6335
            ],
            [
                6335,
                6355
            ],
            [
                6355,
                6458
            ],
            [
                6458,
                6487
            ],
            [
                6487,
                6619
            ],
            [
                6619,
                6775
            ],
            [
                6775,
                6816
            ],
            [
                6816,
                6861
            ],
            [
                6861,
                6940
            ],
            [
                6940,
                6983
            ],
            [
                6983,
                7105
            ],
            [
                7105,
                7164
            ],
            [
                7164,
                7171
            ],
            [
                7171,
                7249
            ],
            [
                7249,
                7281
            ],
            [
                7281,
                7307
            ],
            [
                7307,
                7332
            ],
            [
                7332,
                7368
            ],
            [
                7368,
                7407
            ],
            [
                7407,
                7420
            ],
            [
                7420,
                7444
            ],
            [
                7444,
                7545
            ],
            [
                7545,
                7551
            ],
            [
                7551,
                7610
            ],
            [
                7610,
                7699
            ],
            [
                7699,
                7763
            ],
            [
                7763,
                7874
            ],
            [
                7874,
                7927
            ],
            [
                7927,
                7949
            ],
            [
                7949,
                8066
            ],
            [
                8066,
                8093
            ],
            [
                8093,
                8208
            ],
            [
                8208,
                8367
            ],
            [
                8367,
                8386
            ],
            [
                8386,
                8391
            ],
            [
                8391,
                8454
            ],
            [
                8454,
                8578
            ],
            [
                8578,
                8618
            ],
            [
                8618,
                8647
            ],
            [
                8647,
                8770
            ],
            [
                8770,
                9018
            ],
            [
                9018,
                9064
            ],
            [
                9064,
                9087
            ],
            [
                9087,
                9109
            ],
            [
                9109,
                9114
            ],
            [
                9114,
                9174
            ],
            [
                9174,
                9237
            ],
            [
                9237,
                9306
            ],
            [
                9306,
                9564
            ],
            [
                9564,
                9626
            ],
            [
                9626,
                9883
            ],
            [
                9883,
                10032
            ],
            [
                10032,
                10133
            ],
            [
                10133,
                10250
            ],
            [
                10250,
                10311
            ],
            [
                10311,
                10363
            ],
            [
                10363,
                10468
            ],
            [
                10468,
                10506
            ],
            [
                10506,
                10638
            ],
            [
                10638,
                10711
            ],
            [
                10711,
                11039
            ],
            [
                11039,
                11047
            ],
            [
                11047,
                11206
            ],
            [
                11206,
                11265
            ],
            [
                11265,
                11344
            ],
            [
                11344,
                11372
            ],
            [
                11372,
                11411
            ],
            [
                11411,
                11633
            ],
            [
                11633,
                11709
            ],
            [
                11709,
                11733
            ],
            [
                11733,
                11748
            ],
            [
                11748,
                11810
            ],
            [
                11810,
                11948
            ],
            [
                11948,
                12142
            ],
            [
                12142,
                12230
            ],
            [
                12230,
                12242
            ],
            [
                12242,
                12311
            ],
            [
                12311,
                12342
            ],
            [
                12342,
                12373
            ],
            [
                12373,
                12572
            ],
            [
                12572,
                12612
            ],
            [
                12612,
                12641
            ],
            [
                12641,
                12705
            ],
            [
                12705,
                12718
            ],
            [
                12718,
                12773
            ],
            [
                12773,
                13279
            ],
            [
                13279,
                13325
            ],
            [
                13325,
                13447
            ],
            [
                13447,
                13732
            ],
            [
                13732,
                13854
            ],
            [
                13854,
                14078
            ],
            [
                14078,
                14273
            ],
            [
                14273,
                14307
            ],
            [
                14307,
                14428
            ],
            [
                14428,
                14613
            ],
            [
                14613,
                14788
            ],
            [
                14788,
                14866
            ],
            [
                14866,
                15124
            ],
            [
                15124,
                15130
            ],
            [
                15130,
                15241
            ],
            [
                15241,
                15394
            ],
            [
                15394,
                15508
            ],
            [
                15508,
                15583
            ],
            [
                15583,
                15733
            ],
            [
                15733,
                15821
            ],
            [
                15821,
                15866
            ],
            [
                15866,
                15908
            ],
            [
                15908,
                15971
            ],
            [
                15971,
                16078
            ],
            [
                16078,
                16183
            ],
            [
                16183,
                16223
            ],
            [
                16223,
                16277
            ],
            [
                16277,
                16347
            ],
            [
                16347,
                16429
            ],
            [
                16429,
                16436
            ],
            [
                16436,
                16546
            ],
            [
                16546,
                16555
            ],
            [
                16555,
                16620
            ],
            [
                16620,
                16688
            ],
            [
                16688,
                16744
            ],
            [
                16744,
                16757
            ],
            [
                16757,
                16840
            ],
            [
                16840,
                16847
            ],
            [
                16847,
                16958
            ],
            [
                16958,
                17023
            ],
            [
                17023,
                17070
            ],
            [
                17070,
                17148
            ],
            [
                17148,
                17208
            ],
            [
                17208,
                17250
            ],
            [
                17250,
                17280
            ],
            [
                17280,
                17334
            ],
            [
                17334,
                17358
            ],
            [
                17358,
                17538
            ],
            [
                17538,
                17673
            ],
            [
                17673,
                17842
            ],
            [
                17842,
                17865
            ],
            [
                17865,
                17918
            ],
            [
                17918,
                18038
            ],
            [
                18038,
                18069
            ],
            [
                18069,
                18092
            ],
            [
                18092,
                18287
            ],
            [
                18287,
                18319
            ],
            [
                18319,
                18395
            ],
            [
                18395,
                18505
            ],
            [
                18505,
                18522
            ],
            [
                18522,
                18646
            ],
            [
                18646,
                18954
            ],
            [
                18954,
                18992
            ],
            [
                18992,
                19018
            ],
            [
                19018,
                19053
            ],
            [
                19053,
                19120
            ],
            [
                19120,
                19196
            ],
            [
                19196,
                19226
            ],
            [
                19226,
                19275
            ],
            [
                19275,
                19294
            ],
            [
                19294,
                19423
            ],
            [
                19423,
                19451
            ],
            [
                19451,
                19486
            ],
            [
                19486,
                19568
            ],
            [
                19568,
                19718
            ],
            [
                19718,
                19886
            ],
            [
                19886,
                20124
            ],
            [
                20124,
                20384
            ],
            [
                20384,
                20632
            ],
            [
                20632,
                20673
            ],
            [
                20673,
                20729
            ],
            [
                20729,
                20745
            ],
            [
                20745,
                20796
            ],
            [
                20796,
                20855
            ],
            [
                20855,
                20931
            ],
            [
                20931,
                20963
            ],
            [
                20963,
                21057
            ],
            [
                21057,
                21224
            ],
            [
                21224,
                21246
            ],
            [
                21246,
                21308
            ],
            [
                21308,
                21418
            ],
            [
                21418,
                21464
            ],
            [
                21464,
                21471
            ],
            [
                21471,
                21571
            ],
            [
                21571,
                21718
            ],
            [
                21718,
                21786
            ],
            [
                21786,
                21856
            ],
            [
                21856,
                21943
            ],
            [
                21943,
                21975
            ],
            [
                21975,
                22013
            ],
            [
                22013,
                22026
            ],
            [
                22026,
                22098
            ],
            [
                22098,
                22356
            ],
            [
                22356,
                22361
            ],
            [
                22361,
                22425
            ],
            [
                22425,
                22564
            ],
            [
                22564,
                22761
            ],
            [
                22761,
                22882
            ],
            [
                22882,
                23066
            ],
            [
                23066,
                23145
            ],
            [
                23145,
                23156
            ],
            [
                23156,
                23227
            ],
            [
                23227,
                23390
            ],
            [
                23390,
                23501
            ],
            [
                23501,
                23553
            ],
            [
                23553,
                23610
            ],
            [
                23610,
                23666
            ],
            [
                23666,
                23749
            ],
            [
                23749,
                23780
            ],
            [
                23780,
                23847
            ],
            [
                23847,
                23870
            ],
            [
                23870,
                23939
            ],
            [
                23939,
                24072
            ],
            [
                24072,
                24285
            ],
            [
                24285,
                24369
            ],
            [
                24369,
                24387
            ],
            [
                24387,
                24448
            ],
            [
                24448,
                24476
            ],
            [
                24476,
                24542
            ],
            [
                24542,
                24553
            ],
            [
                24553,
                24578
            ],
            [
                24578,
                24711
            ],
            [
                24711,
                24739
            ],
            [
                24739,
                24898
            ],
            [
                24898,
                24920
            ],
            [
                24920,
                24969
            ],
            [
                24969,
                25082
            ],
            [
                25082,
                25319
            ],
            [
                25319,
                25382
            ],
            [
                25382,
                25410
            ],
            [
                25410,
                25462
            ],
            [
                25462,
                25501
            ],
            [
                25501,
                25522
            ],
            [
                25522,
                25602
            ],
            [
                25602,
                25788
            ],
            [
                25788,
                25988
            ],
            [
                25988,
                26057
            ],
            [
                26057,
                26268
            ],
            [
                26268,
                26495
            ],
            [
                26495,
                26587
            ],
            [
                26587,
                26724
            ],
            [
                26724,
                26980
            ],
            [
                26980,
                27177
            ],
            [
                27177,
                27304
            ],
            [
                27304,
                27569
            ],
            [
                27569,
                27841
            ],
            [
                27841,
                28008
            ],
            [
                28008,
                28341
            ]
        ]
    },
    "abridged": {
        "text": "Margaret had not expected much pleasure to herself from Mr. Bell's visit; but when her godfather came, they fell naturally into friendship. He seemed fresh and young under his Fellow's cap and gown, as she told him:\n'Fresh and young in warmth and kindness, I mean. I'm afraid I think your opinions are the oldest and mustiest I have met with this long time.'\n'Hear this daughter of yours, Hale. Her residence in Milton has quite corrupted her. She's a democrat, a red republican, a socialist-'\n'Papa, it's all because I'm standing up for the progress of commerce. Mr. Bell would have us still exchanging wild-beast skins for acorns.'\n'No, no. I'd dig the ground and grow potatoes. Don't exaggerate, missy. But I'm tired of this bustle. Everybody rushing to get rich.'\n'It is not everyone who can sit comfortably in a set of college rooms, and let his riches grow without any exertion,' said Mr. Hale.\n'The men here like the bustle and the struggle. As for sitting still - Why! Pooh! I don't believe there's a man in Milton who knows how to sit still; and it is a great art.'\n'Milton people, I suspect, think Oxford men don't know how to move. It would be a very good thing if they mixed a little more.'\n'Are you not a Milton man yourself?' Margaret asked Mr. Bell. 'I should have thought you would have been proud of your town.'\n'I confess, I don't see what there is to be proud of. If you'll only come to Oxford, Margaret, I will show you a place to glory in.'\n'Well!' said Mr. Hale, 'Mr. Thornton is coming to see us tonight, and he is as proud of Milton as you of Oxford. You two must try and make each other a little more liberal-minded.'\n'I don't want to be more liberal-minded, thank you,' said Mr. Bell.\nMr. Thornton had determined not to ask his mother about her interview with Margaret. He felt pretty sure that his mother's account would only annoy him. He shrank from hearing Margaret's name mentioned. While he blamed her - was jealous of her - renounced her - he loved her sorely, in spite of himself. He dreamt of her; he dreamt she came dancing towards him with outspread arms, and with a lightness and gaiety which made him loathe her, even while it allured him. The impression of this figure of Margaret, with all her character taken out of it, was deeply stamped upon his imagination when he wakened.\nYet he was too proud to acknowledge his weakness by avoiding the sight of her. He would neither seek to be in her company nor avoid it. To convince himself of his power of self-control, he lingered over every piece of business that afternoon; so it was past eight o'clock before he reached Mr. Hale's. Then there was business to be discussed in the study with Mr. Bell, who kept talking long after it was done, when they might just as well have gone upstairs. Mr. Thornton chafed, and thought Mr. Bell a most prosy companion; while Mr. Bell considered Mr. Thornton as brusque a fellow as he had ever met with.\nAt last they went upstairs, and found Margaret with a letter open before her, eagerly discussing its contents with her father. It was immediately put aside; but Mr. Thornton's keen senses caught some words of Mr. Hale's to Mr. Bell.\n'A letter from Henry Lennox. It makes Margaret very hopeful.'\nMr. Bell nodded. Margaret was red as a rose when Mr. Thornton looked at her. He had the greatest mind in the world to get up and go out of the room that very instant, and never set foot in the house again.\n'We were thinking,' said Mr. Hale, 'that you and Mr. Thornton were each trying to convert the other, you were so long in the study. Mr. Thornton, we were accusing Mr. Bell this morning of bigotry against his native town; and we - Margaret, I believe - suggested that it would do him good to associate with Milton manufacturers.'\n'I beg your pardon. Margaret thought it would do the Milton manufacturers good to associate a little more with Oxford men. Now wasn't it so, Margaret?'\n'I believe we thought it would do both good to see a little more of the other.'\n'So you see, Mr. Thornton, we ought to have been improving each other downstairs. However, I am willing to do my part now. I wonder when you Milton men intend to live. All your lives seem to be spent in gathering together the materials for life.'\n'By living, I suppose you mean enjoyment.'\n'Yes, enjoyment of the power and influence which money gives. You are all striving for money. What do you want it for?'\nMr. Thornton was silent. Then he said, 'I really don't know. But money is not what I strive for.'\n'What then?'\n'It is a personal question. I am not sure I am prepared to lay myself open to such a catechism.'\n'No!' said Mr. Hale; 'don't let us be personal in our catechism. You are each of you too individual to represent a city.'\n'I am not sure whether to consider that as a compliment or not,' said Mr. Bell. 'I should like to be the representative of Oxford, with its beauty and its learning, and its proud history. What do you say, Margaret; ought I to be flattered?'\n'I don't know Oxford. But there is a difference between being the representative of a city and the representative man of its inhabitants.'\n'Very true, Miss Margaret. Now I remember, you were against me this morning, and were quite Miltonian in your preferences.' Margaret saw the quick glance of surprise that Mr. Thornton gave her. Mr. Bell went on-\n'Ah! I wish I could show you our High Street - our Radcliffe Square. I am leaving out our colleges, just as I give Mr. Thornton leave to omit his factories in speaking of the charms of Milton. I have a right to abuse my birth-place. Remember I am a Milton man.'\nMr. Thornton was not in a mood for joking. He was annoyed enough to attempt to defend what was never meant to be seriously attacked.\n'I don't set up Milton as a model of a town.'\n'Not in architecture?' slyly asked Mr. Bell.\n'No! We've been too busy to attend to mere outward appearances. Remember, we are of a different race from the Greeks, to whom beauty was everything,' said Mr. Thornton. 'I belong to Teutonic blood; it is little mingled in this part of England. We retain much of their language, and more of their spirit; we do not look upon life as a time for enjoyment, but for action and exertion. Our glory and our beauty arise out of inward strength, which makes us victorious over difficulties. And in Darkshire, we hate to have laws made for us at a distance. We wish people would allow us to right ourselves, instead of continually meddling, with their imperfect legislation. We stand up for self-government, and oppose centralisation.'\n'Well, at any rate, I revoke what I said this morning - that you Milton people did not reverence the past. You are regular worshippers of Thor.'\n'If we do not reverence the past as you do in Oxford, it is because we want something which can apply to the present. It would be finer if the words of experience could direct us how to act in the difficulties that must be encountered. The way in which they are met and conquered - not merely pushed aside for the time - decides our future. Some people can speak of Utopia much more easily than of the next day's duty; and yet when that duty is all done by others, they are ready to cry, \"Fie, for shame!\"'\n'Would you Milton men condescend to send up your today's difficulty to Oxford? You have not tried us yet.'\nMr. Thornton laughed outright. 'I was thinking of the strikes we have gone through, which are troublesome enough, as I am finding to my cost. And yet this last strike, under which I am smarting, has been respectable.'\n'A respectable strike!' said Mr. Bell. 'That sounds as if you were far gone in the worship of Thor.'\nMargaret felt, rather than saw, that Mr. Thornton was chagrined by the repeated turning into jest of what he was feeling as very serious. She tried to change the conversation, and forced herself to say something.\n'Edith says she finds the printed calicoes in Corfu better and cheaper than in London.'\n'Does she?' said her father. 'I think that must be one of Edith's exaggerations.'\n'I don't believe a cousin of Margaret's could exaggerate,' said Mr. Bell.\n'Is Miss Hale so remarkable for truth?' said Mr. Thornton, bitterly. The moment he had done so, he could have bitten his tongue out. Why should he stab her with her shame in this way? How evil he was tonight; possessed by ill-humour, unable to cope light-heartedly with one who was trying, by gay and careless speeches, to make the evening pass pleasantly. And to speak to Margaret as he had done!\nShe did not get up and leave the room, as she had done formerly, when his abruptness had annoyed her. She sat quite still, after the first momentary glance of grieved surprise. Her eyes looked like some child's who has met with a rebuff, full of reproachful sadness; and then they fell, and she bent over her work, and did not speak again. But he saw a sigh tremble over her body, as if she quivered in some unwonted chill.\nHe gave short sharp answers to the others; he was uneasy and cross, unable to discern between jest and earnest; anxious only for a look, a word of hers. But she neither looked nor spoke. Her tapered fingers flew in and out of her sewing as if that were the business of her life. She could not care for him, he thought, or else the passionate fervour of his wish would have forced her to raise those eyes, to read the repentance in his. He could have struck her before he left, in order that by some strange act of rudeness, he might earn the privilege of telling her the remorse that gnawed at his heart.\nThe long walk in the open air sobered him. He gravely resolved that henceforth he would see as little of her as possible, since the sight and sound of her threw him so off-balance. Well! He had known what love was - a sharp, fierce pang, a fire through which he was struggling! but through that furnace he would fight his way out into the serenity of middle age, all the richer and more human for having known this great passion.\nWhen he had left, Margaret rose from her seat, and began silently to fold up her work. She looked like one who had gone through a day of great fatigue. As the three prepared for bed, Mr. Bell muttered a little condemnation of Mr. Thornton.\n'I never saw a fellow so spoiled by success. He can't bear a jest of any kind. Everything seems to touch on his high dignity. Formerly, he was as simple as the day; you could not offend him, because he had no vanity.'\n'He is not vain now,' said Margaret, turning round. 'Tonight he has not been like himself. Something must have annoyed him before he came here.'\nMr. Bell gave her a sharp glance. After she had left the room, he asked,\n'Hale! did it ever strike you that Thornton and your daughter have a tendresse for each other?'\n'Never!' said Mr. Hale, startled. 'No, I am sure you are mistaken. If there is anything, it is on Mr. Thornton's side. Poor fellow! I hope he is not thinking of her, for I am sure she would not have him.'\n'Well! I'm a bachelor, so perhaps my opinion is not worth having. Or else I should say she showed some pretty symptoms!'\n'Margaret would never think of him, I'm sure! Such a thing has never entered her head.'\n'Entering her heart would do. But I merely threw out a suggestion. I dare say I was wrong. And I'm very sleepy; so I'll take myself off to bed.'\nBut Mr. Hale resolved that he would not be disturbed by any such nonsensical idea; so he lay awake, determining not to think about it.\nMr. Bell left the next day, telling Margaret to look on him as one who had a right to help her in all her troubles. To Mr. Hale he said:\n'That Margaret of yours has gone deep into my heart. Take care of her, for she is very precious - a great deal too good for Milton - only fit for Oxford, in fact. The town, I mean; not the men. Seriously, Hale! I wish you'd leave Milton, which is a most unsuitable place for you, though it was my recommendation. If you could swallow your doubts, you could take a college living; and you and Margaret should come and live at the parsonage - you as a sort of lay curate, and she to be our housekeeper - the village Lady Bountiful. I could be very happy in such a life. What do you think?'\n'Never!' said Mr. Hale, decidedly. 'My one great change has been made, and my price paid. Here I stay out my life.'\n'I don't give up my plan. Only I won't bait you with it any more just now. Where's the Pearl? Come, Margaret, give me a farewell kiss; and remember, my dear, where you may find a true friend. You are my child, Margaret. Remember that, and God bless you!'\nSo they fell back into the monotony of their quiet life. There was no invalid to care for; even the Higginses seemed to have receded from any need of immediate thought. The Boucher children claimed Margaret's care; and she went pretty often to see Mary Higgins, who had charge of them. The two families were living in one house: the elder children were at humble schools, while the younger ones were tended, in Mary's absence at work, by the kind neighbour. She was paid for her trouble. Indeed, in all his arrangements for these orphan children, Nicholas showed a sober judgment at variance with his former more eccentric jerks of action. He was so steady at his work, that Margaret did not often see him during these winter months; but when she did, he winced away from any reference to Boucher. He did not speak easily of Mr. Thornton.\n'To tell the truth,' said he, 'he fairly bamboozles me. He's two chaps. One chap I knowed of old as measter all o'er. T'other chap hasn't an ounce of measter about him. How them two chaps is bound up in one body, is a craddy for me to find out. He comes here pretty often; that's how I know the chap that's a man, not a measter. And I reckon he's taken aback by me pretty much as I am by him; for he sits and listens and stares, as if I were some strange beast. But I'm none daunted. And I tell him some of my mind that I reckon he'd ha' been the better of hearing when he were a younger man.'\n'And does he answer you?' asked Mr. Hale.\n'Well! I'll not say th' advantage is all on his side, for all I take credit for improving him. Sometimes he says a rough thing or two, which has a queer smack o' truth in it when yo' come to chew it. He'll be coming tonight, I reckon, about them childer's schooling. He's not satisfied wi' it, and wants for t' examine 'em.'\n'What are they-' began Mr. Hale; but Margaret, touching his arm, showed him her watch.\n'It is nearly seven,' she said. 'Come, papa.' She did not breathe freely till they were away from the house. Then, as she became calmer, she wished that she had not been in so great a hurry; for they saw Mr. Thornton very seldom now; and for the old friendship's sake she should like to have seen him tonight.\nYes! he came very seldom. Mr. Hale was disappointed in his pupil's sudden lukewarmness about Greek literature. And often a hurried note from Mr. Thornton would arrive at the last moment, saying that he could not come to read with Mr. Hale that evening. Though other pupils had taken his place, no one was like his first scholar in Mr. Hale's heart. He was saddened, and used to sit pondering the reasons for this change.\nHe startled Margaret one evening by suddenly asking:\n'Margaret! had you ever any reason for thinking that Mr. Thornton cared for you?'\nMargaret did not answer immediately; but by the drooping of her head, he guessed what her reply would be.\n'Yes; I believe - oh papa, I should have told you.' And she dropped her work, and hid her face in her hands.\n'No, dear; I am sure you would have told me if you had felt that you could return his regard. Did he speak to you about it?'\nA little gentle, reluctant 'Yes.'\n'And you refused him?'\nA long sigh; and another 'Yes.' But before her father could speak, Margaret lifted up her face, rosy with beautiful shame, and said:\n'Now, papa, I cannot tell you more; and the whole thing is so painful to me that I cannot bear to think of it. Oh, papa, I am sorry to have lost you this friend, but I could not help it. Oh! I am very sorry.' She sat down on the floor, and laid her head on his knees.\n'I too, am sorry, my dear. Mr. Bell quite startled me when he said some idea of the kind-'\n'Oh, did Mr. Bell see it?'\n'He took it into his head that you were not ungraciously disposed towards Mr. Thornton. I knew that could never be. I knew your real feelings; you could never like Mr. Thornton in that way. But I am very sorry.'\nThey were very quiet for some minutes. But, on stroking her cheek caressingly, he was shocked to find her face wet with tears. As he touched her, she sprang up, and smiling brightly, began to talk of the Lennoxes with such a vehement desire to turn the conversation, that Mr. Hale was too tender-hearted to force it back into the old channel.\n'Tomorrow they will be back in Harley Street. I wonder what room they will make into the nursery? Aunt Shaw will be happy with the baby. Fancy Edith a mamma! And Captain Lennox - I wonder what he will do with himself now he has sold out!'\n'I'll tell you what,' said her father, anxious to indulge her in this fresh subject of interest, 'I think you should run up to town and see the travellers. You could learn more about Frederick's chances in half an hour's conversation with Mr. Henry Lennox than in a dozen of these letters of his. It would be uniting business with pleasure.'\n'No, papa, you cannot spare me.' After a pause, she added, 'I am losing hope about Frederick; he is letting us down gently, but I can see that Mr. Lennox has no hope of hunting up the witnesses after so many years. We must console ourselves with being glad that Frederick is so happy, and with being a great deal to each other. So don't offend me by talking of being able to spare me, papa, for I assure you, you can't.'\nBut the idea of a change took root in Margaret's heart, although not in the way her father proposed. She began to consider how good a change would be for her father, whose spirits now became too frequently depressed, and whose health had been seriously affected by his wife's death. His pupils did not provide the companionship that Mr. Thornton had. Margaret was conscious that her father needed to converse with men. At Helstone there had been perpetual exchanging of visits with neighbouring clergymen; and the poor labourers in the fields, or tending their cattle in the forest, were always at liberty to talk.\nBut in Milton everyone was too busy; they spoke only about business, and then sank into fallow until next morning. The workman went away to some lecture, or club, or beer-shop, according to his character. Mr. Hale thought of trying to deliver a course of lectures, but he contemplated doing this so much as an effort of duty that Margaret was sure that it would not be well done until he could look upon it with zest.",
        "paragraph_chars": [
            [
                0,
                216
            ],
            [
                216,
                359
            ],
            [
                359,
                494
            ],
            [
                494,
                634
            ],
            [
                634,
                768
            ],
            [
                768,
                901
            ],
            [
                901,
                1075
            ],
            [
                1075,
                1203
            ],
            [
                1203,
                1329
            ],
            [
                1329,
                1462
            ],
            [
                1462,
                1643
            ],
            [
                1643,
                1711
            ],
            [
                1711,
                2319
            ],
            [
                2319,
                2929
            ],
            [
                2929,
                3162
            ],
            [
                3162,
                3224
            ],
            [
                3224,
                3430
            ],
            [
                3430,
                3759
            ],
            [
                3759,
                3911
            ],
            [
                3911,
                3991
            ],
            [
                3991,
                4238
            ],
            [
                4238,
                4281
            ],
            [
                4281,
                4401
            ],
            [
                4401,
                4499
            ],
            [
                4499,
                4512
            ],
            [
                4512,
                4609
            ],
            [
                4609,
                4731
            ],
            [
                4731,
                4972
            ],
            [
                4972,
                5111
            ],
            [
                5111,
                5323
            ],
            [
                5323,
                5585
            ],
            [
                5585,
                5718
            ],
            [
                5718,
                5764
            ],
            [
                5764,
                5809
            ],
            [
                5809,
                6536
            ],
            [
                6536,
                6681
            ],
            [
                6681,
                7188
            ],
            [
                7188,
                7295
            ],
            [
                7295,
                7513
            ],
            [
                7513,
                7614
            ],
            [
                7614,
                7827
            ],
            [
                7827,
                7915
            ],
            [
                7915,
                7997
            ],
            [
                7997,
                8071
            ],
            [
                8071,
                8469
            ],
            [
                8469,
                8893
            ],
            [
                8893,
                9498
            ],
            [
                9498,
                9928
            ],
            [
                9928,
                10168
            ],
            [
                10168,
                10386
            ],
            [
                10386,
                10531
            ],
            [
                10531,
                10604
            ],
            [
                10604,
                10700
            ],
            [
                10700,
                10905
            ],
            [
                10905,
                11026
            ],
            [
                11026,
                11114
            ],
            [
                11114,
                11259
            ],
            [
                11259,
                11394
            ],
            [
                11394,
                11531
            ],
            [
                11531,
                12119
            ],
            [
                12119,
                12235
            ],
            [
                12235,
                12490
            ],
            [
                12490,
                13329
            ],
            [
                13329,
                13923
            ],
            [
                13923,
                13965
            ],
            [
                13965,
                14290
            ],
            [
                14290,
                14377
            ],
            [
                14377,
                14687
            ],
            [
                14687,
                15108
            ],
            [
                15108,
                15161
            ],
            [
                15161,
                15243
            ],
            [
                15243,
                15349
            ],
            [
                15349,
                15458
            ],
            [
                15458,
                15583
            ],
            [
                15583,
                15617
            ],
            [
                15617,
                15640
            ],
            [
                15640,
                15773
            ],
            [
                15773,
                16041
            ],
            [
                16041,
                16132
            ],
            [
                16132,
                16159
            ],
            [
                16159,
                16371
            ],
            [
                16371,
                16714
            ],
            [
                16714,
                16953
            ],
            [
                16953,
                17295
            ],
            [
                17295,
                17716
            ],
            [
                17716,
                18331
            ],
            [
                18331,
                18748
            ]
        ],
        "segment_chars": [
            [
                0,
                140
            ],
            [
                140,
                216
            ],
            [
                216,
                265
            ],
            [
                265,
                359
            ],
            [
                359,
                395
            ],
            [
                395,
                444
            ],
            [
                444,
                494
            ],
            [
                494,
                564
            ],
            [
                564,
                634
            ],
            [
                634,
                643
            ],
            [
                643,
                681
            ],
            [
                681,
                706
            ],
            [
                706,
                736
            ],
            [
                736,
                768
            ],
            [
                768,
                901
            ],
            [
                901,
                949
            ],
            [
                949,
                977
            ],
            [
                977,
                983
            ],
            [
                983,
                1075
            ],
            [
                1075,
                1143
            ],
            [
                1143,
                1203
            ],
            [
                1203,
                1240
            ],
            [
                1240,
                1265
            ],
            [
                1265,
                1329
            ],
            [
                1329,
                1383
            ],
            [
                1383,
                1462
            ],
            [
                1462,
                1470
            ],
            [
                1470,
                1490
            ],
            [
                1490,
                1575
            ],
            [
                1575,
                1643
            ],
            [
                1643,
                1711
            ],
            [
                1711,
                1796
            ],
            [
                1796,
                1864
            ],
            [
                1864,
                1914
            ],
            [
                1914,
                2015
            ],
            [
                2015,
                2179
            ],
            [
                2179,
                2319
            ],
            [
                2319,
                2398
            ],
            [
                2398,
                2455
            ],
            [
                2455,
                2621
            ],
            [
                2621,
                2779
            ],
            [
                2779,
                2929
            ],
            [
                2929,
                3056
            ],
            [
                3056,
                3162
            ],
            [
                3162,
                3191
            ],
            [
                3191,
                3224
            ],
            [
                3224,
                3241
            ],
            [
                3241,
                3301
            ],
            [
                3301,
                3430
            ],
            [
                3430,
                3562
            ],
            [
                3562,
                3759
            ],
            [
                3759,
                3779
            ],
            [
                3779,
                3882
            ],
            [
                3882,
                3911
            ],
            [
                3911,
                3991
            ],
            [
                3991,
                4073
            ],
            [
                4073,
                4114
            ],
            [
                4114,
                4159
            ],
            [
                4159,
                4238
            ],
            [
                4238,
                4281
            ],
            [
                4281,
                4343
            ],
            [
                4343,
                4375
            ],
            [
                4375,
                4401
            ],
            [
                4401,
                4426
            ],
            [
                4426,
                4462
            ],
            [
                4462,
                4499
            ],
            [
                4499,
                4512
            ],
            [
                4512,
                4540
            ],
            [
                4540,
                4609
            ],
            [
                4609,
                4615
            ],
            [
                4615,
                4674
            ],
            [
                4674,
                4731
            ],
            [
                4731,
                4811
            ],
            [
                4811,
                4919
            ],
            [
                4919,
                4972
            ],
            [
                4972,
                4994
            ],
            [
                4994,
                5111
            ],
            [
                5111,
                5138
            ],
            [
                5138,
                5235
            ],
            [
                5235,
                5305
            ],
            [
                5305,
                5323
            ],
            [
                5323,
                5328
            ],
            [
                5328,
                5392
            ],
            [
                5392,
                5516
            ],
            [
                5516,
                5556
            ],
            [
                5556,
                5585
            ],
            [
                5585,
                5628
            ],
            [
                5628,
                5718
            ],
            [
                5718,
                5764
            ],
            [
                5764,
                5787
            ],
            [
                5787,
                5809
            ],
            [
                5809,
                5814
            ],
            [
                5814,
                5873
            ],
            [
                5873,
                5978
            ],
            [
                5978,
                6053
            ],
            [
                6053,
                6192
            ],
            [
                6192,
                6292
            ],
            [
                6292,
                6358
            ],
            [
                6358,
                6475
            ],
            [
                6475,
                6536
            ],
            [
                6536,
                6643
            ],
            [
                6643,
                6681
            ],
            [
                6681,
                6799
            ],
            [
                6799,
                6917
            ],
            [
                6917,
                7022
            ],
            [
                7022,
                7188
            ],
            [
                7188,
                7267
            ],
            [
                7267,
                7295
            ],
            [
                7295,
                7326
            ],
            [
                7326,
                7437
            ],
            [
                7437,
                7513
            ],
            [
                7513,
                7537
            ],
            [
                7537,
                7552
            ],
            [
                7552,
                7614
            ],
            [
                7614,
                7752
            ],
            [
                7752,
                7827
            ],
            [
                7827,
                7915
            ],
            [
                7915,
                7927
            ],
            [
                7927,
                7944
            ],
            [
                7944,
                7997
            ],
            [
                7997,
                8071
            ],
            [
                8071,
                8111
            ],
            [
                8111,
                8140
            ],
            [
                8140,
                8204
            ],
            [
                8204,
                8255
            ],
            [
                8255,
                8428
            ],
            [
                8428,
                8469
            ],
            [
                8469,
                8571
            ],
            [
                8571,
                8646
            ],
            [
                8646,
                8809
            ],
            [
                8809,
                8893
            ],
            [
                8893,
                9046
            ],
            [
                9046,
                9080
            ],
            [
                9080,
                9172
            ],
            [
                9172,
                9329
            ],
            [
                9329,
                9498
            ],
            [
                9498,
                9541
            ],
            [
                9541,
                9679
            ],
            [
                9679,
                9685
            ],
            [
                9685,
                9776
            ],
            [
                9776,
                9928
            ],
            [
                9928,
                10015
            ],
            [
                10015,
                10080
            ],
            [
                10080,
                10168
            ],
            [
                10168,
                10213
            ],
            [
                10213,
                10247
            ],
            [
                10247,
                10294
            ],
            [
                10294,
                10386
            ],
            [
                10386,
                10438
            ],
            [
                10438,
                10477
            ],
            [
                10477,
                10531
            ],
            [
                10531,
                10565
            ],
            [
                10565,
                10604
            ],
            [
                10604,
                10611
            ],
            [
                10611,
                10700
            ],
            [
                10700,
                10709
            ],
            [
                10709,
                10734
            ],
            [
                10734,
                10767
            ],
            [
                10767,
                10819
            ],
            [
                10819,
                10832
            ],
            [
                10832,
                10905
            ],
            [
                10905,
                10912
            ],
            [
                10912,
                10971
            ],
            [
                10971,
                11026
            ],
            [
                11026,
                11072
            ],
            [
                11072,
                11114
            ],
            [
                11114,
                11144
            ],
            [
                11144,
                11181
            ],
            [
                11181,
                11205
            ],
            [
                11205,
                11259
            ],
            [
                11259,
                11394
            ],
            [
                11394,
                11510
            ],
            [
                11510,
                11531
            ],
            [
                11531,
                11584
            ],
            [
                11584,
                11694
            ],
            [
                11694,
                11725
            ],
            [
                11725,
                11742
            ],
            [
                11742,
                11844
            ],
            [
                11844,
                12061
            ],
            [
                12061,
                12099
            ],
            [
                12099,
                12119
            ],
            [
                12119,
                12128
            ],
            [
                12128,
                12154
            ],
            [
                12154,
                12209
            ],
            [
                12209,
                12235
            ],
            [
                12235,
                12261
            ],
            [
                12261,
                12310
            ],
            [
                12310,
                12329
            ],
            [
                12329,
                12427
            ],
            [
                12427,
                12455
            ],
            [
                12455,
                12490
            ],
            [
                12490,
                12547
            ],
            [
                12547,
                12659
            ],
            [
                12659,
                12776
            ],
            [
                12776,
                12948
            ],
            [
                12948,
                12978
            ],
            [
                12978,
                13130
            ],
            [
                13130,
                13288
            ],
            [
                13288,
                13329
            ],
            [
                13329,
                13385
            ],
            [
                13385,
                13401
            ],
            [
                13401,
                13447
            ],
            [
                13447,
                13498
            ],
            [
                13498,
                13574
            ],
            [
                13574,
                13658
            ],
            [
                13658,
                13791
            ],
            [
                13791,
                13813
            ],
            [
                13813,
                13923
            ],
            [
                13923,
                13949
            ],
            [
                13949,
                13965
            ],
            [
                13965,
                13972
            ],
            [
                13972,
                14060
            ],
            [
                14060,
                14165
            ],
            [
                14165,
                14232
            ],
            [
                14232,
                14290
            ],
            [
                14290,
                14377
            ],
            [
                14377,
                14409
            ],
            [
                14409,
                14423
            ],
            [
                14423,
                14486
            ],
            [
                14486,
                14687
            ],
            [
                14687,
                14692
            ],
            [
                14692,
                14713
            ],
            [
                14713,
                14798
            ],
            [
                14798,
                14940
            ],
            [
                14940,
                15036
            ],
            [
                15036,
                15108
            ],
            [
                15108,
                15161
            ],
            [
                15161,
                15172
            ],
            [
                15172,
                15243
            ],
            [
                15243,
                15349
            ],
            [
                15349,
                15401
            ],
            [
                15401,
                15458
            ],
            [
                15458,
                15552
            ],
            [
                15552,
                15583
            ],
            [
                15583,
                15617
            ],
            [
                15617,
                15640
            ],
            [
                15640,
                15672
            ],
            [
                15672,
                15773
            ],
            [
                15773,
                15884
            ],
            [
                15884,
                15960
            ],
            [
                15960,
                15964
            ],
            [
                15964,
                15982
            ],
            [
                15982,
                16041
            ],
            [
                16041,
                16068
            ],
            [
                16068,
                16132
            ],
            [
                16132,
                16159
            ],
            [
                16159,
                16247
            ],
            [
                16247,
                16275
            ],
            [
                16275,
                16349
            ],
            [
                16349,
                16371
            ],
            [
                16371,
                16410
            ],
            [
                16410,
                16498
            ],
            [
                16498,
                16714
            ],
            [
                16714,
                16760
            ],
            [
                16760,
                16812
            ],
            [
                16812,
                16851
            ],
            [
                16851,
                16872
            ],
            [
                16872,
                16953
            ],
            [
                16953,
                17109
            ],
            [
                17109,
                17250
            ],
            [
                17250,
                17295
            ],
            [
                17295,
                17328
            ],
            [
                17328,
                17510
            ],
            [
                17510,
                17623
            ],
            [
                17623,
                17716
            ],
            [
                17716,
                17817
            ],
            [
                17817,
                17999
            ],
            [
                17999,
                18067
            ],
            [
                18067,
                18135
            ],
            [
                18135,
                18331
            ],
            [
                18331,
                18446
            ],
            [
                18446,
                18536
            ],
            [
                18536,
                18748
            ]
        ],
        "overlap_chars": [
            [
                0,
                72
            ],
            [
                74,
                102
            ],
            [
                108,
                112
            ],
            [
                123,
                127
            ],
            [
                128,
                138
            ],
            [
                138,
                140
            ],
            [
                140,
                142
            ],
            [
                150,
                197
            ],
            [
                197,
                198
            ],
            [
                202,
                205
            ],
            [
                211,
                214
            ],
            [
                214,
                215
            ],
            [
                217,
                265
            ],
            [
                265,
                275
            ],
            [
                276,
                356
            ],
            [
                360,
                393
            ],
            [
                395,
                444
            ],
            [
                444,
                481
            ],
            [
                482,
                491
            ],
            [
                495,
                564
            ],
            [
                564,
                583
            ],
            [
                587,
                592
            ],
            [
                593,
                631
            ],
            [
                635,
                643
            ],
            [
                643,
                681
            ],
            [
                681,
                706
            ],
            [
                706,
                736
            ],
            [
                736,
                753
            ],
            [
                754,
                765
            ],
            [
                769,
                837
            ],
            [
                837,
                838
            ],
            [
                839,
                883
            ],
            [
                886,
                901
            ],
            [
                915,
                919
            ],
            [
                920,
                947
            ],
            [
                947,
                949
            ],
            [
                949,
                969
            ],
            [
                972,
                977
            ],
            [
                977,
                983
            ],
            [
                983,
                1072
            ],
            [
                1077,
                1143
            ],
            [
                1143,
                1200
            ],
            [
                1204,
                1237
            ],
            [
                1240,
                1248
            ],
            [
                1263,
                1265
            ],
            [
                1266,
                1326
            ],
            [
                1330,
                1383
            ],
            [
                1383,
                1459
            ],
            [
                1463,
                1467
            ],
            [
                1470,
                1484
            ],
            [
                1486,
                1489
            ],
            [
                1490,
                1511
            ],
            [
                1516,
                1518
            ],
            [
                1526,
                1575
            ],
            [
                1575,
                1640
            ],
            [
                1644,
                1693
            ],
            [
                1696,
                1711
            ],
            [
                1711,
                1738
            ],
            [
                1743,
                1745
            ],
            [
                1750,
                1760
            ],
            [
                1761,
                1766
            ],
            [
                1767,
                1770
            ],
            [
                1786,
                1794
            ],
            [
                1794,
                1796
            ],
            [
                1796,
                1820
            ],
            [
                1821,
                1841
            ],
            [
                1842,
                1858
            ],
            [
                1859,
                1862
            ],
            [
                1862,
                1864
            ],
            [
                1864,
                1897
            ],
            [
                1898,
                1912
            ],
            [
                1914,
                1933
            ],
            [
                1936,
                1954
            ],
            [
                1957,
                1970
            ],
            [
                1973,
                2015
            ],
            [
                2015,
                2179
            ],
            [
                2179,
                2220
            ],
            [
                2220,
                2221
            ],
            [
                2222,
                2230
            ],
            [
                2231,
                2234
            ],
            [
                2235,
                2261
            ],
            [
                2262,
                2265
            ],
            [
                2266,
                2301
            ],
            [
                2302,
                2317
            ],
            [
                2317,
                2318
            ],
            [
                2319,
                2398
            ],
            [
                2398,
                2419
            ],
            [
                2426,
                2455
            ],
            [
                2455,
                2545
            ],
            [
                2551,
                2561
            ],
            [
                2565,
                2571
            ],
            [
                2572,
                2621
            ],
            [
                2621,
                2631
            ],
            [
                2632,
                2635
            ],
            [
                2636,
                2644
            ],
            [
                2645,
                2650
            ],
            [
                2661,
                2687
            ],
            [
                2687,
                2688
            ],
            [
                2693,
                2697
            ],
            [
                2698,
                2705
            ],
            [
                2706,
                2716
            ],
            [
                2728,
                2729
            ],
            [
                2730,
                2779
            ],
            [
                2781,
                2791
            ],
            [
                2792,
                2859
            ],
            [
                2871,
                2883
            ],
            [
                2884,
                2894
            ],
            [
                2895,
                2927
            ],
            [
                2927,
                2928
            ],
            [
                2929,
                2936
            ],
            [
                2937,
                2941
            ],
            [
                2961,
                3056
            ],
            [
                3056,
                3104
            ],
            [
                3110,
                3128
            ],
            [
                3129,
                3162
            ],
            [
                3163,
                3191
            ],
            [
                3191,
                3221
            ],
            [
                3224,
                3241
            ],
            [
                3241,
                3301
            ],
            [
                3301,
                3430
            ],
            [
                3431,
                3447
            ],
            [
                3450,
                3464
            ],
            [
                3466,
                3491
            ],
            [
                3492,
                3560
            ],
            [
                3562,
                3617
            ],
            [
                3618,
                3657
            ],
            [
                3660,
                3679
            ],
            [
                3692,
                3730
            ],
            [
                3731,
                3756
            ],
            [
                3760,
                3779
            ],
            [
                3779,
                3882
            ],
            [
                3882,
                3908
            ],
            [
                3912,
                3921
            ],
            [
                3925,
                3988
            ],
            [
                3991,
                3993
            ],
            [
                3995,
                4060
            ],
            [
                4071,
                4073
            ],
            [
                4073,
                4114
            ],
            [
                4114,
                4159
            ],
            [
                4159,
                4235
            ],
            [
                4239,
                4278
            ],
            [
                4297,
                4343
            ],
            [
                4343,
                4375
            ],
            [
                4375,
                4398
            ],
            [
                4401,
                4426
            ],
            [
                4426,
                4439
            ],
            [
                4441,
                4462
            ],
            [
                4462,
                4483
            ],
            [
                4484,
                4485
            ],
            [
                4486,
                4496
            ],
            [
                4500,
                4509
            ],
            [
                4513,
                4520
            ],
            [
                4530,
                4540
            ],
            [
                4540,
                4553
            ],
            [
                4554,
                4567
            ],
            [
                4568,
                4603
            ],
            [
                4610,
                4612
            ],
            [
                4615,
                4629
            ],
            [
                4631,
                4674
            ],
            [
                4674,
                4708
            ],
            [
                4732,
                4793
            ],
            [
                4809,
                4811
            ],
            [
                4812,
                4909
            ],
            [
                4910,
                4919
            ],
            [
                4919,
                4969
            ],
            [
                4973,
                4994
            ],
            [
                4994,
                5108
            ],
            [
                5117,
                5138
            ],
            [
                5138,
                5212
            ],
            [
                5213,
                5232
            ],
            [
                5235,
                5303
            ],
            [
                5303,
                5305
            ],
            [
                5305,
                5321
            ],
            [
                5324,
                5328
            ],
            [
                5328,
                5367
            ],
            [
                5370,
                5392
            ],
            [
                5392,
                5516
            ],
            [
                5516,
                5556
            ],
            [
                5556,
                5582
            ],
            [
                5585,
                5597
            ],
            [
                5598,
                5628
            ],
            [
                5628,
                5634
            ],
            [
                5643,
                5718
            ],
            [
                5719,
                5761
            ],
            [
                5765,
                5784
            ],
            [
                5787,
                5809
            ],
            [
                5810,
                5814
            ],
            [
                5814,
                5871
            ],
            [
                5873,
                5881
            ],
            [
                5881,
                5882
            ],
            [
                5883,
                5956
            ],
            [
                5959,
                5977
            ],
            [
                5979,
                6051
            ],
            [
                6053,
                6085
            ],
            [
                6091,
                6166
            ],
            [
                6167,
                6192
            ],
            [
                6192,
                6229
            ],
            [
                6237,
                6277
            ],
            [
                6278,
                6290
            ],
            [
                6290,
                6292
            ],
            [
                6296,
                6308
            ],
            [
                6310,
                6358
            ],
            [
                6358,
                6475
            ],
            [
                6475,
                6533
            ],
            [
                6537,
                6589
            ],
            [
                6592,
                6643
            ],
            [
                6643,
                6678
            ],
            [
                6682,
                6797
            ],
            [
                6797,
                6799
            ],
            [
                6799,
                6873
            ],
            [
                6874,
                6877
            ],
            [
                6878,
                6890
            ],
            [
                6901,
                6915
            ],
            [
                6925,
                6960
            ],
            [
                6963,
                6999
            ],
            [
                7010,
                7022
            ],
            [
                7027,
                7145
            ],
            [
                7155,
                7168
            ],
            [
                7170,
                7184
            ],
            [
                7186,
                7187
            ],
            [
                7189,
                7236
            ],
            [
                7242,
                7267
            ],
            [
                7267,
                7292
            ],
            [
                7295,
                7324
            ],
            [
                7324,
                7326
            ],
            [
                7327,
                7400
            ],
            [
                7401,
                7437
            ],
            [
                7437,
                7510
            ],
            [
                7514,
                7534
            ],
            [
                7537,
                7552
            ],
            [
                7558,
                7611
            ],
            [
                7614,
                7752
            ],
            [
                7752,
                7788
            ],
            [
                7788,
                7789
            ],
            [
                7794,
                7827
            ],
            [
                7828,
                7912
            ],
            [
                7921,
                7924
            ],
            [
                7927,
                7942
            ],
            [
                7942,
                7943
            ],
            [
                7945,
                7994
            ],
            [
                7998,
                8025
            ],
            [
                8026,
                8034
            ],
            [
                8034,
                8036
            ],
            [
                8037,
                8053
            ],
            [
                8056,
                8070
            ],
            [
                8072,
                8108
            ],
            [
                8111,
                8140
            ],
            [
                8140,
                8204
            ],
            [
                8204,
                8255
            ],
            [
                8255,
                8270
            ],
            [
                8278,
                8279
            ],
            [
                8280,
                8303
            ],
            [
                8303,
                8304
            ],
            [
                8305,
                8319
            ],
            [
                8320,
                8325
            ],
            [
                8325,
                8326
            ],
            [
                8336,
                8340
            ],
            [
                8341,
                8426
            ],
            [
                8426,
                8428
            ],
            [
                8428,
                8431
            ],
            [
                8432,
                8468
            ],
            [
                8469,
                8523
            ],
            [
                8532,
                8553
            ],
            [
                8554,
                8571
            ],
            [
                8571,
                8644
            ],
            [
                8646,
                8654
            ],
            [
                8662,
                8696
            ],
            [
                8699,
                8705
            ],
            [
                8705,
                8706
            ],
            [
                8715,
                8809
            ],
            [
                8809,
                8812
            ],
            [
                8813,
                8892
            ],
            [
                8893,
                8920
            ],
            [
                8921,
                8923
            ],
            [
                8934,
                9044
            ],
            [
                9044,
                9046
            ],
            [
                9046,
                9080
            ],
            [
                9080,
                9083
            ],
            [
                9092,
                9129
            ],
            [
                9130,
                9172
            ],
            [
                9172,
                9297
            ],
            [
                9298,
                9309
            ],
            [
                9310,
                9329
            ],
            [
                9329,
                9399
            ],
            [
                9400,
                9497
            ],
            [
                9498,
                9527
            ],
            [
                9536,
                9541
            ],
            [
                9544,
                9549
            ],
            [
                9561,
                9619
            ],
            [
                9620,
                9629
            ],
            [
                9630,
                9635
            ],
            [
                9636,
                9639
            ],
            [
                9646,
                9648
            ],
            [
                9659,
                9662
            ],
            [
                9663,
                9665
            ],
            [
                9670,
                9679
            ],
            [
                9679,
                9685
            ],
            [
                9685,
                9711
            ],
            [
                9714,
                9721
            ],
            [
                9721,
                9722
            ],
            [
                9723,
                9729
            ],
            [
                9730,
                9737
            ],
            [
                9757,
                9776
            ],
            [
                9776,
                9779
            ],
            [
                9780,
                9787
            ],
            [
                9793,
                9860
            ],
            [
                9861,
                9928
            ],
            [
                9928,
                9939
            ],
            [
                9940,
                9944
            ],
            [
                9944,
                10015
            ],
            [
                10031,
                10080
            ],
            [
                10080,
                10168
            ],
            [
                10169,
                10213
            ],
            [
                10213,
                10226
            ],
            [
                10227,
                10247
            ],
            [
                10247,
                10275
            ],
            [
                10276,
                10294
            ],
            [
                10294,
                10320
            ],
            [
                10321,
                10327
            ],
            [
                10328,
                10383
            ],
            [
                10387,
                10405
            ],
            [
                10408,
                10436
            ],
            [
                10436,
                10438
            ],
            [
                10447,
                10477
            ],
            [
                10477,
                10528
            ],
            [
                10531,
                10548
            ],
            [
                10551,
                10556
            ],
            [
                10563,
                10565
            ],
            [
                10565,
                10596
            ],
            [
                10597,
                10603
            ],
            [
                10605,
                10611
            ],
            [
                10611,
                10670
            ],
            [
                10671,
                10697
            ],
            [
                10701,
                10706
            ],
            [
                10709,
                10723
            ],
            [
                10724,
                10732
            ],
            [
                10732,
                10734
            ],
            [
                10735,
                10756
            ],
            [
                10757,
                10767
            ],
            [
                10767,
                10794
            ],
            [
                10795,
                10819
            ],
            [
                10819,
                10832
            ],
            [
                10832,
                10838
            ],
            [
                10839,
                10902
            ],
            [
                10906,
                10912
            ],
            [
                10912,
                10927
            ],
            [
                10928,
                10971
            ],
            [
                10971,
                10991
            ],
            [
                11008,
                11023
            ],
            [
                11031,
                11070
            ],
            [
                11072,
                11111
            ],
            [
                11115,
                11144
            ],
            [
                11144,
                11179
            ],
            [
                11179,
                11181
            ],
            [
                11181,
                11205
            ],
            [
                11205,
                11208
            ],
            [
                11209,
                11228
            ],
            [
                11229,
                11233
            ],
            [
                11239,
                11245
            ],
            [
                11250,
                11252
            ],
            [
                11259,
                11394
            ],
            [
                11394,
                11402
            ],
            [
                11408,
                11421
            ],
            [
                11430,
                11438
            ],
            [
                11439,
                11441
            ],
            [
                11442,
                11446
            ],
            [
                11450,
                11484
            ],
            [
                11485,
                11508
            ],
            [
                11508,
                11510
            ],
            [
                11510,
                11529
            ],
            [
                11537,
                11584
            ],
            [
                11584,
                11612
            ],
            [
                11613,
                11626
            ],
            [
                11629,
                11661
            ],
            [
                11664,
                11694
            ],
            [
                11694,
                11725
            ],
            [
                11725,
                11742
            ],
            [
                11742,
                11767
            ],
            [
                11769,
                11842
            ],
            [
                11842,
                11844
            ],
            [
                11844,
                11850
            ],
            [
                11857,
                11864
            ],
            [
                11870,
                11877
            ],
            [
                11878,
                11881
            ],
            [
                11888,
                11969
            ],
            [
                11979,
                12004
            ],
            [
                12005,
                12030
            ],
            [
                12033,
                12059
            ],
            [
                12059,
                12061
            ],
            [
                12061,
                12099
            ],
            [
                12099,
                12116
            ],
            [
                12120,
                12125
            ],
            [
                12128,
                12154
            ],
            [
                12158,
                12188
            ],
            [
                12190,
                12202
            ],
            [
                12203,
                12209
            ],
            [
                12209,
                12232
            ],
            [
                12236,
                12259
            ],
            [
                12259,
                12261
            ],
            [
                12261,
                12310
            ],
            [
                12310,
                12327
            ],
            [
                12329,
                12425
            ],
            [
                12425,
                12427
            ],
            [
                12427,
                12455
            ],
            [
                12455,
                12487
            ],
            [
                12490,
                12528
            ],
            [
                12535,
                12545
            ],
            [
                12545,
                12547
            ],
            [
                12547,
                12570
            ],
            [
                12579,
                12599
            ],
            [
                12607,
                12659
            ],
            [
                12659,
                12679
            ],
            [
                12680,
                12687
            ],
            [
                12688,
                12703
            ],
            [
                12703,
                12776
            ],
            [
                12776,
                12861
            ],
            [
                12868,
                12918
            ],
            [
                12919,
                12946
            ],
            [
                12946,
                12948
            ],
            [
                12948,
                12976
            ],
            [
                12978,
                12996
            ],
            [
                12997,
                13069
            ],
            [
                13070,
                13130
            ],
            [
                13130,
                13241
            ],
            [
                13242,
                13278
            ],
            [
                13286,
                13288
            ],
            [
                13288,
                13329
            ],
            [
                13333,
                13347
            ],
            [
                13350,
                13358
            ],
            [
                13360,
                13385
            ],
            [
                13385,
                13401
            ],
            [
                13401,
                13428
            ],
            [
                13429,
                13447
            ],
            [
                13447,
                13486
            ],
            [
                13487,
                13498
            ],
            [
                13498,
                13574
            ],
            [
                13574,
                13658
            ],
            [
                13658,
                13789
            ],
            [
                13789,
                13791
            ],
            [
                13791,
                13813
            ],
            [
                13813,
                13920
            ],
            [
                13924,
                13935
            ],
            [
                13936,
                13946
            ],
            [
                13949,
                13965
            ],
            [
                13966,
                13972
            ],
            [
                13972,
                14058
            ],
            [
                14058,
                14060
            ],
            [
                14060,
                14105
            ],
            [
                14106,
                14165
            ],
            [
                14165,
                14180
            ],
            [
                14188,
                14232
            ],
            [
                14232,
                14254
            ],
            [
                14255,
                14287
            ],
            [
                14291,
                14304
            ],
            [
                14313,
                14377
            ],
            [
                14378,
                14396
            ],
            [
                14399,
                14409
            ],
            [
                14410,
                14420
            ],
            [
                14423,
                14464
            ],
            [
                14470,
                14486
            ],
            [
                14486,
                14505
            ],
            [
                14512,
                14571
            ],
            [
                14572,
                14593
            ],
            [
                14594,
                14610
            ],
            [
                14611,
                14677
            ],
            [
                14685,
                14687
            ],
            [
                14687,
                14692
            ],
            [
                14692,
                14711
            ],
            [
                14711,
                14713
            ],
            [
                14713,
                14753
            ],
            [
                14761,
                14796
            ],
            [
                14796,
                14798
            ],
            [
                14798,
                14801
            ],
            [
                14802,
                14807
            ],
            [
                14808,
                14853
            ],
            [
                14854,
                14880
            ],
            [
                14881,
                14940
            ],
            [
                14940,
                14969
            ],
            [
                14970,
                14979
            ],
            [
                14979,
                15036
            ],
            [
                15036,
                15042
            ],
            [
                15053,
                15056
            ],
            [
                15057,
                15078
            ],
            [
                15079,
                15082
            ],
            [
                15095,
                15108
            ],
            [
                15108,
                15128
            ],
            [
                15129,
                15140
            ],
            [
                15141,
                15161
            ],
            [
                15166,
                15172
            ],
            [
                15172,
                15240
            ],
            [
                15243,
                15290
            ],
            [
                15291,
                15349
            ],
            [
                15350,
                15364
            ],
            [
                15367,
                15369
            ],
            [
                15370,
                15398
            ],
            [
                15401,
                15458
            ],
            [
                15469,
                15552
            ],
            [
                15552,
                15580
            ],
            [
                15583,
                15598
            ],
            [
                15600,
                15609
            ],
            [
                15611,
                15614
            ],
            [
                15618,
                15637
            ],
            [
                15640,
                15651
            ],
            [
                15653,
                15664
            ],
            [
                15666,
                15669
            ],
            [
                15672,
                15745
            ],
            [
                15746,
                15766
            ],
            [
                15767,
                15773
            ],
            [
                15774,
                15784
            ],
            [
                15785,
                15812
            ],
            [
                15813,
                15848
            ],
            [
                15849,
                15884
            ],
            [
                15884,
                15958
            ],
            [
                15960,
                15964
            ],
            [
                15964,
                15979
            ],
            [
                15982,
                15985
            ],
            [
                15990,
                16001
            ],
            [
                16007,
                16041
            ],
            [
                16042,
                16043
            ],
            [
                16044,
                16068
            ],
            [
                16068,
                16107
            ],
            [
                16108,
                16129
            ],
            [
                16133,
                16135
            ],
            [
                16137,
                16156
            ],
            [
                16160,
                16184
            ],
            [
                16185,
                16247
            ],
            [
                16247,
                16275
            ],
            [
                16275,
                16281
            ],
            [
                16282,
                16300
            ],
            [
                16300,
                16301
            ],
            [
                16302,
                16311
            ],
            [
                16318,
                16349
            ],
            [
                16349,
                16368
            ],
            [
                16371,
                16391
            ],
            [
                16392,
                16410
            ],
            [
                16410,
                16436
            ],
            [
                16437,
                16439
            ],
            [
                16448,
                16456
            ],
            [
                16457,
                16498
            ],
            [
                16498,
                16543
            ],
            [
                16552,
                16677
            ],
            [
                16678,
                16714
            ],
            [
                16724,
                16760
            ],
            [
                16760,
                16812
            ],
            [
                16812,
                16851
            ],
            [
                16851,
                16872
            ],
            [
                16872,
                16890
            ],
            [
                16893,
                16950
            ],
            [
                16954,
                16972
            ],
            [
                16975,
                17049
            ],
            [
                17051,
                17058
            ],
            [
                17059,
                17062
            ],
            [
                17070,
                17109
            ],
            [
                17109,
                17129
            ],
            [
                17130,
                17155
            ],
            [
                17156,
                17158
            ],
            [
                17159,
                17208
            ],
            [
                17209,
                17248
            ],
            [
                17250,
                17258
            ],
            [
                17259,
                17292
            ],
            [
                17296,
                17325
            ],
            [
                17328,
                17352
            ],
            [
                17355,
                17371
            ],
            [
                17372,
                17448
            ],
            [
                17449,
                17488
            ],
            [
                17503,
                17508
            ],
            [
                17508,
                17510
            ],
            [
                17510,
                17623
            ],
            [
                17623,
                17702
            ],
            [
                17704,
                17713
            ],
            [
                17716,
                17750
            ],
            [
                17751,
                17795
            ],
            [
                17796,
                17815
            ],
            [
                17815,
                17817
            ],
            [
                17817,
                17842
            ],
            [
                17857,
                17865
            ],
            [
                17870,
                17895
            ],
            [
                17896,
                17949
            ],
            [
                17950,
                17991
            ],
            [
                17992,
                17999
            ],
            [
                17999,
                18009
            ],
            [
                18026,
                18029
            ],
            [
                18030,
                18043
            ],
            [
                18044,
                18048
            ],
            [
                18049,
                18061
            ],
            [
                18065,
                18067
            ],
            [
                18067,
                18089
            ],
            [
                18113,
                18115
            ],
            [
                18125,
                18135
            ],
            [
                18135,
                18171
            ],
            [
                18183,
                18262
            ],
            [
                18263,
                18324
            ],
            [
                18329,
                18330
            ],
            [
                18331,
                18344
            ],
            [
                18354,
                18366
            ],
            [
                18366,
                18367
            ],
            [
                18368,
                18372
            ],
            [
                18384,
                18399
            ],
            [
                18400,
                18403
            ],
            [
                18414,
                18425
            ],
            [
                18426,
                18446
            ],
            [
                18446,
                18457
            ],
            [
                18463,
                18487
            ],
            [
                18488,
                18496
            ],
            [
                18506,
                18524
            ],
            [
                18525,
                18536
            ],
            [
                18536,
                18594
            ],
            [
                18594,
                18655
            ],
            [
                18656,
                18742
            ],
            [
                18743,
                18748
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                140
            ],
            [
                140,
                216
            ],
            [
                216,
                265
            ],
            [
                265,
                359
            ],
            [
                359,
                395
            ],
            [
                395,
                444
            ],
            [
                444,
                494
            ],
            [
                494,
                564
            ],
            [
                564,
                634
            ],
            [
                634,
                643
            ],
            [
                643,
                681
            ],
            [
                681,
                681
            ],
            [
                681,
                706
            ],
            [
                706,
                736
            ],
            [
                736,
                768
            ],
            [
                768,
                901
            ],
            [
                901,
                901
            ],
            [
                901,
                949
            ],
            [
                949,
                977
            ],
            [
                977,
                983
            ],
            [
                983,
                1075
            ],
            [
                1075,
                1143
            ],
            [
                1143,
                1203
            ],
            [
                1203,
                1203
            ],
            [
                1203,
                1203
            ],
            [
                1203,
                1240
            ],
            [
                1240,
                1265
            ],
            [
                1265,
                1329
            ],
            [
                1329,
                1383
            ],
            [
                1383,
                1462
            ],
            [
                1462,
                1470
            ],
            [
                1470,
                1575
            ],
            [
                1575,
                1643
            ],
            [
                1643,
                1711
            ],
            [
                1711,
                1711
            ],
            [
                1711,
                1711
            ],
            [
                1711,
                1711
            ],
            [
                1711,
                1711
            ],
            [
                1711,
                1711
            ],
            [
                1711,
                1796
            ],
            [
                1796,
                1864
            ],
            [
                1864,
                2015
            ],
            [
                2015,
                2179
            ],
            [
                2179,
                2319
            ],
            [
                2319,
                2398
            ],
            [
                2398,
                2455
            ],
            [
                2455,
                2621
            ],
            [
                2621,
                2779
            ],
            [
                2779,
                2929
            ],
            [
                2929,
                3056
            ],
            [
                3056,
                3162
            ],
            [
                3162,
                3191
            ],
            [
                3191,
                3224
            ],
            [
                3224,
                3241
            ],
            [
                3241,
                3301
            ],
            [
                3301,
                3430
            ],
            [
                3430,
                3562
            ],
            [
                3562,
                3562
            ],
            [
                3562,
                3562
            ],
            [
                3562,
                3562
            ],
            [
                3562,
                3562
            ],
            [
                3562,
                3759
            ],
            [
                3759,
                3779
            ],
            [
                3779,
                3882
            ],
            [
                3882,
                3911
            ],
            [
                3911,
                3991
            ],
            [
                3991,
                4073
            ],
            [
                4073,
                4114
            ],
            [
                4114,
                4159
            ],
            [
                4159,
                4238
            ],
            [
                4238,
                4281
            ],
            [
                4281,
                4281
            ],
            [
                4281,
                4281
            ],
            [
                4281,
                4281
            ],
            [
                4281,
                4343
            ],
            [
                4343,
                4375
            ],
            [
                4375,
                4401
            ],
            [
                4401,
                4426
            ],
            [
                4426,
                4462
            ],
            [
                4462,
                4499
            ],
            [
                4499,
                4512
            ],
            [
                4512,
                4540
            ],
            [
                4540,
                4609
            ],
            [
                4609,
                4615
            ],
            [
                4615,
                4674
            ],
            [
                4674,
                4731
            ],
            [
                4731,
                4811
            ],
            [
                4811,
                4919
            ],
            [
                4919,
                4972
            ],
            [
                4972,
                4994
            ],
            [
                4994,
                5111
            ],
            [
                5111,
                5138
            ],
            [
                5138,
                5235
            ],
            [
                5235,
                5305
            ],
            [
                5305,
                5323
            ],
            [
                5323,
                5328
            ],
            [
                5328,
                5392
            ],
            [
                5392,
                5516
            ],
            [
                5516,
                5556
            ],
            [
                5556,
                5585
            ],
            [
                5585,
                5628
            ],
            [
                5628,
                5718
            ],
            [
                5718,
                5764
            ],
            [
                5764,
                5787
            ],
            [
                5787,
                5809
            ],
            [
                5809,
                5814
            ],
            [
                5814,
                5873
            ],
            [
                5873,
                5873
            ],
            [
                5873,
                5873
            ],
            [
                5873,
                5978
            ],
            [
                5978,
                5978
            ],
            [
                5978,
                6192
            ],
            [
                6192,
                6292
            ],
            [
                6292,
                6358
            ],
            [
                6358,
                6475
            ],
            [
                6475,
                6536
            ],
            [
                6536,
                6536
            ],
            [
                6536,
                6643
            ],
            [
                6643,
                6681
            ],
            [
                6681,
                6799
            ],
            [
                6799,
                6799
            ],
            [
                6799,
                7022
            ],
            [
                7022,
                7022
            ],
            [
                7022,
                7188
            ],
            [
                7188,
                7188
            ],
            [
                7188,
                7267
            ],
            [
                7267,
                7295
            ],
            [
                7295,
                7326
            ],
            [
                7326,
                7437
            ],
            [
                7437,
                7513
            ],
            [
                7513,
                7537
            ],
            [
                7537,
                7552
            ],
            [
                7552,
                7614
            ],
            [
                7614,
                7752
            ],
            [
                7752,
                7827
            ],
            [
                7827,
                7915
            ],
            [
                7915,
                7927
            ],
            [
                7927,
                7997
            ],
            [
                7997,
                7997
            ],
            [
                7997,
                7997
            ],
            [
                7997,
                8071
            ],
            [
                8071,
                8111
            ],
            [
                8111,
                8140
            ],
            [
                8140,
                8204
            ],
            [
                8204,
                8204
            ],
            [
                8204,
                8255
            ],
            [
                8255,
                8428
            ],
            [
                8428,
                8469
            ],
            [
                8469,
                8571
            ],
            [
                8571,
                8809
            ],
            [
                8809,
                8893
            ],
            [
                8893,
                8893
            ],
            [
                8893,
                9046
            ],
            [
                9046,
                9080
            ],
            [
                9080,
                9172
            ],
            [
                9172,
                9329
            ],
            [
                9329,
                9498
            ],
            [
                9498,
                9541
            ],
            [
                9541,
                9679
            ],
            [
                9679,
                9685
            ],
            [
                9685,
                9776
            ],
            [
                9776,
                9928
            ],
            [
                9928,
                10015
            ],
            [
                10015,
                10015
            ],
            [
                10015,
                10080
            ],
            [
                10080,
                10168
            ],
            [
                10168,
                10213
            ],
            [
                10213,
                10247
            ],
            [
                10247,
                10294
            ],
            [
                10294,
                10386
            ],
            [
                10386,
                10438
            ],
            [
                10438,
                10477
            ],
            [
                10477,
                10531
            ],
            [
                10531,
                10565
            ],
            [
                10565,
                10604
            ],
            [
                10604,
                10611
            ],
            [
                10611,
                10700
            ],
            [
                10700,
                10709
            ],
            [
                10709,
                10734
            ],
            [
                10734,
                10767
            ],
            [
                10767,
                10819
            ],
            [
                10819,
                10832
            ],
            [
                10832,
                10905
            ],
            [
                10905,
                10912
            ],
            [
                10912,
                10971
            ],
            [
                10971,
                11026
            ],
            [
                11026,
                11026
            ],
            [
                11026,
                11026
            ],
            [
                11026,
                11072
            ],
            [
                11072,
                11114
            ],
            [
                11114,
                11144
            ],
            [
                11144,
                11181
            ],
            [
                11181,
                11205
            ],
            [
                11205,
                11259
            ],
            [
                11259,
                11394
            ],
            [
                11394,
                11510
            ],
            [
                11510,
                11531
            ],
            [
                11531,
                11584
            ],
            [
                11584,
                11694
            ],
            [
                11694,
                11725
            ],
            [
                11725,
                11725
            ],
            [
                11725,
                11725
            ],
            [
                11725,
                11725
            ],
            [
                11725,
                11725
            ],
            [
                11725,
                11725
            ],
            [
                11725,
                11742
            ],
            [
                11742,
                11844
            ],
            [
                11844,
                12061
            ],
            [
                12061,
                12099
            ],
            [
                12099,
                12119
            ],
            [
                12119,
                12154
            ],
            [
                12154,
                12209
            ],
            [
                12209,
                12235
            ],
            [
                12235,
                12261
            ],
            [
                12261,
                12310
            ],
            [
                12310,
                12329
            ],
            [
                12329,
                12427
            ],
            [
                12427,
                12455
            ],
            [
                12455,
                12490
            ],
            [
                12490,
                12547
            ],
            [
                12547,
                12659
            ],
            [
                12659,
                12776
            ],
            [
                12776,
                12948
            ],
            [
                12948,
                13130
            ],
            [
                13130,
                13288
            ],
            [
                13288,
                13329
            ],
            [
                13329,
                13385
            ],
            [
                13385,
                13401
            ],
            [
                13401,
                13447
            ],
            [
                13447,
                13498
            ],
            [
                13498,
                13574
            ],
            [
                13574,
                13574
            ],
            [
                13574,
                13658
            ],
            [
                13658,
                13791
            ],
            [
                13791,
                13813
            ],
            [
                13813,
                13813
            ],
            [
                13813,
                13923
            ],
            [
                13923,
                13965
            ],
            [
                13965,
                13972
            ],
            [
                13972,
                14060
            ],
            [
                14060,
                14165
            ],
            [
                14165,
                14232
            ],
            [
                14232,
                14290
            ],
            [
                14290,
                14377
            ],
            [
                14377,
                14409
            ],
            [
                14409,
                14409
            ],
            [
                14409,
                14423
            ],
            [
                14423,
                14486
            ],
            [
                14486,
                14687
            ],
            [
                14687,
                14692
            ],
            [
                14692,
                14713
            ],
            [
                14713,
                14798
            ],
            [
                14798,
                14940
            ],
            [
                14940,
                15036
            ],
            [
                15036,
                15108
            ],
            [
                15108,
                15161
            ],
            [
                15161,
                15172
            ],
            [
                15172,
                15243
            ],
            [
                15243,
                15243
            ],
            [
                15243,
                15349
            ],
            [
                15349,
                15401
            ],
            [
                15401,
                15458
            ],
            [
                15458,
                15458
            ],
            [
                15458,
                15552
            ],
            [
                15552,
                15583
            ],
            [
                15583,
                15617
            ],
            [
                15617,
                15640
            ],
            [
                15640,
                15672
            ],
            [
                15672,
                15773
            ],
            [
                15773,
                15884
            ],
            [
                15884,
                15964
            ],
            [
                15964,
                15982
            ],
            [
                15982,
                16041
            ],
            [
                16041,
                16068
            ],
            [
                16068,
                16132
            ],
            [
                16132,
                16132
            ],
            [
                16132,
                16159
            ],
            [
                16159,
                16247
            ],
            [
                16247,
                16275
            ],
            [
                16275,
                16349
            ],
            [
                16349,
                16371
            ],
            [
                16371,
                16410
            ],
            [
                16410,
                16498
            ],
            [
                16498,
                16714
            ],
            [
                16714,
                16760
            ],
            [
                16760,
                16760
            ],
            [
                16760,
                16812
            ],
            [
                16812,
                16851
            ],
            [
                16851,
                16872
            ],
            [
                16872,
                16953
            ],
            [
                16953,
                17109
            ],
            [
                17109,
                17295
            ],
            [
                17295,
                17328
            ],
            [
                17328,
                17510
            ],
            [
                17510,
                17623
            ],
            [
                17623,
                17716
            ],
            [
                17716,
                17817
            ],
            [
                17817,
                17999
            ],
            [
                17999,
                18067
            ],
            [
                18067,
                18135
            ],
            [
                18135,
                18331
            ],
            [
                18331,
                18446
            ],
            [
                18446,
                18536
            ],
            [
                18536,
                18748
            ]
        ]
    }
}