{
    "original": {
        "text": "\"When some beloved voice that was to you Both sound and sweetness, faileth suddenly, And silence, against which you dare not cry, Aches round you like a strong disease and new,-- What hope? what help? what music will undo That silence to your sense?\" MRS. BROWNING.\nThe shock had been great. Margaret fell into a state of prostration, which did not show itself in sobs and tears, or even find the relief of words. She lay on the sofa with her eyes shut, never speaking but when spoken to, and then replying in whispers. Mr. Bell was perplexed. He dared not leave her; he dared not ask her to accompany him back to Oxford, which had been one of the plans he had formed on the journey to Milton, her physical exhaustion was evidently too complete for her to undertake any such fatigue--putting the sight that she would have to encounter out of the question. Mr. Bell sate over the fire, considering what he had better do. Margaret lay motionless, and almost breathless by him. He would not leave her, even for the dinner which Dixon had prepared for him downstairs, and, with sobbing hospitality, would fain have tempted him to eat. He had a plateful of something brought up to him. In general, he was particular and dainty enough, and knew well each shade of flavour in his food, but now the devilled chicken tasted like sawdust. He minced up some of the fowl for Margaret, and peppered and salted it well; but when Dixon, following his directions, tried to feed her, the languid shake of head, proved that in such a state as Margaret was in, food would only choke, not nourish her.\nMr. Bell gave a great sigh; lifted up his stout old limbs (stiff with travelling) from their easy position, and followed Dixon out of the room.\n\"I can't leave her. I must write to them at Oxford, to see that the preparations are made: they can be getting on with these till I arrive. Can't Mrs. Lennox come to her? I'll write and tell her she must. The girl must have some woman-friend about her, if only to talk her into a good fit of crying.\"\nDixon was crying--enough for two; but, after wiping her eyes and steadying her voice, she managed to tell Mr. Bell, that Mrs. Lennox was too near her confinement to be able to undertake any journey at present.\n\"Well! I suppose we must have Mrs. Shaw; she's come back to England, isn't she?\"\n\"Yes, sir, she's come back; but I don't think she will like to leave Mrs. Lennox at such an interesting time,\" said Dixon, who did not much approve of a stranger entering the household, to share with her in her ruling care of Margaret.\n\"Interesting time be----.\" Mr. Bell restricted himself by coughing over the end of his sentence. \"She could be content to be at Venice or Naples, or some of those Popish places, at the last 'interesting time,' which took place in Corfu, I think. And what does that little prosperous woman's 'interesting time' signify, in comparison with that poor creature there,--that helpless, homeless, friendless, Margaret--lying as still on that sofa as if it were an altar-tomb, and she the stone statue on it. I tell you, Mrs. Shaw shall come. See that a room, or whatever she wants, is got ready for her by to-morrow night. I'll take care she comes.\"\nAccordingly Mr. Bell wrote a letter, which Mrs. Shaw declared, with many tears, to be so like one of the dear general's when he was going to have a fit of the gout, that she should always value and preserve it. If he had given her the option, by requesting or urging her, as if a refusal were possible, she might not have come--true and sincere as was her sympathy with Margaret. It needed the sharp uncourteous command to make her conquer her vis inerti and allow herself to be packed by her maid, after the latter had completed the boxes. Edith, all cap, shawl, and tears, came out to the top of the stairs, as Captain Lennox was taking her mother down to the carriage:\n\"Don't forget, mamma; Margaret must come and live with us. Sholto will go to Oxford on Wednesday, and you must send word by Mr. Bell to him when we're to expect you. And if you want Sholto, he can go on from Oxford to Milton. Don't forget, mamma; you are to bring back Margaret.\"\nEdith re-entered the drawing-room. Mr. Henry Lennox was there, cutting open the pages of a new Review. Without lifting his head, he said, \"If you don't like Sholto to be so long absent from you, Edith, I hope you will let me go down to Milton, and give what assistance I can.\"\n\"Oh, thank you,\" said Edith, \"I dare say old Mr. Bell will do everything he can, and more help may not be needed. Only one does not look for much savoir-faire from a resident Fellow. Dear, darling Margaret; won't it be nice to have her here, again? You were both great allies, years ago.\"\n\"Were we?\" asked he indifferently, with an appearance of being interested in a passage in the Review.\n\"Well, perhaps not--I forget. I was so full of Sholto. But doesn't it fall out well, that if my uncle was to die, it should be just now, when we are come home, and settled in the old house, and quite ready to receive Margaret? Poor thing! what a change it will be to her from Milton! I'll have new chintz for her bed-room, and make it look new and bright, and cheer her up a little.\"\nIn the same spirit of kindness, Mrs. Shaw journeyed to Milton, occasionally dreading the first meeting, and wondering how it would be got over; but more frequently planning how soon she could get Margaret away from \"that horrid place,\" and back in the pleasant comforts of Harley Street.\n\"Oh dear!\" she said to her maid; \"look at those chimneys! My poor sister Hale! I don't think I could have rested at Naples, if I had known what it was! I must have come and fetched her and Margaret away.\" And to herself she acknowledged, that she had always thought her brother-in-law rather a weak man, but never so weak as now, when she saw for what a place he had exchanged the lovely Helstone home.\nMargaret had remained in the same state; white, motionless, speechless, tearless. They had told her that her aunt Shaw was coming; but she had not expressed either surprise or pleasure, or dislike to the idea. Mr. Bell, whose appetite had returned, and who appreciated Dixon's endeavours to gratify it, in vain urged upon her to taste some sweetbreads stewed with oysters; she shook her head with the same quiet obstinacy as on the previous day; and he was obliged to console himself for her rejection, by eating them all himself. But Margaret was the first to hear the stopping of the cab that brought her aunt from the railway station. Her eyelids quivered, her lips coloured and trembled. Mr. Bell went down to meet Mrs. Shaw; and when they came up, Margaret was standing, trying to steady her dizzy self; and when she saw her aunt, she went forward to the arms open to receive her, and first found the passionate relief of tears on her aunt's shoulder. All thoughts of quiet habitual love, of tenderness for years, of relationship to the dead, all that inexplicable likeness in look, tone, and gesture, that seem to belong to one family, and which reminded Margaret so forcibly at this moment of her mother, came in to melt and soften her numbed heart into the overflow of warm tears.\nMr. Bell stole out of the room, and went down into the study, where he ordered a fire, and tried to divert his thoughts by taking down and examining the different books. Each volume brought a remembrance or a suggestion of his dead friend. It might be a change of employment from his two days' work of watching Margaret, but it was no change of thought. He was glad to catch the sound of Mr. Thornton's voice, making enquiry at the door. Dixon was rather cavalierly dismissing him; for with the appearance of Mrs. Shaw's maid, came visions of former grandeur, of the Beresford blood, of the \"station\" (so she was pleased to term it) from which her young lady had been ousted, and to which she was now, please God, to be restored. These visions, which she had been dwelling on with complacency in her conversation with Mrs. Shaw's maid (skilfully eliciting meanwhile all the circumstances of state and consequence connected with the Harley Street establishment, for the edification of the listening Martha), made Dixon rather inclined to be supercilious in her treatment of any inhabitant of Milton; so, though she always stood rather in awe of Mr. Thornton, she was as curt as she durst be in telling him that he could see none of the inmates of the house that night. It was rather uncomfortable to be contradicted in her statement by Mr. Bell's opening the study-door, and calling out:\n\"Thornton! is that you? Come in for a minute or two; I want to speak to you.\" So Mr. Thornton went into the study, and Dixon had to retreat into the kitchen, and reinstate herself in her own esteem by a prodigious story of Sir John Beresford's coach and six, when he was high sheriff.\n\"I don't know what I wanted to say to you after all. Only it's dull enough to sit in a room where everything speaks to you of a dead friend. Yet Margaret and her aunt must have the drawing-room to themselves!\"\n\"Is Mrs.--is her aunt come?\" asked Mr. Thornton.\n\"Come? Yes! maid and all. One would have thought she might have come by herself at such a time! And now I shall have to turn out and find my way to the Clarendon.\"\n\"You must not go to the Clarendon. We have five or six empty bed-rooms at home.\"\n\"Well aired?\"\n\"I think you may trust my mother for that.\"\n\"Then I'll only run upstairs and wish that wan girl good-night, and make my bow to her aunt, and go off with you straight.\"\nMr. Bell was some time upstairs. Mr. Thornton began to think it long, for he was full of business, and had hardly been able to spare the time for running up to Crampton, and enquiring how Miss Hale was.\nWhen they had set out upon their walk, Mr. Bell said:\n\"I was kept by those women in the drawing-room. Mrs. Shaw is anxious to get home--on account of her daughter, she says--and wants Margaret to go off with her at once. Now she is no more fit for travelling than I am for flying. Besides, she says, and very justly, that she has friends she must see--that she must wish good-bye to several people; and then her aunt worried her about old claims, and was she forgetful of old friends? And she said, with a great burst of crying, she should be glad enough to go from a place where she had suffered so much. Now I must return to Oxford to-morrow, and I don't know on which side of the scale to throw in my voice.\"\nHe paused, as if asking a question; but he received no answer from his companion, the echo of whose thoughts kept repeating--\n\"Where she had suffered so much.\" Alas! and that was the way in which this eighteen months in Milton--to him so unspeakably precious, down to its very bitterness, which was worth all the rest of life's sweetness--would be remembered. Neither loss of father, nor loss of mother, dear as she was to Mr. Thornton, could have poisoned the remembrance of the weeks, the days, the hours, when a walk of two miles, every step of which was pleasant, as it brought him nearer and nearer to her, took him to her sweet presence--every step of which was rich, as each recurring moment that bore him away from her made him recall some fresh grace in her demeanour, or pleasant pungency in her character. Yes! whatever had happened to him, external to his relation to her, he could never have spoken of that time, when he could have seen her every day--when he had her within his grasp, as it were--as a time of suffering. It had been a royal time of luxury to him, with all its stings and contumelies, compared to the poverty that crept round and clipped the anticipation of the future down to sordid fact, and life without an atmosphere of either hope or fear.\nMrs. Thornton and Fanny were in the dining-room; the latter in a flutter of small exultation, as the maid held up one glossy material after another, to try the effect of the wedding-dresses by candle-light. Her mother really tried to sympathise with her, but could not. Neither taste nor dress were in her line of subjects, and she heartily wished that Fanny had accepted her brother's offer of having the wedding clothes provided by some first-rate London dressmaker, without the endless troublesome discussions, and unsettled waverings, that arose out of Fanny's desire to choose and superintend everything herself. Mr. Thornton was only too glad to mark his grateful approbation of any sensible man, who could be captivated by Fanny's second-rate airs and graces, by giving her ample means for providing herself with the finery, which certainly rivalled, if it did not exceed, the lover in her estimation. When her brother and Mr. Bell came in, Fanny blushed and simpered, and fluttered over the signs of her employment, in a way which could not have failed to draw attention from any one else but Mr. Bell. If he thought about her and her silks and satins at all, it was to compare her and them with the pale sorrow he had left behind him, sitting motionless, with bent head and folded hands, in a room where the stillness was so great that you might almost fancy the rush in your straining ears was occasioned by the spirits of the dead, yet hovering round their beloved. For when Mr. Bell had first gone upstairs, Mrs. Shaw lay asleep on the sofa; and no sound broke the silence.\nMrs. Thornton gave Mr. Bell her formal, hospitable welcome. She was never so gracious as when receiving her son's friends in her son's house; and the more unexpected they were, the more honour to her admirable housekeeping preparations for comfort.\n\"How is Miss Hale?\" she asked.\n\"About as broken down by this last stroke as she can be.\"\n\"I am sure it is very well for her that she has such a friend as you.\"\n\"I wish I were her only friend, madam. I daresay it sounds very brutal; but here have I been displaced, and turned out of my post of comforter and adviser by a fine lady aunt; and there are cousins and what not claiming her in London, as if she were a lap-dog belonging to them. And she is too weak and miserable to have a will of her own.\"\n\"She must indeed be weak,\" said Mrs. Thornton, with an implied meaning which her son understood well. \"But where,\" continued Mrs. Thornton, \"have these relations been all this time that Miss Hale has appeared almost friendless, and has certainly had a good deal of anxiety to bear?\" But she did not feel interest enough in the answer to her question to wait for it. She left the room to make her household arrangements.\n\"They have been living abroad. They have some kind of claim upon her. I will do them that justice. The aunt brought her up, and she and the cousin have been like sisters. The thing vexing me, you see, is that I wanted to take her for a child of my own; and I am jealous of these people, who don't seem to value the privilege of their right. Now it would be different if Frederick claimed her.\"\n\"Frederick!\" exclaimed Mr. Thornton. \"Who is he? What right----?\" He stopped short in his vehement question.\n\"Frederick,\" said Mr. Bell in surprise. \"Why, don't you know? He's her brother. Have you not heard----\"\n\"I never heard his name before. Where is he? Who is he?\"\n\"Surely I told you about him, when the family first came to Milton--the son who was concerned in that mutiny.\"\n\"I never heard of him till this moment. Where does he live?\"\n\"In Spain. He's liable to be arrested the moment he sets foot on English ground. Poor fellow! he will grieve at not being able to attend his father's funeral. We must be content with Captain Lennox; for I don't know of any other relation.\"\n\"I hope I may be allowed to go?\"\n\"Certainly; thankfully. You're a good fellow, after all, Thornton. Hale liked you. He spoke to me, only the other day, at Oxford. He regretted he had seen so little of you lately. I am obliged to you for wishing to show him respect.\"\n\"But about Frederick. Does he never come to England?\"\n\"Never.\"\n\"He was not over here about the time of Mrs. Hale's death?\"\n\"No. Why, I was here then. I hadn't seen Hale for years and years: and, if you remember, I came--No, it was some time after that that I came. But poor Frederick Hale was not here then. What made you think he was?\"\n\"I saw a young man walking with Miss Hale one day,\" replied Mr. Thornton, \"and I think it was about that time.\"\n\"Oh, that would be this young Lennox, the Captain's brother. He's a lawyer, and they were in pretty constant correspondence with him; and I remember Mr. Hale told me he thought he would come down. Do you know,\" said Mr. Bell, wheeling round, and shutting one eye, the better to bring the forces of the other to bear with keen scrutiny on Mr. Thornton's face, \"that I once fancied you had a little tenderness for Margaret?\"\nNo answer. No change of countenance.\n\"And so did poor Hale. Not at first, and not till I had put it into his head.\"\n\"I admired Miss Hale. Every one must do so. She is a beautiful creature,\" said Mr. Thornton, driven to bay by Mr. Bell's pertinacious questioning.\n\"Is that all! You can speak of her in that measured way, as simply a 'beautiful creature'--only something to catch the eye. I did hope you had had nobleness enough in you to make you pay her the homage of the heart. Though I believe--in fact I know, she would have rejected you, still to have loved her without return would have lifted you higher than all those, be they who they may, that have ever known her to love. 'Beautiful creature' indeed! Do you speak of her as you would of a horse or a dog?\"\nMr. Thornton's eyes glowed like red embers.\n\"Mr. Bell,\" said he, \"before you speak so, you should remember that all men are not as free to express what they feel as you are. Let us talk of something else.\" For though his heart leaped up, as at a trumpet-call, to every word that Mr. Bell had said, and though he knew that what he had said would henceforward bind the thought of the old Oxford Fellow closely up with the most precious things of his heart, yet he would not be forced into any expression of what he felt towards Margaret. He was no mocking-bird of praise to try, because another extolled what he reverenced and passionately loved, to outdo him in laudation. So he turned to some of the dry matters of business that lay between Mr. Bell and him, as landlord and tenant.\n\"What is that heap of brick and mortar we came against in the yard? Any repairs wanted?\"\n\"No, none, thank you.\"\n\"Are you building on your own account? If you are, I'm very much obliged to you.\"\n\"I'm building a dining-room--for the men I mean--the hands.\"\n\"I thought you were hard to please, if this room wasn't good enough to satisfy you, a bachelor.\"\n\"I've got acquainted with a strange kind of chap, and I put one or two children in whom he is interested to school. So, as I happened to be passing near his house one day, I just went there about some trifling payment to be made; and I saw such a miserable black frizzle of a dinner--a greasy cinder of meat, as first set me a-thinking. But it was not till provisions grew so high this winter that I bethought me how, by buying things wholesale, and cooking a good quantity of provisions together, much money might be saved, and much comfort gained. So I spoke to my friend--or my enemy--the man I told you of--and he found fault with every detail of my plan; and in consequence I laid it aside, both as impracticable, and also because if I forced it into operation I should be interfering with the independence of my men; when, suddenly, this Higgins came to me and graciously signified his approval of a scheme so nearly the same as mine, that I might fairly have claimed it; and, moreover, the approval of several of his fellow-workmen, to whom he had spoken. I was a little 'riled,' I confess, by his manner, and thought of throwing the whole thing overboard to sink or swim. But it seemed childish to relinquish a plan which I had once thought wise and well-laid, just because I myself did not receive all the honour and consequence due to the originator. So I coolly took the part assigned to me, which is something like that of a steward to a club. I buy in the provisions wholesale, and provide a fitting matron or cook.\"\n\"I hope you give satisfaction in your new capacity. Are you a good judge of potatoes and onions? But I suppose Mrs. Thornton assists you in your marketing.\"\n\"Not a bit,\" replied Mr. Thornton. \"She disapproves of the whole plan, and now we never mention it to each other. But I manage pretty well, getting in great stocks from Liverpool, and being served in butcher's meat by our own family butcher. I can assure you, the hot dinners the matron turns out are not to be despised.\"\n\"Do you taste each dish as it goes in, in virtue of your office? I hope you have a white wand.\"\n\"I was very scrupulous, at first, in confining myself to the mere purchasing part, and even in that I rather obeyed the men's orders, conveyed through the housekeeper, than went by my own judgment. At one time, the beef was too large, at another the mutton was not fat enough. I think they saw how careful I was to leave them free, and not to intrude my own ideas upon them; so, one day, two or three of the men--my friend Higgins among them--asked me if I would not come in and take a snack. It was a very busy day, but I saw that the men would be hurt if, after making the advance, I didn't meet them half-way, so I went in, and I never made a better dinner in my life. I told them (my next neighbours I mean, for I'm no speech-maker) how much I enjoyed it; and for some time, whenever that especial dinner recurred in their dietary, I was sure to be met by these men, with a 'Master, there's hot-pot for dinner to-day, win yo' come in?' If they had not asked me, I would no more have intruded on them than I'd have gone to the mess at the barracks without invitation.\"\n\"I should think you were rather a restraint on your hosts' conversation. They can't abuse the masters while you're there. I expect they take it out on non-hot-pot days.\"\n\"Well! hitherto we've steered clear of all vexed questions. But if any of the old disputes came up again, I would certainly speak out my mind next hot-pot day. But you are hardly acquainted with our Darkshire fellows, for all you're a Darkshire man yourself. They have such a sense of humour, and such a racy mode of expression! I am getting really to know some of them now, and they talk pretty freely before me.\"\n\"Nothing like the act of eating for equalising men. Dying is nothing to it. The philosopher dies sententiously--the pharisee ostentatiously--the simple-hearted humbly--the poor idiot blindly, as the sparrow falls to the ground; the philosopher and idiot, publican and pharisee, all eat after the same fashion--given an equally good digestion. There's theory for theory for you!\"\n\"Indeed I have no theory; I hate theories.\"\n\"I beg your pardon. To show my penitence, will you accept a ten pound note towards your marketing, and give the poor fellows a feast?\"\n\"Thank you; but I'd rather not. They pay me rent for the oven and cooking-places at the back of the mill: and will have to pay more for the new dining-room. I don't want it to fall into a charity. I don't want donations. Once let in the principle, and I should have people going and talking, and spoiling the simplicity of the whole thing.\"\n\"People will talk about any new plan. You can't help that.\"\n\"My enemies, if I have any, may make a philanthropic fuss about this dinner-scheme; but you are a friend, and I expect that you will now pay my experiment the respect of silence. It is but a new broom at present, and sweeps clean enough. But by-an-bye we shall meet with plenty of stumbling-blocks, no doubt.\"",
        "paragraph_chars": [
            [
                0,
                266
            ],
            [
                266,
                1582
            ],
            [
                1582,
                1726
            ],
            [
                1726,
                2027
            ],
            [
                2027,
                2237
            ],
            [
                2237,
                2318
            ],
            [
                2318,
                2554
            ],
            [
                2554,
                3197
            ],
            [
                3197,
                3869
            ],
            [
                3869,
                4149
            ],
            [
                4149,
                4426
            ],
            [
                4426,
                4715
            ],
            [
                4715,
                4817
            ],
            [
                4817,
                5201
            ],
            [
                5201,
                5489
            ],
            [
                5489,
                5892
            ],
            [
                5892,
                7181
            ],
            [
                7181,
                8568
            ],
            [
                8568,
                8853
            ],
            [
                8853,
                9063
            ],
            [
                9063,
                9112
            ],
            [
                9112,
                9276
            ],
            [
                9276,
                9357
            ],
            [
                9357,
                9371
            ],
            [
                9371,
                9415
            ],
            [
                9415,
                9539
            ],
            [
                9539,
                9742
            ],
            [
                9742,
                9796
            ],
            [
                9796,
                10454
            ],
            [
                10454,
                10580
            ],
            [
                10580,
                11729
            ],
            [
                11729,
                13315
            ],
            [
                13315,
                13564
            ],
            [
                13564,
                13595
            ],
            [
                13595,
                13653
            ],
            [
                13653,
                13724
            ],
            [
                13724,
                14065
            ],
            [
                14065,
                14485
            ],
            [
                14485,
                14879
            ],
            [
                14879,
                14988
            ],
            [
                14988,
                15092
            ],
            [
                15092,
                15149
            ],
            [
                15149,
                15260
            ],
            [
                15260,
                15321
            ],
            [
                15321,
                15561
            ],
            [
                15561,
                15594
            ],
            [
                15594,
                15828
            ],
            [
                15828,
                15882
            ],
            [
                15882,
                15891
            ],
            [
                15891,
                15951
            ],
            [
                15951,
                16165
            ],
            [
                16165,
                16277
            ],
            [
                16277,
                16700
            ],
            [
                16700,
                16737
            ],
            [
                16737,
                16816
            ],
            [
                16816,
                16963
            ],
            [
                16963,
                17466
            ],
            [
                17466,
                17510
            ],
            [
                17510,
                18249
            ],
            [
                18249,
                18338
            ],
            [
                18338,
                18361
            ],
            [
                18361,
                18443
            ],
            [
                18443,
                18504
            ],
            [
                18504,
                18601
            ],
            [
                18601,
                20131
            ],
            [
                20131,
                20288
            ],
            [
                20288,
                20610
            ],
            [
                20610,
                20706
            ],
            [
                20706,
                21778
            ],
            [
                21778,
                21948
            ],
            [
                21948,
                22363
            ],
            [
                22363,
                22742
            ],
            [
                22742,
                22786
            ],
            [
                22786,
                22921
            ],
            [
                22921,
                23262
            ],
            [
                23262,
                23322
            ],
            [
                23322,
                23631
            ]
        ],
        "segment_chars": [
            [
                0,
                190
            ],
            [
                190,
                201
            ],
            [
                201,
                251
            ],
            [
                251,
                266
            ],
            [
                266,
                292
            ],
            [
                292,
                414
            ],
            [
                414,
                520
            ],
            [
                520,
                544
            ],
            [
                544,
                856
            ],
            [
                856,
                920
            ],
            [
                920,
                975
            ],
            [
                975,
                1131
            ],
            [
                1131,
                1181
            ],
            [
                1181,
                1329
            ],
            [
                1329,
                1582
            ],
            [
                1582,
                1726
            ],
            [
                1726,
                1746
            ],
            [
                1746,
                1866
            ],
            [
                1866,
                1897
            ],
            [
                1897,
                1931
            ],
            [
                1931,
                2027
            ],
            [
                2027,
                2237
            ],
            [
                2237,
                2244
            ],
            [
                2244,
                2318
            ],
            [
                2318,
                2554
            ],
            [
                2554,
                2581
            ],
            [
                2581,
                2651
            ],
            [
                2651,
                2800
            ],
            [
                2800,
                3055
            ],
            [
                3055,
                3089
            ],
            [
                3089,
                3170
            ],
            [
                3170,
                3197
            ],
            [
                3197,
                3408
            ],
            [
                3408,
                3577
            ],
            [
                3577,
                3738
            ],
            [
                3738,
                3869
            ],
            [
                3869,
                3928
            ],
            [
                3928,
                4035
            ],
            [
                4035,
                4095
            ],
            [
                4095,
                4149
            ],
            [
                4149,
                4184
            ],
            [
                4184,
                4252
            ],
            [
                4252,
                4426
            ],
            [
                4426,
                4540
            ],
            [
                4540,
                4609
            ],
            [
                4609,
                4675
            ],
            [
                4675,
                4715
            ],
            [
                4715,
                4726
            ],
            [
                4726,
                4817
            ],
            [
                4817,
                4847
            ],
            [
                4847,
                4872
            ],
            [
                4872,
                5044
            ],
            [
                5044,
                5056
            ],
            [
                5056,
                5101
            ],
            [
                5101,
                5201
            ],
            [
                5201,
                5489
            ],
            [
                5489,
                5500
            ],
            [
                5500,
                5547
            ],
            [
                5547,
                5568
            ],
            [
                5568,
                5641
            ],
            [
                5641,
                5694
            ],
            [
                5694,
                5892
            ],
            [
                5892,
                5974
            ],
            [
                5974,
                6102
            ],
            [
                6102,
                6423
            ],
            [
                6423,
                6530
            ],
            [
                6530,
                6584
            ],
            [
                6584,
                6849
            ],
            [
                6849,
                7181
            ],
            [
                7181,
                7351
            ],
            [
                7351,
                7421
            ],
            [
                7421,
                7535
            ],
            [
                7535,
                7619
            ],
            [
                7619,
                7911
            ],
            [
                7911,
                8449
            ],
            [
                8449,
                8568
            ],
            [
                8568,
                8579
            ],
            [
                8579,
                8592
            ],
            [
                8592,
                8646
            ],
            [
                8646,
                8853
            ],
            [
                8853,
                8906
            ],
            [
                8906,
                8994
            ],
            [
                8994,
                9063
            ],
            [
                9063,
                9092
            ],
            [
                9092,
                9112
            ],
            [
                9112,
                9119
            ],
            [
                9119,
                9124
            ],
            [
                9124,
                9138
            ],
            [
                9138,
                9208
            ],
            [
                9208,
                9276
            ],
            [
                9276,
                9311
            ],
            [
                9311,
                9357
            ],
            [
                9357,
                9371
            ],
            [
                9371,
                9415
            ],
            [
                9415,
                9539
            ],
            [
                9539,
                9572
            ],
            [
                9572,
                9742
            ],
            [
                9742,
                9796
            ],
            [
                9796,
                9844
            ],
            [
                9844,
                9963
            ],
            [
                9963,
                10023
            ],
            [
                10023,
                10227
            ],
            [
                10227,
                10348
            ],
            [
                10348,
                10454
            ],
            [
                10454,
                10580
            ],
            [
                10580,
                10614
            ],
            [
                10614,
                10620
            ],
            [
                10620,
                10814
            ],
            [
                10814,
                11271
            ],
            [
                11271,
                11276
            ],
            [
                11276,
                11489
            ],
            [
                11489,
                11729
            ],
            [
                11729,
                11936
            ],
            [
                11936,
                11999
            ],
            [
                11999,
                12347
            ],
            [
                12347,
                12638
            ],
            [
                12638,
                12840
            ],
            [
                12840,
                13206
            ],
            [
                13206,
                13315
            ],
            [
                13315,
                13375
            ],
            [
                13375,
                13564
            ],
            [
                13564,
                13584
            ],
            [
                13584,
                13595
            ],
            [
                13595,
                13653
            ],
            [
                13653,
                13724
            ],
            [
                13724,
                13763
            ],
            [
                13763,
                14003
            ],
            [
                14003,
                14065
            ],
            [
                14065,
                14167
            ],
            [
                14167,
                14348
            ],
            [
                14348,
                14431
            ],
            [
                14431,
                14485
            ],
            [
                14485,
                14516
            ],
            [
                14516,
                14555
            ],
            [
                14555,
                14584
            ],
            [
                14584,
                14656
            ],
            [
                14656,
                14826
            ],
            [
                14826,
                14879
            ],
            [
                14879,
                14892
            ],
            [
                14892,
                14916
            ],
            [
                14916,
                14928
            ],
            [
                14928,
                14945
            ],
            [
                14945,
                14988
            ],
            [
                14988,
                15028
            ],
            [
                15028,
                15050
            ],
            [
                15050,
                15068
            ],
            [
                15068,
                15092
            ],
            [
                15092,
                15124
            ],
            [
                15124,
                15137
            ],
            [
                15137,
                15149
            ],
            [
                15149,
                15260
            ],
            [
                15260,
                15300
            ],
            [
                15300,
                15321
            ],
            [
                15321,
                15332
            ],
            [
                15332,
                15402
            ],
            [
                15402,
                15415
            ],
            [
                15415,
                15480
            ],
            [
                15480,
                15561
            ],
            [
                15561,
                15594
            ],
            [
                15594,
                15618
            ],
            [
                15618,
                15661
            ],
            [
                15661,
                15677
            ],
            [
                15677,
                15724
            ],
            [
                15724,
                15774
            ],
            [
                15774,
                15828
            ],
            [
                15828,
                15850
            ],
            [
                15850,
                15882
            ],
            [
                15882,
                15891
            ],
            [
                15891,
                15951
            ],
            [
                15951,
                15956
            ],
            [
                15956,
                15978
            ],
            [
                15978,
                16093
            ],
            [
                16093,
                16136
            ],
            [
                16136,
                16165
            ],
            [
                16165,
                16277
            ],
            [
                16277,
                16338
            ],
            [
                16338,
                16474
            ],
            [
                16474,
                16700
            ],
            [
                16700,
                16711
            ],
            [
                16711,
                16737
            ],
            [
                16737,
                16760
            ],
            [
                16760,
                16816
            ],
            [
                16816,
                16838
            ],
            [
                16838,
                16860
            ],
            [
                16860,
                16963
            ],
            [
                16963,
                16977
            ],
            [
                16977,
                17087
            ],
            [
                17087,
                17179
            ],
            [
                17179,
                17382
            ],
            [
                17382,
                17411
            ],
            [
                17411,
                17466
            ],
            [
                17466,
                17510
            ],
            [
                17510,
                17640
            ],
            [
                17640,
                17672
            ],
            [
                17672,
                18002
            ],
            [
                18002,
                18138
            ],
            [
                18138,
                18249
            ],
            [
                18249,
                18317
            ],
            [
                18317,
                18338
            ],
            [
                18338,
                18361
            ],
            [
                18361,
                18400
            ],
            [
                18400,
                18443
            ],
            [
                18443,
                18504
            ],
            [
                18504,
                18601
            ],
            [
                18601,
                18717
            ],
            [
                18717,
                18938
            ],
            [
                18938,
                19151
            ],
            [
                19151,
                19664
            ],
            [
                19664,
                19781
            ],
            [
                19781,
                19962
            ],
            [
                19962,
                20057
            ],
            [
                20057,
                20131
            ],
            [
                20131,
                20183
            ],
            [
                20183,
                20228
            ],
            [
                20228,
                20288
            ],
            [
                20288,
                20323
            ],
            [
                20323,
                20402
            ],
            [
                20402,
                20530
            ],
            [
                20530,
                20610
            ],
            [
                20610,
                20675
            ],
            [
                20675,
                20706
            ],
            [
                20706,
                20904
            ],
            [
                20904,
                20983
            ],
            [
                20983,
                21199
            ],
            [
                21199,
                21378
            ],
            [
                21378,
                21646
            ],
            [
                21646,
                21778
            ],
            [
                21778,
                21851
            ],
            [
                21851,
                21900
            ],
            [
                21900,
                21948
            ],
            [
                21948,
                21955
            ],
            [
                21955,
                22008
            ],
            [
                22008,
                22108
            ],
            [
                22108,
                22207
            ],
            [
                22207,
                22277
            ],
            [
                22277,
                22363
            ],
            [
                22363,
                22415
            ],
            [
                22415,
                22439
            ],
            [
                22439,
                22706
            ],
            [
                22706,
                22742
            ],
            [
                22742,
                22786
            ],
            [
                22786,
                22806
            ],
            [
                22806,
                22921
            ],
            [
                22921,
                22953
            ],
            [
                22953,
                23078
            ],
            [
                23078,
                23118
            ],
            [
                23118,
                23142
            ],
            [
                23142,
                23262
            ],
            [
                23262,
                23300
            ],
            [
                23300,
                23322
            ],
            [
                23322,
                23501
            ],
            [
                23501,
                23560
            ],
            [
                23560,
                23631
            ]
        ],
        "overlap_chars": [
            [
                266,
                292
            ],
            [
                292,
                300
            ],
            [
                341,
                348
            ],
            [
                380,
                387
            ],
            [
                412,
                414
            ],
            [
                414,
                452
            ],
            [
                518,
                520
            ],
            [
                520,
                544
            ],
            [
                544,
                692
            ],
            [
                854,
                856
            ],
            [
                875,
                920
            ],
            [
                920,
                966
            ],
            [
                973,
                975
            ],
            [
                975,
                1068
            ],
            [
                1074,
                1081
            ],
            [
                1093,
                1131
            ],
            [
                1131,
                1172
            ],
            [
                1277,
                1282
            ],
            [
                1308,
                1329
            ],
            [
                1410,
                1420
            ],
            [
                1448,
                1461
            ],
            [
                1363,
                1371
            ],
            [
                1465,
                1487
            ],
            [
                1462,
                1465
            ],
            [
                1488,
                1492
            ],
            [
                1501,
                1505
            ],
            [
                1542,
                1563
            ],
            [
                1577,
                1582
            ],
            [
                1582,
                1608
            ],
            [
                1688,
                1726
            ],
            [
                1727,
                1746
            ],
            [
                1746,
                1761
            ],
            [
                1770,
                1789
            ],
            [
                1794,
                1815
            ],
            [
                1790,
                1793
            ],
            [
                1864,
                1866
            ],
            [
                1866,
                1897
            ],
            [
                1897,
                1931
            ],
            [
                1931,
                1977
            ],
            [
                2027,
                2043
            ],
            [
                2059,
                2064
            ],
            [
                2066,
                2087
            ],
            [
                2111,
                2141
            ],
            [
                2143,
                2188
            ],
            [
                2102,
                2105
            ],
            [
                2200,
                2237
            ],
            [
                2238,
                2244
            ],
            [
                2267,
                2283
            ],
            [
                2289,
                2293
            ],
            [
                2297,
                2315
            ],
            [
                2319,
                2327
            ],
            [
                2344,
                2426
            ],
            [
                2429,
                2439
            ],
            [
                2552,
                2554
            ],
            [
                2555,
                2574
            ],
            [
                2581,
                2608
            ],
            [
                2612,
                2620
            ],
            [
                2649,
                2651
            ],
            [
                2845,
                2846
            ],
            [
                2804,
                2818
            ],
            [
                2826,
                2844
            ],
            [
                2846,
                2862
            ],
            [
                2864,
                2916
            ],
            [
                2934,
                2942
            ],
            [
                2800,
                2803
            ],
            [
                2944,
                2954
            ],
            [
                2966,
                3021
            ],
            [
                3055,
                3087
            ],
            [
                3197,
                3239
            ],
            [
                3240,
                3249
            ],
            [
                3428,
                3438
            ],
            [
                3295,
                3297
            ],
            [
                3406,
                3407
            ],
            [
                3408,
                3417
            ],
            [
                3498,
                3523
            ],
            [
                3525,
                3577
            ],
            [
                3577,
                3596
            ],
            [
                3694,
                3695
            ],
            [
                3597,
                3640
            ],
            [
                3736,
                3738
            ],
            [
                3781,
                3783
            ],
            [
                3738,
                3744
            ],
            [
                3749,
                3758
            ],
            [
                3759,
                3771
            ],
            [
                3840,
                3846
            ],
            [
                3805,
                3839
            ],
            [
                3847,
                3869
            ],
            [
                3873,
                3928
            ],
            [
                3971,
                4004
            ],
            [
                4009,
                4033
            ],
            [
                3935,
                3939
            ],
            [
                3946,
                3952
            ],
            [
                3965,
                3970
            ],
            [
                4062,
                4071
            ],
            [
                4084,
                4095
            ],
            [
                4095,
                4146
            ],
            [
                4149,
                4182
            ],
            [
                4210,
                4211
            ],
            [
                4184,
                4204
            ],
            [
                4250,
                4252
            ],
            [
                4252,
                4286
            ],
            [
                4288,
                4305
            ],
            [
                4313,
                4423
            ],
            [
                4437,
                4440
            ],
            [
                4443,
                4453
            ],
            [
                4538,
                4540
            ],
            [
                4610,
                4613
            ],
            [
                4623,
                4631
            ],
            [
                4633,
                4666
            ],
            [
                4668,
                4675
            ],
            [
                4675,
                4712
            ],
            [
                4716,
                4723
            ],
            [
                4726,
                4734
            ],
            [
                4748,
                4749
            ],
            [
                4735,
                4748
            ],
            [
                4815,
                4817
            ],
            [
                4818,
                4835
            ],
            [
                4837,
                4847
            ],
            [
                4847,
                4863
            ],
            [
                4870,
                4872
            ],
            [
                4872,
                4906
            ],
            [
                4910,
                4918
            ],
            [
                4934,
                4940
            ],
            [
                4926,
                4929
            ],
            [
                4944,
                4948
            ],
            [
                4959,
                4980
            ],
            [
                5017,
                5044
            ],
            [
                5044,
                5056
            ],
            [
                5056,
                5080
            ],
            [
                5088,
                5101
            ],
            [
                5101,
                5129
            ],
            [
                5138,
                5156
            ],
            [
                5165,
                5198
            ],
            [
                5201,
                5262
            ],
            [
                5365,
                5415
            ],
            [
                5417,
                5434
            ],
            [
                5437,
                5445
            ],
            [
                5449,
                5489
            ],
            [
                5490,
                5497
            ],
            [
                5500,
                5521
            ],
            [
                5523,
                5547
            ],
            [
                5547,
                5566
            ],
            [
                5732,
                5892
            ],
            [
                5892,
                5974
            ],
            [
                5974,
                6038
            ],
            [
                6100,
                6102
            ],
            [
                6104,
                6110
            ],
            [
                6166,
                6168
            ],
            [
                6110,
                6111
            ],
            [
                6180,
                6182
            ],
            [
                6263,
                6336
            ],
            [
                6421,
                6422
            ],
            [
                6436,
                6457
            ],
            [
                6495,
                6503
            ],
            [
                6478,
                6481
            ],
            [
                6462,
                6470
            ],
            [
                6528,
                6530
            ],
            [
                6530,
                6560
            ],
            [
                6574,
                6584
            ],
            [
                6584,
                6620
            ],
            [
                6666,
                6667
            ],
            [
                6622,
                6666
            ],
            [
                6689,
                6693
            ],
            [
                6728,
                6747
            ],
            [
                6828,
                6838
            ],
            [
                6757,
                6761
            ],
            [
                6752,
                6756
            ],
            [
                6776,
                6781
            ],
            [
                6788,
                6824
            ],
            [
                6847,
                6849
            ],
            [
                6940,
                6970
            ],
            [
                6927,
                6929
            ],
            [
                7092,
                7102
            ],
            [
                7131,
                7147
            ],
            [
                7179,
                7181
            ],
            [
                7181,
                7221
            ],
            [
                7227,
                7251
            ],
            [
                7272,
                7315
            ],
            [
                7344,
                7351
            ],
            [
                7351,
                7384
            ],
            [
                7401,
                7421
            ],
            [
                7535,
                7619
            ],
            [
                7619,
                7666
            ],
            [
                7672,
                7699
            ],
            [
                7857,
                7860
            ],
            [
                7825,
                7828
            ],
            [
                7748,
                7763
            ],
            [
                7895,
                7900
            ],
            [
                7721,
                7723
            ],
            [
                7909,
                7911
            ],
            [
                8280,
                8294
            ],
            [
                8302,
                8361
            ],
            [
                8368,
                8403
            ],
            [
                8437,
                8449
            ],
            [
                8518,
                8524
            ],
            [
                8535,
                8554
            ],
            [
                8563,
                8568
            ],
            [
                8573,
                8579
            ],
            [
                8579,
                8592
            ],
            [
                8592,
                8599
            ],
            [
                8619,
                8643
            ],
            [
                8646,
                8707
            ],
            [
                8851,
                8853
            ],
            [
                8854,
                8906
            ],
            [
                8906,
                8920
            ],
            [
                8928,
                8961
            ],
            [
                8972,
                8994
            ],
            [
                8994,
                9060
            ],
            [
                9073,
                9089
            ],
            [
                9092,
                9112
            ],
            [
                9119,
                9124
            ],
            [
                9124,
                9138
            ],
            [
                9216,
                9273
            ],
            [
                9277,
                9311
            ],
            [
                9311,
                9336
            ],
            [
                9347,
                9354
            ],
            [
                9421,
                9425
            ],
            [
                9431,
                9527
            ],
            [
                9539,
                9572
            ],
            [
                9572,
                9619
            ],
            [
                9636,
                9707
            ],
            [
                9727,
                9736
            ],
            [
                9740,
                9742
            ],
            [
                9742,
                9796
            ],
            [
                9845,
                9848
            ],
            [
                9849,
                9876
            ],
            [
                9904,
                9905
            ],
            [
                9916,
                9963
            ],
            [
                9963,
                10023
            ],
            [
                10023,
                10092
            ],
            [
                10094,
                10139
            ],
            [
                10227,
                10299
            ],
            [
                10308,
                10348
            ],
            [
                10348,
                10375
            ],
            [
                10385,
                10403
            ],
            [
                10407,
                10417
            ],
            [
                10376,
                10378
            ],
            [
                10494,
                10535
            ],
            [
                10568,
                10577
            ],
            [
                10581,
                10611
            ],
            [
                10614,
                10620
            ],
            [
                10620,
                10680
            ],
            [
                10682,
                10713
            ],
            [
                10714,
                10741
            ],
            [
                10793,
                10812
            ],
            [
                10812,
                10814
            ],
            [
                10891,
                10910
            ],
            [
                10915,
                10939
            ],
            [
                10962,
                10986
            ],
            [
                11066,
                11096
            ],
            [
                10988,
                10993
            ],
            [
                11146,
                11152
            ],
            [
                10999,
                11007
            ],
            [
                11036,
                11039
            ],
            [
                11197,
                11271
            ],
            [
                11271,
                11276
            ],
            [
                11276,
                11304
            ],
            [
                11337,
                11373
            ],
            [
                11465,
                11489
            ],
            [
                11489,
                11551
            ],
            [
                11567,
                11609
            ],
            [
                11622,
                11652
            ],
            [
                11727,
                11729
            ],
            [
                11729,
                11804
            ],
            [
                11811,
                11884
            ],
            [
                11885,
                11928
            ],
            [
                11929,
                11936
            ],
            [
                11936,
                11999
            ],
            [
                12057,
                12150
            ],
            [
                12160,
                12167
            ],
            [
                12179,
                12205
            ],
            [
                12210,
                12241
            ],
            [
                12345,
                12347
            ],
            [
                12347,
                12389
            ],
            [
                12411,
                12430
            ],
            [
                12432,
                12548
            ],
            [
                12553,
                12559
            ],
            [
                12636,
                12637
            ],
            [
                12638,
                12703
            ],
            [
                12753,
                12812
            ],
            [
                12821,
                12840
            ],
            [
                12840,
                12863
            ],
            [
                12889,
                12918
            ],
            [
                12928,
                12991
            ],
            [
                13026,
                13035
            ],
            [
                13060,
                13062
            ],
            [
                13046,
                13051
            ],
            [
                13069,
                13132
            ],
            [
                13144,
                13170
            ],
            [
                13204,
                13205
            ],
            [
                13315,
                13353
            ],
            [
                13366,
                13375
            ],
            [
                13565,
                13581
            ],
            [
                13584,
                13595
            ],
            [
                13596,
                13650
            ],
            [
                13654,
                13721
            ],
            [
                13725,
                13763
            ],
            [
                13763,
                13799
            ],
            [
                13810,
                13811
            ],
            [
                13805,
                13809
            ],
            [
                13812,
                13826
            ],
            [
                13879,
                14003
            ],
            [
                14003,
                14062
            ],
            [
                14070,
                14089
            ],
            [
                14092,
                14167
            ],
            [
                14168,
                14177
            ],
            [
                14206,
                14291
            ],
            [
                14352,
                14401
            ],
            [
                14418,
                14431
            ],
            [
                14431,
                14485
            ],
            [
                14491,
                14516
            ],
            [
                14584,
                14656
            ],
            [
                14656,
                14770
            ],
            [
                14824,
                14826
            ],
            [
                14826,
                14876
            ],
            [
                14880,
                14889
            ],
            [
                14892,
                14916
            ],
            [
                14917,
                14928
            ],
            [
                14928,
                14938
            ],
            [
                14945,
                14961
            ],
            [
                14986,
                14988
            ],
            [
                14989,
                14998
            ],
            [
                15001,
                15028
            ],
            [
                15029,
                15050
            ],
            [
                15050,
                15066
            ],
            [
                15093,
                15122
            ],
            [
                15154,
                15215
            ],
            [
                15217,
                15257
            ],
            [
                15261,
                15300
            ],
            [
                15300,
                15318
            ],
            [
                15322,
                15332
            ],
            [
                15332,
                15382
            ],
            [
                15400,
                15402
            ],
            [
                15402,
                15415
            ],
            [
                15415,
                15478
            ],
            [
                15562,
                15591
            ],
            [
                15595,
                15604
            ],
            [
                15616,
                15618
            ],
            [
                15618,
                15639
            ],
            [
                15651,
                15661
            ],
            [
                15661,
                15675
            ],
            [
                15829,
                15850
            ],
            [
                15850,
                15879
            ],
            [
                15883,
                15888
            ],
            [
                15892,
                15948
            ],
            [
                15952,
                15956
            ],
            [
                15956,
                15976
            ],
            [
                16048,
                16068
            ],
            [
                16091,
                16093
            ],
            [
                16093,
                16111
            ],
            [
                16117,
                16136
            ],
            [
                16136,
                16162
            ],
            [
                16166,
                16214
            ],
            [
                16237,
                16238
            ],
            [
                16259,
                16274
            ],
            [
                16217,
                16237
            ],
            [
                16278,
                16295
            ],
            [
                16301,
                16338
            ],
            [
                16338,
                16410
            ],
            [
                16415,
                16474
            ],
            [
                16474,
                16485
            ],
            [
                16488,
                16518
            ],
            [
                16637,
                16697
            ],
            [
                16700,
                16711
            ],
            [
                16711,
                16737
            ],
            [
                16738,
                16758
            ],
            [
                16772,
                16773
            ],
            [
                16778,
                16813
            ],
            [
                16817,
                16838
            ],
            [
                16848,
                16860
            ],
            [
                16860,
                16887
            ],
            [
                16890,
                16908
            ],
            [
                16919,
                16922
            ],
            [
                16961,
                16963
            ],
            [
                16964,
                16977
            ],
            [
                16977,
                17031
            ],
            [
                17033,
                17051
            ],
            [
                17054,
                17087
            ],
            [
                17087,
                17179
            ],
            [
                17179,
                17195
            ],
            [
                17213,
                17324
            ],
            [
                17348,
                17357
            ],
            [
                17363,
                17368
            ],
            [
                17369,
                17372
            ],
            [
                17380,
                17382
            ],
            [
                17383,
                17401
            ],
            [
                17403,
                17411
            ],
            [
                17411,
                17463
            ],
            [
                17466,
                17497
            ],
            [
                17502,
                17510
            ],
            [
                17513,
                17514
            ],
            [
                17515,
                17519
            ],
            [
                17522,
                17530
            ],
            [
                17590,
                17593
            ],
            [
                17578,
                17589
            ],
            [
                17594,
                17640
            ],
            [
                17640,
                17669
            ],
            [
                17672,
                17763
            ],
            [
                17925,
                18002
            ],
            [
                18002,
                18034
            ],
            [
                18109,
                18113
            ],
            [
                18038,
                18041
            ],
            [
                18087,
                18090
            ],
            [
                18114,
                18117
            ],
            [
                18117,
                18119
            ],
            [
                18051,
                18058
            ],
            [
                18136,
                18138
            ],
            [
                18138,
                18158
            ],
            [
                18170,
                18249
            ],
            [
                18250,
                18317
            ],
            [
                18362,
                18378
            ],
            [
                18444,
                18470
            ],
            [
                18472,
                18483
            ],
            [
                18492,
                18501
            ],
            [
                18602,
                18705
            ],
            [
                18709,
                18717
            ],
            [
                18724,
                18748
            ],
            [
                18754,
                18772
            ],
            [
                18829,
                18883
            ],
            [
                18885,
                18912
            ],
            [
                18919,
                18938
            ],
            [
                19019,
                19074
            ],
            [
                19089,
                19151
            ],
            [
                19151,
                19164
            ],
            [
                19193,
                19196
            ],
            [
                19631,
                19632
            ],
            [
                19212,
                19264
            ],
            [
                19197,
                19198
            ],
            [
                19652,
                19655
            ],
            [
                19282,
                19296
            ],
            [
                19424,
                19452
            ],
            [
                19468,
                19577
            ],
            [
                19662,
                19664
            ],
            [
                19664,
                19678
            ],
            [
                19680,
                19685
            ],
            [
                19688,
                19697
            ],
            [
                19712,
                19763
            ],
            [
                19779,
                19781
            ],
            [
                19781,
                19784
            ],
            [
                19788,
                19794
            ],
            [
                19818,
                19819
            ],
            [
                19795,
                19803
            ],
            [
                19962,
                20035
            ],
            [
                20038,
                20057
            ],
            [
                20057,
                20105
            ],
            [
                20124,
                20128
            ],
            [
                20132,
                20160
            ],
            [
                20181,
                20183
            ],
            [
                20183,
                20228
            ],
            [
                20228,
                20267
            ],
            [
                20289,
                20298
            ],
            [
                20301,
                20323
            ],
            [
                20328,
                20357
            ],
            [
                20400,
                20402
            ],
            [
                20402,
                20471
            ],
            [
                20498,
                20502
            ],
            [
                20506,
                20530
            ],
            [
                20530,
                20567
            ],
            [
                20575,
                20588
            ],
            [
                20593,
                20607
            ],
            [
                20614,
                20647
            ],
            [
                20707,
                20766
            ],
            [
                20787,
                20807
            ],
            [
                20815,
                20838
            ],
            [
                20808,
                20814
            ],
            [
                20874,
                20878
            ],
            [
                20887,
                20904
            ],
            [
                20904,
                20983
            ],
            [
                20983,
                21017
            ],
            [
                21042,
                21093
            ],
            [
                21107,
                21117
            ],
            [
                21119,
                21147
            ],
            [
                21155,
                21157
            ],
            [
                21018,
                21020
            ],
            [
                21173,
                21199
            ],
            [
                21199,
                21262
            ],
            [
                21290,
                21298
            ],
            [
                21317,
                21378
            ],
            [
                21378,
                21389
            ],
            [
                21443,
                21453
            ],
            [
                21454,
                21483
            ],
            [
                21410,
                21411
            ],
            [
                21556,
                21583
            ],
            [
                21585,
                21619
            ],
            [
                21626,
                21640
            ],
            [
                21584,
                21585
            ],
            [
                21779,
                21851
            ],
            [
                21851,
                21898
            ],
            [
                21949,
                21955
            ],
            [
                22012,
                22046
            ],
            [
                22052,
                22108
            ],
            [
                22108,
                22207
            ],
            [
                22207,
                22277
            ],
            [
                22277,
                22289
            ],
            [
                22297,
                22360
            ],
            [
                22364,
                22415
            ],
            [
                22828,
                22918
            ],
            [
                22928,
                22953
            ],
            [
                22953,
                23025
            ],
            [
                23076,
                23078
            ],
            [
                23078,
                23118
            ],
            [
                23118,
                23142
            ],
            [
                23560,
                23567
            ],
            [
                23569,
                23570
            ],
            [
                23574,
                23629
            ]
        ],
        "row_chars": [
            [
                0,
                190
            ],
            [
                190,
                201
            ],
            [
                201,
                251
            ],
            [
                251,
                266
            ],
            [
                266,
                292
            ],
            [
                292,
                414
            ],
            [
                414,
                520
            ],
            [
                520,
                544
            ],
            [
                544,
                856
            ],
            [
                856,
                920
            ],
            [
                920,
                975
            ],
            [
                975,
                1131
            ],
            [
                1131,
                1329
            ],
            [
                1329,
                1582
            ],
            [
                1582,
                1726
            ],
            [
                1726,
                1746
            ],
            [
                1746,
                1866
            ],
            [
                1866,
                1897
            ],
            [
                1897,
                1931
            ],
            [
                1931,
                2027
            ],
            [
                2027,
                2237
            ],
            [
                2237,
                2244
            ],
            [
                2244,
                2318
            ],
            [
                2318,
                2554
            ],
            [
                2554,
                2651
            ],
            [
                2651,
                2800
            ],
            [
                2800,
                3055
            ],
            [
                3055,
                3089
            ],
            [
                3089,
                3170
            ],
            [
                3170,
                3197
            ],
            [
                3197,
                3577
            ],
            [
                3577,
                3738
            ],
            [
                3738,
                3869
            ],
            [
                3869,
                3928
            ],
            [
                3928,
                4095
            ],
            [
                4095,
                4149
            ],
            [
                4149,
                4252
            ],
            [
                4252,
                4426
            ],
            [
                4426,
                4540
            ],
            [
                4540,
                4609
            ],
            [
                4609,
                4675
            ],
            [
                4675,
                4715
            ],
            [
                4715,
                4726
            ],
            [
                4726,
                4817
            ],
            [
                4817,
                4847
            ],
            [
                4847,
                4872
            ],
            [
                4872,
                5044
            ],
            [
                5044,
                5056
            ],
            [
                5056,
                5101
            ],
            [
                5101,
                5201
            ],
            [
                5201,
                5489
            ],
            [
                5489,
                5500
            ],
            [
                5500,
                5547
            ],
            [
                5547,
                5568
            ],
            [
                5568,
                5641
            ],
            [
                5641,
                5694
            ],
            [
                5694,
                5892
            ],
            [
                5892,
                5974
            ],
            [
                5974,
                6102
            ],
            [
                6102,
                6423
            ],
            [
                6423,
                6530
            ],
            [
                6530,
                6584
            ],
            [
                6584,
                6849
            ],
            [
                6849,
                7181
            ],
            [
                7181,
                7351
            ],
            [
                7351,
                7421
            ],
            [
                7421,
                7535
            ],
            [
                7535,
                7619
            ],
            [
                7619,
                7911
            ],
            [
                7911,
                8449
            ],
            [
                8449,
                8568
            ],
            [
                8568,
                8579
            ],
            [
                8579,
                8592
            ],
            [
                8592,
                8646
            ],
            [
                8646,
                8853
            ],
            [
                8853,
                8906
            ],
            [
                8906,
                8994
            ],
            [
                8994,
                9063
            ],
            [
                9063,
                9092
            ],
            [
                9092,
                9112
            ],
            [
                9112,
                9119
            ],
            [
                9119,
                9124
            ],
            [
                9124,
                9138
            ],
            [
                9138,
                9208
            ],
            [
                9208,
                9276
            ],
            [
                9276,
                9311
            ],
            [
                9311,
                9357
            ],
            [
                9357,
                9371
            ],
            [
                9371,
                9415
            ],
            [
                9415,
                9539
            ],
            [
                9539,
                9572
            ],
            [
                9572,
                9742
            ],
            [
                9742,
                9796
            ],
            [
                9796,
                9844
            ],
            [
                9844,
                9963
            ],
            [
                9963,
                10023
            ],
            [
                10023,
                10227
            ],
            [
                10227,
                10348
            ],
            [
                10348,
                10454
            ],
            [
                10454,
                10614
            ],
            [
                10614,
                10620
            ],
            [
                10620,
                10814
            ],
            [
                10814,
                11271
            ],
            [
                11271,
                11276
            ],
            [
                11276,
                11489
            ],
            [
                11489,
                11729
            ],
            [
                11729,
                11936
            ],
            [
                11936,
                11999
            ],
            [
                11999,
                12347
            ],
            [
                12347,
                12638
            ],
            [
                12638,
                12840
            ],
            [
                12840,
                13206
            ],
            [
                13206,
                13315
            ],
            [
                13315,
                13375
            ],
            [
                13375,
                13564
            ],
            [
                13564,
                13584
            ],
            [
                13584,
                13595
            ],
            [
                13595,
                13653
            ],
            [
                13653,
                13724
            ],
            [
                13724,
                13763
            ],
            [
                13763,
                14003
            ],
            [
                14003,
                14065
            ],
            [
                14065,
                14167
            ],
            [
                14167,
                14348
            ],
            [
                14348,
                14431
            ],
            [
                14431,
                14485
            ],
            [
                14485,
                14516
            ],
            [
                14516,
                14555
            ],
            [
                14555,
                14584
            ],
            [
                14584,
                14656
            ],
            [
                14656,
                14826
            ],
            [
                14826,
                14879
            ],
            [
                14879,
                14892
            ],
            [
                14892,
                14916
            ],
            [
                14916,
                14928
            ],
            [
                14928,
                14945
            ],
            [
                14945,
                14988
            ],
            [
                14988,
                15028
            ],
            [
                15028,
                15050
            ],
            [
                15050,
                15068
            ],
            [
                15068,
                15092
            ],
            [
                15092,
                15124
            ],
            [
                15124,
                15137
            ],
            [
                15137,
                15149
            ],
            [
                15149,
                15260
            ],
            [
                15260,
                15300
            ],
            [
                15300,
                15321
            ],
            [
                15321,
                15332
            ],
            [
                15332,
                15402
            ],
            [
                15402,
                15415
            ],
            [
                15415,
                15480
            ],
            [
                15480,
                15561
            ],
            [
                15561,
                15594
            ],
            [
                15594,
                15618
            ],
            [
                15618,
                15661
            ],
            [
                15661,
                15677
            ],
            [
                15677,
                15724
            ],
            [
                15724,
                15774
            ],
            [
                15774,
                15828
            ],
            [
                15828,
                15850
            ],
            [
                15850,
                15882
            ],
            [
                15882,
                15891
            ],
            [
                15891,
                15951
            ],
            [
                15951,
                15956
            ],
            [
                15956,
                16093
            ],
            [
                16093,
                16136
            ],
            [
                16136,
                16165
            ],
            [
                16165,
                16277
            ],
            [
                16277,
                16338
            ],
            [
                16338,
                16474
            ],
            [
                16474,
                16700
            ],
            [
                16700,
                16711
            ],
            [
                16711,
                16737
            ],
            [
                16737,
                16816
            ],
            [
                16816,
                16838
            ],
            [
                16838,
                16860
            ],
            [
                16860,
                16963
            ],
            [
                16963,
                16977
            ],
            [
                16977,
                17087
            ],
            [
                17087,
                17179
            ],
            [
                17179,
                17382
            ],
            [
                17382,
                17411
            ],
            [
                17411,
                17466
            ],
            [
                17466,
                17510
            ],
            [
                17510,
                17640
            ],
            [
                17640,
                17672
            ],
            [
                17672,
                18002
            ],
            [
                18002,
                18138
            ],
            [
                18138,
                18249
            ],
            [
                18249,
                18317
            ],
            [
                18317,
                18338
            ],
            [
                18338,
                18361
            ],
            [
                18361,
                18443
            ],
            [
                18443,
                18504
            ],
            [
                18504,
                18601
            ],
            [
                18601,
                18717
            ],
            [
                18717,
                18938
            ],
            [
                18938,
                19151
            ],
            [
                19151,
                19664
            ],
            [
                19664,
                19781
            ],
            [
                19781,
                20057
            ],
            [
                20057,
                20131
            ],
            [
                20131,
                20183
            ],
            [
                20183,
                20228
            ],
            [
                20228,
                20288
            ],
            [
                20288,
                20323
            ],
            [
                20323,
                20402
            ],
            [
                20402,
                20530
            ],
            [
                20530,
                20610
            ],
            [
                20610,
                20675
            ],
            [
                20675,
                20706
            ],
            [
                20706,
                20904
            ],
            [
                20904,
                20983
            ],
            [
                20983,
                21199
            ],
            [
                21199,
                21378
            ],
            [
                21378,
                21646
            ],
            [
                21646,
                21778
            ],
            [
                21778,
                21851
            ],
            [
                21851,
                21900
            ],
            [
                21900,
                21948
            ],
            [
                21948,
                21955
            ],
            [
                21955,
                22008
            ],
            [
                22008,
                22108
            ],
            [
                22108,
                22207
            ],
            [
                22207,
                22277
            ],
            [
                22277,
                22363
            ],
            [
                22363,
                22415
            ],
            [
                22415,
                22439
            ],
            [
                22439,
                22706
            ],
            [
                22706,
                22742
            ],
            [
                22742,
                22786
            ],
            [
                22786,
                22806
            ],
            [
                22806,
                22921
            ],
            [
                22921,
                22953
            ],
            [
                22953,
                23078
            ],
            [
                23078,
                23118
            ],
            [
                23118,
                23142
            ],
            [
                23142,
                23262
            ],
            [
                23262,
                23300
            ],
            [
                23300,
                23322
            ],
            [
                23322,
                23501
            ],
            [
                23501,
                23560
            ],
            [
                23560,
                23631
            ]
        ]
    },
    "abridged": {
        "text": "The shock had been great. Margaret did not sob or even speak. She lay on the sofa with her eyes shut. Mr. Bell was perplexed. He dared not leave her; he dared not ask her to accompany him back to Oxford, which had been one of the plans he had formed on the journey to Milton. He sat by the fire, considering what he had better do. Margaret lay motionless, and almost breathless. He would not leave her, even for the dinner which Dixon had prepared for him downstairs, and, sobbing, would fain have tempted him to eat. He had a plateful of something brought up, but it tasted like sawdust. When Dixon tried to feed Margaret, the languid shake of her head indicated that food would only choke her.\nMr. Bell gave a great sigh, and followed Dixon out of the room.\n'I can't leave her. I must write to Oxford, to see that preparations are made for the funeral. Can't Mrs. Lennox come to her? I'll write and tell her she must. The girl must have some woman-friend about her.'\nDixon was crying; but after wiping her eyes, she managed to tell Mr. Bell that Mrs. Lennox was too near her confinement with her second child to undertake any journey at present.\n'Well! Mrs. Shaw; she's back in England, isn't she?'\n'Yes, sir; but I don't think she will like to leave Mrs. Lennox at such an interesting time,' said Dixon.\n'Interesting time be-' Mr. Bell restricted himself to coughing. 'What does that prosperous woman's \"interesting time\" signify, in comparison with that poor creature there - homeless and friendless - lying as still on that sofa as if it were an altar-tomb? I tell you, Mrs. Shaw shall come.'\nAccordingly Mr. Bell wrote a letter, which did not give Mrs. Shaw the option of refusing. If he had, she might not have come - true and sincere as was her sympathy with Margaret. It needed the sharp, uncourteous command to make her conquer her inertia. She allowed her things to be packed by her maid; and Edith, in cap, shawls, and tears, called to her mother, as Captain Lennox was taking her down to the carriage:\n'Don't forget, mamma; Margaret must come and live with us. You must send word by Mr. Bell to Cosmo when we're to expect you: Cosmo will be in Oxford, and can go on to Milton. Don't forget, mamma; you are to bring back Margaret.'\nEdith re-entered the drawing-room, where Mr. Henry Lennox was. Without lifting his head, he said, 'If you don't like Cosmo to be so long absent from you, Edith, I hope you will let me go down to Milton, and give what assistance I can.'\n'Thank you,' said Edith. 'Dear Margaret! won't it be nice to have her here again? You were both great allies, years ago.'\n'Were we?' asked he, indifferently.\n'Well, perhaps not - I forget. I was so full of Cosmo. But doesn't it fall out well, that my uncle should die just after we are come home, and ready to receive Margaret? Poor thing! what a change it will be from Milton! I'll have new chintz for her bedroom, and make it look bright, and cheer her up a little.'\nIn the same spirit of kindness, Mrs. Shaw journeyed to Milton planning how soon she could get Margaret away from 'that horrid place,' and back into the pleasant comforts of Harley Street.\n'Oh dear!' she said to her maid; 'look at those chimneys! My poor sister Hale!' She had always thought her brother-in-law rather a weak man, but never so weak as now, when she saw for what a place he had exchanged the lovely Helstone home.\nMargaret had remained in the same state; white, motionless, speechless, tearless. They had told her that her aunt Shaw was coming; but she had not answered. Despite Mr. Bell's urgings, she still refused to eat; she shook her head with the same quiet obstinacy as on the previous day.\nShe was the first to hear her aunt's cab stopping. Her eyelids quivered, her lips trembled. Mr. Bell went down to meet Mrs. Shaw, and when they came up, Margaret was standing dizzily: she went forward to her aunt's open arms, and found the passionate relief of tears. All that inexplicable likeness to her mother melted her numbed heart.\nMr. Bell stole out of the room, and went into the study, where he tried to divert his thoughts by taking down books. Each volume brought a remembrance of his dead friend. He was glad to catch the sound of Mr. Thornton's voice, making enquiry at the door. Dixon was rather cavalierly dismissing him; for the appearance of Mrs. Shaw and her Beresford blood made Dixon inclined to be supercilious in her treatment of Milton inhabitants. So, though she stood rather in awe of Mr. Thornton, she was as curt as she dared be in telling him that he could see nobody that night. Mr. Bell opened the study-door, and called out:\n'Thornton! is that you? Come in; I want to speak to you.' So Mr. Thornton went into the study, and Dixon had to retreat.\n'I don't know what I wanted to say to you after all. Only it's dull to sit in a room where everything reminds you of a dead friend. Yet Margaret and her aunt must have the drawing-room to themselves!'\n'Is her aunt come?' asked Mr. Thornton.\n'Yes! maid and all. I shall have to turn out and find my way to the Clarendon Hotel.'\n'You must not go to the Clarendon. We have five or six empty bedrooms at home.'\n'Then I'll just run upstairs and wish that wan girl good-night, and make my bow to her aunt, and go off with you.'\nMr. Bell was some time upstairs. Mr. Thornton began to think it long, for he was busy, and had hardly been able to spare the time for running up to Crampton to enquire after Miss Hale.\nWhen they had set out upon their walk, Mr. Bell said:\n'Mrs. Shaw is anxious to get home, and wants Margaret to go off with her at once. Now she is no more fit for travelling than I am for flying. Besides, she says, and very justly, that she has friends she must see - that she must wish good-bye to several people. And she said, with a great burst of crying, she should be glad enough to leave a place where she had suffered so much. Now I must return to Oxford tomorrow, and I don't know which side to support.'\nHe received no answer from his companion, who was inwardly repeating: 'Where she had suffered so much.'\nAlas! and that was the way in which this eighteen months in Milton - to him so unspeakably precious, even down to its very bitterness - would be remembered by her. Nothing could have poisoned his remembrance of the weeks when a walk of two miles took him to her sweet presence - every moment of which showed him some fresh grace in her demeanour, or pleasant pungency in her character. Yes! whatever had happened to him, he could never have spoken of that period as a time of suffering. It had been a royal time of luxury to him, with all its stings, compared to the poverty that crept round the anticipation of the future.\nMrs. Thornton and Fanny were in the dining-room; the latter in a flutter of exultation, as the maid held up one glossy material after another, to try out the effect of the wedding-dresses by candlelight. Her mother really tried to sympathise with her, but could not. She heartily wished that Fanny had accepted her brother's offer of having the wedding clothes made by some London dressmaker, without these endless troublesome discussions. Mr. Thornton was only too glad to mark his approval of any sensible man who could be captivated by Fanny's second-rate airs and graces, by giving her ample means for providing herself with finery.\nWhen her brother and Mr. Bell came in, Fanny blushed and simpered in a way which could not have failed to draw attention from anyone else but Mr. Bell. If he thought about her at all, it was to compare her with the pale sorrow he had left behind him, sitting motionless in a room so still that you might almost fancy the rush in your straining ears was caused by the spirits of the dead.\nMrs. Thornton gave Mr. Bell her formal welcome. 'How is Miss Hale?' she asked.\n'About as broken down by this last stroke as she can be.'\n'I am sure it is very well for her that she has such a friend as you.'\n'I wish I were her only friend, madam. I daresay it sounds very brutal; but I have been displaced by a fine lady aunt; and there are cousins and what not claiming her in London, as if she were a lap-dog belonging to them. And she is too weak and miserable to have a will of her own.'\n'She must indeed be weak,' said Mrs. Thornton, with an implied meaning which her son understood well. 'But where have these relations been all this time that Miss Hale has appeared almost friendless?' However, she did not feel interest enough in the answer to wait for it. She left the room to make her household arrangements.\n'They have been living abroad. The aunt brought her up, and she and the cousin have been like sisters. The thing vexing me, you see, is that I wanted to take her for a child of my own; and I am jealous of these people. Now it would be different if Frederick claimed her.'\n'Frederick!' exclaimed Mr. Thornton. 'Who is he? What right-?' He stopped short.\n'Frederick,' said Mr. Bell in surprise. 'Why, don't you know? He's her brother.'\n'I never heard his name before.'\n'Surely I told you about him, when the family first came to Milton - the son who was concerned in that mutiny.'\n'I never heard of him till this moment. Where does he live?'\n'In Spain. He's liable to be arrested the moment he sets foot in England. Poor fellow! He will grieve at not being able to attend his father's funeral.'\n'I hope I may be allowed to go?'\n'Certainly. You're a good fellow, Thornton. Hale liked you.'\n'But about Frederick. Does he never come to England?'\n'Never.'\n'He was not over here about the time of Mrs. Hale's death?'\n'No. Why, I was here then - no, it was some time later. But poor Frederick was not here then. What made you think he was?'\n'I saw a young man walking with Miss Hale one day, about that time,' replied Mr. Thornton.\n'Oh, that would be young Lennox, the Captain's brother. He's a lawyer, and they were in pretty constant correspondence with him; I remember Mr. Hale told me he thought he would come down. Do you know,' said Mr. Bell, wheeling round, 'that I once fancied you had a little tenderness for Margaret?'\nNo answer. No change of countenance.\n'And so did poor Hale, though not till I had put it into his head.'\n'I admired Miss Hale. Everyone must do so. She is a beautiful creature,' said Mr. Thornton, at bay.\n'Is that all! You can speak of her in that measured way, as simply a \"beautiful creature\" - only something to catch the eye. I did hope you had had nobleness enough in you to make you pay her the homage of the heart. Though I believe she would have rejected you, still to have loved her without return would have lifted you higher than all those that have never known and loved her. \"Beautiful creature\" indeed! Do you speak of her as you would of a horse or a dog?'\nMr. Thornton's eyes glowed like embers.\n'Mr. Bell,' said he, 'not all men are as free to express what they feel as you are. Let us talk of something else.' For though his heart leaped up, as at a trumpet-call, to every word that Mr. Bell had said, he would not be forced into any expression of what he felt towards Margaret. He was no mocking-bird of praise, to try and out-do another. So he turned to some matters of business that lay between Mr. Bell and him, as landlord and tenant.\n'What is that heap of brick and mortar we came against in the yard? Are you building?' asked Mr. Bell.\n'I'm building a dining-room for the men - the hands. I've got acquainted with a strange kind of chap, and I put one or two children in whom he is interested in school. I happened to be passing his house one day, and called in; and I saw such a miserable black frizzle of a dinner - a greasy cinder of meat, as set me a-thinking. By buying things wholesale, and cooking a good quantity together, much money might be saved, and much comfort gained. So I spoke to this man - and he found fault with every detail of my plan; and I had laid it aside, when, suddenly, this Higgins graciously signified his approval of a scheme so nearly the same as mine, that I might fairly have claimed it. I was a little \"riled\", I confess, and thought of throwing the whole thing overboard. But that seemed a childish reaction; so I coolly took the part assigned to me, which is something like that of steward to a club. I buy in the provisions wholesale, and provide a cook.'\n'I hope you give satisfaction. Are you a good judge of potatoes and onions? But I suppose Mrs. Thornton assists you.'\n'Not a bit,' replied Mr. Thornton. 'She disapproves of the whole plan. But I manage pretty well, getting in great stocks from Liverpool, and meat from our own family butcher. I can assure you, the hot dinners the cook turns out are by no means to be despised.'\n'Do you taste each dish as it goes in?'\n'I was very scrupulous, at first, in confining myself to the buying, and even in that I obeyed the men's orders rather than my own judgment. At one time, the beef was too large, at another the mutton was not fat enough. I think they saw how careful I was not to intrude my own ideas upon them; so, one day, some of the men - my friend Higgins among them - asked me to come in and take a snack. It was a very busy day, but I saw that the men would be hurt if I didn't, so I went in, and I never made a better dinner in my life. I told them how much I'd enjoyed it; and for some time after I'd be met by these men, with a \"Master, there's hot-pot for dinner today, win yo' come?\"'\n'I should think you were rather a restraint on your hosts' conversation. They can't abuse the masters while you're there.'\n'Well! if any of the old disputes came up, I would certainly speak out my mind next hot-pot day. But you are hardly acquainted with our Darkshire fellows, for all you're a Darkshire man yourself. They have such a sense of humour, and such a racy mode of expression! I am getting to know some of them now, and they talk pretty freely before me.'\n'Nothing like the act of eating for equalising men. Will you accept a ten pound note towards your marketing, and give the poor fellows a feast?'\n'Thank you; but I'd rather not. They pay me rent for the oven and cooking-places at the back of the mill. I don't want it to fall into a charity. I don't want donations. But by-and-by we shall meet with plenty of stumbling-blocks, no doubt.'",
        "paragraph_chars": [
            [
                0,
                696
            ],
            [
                696,
                760
            ],
            [
                760,
                969
            ],
            [
                969,
                1148
            ],
            [
                1148,
                1201
            ],
            [
                1201,
                1307
            ],
            [
                1307,
                1598
            ],
            [
                1598,
                2015
            ],
            [
                2015,
                2244
            ],
            [
                2244,
                2480
            ],
            [
                2480,
                2602
            ],
            [
                2602,
                2638
            ],
            [
                2638,
                2949
            ],
            [
                2949,
                3137
            ],
            [
                3137,
                3377
            ],
            [
                3377,
                3661
            ],
            [
                3661,
                3999
            ],
            [
                3999,
                4617
            ],
            [
                4617,
                4738
            ],
            [
                4738,
                4939
            ],
            [
                4939,
                4979
            ],
            [
                4979,
                5065
            ],
            [
                5065,
                5145
            ],
            [
                5145,
                5260
            ],
            [
                5260,
                5445
            ],
            [
                5445,
                5499
            ],
            [
                5499,
                5958
            ],
            [
                5958,
                6062
            ],
            [
                6062,
                6686
            ],
            [
                6686,
                7323
            ],
            [
                7323,
                7711
            ],
            [
                7711,
                7790
            ],
            [
                7790,
                7848
            ],
            [
                7848,
                7919
            ],
            [
                7919,
                8203
            ],
            [
                8203,
                8530
            ],
            [
                8530,
                8802
            ],
            [
                8802,
                8883
            ],
            [
                8883,
                8964
            ],
            [
                8964,
                8997
            ],
            [
                8997,
                9109
            ],
            [
                9109,
                9170
            ],
            [
                9170,
                9323
            ],
            [
                9323,
                9356
            ],
            [
                9356,
                9417
            ],
            [
                9417,
                9471
            ],
            [
                9471,
                9480
            ],
            [
                9480,
                9540
            ],
            [
                9540,
                9663
            ],
            [
                9663,
                9754
            ],
            [
                9754,
                10051
            ],
            [
                10051,
                10088
            ],
            [
                10088,
                10156
            ],
            [
                10156,
                10256
            ],
            [
                10256,
                10723
            ],
            [
                10723,
                10763
            ],
            [
                10763,
                11209
            ],
            [
                11209,
                11312
            ],
            [
                11312,
                12270
            ],
            [
                12270,
                12388
            ],
            [
                12388,
                12649
            ],
            [
                12649,
                12689
            ],
            [
                12689,
                13368
            ],
            [
                13368,
                13491
            ],
            [
                13491,
                13836
            ],
            [
                13836,
                13981
            ],
            [
                13981,
                14222
            ]
        ],
        "segment_chars": [
            [
                0,
                26
            ],
            [
                26,
                62
            ],
            [
                62,
                102
            ],
            [
                102,
                126
            ],
            [
                126,
                276
            ],
            [
                276,
                331
            ],
            [
                331,
                379
            ],
            [
                379,
                518
            ],
            [
                518,
                589
            ],
            [
                589,
                696
            ],
            [
                696,
                760
            ],
            [
                760,
                780
            ],
            [
                780,
                855
            ],
            [
                855,
                886
            ],
            [
                886,
                920
            ],
            [
                920,
                969
            ],
            [
                969,
                1148
            ],
            [
                1148,
                1155
            ],
            [
                1155,
                1201
            ],
            [
                1201,
                1307
            ],
            [
                1307,
                1371
            ],
            [
                1371,
                1563
            ],
            [
                1563,
                1598
            ],
            [
                1598,
                1688
            ],
            [
                1688,
                1777
            ],
            [
                1777,
                1851
            ],
            [
                1851,
                2015
            ],
            [
                2015,
                2074
            ],
            [
                2074,
                2190
            ],
            [
                2190,
                2244
            ],
            [
                2244,
                2307
            ],
            [
                2307,
                2480
            ],
            [
                2480,
                2505
            ],
            [
                2505,
                2521
            ],
            [
                2521,
                2562
            ],
            [
                2562,
                2602
            ],
            [
                2602,
                2613
            ],
            [
                2613,
                2638
            ],
            [
                2638,
                2669
            ],
            [
                2669,
                2693
            ],
            [
                2693,
                2808
            ],
            [
                2808,
                2820
            ],
            [
                2820,
                2858
            ],
            [
                2858,
                2949
            ],
            [
                2949,
                3137
            ],
            [
                3137,
                3148
            ],
            [
                3148,
                3195
            ],
            [
                3195,
                3217
            ],
            [
                3217,
                3377
            ],
            [
                3377,
                3459
            ],
            [
                3459,
                3534
            ],
            [
                3534,
                3661
            ],
            [
                3661,
                3712
            ],
            [
                3712,
                3753
            ],
            [
                3753,
                3929
            ],
            [
                3929,
                3999
            ],
            [
                3999,
                4116
            ],
            [
                4116,
                4170
            ],
            [
                4170,
                4254
            ],
            [
                4254,
                4433
            ],
            [
                4433,
                4569
            ],
            [
                4569,
                4617
            ],
            [
                4617,
                4628
            ],
            [
                4628,
                4641
            ],
            [
                4641,
                4675
            ],
            [
                4675,
                4738
            ],
            [
                4738,
                4791
            ],
            [
                4791,
                4870
            ],
            [
                4870,
                4939
            ],
            [
                4939,
                4959
            ],
            [
                4959,
                4979
            ],
            [
                4979,
                4985
            ],
            [
                4985,
                4999
            ],
            [
                4999,
                5065
            ],
            [
                5065,
                5100
            ],
            [
                5100,
                5145
            ],
            [
                5145,
                5260
            ],
            [
                5260,
                5293
            ],
            [
                5293,
                5445
            ],
            [
                5445,
                5499
            ],
            [
                5499,
                5505
            ],
            [
                5505,
                5581
            ],
            [
                5581,
                5641
            ],
            [
                5641,
                5760
            ],
            [
                5760,
                5879
            ],
            [
                5879,
                5958
            ],
            [
                5958,
                6062
            ],
            [
                6062,
                6068
            ],
            [
                6068,
                6226
            ],
            [
                6226,
                6448
            ],
            [
                6448,
                6453
            ],
            [
                6453,
                6549
            ],
            [
                6549,
                6686
            ],
            [
                6686,
                6890
            ],
            [
                6890,
                6953
            ],
            [
                6953,
                7126
            ],
            [
                7126,
                7323
            ],
            [
                7323,
                7475
            ],
            [
                7475,
                7711
            ],
            [
                7711,
                7759
            ],
            [
                7759,
                7779
            ],
            [
                7779,
                7790
            ],
            [
                7790,
                7848
            ],
            [
                7848,
                7919
            ],
            [
                7919,
                7958
            ],
            [
                7958,
                8141
            ],
            [
                8141,
                8203
            ],
            [
                8203,
                8305
            ],
            [
                8305,
                8404
            ],
            [
                8404,
                8476
            ],
            [
                8476,
                8530
            ],
            [
                8530,
                8561
            ],
            [
                8561,
                8633
            ],
            [
                8633,
                8749
            ],
            [
                8749,
                8802
            ],
            [
                8802,
                8815
            ],
            [
                8815,
                8839
            ],
            [
                8839,
                8851
            ],
            [
                8851,
                8865
            ],
            [
                8865,
                8883
            ],
            [
                8883,
                8923
            ],
            [
                8923,
                8945
            ],
            [
                8945,
                8964
            ],
            [
                8964,
                8997
            ],
            [
                8997,
                9109
            ],
            [
                9109,
                9149
            ],
            [
                9149,
                9170
            ],
            [
                9170,
                9181
            ],
            [
                9181,
                9244
            ],
            [
                9244,
                9257
            ],
            [
                9257,
                9323
            ],
            [
                9323,
                9356
            ],
            [
                9356,
                9368
            ],
            [
                9368,
                9400
            ],
            [
                9400,
                9417
            ],
            [
                9417,
                9439
            ],
            [
                9439,
                9471
            ],
            [
                9471,
                9480
            ],
            [
                9480,
                9540
            ],
            [
                9540,
                9545
            ],
            [
                9545,
                9596
            ],
            [
                9596,
                9634
            ],
            [
                9634,
                9663
            ],
            [
                9663,
                9754
            ],
            [
                9754,
                9810
            ],
            [
                9810,
                9942
            ],
            [
                9942,
                10051
            ],
            [
                10051,
                10062
            ],
            [
                10062,
                10088
            ],
            [
                10088,
                10156
            ],
            [
                10156,
                10178
            ],
            [
                10178,
                10199
            ],
            [
                10199,
                10256
            ],
            [
                10256,
                10270
            ],
            [
                10270,
                10381
            ],
            [
                10381,
                10473
            ],
            [
                10473,
                10639
            ],
            [
                10639,
                10668
            ],
            [
                10668,
                10723
            ],
            [
                10723,
                10763
            ],
            [
                10763,
                10768
            ],
            [
                10768,
                10847
            ],
            [
                10847,
                10879
            ],
            [
                10879,
                11048
            ],
            [
                11048,
                11109
            ],
            [
                11109,
                11209
            ],
            [
                11209,
                11277
            ],
            [
                11277,
                11296
            ],
            [
                11296,
                11312
            ],
            [
                11312,
                11365
            ],
            [
                11365,
                11480
            ],
            [
                11480,
                11641
            ],
            [
                11641,
                11759
            ],
            [
                11759,
                11998
            ],
            [
                11998,
                12084
            ],
            [
                12084,
                12214
            ],
            [
                12214,
                12270
            ],
            [
                12270,
                12301
            ],
            [
                12301,
                12346
            ],
            [
                12346,
                12388
            ],
            [
                12388,
                12423
            ],
            [
                12423,
                12459
            ],
            [
                12459,
                12563
            ],
            [
                12563,
                12649
            ],
            [
                12649,
                12689
            ],
            [
                12689,
                12830
            ],
            [
                12830,
                12909
            ],
            [
                12909,
                13083
            ],
            [
                13083,
                13216
            ],
            [
                13216,
                13368
            ],
            [
                13368,
                13441
            ],
            [
                13441,
                13491
            ],
            [
                13491,
                13498
            ],
            [
                13498,
                13588
            ],
            [
                13588,
                13687
            ],
            [
                13687,
                13757
            ],
            [
                13757,
                13836
            ],
            [
                13836,
                13888
            ],
            [
                13888,
                13981
            ],
            [
                13981,
                14013
            ],
            [
                14013,
                14087
            ],
            [
                14087,
                14127
            ],
            [
                14127,
                14151
            ],
            [
                14151,
                14222
            ]
        ],
        "overlap_chars": [
            [
                0,
                26
            ],
            [
                26,
                34
            ],
            [
                35,
                42
            ],
            [
                47,
                54
            ],
            [
                60,
                62
            ],
            [
                62,
                100
            ],
            [
                100,
                102
            ],
            [
                102,
                126
            ],
            [
                126,
                274
            ],
            [
                274,
                276
            ],
            [
                286,
                331
            ],
            [
                331,
                377
            ],
            [
                377,
                379
            ],
            [
                379,
                472
            ],
            [
                473,
                480
            ],
            [
                480,
                518
            ],
            [
                518,
                559
            ],
            [
                559,
                564
            ],
            [
                568,
                589
            ],
            [
                589,
                599
            ],
            [
                600,
                613
            ],
            [
                614,
                622
            ],
            [
                622,
                644
            ],
            [
                645,
                648
            ],
            [
                649,
                653
            ],
            [
                664,
                668
            ],
            [
                669,
                690
            ],
            [
                691,
                696
            ],
            [
                696,
                722
            ],
            [
                722,
                760
            ],
            [
                761,
                780
            ],
            [
                780,
                795
            ],
            [
                796,
                815
            ],
            [
                816,
                837
            ],
            [
                842,
                845
            ],
            [
                853,
                855
            ],
            [
                855,
                886
            ],
            [
                886,
                920
            ],
            [
                920,
                966
            ],
            [
                969,
                985
            ],
            [
                985,
                990
            ],
            [
                991,
                1012
            ],
            [
                1012,
                1042
            ],
            [
                1043,
                1088
            ],
            [
                1094,
                1097
            ],
            [
                1111,
                1148
            ],
            [
                1149,
                1155
            ],
            [
                1155,
                1171
            ],
            [
                1172,
                1176
            ],
            [
                1180,
                1198
            ],
            [
                1202,
                1210
            ],
            [
                1210,
                1292
            ],
            [
                1295,
                1305
            ],
            [
                1305,
                1307
            ],
            [
                1308,
                1327
            ],
            [
                1330,
                1357
            ],
            [
                1361,
                1369
            ],
            [
                1369,
                1371
            ],
            [
                1371,
                1372
            ],
            [
                1372,
                1386
            ],
            [
                1387,
                1405
            ],
            [
                1407,
                1423
            ],
            [
                1425,
                1477
            ],
            [
                1480,
                1488
            ],
            [
                1489,
                1492
            ],
            [
                1493,
                1503
            ],
            [
                1506,
                1561
            ],
            [
                1563,
                1595
            ],
            [
                1598,
                1640
            ],
            [
                1654,
                1663
            ],
            [
                1664,
                1674
            ],
            [
                1675,
                1677
            ],
            [
                1686,
                1687
            ],
            [
                1688,
                1697
            ],
            [
                1697,
                1722
            ],
            [
                1725,
                1777
            ],
            [
                1777,
                1796
            ],
            [
                1796,
                1797
            ],
            [
                1798,
                1841
            ],
            [
                1849,
                1851
            ],
            [
                1874,
                1876
            ],
            [
                1904,
                1910
            ],
            [
                1914,
                1923
            ],
            [
                1925,
                1937
            ],
            [
                1952,
                1958
            ],
            [
                1958,
                1992
            ],
            [
                1993,
                2015
            ],
            [
                2019,
                2074
            ],
            [
                2074,
                2107
            ],
            [
                2114,
                2138
            ],
            [
                2146,
                2150
            ],
            [
                2157,
                2163
            ],
            [
                2163,
                2168
            ],
            [
                2169,
                2178
            ],
            [
                2179,
                2190
            ],
            [
                2190,
                2241
            ],
            [
                2244,
                2277
            ],
            [
                2277,
                2278
            ],
            [
                2285,
                2305
            ],
            [
                2305,
                2307
            ],
            [
                2307,
                2341
            ],
            [
                2343,
                2360
            ],
            [
                2367,
                2477
            ],
            [
                2487,
                2490
            ],
            [
                2493,
                2503
            ],
            [
                2503,
                2505
            ],
            [
                2507,
                2510
            ],
            [
                2511,
                2519
            ],
            [
                2521,
                2554
            ],
            [
                2555,
                2562
            ],
            [
                2562,
                2599
            ],
            [
                2603,
                2610
            ],
            [
                2613,
                2621
            ],
            [
                2621,
                2622
            ],
            [
                2623,
                2636
            ],
            [
                2636,
                2638
            ],
            [
                2639,
                2656
            ],
            [
                2659,
                2669
            ],
            [
                2669,
                2685
            ],
            [
                2691,
                2693
            ],
            [
                2693,
                2727
            ],
            [
                2728,
                2736
            ],
            [
                2737,
                2743
            ],
            [
                2744,
                2747
            ],
            [
                2748,
                2752
            ],
            [
                2759,
                2780
            ],
            [
                2781,
                2808
            ],
            [
                2808,
                2820
            ],
            [
                2820,
                2844
            ],
            [
                2845,
                2858
            ],
            [
                2858,
                2886
            ],
            [
                2894,
                2912
            ],
            [
                2913,
                2946
            ],
            [
                2949,
                3010
            ],
            [
                3011,
                3061
            ],
            [
                3063,
                3080
            ],
            [
                3083,
                3091
            ],
            [
                3097,
                3137
            ],
            [
                3138,
                3145
            ],
            [
                3148,
                3169
            ],
            [
                3171,
                3195
            ],
            [
                3195,
                3214
            ],
            [
                3217,
                3377
            ],
            [
                3377,
                3459
            ],
            [
                3459,
                3523
            ],
            [
                3532,
                3534
            ],
            [
                3544,
                3550
            ],
            [
                3550,
                3552
            ],
            [
                3560,
                3561
            ],
            [
                3580,
                3582
            ],
            [
                3586,
                3659
            ],
            [
                3659,
                3660
            ],
            [
                3665,
                3686
            ],
            [
                3687,
                3695
            ],
            [
                3698,
                3701
            ],
            [
                3702,
                3710
            ],
            [
                3710,
                3712
            ],
            [
                3712,
                3742
            ],
            [
                3743,
                3753
            ],
            [
                3753,
                3789
            ],
            [
                3789,
                3790
            ],
            [
                3791,
                3835
            ],
            [
                3836,
                3840
            ],
            [
                3845,
                3864
            ],
            [
                3865,
                3875
            ],
            [
                3876,
                3880
            ],
            [
                3881,
                3885
            ],
            [
                3885,
                3890
            ],
            [
                3891,
                3927
            ],
            [
                3927,
                3929
            ],
            [
                3929,
                3959
            ],
            [
                3960,
                3962
            ],
            [
                3963,
                3973
            ],
            [
                3981,
                3997
            ],
            [
                3997,
                3999
            ],
            [
                3999,
                4039
            ],
            [
                4040,
                4064
            ],
            [
                4065,
                4108
            ],
            [
                4109,
                4116
            ],
            [
                4116,
                4149
            ],
            [
                4150,
                4170
            ],
            [
                4170,
                4254
            ],
            [
                4254,
                4301
            ],
            [
                4302,
                4329
            ],
            [
                4330,
                4333
            ],
            [
                4334,
                4337
            ],
            [
                4338,
                4353
            ],
            [
                4374,
                4379
            ],
            [
                4410,
                4412
            ],
            [
                4431,
                4433
            ],
            [
                4433,
                4447
            ],
            [
                4448,
                4507
            ],
            [
                4514,
                4549
            ],
            [
                4557,
                4569
            ],
            [
                4571,
                4577
            ],
            [
                4585,
                4604
            ],
            [
                4612,
                4617
            ],
            [
                4622,
                4628
            ],
            [
                4628,
                4641
            ],
            [
                4641,
                4648
            ],
            [
                4648,
                4672
            ],
            [
                4675,
                4736
            ],
            [
                4736,
                4738
            ],
            [
                4739,
                4791
            ],
            [
                4791,
                4805
            ],
            [
                4806,
                4839
            ],
            [
                4848,
                4870
            ],
            [
                4870,
                4936
            ],
            [
                4940,
                4956
            ],
            [
                4959,
                4979
            ],
            [
                4980,
                4985
            ],
            [
                4985,
                4999
            ],
            [
                4999,
                5056
            ],
            [
                5066,
                5100
            ],
            [
                5100,
                5125
            ],
            [
                5135,
                5142
            ],
            [
                5151,
                5155
            ],
            [
                5161,
                5257
            ],
            [
                5260,
                5293
            ],
            [
                5293,
                5340
            ],
            [
                5345,
                5416
            ],
            [
                5434,
                5443
            ],
            [
                5443,
                5445
            ],
            [
                5445,
                5499
            ],
            [
                5501,
                5504
            ],
            [
                5505,
                5532
            ],
            [
                5532,
                5533
            ],
            [
                5534,
                5581
            ],
            [
                5581,
                5641
            ],
            [
                5641,
                5710
            ],
            [
                5713,
                5758
            ],
            [
                5760,
                5832
            ],
            [
                5839,
                5879
            ],
            [
                5879,
                5906
            ],
            [
                5915,
                5933
            ],
            [
                5934,
                5944
            ],
            [
                5945,
                5947
            ],
            [
                5958,
                5999
            ],
            [
                6017,
                6026
            ],
            [
                6029,
                6059
            ],
            [
                6062,
                6068
            ],
            [
                6068,
                6128
            ],
            [
                6131,
                6162
            ],
            [
                6168,
                6195
            ],
            [
                6198,
                6217
            ],
            [
                6224,
                6226
            ],
            [
                6234,
                6253
            ],
            [
                6258,
                6282
            ],
            [
                6283,
                6307
            ],
            [
                6308,
                6338
            ],
            [
                6341,
                6346
            ],
            [
                6347,
                6353
            ],
            [
                6354,
                6362
            ],
            [
                6370,
                6373
            ],
            [
                6374,
                6448
            ],
            [
                6448,
                6453
            ],
            [
                6453,
                6481
            ],
            [
                6481,
                6517
            ],
            [
                6525,
                6549
            ],
            [
                6549,
                6611
            ],
            [
                6611,
                6653
            ],
            [
                6654,
                6684
            ],
            [
                6684,
                6686
            ],
            [
                6686,
                6761
            ],
            [
                6762,
                6835
            ],
            [
                6840,
                6883
            ],
            [
                6883,
                6890
            ],
            [
                6890,
                6953
            ],
            [
                6953,
                7046
            ],
            [
                7052,
                7059
            ],
            [
                7060,
                7086
            ],
            [
                7093,
                7124
            ],
            [
                7124,
                7126
            ],
            [
                7126,
                7168
            ],
            [
                7178,
                7197
            ],
            [
                7198,
                7314
            ],
            [
                7315,
                7321
            ],
            [
                7321,
                7322
            ],
            [
                7323,
                7388
            ],
            [
                7389,
                7448
            ],
            [
                7456,
                7475
            ],
            [
                7475,
                7498
            ],
            [
                7499,
                7528
            ],
            [
                7529,
                7592
            ],
            [
                7593,
                7602
            ],
            [
                7603,
                7605
            ],
            [
                7606,
                7611
            ],
            [
                7612,
                7675
            ],
            [
                7683,
                7709
            ],
            [
                7709,
                7710
            ],
            [
                7711,
                7749
            ],
            [
                7750,
                7759
            ],
            [
                7760,
                7776
            ],
            [
                7779,
                7790
            ],
            [
                7791,
                7845
            ],
            [
                7849,
                7916
            ],
            [
                7920,
                7958
            ],
            [
                7958,
                7994
            ],
            [
                7995,
                7996
            ],
            [
                7997,
                8001
            ],
            [
                8002,
                8016
            ],
            [
                8017,
                8141
            ],
            [
                8141,
                8200
            ],
            [
                8208,
                8227
            ],
            [
                8230,
                8305
            ],
            [
                8306,
                8315
            ],
            [
                8316,
                8401
            ],
            [
                8413,
                8462
            ],
            [
                8463,
                8476
            ],
            [
                8476,
                8530
            ],
            [
                8536,
                8561
            ],
            [
                8561,
                8633
            ],
            [
                8633,
                8747
            ],
            [
                8747,
                8749
            ],
            [
                8749,
                8799
            ],
            [
                8803,
                8812
            ],
            [
                8815,
                8839
            ],
            [
                8840,
                8851
            ],
            [
                8851,
                8861
            ],
            [
                8865,
                8881
            ],
            [
                8881,
                8883
            ],
            [
                8884,
                8893
            ],
            [
                8896,
                8923
            ],
            [
                8924,
                8945
            ],
            [
                8945,
                8961
            ],
            [
                8965,
                8994
            ],
            [
                9002,
                9063
            ],
            [
                9066,
                9106
            ],
            [
                9110,
                9149
            ],
            [
                9149,
                9167
            ],
            [
                9171,
                9181
            ],
            [
                9181,
                9231
            ],
            [
                9242,
                9244
            ],
            [
                9244,
                9257
            ],
            [
                9257,
                9320
            ],
            [
                9324,
                9353
            ],
            [
                9357,
                9366
            ],
            [
                9366,
                9368
            ],
            [
                9368,
                9389
            ],
            [
                9390,
                9400
            ],
            [
                9400,
                9414
            ],
            [
                9418,
                9439
            ],
            [
                9439,
                9468
            ],
            [
                9472,
                9477
            ],
            [
                9481,
                9537
            ],
            [
                9541,
                9545
            ],
            [
                9545,
                9565
            ],
            [
                9568,
                9588
            ],
            [
                9594,
                9596
            ],
            [
                9596,
                9614
            ],
            [
                9615,
                9634
            ],
            [
                9634,
                9660
            ],
            [
                9664,
                9712
            ],
            [
                9712,
                9713
            ],
            [
                9714,
                9729
            ],
            [
                9732,
                9752
            ],
            [
                9755,
                9772
            ],
            [
                9773,
                9810
            ],
            [
                9810,
                9882
            ],
            [
                9883,
                9942
            ],
            [
                9942,
                9953
            ],
            [
                9956,
                9986
            ],
            [
                9988,
                10048
            ],
            [
                10051,
                10062
            ],
            [
                10062,
                10088
            ],
            [
                10089,
                10109
            ],
            [
                10109,
                10110
            ],
            [
                10118,
                10153
            ],
            [
                10157,
                10178
            ],
            [
                10187,
                10199
            ],
            [
                10199,
                10226
            ],
            [
                10229,
                10247
            ],
            [
                10251,
                10254
            ],
            [
                10254,
                10256
            ],
            [
                10257,
                10270
            ],
            [
                10270,
                10324
            ],
            [
                10326,
                10344
            ],
            [
                10348,
                10381
            ],
            [
                10381,
                10473
            ],
            [
                10473,
                10489
            ],
            [
                10490,
                10601
            ],
            [
                10602,
                10611
            ],
            [
                10618,
                10623
            ],
            [
                10634,
                10637
            ],
            [
                10637,
                10639
            ],
            [
                10640,
                10658
            ],
            [
                10660,
                10668
            ],
            [
                10668,
                10720
            ],
            [
                10723,
                10754
            ],
            [
                10755,
                10763
            ],
            [
                10766,
                10767
            ],
            [
                10768,
                10772
            ],
            [
                10775,
                10783
            ],
            [
                10785,
                10788
            ],
            [
                10789,
                10800
            ],
            [
                10801,
                10847
            ],
            [
                10847,
                10876
            ],
            [
                10879,
                10970
            ],
            [
                10971,
                11048
            ],
            [
                11048,
                11080
            ],
            [
                11080,
                11084
            ],
            [
                11085,
                11088
            ],
            [
                11089,
                11092
            ],
            [
                11093,
                11096
            ],
            [
                11097,
                11099
            ],
            [
                11100,
                11107
            ],
            [
                11107,
                11109
            ],
            [
                11109,
                11129
            ],
            [
                11130,
                11209
            ],
            [
                11210,
                11277
            ],
            [
                11277,
                11293
            ],
            [
                11313,
                11339
            ],
            [
                11340,
                11351
            ],
            [
                11354,
                11363
            ],
            [
                11365,
                11468
            ],
            [
                11472,
                11480
            ],
            [
                11480,
                11504
            ],
            [
                11505,
                11523
            ],
            [
                11537,
                11591
            ],
            [
                11594,
                11621
            ],
            [
                11622,
                11641
            ],
            [
                11641,
                11696
            ],
            [
                11697,
                11759
            ],
            [
                11759,
                11772
            ],
            [
                11778,
                11781
            ],
            [
                11782,
                11783
            ],
            [
                11784,
                11836
            ],
            [
                11837,
                11838
            ],
            [
                11839,
                11842
            ],
            [
                11843,
                11857
            ],
            [
                11858,
                11886
            ],
            [
                11887,
                11996
            ],
            [
                11996,
                11998
            ],
            [
                11998,
                12012
            ],
            [
                12014,
                12019
            ],
            [
                12022,
                12031
            ],
            [
                12031,
                12082
            ],
            [
                12082,
                12084
            ],
            [
                12084,
                12087
            ],
            [
                12093,
                12099
            ],
            [
                12100,
                12101
            ],
            [
                12102,
                12110
            ],
            [
                12121,
                12194
            ],
            [
                12195,
                12214
            ],
            [
                12214,
                12262
            ],
            [
                12263,
                12267
            ],
            [
                12271,
                12299
            ],
            [
                12299,
                12301
            ],
            [
                12301,
                12346
            ],
            [
                12346,
                12385
            ],
            [
                12389,
                12398
            ],
            [
                12401,
                12423
            ],
            [
                12428,
                12457
            ],
            [
                12457,
                12459
            ],
            [
                12459,
                12528
            ],
            [
                12529,
                12533
            ],
            [
                12539,
                12563
            ],
            [
                12563,
                12600
            ],
            [
                12606,
                12619
            ],
            [
                12632,
                12646
            ],
            [
                12653,
                12686
            ],
            [
                12690,
                12749
            ],
            [
                12756,
                12776
            ],
            [
                12777,
                12800
            ],
            [
                12801,
                12807
            ],
            [
                12808,
                12812
            ],
            [
                12813,
                12830
            ],
            [
                12830,
                12909
            ],
            [
                12909,
                12943
            ],
            [
                12944,
                12995
            ],
            [
                13001,
                13011
            ],
            [
                13014,
                13042
            ],
            [
                13051,
                13053
            ],
            [
                13054,
                13056
            ],
            [
                13057,
                13083
            ],
            [
                13083,
                13146
            ],
            [
                13147,
                13155
            ],
            [
                13155,
                13216
            ],
            [
                13216,
                13227
            ],
            [
                13228,
                13238
            ],
            [
                13241,
                13270
            ],
            [
                13277,
                13278
            ],
            [
                13281,
                13308
            ],
            [
                13310,
                13344
            ],
            [
                13350,
                13364
            ],
            [
                13366,
                13367
            ],
            [
                13369,
                13441
            ],
            [
                13441,
                13488
            ],
            [
                13492,
                13498
            ],
            [
                13498,
                13532
            ],
            [
                13532,
                13588
            ],
            [
                13588,
                13687
            ],
            [
                13687,
                13757
            ],
            [
                13757,
                13769
            ],
            [
                13770,
                13833
            ],
            [
                13837,
                13888
            ],
            [
                13888,
                13978
            ],
            [
                13988,
                14013
            ],
            [
                14013,
                14085
            ],
            [
                14085,
                14087
            ],
            [
                14087,
                14127
            ],
            [
                14127,
                14151
            ],
            [
                14151,
                14158
            ],
            [
                14161,
                14162
            ],
            [
                14165,
                14220
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                26
            ],
            [
                26,
                62
            ],
            [
                62,
                102
            ],
            [
                102,
                126
            ],
            [
                126,
                276
            ],
            [
                276,
                331
            ],
            [
                331,
                379
            ],
            [
                379,
                518
            ],
            [
                518,
                589
            ],
            [
                589,
                696
            ],
            [
                696,
                760
            ],
            [
                760,
                780
            ],
            [
                780,
                855
            ],
            [
                855,
                886
            ],
            [
                886,
                920
            ],
            [
                920,
                969
            ],
            [
                969,
                1148
            ],
            [
                1148,
                1155
            ],
            [
                1155,
                1201
            ],
            [
                1201,
                1307
            ],
            [
                1307,
                1371
            ],
            [
                1371,
                1371
            ],
            [
                1371,
                1563
            ],
            [
                1563,
                1598
            ],
            [
                1598,
                1598
            ],
            [
                1598,
                1598
            ],
            [
                1598,
                1777
            ],
            [
                1777,
                1851
            ],
            [
                1851,
                2015
            ],
            [
                2015,
                2074
            ],
            [
                2074,
                2190
            ],
            [
                2190,
                2244
            ],
            [
                2244,
                2307
            ],
            [
                2307,
                2480
            ],
            [
                2480,
                2505
            ],
            [
                2505,
                2505
            ],
            [
                2505,
                2562
            ],
            [
                2562,
                2602
            ],
            [
                2602,
                2613
            ],
            [
                2613,
                2638
            ],
            [
                2638,
                2669
            ],
            [
                2669,
                2693
            ],
            [
                2693,
                2808
            ],
            [
                2808,
                2820
            ],
            [
                2820,
                2858
            ],
            [
                2858,
                2949
            ],
            [
                2949,
                3137
            ],
            [
                3137,
                3148
            ],
            [
                3148,
                3195
            ],
            [
                3195,
                3217
            ],
            [
                3217,
                3217
            ],
            [
                3217,
                3217
            ],
            [
                3217,
                3377
            ],
            [
                3377,
                3459
            ],
            [
                3459,
                3534
            ],
            [
                3534,
                3661
            ],
            [
                3661,
                3712
            ],
            [
                3712,
                3753
            ],
            [
                3753,
                3929
            ],
            [
                3929,
                3999
            ],
            [
                3999,
                4116
            ],
            [
                4116,
                4170
            ],
            [
                4170,
                4170
            ],
            [
                4170,
                4254
            ],
            [
                4254,
                4433
            ],
            [
                4433,
                4569
            ],
            [
                4569,
                4617
            ],
            [
                4617,
                4628
            ],
            [
                4628,
                4641
            ],
            [
                4641,
                4675
            ],
            [
                4675,
                4738
            ],
            [
                4738,
                4791
            ],
            [
                4791,
                4870
            ],
            [
                4870,
                4939
            ],
            [
                4939,
                4959
            ],
            [
                4959,
                4979
            ],
            [
                4979,
                4979
            ],
            [
                4979,
                4985
            ],
            [
                4985,
                4999
            ],
            [
                4999,
                4999
            ],
            [
                4999,
                5065
            ],
            [
                5065,
                5100
            ],
            [
                5100,
                5145
            ],
            [
                5145,
                5145
            ],
            [
                5145,
                5145
            ],
            [
                5145,
                5260
            ],
            [
                5260,
                5293
            ],
            [
                5293,
                5445
            ],
            [
                5445,
                5499
            ],
            [
                5499,
                5499
            ],
            [
                5499,
                5581
            ],
            [
                5581,
                5641
            ],
            [
                5641,
                5760
            ],
            [
                5760,
                5879
            ],
            [
                5879,
                5958
            ],
            [
                5958,
                6062
            ],
            [
                6062,
                6068
            ],
            [
                6068,
                6226
            ],
            [
                6226,
                6448
            ],
            [
                6448,
                6453
            ],
            [
                6453,
                6549
            ],
            [
                6549,
                6686
            ],
            [
                6686,
                6890
            ],
            [
                6890,
                6953
            ],
            [
                6953,
                7126
            ],
            [
                7126,
                7323
            ],
            [
                7323,
                7475
            ],
            [
                7475,
                7711
            ],
            [
                7711,
                7711
            ],
            [
                7711,
                7759
            ],
            [
                7759,
                7759
            ],
            [
                7759,
                7779
            ],
            [
                7779,
                7790
            ],
            [
                7790,
                7848
            ],
            [
                7848,
                7919
            ],
            [
                7919,
                7958
            ],
            [
                7958,
                8141
            ],
            [
                8141,
                8203
            ],
            [
                8203,
                8305
            ],
            [
                8305,
                8404
            ],
            [
                8404,
                8476
            ],
            [
                8476,
                8530
            ],
            [
                8530,
                8561
            ],
            [
                8561,
                8561
            ],
            [
                8561,
                8561
            ],
            [
                8561,
                8633
            ],
            [
                8633,
                8749
            ],
            [
                8749,
                8802
            ],
            [
                8802,
                8815
            ],
            [
                8815,
                8839
            ],
            [
                8839,
                8851
            ],
            [
                8851,
                8865
            ],
            [
                8865,
                8883
            ],
            [
                8883,
                8923
            ],
            [
                8923,
                8945
            ],
            [
                8945,
                8964
            ],
            [
                8964,
                8964
            ],
            [
                8964,
                8997
            ],
            [
                8997,
                8997
            ],
            [
                8997,
                8997
            ],
            [
                8997,
                9109
            ],
            [
                9109,
                9149
            ],
            [
                9149,
                9170
            ],
            [
                9170,
                9181
            ],
            [
                9181,
                9244
            ],
            [
                9244,
                9257
            ],
            [
                9257,
                9323
            ],
            [
                9323,
                9323
            ],
            [
                9323,
                9356
            ],
            [
                9356,
                9368
            ],
            [
                9368,
                9400
            ],
            [
                9400,
                9417
            ],
            [
                9417,
                9417
            ],
            [
                9417,
                9417
            ],
            [
                9417,
                9417
            ],
            [
                9417,
                9439
            ],
            [
                9439,
                9471
            ],
            [
                9471,
                9480
            ],
            [
                9480,
                9540
            ],
            [
                9540,
                9545
            ],
            [
                9545,
                9596
            ],
            [
                9596,
                9634
            ],
            [
                9634,
                9663
            ],
            [
                9663,
                9754
            ],
            [
                9754,
                9810
            ],
            [
                9810,
                9942
            ],
            [
                9942,
                10051
            ],
            [
                10051,
                10062
            ],
            [
                10062,
                10088
            ],
            [
                10088,
                10156
            ],
            [
                10156,
                10178
            ],
            [
                10178,
                10199
            ],
            [
                10199,
                10256
            ],
            [
                10256,
                10270
            ],
            [
                10270,
                10381
            ],
            [
                10381,
                10473
            ],
            [
                10473,
                10639
            ],
            [
                10639,
                10668
            ],
            [
                10668,
                10723
            ],
            [
                10723,
                10763
            ],
            [
                10763,
                10847
            ],
            [
                10847,
                10879
            ],
            [
                10879,
                11048
            ],
            [
                11048,
                11109
            ],
            [
                11109,
                11209
            ],
            [
                11209,
                11277
            ],
            [
                11277,
                11277
            ],
            [
                11277,
                11277
            ],
            [
                11277,
                11312
            ],
            [
                11312,
                11365
            ],
            [
                11365,
                11365
            ],
            [
                11365,
                11480
            ],
            [
                11480,
                11641
            ],
            [
                11641,
                11759
            ],
            [
                11759,
                11998
            ],
            [
                11998,
                12084
            ],
            [
                12084,
                12214
            ],
            [
                12214,
                12270
            ],
            [
                12270,
                12301
            ],
            [
                12301,
                12346
            ],
            [
                12346,
                12388
            ],
            [
                12388,
                12423
            ],
            [
                12423,
                12459
            ],
            [
                12459,
                12563
            ],
            [
                12563,
                12649
            ],
            [
                12649,
                12689
            ],
            [
                12689,
                12689
            ],
            [
                12689,
                12830
            ],
            [
                12830,
                12909
            ],
            [
                12909,
                13083
            ],
            [
                13083,
                13216
            ],
            [
                13216,
                13368
            ],
            [
                13368,
                13368
            ],
            [
                13368,
                13441
            ],
            [
                13441,
                13491
            ],
            [
                13491,
                13491
            ],
            [
                13491,
                13498
            ],
            [
                13498,
                13498
            ],
            [
                13498,
                13588
            ],
            [
                13588,
                13687
            ],
            [
                13687,
                13757
            ],
            [
                13757,
                13836
            ],
            [
                13836,
                13888
            ],
            [
                13888,
                13888
            ],
            [
                13888,
                13888
            ],
            [
                13888,
                13888
            ],
            [
                13888,
                13888
            ],
            [
                13888,
                13888
            ],
            [
                13888,
                13981
            ],
            [
                13981,
                14013
            ],
            [
                14013,
                14087
            ],
            [
                14087,
                14127
            ],
            [
                14127,
                14151
            ],
            [
                14151,
                14151
            ],
            [
                14151,
                14151
            ],
            [
                14151,
                14151
            ],
            [
                14151,
                14151
            ],
            [
                14151,
                14151
            ],
            [
                14151,
                14222
            ]
        ]
    }
}