{
    "original": {
        "text": "\"The meanest thing to which we bid adieu, Loses its meanness in the parting hour.\" ELLIOTT.\nMrs. Shaw took as vehement a dislike as it was possible for one of her gentle nature to do, against Milton. It was noisy, and smoky, and the poor people whom she saw in the streets were dirty, and the rich ladies over-dressed, and not a man that she saw, high or low, had his clothes made to fit him. She was sure Margaret would never regain her lost strength while she stayed in Milton; and she herself was afraid of one of her old attacks of the nerves. Margaret must return with her, and that quickly. This, if not the exact force of her words, was at any rate the spirit of what she urged on Margaret, till the latter, weak, weary, and broken-spirited, yielded a reluctant promise that, as soon as Wednesday was over, she would prepare to accompany her aunt back to town, leaving Dixon in charge of all the arrangements for paying bills, disposing of furniture, and shutting up the house. Before that Wednesday--that mournful Wednesday, when Mr. Hale was to be interred, far away from either of the homes he had known in life, and far away from the wife who lay lonely among strangers (and this last was Margaret's great trouble, for she thought that if she had not given way to that overwhelming stupor during the first sad days, she could have arranged things otherwise)--before that Wednesday, Margaret received a letter from Mr. Bell.\n\"MY DEAR MARGARET:--I did mean to have returned to Milton on Thursday, but unluckily it turns out to be one of the rare occasions when we, Plymouth Fellows, are called upon to perform any kind of duty, and I must not be absent from my post. Captain Lennox and Mr. Thornton are here. The former seems a smart, well-meaning man; and has proposed to go over to Milton, and assist you in any search for the will; of course there is none, or you would have found it by this time, if you followed my directions. Then the Captain declares he must take you and his mother-in-law home; and, in his wife's present state, I don't see how you can expect him to remain away longer than Friday. However, that Dixon of yours is trusty; and can hold her, or your own, till I come. I will put matters into the hands of my Milton attorney if there is no will; for I doubt this smart Captain is no great man of business. Nevertheless, his moustachios are splendid. There will have to be a sale, so select what things you wish to be reserved. Or you can send a list afterwards. Now two things more, and I have done. You know, or if you don't, your poor father did, that you are to have my money and goods when I die. Not that I mean to die yet; but I name this just to explain what is coming. These Lennoxes seem very fond of you now; and perhaps may continue to be; perhaps not. So it is best to start with a formal agreement; namely, that you are to pay to them two hundred and fifty pounds a year, as long as you and they find it pleasant to live together. (This, of course, includes Dixon; mind you don't be cajoled into paying more for her.) Then you won't be thrown adrift, if some day the captain wishes to have his house to himself, but you can carry yourself and your two hundred and fifty pounds off somewhere else; if, indeed, I have not claimed you to come and keep house for me first. Then as to dress, and Dixon, and personal expenses, and confectionery (all young ladies eat confectionery till wisdom comes by age), I shall consult some lady of my acquaintance, and see how much you will have from your father before fixing this. Now, Margaret, have you flown out before you have read this far, and wondered what right the old man has to settle your affairs for you so cavalierly? I make no doubt you have. Yet the old man has a right. He has loved your father for five and thirty years; he stood beside him on his wedding-day; he closed his eyes in death. Moreover, he is your godfather; and as he cannot do you much good spiritually, having a hidden consciousness of your superiority in such things, he would fain do you the poor good of endowing you materially. And the old man has not a known relation on earth; 'who is there to mourn for Adam Bell?' and his whole heart is set and bent upon this one thing, and Margaret Hale is not the girl to say him nay. Write by return if only two lines, to tell me your answer. But _no thanks_.\"\nMargaret took up a pen and scrawled with trembling hand, \"Margaret Hale is not the girl to say him nay.\" In her weak state she could not think of any other words, and yet, she was vexed to use these. But she was so much fatigued even by this slight exertion, that if she could have thought of another form of acceptance, she could not have sate up to write a syllable of it. She was obliged to lie down again and try not to think.\n\"My dearest child! Has that letter vexed or troubled you?\"\n\"No!\" said Margaret feebly. \"I shall be better when to-morrow is over.\"\n\"I feel sure, darling, you won't be better till I get you out of this horrid air. How you can have borne it these two years I can't imagine.\"\n\"Where could I go to? I could not leave papa and mamma.\"\n\"Well, don't distress yourself, my dear. I dare say it was all for the best, only I had no conception of how you were living. Our butler's wife lives in a better house than this.\"\n\"It is sometimes very pretty--in summer; you can't judge by what it is now. I have been very happy here,\" and Margaret closed her eyes by way of stopping the conversation.\nThe house teemed with comfort now, compared to what it had been. The evenings were chilly, and by Mrs. Shaw's directions fires were lighted in every bedroom. She petted Margaret in every possible way, and bought every delicacy, or soft luxury in which she herself would have burrowed and sought comfort. But Margaret was indifferent to all these things; or, if they forced themselves upon her attention, it was simply as causes for gratitude to her aunt, who was putting herself so much out of the way to think of her. She was restless, though so weak. All the day long, she kept herself from thinking of the ceremony which was going on at Oxford, by wandering from room to room, and languidly setting aside such articles as she wished to retain. Dixon followed her by Mrs. Shaw's desire, ostensibly to receive instructions, but with a private injunction to soothe her into repose as soon as might be.\n\"These books, Dixon, I will keep. All the rest will you send to Mr. Bell? They are of a kind that he will value for themselves, as well as for papa's sake. This---- I should like you to take this to Mr. Thornton, after I am gone. Stay; I will write a note with it.\" And she sate down hastily, as if afraid of thinking, and wrote:\n\"DEAR SIR,--The accompanying book I am sure will be valued by you for the sake of my father, to whom it belonged.\n\"Yours sincerely,\nMARGARET HALE.\"\nShe set out again upon her travels through the house, turning over articles, known to her from her childhood, with a sort of caressing reluctance to leave them--old-fashioned, worn and shabby, as they might be. But she hardly spoke again; and Dixon's report to Mrs. Shaw was, that \"she doubted whether Miss Hale heard a word of what she said, though she talked the whole time, in order to divert her intention.\" The consequence of her being on her feet all day was excessive bodily weariness in the evening, and a better night's rest than she had had since she heard of Mr. Hale's death.\nAt breakfast time the next day, she expressed her wish to go and bid one or two friends good-bye. Mrs. Shaw objected:\n\"I am sure, my dear, you can have no friends here with whom you are sufficiently intimate to justify you in calling upon them so soon; before you have been at church.\"\n\"But to-day is my only day; if Captain Lennox comes this after noon, and if we must--if I must really go to-morrow----\"\n\"Oh, yes, we shall go to-morrow. I am more and more convinced that this air is bad for you, and makes you look so pale and ill; besides, Edith expects us; and she may be waiting for me; and you cannot be left alone, my dear, at your age. No; if you must make these calls, I will go with you. Dixon can get us a coach, I suppose?\"\nSo Mrs. Shaw went to take care of Margaret and took her maid with her to take care of the shawls and air-cushions. Margaret's face was too sad to lighten up into a smile at all this preparation for paying two visits, that she had often made by herself at all hours of the day. She was half afraid of owning that one place to which she was going was Nicholas Higgins'; all she could do was to hope her aunt would be indisposed to get out of the coach and walk up the court, and at every breath of wind have her face slapped by wet clothes, hanging out to dry on ropes stretched from house to house.\nThere was a little battle in Mrs. Shaw's mind between ease and a sense of matronly propriety; but the former gained the day; and with many an injunction to Margaret to be careful of herself, and not to catch any fever, such as was always lurking in such places, her aunt permitted her to go where she had often been before without taking any precaution or requiring any permission.\nNicholas was out; only Mary and one or two of the Boucher children at home. Margaret was vexed with herself for not having timed her visit better. Mary had a very blunt intellect, although her feelings were warm and kind; and the instant she understood what Margaret's purpose was in coming to see them, she began to cry and sob with so little restraint that Margaret found it useless to say any of the thousand little things which had suggested themselves to her as she was coming along in the coach. She could only try to comfort her a little by suggesting the vague chance of their meeting again, at some possible time, in some possible place, and bid her tell her father how much she wished, if he could manage it, that he should come to see her when he had done his work in the evening.\nAs she was leaving the place, she stopped and looked around; then hesitated a little before she said:\n\"I should like to have some little thing to remind me of Bessy.\"\nInstantly Mary's generosity was keenly alive. What could they give? And on Margaret's singling out a little common drinking-cup, which she remembered as the one always standing by Bessy's side with a drink for her feverish lips, Mary said:\n\"Oh, take summat better; that only cost fourpence!\"\n\"That will do, thank you,\" said Margaret; and she went quickly away, while the light caused by the pleasure of having something to give yet lingered on Mary's face.\n\"Now to Mrs. Thornton's,\" thought she to herself. \"It must be done.\" But she looked rather rigid and pale at the thoughts of it, and had hard work to find the exact words in which to explain to her aunt who Mrs. Thornton was, and why she should go to bid her farewell.\nThey (for Mrs. Shaw alighted here) were shown into the drawing-room, in which a fire had only just been kindled. Mrs. Shaw huddled herself up in her shawl and shivered.\n\"What an icy room!\" she said.\nThey had to wait for some time before Mrs. Thornton entered. There was some softening in her heart towards Margaret, now that she was going away out of her sight. She remembered her spirit, as shown at various times and places, even more than the patience with which she had endured long and wearing cares. Her countenance was blander than usual, as she greeted her; there was even a shade of tenderness in her manner, as she noticed the white, tear-swollen face, and the quiver in the voice which Margaret tried to make so steady.\n\"Allow me to introduce my aunt, Mrs. Shaw. I am going away from Milton to-morrow; I do not know if you are aware of it, but I wanted to see you once again, Mrs. Thornton, to--to apologize for my manner the last time I saw you; and to say that I am sure you meant kindly--however much we may have misunderstood each other.\"\nMrs. Shaw looked extremely perplexed by what Margaret had said. Thanks for kindness! and apologies for failure in good manners! But Mrs. Thornton replied:\n\"Miss Hale, I am glad you do me justice. I did no more than I believed to be my duty in remonstrating with you as I did. I have always desired to act the part of a friend to you. I am glad you do me justice.\"\n\"And,\" said Margaret, blushing excessively as she spoke, \"will you do me justice, and believe that though I cannot--I do not choose--to give explanations of my conduct, I have not acted in the unbecoming way you apprehended?\"\nMargaret's voice was so soft, and her eyes so pleading, that Mrs. Thornton was for once affected by the charm of manner to which she had hitherto proved herself invulnerable.\n\"Yes, I do believe you. Let us say no more about it. Where are you going to reside, Miss Hale? I understood from Mr. Bell that you were going to leave Milton. You never liked Milton, you know,\" said Mrs. Thornton, with a sort of grim smile; \"but for all that, you must not expect me to congratulate you on quitting it. Where shall you live?\"\n\"With my aunt,\" replied Margaret, turning towards Mrs. Shaw.\n\"My niece will reside with me in Harley Street. She is almost like a daughter to me,\" said Mrs. Shaw, looking fondly at Margaret; \"and I am glad to acknowledge my own obligation for any kindness that has been shown to her. If you and your husband ever come to the town, my son and daughter, Captain and Mrs. Lennox, will, I am sure, join with me in wishing to do anything in our power to show you attention.\"\nMrs. Thornton thought in her own mind, that Margaret had not taken much care to enlighten her aunt as to the relationship between the Mr. and Mrs. Thornton, towards whom the fine-lady aunt was extending her soft patronage; so she answered shortly,\n\"My husband is dead. Mr. Thornton is my son. I never go to London; so I am not likely to be able to avail myself of your polite offers.\"\nAt this instant Mr. Thornton entered the room; he had only just returned from Oxford. His mourning suit spoke of the reason that had called him there.\n\"John,\" said his mother, \"this lady is Mrs. Shaw, Miss Hale's aunt. I am sorry to say, that Miss Hale's call is to wish us good-bye.\"\n\"You are going then!\" said he in a low voice.\n\"Yes,\" said Margaret. \"We leave to-morrow.\"\n\"My son-in-law comes this evening to escort us,\" said Mrs. Shaw.\nMr. Thornton turned away. He had not sat down, and now he seemed to be examining something on the table, almost as if he had discovered an unopened letter, which had made him forget the present company. He did not even seem to be aware when they got up to take leave. He started forwards, however, to hand Mrs. Shaw down to the carriage. As it drove up, he and Margaret stood close together on the door-step, and it was impossible but that the recollection of the day of the riot should force itself into both their minds. Into his it came associated with the speeches of the following day; her passionate declaration that there was not a man in all that violent and a desperate crowd, for whom she did not care as much as for him. And at the remembrance of her taunting words, his brow grew stern, though his heart beat thick with longing love. \"No!\" said he, \"I put it to the touch once, and I lost it all. Let her go,--with her stony heart, and her beauty;--how set and terrible her look is now, for all her loveliness of feature! She is afraid I shall speak what will require some stern repression. Let her go. Beauty and heiress as she may be, she will find it hard to meet with a truer heart than mine. Let her go!\"\nAnd there was no tone of regret, or emotion of any kind in the voice with which he said good-bye; and the offered hand was taken with a resolute calmness, and dropped as carelessly as if it had been a dead and withered flower. But none in his household saw Mr. Thornton again that day. He was busily engaged; or so he said.\nMargaret's strength was so utterly exhausted by these visits, that she had to submit to much watching and petting, and sighing \"I-told-you-so's,\" from her aunt. Dixon said she was quite as bad as she had been on the first day she heard of her father's death; and she and Mrs. Shaw consulted as to the desirableness of delaying the morrow's journey. But when her aunt reluctantly proposed a few days' delay to Margaret, the latter writhed her body as if in acute suffering, and said:\n\"Oh! let us go. I cannot be patient here. I shall not get well here. I want to forget.\"\nSo the arrangements went on: and Captain Lennox came, and with him news of Edith and the little boy; and Margaret found that the indifferent, careless conversation of one who, however kind, was not too warm and anxious a sympathiser, did her good. She roused up; and by the time that she knew she might expect Higgins, she was able to leave the room quietly, and await in her own chamber the expected summons.\n\"Eh!\" said he, as she came in, \"to think of th' oud gentleman dropping off as he did! Yo' might ha' knocked me down wi' a straw when they telled me. 'Mr. Hale?' said I; 'him as was th' parson?' 'Ay,' said they. 'Then,' said I, 'there's as good a man gone as ever lived on this earth, let who will be t'other!' And I came to see yo', and tell yo' how grieved I were, but them women in th' kitchen wouldn't tell yo' I were there. They said yo' were ill,--and butter me, but yo' dunnot look like the same wench. And yo're going to be a grand lady up i' Lunnon, aren't yo'?\"\n\"Not a grand lady,\" said Margaret, half smiling.\n\"Well! Thornton said--says he, a day or two ago, 'Higgins, have yo' seen Miss Hale?' 'No,' says I; 'there's a pack o' women who won't let me at her. But I can bide my time, if she's ill. She and I knows each other pretty well; and hoo'l not go doubting that I'm main sorry for th' oud gentleman's death, just because I can't get at her and tell her so.' And says he, 'Yo'll not have much time for to try and see her, my fine chap. She's not for staying with us a day longer nor she can help. She's got grand relations, and they're carrying her off; and we shan't see her no more.' 'Measter,' said I, 'if I dunnot see her afore hoo goes, I'll strive to get up to Lunnon next Whitsuntide, that I will. I'll not be baulked of saying her good-bye by any relations whatsomdever. But bless yo', I knowed yo'd come. It were only for to humour the measter, I let on as if I thought yo'd mappen leave Milton without seeing me.\"\n\"You're quite right,\" said Margaret. \"You only do me justice. And you'll not forget me, I'm sure. If no one else in Milton remembers me, I'm certain you will; and papa too. You know how good and tender he was. Look, Higgins! here is his bible. I have kept it for you. I can ill spare it; but I know he would have liked you to have it. I'm sure you'll care for it, and study what is in it, for his sake.\"\n\"Yo' may say that. If it were the deuce's own scribble, and yo' axed me to read in it for yo'r sake and the oud gentleman's, I'd do it. Whatten's this, wench! I'm not going for to take yo'r brass, so dunnot think it. We've been great friends, 'bout the sound o' money passing between us.\"\n\"For the children--for Boucher's children,\" said Margaret, hurriedly. \"They may need it. You've no right to refuse it for them. I would not give you one penny,\" she said, smiling; \"don't think there's any of it for you.\"\n\"Well, wench! I can nobbut say, Bless yo'! and bless yo'!--and amen.\"",
        "paragraph_chars": [
            [
                0,
                92
            ],
            [
                92,
                1435
            ],
            [
                1435,
                4369
            ],
            [
                4369,
                4800
            ],
            [
                4800,
                4859
            ],
            [
                4859,
                4931
            ],
            [
                4931,
                5073
            ],
            [
                5073,
                5130
            ],
            [
                5130,
                5310
            ],
            [
                5310,
                5482
            ],
            [
                5482,
                6384
            ],
            [
                6384,
                6714
            ],
            [
                6714,
                6828
            ],
            [
                6828,
                6846
            ],
            [
                6846,
                6862
            ],
            [
                6862,
                7450
            ],
            [
                7450,
                7568
            ],
            [
                7568,
                7736
            ],
            [
                7736,
                7856
            ],
            [
                7856,
                8186
            ],
            [
                8186,
                8784
            ],
            [
                8784,
                9166
            ],
            [
                9166,
                9958
            ],
            [
                9958,
                10060
            ],
            [
                10060,
                10125
            ],
            [
                10125,
                10365
            ],
            [
                10365,
                10417
            ],
            [
                10417,
                10582
            ],
            [
                10582,
                10851
            ],
            [
                10851,
                11020
            ],
            [
                11020,
                11050
            ],
            [
                11050,
                11582
            ],
            [
                11582,
                11905
            ],
            [
                11905,
                12060
            ],
            [
                12060,
                12269
            ],
            [
                12269,
                12495
            ],
            [
                12495,
                12670
            ],
            [
                12670,
                13012
            ],
            [
                13012,
                13073
            ],
            [
                13073,
                13482
            ],
            [
                13482,
                13730
            ],
            [
                13730,
                13867
            ],
            [
                13867,
                14018
            ],
            [
                14018,
                14152
            ],
            [
                14152,
                14198
            ],
            [
                14198,
                14242
            ],
            [
                14242,
                14307
            ],
            [
                14307,
                15529
            ],
            [
                15529,
                15853
            ],
            [
                15853,
                16336
            ],
            [
                16336,
                16424
            ],
            [
                16424,
                16834
            ],
            [
                16834,
                17405
            ],
            [
                17405,
                17454
            ],
            [
                17454,
                18373
            ],
            [
                18373,
                18777
            ],
            [
                18777,
                19066
            ],
            [
                19066,
                19287
            ],
            [
                19287,
                19356
            ]
        ],
        "segment_chars": [
            [
                0,
                83
            ],
            [
                83,
                92
            ],
            [
                92,
                200
            ],
            [
                200,
                393
            ],
            [
                393,
                548
            ],
            [
                548,
                597
            ],
            [
                597,
                985
            ],
            [
                985,
                1435
            ],
            [
                1435,
                1676
            ],
            [
                1676,
                1718
            ],
            [
                1718,
                1941
            ],
            [
                1941,
                2116
            ],
            [
                2116,
                2200
            ],
            [
                2200,
                2337
            ],
            [
                2337,
                2381
            ],
            [
                2381,
                2458
            ],
            [
                2458,
                2493
            ],
            [
                2493,
                2531
            ],
            [
                2531,
                2632
            ],
            [
                2632,
                2708
            ],
            [
                2708,
                2795
            ],
            [
                2795,
                2975
            ],
            [
                2975,
                3062
            ],
            [
                3062,
                3313
            ],
            [
                3313,
                3560
            ],
            [
                3560,
                3711
            ],
            [
                3711,
                3737
            ],
            [
                3737,
                3766
            ],
            [
                3766,
                3887
            ],
            [
                3887,
                4095
            ],
            [
                4095,
                4185
            ],
            [
                4185,
                4292
            ],
            [
                4292,
                4351
            ],
            [
                4351,
                4369
            ],
            [
                4369,
                4474
            ],
            [
                4474,
                4569
            ],
            [
                4569,
                4744
            ],
            [
                4744,
                4800
            ],
            [
                4800,
                4819
            ],
            [
                4819,
                4859
            ],
            [
                4859,
                4865
            ],
            [
                4865,
                4887
            ],
            [
                4887,
                4931
            ],
            [
                4931,
                5013
            ],
            [
                5013,
                5073
            ],
            [
                5073,
                5095
            ],
            [
                5095,
                5130
            ],
            [
                5130,
                5171
            ],
            [
                5171,
                5256
            ],
            [
                5256,
                5310
            ],
            [
                5310,
                5386
            ],
            [
                5386,
                5482
            ],
            [
                5482,
                5547
            ],
            [
                5547,
                5640
            ],
            [
                5640,
                5786
            ],
            [
                5786,
                6001
            ],
            [
                6001,
                6035
            ],
            [
                6035,
                6229
            ],
            [
                6229,
                6384
            ],
            [
                6384,
                6418
            ],
            [
                6418,
                6458
            ],
            [
                6458,
                6540
            ],
            [
                6540,
                6614
            ],
            [
                6614,
                6650
            ],
            [
                6650,
                6714
            ],
            [
                6714,
                6828
            ],
            [
                6828,
                6846
            ],
            [
                6846,
                6862
            ],
            [
                6862,
                7073
            ],
            [
                7073,
                7274
            ],
            [
                7274,
                7450
            ],
            [
                7450,
                7548
            ],
            [
                7548,
                7568
            ],
            [
                7568,
                7736
            ],
            [
                7736,
                7856
            ],
            [
                7856,
                7889
            ],
            [
                7889,
                8094
            ],
            [
                8094,
                8148
            ],
            [
                8148,
                8186
            ],
            [
                8186,
                8301
            ],
            [
                8301,
                8463
            ],
            [
                8463,
                8784
            ],
            [
                8784,
                9166
            ],
            [
                9166,
                9242
            ],
            [
                9242,
                9313
            ],
            [
                9313,
                9668
            ],
            [
                9668,
                9958
            ],
            [
                9958,
                10060
            ],
            [
                10060,
                10125
            ],
            [
                10125,
                10171
            ],
            [
                10171,
                10193
            ],
            [
                10193,
                10365
            ],
            [
                10365,
                10417
            ],
            [
                10417,
                10582
            ],
            [
                10582,
                10632
            ],
            [
                10632,
                10651
            ],
            [
                10651,
                10851
            ],
            [
                10851,
                10964
            ],
            [
                10964,
                11020
            ],
            [
                11020,
                11040
            ],
            [
                11040,
                11050
            ],
            [
                11050,
                11111
            ],
            [
                11111,
                11213
            ],
            [
                11213,
                11357
            ],
            [
                11357,
                11582
            ],
            [
                11582,
                11625
            ],
            [
                11625,
                11905
            ],
            [
                11905,
                11969
            ],
            [
                11969,
                11990
            ],
            [
                11990,
                12033
            ],
            [
                12033,
                12060
            ],
            [
                12060,
                12101
            ],
            [
                12101,
                12181
            ],
            [
                12181,
                12239
            ],
            [
                12239,
                12269
            ],
            [
                12269,
                12495
            ],
            [
                12495,
                12670
            ],
            [
                12670,
                12694
            ],
            [
                12694,
                12723
            ],
            [
                12723,
                12765
            ],
            [
                12765,
                12829
            ],
            [
                12829,
                12989
            ],
            [
                12989,
                13012
            ],
            [
                13012,
                13073
            ],
            [
                13073,
                13121
            ],
            [
                13121,
                13296
            ],
            [
                13296,
                13482
            ],
            [
                13482,
                13730
            ],
            [
                13730,
                13751
            ],
            [
                13751,
                13775
            ],
            [
                13775,
                13867
            ],
            [
                13867,
                13953
            ],
            [
                13953,
                14018
            ],
            [
                14018,
                14086
            ],
            [
                14086,
                14152
            ],
            [
                14152,
                14174
            ],
            [
                14174,
                14198
            ],
            [
                14198,
                14220
            ],
            [
                14220,
                14242
            ],
            [
                14242,
                14307
            ],
            [
                14307,
                14333
            ],
            [
                14333,
                14510
            ],
            [
                14510,
                14575
            ],
            [
                14575,
                14645
            ],
            [
                14645,
                14830
            ],
            [
                14830,
                15039
            ],
            [
                15039,
                15153
            ],
            [
                15153,
                15159
            ],
            [
                15159,
                15216
            ],
            [
                15216,
                15341
            ],
            [
                15341,
                15410
            ],
            [
                15410,
                15422
            ],
            [
                15422,
                15516
            ],
            [
                15516,
                15529
            ],
            [
                15529,
                15756
            ],
            [
                15756,
                15815
            ],
            [
                15815,
                15853
            ],
            [
                15853,
                16014
            ],
            [
                16014,
                16202
            ],
            [
                16202,
                16336
            ],
            [
                16336,
                16341
            ],
            [
                16341,
                16352
            ],
            [
                16352,
                16378
            ],
            [
                16378,
                16405
            ],
            [
                16405,
                16424
            ],
            [
                16424,
                16672
            ],
            [
                16672,
                16834
            ],
            [
                16834,
                16840
            ],
            [
                16840,
                16920
            ],
            [
                16920,
                16983
            ],
            [
                16983,
                16988
            ],
            [
                16988,
                16995
            ],
            [
                16995,
                17028
            ],
            [
                17028,
                17045
            ],
            [
                17045,
                17144
            ],
            [
                17144,
                17262
            ],
            [
                17262,
                17343
            ],
            [
                17343,
                17405
            ],
            [
                17405,
                17454
            ],
            [
                17454,
                17461
            ],
            [
                17461,
                17539
            ],
            [
                17539,
                17603
            ],
            [
                17603,
                17808
            ],
            [
                17808,
                17885
            ],
            [
                17885,
                17946
            ],
            [
                17946,
                18035
            ],
            [
                18035,
                18154
            ],
            [
                18154,
                18228
            ],
            [
                18228,
                18263
            ],
            [
                18263,
                18373
            ],
            [
                18373,
                18410
            ],
            [
                18410,
                18435
            ],
            [
                18435,
                18471
            ],
            [
                18471,
                18546
            ],
            [
                18546,
                18583
            ],
            [
                18583,
                18598
            ],
            [
                18598,
                18617
            ],
            [
                18617,
                18641
            ],
            [
                18641,
                18708
            ],
            [
                18708,
                18777
            ],
            [
                18777,
                18796
            ],
            [
                18796,
                18913
            ],
            [
                18913,
                18936
            ],
            [
                18936,
                18994
            ],
            [
                18994,
                19066
            ],
            [
                19066,
                19136
            ],
            [
                19136,
                19155
            ],
            [
                19155,
                19194
            ],
            [
                19194,
                19287
            ],
            [
                19287,
                19301
            ],
            [
                19301,
                19330
            ],
            [
                19330,
                19356
            ]
        ],
        "overlap_chars": [
            [
                163,
                169
            ],
            [
                92,
                106
            ],
            [
                119,
                120
            ],
            [
                110,
                118
            ],
            [
                121,
                128
            ],
            [
                177,
                179
            ],
            [
                192,
                200
            ],
            [
                200,
                212
            ],
            [
                214,
                244
            ],
            [
                273,
                332
            ],
            [
                368,
                393
            ],
            [
                393,
                479
            ],
            [
                484,
                487
            ],
            [
                557,
                577
            ],
            [
                595,
                597
            ],
            [
                675,
                684
            ],
            [
                597,
                601
            ],
            [
                688,
                696
            ],
            [
                713,
                748
            ],
            [
                777,
                781
            ],
            [
                783,
                793
            ],
            [
                610,
                613
            ],
            [
                804,
                823
            ],
            [
                835,
                894
            ],
            [
                962,
                984
            ],
            [
                985,
                991
            ],
            [
                1008,
                1021
            ],
            [
                1391,
                1435
            ],
            [
                1439,
                1452
            ],
            [
                1572,
                1573
            ],
            [
                1455,
                1468
            ],
            [
                1483,
                1572
            ],
            [
                1574,
                1590
            ],
            [
                1592,
                1618
            ],
            [
                1631,
                1676
            ],
            [
                1676,
                1718
            ],
            [
                1718,
                1765
            ],
            [
                1958,
                2010
            ],
            [
                2114,
                2116
            ],
            [
                2200,
                2288
            ],
            [
                2289,
                2310
            ],
            [
                2314,
                2337
            ],
            [
                2337,
                2381
            ],
            [
                2381,
                2441
            ],
            [
                2448,
                2456
            ],
            [
                2458,
                2492
            ],
            [
                2501,
                2531
            ],
            [
                2585,
                2632
            ],
            [
                2632,
                2665
            ],
            [
                2671,
                2691
            ],
            [
                2706,
                2708
            ],
            [
                2708,
                2749
            ],
            [
                2798,
                2859
            ],
            [
                2867,
                2870
            ],
            [
                2874,
                2975
            ],
            [
                2975,
                3007
            ],
            [
                3059,
                3062
            ],
            [
                3062,
                3313
            ],
            [
                3318,
                3345
            ],
            [
                3363,
                3364
            ],
            [
                3446,
                3559
            ],
            [
                3560,
                3593
            ],
            [
                3623,
                3695
            ],
            [
                3709,
                3711
            ],
            [
                3711,
                3737
            ],
            [
                3737,
                3766
            ],
            [
                3766,
                3768
            ],
            [
                3773,
                3887
            ],
            [
                3887,
                3922
            ],
            [
                4111,
                4144
            ],
            [
                4093,
                4094
            ],
            [
                4189,
                4211
            ],
            [
                4221,
                4292
            ],
            [
                4292,
                4307
            ],
            [
                4308,
                4351
            ],
            [
                4351,
                4354
            ],
            [
                4356,
                4365
            ],
            [
                4369,
                4425
            ],
            [
                4427,
                4471
            ],
            [
                4474,
                4530
            ],
            [
                4567,
                4569
            ],
            [
                4569,
                4626
            ],
            [
                4628,
                4632
            ],
            [
                4744,
                4777
            ],
            [
                4626,
                4627
            ],
            [
                4778,
                4800
            ],
            [
                4804,
                4817
            ],
            [
                4819,
                4840
            ],
            [
                4853,
                4856
            ],
            [
                4860,
                4862
            ],
            [
                4865,
                4887
            ],
            [
                4888,
                4910
            ],
            [
                4921,
                4928
            ],
            [
                4932,
                5013
            ],
            [
                5013,
                5038
            ],
            [
                5045,
                5070
            ],
            [
                5095,
                5127
            ],
            [
                5131,
                5135
            ],
            [
                5137,
                5171
            ],
            [
                5171,
                5206
            ],
            [
                5256,
                5307
            ],
            [
                5311,
                5338
            ],
            [
                5340,
                5349
            ],
            [
                5384,
                5386
            ],
            [
                5386,
                5413
            ],
            [
                5420,
                5444
            ],
            [
                5464,
                5482
            ],
            [
                5482,
                5515
            ],
            [
                5545,
                5547
            ],
            [
                5603,
                5640
            ],
            [
                5687,
                5708
            ],
            [
                5710,
                5724
            ],
            [
                5728,
                5733
            ],
            [
                5651,
                5659
            ],
            [
                5777,
                5786
            ],
            [
                5786,
                5798
            ],
            [
                5838,
                5839
            ],
            [
                5884,
                5885
            ],
            [
                5799,
                5834
            ],
            [
                5999,
                6001
            ],
            [
                6001,
                6017
            ],
            [
                6035,
                6038
            ],
            [
                6043,
                6046
            ],
            [
                6051,
                6090
            ],
            [
                6017,
                6018
            ],
            [
                6100,
                6165
            ],
            [
                6176,
                6189
            ],
            [
                6207,
                6220
            ],
            [
                6033,
                6034
            ],
            [
                6391,
                6418
            ],
            [
                6431,
                6444
            ],
            [
                6422,
                6430
            ],
            [
                6445,
                6458
            ],
            [
                6458,
                6466
            ],
            [
                6477,
                6540
            ],
            [
                6540,
                6544
            ],
            [
                6549,
                6614
            ],
            [
                6614,
                6647
            ],
            [
                6650,
                6657
            ],
            [
                6663,
                6675
            ],
            [
                6701,
                6714
            ],
            [
                6716,
                6724
            ],
            [
                6726,
                6828
            ],
            [
                6829,
                6846
            ],
            [
                6850,
                6859
            ],
            [
                6862,
                6928
            ],
            [
                6929,
                6937
            ],
            [
                6972,
                7021
            ],
            [
                7026,
                7027
            ],
            [
                7047,
                7053
            ],
            [
                7058,
                7073
            ],
            [
                7073,
                7076
            ],
            [
                7354,
                7368
            ],
            [
                7077,
                7080
            ],
            [
                7133,
                7136
            ],
            [
                7448,
                7450
            ],
            [
                7450,
                7507
            ],
            [
                7515,
                7547
            ],
            [
                7748,
                7792
            ],
            [
                7803,
                7819
            ],
            [
                7831,
                7840
            ],
            [
                7857,
                7864
            ],
            [
                7866,
                7877
            ],
            [
                7887,
                7889
            ],
            [
                7889,
                7946
            ],
            [
                8092,
                8094
            ],
            [
                8098,
                8109
            ],
            [
                8115,
                8148
            ],
            [
                8148,
                8183
            ],
            [
                8186,
                8198
            ],
            [
                8229,
                8232
            ],
            [
                8238,
                8246
            ],
            [
                8199,
                8203
            ],
            [
                8247,
                8251
            ],
            [
                8276,
                8286
            ],
            [
                8295,
                8301
            ],
            [
                8301,
                8401
            ],
            [
                8403,
                8463
            ],
            [
                8463,
                8501
            ],
            [
                8623,
                8625
            ],
            [
                8692,
                8695
            ],
            [
                8571,
                8577
            ],
            [
                8535,
                8551
            ],
            [
                8657,
                8662
            ],
            [
                8521,
                8524
            ],
            [
                8583,
                8591
            ],
            [
                8626,
                8635
            ],
            [
                8782,
                8784
            ],
            [
                9166,
                9232
            ],
            [
                9233,
                9242
            ],
            [
                9242,
                9313
            ],
            [
                9313,
                9418
            ],
            [
                9424,
                9432
            ],
            [
                9443,
                9446
            ],
            [
                9450,
                9482
            ],
            [
                9491,
                9597
            ],
            [
                9633,
                9636
            ],
            [
                9598,
                9601
            ],
            [
                9623,
                9625
            ],
            [
                9666,
                9668
            ],
            [
                9668,
                9682
            ],
            [
                9759,
                9764
            ],
            [
                9811,
                9840
            ],
            [
                9850,
                9915
            ],
            [
                9949,
                9958
            ],
            [
                9958,
                10003
            ],
            [
                10054,
                10060
            ],
            [
                10061,
                10122
            ],
            [
                10125,
                10171
            ],
            [
                10171,
                10193
            ],
            [
                10193,
                10223
            ],
            [
                10305,
                10312
            ],
            [
                10226,
                10253
            ],
            [
                10354,
                10364
            ],
            [
                10366,
                10378
            ],
            [
                10382,
                10414
            ],
            [
                10423,
                10441
            ],
            [
                10444,
                10484
            ],
            [
                10580,
                10581
            ],
            [
                10583,
                10605
            ],
            [
                10608,
                10619
            ],
            [
                10630,
                10632
            ],
            [
                10633,
                10648
            ],
            [
                10651,
                10672
            ],
            [
                10683,
                10694
            ],
            [
                10704,
                10728
            ],
            [
                10762,
                10826
            ],
            [
                10833,
                10851
            ],
            [
                10861,
                10884
            ],
            [
                10851,
                10855
            ],
            [
                10886,
                10901
            ],
            [
                10906,
                10964
            ],
            [
                10964,
                10989
            ],
            [
                10993,
                11005
            ],
            [
                11006,
                11020
            ],
            [
                11050,
                11111
            ],
            [
                11111,
                11194
            ],
            [
                11211,
                11213
            ],
            [
                11213,
                11238
            ],
            [
                11276,
                11357
            ],
            [
                11417,
                11570
            ],
            [
                11574,
                11582
            ],
            [
                11583,
                11625
            ],
            [
                11625,
                11652
            ],
            [
                11662,
                11663
            ],
            [
                11706,
                11755
            ],
            [
                11655,
                11656
            ],
            [
                11653,
                11655
            ],
            [
                11770,
                11851
            ],
            [
                11861,
                11902
            ],
            [
                11905,
                11944
            ],
            [
                11967,
                11969
            ],
            [
                12033,
                12060
            ],
            [
                12066,
                12101
            ],
            [
                12101,
                12106
            ],
            [
                12120,
                12170
            ],
            [
                12179,
                12181
            ],
            [
                12181,
                12209
            ],
            [
                12222,
                12237
            ],
            [
                12270,
                12273
            ],
            [
                12276,
                12311
            ],
            [
                12324,
                12325
            ],
            [
                12327,
                12383
            ],
            [
                12385,
                12400
            ],
            [
                12402,
                12480
            ],
            [
                12495,
                12604
            ],
            [
                12615,
                12647
            ],
            [
                12656,
                12670
            ],
            [
                12671,
                12694
            ],
            [
                12694,
                12723
            ],
            [
                12723,
                12745
            ],
            [
                12752,
                12763
            ],
            [
                13013,
                13025
            ],
            [
                13028,
                13073
            ],
            [
                13077,
                13121
            ],
            [
                13121,
                13156
            ],
            [
                13159,
                13201
            ],
            [
                13294,
                13296
            ],
            [
                13296,
                13332
            ],
            [
                13337,
                13342
            ],
            [
                13389,
                13393
            ],
            [
                13433,
                13479
            ],
            [
                13482,
                13503
            ],
            [
                13521,
                13580
            ],
            [
                13587,
                13611
            ],
            [
                13616,
                13637
            ],
            [
                13731,
                13751
            ],
            [
                13751,
                13775
            ],
            [
                13775,
                13795
            ],
            [
                13867,
                13951
            ],
            [
                13953,
                13970
            ],
            [
                14016,
                14018
            ],
            [
                14019,
                14023
            ],
            [
                14026,
                14042
            ],
            [
                14044,
                14086
            ],
            [
                14086,
                14103
            ],
            [
                14105,
                14149
            ],
            [
                14153,
                14171
            ],
            [
                14174,
                14181
            ],
            [
                14182,
                14198
            ],
            [
                14199,
                14202
            ],
            [
                14205,
                14220
            ],
            [
                14221,
                14229
            ],
            [
                14246,
                14288
            ],
            [
                14291,
                14307
            ],
            [
                14307,
                14331
            ],
            [
                14352,
                14357
            ],
            [
                14365,
                14410
            ],
            [
                14461,
                14510
            ],
            [
                14510,
                14574
            ],
            [
                14575,
                14645
            ],
            [
                14645,
                14704
            ],
            [
                14714,
                14719
            ],
            [
                14747,
                14786
            ],
            [
                14800,
                14830
            ],
            [
                14830,
                14838
            ],
            [
                14991,
                14992
            ],
            [
                14839,
                14862
            ],
            [
                14879,
                14896
            ],
            [
                14970,
                14973
            ],
            [
                14898,
                14969
            ],
            [
                14986,
                14991
            ],
            [
                14993,
                15039
            ],
            [
                15039,
                15049
            ],
            [
                15083,
                15152
            ],
            [
                15154,
                15156
            ],
            [
                15164,
                15166
            ],
            [
                15214,
                15216
            ],
            [
                15216,
                15226
            ],
            [
                15229,
                15265
            ],
            [
                15268,
                15328
            ],
            [
                15339,
                15341
            ],
            [
                15422,
                15516
            ],
            [
                15516,
                15526
            ],
            [
                15529,
                15630
            ],
            [
                15635,
                15729
            ],
            [
                15739,
                15756
            ],
            [
                15756,
                15815
            ],
            [
                15815,
                15853
            ],
            [
                15853,
                15940
            ],
            [
                15981,
                15996
            ],
            [
                15999,
                16014
            ],
            [
                16202,
                16258
            ],
            [
                16306,
                16308
            ],
            [
                16270,
                16271
            ],
            [
                16262,
                16270
            ],
            [
                16330,
                16334
            ],
            [
                16324,
                16325
            ],
            [
                16334,
                16336
            ],
            [
                16337,
                16341
            ],
            [
                16341,
                16352
            ],
            [
                16378,
                16405
            ],
            [
                16405,
                16421
            ],
            [
                16465,
                16548
            ],
            [
                16566,
                16587
            ],
            [
                16658,
                16672
            ],
            [
                16691,
                16707
            ],
            [
                16734,
                16741
            ],
            [
                16796,
                16799
            ],
            [
                16741,
                16750
            ],
            [
                16756,
                16758
            ],
            [
                16832,
                16834
            ],
            [
                16835,
                16837
            ],
            [
                16840,
                16848
            ],
            [
                16866,
                16920
            ],
            [
                16920,
                16983
            ],
            [
                17070,
                17083
            ],
            [
                17089,
                17102
            ],
            [
                17144,
                17157
            ],
            [
                17171,
                17262
            ],
            [
                17262,
                17284
            ],
            [
                17341,
                17402
            ],
            [
                17406,
                17422
            ],
            [
                17425,
                17454
            ],
            [
                17455,
                17461
            ],
            [
                17461,
                17474
            ],
            [
                17483,
                17502
            ],
            [
                17504,
                17536
            ],
            [
                17540,
                17542
            ],
            [
                17545,
                17552
            ],
            [
                17554,
                17603
            ],
            [
                17603,
                17606
            ],
            [
                17641,
                17694
            ],
            [
                17698,
                17715
            ],
            [
                17721,
                17805
            ],
            [
                17808,
                17820
            ],
            [
                17822,
                17869
            ],
            [
                17883,
                17885
            ],
            [
                17885,
                17894
            ],
            [
                17899,
                17946
            ],
            [
                17946,
                18032
            ],
            [
                18038,
                18043
            ],
            [
                18046,
                18053
            ],
            [
                18055,
                18119
            ],
            [
                18123,
                18130
            ],
            [
                18133,
                18152
            ],
            [
                18228,
                18231
            ],
            [
                18232,
                18261
            ],
            [
                18374,
                18392
            ],
            [
                18395,
                18410
            ],
            [
                18435,
                18471
            ],
            [
                18471,
                18546
            ],
            [
                18583,
                18598
            ],
            [
                18598,
                18617
            ],
            [
                18665,
                18708
            ],
            [
                18708,
                18746
            ],
            [
                18758,
                18774
            ],
            [
                18869,
                18870
            ],
            [
                18796,
                18866
            ],
            [
                18872,
                18876
            ],
            [
                18877,
                18880
            ],
            [
                18885,
                18913
            ],
            [
                18913,
                18934
            ],
            [
                18936,
                18949
            ],
            [
                18954,
                18961
            ],
            [
                18972,
                18992
            ],
            [
                19085,
                19107
            ],
            [
                19110,
                19136
            ],
            [
                19142,
                19155
            ],
            [
                19194,
                19214
            ],
            [
                19219,
                19224
            ],
            [
                19227,
                19245
            ],
            [
                19247,
                19284
            ],
            [
                19288,
                19301
            ],
            [
                19301,
                19330
            ],
            [
                19330,
                19343
            ],
            [
                19346,
                19354
            ]
        ],
        "row_chars": [
            [
                0,
                83
            ],
            [
                83,
                92
            ],
            [
                92,
                200
            ],
            [
                200,
                393
            ],
            [
                393,
                597
            ],
            [
                597,
                985
            ],
            [
                985,
                1435
            ],
            [
                1435,
                1676
            ],
            [
                1676,
                1718
            ],
            [
                1718,
                2116
            ],
            [
                2116,
                2200
            ],
            [
                2200,
                2337
            ],
            [
                2337,
                2381
            ],
            [
                2381,
                2493
            ],
            [
                2493,
                2531
            ],
            [
                2531,
                2632
            ],
            [
                2632,
                2708
            ],
            [
                2708,
                2975
            ],
            [
                2975,
                3062
            ],
            [
                3062,
                3313
            ],
            [
                3313,
                3560
            ],
            [
                3560,
                3711
            ],
            [
                3711,
                3737
            ],
            [
                3737,
                3766
            ],
            [
                3766,
                3887
            ],
            [
                3887,
                4185
            ],
            [
                4185,
                4292
            ],
            [
                4292,
                4351
            ],
            [
                4351,
                4369
            ],
            [
                4369,
                4474
            ],
            [
                4474,
                4569
            ],
            [
                4569,
                4800
            ],
            [
                4800,
                4819
            ],
            [
                4819,
                4859
            ],
            [
                4859,
                4865
            ],
            [
                4865,
                4887
            ],
            [
                4887,
                4931
            ],
            [
                4931,
                5013
            ],
            [
                5013,
                5073
            ],
            [
                5073,
                5095
            ],
            [
                5095,
                5130
            ],
            [
                5130,
                5171
            ],
            [
                5171,
                5310
            ],
            [
                5310,
                5386
            ],
            [
                5386,
                5482
            ],
            [
                5482,
                5547
            ],
            [
                5547,
                5640
            ],
            [
                5640,
                5786
            ],
            [
                5786,
                6001
            ],
            [
                6001,
                6229
            ],
            [
                6229,
                6384
            ],
            [
                6384,
                6418
            ],
            [
                6418,
                6458
            ],
            [
                6458,
                6540
            ],
            [
                6540,
                6614
            ],
            [
                6614,
                6650
            ],
            [
                6650,
                6714
            ],
            [
                6714,
                6828
            ],
            [
                6828,
                6846
            ],
            [
                6846,
                6862
            ],
            [
                6862,
                7073
            ],
            [
                7073,
                7450
            ],
            [
                7450,
                7548
            ],
            [
                7548,
                7568
            ],
            [
                7568,
                7736
            ],
            [
                7736,
                7856
            ],
            [
                7856,
                7889
            ],
            [
                7889,
                8094
            ],
            [
                8094,
                8148
            ],
            [
                8148,
                8186
            ],
            [
                8186,
                8301
            ],
            [
                8301,
                8463
            ],
            [
                8463,
                8784
            ],
            [
                8784,
                9166
            ],
            [
                9166,
                9242
            ],
            [
                9242,
                9313
            ],
            [
                9313,
                9668
            ],
            [
                9668,
                9958
            ],
            [
                9958,
                10060
            ],
            [
                10060,
                10125
            ],
            [
                10125,
                10171
            ],
            [
                10171,
                10193
            ],
            [
                10193,
                10417
            ],
            [
                10417,
                10582
            ],
            [
                10582,
                10632
            ],
            [
                10632,
                10651
            ],
            [
                10651,
                10851
            ],
            [
                10851,
                10964
            ],
            [
                10964,
                11020
            ],
            [
                11020,
                11040
            ],
            [
                11040,
                11050
            ],
            [
                11050,
                11111
            ],
            [
                11111,
                11213
            ],
            [
                11213,
                11357
            ],
            [
                11357,
                11582
            ],
            [
                11582,
                11625
            ],
            [
                11625,
                11905
            ],
            [
                11905,
                11969
            ],
            [
                11969,
                11990
            ],
            [
                11990,
                12033
            ],
            [
                12033,
                12060
            ],
            [
                12060,
                12101
            ],
            [
                12101,
                12181
            ],
            [
                12181,
                12239
            ],
            [
                12239,
                12269
            ],
            [
                12269,
                12495
            ],
            [
                12495,
                12670
            ],
            [
                12670,
                12694
            ],
            [
                12694,
                12723
            ],
            [
                12723,
                12765
            ],
            [
                12765,
                12829
            ],
            [
                12829,
                12989
            ],
            [
                12989,
                13012
            ],
            [
                13012,
                13073
            ],
            [
                13073,
                13121
            ],
            [
                13121,
                13296
            ],
            [
                13296,
                13482
            ],
            [
                13482,
                13730
            ],
            [
                13730,
                13751
            ],
            [
                13751,
                13775
            ],
            [
                13775,
                13867
            ],
            [
                13867,
                14018
            ],
            [
                14018,
                14086
            ],
            [
                14086,
                14152
            ],
            [
                14152,
                14174
            ],
            [
                14174,
                14198
            ],
            [
                14198,
                14220
            ],
            [
                14220,
                14242
            ],
            [
                14242,
                14307
            ],
            [
                14307,
                14510
            ],
            [
                14510,
                14575
            ],
            [
                14575,
                14645
            ],
            [
                14645,
                14830
            ],
            [
                14830,
                15039
            ],
            [
                15039,
                15153
            ],
            [
                15153,
                15159
            ],
            [
                15159,
                15216
            ],
            [
                15216,
                15341
            ],
            [
                15341,
                15410
            ],
            [
                15410,
                15422
            ],
            [
                15422,
                15516
            ],
            [
                15516,
                15529
            ],
            [
                15529,
                15756
            ],
            [
                15756,
                15815
            ],
            [
                15815,
                15853
            ],
            [
                15853,
                16014
            ],
            [
                16014,
                16202
            ],
            [
                16202,
                16336
            ],
            [
                16336,
                16341
            ],
            [
                16341,
                16352
            ],
            [
                16352,
                16378
            ],
            [
                16378,
                16405
            ],
            [
                16405,
                16424
            ],
            [
                16424,
                16672
            ],
            [
                16672,
                16834
            ],
            [
                16834,
                16840
            ],
            [
                16840,
                16920
            ],
            [
                16920,
                16983
            ],
            [
                16983,
                16988
            ],
            [
                16988,
                16995
            ],
            [
                16995,
                17028
            ],
            [
                17028,
                17045
            ],
            [
                17045,
                17144
            ],
            [
                17144,
                17262
            ],
            [
                17262,
                17405
            ],
            [
                17405,
                17454
            ],
            [
                17454,
                17461
            ],
            [
                17461,
                17539
            ],
            [
                17539,
                17603
            ],
            [
                17603,
                17808
            ],
            [
                17808,
                17885
            ],
            [
                17885,
                17946
            ],
            [
                17946,
                18035
            ],
            [
                18035,
                18154
            ],
            [
                18154,
                18228
            ],
            [
                18228,
                18263
            ],
            [
                18263,
                18373
            ],
            [
                18373,
                18410
            ],
            [
                18410,
                18435
            ],
            [
                18435,
                18471
            ],
            [
                18471,
                18546
            ],
            [
                18546,
                18583
            ],
            [
                18583,
                18598
            ],
            [
                18598,
                18617
            ],
            [
                18617,
                18641
            ],
            [
                18641,
                18708
            ],
            [
                18708,
                18777
            ],
            [
                18777,
                18796
            ],
            [
                18796,
                18913
            ],
            [
                18913,
                18936
            ],
            [
                18936,
                18994
            ],
            [
                18994,
                19066
            ],
            [
                19066,
                19136
            ],
            [
                19136,
                19155
            ],
            [
                19155,
                19194
            ],
            [
                19194,
                19287
            ],
            [
                19287,
                19301
            ],
            [
                19301,
                19330
            ],
            [
                19330,
                19356
            ]
        ]
    },
    "abridged": {
        "text": "The gentle Mrs. Shaw took a vehement dislike to Milton. It was noisy and smoky, and the poor people were dirty, and the rich ladies over-dressed, and not a man wore clothes made to fit him. She was sure Margaret would never regain her lost strength while she stayed in Milton; she must return with her. She urged this until Margaret, weak, weary, and broken-spirited, reluctantly promised that as soon as the funeral was over, she would accompany her aunt back to town, leaving Dixon in charge of shutting up the house.\nBefore that mournful day, Margaret received a letter from Mr. Bell.\n'My dear Margaret,\n'I did mean to return to Milton on Thursday, but unluckily it turns out to be one of the rare occasions when we Plymouth Fellows are called upon to perform a duty, and I must not be absent from my post. Captain Lennox and Mr. Thornton are here. The former seems a smart, well-meaning man; and declares he must take you and his mother-in-law home. I will put matters into the hands of my Milton attorney if there is no will; for I doubt if this smart captain is any great man of business. Nevertheless, his moustachios are splendid. There will have to be a sale, so select what things you wish reserved, or you can send a list afterwards.\n'Two things more, and I have done. You are to have my money and goods when I die. Not that I mean to die yet; but I say this just to explain. These Lennoxes seem very fond of you now; but it is best to start with a formal agreement; namely, that you will pay them two hundred and fifty pounds a year, as long as you and they find it pleasant to live together. (This, of course, includes Dixon.) Then you won't be thrown adrift, if some day the captain wishes to have his house to himself, but you can carry yourself and your two hundred and fifty pounds off somewhere else; if, indeed, I have not claimed you to come and keep house for me first. As to dress, and Dixon, and so on, I shall consult some lady of my acquaintance, and see how much you will have from your father before fixing this.\n'Now, Margaret, have you flown out yet, and wondered what right the old man has to settle your affairs for you? I make no doubt you have. Yet the old man has a right. He loved your father for five and thirty years; he stood beside him on his wedding-day; he closed his eyes in death. Moreover, he is your godfather; and has not a known relation on earth. His whole heart is set upon this one thing, and Margaret Hale is not the girl to say him nay. Write by return, if only two lines, to tell me your answer. But no thanks.'\nMargaret took up a pen and scrawled with trembling hand, 'Margaret Hale is not the girl to say him nay.' In her weak state she could not think of any other words. But she was so much fatigued even by this slight exertion that she was obliged to lie down again, and try not to think.\n'My dearest child!' said her aunt. 'Has that letter vexed you?'\n'No!' said Margaret feebly. 'I shall be better when tomorrow is over.'\n'I feel sure, darling, you won't be better till I get you out of this horrid air. How you can have borne it two years I can't imagine.'\n'I could not leave papa and mamma.'\n'Well! don't distress yourself, my dear. I dare say it was all for the best, but our butler's wife lives in a better house than this.'\n'It is sometimes very pretty - in summer. I have been very happy here.' Margaret closed her eyes to stop the conversation.\nThe house teemed with comfort now. Fires were lighted in every bedroom. Mrs. Shaw bought every delicacy or soft luxury which might give Margaret comfort. But Margaret, though grateful, was indifferent to all these things. She was restless; all day, she kept herself from thinking of the funeral, which was going on at Oxford, by wandering from room to room, and setting aside anything she wished to keep.\n'These books, Dixon, I will keep. Will you send the rest to Mr. Bell? They are ones that he will value for themselves, as well as for papa's sake. This - I should like you to take this to Mr. Thornton, after I am gone. Stay; I will write a note with it.' And she sat down hastily, and wrote:\n'Dear Sir,\nThe accompanying book I am sure will be valued by you for the sake of my father, to whom it belonged.\n'Yours sincerely,\n'Margaret Hale.'\nShe set out again upon her travels through the house, turning over familiar articles with a sort of caressing reluctance to leave them - shabby though they might be. But in the evening she was excessively weary.\nAt breakfast time the next day, she expressed her wish to bid one or two friends good-bye.\n'Today is my only day; if Captain Lennox comes this afternoon, and if we must really go tomorrow-'\n'Oh, yes; we shall go tomorrow. I am more and more convinced that this air is bad for you. If you must pay these calls, I will go with you. Dixon can get us a coach, I suppose?'\nSo Mrs. Shaw and her maid went, with shawls and cushions. Margaret's face was too sad to lighten up into a smile at all this preparation for paying two visits that she had often made by herself at all hours of the day. She was half afraid of owning that one of her visits was to Nicholas Higgins's, and was glad that her aunt stayed in the coach.\nNicholas was out; only Mary and one or two of the Boucher children were at home. Margaret was vexed with herself for not having timed her visit better. Mary had a very blunt intellect, although her feelings were warm and kind; and the instant she understood why Margaret was coming to see them, she began to sob with so little restraint that Margaret found it useless to say any of the thousand little things which she had intended to. She could only suggest vaguely that they might meet again, and bid her tell her father that she wished, if he could manage it, that he should come to see her that evening.\nAs she was leaving the place, she stopped and said:\n'I should like to have some little thing to remind me of Bessy.'\nInstantly Mary's generosity was keenly alive. What could they give? And on Margaret's singling out Bessy's little common drinking-cup, Mary said: 'Oh, take summut better; that only cost fourpence!'\n'That will do, thank you,' said Margaret; and she went quickly away. 'Now to Mrs. Thornton's,' thought she. 'It must be done.' But she looked rather pale at the thought of it, and had hard work to explain to her aunt who Mrs. Thornton was, and why she should bid her farewell.\nMrs. Shaw alighted here, and they were shown into Mrs. Thornton's drawing-room, in which a fire had only just been kindled. Mrs. Shaw huddled herself in her shawl, and shivered.\nThey had to wait for some time before Mrs. Thornton entered. There was some softening in her heart towards Margaret, now that she was going away. She remembered her spirit, even more than the patience with which she had endured long and wearing cares. There was even a shade of tenderness in her manner, as she noticed the white, tear-swollen face, and the quiver in the voice which Margaret tried to make steady.\n'Allow me to introduce my aunt, Mrs. Shaw. I am going away from Milton tomorrow; and I wanted to see you once again, Mrs. Thornton, to - to apologise for my manner the last time I saw you; and to say that I am sure you meant kindly - however much we may have misunderstood each other.'\nMrs. Shaw looked extremely perplexed by this. But Mrs. Thornton replied:\n'Miss Hale, I am glad you do me justice. I did what I believed to be my duty in remonstrating with you. I have always desired to act as a friend to you.'\n'And,' said Margaret, blushing excessively, 'will you do me justice, and believe that though I cannot - I do not choose - to give explanations of my conduct, I have not acted in the unbecoming way you thought?'\nMargaret's voice was so soft, and her eyes so pleading, that Mrs. Thornton was for once affected by the charm to which she had hitherto proved invulnerable.\n'Yes, I do believe you. Let us say no more about it. Where are you going to live, Miss Hale?'\n'With my aunt,' replied Margaret, turning towards Mrs. Shaw.\n'My niece will reside with me in Harley Street. She is almost like a daughter to me,' said Mrs. Shaw, looking fondly at Margaret. 'If you and your husband ever come to town, we will do anything in our power to show you attention.'\nMrs. Thornton thought that Margaret had not taken much care to enlighten her aunt about the relationship between Mr. and Mrs. Thornton. She said shortly, 'My husband is dead. Mr. Thornton is my son. I never go to London.'\nAt this instant Mr. Thornton entered the room; he had only just returned from Oxford, and still wore his mourning suit.\n'John,' said his mother, 'this lady is Mrs. Shaw, Miss Hale's aunt. I am sorry to say that Miss Hale's call is to wish us good-bye.'\n'You are going then!' said he, in a low voice.\n'Yes,' said Margaret. 'We leave tomorrow.'\n'My son-in-law comes this evening to escort us,' said Mrs. Shaw.\nMr. Thornton turned away, and seemed to be examining something on the table, which had made him forget the present company. He did not even seem to be aware when they got up to take leave.\nHe started forwards, however, to hand Mrs. Shaw down to the carriage. As it drove up, he and Margaret stood close together on the doorstep, and the recollection of the day of the riot forced itself into both their minds. Into his, it came associated with his proposal the following day, and her passionate declaration that there was not a man in all that violent crowd for whom she did not care as much as for him. And at the memory, his brow grew stern, though his heart beat thick with longing love.\n'No!' thought he. 'Let her go - with her stony heart, and her beauty - how set and terrible her look is now, for all her loveliness! Beauty and heiress as she may be, she will find it hard to meet with a truer heart than mine. Let her go!'\nAnd there was no tone of regret, or emotion of any kind in the voice with which he said good-bye; and her offered hand was taken with a resolute calmness, and dropped as carelessly as if it had been a withered flower. But none in his household saw Mr. Thornton again that day. He was busily engaged; or so he said.\nMargaret's strength was so utterly exhausted by these visits, that she had to submit to 'I-told-you-so's,' from her aunt. But when her aunt reluctantly proposed a few days' delay in their journey, Margaret said, agonised:\n'Oh! let us go. I shall not get well here. I want to forget.'\nCaptain Lennox came, and with him news of Edith and the little boy; and Margaret found that his careless conversation did her good. By the time that Higgins arrived at her house that evening, she was ready to greet him.\n'Eh!' said he, 'to think of th' oud gentleman dropping off as he did! Yo' might ha' knocked me down wi' a straw when they telled me. He were as good a man as ever lived. And I came to tell yo' how grieved I were, but them women in th' kitchen wouldn't tell yo' I were there. They said yo' were ill. And yo're going to be a grand lady up i' Lunnon, aren't yo'?'\n'Not a grand lady,' said Margaret, half smiling.\n'Well! Thornton said, a day or two ago, \"Higgins, have yo' seen Miss Hale?\" \"No,\" says I; \"there's a pack o' women who won't let me at her. But she and I knows each other pretty well; and hoo'l not be doubting that I'm sorry for th' oud gentleman's death, just because I can't get at her and tell her so.\" And says he, \"Yo'll not have much time for to try and see her. She's not staying with us a day longer nor she can help. She's got grand relations, and they're carrying her off; and we shan't see her no more.\" \"Measter,\" said I, \"if I dunnot see her afore hoo goes, I'll strive to get up to Lunnun next Whissuntide, that I will.\" But, bless yo', I knowed yo'd come.'\n'You're quite right,' said Margaret. 'And you'll not forget me, I'm sure. If no one else in Milton remembers me, I'm certain you will; and papa too. Look, Higgins! here is his Bible. I know he would have liked you to have it. I'm sure you'll care for it, and study it, for his sake.'\n'If it were the deuce's own scribble, and yo' axed me to read in it for your sake, and th' oud gentleman's, I'd do it. Whatten's this, wench? I'm not going to take your money, so dunnot think it.'\n'For Boucher's children,' said Margaret, hurriedly. 'They may need it. I would not give you a penny,' she said, smiling; 'don't think there's any of it for you.'\n'Well, wench! I can nobbut say, Bless yo'! and bless yo'! - and amen.'",
        "paragraph_chars": [
            [
                0,
                520
            ],
            [
                520,
                588
            ],
            [
                588,
                607
            ],
            [
                607,
                1245
            ],
            [
                1245,
                2040
            ],
            [
                2040,
                2565
            ],
            [
                2565,
                2848
            ],
            [
                2848,
                2912
            ],
            [
                2912,
                2983
            ],
            [
                2983,
                3119
            ],
            [
                3119,
                3155
            ],
            [
                3155,
                3290
            ],
            [
                3290,
                3413
            ],
            [
                3413,
                3818
            ],
            [
                3818,
                4110
            ],
            [
                4110,
                4121
            ],
            [
                4121,
                4223
            ],
            [
                4223,
                4241
            ],
            [
                4241,
                4258
            ],
            [
                4258,
                4470
            ],
            [
                4470,
                4561
            ],
            [
                4561,
                4660
            ],
            [
                4660,
                4838
            ],
            [
                4838,
                5185
            ],
            [
                5185,
                5793
            ],
            [
                5793,
                5845
            ],
            [
                5845,
                5910
            ],
            [
                5910,
                6108
            ],
            [
                6108,
                6385
            ],
            [
                6385,
                6563
            ],
            [
                6563,
                6977
            ],
            [
                6977,
                7263
            ],
            [
                7263,
                7336
            ],
            [
                7336,
                7490
            ],
            [
                7490,
                7701
            ],
            [
                7701,
                7858
            ],
            [
                7858,
                7952
            ],
            [
                7952,
                8013
            ],
            [
                8013,
                8244
            ],
            [
                8244,
                8466
            ],
            [
                8466,
                8586
            ],
            [
                8586,
                8719
            ],
            [
                8719,
                8766
            ],
            [
                8766,
                8809
            ],
            [
                8809,
                8874
            ],
            [
                8874,
                9063
            ],
            [
                9063,
                9565
            ],
            [
                9565,
                9805
            ],
            [
                9805,
                10120
            ],
            [
                10120,
                10342
            ],
            [
                10342,
                10404
            ],
            [
                10404,
                10624
            ],
            [
                10624,
                10985
            ],
            [
                10985,
                11034
            ],
            [
                11034,
                11706
            ],
            [
                11706,
                11990
            ],
            [
                11990,
                12187
            ],
            [
                12187,
                12349
            ],
            [
                12349,
                12419
            ]
        ],
        "segment_chars": [
            [
                0,
                56
            ],
            [
                56,
                190
            ],
            [
                190,
                303
            ],
            [
                303,
                520
            ],
            [
                520,
                588
            ],
            [
                588,
                607
            ],
            [
                607,
                810
            ],
            [
                810,
                852
            ],
            [
                852,
                954
            ],
            [
                954,
                1095
            ],
            [
                1095,
                1139
            ],
            [
                1139,
                1245
            ],
            [
                1245,
                1280
            ],
            [
                1280,
                1327
            ],
            [
                1327,
                1387
            ],
            [
                1387,
                1605
            ],
            [
                1605,
                1640
            ],
            [
                1640,
                1891
            ],
            [
                1891,
                2040
            ],
            [
                2040,
                2152
            ],
            [
                2152,
                2178
            ],
            [
                2178,
                2207
            ],
            [
                2207,
                2324
            ],
            [
                2324,
                2395
            ],
            [
                2395,
                2489
            ],
            [
                2489,
                2549
            ],
            [
                2549,
                2565
            ],
            [
                2565,
                2670
            ],
            [
                2670,
                2728
            ],
            [
                2728,
                2848
            ],
            [
                2848,
                2868
            ],
            [
                2868,
                2883
            ],
            [
                2883,
                2912
            ],
            [
                2912,
                2918
            ],
            [
                2918,
                2940
            ],
            [
                2940,
                2983
            ],
            [
                2983,
                3065
            ],
            [
                3065,
                3119
            ],
            [
                3119,
                3155
            ],
            [
                3155,
                3162
            ],
            [
                3162,
                3196
            ],
            [
                3196,
                3290
            ],
            [
                3290,
                3332
            ],
            [
                3332,
                3362
            ],
            [
                3362,
                3413
            ],
            [
                3413,
                3448
            ],
            [
                3448,
                3485
            ],
            [
                3485,
                3567
            ],
            [
                3567,
                3635
            ],
            [
                3635,
                3818
            ],
            [
                3818,
                3852
            ],
            [
                3852,
                3888
            ],
            [
                3888,
                3965
            ],
            [
                3965,
                4037
            ],
            [
                4037,
                4073
            ],
            [
                4073,
                4110
            ],
            [
                4110,
                4121
            ],
            [
                4121,
                4223
            ],
            [
                4223,
                4241
            ],
            [
                4241,
                4258
            ],
            [
                4258,
                4424
            ],
            [
                4424,
                4470
            ],
            [
                4470,
                4561
            ],
            [
                4561,
                4660
            ],
            [
                4660,
                4692
            ],
            [
                4692,
                4751
            ],
            [
                4751,
                4800
            ],
            [
                4800,
                4838
            ],
            [
                4838,
                4896
            ],
            [
                4896,
                5057
            ],
            [
                5057,
                5185
            ],
            [
                5185,
                5266
            ],
            [
                5266,
                5337
            ],
            [
                5337,
                5621
            ],
            [
                5621,
                5793
            ],
            [
                5793,
                5845
            ],
            [
                5845,
                5910
            ],
            [
                5910,
                5956
            ],
            [
                5956,
                5978
            ],
            [
                5978,
                6108
            ],
            [
                6108,
                6177
            ],
            [
                6177,
                6216
            ],
            [
                6216,
                6235
            ],
            [
                6235,
                6385
            ],
            [
                6385,
                6509
            ],
            [
                6509,
                6563
            ],
            [
                6563,
                6624
            ],
            [
                6624,
                6709
            ],
            [
                6709,
                6815
            ],
            [
                6815,
                6977
            ],
            [
                6977,
                7020
            ],
            [
                7020,
                7263
            ],
            [
                7263,
                7309
            ],
            [
                7309,
                7336
            ],
            [
                7336,
                7377
            ],
            [
                7377,
                7440
            ],
            [
                7440,
                7490
            ],
            [
                7490,
                7701
            ],
            [
                7701,
                7858
            ],
            [
                7858,
                7882
            ],
            [
                7882,
                7911
            ],
            [
                7911,
                7952
            ],
            [
                7952,
                8013
            ],
            [
                8013,
                8061
            ],
            [
                8061,
                8143
            ],
            [
                8143,
                8244
            ],
            [
                8244,
                8380
            ],
            [
                8380,
                8419
            ],
            [
                8419,
                8443
            ],
            [
                8443,
                8466
            ],
            [
                8466,
                8586
            ],
            [
                8586,
                8654
            ],
            [
                8654,
                8719
            ],
            [
                8719,
                8741
            ],
            [
                8741,
                8766
            ],
            [
                8766,
                8788
            ],
            [
                8788,
                8809
            ],
            [
                8809,
                8874
            ],
            [
                8874,
                8998
            ],
            [
                8998,
                9063
            ],
            [
                9063,
                9133
            ],
            [
                9133,
                9284
            ],
            [
                9284,
                9478
            ],
            [
                9478,
                9565
            ],
            [
                9565,
                9571
            ],
            [
                9571,
                9583
            ],
            [
                9583,
                9698
            ],
            [
                9698,
                9792
            ],
            [
                9792,
                9805
            ],
            [
                9805,
                10023
            ],
            [
                10023,
                10082
            ],
            [
                10082,
                10120
            ],
            [
                10120,
                10242
            ],
            [
                10242,
                10342
            ],
            [
                10342,
                10347
            ],
            [
                10347,
                10358
            ],
            [
                10358,
                10385
            ],
            [
                10385,
                10404
            ],
            [
                10404,
                10536
            ],
            [
                10536,
                10624
            ],
            [
                10624,
                10630
            ],
            [
                10630,
                10694
            ],
            [
                10694,
                10757
            ],
            [
                10757,
                10794
            ],
            [
                10794,
                10899
            ],
            [
                10899,
                10985
            ],
            [
                10985,
                11034
            ],
            [
                11034,
                11041
            ],
            [
                11041,
                11110
            ],
            [
                11110,
                11174
            ],
            [
                11174,
                11340
            ],
            [
                11340,
                11403
            ],
            [
                11403,
                11460
            ],
            [
                11460,
                11549
            ],
            [
                11549,
                11669
            ],
            [
                11669,
                11706
            ],
            [
                11706,
                11743
            ],
            [
                11743,
                11780
            ],
            [
                11780,
                11855
            ],
            [
                11855,
                11870
            ],
            [
                11870,
                11889
            ],
            [
                11889,
                11932
            ],
            [
                11932,
                11990
            ],
            [
                11990,
                12109
            ],
            [
                12109,
                12132
            ],
            [
                12132,
                12187
            ],
            [
                12187,
                12239
            ],
            [
                12239,
                12258
            ],
            [
                12258,
                12349
            ],
            [
                12349,
                12363
            ],
            [
                12363,
                12392
            ],
            [
                12392,
                12407
            ],
            [
                12407,
                12419
            ]
        ],
        "overlap_chars": [
            [
                4,
                10
            ],
            [
                11,
                25
            ],
            [
                26,
                27
            ],
            [
                28,
                36
            ],
            [
                37,
                44
            ],
            [
                45,
                47
            ],
            [
                48,
                56
            ],
            [
                56,
                68
            ],
            [
                69,
                99
            ],
            [
                100,
                159
            ],
            [
                165,
                190
            ],
            [
                190,
                276
            ],
            [
                277,
                280
            ],
            [
                281,
                301
            ],
            [
                301,
                303
            ],
            [
                303,
                312
            ],
            [
                313,
                317
            ],
            [
                324,
                332
            ],
            [
                332,
                367
            ],
            [
                389,
                393
            ],
            [
                394,
                404
            ],
            [
                405,
                408
            ],
            [
                417,
                436
            ],
            [
                437,
                496
            ],
            [
                497,
                519
            ],
            [
                520,
                526
            ],
            [
                527,
                540
            ],
            [
                544,
                588
            ],
            [
                592,
                605
            ],
            [
                605,
                606
            ],
            [
                608,
                621
            ],
            [
                629,
                718
            ],
            [
                719,
                735
            ],
            [
                736,
                762
            ],
            [
                765,
                810
            ],
            [
                810,
                852
            ],
            [
                852,
                899
            ],
            [
                900,
                952
            ],
            [
                952,
                954
            ],
            [
                954,
                1042
            ],
            [
                1046,
                1067
            ],
            [
                1072,
                1095
            ],
            [
                1095,
                1139
            ],
            [
                1139,
                1199
            ],
            [
                1200,
                1208
            ],
            [
                1210,
                1244
            ],
            [
                1250,
                1280
            ],
            [
                1280,
                1327
            ],
            [
                1327,
                1360
            ],
            [
                1365,
                1385
            ],
            [
                1385,
                1387
            ],
            [
                1387,
                1428
            ],
            [
                1433,
                1494
            ],
            [
                1500,
                1503
            ],
            [
                1504,
                1605
            ],
            [
                1605,
                1637
            ],
            [
                1637,
                1640
            ],
            [
                1640,
                1891
            ],
            [
                1891,
                1918
            ],
            [
                1924,
                1925
            ],
            [
                1926,
                2039
            ],
            [
                2041,
                2074
            ],
            [
                2078,
                2150
            ],
            [
                2150,
                2152
            ],
            [
                2152,
                2178
            ],
            [
                2178,
                2207
            ],
            [
                2207,
                2209
            ],
            [
                2210,
                2324
            ],
            [
                2324,
                2359
            ],
            [
                2360,
                2393
            ],
            [
                2393,
                2394
            ],
            [
                2395,
                2417
            ],
            [
                2418,
                2489
            ],
            [
                2489,
                2504
            ],
            [
                2506,
                2549
            ],
            [
                2549,
                2552
            ],
            [
                2553,
                2562
            ],
            [
                2565,
                2621
            ],
            [
                2623,
                2667
            ],
            [
                2670,
                2726
            ],
            [
                2726,
                2728
            ],
            [
                2728,
                2785
            ],
            [
                2786,
                2790
            ],
            [
                2791,
                2824
            ],
            [
                2824,
                2825
            ],
            [
                2826,
                2848
            ],
            [
                2852,
                2865
            ],
            [
                2884,
                2905
            ],
            [
                2906,
                2909
            ],
            [
                2913,
                2915
            ],
            [
                2918,
                2940
            ],
            [
                2941,
                2963
            ],
            [
                2973,
                2980
            ],
            [
                2984,
                3065
            ],
            [
                3065,
                3090
            ],
            [
                3091,
                3116
            ],
            [
                3120,
                3152
            ],
            [
                3156,
                3160
            ],
            [
                3162,
                3196
            ],
            [
                3196,
                3231
            ],
            [
                3236,
                3287
            ],
            [
                3291,
                3318
            ],
            [
                3321,
                3330
            ],
            [
                3330,
                3332
            ],
            [
                3332,
                3359
            ],
            [
                3362,
                3386
            ],
            [
                3395,
                3413
            ],
            [
                3413,
                3446
            ],
            [
                3446,
                3448
            ],
            [
                3448,
                3485
            ],
            [
                3495,
                3516
            ],
            [
                3517,
                3531
            ],
            [
                3532,
                3537
            ],
            [
                3549,
                3557
            ],
            [
                3558,
                3567
            ],
            [
                3567,
                3579
            ],
            [
                3579,
                3580
            ],
            [
                3596,
                3597
            ],
            [
                3598,
                3633
            ],
            [
                3633,
                3635
            ],
            [
                3635,
                3651
            ],
            [
                3653,
                3656
            ],
            [
                3657,
                3660
            ],
            [
                3660,
                3699
            ],
            [
                3707,
                3708
            ],
            [
                3709,
                3774
            ],
            [
                3775,
                3788
            ],
            [
                3798,
                3811
            ],
            [
                3816,
                3817
            ],
            [
                3825,
                3852
            ],
            [
                3852,
                3865
            ],
            [
                3866,
                3874
            ],
            [
                3875,
                3888
            ],
            [
                3888,
                3896
            ],
            [
                3902,
                3965
            ],
            [
                3965,
                3969
            ],
            [
                3972,
                4037
            ],
            [
                4037,
                4070
            ],
            [
                4073,
                4080
            ],
            [
                4085,
                4097
            ],
            [
                4097,
                4110
            ],
            [
                4112,
                4120
            ],
            [
                4121,
                4223
            ],
            [
                4224,
                4241
            ],
            [
                4246,
                4255
            ],
            [
                4258,
                4324
            ],
            [
                4334,
                4342
            ],
            [
                4343,
                4392
            ],
            [
                4393,
                4394
            ],
            [
                4395,
                4401
            ],
            [
                4409,
                4424
            ],
            [
                4424,
                4427
            ],
            [
                4428,
                4442
            ],
            [
                4443,
                4446
            ],
            [
                4447,
                4450
            ],
            [
                4468,
                4470
            ],
            [
                4470,
                4527
            ],
            [
                4528,
                4560
            ],
            [
                4568,
                4612
            ],
            [
                4622,
                4638
            ],
            [
                4639,
                4648
            ],
            [
                4661,
                4668
            ],
            [
                4670,
                4681
            ],
            [
                4690,
                4692
            ],
            [
                4692,
                4749
            ],
            [
                4749,
                4751
            ],
            [
                4751,
                4762
            ],
            [
                4767,
                4800
            ],
            [
                4800,
                4835
            ],
            [
                4838,
                4850
            ],
            [
                4851,
                4854
            ],
            [
                4855,
                4863
            ],
            [
                4864,
                4868
            ],
            [
                4870,
                4874
            ],
            [
                4875,
                4885
            ],
            [
                4890,
                4896
            ],
            [
                4896,
                4996
            ],
            [
                4997,
                5057
            ],
            [
                5057,
                5095
            ],
            [
                5096,
                5098
            ],
            [
                5099,
                5102
            ],
            [
                5110,
                5116
            ],
            [
                5117,
                5133
            ],
            [
                5135,
                5140
            ],
            [
                5141,
                5144
            ],
            [
                5155,
                5163
            ],
            [
                5174,
                5183
            ],
            [
                5183,
                5185
            ],
            [
                5185,
                5251
            ],
            [
                5257,
                5266
            ],
            [
                5266,
                5337
            ],
            [
                5337,
                5442
            ],
            [
                5447,
                5455
            ],
            [
                5456,
                5459
            ],
            [
                5460,
                5492
            ],
            [
                5493,
                5599
            ],
            [
                5600,
                5603
            ],
            [
                5604,
                5607
            ],
            [
                5617,
                5619
            ],
            [
                5619,
                5621
            ],
            [
                5621,
                5635
            ],
            [
                5673,
                5678
            ],
            [
                5678,
                5707
            ],
            [
                5713,
                5778
            ],
            [
                5784,
                5793
            ],
            [
                5793,
                5838
            ],
            [
                5839,
                5845
            ],
            [
                5846,
                5907
            ],
            [
                5910,
                5956
            ],
            [
                5956,
                5978
            ],
            [
                5978,
                6008
            ],
            [
                6009,
                6016
            ],
            [
                6017,
                6044
            ],
            [
                6045,
                6055
            ],
            [
                6057,
                6069
            ],
            [
                6073,
                6105
            ],
            [
                6114,
                6132
            ],
            [
                6135,
                6175
            ],
            [
                6175,
                6176
            ],
            [
                6178,
                6200
            ],
            [
                6203,
                6214
            ],
            [
                6214,
                6216
            ],
            [
                6217,
                6232
            ],
            [
                6235,
                6256
            ],
            [
                6257,
                6268
            ],
            [
                6277,
                6301
            ],
            [
                6302,
                6366
            ],
            [
                6367,
                6385
            ],
            [
                6385,
                6408
            ],
            [
                6414,
                6418
            ],
            [
                6419,
                6434
            ],
            [
                6451,
                6509
            ],
            [
                6509,
                6534
            ],
            [
                6535,
                6547
            ],
            [
                6549,
                6563
            ],
            [
                6563,
                6624
            ],
            [
                6624,
                6707
            ],
            [
                6707,
                6709
            ],
            [
                6709,
                6734
            ],
            [
                6734,
                6815
            ],
            [
                6815,
                6968
            ],
            [
                6969,
                6977
            ],
            [
                6978,
                7020
            ],
            [
                7020,
                7047
            ],
            [
                7056,
                7057
            ],
            [
                7062,
                7111
            ],
            [
                7112,
                7113
            ],
            [
                7114,
                7116
            ],
            [
                7127,
                7208
            ],
            [
                7219,
                7260
            ],
            [
                7263,
                7302
            ],
            [
                7307,
                7309
            ],
            [
                7309,
                7336
            ],
            [
                7342,
                7377
            ],
            [
                7377,
                7382
            ],
            [
                7388,
                7438
            ],
            [
                7438,
                7440
            ],
            [
                7440,
                7468
            ],
            [
                7472,
                7487
            ],
            [
                7491,
                7494
            ],
            [
                7497,
                7532
            ],
            [
                7532,
                7533
            ],
            [
                7535,
                7591
            ],
            [
                7594,
                7609
            ],
            [
                7612,
                7690
            ],
            [
                7701,
                7810
            ],
            [
                7811,
                7843
            ],
            [
                7844,
                7858
            ],
            [
                7859,
                7882
            ],
            [
                7882,
                7911
            ],
            [
                7911,
                7933
            ],
            [
                7938,
                7949
            ],
            [
                7953,
                7965
            ],
            [
                7968,
                8013
            ],
            [
                8017,
                8061
            ],
            [
                8061,
                8096
            ],
            [
                8099,
                8141
            ],
            [
                8141,
                8143
            ],
            [
                8144,
                8180
            ],
            [
                8181,
                8186
            ],
            [
                8190,
                8194
            ],
            [
                8195,
                8241
            ],
            [
                8244,
                8265
            ],
            [
                8266,
                8325
            ],
            [
                8332,
                8356
            ],
            [
                8357,
                8378
            ],
            [
                8399,
                8419
            ],
            [
                8419,
                8443
            ],
            [
                8443,
                8463
            ],
            [
                8466,
                8550
            ],
            [
                8567,
                8584
            ],
            [
                8584,
                8586
            ],
            [
                8587,
                8591
            ],
            [
                8594,
                8610
            ],
            [
                8612,
                8654
            ],
            [
                8654,
                8671
            ],
            [
                8672,
                8716
            ],
            [
                8720,
                8738
            ],
            [
                8741,
                8748
            ],
            [
                8750,
                8766
            ],
            [
                8767,
                8770
            ],
            [
                8773,
                8788
            ],
            [
                8789,
                8797
            ],
            [
                8813,
                8855
            ],
            [
                8858,
                8874
            ],
            [
                8874,
                8898
            ],
            [
                8898,
                8903
            ],
            [
                8904,
                8949
            ],
            [
                8949,
                8998
            ],
            [
                8998,
                9062
            ],
            [
                9063,
                9133
            ],
            [
                9133,
                9192
            ],
            [
                9201,
                9206
            ],
            [
                9207,
                9246
            ],
            [
                9254,
                9284
            ],
            [
                9284,
                9292
            ],
            [
                9292,
                9293
            ],
            [
                9294,
                9317
            ],
            [
                9331,
                9348
            ],
            [
                9350,
                9353
            ],
            [
                9354,
                9425
            ],
            [
                9426,
                9431
            ],
            [
                9432,
                9478
            ],
            [
                9478,
                9488
            ],
            [
                9495,
                9564
            ],
            [
                9566,
                9568
            ],
            [
                9579,
                9581
            ],
            [
                9581,
                9583
            ],
            [
                9584,
                9594
            ],
            [
                9597,
                9633
            ],
            [
                9636,
                9696
            ],
            [
                9696,
                9698
            ],
            [
                9698,
                9792
            ],
            [
                9792,
                9802
            ],
            [
                9805,
                9906
            ],
            [
                9911,
                10005
            ],
            [
                10006,
                10023
            ],
            [
                10023,
                10082
            ],
            [
                10082,
                10120
            ],
            [
                10120,
                10207
            ],
            [
                10209,
                10224
            ],
            [
                10227,
                10242
            ],
            [
                10242,
                10298
            ],
            [
                10299,
                10301
            ],
            [
                10315,
                10316
            ],
            [
                10317,
                10325
            ],
            [
                10326,
                10330
            ],
            [
                10330,
                10331
            ],
            [
                10340,
                10342
            ],
            [
                10343,
                10347
            ],
            [
                10347,
                10358
            ],
            [
                10358,
                10385
            ],
            [
                10385,
                10401
            ],
            [
                10412,
                10495
            ],
            [
                10500,
                10521
            ],
            [
                10522,
                10536
            ],
            [
                10536,
                10552
            ],
            [
                10553,
                10560
            ],
            [
                10572,
                10575
            ],
            [
                10594,
                10603
            ],
            [
                10610,
                10612
            ],
            [
                10622,
                10624
            ],
            [
                10625,
                10627
            ],
            [
                10630,
                10638
            ],
            [
                10640,
                10694
            ],
            [
                10694,
                10757
            ],
            [
                10765,
                10778
            ],
            [
                10779,
                10792
            ],
            [
                10794,
                10807
            ],
            [
                10808,
                10899
            ],
            [
                10899,
                10921
            ],
            [
                10921,
                10982
            ],
            [
                10986,
                11002
            ],
            [
                11005,
                11034
            ],
            [
                11035,
                11041
            ],
            [
                11041,
                11054
            ],
            [
                11054,
                11073
            ],
            [
                11075,
                11107
            ],
            [
                11111,
                11113
            ],
            [
                11116,
                11123
            ],
            [
                11125,
                11174
            ],
            [
                11174,
                11177
            ],
            [
                11178,
                11231
            ],
            [
                11235,
                11252
            ],
            [
                11253,
                11337
            ],
            [
                11340,
                11352
            ],
            [
                11354,
                11401
            ],
            [
                11401,
                11403
            ],
            [
                11403,
                11412
            ],
            [
                11413,
                11460
            ],
            [
                11460,
                11546
            ],
            [
                11552,
                11557
            ],
            [
                11560,
                11567
            ],
            [
                11569,
                11633
            ],
            [
                11637,
                11644
            ],
            [
                11647,
                11666
            ],
            [
                11669,
                11672
            ],
            [
                11674,
                11703
            ],
            [
                11707,
                11725
            ],
            [
                11728,
                11743
            ],
            [
                11744,
                11780
            ],
            [
                11780,
                11855
            ],
            [
                11855,
                11870
            ],
            [
                11870,
                11889
            ],
            [
                11889,
                11932
            ],
            [
                11932,
                11970
            ],
            [
                11971,
                11987
            ],
            [
                11990,
                11991
            ],
            [
                11991,
                12061
            ],
            [
                12067,
                12071
            ],
            [
                12073,
                12076
            ],
            [
                12081,
                12109
            ],
            [
                12109,
                12130
            ],
            [
                12132,
                12145
            ],
            [
                12146,
                12153
            ],
            [
                12164,
                12184
            ],
            [
                12188,
                12210
            ],
            [
                12213,
                12239
            ],
            [
                12245,
                12258
            ],
            [
                12258,
                12278
            ],
            [
                12281,
                12286
            ],
            [
                12289,
                12307
            ],
            [
                12309,
                12346
            ],
            [
                12350,
                12363
            ],
            [
                12363,
                12392
            ],
            [
                12392,
                12405
            ],
            [
                12409,
                12417
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                56
            ],
            [
                56,
                190
            ],
            [
                190,
                303
            ],
            [
                303,
                520
            ],
            [
                520,
                588
            ],
            [
                588,
                810
            ],
            [
                810,
                852
            ],
            [
                852,
                954
            ],
            [
                954,
                954
            ],
            [
                954,
                1095
            ],
            [
                1095,
                1139
            ],
            [
                1139,
                1245
            ],
            [
                1245,
                1280
            ],
            [
                1280,
                1327
            ],
            [
                1327,
                1387
            ],
            [
                1387,
                1605
            ],
            [
                1605,
                1640
            ],
            [
                1640,
                1891
            ],
            [
                1891,
                2040
            ],
            [
                2040,
                2152
            ],
            [
                2152,
                2178
            ],
            [
                2178,
                2207
            ],
            [
                2207,
                2324
            ],
            [
                2324,
                2395
            ],
            [
                2395,
                2489
            ],
            [
                2489,
                2549
            ],
            [
                2549,
                2565
            ],
            [
                2565,
                2670
            ],
            [
                2670,
                2728
            ],
            [
                2728,
                2848
            ],
            [
                2848,
                2883
            ],
            [
                2883,
                2912
            ],
            [
                2912,
                2918
            ],
            [
                2918,
                2940
            ],
            [
                2940,
                2983
            ],
            [
                2983,
                3065
            ],
            [
                3065,
                3119
            ],
            [
                3119,
                3119
            ],
            [
                3119,
                3155
            ],
            [
                3155,
                3196
            ],
            [
                3196,
                3290
            ],
            [
                3290,
                3332
            ],
            [
                3332,
                3413
            ],
            [
                3413,
                3448
            ],
            [
                3448,
                3485
            ],
            [
                3485,
                3567
            ],
            [
                3567,
                3635
            ],
            [
                3635,
                3818
            ],
            [
                3818,
                3818
            ],
            [
                3818,
                3852
            ],
            [
                3852,
                3888
            ],
            [
                3888,
                3965
            ],
            [
                3965,
                4037
            ],
            [
                4037,
                4073
            ],
            [
                4073,
                4110
            ],
            [
                4110,
                4223
            ],
            [
                4223,
                4241
            ],
            [
                4241,
                4258
            ],
            [
                4258,
                4424
            ],
            [
                4424,
                4470
            ],
            [
                4470,
                4561
            ],
            [
                4561,
                4561
            ],
            [
                4561,
                4561
            ],
            [
                4561,
                4660
            ],
            [
                4660,
                4692
            ],
            [
                4692,
                4751
            ],
            [
                4751,
                4800
            ],
            [
                4800,
                4838
            ],
            [
                4838,
                4896
            ],
            [
                4896,
                5057
            ],
            [
                5057,
                5185
            ],
            [
                5185,
                5185
            ],
            [
                5185,
                5266
            ],
            [
                5266,
                5337
            ],
            [
                5337,
                5621
            ],
            [
                5621,
                5793
            ],
            [
                5793,
                5845
            ],
            [
                5845,
                5910
            ],
            [
                5910,
                5956
            ],
            [
                5956,
                5978
            ],
            [
                5978,
                6108
            ],
            [
                6108,
                6177
            ],
            [
                6177,
                6216
            ],
            [
                6216,
                6235
            ],
            [
                6235,
                6385
            ],
            [
                6385,
                6509
            ],
            [
                6509,
                6563
            ],
            [
                6563,
                6563
            ],
            [
                6563,
                6563
            ],
            [
                6563,
                6624
            ],
            [
                6624,
                6709
            ],
            [
                6709,
                6815
            ],
            [
                6815,
                6977
            ],
            [
                6977,
                7020
            ],
            [
                7020,
                7263
            ],
            [
                7263,
                7309
            ],
            [
                7309,
                7309
            ],
            [
                7309,
                7309
            ],
            [
                7309,
                7336
            ],
            [
                7336,
                7377
            ],
            [
                7377,
                7440
            ],
            [
                7440,
                7490
            ],
            [
                7490,
                7490
            ],
            [
                7490,
                7701
            ],
            [
                7701,
                7858
            ],
            [
                7858,
                7882
            ],
            [
                7882,
                7911
            ],
            [
                7911,
                7952
            ],
            [
                7952,
                7952
            ],
            [
                7952,
                7952
            ],
            [
                7952,
                7952
            ],
            [
                7952,
                8013
            ],
            [
                8013,
                8061
            ],
            [
                8061,
                8143
            ],
            [
                8143,
                8244
            ],
            [
                8244,
                8380
            ],
            [
                8380,
                8419
            ],
            [
                8419,
                8443
            ],
            [
                8443,
                8466
            ],
            [
                8466,
                8586
            ],
            [
                8586,
                8654
            ],
            [
                8654,
                8719
            ],
            [
                8719,
                8741
            ],
            [
                8741,
                8766
            ],
            [
                8766,
                8788
            ],
            [
                8788,
                8809
            ],
            [
                8809,
                8874
            ],
            [
                8874,
                8998
            ],
            [
                8998,
                9063
            ],
            [
                9063,
                9133
            ],
            [
                9133,
                9284
            ],
            [
                9284,
                9478
            ],
            [
                9478,
                9565
            ],
            [
                9565,
                9571
            ],
            [
                9571,
                9583
            ],
            [
                9583,
                9698
            ],
            [
                9698,
                9698
            ],
            [
                9698,
                9698
            ],
            [
                9698,
                9792
            ],
            [
                9792,
                9805
            ],
            [
                9805,
                10023
            ],
            [
                10023,
                10082
            ],
            [
                10082,
                10120
            ],
            [
                10120,
                10242
            ],
            [
                10242,
                10242
            ],
            [
                10242,
                10342
            ],
            [
                10342,
                10347
            ],
            [
                10347,
                10358
            ],
            [
                10358,
                10358
            ],
            [
                10358,
                10385
            ],
            [
                10385,
                10404
            ],
            [
                10404,
                10536
            ],
            [
                10536,
                10624
            ],
            [
                10624,
                10630
            ],
            [
                10630,
                10694
            ],
            [
                10694,
                10757
            ],
            [
                10757,
                10757
            ],
            [
                10757,
                10757
            ],
            [
                10757,
                10757
            ],
            [
                10757,
                10757
            ],
            [
                10757,
                10794
            ],
            [
                10794,
                10899
            ],
            [
                10899,
                10985
            ],
            [
                10985,
                11034
            ],
            [
                11034,
                11041
            ],
            [
                11041,
                11110
            ],
            [
                11110,
                11174
            ],
            [
                11174,
                11340
            ],
            [
                11340,
                11403
            ],
            [
                11403,
                11460
            ],
            [
                11460,
                11549
            ],
            [
                11549,
                11669
            ],
            [
                11669,
                11669
            ],
            [
                11669,
                11706
            ],
            [
                11706,
                11706
            ],
            [
                11706,
                11743
            ],
            [
                11743,
                11743
            ],
            [
                11743,
                11780
            ],
            [
                11780,
                11855
            ],
            [
                11855,
                11855
            ],
            [
                11855,
                11870
            ],
            [
                11870,
                11889
            ],
            [
                11889,
                11889
            ],
            [
                11889,
                11932
            ],
            [
                11932,
                11990
            ],
            [
                11990,
                11990
            ],
            [
                11990,
                12109
            ],
            [
                12109,
                12132
            ],
            [
                12132,
                12187
            ],
            [
                12187,
                12187
            ],
            [
                12187,
                12239
            ],
            [
                12239,
                12258
            ],
            [
                12258,
                12258
            ],
            [
                12258,
                12349
            ],
            [
                12349,
                12363
            ],
            [
                12363,
                12392
            ],
            [
                12392,
                12419
            ]
        ]
    }
}