{
    "original": {
        "text": "\"And down the sunny beach she paces slowly, With many doubtful pauses by the way; Grief hath an influence so hushed and holy.\" HOOD.\n\"Is not Margaret the heiress?\" whispered Edith to her husband, as they were in their room alone at night after the sad journey to Oxford. She had pulled his tall head down, and stood upon tiptoe, and implored him not to be shocked, before she ventured to ask this question. Captain Lennox was, however, quite in the dark; if he had ever heard, he had forgotten; it could not be much that a Fellow of a small College had to leave; but he had never wanted her to pay for her board; and two hundred and fifty pounds a year was something ridiculous, considering that she did not take wine. Edith came down upon her feet a little bit sadder; with a romance blown to pieces.\nA week afterwards, she came prancing towards her husband, and made him a low curtsey:\n\"I am right, and you are wrong, most noble Captain. Margaret has had a lawyer's letter, and she is residuary legatee--the legacies being about two thousand pounds, and the remainder about forty thousand, at the present value of property in Milton.\"\n\"Indeed! and how does she take her good fortune?\"\n\"Oh, it seems she knew she was to have it all along; only she had no idea it was so much. She looks very white and pale, and says she's afraid of it; but that's nonsense, you know, and will soon go off. I left mamma pouring congratulations down her throat, and stole away to tell you.\"\nIt seemed to be supposed, by general consent, that the most natural thing was to consider Mr. Lennox henceforward as Margaret's legal adviser. She was so entirely ignorant of all forms of business that in nearly everything she had to refer to him. He chose out her attorney; he came to her with papers to be signed. He was never so happy as when teaching her of what all these mysteries of the law were the signs and types.\n\"Henry,\" said Edith, one day, archly; \"do you know what I hope and expect all these long conversations with Margaret will end in?\"\n\"No, I don't,\" said he, reddening. \"And I desire you not to tell me.\"\n\"Oh, very well; then I need not tell Sholto not to ask Mr. Montagu so often to the house.\"\n\"Just as you choose,\" said he with forced coolness. \"What you are thinking of may or may not happen; but this time, before I commit myself, I will see my ground clear. Ask whom you choose. It may not be very civil, Edith, but if you meddle in it you will mar it. She has been very farouche with me for a long time; and is only just beginning to thaw a little from her Zenobia ways. She has the making of a Cleopatra in her, if only she were a little more pagan.\"\n\"For my part,\" said Edith, a little maliciously, \"I am very glad she is a Christian. I know so very few!\"\nThere was no Spain for Margaret that autumn; although to the last she hoped that some fortunate occasion would call Frederick to Paris, whither she could easily have met with a convoy. Instead of Cadiz, she had to content herself with Cromer. To that place her aunt Shaw and the Lennoxes were bound. They had all along wished her to accompany them, and, consequently, with their characters, they made but lazy efforts to forward her own separate wish. Perhaps Cromer was, in one sense of the expression, the best for her. She needed bodily strengthening and bracing as well as rest.\nAmong other hopes that had vanished, was the hope, the trust she had had, that Mr. Bell would have given Mr. Thornton the simple facts of the family circumstances which had preceded the unfortunate accident that led to Leonards' death. Whatever opinion--however changed it might be from what Mr. Thornton had once entertained, she had wished it to be based upon a true understanding of what she had done, and why she had done it. It would have been a pleasure to her: would have given her rest on a point on which she should now all her life be restless, unless she could resolve not to think upon it. It was now so long after the time of these occurrences, that there was no possible way of explaining them save the one which she had lost by Mr. Bell's death. She might just submit, like many another, to be misunderstood; but, though reasoning herself into the belief that in this hers was no uncommon lot, her heart did not ache the less with longing that some time--years and years hence--before he died at any rate, he might know how much she had been tempted. She thought that she did not want to hear that all was explained to him, if only she could be sure that he would know. But this wish was vain, like so many others; and when she had schooled herself into this conviction, she turned with all her heart and strength to the life that lay immediately before her, and resolved to strive and make the best of that.\nShe used to sit long hours upon the beach, gazing intently on the waves as they chafed with perpetual motion against the pebbly shore,--or she looked out upon the more distant heave, and sparkle against the sky, and heard, without being conscious of hearing, the eternal psalm, which went up continually. She was soothed without knowing how or why. Listlessly she sat there, on the ground, her hands clasped round her knees, while her aunt Shaw did small shoppings, and Edith and Captain Lennox rode far and wide on shore and inland. The nurses, sauntering on with their charges, would pass and repass her, and wonder in whispers what she could find to look at so long, day after day. And when the family gathered at dinner-time, Margaret was so silent and absorbed that Edith voted her moped, and hailed a proposal of her husband's with great satisfaction, that Mr. Henry Lennox should be asked to take Cromer for a week, on his return from Scotland in October.\nBut all this time for thought enabled Margaret to put events in their right places, as to origin and significance, both as regarded her past life and her future. Those hours by the seaside were not lost, as any one might have seen who had had the perception to read, or the care to understand, the look that Margaret's face was gradually acquiring. Mr. Henry Lennox was excessively struck by the change.\n\"The sea has done Miss Hale an immense deal of good, I should fancy,\" said he, when she first left the room after his arrival in their family circle. \"She looks ten years younger than she did in Harley Street.\"\n\"That's the bonnet I got her!\" said Edith, triumphantly. \"I knew it would suit her the moment I saw it.\"\n\"I beg your pardon,\" said Mr. Lennox, in the half-contemptuous, half-indulgent tone he generally used to Edith. \"But I believe I know the difference between the charms of a dress and the charms of a woman. No mere bonnet would have made Miss Hale's eyes so lustrous and yet so soft, or her lips so ripe and red--and her face altogether so full of peace and light.--She is like, and yet more,\"--he dropped his voice,--\"like the Margaret Hale of Helstone.\"\nFrom this time the clever and ambitious man bent all his powers to gaining Margaret. He loved her sweet beauty. He saw the latent sweep of her mind, which could easily (he thought) be led to embrace all the objects on which he had set his heart. He looked upon her fortune only as a part of the complete and superb character of herself and her position; yet he was fully aware of the rise which it would immediately enable him, the poor barrister, to take. Eventually he would earn such success, and such honours, as would enable him to pay her back, with interest, that first advance in wealth which he should owe to her. He had been to Milton on business connected with her property, on his return from Scotland; and with the quick eye of a skilled lawyer, ready ever to take in and weigh contingencies, he had seen that much additional value was yearly accruing to the lands and tenements which she owned in that prosperous and increasing town. He was glad to find that the present relationship between Margaret and himself, of client and legal adviser, was gradually superseding the recollection of that unlucky, mismanaged day at Helstone. He had thus unusual opportunities of intimate intercourse with her, besides those that arose from the connection between the families.\nMargaret was only too willing to listen as long as he talked of Milton, though he had seen none of the people whom she more especially knew. It had been the tone with her aunt and cousin to speak of Milton with dislike and contempt; just such feelings as Margaret was ashamed to remember she had expressed and felt on first going to live there. But Mr. Lennox almost exceeded Margaret in his appreciation of the character of Milton and its inhabitants. Their energy, their power, their indomitable courage in struggling and fighting; their lurid vividness of existence, captivated and arrested his attention. He was never tired of talking about them; and had never perceived how selfish and material were too many of the ends they proposed to themselves as the result of all their mighty, untiring endeavour, till Margaret, even in the midst of her gratification, had the candour to point this out, as the tainting sin in so much that was noble and to be admired. Still, when other subjects palled upon her, and she gave but short answers to many questions, Henry Lennox found out that an enquiry as to some Darkshire peculiarity of character called back the light into her eye, the glow into her cheek.\nWhen they returned to town, Margaret fulfilled one of her sea-side resolves, and took her life into her own hands. Before they went to Cromer, she had been as docile to her aunt's laws as if she were still the scared little stranger who cried herself to sleep that first night in the Harley Street nursery. But she had learnt, in those solemn hours of thought, that she herself must one day answer for her own life, and what she had done with it; and she tried to settle that most difficult problem for woman, how much was to be utterly merged in obedience to authority, and how much might be set apart for freedom in working. Mrs. Shaw was as good-tempered as could be; and Edith had inherited this charming domestic quality; Margaret herself had probably the worst temper of the three, for her quick perceptions and over-lively imagination made her hasty, and her early isolation from sympathy had made her proud: but she had an indescribable childlike sweetness of heart, which made her manners, even in her rarely wilful moods, irresistible of old; and now, chastened even by what the world called her good fortune, she charmed her reluctant aunt into acquiescence with her will. So Margaret gained the acknowledgment of her right to follow her own ideas of duty.\n\"Only don't be strong-minded,\" pleaded Edith. \"Mamma wants you to have a footman of your own; and I'm sure you're very welcome, for they're great plagues. Only to please me, darling, don't go and have a strong mind; it's the only thing I ask. Footman or no footman, don't be strong-minded.\"\n\"Don't be afraid, Edith. I'll faint on your hands at the servants' dinner-time, the very first opportunity; and then, what with Sholto playing with the fire, and the baby crying, you'll begin to wish for a strong-minded woman, equal to any emergency.\"\n\"And you'll not grow too good to joke and be merry?\"\n\"Not I. I shall be merrier than I have ever been, now I have got my own way.\"\n\"And you'll not go a figure, but let me buy your dresses for you?\"\n\"Indeed I mean to buy them for myself. You shall come with me if you like; but no one can please me but myself.\"\n\"Oh! I was afraid you'd dress in brown and dust-colour, not to show the dirt you'll pick up in all those places. I'm glad you're going to keep one or two vanities, just by way of specimens of the old Adam.\"\n\"I am going to be just the same, Edith, if you and my aunt could but fancy so. Only as I have neither husband nor child to give me natural duties, I must make myself some, in addition to ordering my gowns.\"\nIn the family conclave, which was made up of Edith, her mother, and her husband, it was decided that perhaps all these plans of hers would only secure her the more for Henry Lennox. They kept her out of the way of other friends who might have been eligible sons or brothers; and it was also agreed that she never seemed to take much pleasure in the society of any one but Henry, out of their own family. The other admirers, attracted by her appearance or the reputation of her fortune, were swept away, by her unconscious smiling disdain, into the paths frequented by other beauties less fastidious, or other heiresses with a larger amount of gold. Henry and she grew slowly into closer intimacy; but neither he nor she were people to brook the slightest notice of their proceedings.",
        "paragraph_chars": [
            [
                0,
                133
            ],
            [
                133,
                802
            ],
            [
                802,
                888
            ],
            [
                888,
                1137
            ],
            [
                1137,
                1187
            ],
            [
                1187,
                1473
            ],
            [
                1473,
                1897
            ],
            [
                1897,
                2028
            ],
            [
                2028,
                2098
            ],
            [
                2098,
                2189
            ],
            [
                2189,
                2652
            ],
            [
                2652,
                2758
            ],
            [
                2758,
                3341
            ],
            [
                3341,
                4765
            ],
            [
                4765,
                5728
            ],
            [
                5728,
                6132
            ],
            [
                6132,
                6343
            ],
            [
                6343,
                6448
            ],
            [
                6448,
                6903
            ],
            [
                6903,
                8183
            ],
            [
                8183,
                9387
            ],
            [
                9387,
                10655
            ],
            [
                10655,
                10946
            ],
            [
                10946,
                11198
            ],
            [
                11198,
                11251
            ],
            [
                11251,
                11329
            ],
            [
                11329,
                11396
            ],
            [
                11396,
                11509
            ],
            [
                11509,
                11716
            ],
            [
                11716,
                11923
            ],
            [
                11923,
                12706
            ]
        ],
        "segment_chars": [
            [
                0,
                127
            ],
            [
                127,
                133
            ],
            [
                133,
                164
            ],
            [
                164,
                271
            ],
            [
                271,
                407
            ],
            [
                407,
                719
            ],
            [
                719,
                802
            ],
            [
                802,
                888
            ],
            [
                888,
                940
            ],
            [
                940,
                1137
            ],
            [
                1137,
                1146
            ],
            [
                1146,
                1187
            ],
            [
                1187,
                1277
            ],
            [
                1277,
                1390
            ],
            [
                1390,
                1473
            ],
            [
                1473,
                1616
            ],
            [
                1616,
                1721
            ],
            [
                1721,
                1789
            ],
            [
                1789,
                1897
            ],
            [
                1897,
                2028
            ],
            [
                2028,
                2063
            ],
            [
                2063,
                2098
            ],
            [
                2098,
                2189
            ],
            [
                2189,
                2241
            ],
            [
                2241,
                2357
            ],
            [
                2357,
                2378
            ],
            [
                2378,
                2452
            ],
            [
                2452,
                2571
            ],
            [
                2571,
                2652
            ],
            [
                2652,
                2737
            ],
            [
                2737,
                2758
            ],
            [
                2758,
                2943
            ],
            [
                2943,
                3001
            ],
            [
                3001,
                3058
            ],
            [
                3058,
                3210
            ],
            [
                3210,
                3280
            ],
            [
                3280,
                3341
            ],
            [
                3341,
                3577
            ],
            [
                3577,
                3771
            ],
            [
                3771,
                3943
            ],
            [
                3943,
                4102
            ],
            [
                4102,
                4407
            ],
            [
                4407,
                4526
            ],
            [
                4526,
                4765
            ],
            [
                4765,
                5070
            ],
            [
                5070,
                5114
            ],
            [
                5114,
                5299
            ],
            [
                5299,
                5450
            ],
            [
                5450,
                5728
            ],
            [
                5728,
                5890
            ],
            [
                5890,
                6077
            ],
            [
                6077,
                6132
            ],
            [
                6132,
                6282
            ],
            [
                6282,
                6343
            ],
            [
                6343,
                6374
            ],
            [
                6374,
                6400
            ],
            [
                6400,
                6448
            ],
            [
                6448,
                6560
            ],
            [
                6560,
                6654
            ],
            [
                6654,
                6903
            ],
            [
                6903,
                6988
            ],
            [
                6988,
                7015
            ],
            [
                7015,
                7149
            ],
            [
                7149,
                7360
            ],
            [
                7360,
                7526
            ],
            [
                7526,
                7851
            ],
            [
                7851,
                8048
            ],
            [
                8048,
                8183
            ],
            [
                8183,
                8324
            ],
            [
                8324,
                8528
            ],
            [
                8528,
                8636
            ],
            [
                8636,
                8792
            ],
            [
                8792,
                9147
            ],
            [
                9147,
                9387
            ],
            [
                9387,
                9502
            ],
            [
                9502,
                9694
            ],
            [
                9694,
                10014
            ],
            [
                10014,
                10571
            ],
            [
                10571,
                10655
            ],
            [
                10655,
                10701
            ],
            [
                10701,
                10810
            ],
            [
                10810,
                10898
            ],
            [
                10898,
                10946
            ],
            [
                10946,
                10971
            ],
            [
                10971,
                11198
            ],
            [
                11198,
                11251
            ],
            [
                11251,
                11329
            ],
            [
                11329,
                11396
            ],
            [
                11396,
                11435
            ],
            [
                11435,
                11509
            ],
            [
                11509,
                11514
            ],
            [
                11514,
                11622
            ],
            [
                11622,
                11716
            ],
            [
                11716,
                11795
            ],
            [
                11795,
                11923
            ],
            [
                11923,
                12105
            ],
            [
                12105,
                12327
            ],
            [
                12327,
                12572
            ],
            [
                12572,
                12706
            ]
        ],
        "overlap_chars": [
            [
                134,
                161
            ],
            [
                164,
                222
            ],
            [
                232,
                237
            ],
            [
                269,
                271
            ],
            [
                407,
                494
            ],
            [
                613,
                616
            ],
            [
                523,
                548
            ],
            [
                498,
                507
            ],
            [
                511,
                515
            ],
            [
                553,
                561
            ],
            [
                717,
                719
            ],
            [
                719,
                724
            ],
            [
                749,
                757
            ],
            [
                762,
                768
            ],
            [
                770,
                774
            ],
            [
                740,
                743
            ],
            [
                777,
                802
            ],
            [
                802,
                888
            ],
            [
                889,
                940
            ],
            [
                940,
                986
            ],
            [
                997,
                1004
            ],
            [
                1006,
                1069
            ],
            [
                1116,
                1134
            ],
            [
                1070,
                1090
            ],
            [
                1138,
                1146
            ],
            [
                1146,
                1184
            ],
            [
                1188,
                1209
            ],
            [
                1229,
                1277
            ],
            [
                1277,
                1366
            ],
            [
                1388,
                1390
            ],
            [
                1390,
                1442
            ],
            [
                1473,
                1523
            ],
            [
                1563,
                1573
            ],
            [
                1590,
                1616
            ],
            [
                1616,
                1626
            ],
            [
                1636,
                1721
            ],
            [
                1721,
                1729
            ],
            [
                1734,
                1746
            ],
            [
                1759,
                1762
            ],
            [
                1768,
                1789
            ],
            [
                1789,
                1834
            ],
            [
                1844,
                1870
            ],
            [
                1895,
                1897
            ],
            [
                1898,
                1903
            ],
            [
                1906,
                1916
            ],
            [
                1918,
                1934
            ],
            [
                1936,
                2025
            ],
            [
                2029,
                2040
            ],
            [
                2043,
                2061
            ],
            [
                2101,
                2102
            ],
            [
                2239,
                2241
            ],
            [
                2242,
                2266
            ],
            [
                2267,
                2357
            ],
            [
                2378,
                2452
            ],
            [
                2452,
                2455
            ],
            [
                2508,
                2547
            ],
            [
                2484,
                2486
            ],
            [
                2569,
                2571
            ],
            [
                2571,
                2629
            ],
            [
                2639,
                2649
            ],
            [
                2758,
                2801
            ],
            [
                2941,
                2943
            ],
            [
                2943,
                2999
            ],
            [
                3015,
                3058
            ],
            [
                3058,
                3062
            ],
            [
                3077,
                3110
            ],
            [
                3154,
                3158
            ],
            [
                3163,
                3178
            ],
            [
                3187,
                3210
            ],
            [
                3210,
                3224
            ],
            [
                3266,
                3270
            ],
            [
                3280,
                3311
            ],
            [
                3339,
                3341
            ],
            [
                3341,
                3390
            ],
            [
                3415,
                3462
            ],
            [
                3470,
                3522
            ],
            [
                3560,
                3569
            ],
            [
                3527,
                3547
            ],
            [
                3570,
                3577
            ],
            [
                3577,
                3593
            ],
            [
                3633,
                3645
            ],
            [
                3666,
                3771
            ],
            [
                3771,
                3773
            ],
            [
                3809,
                3894
            ],
            [
                3941,
                3942
            ],
            [
                3943,
                3961
            ],
            [
                3980,
                4016
            ],
            [
                4026,
                4102
            ],
            [
                4102,
                4105
            ],
            [
                4112,
                4168
            ],
            [
                4250,
                4309
            ],
            [
                4360,
                4375
            ],
            [
                4200,
                4203
            ],
            [
                4405,
                4407
            ],
            [
                4526,
                4548
            ],
            [
                4569,
                4765
            ],
            [
                4765,
                4806
            ],
            [
                4806,
                4851
            ],
            [
                4874,
                4898
            ],
            [
                4901,
                4980
            ],
            [
                5074,
                5105
            ],
            [
                5112,
                5114
            ],
            [
                5125,
                5209
            ],
            [
                5229,
                5277
            ],
            [
                5297,
                5299
            ],
            [
                5454,
                5541
            ],
            [
                5598,
                5602
            ],
            [
                5584,
                5595
            ],
            [
                5623,
                5663
            ],
            [
                5669,
                5686
            ],
            [
                5716,
                5728
            ],
            [
                5728,
                5810
            ],
            [
                5888,
                5890
            ],
            [
                5890,
                5934
            ],
            [
                5943,
                5962
            ],
            [
                5989,
                5993
            ],
            [
                6022,
                6035
            ],
            [
                6047,
                6077
            ],
            [
                6077,
                6132
            ],
            [
                6137,
                6183
            ],
            [
                6202,
                6210
            ],
            [
                6246,
                6280
            ],
            [
                6183,
                6184
            ],
            [
                6240,
                6245
            ],
            [
                6226,
                6239
            ],
            [
                6280,
                6282
            ],
            [
                6287,
                6340
            ],
            [
                6348,
                6371
            ],
            [
                6374,
                6384
            ],
            [
                6386,
                6399
            ],
            [
                6449,
                6466
            ],
            [
                6469,
                6560
            ],
            [
                6654,
                6737
            ],
            [
                6768,
                6772
            ],
            [
                6784,
                6810
            ],
            [
                6813,
                6819
            ],
            [
                6866,
                6900
            ],
            [
                6824,
                6838
            ],
            [
                6903,
                6988
            ],
            [
                6988,
                7015
            ],
            [
                7015,
                7149
            ],
            [
                7149,
                7193
            ],
            [
                7243,
                7246
            ],
            [
                7211,
                7217
            ],
            [
                7257,
                7306
            ],
            [
                7319,
                7360
            ],
            [
                7360,
                7397
            ],
            [
                7417,
                7425
            ],
            [
                7433,
                7436
            ],
            [
                7440,
                7452
            ],
            [
                7454,
                7467
            ],
            [
                7524,
                7525
            ],
            [
                7526,
                7588
            ],
            [
                7618,
                7621
            ],
            [
                7712,
                7774
            ],
            [
                7612,
                7616
            ],
            [
                7684,
                7687
            ],
            [
                7795,
                7833
            ],
            [
                7845,
                7851
            ],
            [
                7851,
                7908
            ],
            [
                7929,
                8018
            ],
            [
                8031,
                8048
            ],
            [
                8111,
                8114
            ],
            [
                8181,
                8183
            ],
            [
                8183,
                8301
            ],
            [
                8318,
                8324
            ],
            [
                8350,
                8369
            ],
            [
                8373,
                8488
            ],
            [
                8498,
                8528
            ],
            [
                8528,
                8590
            ],
            [
                8608,
                8636
            ],
            [
                8636,
                8668
            ],
            [
                8681,
                8702
            ],
            [
                8715,
                8763
            ],
            [
                8790,
                8792
            ],
            [
                8792,
                8794
            ],
            [
                8842,
                8903
            ],
            [
                8811,
                8813
            ],
            [
                8958,
                8970
            ],
            [
                8981,
                9005
            ],
            [
                9047,
                9121
            ],
            [
                9145,
                9147
            ],
            [
                9147,
                9158
            ],
            [
                9195,
                9203
            ],
            [
                9208,
                9221
            ],
            [
                9159,
                9173
            ],
            [
                9239,
                9259
            ],
            [
                9264,
                9268
            ],
            [
                9286,
                9290
            ],
            [
                9272,
                9279
            ],
            [
                9291,
                9300
            ],
            [
                9326,
                9360
            ],
            [
                9385,
                9387
            ],
            [
                9387,
                9408
            ],
            [
                9415,
                9462
            ],
            [
                9500,
                9502
            ],
            [
                9502,
                9694
            ],
            [
                9694,
                9756
            ],
            [
                9765,
                9889
            ],
            [
                9895,
                9905
            ],
            [
                9910,
                9915
            ],
            [
                9944,
                9970
            ],
            [
                9994,
                10001
            ],
            [
                10012,
                10013
            ],
            [
                10014,
                10023
            ],
            [
                10058,
                10067
            ],
            [
                10031,
                10044
            ],
            [
                10112,
                10173
            ],
            [
                10569,
                10570
            ],
            [
                10179,
                10301
            ],
            [
                10303,
                10314
            ],
            [
                10342,
                10360
            ],
            [
                10362,
                10376
            ],
            [
                10419,
                10431
            ],
            [
                10438,
                10458
            ],
            [
                10464,
                10542
            ],
            [
                10394,
                10397
            ],
            [
                10590,
                10593
            ],
            [
                10616,
                10655
            ],
            [
                10656,
                10683
            ],
            [
                10686,
                10701
            ],
            [
                10703,
                10810
            ],
            [
                10810,
                10814
            ],
            [
                10829,
                10843
            ],
            [
                10851,
                10898
            ],
            [
                10898,
                10943
            ],
            [
                10950,
                10971
            ],
            [
                10971,
                11002
            ],
            [
                11035,
                11195
            ],
            [
                11199,
                11248
            ],
            [
                11252,
                11326
            ],
            [
                11330,
                11340
            ],
            [
                11362,
                11393
            ],
            [
                11404,
                11433
            ],
            [
                11435,
                11469
            ],
            [
                11510,
                11514
            ],
            [
                11514,
                11564
            ],
            [
                11565,
                11622
            ],
            [
                11622,
                11671
            ],
            [
                11717,
                11718
            ],
            [
                11722,
                11754
            ],
            [
                11793,
                11795
            ],
            [
                11795,
                11920
            ],
            [
                11923,
                12105
            ],
            [
                12105,
                12142
            ],
            [
                12171,
                12179
            ],
            [
                12196,
                12201
            ],
            [
                12226,
                12282
            ],
            [
                12291,
                12301
            ],
            [
                12309,
                12327
            ],
            [
                12343,
                12345
            ],
            [
                12347,
                12359
            ],
            [
                12378,
                12407
            ],
            [
                12409,
                12476
            ],
            [
                12563,
                12565
            ],
            [
                12491,
                12521
            ],
            [
                12570,
                12572
            ],
            [
                12572,
                12642
            ],
            [
                12664,
                12693
            ],
            [
                12705,
                12706
            ]
        ],
        "row_chars": [
            [
                0,
                127
            ],
            [
                127,
                133
            ],
            [
                133,
                164
            ],
            [
                164,
                271
            ],
            [
                271,
                407
            ],
            [
                407,
                719
            ],
            [
                719,
                802
            ],
            [
                802,
                888
            ],
            [
                888,
                940
            ],
            [
                940,
                1137
            ],
            [
                1137,
                1146
            ],
            [
                1146,
                1187
            ],
            [
                1187,
                1277
            ],
            [
                1277,
                1390
            ],
            [
                1390,
                1473
            ],
            [
                1473,
                1616
            ],
            [
                1616,
                1721
            ],
            [
                1721,
                1789
            ],
            [
                1789,
                1897
            ],
            [
                1897,
                2028
            ],
            [
                2028,
                2241
            ],
            [
                2241,
                2357
            ],
            [
                2357,
                2378
            ],
            [
                2378,
                2452
            ],
            [
                2452,
                2571
            ],
            [
                2571,
                2652
            ],
            [
                2652,
                2737
            ],
            [
                2737,
                2758
            ],
            [
                2758,
                2943
            ],
            [
                2943,
                3058
            ],
            [
                3058,
                3210
            ],
            [
                3210,
                3341
            ],
            [
                3341,
                3577
            ],
            [
                3577,
                3771
            ],
            [
                3771,
                3943
            ],
            [
                3943,
                4102
            ],
            [
                4102,
                4407
            ],
            [
                4407,
                4526
            ],
            [
                4526,
                4765
            ],
            [
                4765,
                5114
            ],
            [
                5114,
                5299
            ],
            [
                5299,
                5450
            ],
            [
                5450,
                5728
            ],
            [
                5728,
                5890
            ],
            [
                5890,
                6077
            ],
            [
                6077,
                6132
            ],
            [
                6132,
                6282
            ],
            [
                6282,
                6343
            ],
            [
                6343,
                6374
            ],
            [
                6374,
                6400
            ],
            [
                6400,
                6448
            ],
            [
                6448,
                6560
            ],
            [
                6560,
                6654
            ],
            [
                6654,
                6903
            ],
            [
                6903,
                6988
            ],
            [
                6988,
                7015
            ],
            [
                7015,
                7149
            ],
            [
                7149,
                7360
            ],
            [
                7360,
                7526
            ],
            [
                7526,
                7851
            ],
            [
                7851,
                8048
            ],
            [
                8048,
                8183
            ],
            [
                8183,
                8324
            ],
            [
                8324,
                8528
            ],
            [
                8528,
                8636
            ],
            [
                8636,
                8792
            ],
            [
                8792,
                9147
            ],
            [
                9147,
                9387
            ],
            [
                9387,
                9502
            ],
            [
                9502,
                9694
            ],
            [
                9694,
                10014
            ],
            [
                10014,
                10655
            ],
            [
                10655,
                10701
            ],
            [
                10701,
                10810
            ],
            [
                10810,
                10898
            ],
            [
                10898,
                10946
            ],
            [
                10946,
                10971
            ],
            [
                10971,
                11198
            ],
            [
                11198,
                11251
            ],
            [
                11251,
                11329
            ],
            [
                11329,
                11396
            ],
            [
                11396,
                11509
            ],
            [
                11509,
                11514
            ],
            [
                11514,
                11622
            ],
            [
                11622,
                11716
            ],
            [
                11716,
                11795
            ],
            [
                11795,
                11923
            ],
            [
                11923,
                12105
            ],
            [
                12105,
                12327
            ],
            [
                12327,
                12572
            ],
            [
                12572,
                12706
            ]
        ]
    },
    "abridged": {
        "text": "'Is not Margaret the heiress?' whispered Edith to her husband, as they were in their room that night. Captain Lennox was, however, quite in the dark; if he had ever heard, he had forgotten; and the Fellow of a small college could not have much to leave. Edith was a little sadder, with her romance blown to pieces.\nA week afterwards, she came prancing towards her husband, and made him a low curtsey:\n'I am right, and you are wrong, most noble Captain. Margaret has had a lawyer's letter, and she is legatee - the legacies being about two thousand pounds, and the remainder property in Milton worth about forty thousand.'\n'Indeed! and how does she take her good fortune?'\n'Oh, it seems she knew all along; only she had no idea it was so much. She looks very white and pale, and says she's afraid of it; but that's nonsense, you know. I left mamma pouring congratulations down her throat.'\nIt seemed to be supposed, by general consent, that Mr. Lennox would naturally be Margaret's legal adviser. She was so ignorant of all forms of business that in nearly everything she had to refer to him. He chose her attorney, and brought her papers to be signed. He was never so happy as when teaching her of these mysteries of the law.\n'Henry,' said Edith one day, archly; 'do you know what I hope and expect all these long conversations with Margaret will end in?'\n'No, I don't,' said he, reddening, but speaking coolly. 'What you are thinking of, may or may not happen; but this time, before I commit myself, I will see my ground clear. It may not be very civil, Edith, but if you meddle in it you will mar it. She is only just beginning to thaw a little towards me. She has the making of a Cleopatra in her, if only she were more pagan.'\nThere was no Spain for Margaret that autumn. Instead of Cadiz, she had to content herself with Cromer, where her aunt Shaw and the Lennoxes were bound. They wished her to accompany them, and made only lazy efforts to consider her own separate wish. Perhaps Cromer would be best: she needed bodily strengthening.\nAmong other hopes that had vanished, was the hope that Mr. Bell would have given Mr. Thornton the facts of the family circumstances which had preceded Leonards' unfortunate accident and death. Whatever opinion Mr. Thornton held of her, she had wished it to be based upon a true understanding of what she had done, and why she had done it. It would have given her rest on a point on which she should now all her life be restless.\nIt was now so long since these occurrences, that there was no way of explaining them save the one which she had lost by Mr. Bell's death. She must just submit, like many another, to be misunderstood; but her heart did not ache the less with longing that some time, he might know the truth. But this wish was vain; and when she had schooled herself into this conviction, she turned with all her heart and strength to the life that lay immediately before her, and resolved to strive and make the best of that.\nShe used to sit long hours upon the beach at Cromer, gazing intently on the waves as they chafed against the pebbly shore - or she looked out upon the more distant heave, and sparkle against the sky, and was soothed without knowing how. She sat there, on the ground, her hands clasped round her knees, while her aunt Shaw went shopping, and Edith and Captain Lennox rode far and wide. When the family gathered at dinner-time, Margaret was so silent and absorbed that Edith agreed with her husband that Mr. Henry Lennox should be asked to visit Cromer for a week in October.\nBut all this time for thought enabled Margaret to put events in their right places. Those hours by the seaside were not lost, as anyone might have seen who could read the look that her face was gradually acquiring. Mr. Henry Lennox was excessively struck by the change.\n'The sea has done Miss Hale an immense deal of good,' said he, on his arrival in their family circle, after Margaret had left the room. 'She looks ten years younger than she did in Harley Street.'\n'That's the bonnet I got her!' said Edith triumphantly.\n'I beg your pardon,' said Mr. Lennox, in the half-contemptuous, half-indulgent tone he generally used to Edith. 'No mere bonnet would have made Miss Hale's eyes so lustrous and yet so soft, or her face so full of peace and light. She is like the Margaret Hale of Helstone, and yet more.'\nFrom this time the clever and ambitious man bent all his powers to gaining Margaret. He loved her sweet beauty. He saw the latent sweep of her mind, which could easily (he thought) be led to embrace all the objects on which he had set his heart. He looked upon her fortune only as a part of her superb self: yet he was fully aware of the rise which it would enable him, the poor barrister, to take. Eventually he would earn such success as would let him pay her back with interest.\nHe had been to Milton on business connected with her property, and had seen that much additional value was yearly accruing to the land and houses which she owned in that prosperous and growing town. He was glad to find that the present relationship between them, of client and legal adviser, was gradually superseding the recollection of that unlucky day at Helstone. It gave him many private opportunites to talk to her.\nMargaret was only too willing to listen as long as he talked of Milton, though he had seen none of the people whom she knew. Her aunt and cousin would speak of Milton with dislike and contempt; just such feelings as Margaret was ashamed to remember she had expressed on first going to live there. But Mr. Lennox almost exceeded Margaret in his appreciation of Milton and its inhabitants. Their energy, their power, their courage in struggling; their lurid vividness of existence, captivated him. He never perceived how selfish and material were too many of the purposes of their mighty endeavour, till Margaret had the candour to point this out, as the tainting sin in so much that was admirable. Still, when she gave short answers on other subjects, Henry Lennox found that some enquiry about Darkshire called back the light into her eye.\nWhen they returned to London Margaret fulfilled one of her sea-side resolves. Before they went to Cromer, she had been as docile to her aunt's laws as if she were still the scared little stranger who cried herself to sleep that first night in the Harley Street nursery. But she had learnt, in those solemn hours of thought, that she must one day answer for her own life, and what she had done with it; and she tried to settle that most difficult problem for women, how much to be obedient to authority, and how much to assert one's freedom.\nMrs. Shaw and Edith were both good-tempered; Margaret herself had probably the worst temper of the three. Her quick perceptions and over-lively imagination made her hasty, and her early isolation from sympathy had made her proud. But she had a sweetness of heart which made her manner irresistible; and now, chastened by what the world called her good fortune, she charmed her reluctant aunt into allowing her the right to follow her own ideas of duty.\n'Only don't be strong-minded,' pleaded Edith. 'Mamma wants you to have a footman of your own; and I'm sure you're very welcome, for they're great plagues. Only darling, don't have a strong mind; it's the only thing I ask. Footman or no footman, don't be strong-minded.'\n'Don't be afraid, Edith. I'll faint on your hands at the first opportunity; and then, what with Sholto playing with the fire, and the baby crying, you'll begin to wish for a strong-minded woman, equal to any emergency.'\n'And you'll not grow too good to joke and be merry?'\n'Not I. I shall be merrier than I have ever been, now I have got my own way.'\n'And you'll let me buy your dresses for you?'\n'I mean to buy them for myself, though you shall come with me if you like.'\n'Oh! I was afraid you'd dress in brown and dust-colour, so as not to show the dirt you'll pick up in all those places. I'm glad you're going to keep one or two vanities.'\n'I'm going to be just the same, Edith. Only as I have neither husband nor child to give me natural duties, I must make myself some, in addition to ordering my gowns.'\nIn the family conclave, which was made up of Edith, her mother, and her husband, it was decided that perhaps all these plans of hers would only secure her the more for Henry Lennox. They kept her out of the way of other eligible men; and she never seemed to take much pleasure in the society of anyone but Henry, outside their own family. Admirers attracted by the reputation of her fortune were swept away, by her unconscious smiling disdain, into the paths of other beauties less fastidious. Henry and she grew slowly into closer intimacy; but neither he nor she would tolerate the slightest notice of their friendship.",
        "paragraph_chars": [
            [
                0,
                315
            ],
            [
                315,
                401
            ],
            [
                401,
                622
            ],
            [
                622,
                672
            ],
            [
                672,
                889
            ],
            [
                889,
                1226
            ],
            [
                1226,
                1356
            ],
            [
                1356,
                1731
            ],
            [
                1731,
                2043
            ],
            [
                2043,
                2472
            ],
            [
                2472,
                2980
            ],
            [
                2980,
                3554
            ],
            [
                3554,
                3824
            ],
            [
                3824,
                4021
            ],
            [
                4021,
                4077
            ],
            [
                4077,
                4365
            ],
            [
                4365,
                4847
            ],
            [
                4847,
                5269
            ],
            [
                5269,
                6109
            ],
            [
                6109,
                6650
            ],
            [
                6650,
                7103
            ],
            [
                7103,
                7373
            ],
            [
                7373,
                7593
            ],
            [
                7593,
                7646
            ],
            [
                7646,
                7724
            ],
            [
                7724,
                7770
            ],
            [
                7770,
                7846
            ],
            [
                7846,
                8017
            ],
            [
                8017,
                8184
            ],
            [
                8184,
                8805
            ]
        ],
        "segment_chars": [
            [
                0,
                31
            ],
            [
                31,
                102
            ],
            [
                102,
                254
            ],
            [
                254,
                315
            ],
            [
                315,
                401
            ],
            [
                401,
                453
            ],
            [
                453,
                622
            ],
            [
                622,
                631
            ],
            [
                631,
                672
            ],
            [
                672,
                743
            ],
            [
                743,
                834
            ],
            [
                834,
                889
            ],
            [
                889,
                996
            ],
            [
                996,
                1092
            ],
            [
                1092,
                1152
            ],
            [
                1152,
                1226
            ],
            [
                1226,
                1356
            ],
            [
                1356,
                1412
            ],
            [
                1412,
                1529
            ],
            [
                1529,
                1603
            ],
            [
                1603,
                1659
            ],
            [
                1659,
                1731
            ],
            [
                1731,
                1776
            ],
            [
                1776,
                1883
            ],
            [
                1883,
                1980
            ],
            [
                1980,
                2043
            ],
            [
                2043,
                2236
            ],
            [
                2236,
                2382
            ],
            [
                2382,
                2472
            ],
            [
                2472,
                2610
            ],
            [
                2610,
                2762
            ],
            [
                2762,
                2980
            ],
            [
                2980,
                3217
            ],
            [
                3217,
                3365
            ],
            [
                3365,
                3554
            ],
            [
                3554,
                3638
            ],
            [
                3638,
                3769
            ],
            [
                3769,
                3824
            ],
            [
                3824,
                3960
            ],
            [
                3960,
                4021
            ],
            [
                4021,
                4052
            ],
            [
                4052,
                4077
            ],
            [
                4077,
                4189
            ],
            [
                4189,
                4307
            ],
            [
                4307,
                4365
            ],
            [
                4365,
                4450
            ],
            [
                4450,
                4477
            ],
            [
                4477,
                4611
            ],
            [
                4611,
                4764
            ],
            [
                4764,
                4847
            ],
            [
                4847,
                5046
            ],
            [
                5046,
                5215
            ],
            [
                5215,
                5269
            ],
            [
                5269,
                5394
            ],
            [
                5394,
                5566
            ],
            [
                5566,
                5657
            ],
            [
                5657,
                5765
            ],
            [
                5765,
                5966
            ],
            [
                5966,
                6109
            ],
            [
                6109,
                6187
            ],
            [
                6187,
                6379
            ],
            [
                6379,
                6650
            ],
            [
                6650,
                6756
            ],
            [
                6756,
                6880
            ],
            [
                6880,
                7103
            ],
            [
                7103,
                7149
            ],
            [
                7149,
                7258
            ],
            [
                7258,
                7325
            ],
            [
                7325,
                7373
            ],
            [
                7373,
                7398
            ],
            [
                7398,
                7593
            ],
            [
                7593,
                7646
            ],
            [
                7646,
                7724
            ],
            [
                7724,
                7770
            ],
            [
                7770,
                7846
            ],
            [
                7846,
                7851
            ],
            [
                7851,
                7965
            ],
            [
                7965,
                8017
            ],
            [
                8017,
                8056
            ],
            [
                8056,
                8184
            ],
            [
                8184,
                8366
            ],
            [
                8366,
                8523
            ],
            [
                8523,
                8678
            ],
            [
                8678,
                8805
            ]
        ],
        "overlap_chars": [
            [
                1,
                28
            ],
            [
                31,
                89
            ],
            [
                95,
                100
            ],
            [
                100,
                102
            ],
            [
                102,
                189
            ],
            [
                190,
                193
            ],
            [
                198,
                223
            ],
            [
                224,
                233
            ],
            [
                239,
                243
            ],
            [
                244,
                252
            ],
            [
                252,
                254
            ],
            [
                254,
                259
            ],
            [
                264,
                272
            ],
            [
                273,
                279
            ],
            [
                281,
                285
            ],
            [
                286,
                289
            ],
            [
                290,
                315
            ],
            [
                315,
                401
            ],
            [
                402,
                453
            ],
            [
                453,
                499
            ],
            [
                500,
                507
            ],
            [
                510,
                573
            ],
            [
                574,
                592
            ],
            [
                599,
                619
            ],
            [
                623,
                631
            ],
            [
                631,
                669
            ],
            [
                673,
                694
            ],
            [
                695,
                743
            ],
            [
                743,
                832
            ],
            [
                832,
                834
            ],
            [
                834,
                886
            ],
            [
                889,
                939
            ],
            [
                940,
                950
            ],
            [
                970,
                996
            ],
            [
                996,
                1006
            ],
            [
                1007,
                1092
            ],
            [
                1092,
                1100
            ],
            [
                1101,
                1113
            ],
            [
                1127,
                1130
            ],
            [
                1131,
                1152
            ],
            [
                1152,
                1197
            ],
            [
                1198,
                1224
            ],
            [
                1224,
                1226
            ],
            [
                1227,
                1232
            ],
            [
                1235,
                1245
            ],
            [
                1246,
                1262
            ],
            [
                1264,
                1353
            ],
            [
                1357,
                1368
            ],
            [
                1371,
                1389
            ],
            [
                1389,
                1390
            ],
            [
                1410,
                1412
            ],
            [
                1413,
                1437
            ],
            [
                1439,
                1529
            ],
            [
                1529,
                1603
            ],
            [
                1603,
                1606
            ],
            [
                1607,
                1646
            ],
            [
                1655,
                1657
            ],
            [
                1657,
                1659
            ],
            [
                1659,
                1717
            ],
            [
                1718,
                1728
            ],
            [
                1731,
                1774
            ],
            [
                1774,
                1776
            ],
            [
                1776,
                1832
            ],
            [
                1840,
                1883
            ],
            [
                1883,
                1887
            ],
            [
                1888,
                1921
            ],
            [
                1922,
                1926
            ],
            [
                1932,
                1947
            ],
            [
                1957,
                1980
            ],
            [
                1980,
                1994
            ],
            [
                2004,
                2008
            ],
            [
                2010,
                2041
            ],
            [
                2041,
                2043
            ],
            [
                2043,
                2092
            ],
            [
                2093,
                2140
            ],
            [
                2141,
                2193
            ],
            [
                2194,
                2203
            ],
            [
                2204,
                2224
            ],
            [
                2229,
                2236
            ],
            [
                2236,
                2252
            ],
            [
                2253,
                2265
            ],
            [
                2277,
                2382
            ],
            [
                2382,
                2384
            ],
            [
                2385,
                2470
            ],
            [
                2470,
                2471
            ],
            [
                2472,
                2490
            ],
            [
                2497,
                2533
            ],
            [
                2534,
                2610
            ],
            [
                2610,
                2613
            ],
            [
                2619,
                2675
            ],
            [
                2676,
                2735
            ],
            [
                2735,
                2750
            ],
            [
                2751,
                2754
            ],
            [
                2760,
                2762
            ],
            [
                2762,
                2784
            ],
            [
                2784,
                2980
            ],
            [
                2980,
                3021
            ],
            [
                3031,
                3076
            ],
            [
                3077,
                3101
            ],
            [
                3104,
                3183
            ],
            [
                3184,
                3215
            ],
            [
                3215,
                3217
            ],
            [
                3217,
                3301
            ],
            [
                3315,
                3363
            ],
            [
                3363,
                3365
            ],
            [
                3365,
                3452
            ],
            [
                3460,
                3464
            ],
            [
                3465,
                3476
            ],
            [
                3477,
                3517
            ],
            [
                3524,
                3541
            ],
            [
                3542,
                3554
            ],
            [
                3554,
                3636
            ],
            [
                3636,
                3638
            ],
            [
                3638,
                3682
            ],
            [
                3690,
                3709
            ],
            [
                3716,
                3720
            ],
            [
                3721,
                3734
            ],
            [
                3739,
                3769
            ],
            [
                3769,
                3824
            ],
            [
                3829,
                3875
            ],
            [
                3878,
                3886
            ],
            [
                3890,
                3924
            ],
            [
                3924,
                3925
            ],
            [
                3926,
                3931
            ],
            [
                3945,
                3958
            ],
            [
                3958,
                3960
            ],
            [
                3965,
                4018
            ],
            [
                4026,
                4049
            ],
            [
                4052,
                4062
            ],
            [
                4063,
                4076
            ],
            [
                4078,
                4095
            ],
            [
                4098,
                4189
            ],
            [
                4190,
                4273
            ],
            [
                4274,
                4278
            ],
            [
                4279,
                4305
            ],
            [
                4307,
                4313
            ],
            [
                4314,
                4348
            ],
            [
                4348,
                4362
            ],
            [
                4365,
                4450
            ],
            [
                4450,
                4477
            ],
            [
                4477,
                4611
            ],
            [
                4611,
                4655
            ],
            [
                4656,
                4659
            ],
            [
                4660,
                4666
            ],
            [
                4673,
                4722
            ],
            [
                4723,
                4764
            ],
            [
                4764,
                4801
            ],
            [
                4802,
                4810
            ],
            [
                4815,
                4818
            ],
            [
                4819,
                4831
            ],
            [
                4832,
                4845
            ],
            [
                4845,
                4846
            ],
            [
                4847,
                4909
            ],
            [
                4910,
                4913
            ],
            [
                4914,
                4976
            ],
            [
                4977,
                4981
            ],
            [
                4982,
                4985
            ],
            [
                4993,
                5031
            ],
            [
                5040,
                5046
            ],
            [
                5046,
                5103
            ],
            [
                5108,
                5197
            ],
            [
                5198,
                5215
            ],
            [
                5264,
                5267
            ],
            [
                5267,
                5269
            ],
            [
                5269,
                5387
            ],
            [
                5388,
                5394
            ],
            [
                5394,
                5413
            ],
            [
                5420,
                5535
            ],
            [
                5536,
                5566
            ],
            [
                5566,
                5628
            ],
            [
                5629,
                5657
            ],
            [
                5657,
                5689
            ],
            [
                5690,
                5711
            ],
            [
                5711,
                5759
            ],
            [
                5763,
                5765
            ],
            [
                5765,
                5767
            ],
            [
                5768,
                5829
            ],
            [
                5839,
                5841
            ],
            [
                5842,
                5854
            ],
            [
                5855,
                5879
            ],
            [
                5880,
                5954
            ],
            [
                5964,
                5966
            ],
            [
                5966,
                5977
            ],
            [
                5978,
                5986
            ],
            [
                5987,
                6000
            ],
            [
                6004,
                6018
            ],
            [
                6018,
                6038
            ],
            [
                6039,
                6043
            ],
            [
                6044,
                6048
            ],
            [
                6049,
                6056
            ],
            [
                6063,
                6072
            ],
            [
                6073,
                6107
            ],
            [
                6107,
                6109
            ],
            [
                6109,
                6130
            ],
            [
                6138,
                6185
            ],
            [
                6185,
                6187
            ],
            [
                6187,
                6379
            ],
            [
                6379,
                6441
            ],
            [
                6442,
                6566
            ],
            [
                6572,
                6582
            ],
            [
                6583,
                6588
            ],
            [
                6598,
                6624
            ],
            [
                6641,
                6648
            ],
            [
                6648,
                6649
            ],
            [
                6650,
                6659
            ],
            [
                6660,
                6669
            ],
            [
                6680,
                6693
            ],
            [
                6693,
                6754
            ],
            [
                6754,
                6755
            ],
            [
                6756,
                6878
            ],
            [
                6880,
                6891
            ],
            [
                6894,
                6912
            ],
            [
                6913,
                6927
            ],
            [
                6935,
                6947
            ],
            [
                6947,
                6967
            ],
            [
                6968,
                7046
            ],
            [
                7056,
                7059
            ],
            [
                7060,
                7063
            ],
            [
                7064,
                7103
            ],
            [
                7104,
                7131
            ],
            [
                7134,
                7149
            ],
            [
                7151,
                7258
            ],
            [
                7258,
                7262
            ],
            [
                7263,
                7277
            ],
            [
                7278,
                7325
            ],
            [
                7325,
                7370
            ],
            [
                7377,
                7398
            ],
            [
                7398,
                7429
            ],
            [
                7430,
                7590
            ],
            [
                7594,
                7643
            ],
            [
                7647,
                7721
            ],
            [
                7725,
                7735
            ],
            [
                7736,
                7767
            ],
            [
                7771,
                7800
            ],
            [
                7809,
                7843
            ],
            [
                7847,
                7851
            ],
            [
                7851,
                7901
            ],
            [
                7908,
                7965
            ],
            [
                7965,
                8014
            ],
            [
                8018,
                8019
            ],
            [
                8022,
                8054
            ],
            [
                8054,
                8056
            ],
            [
                8056,
                8181
            ],
            [
                8184,
                8366
            ],
            [
                8366,
                8403
            ],
            [
                8404,
                8412
            ],
            [
                8416,
                8421
            ],
            [
                8422,
                8478
            ],
            [
                8486,
                8496
            ],
            [
                8505,
                8523
            ],
            [
                8529,
                8531
            ],
            [
                8532,
                8544
            ],
            [
                8545,
                8574
            ],
            [
                8575,
                8642
            ],
            [
                8643,
                8645
            ],
            [
                8646,
                8676
            ],
            [
                8676,
                8678
            ],
            [
                8678,
                8748
            ],
            [
                8764,
                8793
            ],
            [
                8804,
                8805
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                31
            ],
            [
                31,
                102
            ],
            [
                102,
                102
            ],
            [
                102,
                254
            ],
            [
                254,
                315
            ],
            [
                315,
                401
            ],
            [
                401,
                453
            ],
            [
                453,
                622
            ],
            [
                622,
                631
            ],
            [
                631,
                672
            ],
            [
                672,
                743
            ],
            [
                743,
                834
            ],
            [
                834,
                889
            ],
            [
                889,
                996
            ],
            [
                996,
                1092
            ],
            [
                1092,
                1152
            ],
            [
                1152,
                1226
            ],
            [
                1226,
                1356
            ],
            [
                1356,
                1412
            ],
            [
                1412,
                1529
            ],
            [
                1529,
                1529
            ],
            [
                1529,
                1603
            ],
            [
                1603,
                1659
            ],
            [
                1659,
                1731
            ],
            [
                1731,
                1731
            ],
            [
                1731,
                1731
            ],
            [
                1731,
                1776
            ],
            [
                1776,
                1883
            ],
            [
                1883,
                1980
            ],
            [
                1980,
                2043
            ],
            [
                2043,
                2236
            ],
            [
                2236,
                2382
            ],
            [
                2382,
                2472
            ],
            [
                2472,
                2610
            ],
            [
                2610,
                2762
            ],
            [
                2762,
                2762
            ],
            [
                2762,
                2980
            ],
            [
                2980,
                3217
            ],
            [
                3217,
                3365
            ],
            [
                3365,
                3365
            ],
            [
                3365,
                3554
            ],
            [
                3554,
                3638
            ],
            [
                3638,
                3769
            ],
            [
                3769,
                3824
            ],
            [
                3824,
                3960
            ],
            [
                3960,
                4021
            ],
            [
                4021,
                4052
            ],
            [
                4052,
                4077
            ],
            [
                4077,
                4077
            ],
            [
                4077,
                4189
            ],
            [
                4189,
                4189
            ],
            [
                4189,
                4365
            ],
            [
                4365,
                4450
            ],
            [
                4450,
                4477
            ],
            [
                4477,
                4611
            ],
            [
                4611,
                4764
            ],
            [
                4764,
                4847
            ],
            [
                4847,
                5046
            ],
            [
                5046,
                5215
            ],
            [
                5215,
                5269
            ],
            [
                5269,
                5394
            ],
            [
                5394,
                5566
            ],
            [
                5566,
                5657
            ],
            [
                5657,
                5765
            ],
            [
                5765,
                5966
            ],
            [
                5966,
                6109
            ],
            [
                6109,
                6187
            ],
            [
                6187,
                6379
            ],
            [
                6379,
                6650
            ],
            [
                6650,
                7103
            ],
            [
                7103,
                7149
            ],
            [
                7149,
                7258
            ],
            [
                7258,
                7325
            ],
            [
                7325,
                7373
            ],
            [
                7373,
                7398
            ],
            [
                7398,
                7593
            ],
            [
                7593,
                7646
            ],
            [
                7646,
                7724
            ],
            [
                7724,
                7770
            ],
            [
                7770,
                7846
            ],
            [
                7846,
                7851
            ],
            [
                7851,
                7965
            ],
            [
                7965,
                8017
            ],
            [
                8017,
                8056
            ],
            [
                8056,
                8184
            ],
            [
                8184,
                8366
            ],
            [
                8366,
                8523
            ],
            [
                8523,
                8678
            ],
            [
                8678,
                8805
            ]
        ]
    }
}