{
    "original": {
        "text": "\"Mist clogs the sunshine, Smoky dwarf houses Have we round on every side.\" MATTHEW ARNOLD.\nThe next afternoon, about twenty miles from Milton-Northern, they entered on the little branch railway that led to Heston. Heston itself was one long straggling street, running parallel to the seashore. It had a character of its own, as different from the little bathing-places in the south of England as they again from those of the continent. To use a Scotch word, everything looked more \"purpose-like.\" The country carts had more iron, and less wood and leather about the horse-gear; the people in the streets, although on pleasure bent, had yet a busy mind. The colours looked grayer--more enduring, not so gay and pretty. There were no smock-frocks, even among the country-folk; they retarded motion, and were apt to catch on machinery, and so the habit of wearing them had died out. In such towns in the south of England, Margaret had seen the shopmen, when not employed in their business, lounging a little at their doors, enjoying the fresh air, and the look up and down the street. Here, if they had any leisure from customers, they made themselves business in the shop--even, Margaret fancied, to the unnecessary unrolling and re-rolling of ribbons. All these differences struck upon her mind, as she and her mother went out next morning to look for lodgings.\nTheir two nights at hotels had cost more than Mr. Hale had anticipated, and they were glad to take the first clean, cheerful rooms they met with that were at liberty to receive them. There, for the first time for many days, did Margaret feel at rest. There was a dreaminess in the rest, too, which made it still more perfect and luxurious to repose in. The distant sea, lapped the sandy shore with measured sound; the nearer cries of the donkey-boys; the unusual scenes moving before her like pictures, which she cared not in her laziness to have fully explained before they passed away; the stroll down to the beach to breathe the sea-air, soft and warm on that sandy shore even to the end of November; the great long misty sea-line touching the tender-coloured sky; the white sail of a distant boat turning silver in some pale sunbeam:--it seemed as if she could dream her life away in such luxury of pensiveness, in which she made her present all in all, from not daring to think of the past, or wishing to contemplate the future.\nBut the future must be met, however stern and iron it be. One evening it was arranged that Margaret and her father should go the next day to Milton-Northern, and look out for a house. Mr. Hale had received several letters from Mr. Bell, and one or two from Mr. Thornton, and he was anxious to ascertain at once a good many particulars respecting his position and chances of success there, which he could only do by an interview with the latter gentleman. Margaret knew that they ought to be removing; but she had a repugnance to the idea of a manufacturing town, and believed that her mother was receiving benefit from Heston air, so she would willingly have deferred the expedition to Milton.\nFor several miles before they reached Milton, they saw a deep lead-coloured cloud hanging over the horizon in the direction in which it lay. It was all the darker from contrast with the pale gray-blue of the wintry sky; for in Heston there had been the earliest signs of frost. Nearer to the town, the air had a faint taste and smell of smoke; perhaps, after all, more a loss of the fragrance of grass and herbage than any positive taste or smell. Quick they were whirled over long, straight, hopeless streets of regularly-built houses, all small and of brick. Here and there a great oblong many-windowed factory stood up, like a hen among her chickens, puffing out black \"unparliamentary\" smoke, and sufficiently accounting for the cloud which Margaret had taken to foretell rain. As they drove through the larger and wider streets, from the station to the hotel, they had to stop constantly; great loaded lurries blocked up the not over-wide thoroughfares. Margaret had now and then been into the city in her drives with her aunt. But there the heavy lumbering vehicles seemed various in their purposes and intent; here every van, every waggon and truck, bore cotton, either in the raw shape in bags, or the woven shape in bales of calico. People thronged the footpaths, most of them well-dressed as regarded the material, but with a slovenly looseness which struck Margaret as different from the shabby, threadbare smartness of a similar class in London.\n\"New Street,\" said Mr. Hale. \"This, I believe, is the principal street in Milton. Bell has often spoken to me about it. It was the opening of this street from a lane into a great thoroughfare, thirty years ago, which has caused his property to rise so much in value. Mr. Thornton's mill must be somewhere not very far off, for he is Mr. Bell's tenant. But I fancy he dates from his warehouse.\"\n\"Where is our hotel, papa?\"\n\"Close to the end of this street, I believe. Shall we have lunch before or after we have looked at the houses we marked in the Milton Times?\"\n\"Oh, let us get our work done first.\"\n\"Very well. Then I will only see if there is any note or letter for me from Mr. Thornton, who said he would let me know anything he might hear about these houses, and then we will set off. We will keep the cab; it will be safer than losing ourselves, and being too late for the train this afternoon.\"\nThere were no letters awaiting him. They set out on their house-hunting. Thirty pounds a-year was all they could afford to give, but in Hampshire they could have met with a roomy house and pleasant garden for the money. Here, even the necessary accommodation of two sitting-rooms and four bed-rooms seemed unattainable. They went through their list, rejecting each as they visited it. They then looked at each other in dismay.\n\"We must go back to the second, I think. That one,--in Crampton, don't they call the suburb? There were three sitting-rooms; don't you remember how we laughed at the number compared with the three bed-rooms? But I have planned it all. The front room down-stairs is to be your study and our dining-room (poor papa!), for you know, we settled mamma is to have as cheerful a sitting-room as we can get; and that front room up-stairs, with the atrocious blue and pink paper and heavy cornice, had really a pretty view over the plain, with a great bend of river, or canal, or whatever it is, down below. Then I could have the little bed-room behind, in that projection at the head of the first flight of stairs over the kitchen, you know--and you and mamma the room behind the drawing-room, and that closet in the roof will make you a splendid dressing-room.\"\n\"But Dixon, and the girl we are to have to help?\"\n\"Oh, wait a minute. I am overpowered by the discovery of my own genius for management. Dixon is to have--let me see, I had it once--the back sitting-room. I think she will like that. She grumbles so much about the stairs at Heston; and the girl is to have that sloping attic over your room and mamma's. Won't that do?\"\n\"I dare say it will. But the papers. What taste! And the over-loading such a house with colour and such heavy cornices!\"\n\"Never mind, papa! Surely you can charm the landlord into re-papering one or two of the rooms--the drawing-room and your bed-room--for mamma will come most in contact with them; and your book-shelves will hide a great deal of that gaudy pattern in the dining-room.\"\n\"Then you think it the best? If so, I had better go at once and call on this Mr. Donkin, to whom the advertisement refers me. I will take you back to the hotel, where you can order lunch, and rest, and by the time it is ready, I shall be with you. I hope I shall be able to get new papers.\"\nMargaret hoped so too, though she said nothing. She had never come fairly in contact with the taste that loves ornament, however bad, more than the plainness and simplicity which are of themselves the framework of elegance.\nHer father took her through the entrance of the hotel, and leaving her at the foot of the staircase, went to the address of the landlord of the house they had fixed upon. Just as Margaret had her hand on the door of their sitting-room, she was followed by a quick-stepping waiter:\n\"I beg your pardon, ma'am. The gentleman was gone so quickly, I had no time to tell him. Mr. Thornton called almost directly after you left; and as I understood, from what the gentleman said, you would be back in an hour, I told him so, and he came again about five minutes ago, and said he would wait for Mr. Hale. He is in your room now, ma'am.\"\n\"Thank you. My father will return soon, and then you can tell him.\"\nMargaret opened the door and went in with the straight, fearless, dignified presence habitual to her. She felt no awkwardness; she had too much the habits of society for that. Here was a person come on business to her father; and, as he was one who had shown himself obliging, she was disposed to treat him with a full measure of civility. Mr. Thornton was a good deal more surprised and discomfited than she. Instead of a quiet, middle-aged clergyman, a young lady came forward with frank dignity,--a young lady of a different type to most of those he was in the habit of seeing. Her dress was very plain: a close straw bonnet of the best material and shape, trimmed with white ribbon; a large Indian shawl, which hung about her in long heavy folds, and which she wore as an empress wears her drapery. He did not understand who she was, as he caught the simple, straight, unabashed look, which showed that his being there was of no concern to the beautiful countenance, and called up no flush of surprise to the pale ivory of the complexion. He had heard that Mr. Hale had a daughter, but he had imagined that she was a little girl.\n\"Mr. Thornton, I believe!\" said Margaret, after a half-instant's pause, during which his unready words would not come. \"Will you sit down. My father brought me to the door not a minute ago, but unfortunately he was not told that you were here, and he has gone away on some business. But he will come back almost directly. I am sorry you have had the trouble of calling twice.\"\nMr. Thornton was in habits of authority himself, but she seemed to assume some kind of rule over him at once. He had been getting impatient at the loss of his time on a market-day, the moment before she appeared, yet now he calmly took a seat at her bidding.\n\"Do you know where it is that Mr. Hale has gone to? Perhaps I might be able to find him.\"\n\"He has gone to a Mr. Donkin in Canute Street. He is the landlord of the house my father wishes to take in Crampton.\"\nMr. Thornton knew the house. He had seen the advertisement, and been to look at it, in compliance with a request of Mr. Bell's that he would assist Mr. Hale to the best of his power: and also instigated by his own interest in the case of a clergyman who had given up his living under circumstances such as those of Mr. Hale. Mr. Thornton had thought that the house in Crampton was really just the thing; but now that he saw Margaret, with her superb ways of moving and looking, he began to feel ashamed of having imagined that it would do very well for the Hales, in spite of a certain vulgarity in it which had struck him at the time of his looking it over.\nMargaret could not help her looks; but the short curled upper lip, the round, massive up-turned chin, the manner of carrying her head, her movements, full of a soft feminine defiance, always gave strangers the impression of haughtiness. She was tired now, and would much rather have remained silent, and taken the rest her father had planned for her; but, of course, she owed to herself to be a gentlewoman, and to speak courteously from time to time to this stranger; not over-brushed, nor over-polished, it must be confessed, after his rough encounter with Milton streets and crowds. She wished that he would go, as he had once spoken of doing, instead of sitting there, answering with curt sentences all the remarks she made. She had taken off her shawl, and hung it over the back of her chair. She sat facing him and facing the light; her full beauty met his eye; her round white flexile throat rising out of the full, yet lithe figure; her lips moving so slightly as she spoke, not breaking the cold serene look of her face with any variation from the one lovely haughty curve; her eyes, with their soft gloom, meeting his with quiet maiden freedom. He almost said to himself that he did not like her, before their conversation ended; he tried so to compensate himself for the mortified feeling, that while he looked upon her with an admiration he could not repress, she looked at him with proud indifference, taking him, he thought, for what, in his irritation, he told himself he was--a great rough fellow, with not a grace or a refinement about him. Her quiet coldness of demeanour he interpreted into contemptuousness, and resented it in his heart to the pitch of almost inclining him to get up and go away, and have nothing more to do with these Hales, and their superciliousness.\nJust as Margaret had exhausted her last subject of conversation--and yet conversation that could hardly be called which consisted of so few and such short speeches--her father came in, and with his pleasant gentlemanly courteousness of apology, reinstated his name and family in Mr. Thornton's good opinion.\nMr. Hale and his visitor had a good deal to say respecting their mutual friend, Mr. Bell; and Margaret, glad that her part of entertaining the visitor was over, went to the window to try and make herself more familiar with the strange aspect of the street. She got so much absorbed in watching what was going on outside that she hardly heard her father when he spoke to her, and he had to repeat what he said:\n\"Margaret! the landlord will persist in admiring that hideous paper, and I am afraid we must let it remain.\"\n\"Oh dear! I am sorry!\" she replied, and began to turn over in her mind the possibility of hiding part of it, at least, by some of her sketches, but gave up the idea at last, as likely only to make bad worse. Her father, meanwhile, with his kindly country hospitality, was pressing Mr. Thornton to stay to luncheon with them. It would have been very inconvenient to him to do so, yet he felt that he should have yielded, if Margaret by word or look had seconded her father's invitation; he was glad she did not, and yet he was irritated at her for not doing so. She gave him a low, grave bow when he left, and he felt more awkward and self-conscious in every limb than he had ever done in his life before.\n\"Well, Margaret, now to luncheon as fast as we can. Have you ordered it?\"\n\"No, papa; that man was here when I came home, and I have never had an opportunity.\"\n\"Then we must take anything we can get. He must have been waiting a long time I'm afraid.\"\n\"It seemed exceedingly long to me. I was just at the last gasp when you came in. He never went on with any subject, but gave little, short, abrupt answers.\"\n\"Very much to the point though, I should think. He is a clear-headed fellow. He said (did you hear?) that Crampton is on gravelly soil, and by far the most healthy suburb in the neighbourhood of Milton.\"\nWhen they returned to Heston, there was the day's account to be given to Mrs. Hale, who was full of questions, which they answered in the intervals of tea-drinking.\n\"And what is your correspondent, Mr. Thornton, like?\"\n\"Ask Margaret,\" said her husband. \"She and he had a long attempt at conversation, while I was away speaking to the landlord.\"\n\"Oh! I hardly know what he is like,\" said Margaret, lazily; too tired to tax her powers of description much. And then rousing herself, she said, \"He is a tall, broad-shouldered man, about--how old, papa?\"\n\"I should guess about thirty.\"\n\"About thirty--with a face that is neither exactly plain, nor yet handsome, nothing remarkable--not quite a gentleman; but that was hardly to be expected.\"\n\"Not vulgar or common though,\" put in her father, rather jealous of any disparagement of the sole friend he had in Milton.\n\"Oh, no!\" said Margaret. \"With such an expression of resolution and power, no face, however plain in feature, could be either vulgar or common. I should not like to have to bargain with him; he looks very inflexible. Altogether a man who seems made for his niche, mamma; sagacious, and strong, as becomes a great tradesman.\"\n\"Don't call the Milton manufacturers tradesmen, Margaret,\" said her father. \"They are very different.\"\n\"Are they? I apply the word to all who have something tangible to sell; but if you think the term is not correct, papa, I won't use it. But, oh mamma! speaking of vulgarity and commonness, you must prepare yourself for our drawing-room paper. Pink and blue roses, with yellow leaves! And such a heavy cornice round the room!\"\nBut when they removed to their new house in Milton, the obnoxious papers were gone. The landlord received their thanks very composedly; and let them think, if they liked, that he had relented from his expressed determination not to repaper. There was no particular need to tell them, that what he did not care to do for a Reverend Mr. Hale, unknown in Milton, he was only too glad to do at the one short sharp remonstrance of Mr. Thornton, the wealthy manufacturer.",
        "paragraph_chars": [
            [
                0,
                91
            ],
            [
                91,
                1361
            ],
            [
                1361,
                2395
            ],
            [
                2395,
                3089
            ],
            [
                3089,
                4547
            ],
            [
                4547,
                4941
            ],
            [
                4941,
                4969
            ],
            [
                4969,
                5111
            ],
            [
                5111,
                5149
            ],
            [
                5149,
                5450
            ],
            [
                5450,
                5877
            ],
            [
                5877,
                6732
            ],
            [
                6732,
                6782
            ],
            [
                6782,
                7101
            ],
            [
                7101,
                7222
            ],
            [
                7222,
                7488
            ],
            [
                7488,
                7779
            ],
            [
                7779,
                8003
            ],
            [
                8003,
                8284
            ],
            [
                8284,
                8632
            ],
            [
                8632,
                8700
            ],
            [
                8700,
                9834
            ],
            [
                9834,
                10211
            ],
            [
                10211,
                10470
            ],
            [
                10470,
                10560
            ],
            [
                10560,
                10678
            ],
            [
                10678,
                11337
            ],
            [
                11337,
                13128
            ],
            [
                13128,
                13436
            ],
            [
                13436,
                13846
            ],
            [
                13846,
                13955
            ],
            [
                13955,
                14660
            ],
            [
                14660,
                14734
            ],
            [
                14734,
                14819
            ],
            [
                14819,
                14910
            ],
            [
                14910,
                15067
            ],
            [
                15067,
                15271
            ],
            [
                15271,
                15436
            ],
            [
                15436,
                15490
            ],
            [
                15490,
                15616
            ],
            [
                15616,
                15821
            ],
            [
                15821,
                15852
            ],
            [
                15852,
                16008
            ],
            [
                16008,
                16131
            ],
            [
                16131,
                16456
            ],
            [
                16456,
                16559
            ],
            [
                16559,
                16885
            ],
            [
                16885,
                17350
            ]
        ],
        "segment_chars": [
            [
                0,
                75
            ],
            [
                75,
                91
            ],
            [
                91,
                214
            ],
            [
                214,
                294
            ],
            [
                294,
                436
            ],
            [
                436,
                497
            ],
            [
                497,
                653
            ],
            [
                653,
                718
            ],
            [
                718,
                880
            ],
            [
                880,
                1082
            ],
            [
                1082,
                1251
            ],
            [
                1251,
                1361
            ],
            [
                1361,
                1544
            ],
            [
                1544,
                1612
            ],
            [
                1612,
                1714
            ],
            [
                1714,
                2395
            ],
            [
                2395,
                2453
            ],
            [
                2453,
                2579
            ],
            [
                2579,
                2850
            ],
            [
                2850,
                3089
            ],
            [
                3089,
                3230
            ],
            [
                3230,
                3367
            ],
            [
                3367,
                3537
            ],
            [
                3537,
                3650
            ],
            [
                3650,
                3871
            ],
            [
                3871,
                4048
            ],
            [
                4048,
                4122
            ],
            [
                4122,
                4331
            ],
            [
                4331,
                4547
            ],
            [
                4547,
                4576
            ],
            [
                4576,
                4629
            ],
            [
                4629,
                4667
            ],
            [
                4667,
                4814
            ],
            [
                4814,
                4899
            ],
            [
                4899,
                4941
            ],
            [
                4941,
                4969
            ],
            [
                4969,
                5014
            ],
            [
                5014,
                5111
            ],
            [
                5111,
                5149
            ],
            [
                5149,
                5161
            ],
            [
                5161,
                5338
            ],
            [
                5338,
                5450
            ],
            [
                5450,
                5486
            ],
            [
                5486,
                5523
            ],
            [
                5523,
                5670
            ],
            [
                5670,
                5770
            ],
            [
                5770,
                5835
            ],
            [
                5835,
                5877
            ],
            [
                5877,
                5918
            ],
            [
                5918,
                5970
            ],
            [
                5970,
                6085
            ],
            [
                6085,
                6112
            ],
            [
                6112,
                6190
            ],
            [
                6190,
                6476
            ],
            [
                6476,
                6732
            ],
            [
                6732,
                6782
            ],
            [
                6782,
                6802
            ],
            [
                6802,
                6869
            ],
            [
                6869,
                6937
            ],
            [
                6937,
                6965
            ],
            [
                6965,
                7085
            ],
            [
                7085,
                7101
            ],
            [
                7101,
                7122
            ],
            [
                7122,
                7138
            ],
            [
                7138,
                7150
            ],
            [
                7150,
                7222
            ],
            [
                7222,
                7241
            ],
            [
                7241,
                7488
            ],
            [
                7488,
                7517
            ],
            [
                7517,
                7614
            ],
            [
                7614,
                7736
            ],
            [
                7736,
                7779
            ],
            [
                7779,
                7827
            ],
            [
                7827,
                8003
            ],
            [
                8003,
                8174
            ],
            [
                8174,
                8284
            ],
            [
                8284,
                8311
            ],
            [
                8311,
                8373
            ],
            [
                8373,
                8600
            ],
            [
                8600,
                8632
            ],
            [
                8632,
                8644
            ],
            [
                8644,
                8700
            ],
            [
                8700,
                8802
            ],
            [
                8802,
                8876
            ],
            [
                8876,
                9040
            ],
            [
                9040,
                9110
            ],
            [
                9110,
                9281
            ],
            [
                9281,
                9503
            ],
            [
                9503,
                9743
            ],
            [
                9743,
                9834
            ],
            [
                9834,
                9861
            ],
            [
                9861,
                9953
            ],
            [
                9953,
                9973
            ],
            [
                9973,
                10117
            ],
            [
                10117,
                10156
            ],
            [
                10156,
                10211
            ],
            [
                10211,
                10321
            ],
            [
                10321,
                10470
            ],
            [
                10470,
                10522
            ],
            [
                10522,
                10560
            ],
            [
                10560,
                10607
            ],
            [
                10607,
                10678
            ],
            [
                10678,
                10707
            ],
            [
                10707,
                11003
            ],
            [
                11003,
                11337
            ],
            [
                11337,
                11574
            ],
            [
                11574,
                11923
            ],
            [
                11923,
                12066
            ],
            [
                12066,
                12135
            ],
            [
                12135,
                12492
            ],
            [
                12492,
                12895
            ],
            [
                12895,
                13128
            ],
            [
                13128,
                13436
            ],
            [
                13436,
                13693
            ],
            [
                13693,
                13846
            ],
            [
                13846,
                13857
            ],
            [
                13857,
                13955
            ],
            [
                13955,
                13965
            ],
            [
                13965,
                13978
            ],
            [
                13978,
                14163
            ],
            [
                14163,
                14280
            ],
            [
                14280,
                14516
            ],
            [
                14516,
                14660
            ],
            [
                14660,
                14712
            ],
            [
                14712,
                14734
            ],
            [
                14734,
                14819
            ],
            [
                14819,
                14859
            ],
            [
                14859,
                14910
            ],
            [
                14910,
                14945
            ],
            [
                14945,
                14991
            ],
            [
                14991,
                15067
            ],
            [
                15067,
                15115
            ],
            [
                15115,
                15144
            ],
            [
                15144,
                15168
            ],
            [
                15168,
                15271
            ],
            [
                15271,
                15436
            ],
            [
                15436,
                15490
            ],
            [
                15490,
                15524
            ],
            [
                15524,
                15616
            ],
            [
                15616,
                15621
            ],
            [
                15621,
                15725
            ],
            [
                15725,
                15821
            ],
            [
                15821,
                15852
            ],
            [
                15852,
                16008
            ],
            [
                16008,
                16131
            ],
            [
                16131,
                16141
            ],
            [
                16141,
                16156
            ],
            [
                16156,
                16275
            ],
            [
                16275,
                16348
            ],
            [
                16348,
                16456
            ],
            [
                16456,
                16532
            ],
            [
                16532,
                16559
            ],
            [
                16559,
                16570
            ],
            [
                16570,
                16695
            ],
            [
                16695,
                16710
            ],
            [
                16710,
                16802
            ],
            [
                16802,
                16843
            ],
            [
                16843,
                16885
            ],
            [
                16885,
                16969
            ],
            [
                16969,
                17126
            ],
            [
                17126,
                17350
            ]
        ],
        "overlap_chars": [
            [
                91,
                109
            ],
            [
                152,
                156
            ],
            [
                165,
                171
            ],
            [
                186,
                193
            ],
            [
                203,
                214
            ],
            [
                214,
                220
            ],
            [
                228,
                294
            ],
            [
                294,
                296
            ],
            [
                328,
                392
            ],
            [
                436,
                480
            ],
            [
                482,
                489
            ],
            [
                490,
                494
            ],
            [
                578,
                588
            ],
            [
                576,
                577
            ],
            [
                653,
                671
            ],
            [
                716,
                718
            ],
            [
                880,
                936
            ],
            [
                941,
                948
            ],
            [
                987,
                995
            ],
            [
                1005,
                1019
            ],
            [
                1053,
                1082
            ],
            [
                1082,
                1111
            ],
            [
                1126,
                1132
            ],
            [
                1138,
                1148
            ],
            [
                1158,
                1169
            ],
            [
                1230,
                1231
            ],
            [
                1171,
                1230
            ],
            [
                1231,
                1251
            ],
            [
                1251,
                1279
            ],
            [
                1285,
                1288
            ],
            [
                1293,
                1361
            ],
            [
                1367,
                1377
            ],
            [
                1381,
                1406
            ],
            [
                1420,
                1496
            ],
            [
                1542,
                1544
            ],
            [
                1544,
                1584
            ],
            [
                1589,
                1597
            ],
            [
                1603,
                1612
            ],
            [
                1612,
                1634
            ],
            [
                1653,
                1699
            ],
            [
                1712,
                1714
            ],
            [
                1714,
                1732
            ],
            [
                1738,
                1753
            ],
            [
                1773,
                1778
            ],
            [
                1786,
                1810
            ],
            [
                1947,
                2015
            ],
            [
                2036,
                2040
            ],
            [
                2044,
                2107
            ],
            [
                2124,
                2198
            ],
            [
                1870,
                1873
            ],
            [
                2216,
                2245
            ],
            [
                1862,
                1863
            ],
            [
                2344,
                2355
            ],
            [
                2357,
                2359
            ],
            [
                2387,
                2395
            ],
            [
                2395,
                2448
            ],
            [
                2449,
                2453
            ],
            [
                2453,
                2561
            ],
            [
                2566,
                2579
            ],
            [
                2579,
                2587
            ],
            [
                2673,
                2687
            ],
            [
                2652,
                2664
            ],
            [
                2632,
                2635
            ],
            [
                2688,
                2697
            ],
            [
                2741,
                2753
            ],
            [
                2848,
                2850
            ],
            [
                2850,
                2858
            ],
            [
                2904,
                2961
            ],
            [
                3033,
                3053
            ],
            [
                3063,
                3077
            ],
            [
                3087,
                3089
            ],
            [
                3089,
                3195
            ],
            [
                3222,
                3224
            ],
            [
                3266,
                3279
            ],
            [
                3297,
                3307
            ],
            [
                3365,
                3367
            ],
            [
                3367,
                3431
            ],
            [
                3535,
                3537
            ],
            [
                3543,
                3601
            ],
            [
                3630,
                3635
            ],
            [
                3643,
                3648
            ],
            [
                3618,
                3624
            ],
            [
                3648,
                3650
            ],
            [
                3650,
                3760
            ],
            [
                3779,
                3789
            ],
            [
                3803,
                3827
            ],
            [
                3869,
                3870
            ],
            [
                3871,
                3896
            ],
            [
                3914,
                3921
            ],
            [
                3952,
                3982
            ],
            [
                3989,
                3995
            ],
            [
                3999,
                4018
            ],
            [
                4033,
                4048
            ],
            [
                4048,
                4092
            ],
            [
                4093,
                4122
            ],
            [
                4122,
                4167
            ],
            [
                4168,
                4175
            ],
            [
                4185,
                4193
            ],
            [
                4204,
                4210
            ],
            [
                4244,
                4245
            ],
            [
                4211,
                4221
            ],
            [
                4235,
                4244
            ],
            [
                4246,
                4265
            ],
            [
                4273,
                4276
            ],
            [
                4283,
                4294
            ],
            [
                4299,
                4304
            ],
            [
                4266,
                4272
            ],
            [
                4314,
                4331
            ],
            [
                4331,
                4547
            ],
            [
                4548,
                4558
            ],
            [
                4561,
                4576
            ],
            [
                4581,
                4582
            ],
            [
                4629,
                4633
            ],
            [
                4654,
                4656
            ],
            [
                4592,
                4600
            ],
            [
                4611,
                4628
            ],
            [
                4667,
                4677
            ],
            [
                4686,
                4700
            ],
            [
                4713,
                4814
            ],
            [
                4814,
                4841
            ],
            [
                4868,
                4899
            ],
            [
                5034,
                5040
            ],
            [
                5020,
                5022
            ],
            [
                5072,
                5108
            ],
            [
                5114,
                5115
            ],
            [
                5166,
                5172
            ],
            [
                5178,
                5197
            ],
            [
                5206,
                5219
            ],
            [
                5065,
                5067
            ],
            [
                5127,
                5130
            ],
            [
                5220,
                5237
            ],
            [
                5159,
                5160
            ],
            [
                5243,
                5297
            ],
            [
                5068,
                5071
            ],
            [
                5304,
                5310
            ],
            [
                5450,
                5484
            ],
            [
                5486,
                5523
            ],
            [
                5523,
                5538
            ],
            [
                5539,
                5569
            ],
            [
                5577,
                5611
            ],
            [
                5621,
                5670
            ],
            [
                5670,
                5694
            ],
            [
                5712,
                5770
            ],
            [
                5770,
                5835
            ],
            [
                5840,
                5844
            ],
            [
                5835,
                5839
            ],
            [
                5845,
                5877
            ],
            [
                5878,
                5916
            ],
            [
                5916,
                5918
            ],
            [
                5945,
                5947
            ],
            [
                5923,
                5926
            ],
            [
                5929,
                5931
            ],
            [
                5958,
                5968
            ],
            [
                5932,
                5940
            ],
            [
                5968,
                5970
            ],
            [
                5970,
                6073
            ],
            [
                6083,
                6085
            ],
            [
                6085,
                6112
            ],
            [
                6112,
                6126
            ],
            [
                6139,
                6178
            ],
            [
                6205,
                6206
            ],
            [
                6193,
                6196
            ],
            [
                6218,
                6234
            ],
            [
                6238,
                6246
            ],
            [
                6249,
                6261
            ],
            [
                6275,
                6285
            ],
            [
                6292,
                6296
            ],
            [
                6306,
                6346
            ],
            [
                6364,
                6369
            ],
            [
                6377,
                6390
            ],
            [
                6425,
                6427
            ],
            [
                6396,
                6405
            ],
            [
                6407,
                6411
            ],
            [
                6428,
                6476
            ],
            [
                6476,
                6504
            ],
            [
                6514,
                6520
            ],
            [
                6508,
                6509
            ],
            [
                6583,
                6599
            ],
            [
                6724,
                6725
            ],
            [
                6611,
                6661
            ],
            [
                6733,
                6747
            ],
            [
                6752,
                6756
            ],
            [
                6787,
                6802
            ],
            [
                6869,
                6885
            ],
            [
                6897,
                6898
            ],
            [
                6887,
                6897
            ],
            [
                6914,
                6937
            ],
            [
                6937,
                6965
            ],
            [
                7014,
                7026
            ],
            [
                7033,
                7085
            ],
            [
                7085,
                7098
            ],
            [
                7102,
                7122
            ],
            [
                7122,
                7129
            ],
            [
                7130,
                7138
            ],
            [
                7138,
                7148
            ],
            [
                7223,
                7241
            ],
            [
                7241,
                7291
            ],
            [
                7317,
                7342
            ],
            [
                7398,
                7485
            ],
            [
                7494,
                7517
            ],
            [
                7517,
                7539
            ],
            [
                7548,
                7559
            ],
            [
                7585,
                7588
            ],
            [
                7612,
                7614
            ],
            [
                7614,
                7679
            ],
            [
                7690,
                7736
            ],
            [
                7736,
                7769
            ],
            [
                8003,
                8061
            ],
            [
                8104,
                8108
            ],
            [
                8172,
                8174
            ],
            [
                8174,
                8190
            ],
            [
                8219,
                8246
            ],
            [
                8256,
                8260
            ],
            [
                8276,
                8284
            ],
            [
                8285,
                8311
            ],
            [
                8346,
                8367
            ],
            [
                8311,
                8324
            ],
            [
                8371,
                8373
            ],
            [
                8373,
                8392
            ],
            [
                8400,
                8428
            ],
            [
                8444,
                8445
            ],
            [
                8429,
                8444
            ],
            [
                8476,
                8538
            ],
            [
                8545,
                8600
            ],
            [
                8600,
                8629
            ],
            [
                8639,
                8644
            ],
            [
                8644,
                8670
            ],
            [
                8700,
                8736
            ],
            [
                8746,
                8764
            ],
            [
                8766,
                8775
            ],
            [
                8764,
                8765
            ],
            [
                8800,
                8802
            ],
            [
                8802,
                8826
            ],
            [
                8876,
                8929
            ],
            [
                8827,
                8830
            ],
            [
                8997,
                9011
            ],
            [
                9030,
                9039
            ],
            [
                9040,
                9110
            ],
            [
                9110,
                9197
            ],
            [
                9200,
                9235
            ],
            [
                9244,
                9281
            ],
            [
                9281,
                9348
            ],
            [
                9358,
                9359
            ],
            [
                9385,
                9408
            ],
            [
                9455,
                9503
            ],
            [
                9503,
                9587
            ],
            [
                9741,
                9743
            ],
            [
                9743,
                9832
            ],
            [
                9832,
                9834
            ],
            [
                9837,
                9838
            ],
            [
                9839,
                9858
            ],
            [
                9861,
                9883
            ],
            [
                9899,
                9904
            ],
            [
                9951,
                9953
            ],
            [
                9954,
                9971
            ],
            [
                9973,
                9982
            ],
            [
                10045,
                10117
            ],
            [
                10117,
                10138
            ],
            [
                10154,
                10156
            ],
            [
                10156,
                10208
            ],
            [
                10211,
                10230
            ],
            [
                10238,
                10311
            ],
            [
                10319,
                10321
            ],
            [
                10432,
                10470
            ],
            [
                10474,
                10488
            ],
            [
                10500,
                10517
            ],
            [
                10520,
                10522
            ],
            [
                10522,
                10557
            ],
            [
                10561,
                10588
            ],
            [
                10613,
                10675
            ],
            [
                10678,
                10707
            ],
            [
                10707,
                10804
            ],
            [
                10859,
                10869
            ],
            [
                10847,
                10849
            ],
            [
                10884,
                10903
            ],
            [
                10826,
                10834
            ],
            [
                10962,
                10975
            ],
            [
                11001,
                11003
            ],
            [
                11003,
                11054
            ],
            [
                11240,
                11241
            ],
            [
                11254,
                11273
            ],
            [
                11055,
                11240
            ],
            [
                11335,
                11337
            ],
            [
                11337,
                11414
            ],
            [
                11423,
                11471
            ],
            [
                11472,
                11574
            ],
            [
                11574,
                11602
            ],
            [
                11608,
                11619
            ],
            [
                11686,
                11691
            ],
            [
                11704,
                11712
            ],
            [
                11843,
                11845
            ],
            [
                11713,
                11723
            ],
            [
                11749,
                11769
            ],
            [
                11788,
                11804
            ],
            [
                11921,
                11923
            ],
            [
                11923,
                11951
            ],
            [
                11984,
                12009
            ],
            [
                12025,
                12029
            ],
            [
                12010,
                12019
            ],
            [
                12040,
                12043
            ],
            [
                12048,
                12055
            ],
            [
                12064,
                12065
            ],
            [
                12066,
                12098
            ],
            [
                12112,
                12115
            ],
            [
                12133,
                12135
            ],
            [
                12176,
                12220
            ],
            [
                12229,
                12253
            ],
            [
                12264,
                12281
            ],
            [
                12287,
                12293
            ],
            [
                12282,
                12286
            ],
            [
                12320,
                12365
            ],
            [
                12418,
                12428
            ],
            [
                12453,
                12475
            ],
            [
                12483,
                12492
            ],
            [
                12492,
                12542
            ],
            [
                12643,
                12672
            ],
            [
                12676,
                12686
            ],
            [
                12707,
                12784
            ],
            [
                12821,
                12827
            ],
            [
                12829,
                12861
            ],
            [
                12873,
                12895
            ],
            [
                12895,
                12913
            ],
            [
                12927,
                12941
            ],
            [
                12947,
                12955
            ],
            [
                12963,
                12980
            ],
            [
                13010,
                13016
            ],
            [
                13031,
                13092
            ],
            [
                13110,
                13122
            ],
            [
                13093,
                13098
            ],
            [
                13126,
                13128
            ],
            [
                13128,
                13191
            ],
            [
                13371,
                13372
            ],
            [
                13293,
                13321
            ],
            [
                13326,
                13346
            ],
            [
                13364,
                13371
            ],
            [
                13373,
                13387
            ],
            [
                13397,
                13435
            ],
            [
                13659,
                13662
            ],
            [
                13461,
                13464
            ],
            [
                13704,
                13708
            ],
            [
                13477,
                13483
            ],
            [
                13495,
                13615
            ],
            [
                13445,
                13448
            ],
            [
                13735,
                13738
            ],
            [
                13681,
                13691
            ],
            [
                13809,
                13810
            ],
            [
                13789,
                13793
            ],
            [
                13778,
                13788
            ],
            [
                13797,
                13809
            ],
            [
                13844,
                13846
            ],
            [
                13851,
                13857
            ],
            [
                13857,
                13952
            ],
            [
                13956,
                13965
            ],
            [
                13965,
                13975
            ],
            [
                13978,
                14003
            ],
            [
                14052,
                14073
            ],
            [
                14077,
                14097
            ],
            [
                14161,
                14163
            ],
            [
                14163,
                14184
            ],
            [
                14221,
                14268
            ],
            [
                14278,
                14280
            ],
            [
                14280,
                14360
            ],
            [
                14373,
                14386
            ],
            [
                14453,
                14469
            ],
            [
                14441,
                14452
            ],
            [
                14470,
                14473
            ],
            [
                14481,
                14497
            ],
            [
                14514,
                14516
            ],
            [
                14516,
                14603
            ],
            [
                14618,
                14651
            ],
            [
                14658,
                14660
            ],
            [
                14661,
                14692
            ],
            [
                14710,
                14712
            ],
            [
                14862,
                14896
            ],
            [
                14897,
                14907
            ],
            [
                14911,
                14945
            ],
            [
                14945,
                14991
            ],
            [
                14991,
                14993
            ],
            [
                15030,
                15034
            ],
            [
                15043,
                15064
            ],
            [
                15073,
                15115
            ],
            [
                15115,
                15128
            ],
            [
                15129,
                15144
            ],
            [
                15144,
                15151
            ],
            [
                15168,
                15237
            ],
            [
                15262,
                15268
            ],
            [
                15271,
                15300
            ],
            [
                15344,
                15353
            ],
            [
                15359,
                15380
            ],
            [
                15434,
                15435
            ],
            [
                15437,
                15448
            ],
            [
                15469,
                15481
            ],
            [
                15483,
                15487
            ],
            [
                15491,
                15503
            ],
            [
                15506,
                15524
            ],
            [
                15529,
                15613
            ],
            [
                15617,
                15621
            ],
            [
                15621,
                15650
            ],
            [
                15653,
                15666
            ],
            [
                15668,
                15674
            ],
            [
                15723,
                15725
            ],
            [
                15762,
                15803
            ],
            [
                15805,
                15818
            ],
            [
                15822,
                15849
            ],
            [
                15853,
                15865
            ],
            [
                15887,
                15913
            ],
            [
                15918,
                15946
            ],
            [
                15948,
                16005
            ],
            [
                16009,
                16036
            ],
            [
                16039,
                16056
            ],
            [
                16129,
                16131
            ],
            [
                16132,
                16138
            ],
            [
                16141,
                16156
            ],
            [
                16157,
                16213
            ],
            [
                16241,
                16249
            ],
            [
                16257,
                16275
            ],
            [
                16275,
                16348
            ],
            [
                16348,
                16358
            ],
            [
                16369,
                16453
            ],
            [
                16460,
                16512
            ],
            [
                16515,
                16532
            ],
            [
                16538,
                16556
            ],
            [
                16560,
                16570
            ],
            [
                16635,
                16695
            ],
            [
                16695,
                16710
            ],
            [
                16710,
                16731
            ],
            [
                16746,
                16802
            ],
            [
                16802,
                16841
            ],
            [
                16885,
                16898
            ],
            [
                16907,
                16950
            ],
            [
                16963,
                16969
            ],
            [
                16969,
                16981
            ],
            [
                17025,
                17039
            ],
            [
                17056,
                17076
            ],
            [
                17019,
                17020
            ],
            [
                17126,
                17138
            ],
            [
                17150,
                17167
            ],
            [
                17169,
                17204
            ],
            [
                17226,
                17233
            ],
            [
                17216,
                17224
            ],
            [
                17243,
                17278
            ],
            [
                17283,
                17350
            ]
        ],
        "row_chars": [
            [
                0,
                75
            ],
            [
                75,
                91
            ],
            [
                91,
                214
            ],
            [
                214,
                294
            ],
            [
                294,
                497
            ],
            [
                497,
                718
            ],
            [
                718,
                880
            ],
            [
                880,
                1082
            ],
            [
                1082,
                1251
            ],
            [
                1251,
                1361
            ],
            [
                1361,
                1544
            ],
            [
                1544,
                1612
            ],
            [
                1612,
                1714
            ],
            [
                1714,
                2395
            ],
            [
                2395,
                2453
            ],
            [
                2453,
                2579
            ],
            [
                2579,
                2850
            ],
            [
                2850,
                3089
            ],
            [
                3089,
                3367
            ],
            [
                3367,
                3537
            ],
            [
                3537,
                3650
            ],
            [
                3650,
                3871
            ],
            [
                3871,
                4048
            ],
            [
                4048,
                4122
            ],
            [
                4122,
                4331
            ],
            [
                4331,
                4547
            ],
            [
                4547,
                4576
            ],
            [
                4576,
                4667
            ],
            [
                4667,
                4814
            ],
            [
                4814,
                4899
            ],
            [
                4899,
                4941
            ],
            [
                4941,
                4969
            ],
            [
                4969,
                5014
            ],
            [
                5014,
                5338
            ],
            [
                5338,
                5450
            ],
            [
                5450,
                5523
            ],
            [
                5523,
                5670
            ],
            [
                5670,
                5770
            ],
            [
                5770,
                5835
            ],
            [
                5835,
                5877
            ],
            [
                5877,
                5918
            ],
            [
                5918,
                5970
            ],
            [
                5970,
                6085
            ],
            [
                6085,
                6112
            ],
            [
                6112,
                6476
            ],
            [
                6476,
                6732
            ],
            [
                6732,
                6782
            ],
            [
                6782,
                6802
            ],
            [
                6802,
                6869
            ],
            [
                6869,
                6937
            ],
            [
                6937,
                6965
            ],
            [
                6965,
                7085
            ],
            [
                7085,
                7101
            ],
            [
                7101,
                7122
            ],
            [
                7122,
                7138
            ],
            [
                7138,
                7150
            ],
            [
                7150,
                7222
            ],
            [
                7222,
                7241
            ],
            [
                7241,
                7488
            ],
            [
                7488,
                7517
            ],
            [
                7517,
                7614
            ],
            [
                7614,
                7736
            ],
            [
                7736,
                7779
            ],
            [
                7779,
                7827
            ],
            [
                7827,
                8003
            ],
            [
                8003,
                8174
            ],
            [
                8174,
                8284
            ],
            [
                8284,
                8311
            ],
            [
                8311,
                8373
            ],
            [
                8373,
                8600
            ],
            [
                8600,
                8632
            ],
            [
                8632,
                8644
            ],
            [
                8644,
                8700
            ],
            [
                8700,
                8802
            ],
            [
                8802,
                9040
            ],
            [
                9040,
                9110
            ],
            [
                9110,
                9281
            ],
            [
                9281,
                9503
            ],
            [
                9503,
                9743
            ],
            [
                9743,
                9834
            ],
            [
                9834,
                9861
            ],
            [
                9861,
                9953
            ],
            [
                9953,
                9973
            ],
            [
                9973,
                10117
            ],
            [
                10117,
                10156
            ],
            [
                10156,
                10211
            ],
            [
                10211,
                10321
            ],
            [
                10321,
                10470
            ],
            [
                10470,
                10522
            ],
            [
                10522,
                10560
            ],
            [
                10560,
                10678
            ],
            [
                10678,
                10707
            ],
            [
                10707,
                11003
            ],
            [
                11003,
                11337
            ],
            [
                11337,
                11574
            ],
            [
                11574,
                11923
            ],
            [
                11923,
                12066
            ],
            [
                12066,
                12135
            ],
            [
                12135,
                12492
            ],
            [
                12492,
                12895
            ],
            [
                12895,
                13128
            ],
            [
                13128,
                13436
            ],
            [
                13436,
                13846
            ],
            [
                13846,
                13857
            ],
            [
                13857,
                13955
            ],
            [
                13955,
                13965
            ],
            [
                13965,
                13978
            ],
            [
                13978,
                14163
            ],
            [
                14163,
                14280
            ],
            [
                14280,
                14516
            ],
            [
                14516,
                14660
            ],
            [
                14660,
                14712
            ],
            [
                14712,
                14734
            ],
            [
                14734,
                14819
            ],
            [
                14819,
                14859
            ],
            [
                14859,
                14910
            ],
            [
                14910,
                14945
            ],
            [
                14945,
                14991
            ],
            [
                14991,
                15067
            ],
            [
                15067,
                15115
            ],
            [
                15115,
                15144
            ],
            [
                15144,
                15271
            ],
            [
                15271,
                15436
            ],
            [
                15436,
                15490
            ],
            [
                15490,
                15524
            ],
            [
                15524,
                15616
            ],
            [
                15616,
                15621
            ],
            [
                15621,
                15725
            ],
            [
                15725,
                15821
            ],
            [
                15821,
                15852
            ],
            [
                15852,
                16008
            ],
            [
                16008,
                16131
            ],
            [
                16131,
                16141
            ],
            [
                16141,
                16156
            ],
            [
                16156,
                16275
            ],
            [
                16275,
                16348
            ],
            [
                16348,
                16456
            ],
            [
                16456,
                16532
            ],
            [
                16532,
                16559
            ],
            [
                16559,
                16570
            ],
            [
                16570,
                16695
            ],
            [
                16695,
                16710
            ],
            [
                16710,
                16802
            ],
            [
                16802,
                16843
            ],
            [
                16843,
                16885
            ],
            [
                16885,
                16969
            ],
            [
                16969,
                17350
            ]
        ]
    },
    "abridged": {
        "text": "The next afternoon they travelled on the railway to Heston. Heston was one long straggling street, running parallel to the seashore. It was different from the little bathing-places in the south of England: to use a Scotch word, everything looked more 'purposelike.' The people looked busier; the colours looked greyer. In such towns in the south of England, Margaret had seen shopmen lounging at their doors to look up and down the street. Here, if they had any leisure, they busied themselves in the shop - even, Margaret fancied, to the unnecessary unrolling and rerolling of ribbons. All these differences struck her, as she and her mother went out next morning to look for lodgings.\nTwo nights in hotels had cost more than anticipated, and they were glad to take the first clean, cheerful rooms they found. There, for the first time for many days, Margaret felt at rest. There was a dreaminess which made it still more perfect and luxurious. The distant sea, lapping the sandy shore; the cries of the donkey-boys; the stroll down to the beach to breathe the sea-air, soft and warm even at the end of November; the great long misty sea-line touching the sky; the white sail of a distant boat turning silver in some pale sunbeam: she felt she could dream her life away here, without thinking of the past or future.\nBut the future must be met, however stern and iron it might be. One evening it was arranged that Margaret and her father should go the next day to Milton-Northern, and look for a house. Mr. Hale was anxious to see Mr. Thornton and ascertain his position. Margaret had a repugnance to the idea of a manufacturing town, and would willingly have put off the expedition.\nFor several miles before they reached Milton, they saw a deep lead-coloured cloud hanging over the horizon above it, contrasting with the pale wintry sky. Nearer to the town, the air had a faint taste and smell of smoke. They were whirled over long, straight, hopeless streets of small brick houses. Here and there a great oblong many-windowed factory stood up, like a hen among her chickens, puffing out black smoke, and accounting for the cloud.\nAs they drove through the streets, they had to stop constantly; loaded lorries blocked up the thoroughfares. Margaret had now and then been into the city of London in her drives with her aunt. But there the heavy lumbering vehicles seemed to have various purposes; here, every van, wagon and truck bore cotton, either raw in bags, or woven, in the form of bales of calico. People thronged the footpaths, most of them well-dressed as regarded the material, but with a slovenly looseness which struck Margaret as different from the shabby, threadbare smartness of a similar class in London.\n'New Street,' said Mr. Hale. 'This, Bell tells me, is the main street in Milton. It was the making of this street into a great thoroughfare, thirty years ago, which has caused his property to rise so much in value. Mr. Thornton's mill must be nearby, for he is Mr. Bell's tenant. Before we look for those houses we marked in the Milton Times, I will see if there is any letter for me at our hotel from Mr. Thornton. He said he would let me know anything he might hear about the houses.'\nThere were no letters awaiting him, so they set out on their house-hunting. Thirty pounds a year was all they could afford, but in Hampshire they could have found a roomy house and pleasant garden for the money. Here, even the necessary two sitting-rooms and four bed-rooms seemed unattainable. They went through their list, rejecting each as they visited it. Then they looked at each other in dismay.\n'We must go back to the second, I think,' said Margaret. 'That one in the suburb of Crampton? There were three sitting-rooms; don't you remember how we laughed at the number compared with the three bedrooms? But I have planned it all. The front room downstairs is to be your study and our dining-room, for mamma is to have the cheerful sitting-room; and that room upstairs, with the atrocious blue and pink paper, had a pretty view of the plain with the river, or canal, or whatever it is, down below. Then I could have the little bedroom behind - over the kitchen - and you and mamma the room behind the drawing-room.'\n'But Dixon, and a servant-girl?'\n'Wait a minute. Dixon is to have, let me see - the back sitting-room. I think she will like that. And the girl can have that sloping attic over your room and mamma's. Won't that do?'\n'I dare say it will. But the wallpapers. What taste!'\n'Never mind, papa! Surely you can charm the landlord into re-papering the drawing-room and your bedroom; and your book-shelves will hide a great deal of that gaudy pattern in the dining-room.'\n'Then you think it the best? If so, I had better go and call on the landlord. I will take you back to the hotel, where you can order lunch, and by the time it is ready, I shall be with you. I hope I shall be able to get new wallpaper.'\nHer father took her through the entrance of the hotel, and went away. Just as Margaret was entering their sitting-room, she was addressed by a waiter:\n'I beg your pardon, ma'am. I had no time to tell the gentleman. Mr. Thornton called directly after you left; and, as I understood you would be back in an hour, I told him so, and he came again five minutes ago, and said he would wait for Mr. Hale. He is in your room now, ma'am.'\n'Thank you. My father will return soon.' Margaret opened the door and went in; straight, fearless and dignified, as usual. She felt no awkwardness; here was a person come on business to her father; and she would treat him with civility.\nMr. Thornton was a good deal more surprised and discomfited than she. Instead of a quiet, middle-aged clergyman, a young lady came forward with frank dignity - a young lady of a different type to those he was in the habit of seeing. Her dress was very plain: a close straw bonnet of the best material; a dark silk gown, without any trimming; a large Indian shawl, which she wore as an empress wears her drapery. He did not understand who she was, as he caught the simple, straight, unabashed look. He had heard that Mr. Hale had a daughter, but he had imagined that she was a little girl; and his words would not come.\n'Mr. Thornton, I believe!' said Margaret, after a pause. 'Will you sit down? Unfortunately my father was not told that you were here, and he has gone away on some business. But he will come back soon. I am sorry you have had the trouble of calling twice.'\nMr. Thornton was in the habit of authority himself, but she seemed to assume some kind of rule over him. He calmly took a seat at her bidding.\n'Do you know where Mr. Hale has gone? Perhaps I might be able to find him.'\n'He has gone to a Mr. Donkin's; the landlord of the house my father wishes to take in Crampton.'\nMr. Thornton knew the house. He had seen the advertisement, and been to look at it, in compliance with a request of Mr. Bell's: and also because of his own interest in Mr. Hale's circumstances. Mr. Thornton had thought that the house in Crampton, despite a certain vulgarity, was really just the thing; but now that he saw Margaret, with her superb ways of moving and looking, he began to feel ashamed of having imagined that it would do very well for the Hales.\nMargaret could not help her looks; but the short curled upper lip, the round, up-turned chin, the manner of carrying her head, and her movements, full of a soft feminine defiance, always gave strangers the impression of haughtiness. She was tired now, and would rather have rested; but she owed it to herself to speak courteously to this stranger. She wished that he would go, instead of sitting there, curtly answering all her remarks.\nShe had taken off her shawl, and sat facing the light. Her full beauty met his eye; her round white throat rising out of the lithe figure; her moving lips not breaking the cold serene look of her face; her eyes meeting his with quiet freedom. He almost said to himself that he did not like her. While he looked upon her with admiration, she looked at him with proud indifference, taking him, he thought, for what he was - a great rough fellow, with not a refinement about him. Her quiet coldness he interpreted as contempt, and resented it so much that he was almost inclined to get up and go away, and have nothing more to do with these supercilious Hales.\nJust as Margaret had exhausted her last subject of conversation, her father came in, and with a pleasant gentlemanly apology reinstated his family in Mr. Thornton's good opinion. The two men had much to say about their mutual friend, Mr. Bell; and Margaret, glad that her part of entertaining the visitor was over, went to the window and was gazing out at the street, when her father spoke to her:\n'Margaret! the landlord will persist in admiring that hideous paper, and I am afraid we must let it remain.'\n'Oh dear! I am sorry!' she replied, and began to consider if she could hide part of it, at least, with some of her sketches. Her father, meanwhile, was pressing Mr. Thornton to stay to luncheon. It would have been very inconvenient to him to do so, yet he felt that he should accept, if Margaret also invited him. She did not, and he was glad, yet irritated at her. She gave him a low, grave bow when he left, and he felt more awkward and self-conscious than he had ever done in his life.\n'Well, Margaret, now to luncheon. Mr. Thornton must have been waiting a long time, I'm afraid.'\n'It seemed exceedingly long to me. I was just at the last gasp when you came in. He gave such short, abrupt answers.'\n'Very much to the point though, I should think. He is a clearheaded fellow. He said that Crampton is on gravelly soil, and by far the most healthy suburb near Milton.'\nWhen they returned to Heston, Mrs. Hale was full of questions. 'And what is Mr. Thornton like?'\n'Ask Margaret,' said her husband. 'She and he had a long attempt at conversation, while I was away speaking to the landlord.'\n'Oh! I hardly know what he is like,' said Margaret lazily. 'He is a tall, broad-shouldered man, about - how old, papa?'\n'I should guess about thirty.'\n'About thirty - neither exactly plain, nor handsome, nothing remarkable - not quite a gentleman; but that was hardly to be expected.'\n'Not vulgar or common though,' put in her father.\n'Oh, no!' said Margaret. 'With such an expression of resolution and power, no face could be vulgar or common. I should not like to have to bargain with him; he looks very inflexible. Altogether he seems made for his niche, mamma; sagacious, and strong, as becomes a great tradesman.'\n'Don't call the Milton manufacturers tradesmen, Margaret,' said her father. 'They are very different.'\n'Are they? If you think the term is not correct, papa, I won't use it. But, oh mamma! speaking of vulgarity, you must prepare yourself for our drawing-room paper. Pink and blue roses, with yellow leaves!'\nBut when they moved to their new house in Milton, the obnoxious wallpaper was gone. The landlord let them think that he had relented; there was no need to tell them that what he did not care to do for an unknown Mr. Hale, he was only too glad to do at the short sharp remonstrance of Mr. Thornton, the wealthy manufacturer.",
        "paragraph_chars": [
            [
                0,
                687
            ],
            [
                687,
                1317
            ],
            [
                1317,
                1684
            ],
            [
                1684,
                2132
            ],
            [
                2132,
                2721
            ],
            [
                2721,
                3208
            ],
            [
                3208,
                3610
            ],
            [
                3610,
                4230
            ],
            [
                4230,
                4263
            ],
            [
                4263,
                4446
            ],
            [
                4446,
                4500
            ],
            [
                4500,
                4693
            ],
            [
                4693,
                4929
            ],
            [
                4929,
                5080
            ],
            [
                5080,
                5360
            ],
            [
                5360,
                5597
            ],
            [
                5597,
                6216
            ],
            [
                6216,
                6472
            ],
            [
                6472,
                6615
            ],
            [
                6615,
                6691
            ],
            [
                6691,
                6788
            ],
            [
                6788,
                7251
            ],
            [
                7251,
                7688
            ],
            [
                7688,
                8346
            ],
            [
                8346,
                8744
            ],
            [
                8744,
                8853
            ],
            [
                8853,
                9342
            ],
            [
                9342,
                9438
            ],
            [
                9438,
                9556
            ],
            [
                9556,
                9724
            ],
            [
                9724,
                9820
            ],
            [
                9820,
                9946
            ],
            [
                9946,
                10066
            ],
            [
                10066,
                10097
            ],
            [
                10097,
                10231
            ],
            [
                10231,
                10281
            ],
            [
                10281,
                10565
            ],
            [
                10565,
                10668
            ],
            [
                10668,
                10873
            ],
            [
                10873,
                11196
            ]
        ],
        "segment_chars": [
            [
                0,
                60
            ],
            [
                60,
                133
            ],
            [
                133,
                266
            ],
            [
                266,
                319
            ],
            [
                319,
                440
            ],
            [
                440,
                587
            ],
            [
                587,
                687
            ],
            [
                687,
                811
            ],
            [
                811,
                875
            ],
            [
                875,
                946
            ],
            [
                946,
                1317
            ],
            [
                1317,
                1381
            ],
            [
                1381,
                1503
            ],
            [
                1503,
                1572
            ],
            [
                1572,
                1684
            ],
            [
                1684,
                1839
            ],
            [
                1839,
                1905
            ],
            [
                1905,
                1984
            ],
            [
                1984,
                2132
            ],
            [
                2132,
                2241
            ],
            [
                2241,
                2325
            ],
            [
                2325,
                2505
            ],
            [
                2505,
                2721
            ],
            [
                2721,
                2750
            ],
            [
                2750,
                2802
            ],
            [
                2802,
                2936
            ],
            [
                2936,
                3001
            ],
            [
                3001,
                3137
            ],
            [
                3137,
                3208
            ],
            [
                3208,
                3284
            ],
            [
                3284,
                3420
            ],
            [
                3420,
                3503
            ],
            [
                3503,
                3568
            ],
            [
                3568,
                3610
            ],
            [
                3610,
                3667
            ],
            [
                3667,
                3704
            ],
            [
                3704,
                3818
            ],
            [
                3818,
                3845
            ],
            [
                3845,
                4112
            ],
            [
                4112,
                4230
            ],
            [
                4230,
                4263
            ],
            [
                4263,
                4279
            ],
            [
                4279,
                4333
            ],
            [
                4333,
                4361
            ],
            [
                4361,
                4430
            ],
            [
                4430,
                4446
            ],
            [
                4446,
                4467
            ],
            [
                4467,
                4487
            ],
            [
                4487,
                4500
            ],
            [
                4500,
                4519
            ],
            [
                4519,
                4693
            ],
            [
                4693,
                4722
            ],
            [
                4722,
                4771
            ],
            [
                4771,
                4883
            ],
            [
                4883,
                4929
            ],
            [
                4929,
                4999
            ],
            [
                4999,
                5080
            ],
            [
                5080,
                5107
            ],
            [
                5107,
                5144
            ],
            [
                5144,
                5328
            ],
            [
                5328,
                5360
            ],
            [
                5360,
                5372
            ],
            [
                5372,
                5401
            ],
            [
                5401,
                5483
            ],
            [
                5483,
                5597
            ],
            [
                5597,
                5667
            ],
            [
                5667,
                5830
            ],
            [
                5830,
                6009
            ],
            [
                6009,
                6095
            ],
            [
                6095,
                6216
            ],
            [
                6216,
                6221
            ],
            [
                6221,
                6243
            ],
            [
                6243,
                6273
            ],
            [
                6273,
                6293
            ],
            [
                6293,
                6389
            ],
            [
                6389,
                6417
            ],
            [
                6417,
                6472
            ],
            [
                6472,
                6577
            ],
            [
                6577,
                6615
            ],
            [
                6615,
                6653
            ],
            [
                6653,
                6691
            ],
            [
                6691,
                6788
            ],
            [
                6788,
                6817
            ],
            [
                6817,
                6982
            ],
            [
                6982,
                7251
            ],
            [
                7251,
                7484
            ],
            [
                7484,
                7599
            ],
            [
                7599,
                7688
            ],
            [
                7688,
                7743
            ],
            [
                7743,
                7931
            ],
            [
                7931,
                7983
            ],
            [
                7983,
                8165
            ],
            [
                8165,
                8346
            ],
            [
                8346,
                8525
            ],
            [
                8525,
                8744
            ],
            [
                8744,
                8755
            ],
            [
                8755,
                8853
            ],
            [
                8853,
                8863
            ],
            [
                8863,
                8876
            ],
            [
                8876,
                8978
            ],
            [
                8978,
                9048
            ],
            [
                9048,
                9167
            ],
            [
                9167,
                9219
            ],
            [
                9219,
                9342
            ],
            [
                9342,
                9376
            ],
            [
                9376,
                9438
            ],
            [
                9438,
                9473
            ],
            [
                9473,
                9519
            ],
            [
                9519,
                9556
            ],
            [
                9556,
                9604
            ],
            [
                9604,
                9632
            ],
            [
                9632,
                9724
            ],
            [
                9724,
                9787
            ],
            [
                9787,
                9820
            ],
            [
                9820,
                9854
            ],
            [
                9854,
                9946
            ],
            [
                9946,
                9951
            ],
            [
                9951,
                10005
            ],
            [
                10005,
                10066
            ],
            [
                10066,
                10097
            ],
            [
                10097,
                10231
            ],
            [
                10231,
                10281
            ],
            [
                10281,
                10291
            ],
            [
                10291,
                10306
            ],
            [
                10306,
                10391
            ],
            [
                10391,
                10464
            ],
            [
                10464,
                10565
            ],
            [
                10565,
                10641
            ],
            [
                10641,
                10668
            ],
            [
                10668,
                10679
            ],
            [
                10679,
                10739
            ],
            [
                10739,
                10754
            ],
            [
                10754,
                10831
            ],
            [
                10831,
                10873
            ],
            [
                10873,
                10957
            ],
            [
                10957,
                11196
            ]
        ],
        "overlap_chars": [
            [
                0,
                18
            ],
            [
                19,
                23
            ],
            [
                34,
                40
            ],
            [
                41,
                48
            ],
            [
                49,
                60
            ],
            [
                60,
                66
            ],
            [
                67,
                133
            ],
            [
                133,
                135
            ],
            [
                140,
                204
            ],
            [
                206,
                250
            ],
            [
                252,
                259
            ],
            [
                259,
                263
            ],
            [
                266,
                276
            ],
            [
                290,
                291
            ],
            [
                292,
                310
            ],
            [
                317,
                319
            ],
            [
                319,
                375
            ],
            [
                376,
                383
            ],
            [
                384,
                392
            ],
            [
                393,
                407
            ],
            [
                411,
                440
            ],
            [
                440,
                469
            ],
            [
                469,
                475
            ],
            [
                483,
                493
            ],
            [
                494,
                505
            ],
            [
                506,
                507
            ],
            [
                508,
                567
            ],
            [
                567,
                587
            ],
            [
                587,
                615
            ],
            [
                616,
                619
            ],
            [
                619,
                687
            ],
            [
                687,
                697
            ],
            [
                701,
                726
            ],
            [
                727,
                803
            ],
            [
                809,
                811
            ],
            [
                811,
                851
            ],
            [
                852,
                860
            ],
            [
                866,
                875
            ],
            [
                875,
                897
            ],
            [
                898,
                944
            ],
            [
                944,
                946
            ],
            [
                946,
                964
            ],
            [
                971,
                986
            ],
            [
                986,
                991
            ],
            [
                992,
                1016
            ],
            [
                1016,
                1084
            ],
            [
                1085,
                1089
            ],
            [
                1093,
                1156
            ],
            [
                1157,
                1231
            ],
            [
                1232,
                1235
            ],
            [
                1241,
                1270
            ],
            [
                1275,
                1276
            ],
            [
                1294,
                1305
            ],
            [
                1306,
                1308
            ],
            [
                1309,
                1317
            ],
            [
                1317,
                1370
            ],
            [
                1377,
                1381
            ],
            [
                1381,
                1489
            ],
            [
                1490,
                1503
            ],
            [
                1503,
                1511
            ],
            [
                1512,
                1526
            ],
            [
                1531,
                1543
            ],
            [
                1544,
                1547
            ],
            [
                1548,
                1557
            ],
            [
                1558,
                1570
            ],
            [
                1570,
                1572
            ],
            [
                1572,
                1580
            ],
            [
                1581,
                1638
            ],
            [
                1639,
                1659
            ],
            [
                1668,
                1682
            ],
            [
                1682,
                1684
            ],
            [
                1684,
                1790
            ],
            [
                1797,
                1799
            ],
            [
                1813,
                1826
            ],
            [
                1827,
                1837
            ],
            [
                1837,
                1839
            ],
            [
                1839,
                1903
            ],
            [
                1903,
                1905
            ],
            [
                1905,
                1963
            ],
            [
                1964,
                1969
            ],
            [
                1970,
                1975
            ],
            [
                1976,
                1982
            ],
            [
                1982,
                1984
            ],
            [
                1984,
                2094
            ],
            [
                2095,
                2105
            ],
            [
                2106,
                2130
            ],
            [
                2130,
                2131
            ],
            [
                2132,
                2157
            ],
            [
                2158,
                2165
            ],
            [
                2165,
                2195
            ],
            [
                2196,
                2202
            ],
            [
                2206,
                2225
            ],
            [
                2226,
                2241
            ],
            [
                2241,
                2285
            ],
            [
                2296,
                2325
            ],
            [
                2325,
                2370
            ],
            [
                2379,
                2386
            ],
            [
                2387,
                2395
            ],
            [
                2395,
                2401
            ],
            [
                2401,
                2402
            ],
            [
                2403,
                2413
            ],
            [
                2420,
                2429
            ],
            [
                2430,
                2449
            ],
            [
                2450,
                2453
            ],
            [
                2454,
                2465
            ],
            [
                2466,
                2471
            ],
            [
                2473,
                2479
            ],
            [
                2488,
                2505
            ],
            [
                2505,
                2721
            ],
            [
                2722,
                2732
            ],
            [
                2735,
                2750
            ],
            [
                2755,
                2756
            ],
            [
                2757,
                2761
            ],
            [
                2768,
                2770
            ],
            [
                2770,
                2778
            ],
            [
                2784,
                2801
            ],
            [
                2802,
                2812
            ],
            [
                2820,
                2834
            ],
            [
                2835,
                2936
            ],
            [
                2936,
                2963
            ],
            [
                2970,
                3001
            ],
            [
                3001,
                3007
            ],
            [
                3008,
                3010
            ],
            [
                3026,
                3062
            ],
            [
                3062,
                3063
            ],
            [
                3064,
                3070
            ],
            [
                3071,
                3090
            ],
            [
                3091,
                3104
            ],
            [
                3105,
                3107
            ],
            [
                3108,
                3111
            ],
            [
                3118,
                3135
            ],
            [
                3135,
                3136
            ],
            [
                3140,
                3194
            ],
            [
                3195,
                3198
            ],
            [
                3199,
                3205
            ],
            [
                3208,
                3242
            ],
            [
                3247,
                3284
            ],
            [
                3284,
                3299
            ],
            [
                3300,
                3330
            ],
            [
                3330,
                3364
            ],
            [
                3371,
                3420
            ],
            [
                3420,
                3444
            ],
            [
                3445,
                3503
            ],
            [
                3503,
                3568
            ],
            [
                3568,
                3572
            ],
            [
                3573,
                3577
            ],
            [
                3578,
                3610
            ],
            [
                3611,
                3649
            ],
            [
                3665,
                3667
            ],
            [
                3667,
                3669
            ],
            [
                3673,
                3676
            ],
            [
                3677,
                3679
            ],
            [
                3680,
                3690
            ],
            [
                3694,
                3702
            ],
            [
                3702,
                3704
            ],
            [
                3704,
                3807
            ],
            [
                3816,
                3818
            ],
            [
                3818,
                3845
            ],
            [
                3845,
                3859
            ],
            [
                3871,
                3910
            ],
            [
                3910,
                3911
            ],
            [
                3912,
                3915
            ],
            [
                3916,
                3932
            ],
            [
                3937,
                3945
            ],
            [
                3946,
                3958
            ],
            [
                3958,
                3968
            ],
            [
                3969,
                3973
            ],
            [
                3982,
                4022
            ],
            [
                4022,
                4027
            ],
            [
                4028,
                4041
            ],
            [
                4042,
                4044
            ],
            [
                4045,
                4054
            ],
            [
                4055,
                4059
            ],
            [
                4064,
                4112
            ],
            [
                4112,
                4140
            ],
            [
                4149,
                4155
            ],
            [
                4156,
                4157
            ],
            [
                4158,
                4174
            ],
            [
                4175,
                4176
            ],
            [
                4177,
                4227
            ],
            [
                4231,
                4245
            ],
            [
                4256,
                4260
            ],
            [
                4264,
                4279
            ],
            [
                4279,
                4295
            ],
            [
                4295,
                4296
            ],
            [
                4297,
                4307
            ],
            [
                4310,
                4333
            ],
            [
                4333,
                4361
            ],
            [
                4361,
                4373
            ],
            [
                4378,
                4430
            ],
            [
                4430,
                4443
            ],
            [
                4447,
                4467
            ],
            [
                4467,
                4474
            ],
            [
                4479,
                4487
            ],
            [
                4487,
                4497
            ],
            [
                4501,
                4519
            ],
            [
                4519,
                4569
            ],
            [
                4570,
                4595
            ],
            [
                4603,
                4690
            ],
            [
                4699,
                4722
            ],
            [
                4722,
                4744
            ],
            [
                4745,
                4756
            ],
            [
                4757,
                4760
            ],
            [
                4769,
                4771
            ],
            [
                4771,
                4836
            ],
            [
                4837,
                4883
            ],
            [
                4883,
                4916
            ],
            [
                4929,
                4987
            ],
            [
                4988,
                4992
            ],
            [
                4997,
                4999
            ],
            [
                4999,
                5015
            ],
            [
                5029,
                5056
            ],
            [
                5067,
                5071
            ],
            [
                5072,
                5080
            ],
            [
                5081,
                5107
            ],
            [
                5107,
                5128
            ],
            [
                5129,
                5142
            ],
            [
                5142,
                5144
            ],
            [
                5144,
                5163
            ],
            [
                5164,
                5192
            ],
            [
                5192,
                5193
            ],
            [
                5194,
                5209
            ],
            [
                5210,
                5272
            ],
            [
                5273,
                5328
            ],
            [
                5328,
                5357
            ],
            [
                5367,
                5372
            ],
            [
                5372,
                5398
            ],
            [
                5401,
                5437
            ],
            [
                5439,
                5457
            ],
            [
                5462,
                5471
            ],
            [
                5471,
                5472
            ],
            [
                5481,
                5483
            ],
            [
                5483,
                5507
            ],
            [
                5508,
                5561
            ],
            [
                5562,
                5565
            ],
            [
                5572,
                5586
            ],
            [
                5587,
                5596
            ],
            [
                5597,
                5667
            ],
            [
                5667,
                5754
            ],
            [
                5757,
                5792
            ],
            [
                5793,
                5830
            ],
            [
                5830,
                5897
            ],
            [
                5915,
                5916
            ],
            [
                5937,
                5960
            ],
            [
                5961,
                6009
            ],
            [
                6009,
                6093
            ],
            [
                6093,
                6095
            ],
            [
                6095,
                6184
            ],
            [
                6214,
                6216
            ],
            [
                6219,
                6220
            ],
            [
                6221,
                6240
            ],
            [
                6243,
                6265
            ],
            [
                6266,
                6271
            ],
            [
                6271,
                6273
            ],
            [
                6274,
                6291
            ],
            [
                6307,
                6316
            ],
            [
                6317,
                6389
            ],
            [
                6389,
                6410
            ],
            [
                6415,
                6417
            ],
            [
                6417,
                6469
            ],
            [
                6472,
                6491
            ],
            [
                6502,
                6575
            ],
            [
                6575,
                6577
            ],
            [
                6577,
                6615
            ],
            [
                6619,
                6633
            ],
            [
                6634,
                6651
            ],
            [
                6651,
                6653
            ],
            [
                6653,
                6688
            ],
            [
                6692,
                6719
            ],
            [
                6723,
                6785
            ],
            [
                6788,
                6817
            ],
            [
                6817,
                6914
            ],
            [
                6914,
                6924
            ],
            [
                6933,
                6935
            ],
            [
                6936,
                6955
            ],
            [
                6956,
                6964
            ],
            [
                6967,
                6980
            ],
            [
                6980,
                6982
            ],
            [
                6982,
                7033
            ],
            [
                7033,
                7034
            ],
            [
                7043,
                7062
            ],
            [
                7064,
                7249
            ],
            [
                7249,
                7251
            ],
            [
                7251,
                7328
            ],
            [
                7329,
                7377
            ],
            [
                7382,
                7484
            ],
            [
                7484,
                7512
            ],
            [
                7513,
                7524
            ],
            [
                7531,
                7536
            ],
            [
                7537,
                7545
            ],
            [
                7546,
                7548
            ],
            [
                7549,
                7559
            ],
            [
                7560,
                7580
            ],
            [
                7581,
                7597
            ],
            [
                7597,
                7599
            ],
            [
                7599,
                7627
            ],
            [
                7628,
                7653
            ],
            [
                7654,
                7658
            ],
            [
                7661,
                7670
            ],
            [
                7671,
                7674
            ],
            [
                7679,
                7686
            ],
            [
                7686,
                7687
            ],
            [
                7688,
                7720
            ],
            [
                7732,
                7735
            ],
            [
                7741,
                7743
            ],
            [
                7743,
                7787
            ],
            [
                7788,
                7812
            ],
            [
                7813,
                7830
            ],
            [
                7831,
                7837
            ],
            [
                7838,
                7842
            ],
            [
                7843,
                7888
            ],
            [
                7888,
                7898
            ],
            [
                7899,
                7921
            ],
            [
                7922,
                7931
            ],
            [
                7931,
                7981
            ],
            [
                7983,
                8012
            ],
            [
                8013,
                8023
            ],
            [
                8023,
                8100
            ],
            [
                8101,
                8107
            ],
            [
                8110,
                8142
            ],
            [
                8143,
                8165
            ],
            [
                8165,
                8183
            ],
            [
                8184,
                8198
            ],
            [
                8202,
                8210
            ],
            [
                8210,
                8227
            ],
            [
                8248,
                8254
            ],
            [
                8264,
                8325
            ],
            [
                8326,
                8338
            ],
            [
                8339,
                8344
            ],
            [
                8344,
                8346
            ],
            [
                8346,
                8409
            ],
            [
                8409,
                8410
            ],
            [
                8411,
                8439
            ],
            [
                8442,
                8462
            ],
            [
                8463,
                8470
            ],
            [
                8471,
                8485
            ],
            [
                8486,
                8524
            ],
            [
                8525,
                8528
            ],
            [
                8537,
                8540
            ],
            [
                8541,
                8545
            ],
            [
                8546,
                8552
            ],
            [
                8559,
                8679
            ],
            [
                8680,
                8683
            ],
            [
                8684,
                8687
            ],
            [
                8702,
                8712
            ],
            [
                8712,
                8713
            ],
            [
                8714,
                8718
            ],
            [
                8719,
                8729
            ],
            [
                8730,
                8742
            ],
            [
                8742,
                8744
            ],
            [
                8749,
                8755
            ],
            [
                8755,
                8850
            ],
            [
                8854,
                8863
            ],
            [
                8863,
                8873
            ],
            [
                8876,
                8901
            ],
            [
                8929,
                8950
            ],
            [
                8956,
                8976
            ],
            [
                8976,
                8978
            ],
            [
                8978,
                8999
            ],
            [
                8999,
                9046
            ],
            [
                9046,
                9048
            ],
            [
                9048,
                9128
            ],
            [
                9135,
                9148
            ],
            [
                9167,
                9183
            ],
            [
                9184,
                9195
            ],
            [
                9197,
                9200
            ],
            [
                9201,
                9217
            ],
            [
                9217,
                9219
            ],
            [
                9219,
                9306
            ],
            [
                9307,
                9340
            ],
            [
                9340,
                9342
            ],
            [
                9343,
                9374
            ],
            [
                9374,
                9376
            ],
            [
                9389,
                9423
            ],
            [
                9425,
                9435
            ],
            [
                9439,
                9473
            ],
            [
                9473,
                9519
            ],
            [
                9519,
                9521
            ],
            [
                9522,
                9526
            ],
            [
                9532,
                9553
            ],
            [
                9562,
                9604
            ],
            [
                9604,
                9617
            ],
            [
                9617,
                9632
            ],
            [
                9632,
                9639
            ],
            [
                9640,
                9709
            ],
            [
                9715,
                9721
            ],
            [
                9724,
                9753
            ],
            [
                9754,
                9763
            ],
            [
                9764,
                9785
            ],
            [
                9785,
                9786
            ],
            [
                9788,
                9799
            ],
            [
                9800,
                9812
            ],
            [
                9813,
                9817
            ],
            [
                9821,
                9833
            ],
            [
                9836,
                9854
            ],
            [
                9859,
                9943
            ],
            [
                9947,
                9951
            ],
            [
                9951,
                9980
            ],
            [
                9983,
                9996
            ],
            [
                9997,
                10003
            ],
            [
                10003,
                10005
            ],
            [
                10006,
                10047
            ],
            [
                10050,
                10063
            ],
            [
                10067,
                10094
            ],
            [
                10098,
                10110
            ],
            [
                10113,
                10139
            ],
            [
                10140,
                10168
            ],
            [
                10171,
                10228
            ],
            [
                10232,
                10259
            ],
            [
                10262,
                10279
            ],
            [
                10279,
                10281
            ],
            [
                10282,
                10288
            ],
            [
                10291,
                10306
            ],
            [
                10307,
                10363
            ],
            [
                10364,
                10372
            ],
            [
                10373,
                10391
            ],
            [
                10391,
                10464
            ],
            [
                10464,
                10474
            ],
            [
                10478,
                10562
            ],
            [
                10569,
                10621
            ],
            [
                10624,
                10641
            ],
            [
                10647,
                10665
            ],
            [
                10669,
                10679
            ],
            [
                10679,
                10739
            ],
            [
                10739,
                10754
            ],
            [
                10754,
                10775
            ],
            [
                10775,
                10831
            ],
            [
                10831,
                10870
            ],
            [
                10873,
                10886
            ],
            [
                10893,
                10936
            ],
            [
                10951,
                10957
            ],
            [
                10957,
                10969
            ],
            [
                10970,
                10984
            ],
            [
                10985,
                11005
            ],
            [
                11005,
                11006
            ],
            [
                11007,
                11019
            ],
            [
                11020,
                11037
            ],
            [
                11038,
                11073
            ],
            [
                11077,
                11084
            ],
            [
                11085,
                11093
            ],
            [
                11093,
                11128
            ],
            [
                11129,
                11196
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                60
            ],
            [
                60,
                133
            ],
            [
                133,
                266
            ],
            [
                266,
                319
            ],
            [
                319,
                319
            ],
            [
                319,
                440
            ],
            [
                440,
                587
            ],
            [
                587,
                687
            ],
            [
                687,
                811
            ],
            [
                811,
                875
            ],
            [
                875,
                946
            ],
            [
                946,
                1317
            ],
            [
                1317,
                1381
            ],
            [
                1381,
                1503
            ],
            [
                1503,
                1572
            ],
            [
                1572,
                1684
            ],
            [
                1684,
                1839
            ],
            [
                1839,
                1905
            ],
            [
                1905,
                1984
            ],
            [
                1984,
                2132
            ],
            [
                2132,
                2241
            ],
            [
                2241,
                2325
            ],
            [
                2325,
                2505
            ],
            [
                2505,
                2721
            ],
            [
                2721,
                2750
            ],
            [
                2750,
                2802
            ],
            [
                2802,
                2936
            ],
            [
                2936,
                3001
            ],
            [
                3001,
                3001
            ],
            [
                3001,
                3001
            ],
            [
                3001,
                3001
            ],
            [
                3001,
                3208
            ],
            [
                3208,
                3208
            ],
            [
                3208,
                3284
            ],
            [
                3284,
                3420
            ],
            [
                3420,
                3503
            ],
            [
                3503,
                3568
            ],
            [
                3568,
                3610
            ],
            [
                3610,
                3667
            ],
            [
                3667,
                3704
            ],
            [
                3704,
                3818
            ],
            [
                3818,
                3845
            ],
            [
                3845,
                4112
            ],
            [
                4112,
                4230
            ],
            [
                4230,
                4263
            ],
            [
                4263,
                4279
            ],
            [
                4279,
                4279
            ],
            [
                4279,
                4333
            ],
            [
                4333,
                4361
            ],
            [
                4361,
                4430
            ],
            [
                4430,
                4446
            ],
            [
                4446,
                4467
            ],
            [
                4467,
                4487
            ],
            [
                4487,
                4500
            ],
            [
                4500,
                4500
            ],
            [
                4500,
                4519
            ],
            [
                4519,
                4693
            ],
            [
                4693,
                4722
            ],
            [
                4722,
                4771
            ],
            [
                4771,
                4883
            ],
            [
                4883,
                4929
            ],
            [
                4929,
                4929
            ],
            [
                4929,
                4929
            ],
            [
                4929,
                4999
            ],
            [
                4999,
                5080
            ],
            [
                5080,
                5107
            ],
            [
                5107,
                5144
            ],
            [
                5144,
                5328
            ],
            [
                5328,
                5360
            ],
            [
                5360,
                5372
            ],
            [
                5372,
                5401
            ],
            [
                5401,
                5483
            ],
            [
                5483,
                5597
            ],
            [
                5597,
                5667
            ],
            [
                5667,
                5830
            ],
            [
                5830,
                6009
            ],
            [
                6009,
                6095
            ],
            [
                6095,
                6216
            ],
            [
                6216,
                6243
            ],
            [
                6243,
                6273
            ],
            [
                6273,
                6293
            ],
            [
                6293,
                6389
            ],
            [
                6389,
                6417
            ],
            [
                6417,
                6472
            ],
            [
                6472,
                6577
            ],
            [
                6577,
                6615
            ],
            [
                6615,
                6653
            ],
            [
                6653,
                6691
            ],
            [
                6691,
                6788
            ],
            [
                6788,
                6817
            ],
            [
                6817,
                6982
            ],
            [
                6982,
                7251
            ],
            [
                7251,
                7484
            ],
            [
                7484,
                7599
            ],
            [
                7599,
                7688
            ],
            [
                7688,
                7743
            ],
            [
                7743,
                7931
            ],
            [
                7931,
                8165
            ],
            [
                8165,
                8346
            ],
            [
                8346,
                8525
            ],
            [
                8525,
                8744
            ],
            [
                8744,
                8755
            ],
            [
                8755,
                8853
            ],
            [
                8853,
                8863
            ],
            [
                8863,
                8876
            ],
            [
                8876,
                8978
            ],
            [
                8978,
                9048
            ],
            [
                9048,
                9219
            ],
            [
                9219,
                9342
            ],
            [
                9342,
                9376
            ],
            [
                9376,
                9376
            ],
            [
                9376,
                9376
            ],
            [
                9376,
                9376
            ],
            [
                9376,
                9438
            ],
            [
                9438,
                9473
            ],
            [
                9473,
                9519
            ],
            [
                9519,
                9556
            ],
            [
                9556,
                9604
            ],
            [
                9604,
                9632
            ],
            [
                9632,
                9724
            ],
            [
                9724,
                9787
            ],
            [
                9787,
                9820
            ],
            [
                9820,
                9854
            ],
            [
                9854,
                9946
            ],
            [
                9946,
                9951
            ],
            [
                9951,
                10005
            ],
            [
                10005,
                10066
            ],
            [
                10066,
                10097
            ],
            [
                10097,
                10231
            ],
            [
                10231,
                10281
            ],
            [
                10281,
                10291
            ],
            [
                10291,
                10306
            ],
            [
                10306,
                10391
            ],
            [
                10391,
                10464
            ],
            [
                10464,
                10565
            ],
            [
                10565,
                10641
            ],
            [
                10641,
                10668
            ],
            [
                10668,
                10679
            ],
            [
                10679,
                10739
            ],
            [
                10739,
                10754
            ],
            [
                10754,
                10831
            ],
            [
                10831,
                10873
            ],
            [
                10873,
                10873
            ],
            [
                10873,
                10957
            ],
            [
                10957,
                11196
            ]
        ]
    }
}