{
    "original": {
        "text": "\"And it's hame, hame, hame, Hame fain wad I be.\"\nIt needed the pretty light papering of the rooms to reconcile them to Milton. It needed more--more that could not be had. The thick yellow November fogs had come on; and the view of the plain in the valley, made by the sweeping bend of the river was all shut out when Mrs. Hale arrived at her new home.\nMargaret and Dixon had been at work two days, unpacking and arranging, but everything inside the house still looked in disorder; and outside a thick fog crept up to the very windows, and was driven in to every open door in choking white wreaths of unwholsome mist.\n\"Oh, Margaret! are we to live here?\" asked Mrs. Hale in blank dismay.\nMargaret's heart echoed the dreariness of the tone in which this question was put. She could scarcely command herself enough to say, \"Oh, the fogs in London are sometimes far worse!\"\n\"But then you knew that London itself, and friends lay behind it. Here--well! we are desolate. Oh Dixon, what a place this is!\"\n\"Indeed, ma'am, I'm sure it will be your death before long, and then I know who'll--stay! Miss Hale, that's far too heavy for you to lift.\"\n\"Not at all, thank you, Dixon,\" replied Margaret coldly. \"The best thing we can do for mamma is to get her room quite ready for her to go to bed, while I go and bring her a cup of coffee.\"\nMr. Hale was equally out of spirits, and equally came upon Margaret for sympathy.\n\"Margaret, I do believe this is an unhealthy place. Only suppose that your mother's health or yours should suffer. I wish I had gone into some country place in Wales; this is really terrible,\" said he, going up to the window.\nThere was no comfort to be given. They were settled in Milton, and must endure smoke and fogs for a season; indeed, all other life seemed shut out from them by as thick a fog of circumstance. Only the day before, Mr. Hale had been reckoning up with dismay how much their removal and fortnight at Heston had cost, and he found it had absorbed nearly all his little stock of ready money. No! here they were, and here they must remain.\nAt night when Margaret realised this, she felt inclined to sit down in a stupor of despair. The heavy smoky air hung about her bedroom, which occupied the long narrow projection at the back of the house. The window, placed at the side of the oblong, looked at the blank wall of a similar projection, not above ten feet distant. It loomed through the fog like a great barrier to hope. Inside the room everything was in confusion. All their efforts had been directed to make her mother's room comfortable. Margaret sat down on a box, the direction card upon which struck her as having been written at Helstone--beautiful, beloved Helstone! She lost herself in dismal thought: but at last she determined to take her mind away from the present; and suddenly remembered that she had a letter from Edith which she had only half read in the bustle of the morning. It was to tell of their arrival at Corfu; their voyage along the Mediterranean--their music, and dancing on board ship; the gay new life opening upon her; her house with its trellised balcony, and its views over white cliffs and deep blue sea.\nEdith wrote fluently and well, if not graphically. She could not only seize the salient and characteristic points of a scene, but she could enumerate enough of indiscriminate particular for Margaret to make it out for herself. Captain Lennox and another lately married officer shared a villa, high up on the beautiful precipitous rocks overhanging the sea. Their days, late as it was in the year, seemed spent in boating or land-picnics; all out-of-doors, pleasure-seeking and glad, Edith's life seemed like the deep vault of blue sky above her, free--utterly free from fleck or cloud. Her husband had to attend drill, and she, the most musical officer's wife there, had to copy the new and popular tunes out of the most recent English music, for the benefit of the bandmaster; those seemed their most severe and arduous duties. She expressed an affectionate hope that, if the regiment stopped another year at Corfu, Margaret might come out and pay her a long visit. She asked Margaret if she remembered the day twelve-month on which she, Edith, wrote--how it rained all day long in Harley Street; and how she would not put on her new gown to go to a stupid dinner, and get it all wet and splashed in going to the carriage; and how at that very dinner they had first met Captain Lennox.\nYes! Margaret remembered it well. Edith and Mrs. Shaw had gone to dinner. Margaret had joined the party in the evening. The recollection of the plentiful luxury of all arrangements, the stately handsomeness of the furniture, the size of the house, the peaceful, untroubled ease of the visitors--all came vividly before her, in strange contrast to the present time. The smooth sea of that old life closed up, without a mark left to tell where they had all been. The habitual dinners, the calls, the dancing evenings, were all going on, going on for ever, though her Aunt Shaw and Edith were no longer there; and she, of course, was even less missed. She doubted if any one of that old set ever thought of her, except Henry Lennox. He too, she knew, would strive to forget her, because of the pain she had caused him. She had heard him often boast of his power of putting any disagreeable thought far away from him. Then she penetrated farther into what might have been. If she had cared for him as a lover, and had accepted him, and this change in her father's opinions and consequent station had taken place, she could not doubt but that it would have been impatiently received by Mr. Lennox. It was a bitter mortification to her in one sense; but she could bear it patiently, because she knew her father's purity of purpose, and that strengthened her to endure his errors, grave and serious though in her estimation they were. But the fact of the world esteeming her father degraded, in its rough wholesale judgment, would have oppressed and irritated Mr. Lennox. As she realised what might have been, she grew to be thankful for what was. They were at the lowest now; they could not be worse. Edith's astonishment and her Aunt Shaw's dismay would have to be met bravely, when their letters came. So Margaret rose up and began slowly to undress herself, feeling the full luxury of acting leisurely, late as it was, after all the past hurry of the day. She fell asleep, hoping for some brightness, either internal or external. But if she had known how long it would be before the brightness came, her heart would have sunk low down. The time of the year was most unpropitious to health as well as to spirits. Her mother caught a severe cold, and Dixon herself was evidently not well, although Margaret could not insult her more than by trying to save her, or by taking any care of her. They could hear of no girl to assist her; all were at work in the factories; at least, those who applied were well scolded by Dixon, for thinking that such as they could ever be trusted to work in a gentleman's house. So they had to keep a charwoman in almost constant employ. Margaret longed to send for Charlotte; but besides the objection of her being a better servant than they now could afford to keep, the distance was too great.\nMr. Hale met with several pupils, recommended to him by Mr. Bell, or by the more immediate influence of Mr. Thornton. They were mostly of the age when many boys would be still at school, but, according to the prevalent, and, apparently well-founded notions of Milton, to make a lad into a good tradesman he must be caught young, and acclimated to the life of the mill, or office, or warehouse. If he were sent to even the Scotch Universities, he came back unsettled for commercial pursuits: how much more so if he went to Oxford or Cambridge, where he could not be entered till he was eighteen? So most of the manufacturers placed their sons in situations at from fourteen or fifteen years of age, unsparingly cutting away all off-shoots in the direction of literature or high mental cultivation, in hopes of throwing the whole strength and vigour of the plant into commerce. Still there were some wiser parents; and some who had sense enough to perceive their own deficiencies, and strive to remedy them. Nay, there were a few no longer youths, but men in the prime of life, who had the stern wisdom to acknowledge their own ignorance, and to learn late what they should have learnt early. Mr. Thornton was perhaps the oldest of Mr. Hale's pupils. He was certainly the favourite. Mr. Hale got into the habit of quoting his opinions so frequently, and with such regard, that it became a little domestic joke to wonder what time, during the hour appointed for instruction, could be given to absolute learning, so much of it appeared to have been spent in conversation.\nMargaret rather encouraged this light, merry way of viewing her father's acquaintance with Mr. Thornton, because she felt that her mother was inclined to look upon this new friendship of her husband's with jealous eyes. As long as his time had been solely occupied with his books and his parishioners, as at Helstone, she had appeared to care little whether she saw much of him or not; but now that he looked eagerly forward to each renewal of his intercourse with Mr. Thornton, she seemed hurt and annoyed, as if he were slighting her companionship for the first time. Mr. Hale's over-praise had the usual effect of over-praise upon his auditors; they were a little inclined to rebel against Aristides being always called the Just.\nAfter a quiet life in a country parsonage for more than twenty years, there was something dazzling to Mr. Hale in the energy which conquered immense difficulties with ease; the power of the machinery of Milton, the power of the men of Milton, impressed him with a sense of grandeur, which he yielded to without caring to inquire into the details of its exercise. But Margaret went less abroad, among machinery and men; saw less of power in its public effect, and, as it happened, she was thrown with one or two of those who, in all measures affecting masses of people, must be acute sufferers for the good of many. The question always is, has everything been done to make the sufferings of these exceptions as small as possible? or, in the triumph of the crowded procession, have the helpless been trampled on, instead of being gently lifted aside out of the roadway of the conqueror, whom they have no power to accompany on his march?\nIt fell to Margaret's share to have to look out for a servant to assist Dixon, who had at first undertaken to find just the person she wanted to do all the rough work of the house. But Dixon's ideas of helpful girls were founded on the recollection of tidy elder scholars at Helstone school, who were only too proud to be allowed to come to the parsonage on a busy day, and treated Mrs. Dixon with all the respect, and a good deal more of fright, which they paid to Mr. and Mrs. Hale. Dixon was not unconscious of this awed reverence which was given to her; nor did she dislike it: it flattered her much as Louis the Fourteenth was flattered by his courtiers shading their eyes from the dazzling light of his presence. But nothing short of her faithful love for Mrs. Hale could have made her endure the rough independent way in which all the Milton girls, who made application for the servant's place, replied to her inquiries respecting their qualifications. They even went the length of questioning her back again; having doubts and fears of their own, as to the solvency of a family who lived in a house of thirty pounds a-year, and yet gave themselves airs, and kept two servants, one of them so very high and mighty. Mr. Hale was no longer looked upon as Vicar of Helstone, but as a man who only spent at a certain rate. Margaret was weary and impatient of the accounts which Dixon perpetually brought to Mrs. Hale of the behaviour of these would-be servants. Not but what Margaret was repelled by the rough uncourteous manners of these people; not but what she shrunk with fastidious pride from their hail-fellow accost, and severely resented their unconcealed curiosity as to the means and position of any family who lived in Milton, and yet were not engaged in trade of some kind. But the more Margaret felt impertinence, the more likely she was to be silent on the subject; and, at any rate, if she took upon herself to make inquiry for a servant, she could spare her mother the recital of all her disappointments and fancied or real insults.\nMargaret accordingly went up and down to butchers and grocers, seeking for a nonpareil of a girl; and lowering her hopes and expectations every week, as she found the difficulty of meeting with any one in a manufacturing town who did not prefer the better wages and greater independence of working in a mill. It was something of a trial to Margaret to go out by herself in this busy bustling place. Mrs. Shaw's ideas of propriety and her own helpless dependence on others, had always made her insist that a footman should accompany Edith and Margaret, if they went beyond Harley Street or the immediate neighbourhood. The limits by which this rule of her aunt's had circumscribed Margaret's independence had been silently rebelled against at the time: and she had doubly enjoyed the free walks and rambles of her forest life from the contrast which they presented. She went along there with a boundless fearless step, that occasionally broke out into a run, if she were in a hurry, and occasionally was stilled into perfect repose, as she stood listening to, or watching any of the wild creatures who sang in the leafy courts, or glanced out with their keen bright eyes from the low brushwood or tangled furze. It was a trial to come down from such motion or such stillness, only guided by her own sweet will, to the even and decorous pace necessary in streets. But she could have laughed at herself for minding this change, if it had not been accompanied by what was a more serious annoyance.\nThe side of the town on which Crampton lay was especially a thoroughfare for the factory people. In the back streets around them there were many mills, out of which poured streams of men and women two or three times a day. Until Margaret had learnt the times of their ingress and egress, she was very unfortunate in constantly falling in with them. They came rushing along, with bold, fearless faces, and loud laughs and jests, particularly aimed at all those who appeared to be above them in rank or station. The tones of their unrestrained voices, and their carelessness of all common rules of street politeness, frightened Margaret a little at first. The girls, with their rough, but not unfriendly freedom, would comment on her dress, even touch her shawl or gown to ascertain the exact material; nay, once or twice she was asked questions relative to some article which they particularly admired. There was such a simple reliance on her womanly sympathy with their love of dress, and on her kindliness, that she gladly replied to these inquiries, as soon as she understood them; and half smiled back at their remarks. She did not mind meeting any number of girls, loud spoken and boisterous though they might be. But she alternately dreaded and fired up against the workmen, who commented not on her dress, but on her looks, in the same open, fearless manner. She, who had hitherto felt that even the most refined remark on her personal appearance was an impertinence, had to endure undisguised admiration from these outspoken men. But the very outspokenness marked their innocence of any intention to hurt her delicacy, as she would have perceived if she had been less frightened by the disorderly tumult. Out of her fright came a flash of indignation which made her face scarlet, and her dark eyes gather flame, as she heard some of their speeches. Yet there were other sayings of theirs, which, when she reached the quiet safety of home, amused her even while they irritated her.\nFor instance, one day, after she had passed a number of men, several of whom had paid her the not unusual compliment of wishing she was their sweetheart, one of the lingerers added, \"Your bonny face, my lass, makes the day look brighter.\" And another day, as she was unconsciously smiling at some passing thought, she was addressed by a poorly-dressed, middle-aged workman, with, \"You may well smile, my lass; many a one would smile to have such a bonny face.\" This man looked so careworn that Margaret could not help giving him an answering smile, glad to think that her looks, such as they were, should have had the power to call up a pleasant thought. He seemed to understand her acknowledging glance, and a silent recognition was established between them whenever the chances of the day brought them across each other's paths. They had never exchanged a word; nothing had been said but that first compliment; yet somehow Margaret looked upon this man with more interest than upon any one else in Milton. Once or twice, on Sundays, she saw him walking with a girl, evidently his daughter, and, if possible, still more unhealthy than he was himself.\nOne day Margaret and her father had been as far as the fields that lay around the town; it was early spring, and she had gathered some of the hedge and ditch flowers, dog-violets, lesser celandines, and the like, with an unspoken lament in her heart for the sweet profusion of the South. Her father had left her to go into Milton upon some business; and on the road home she met her humble friends. The girl looked wistfully at the flowers, and, acting on a sudden impulse, Margaret offered them to her. Her pale blue eyes lightened up as she took them, and her father spoke for her.\n\"Thank yo, Miss. Bessy'll think a deal o' them flowers; that hoo will; and I shall think a deal o' yor kindness. Yo're not of this country, I reckon?\"\n\"No!\" said Margaret, half sighing. \"I come from the South--from Hampshire,\" she continued, a little afraid of wounding his consciousness of ignorance, if she used a name which he did not understand.\n\"That's beyond London, I reckon? And I come fro' Burnleyways, and forty miles to th' North. And yet, yo see, North and South has both met and made kind o' friends in this big smoky place.\"\nMargaret had slackened her pace to a walk alongside of the man and his daughter, whose steps were regulated by the feebleness of the latter. She now spoke to the girl, and there was a sound of tender pity in the tone of her voice as she did so that went right to the heart of the father.\n\"I'm afraid you are not very strong.\"\n\"No,\" said the girl, \"nor never will be.\"\n\"Spring is coming,\" said Margaret, as if to suggest pleasant, hopeful thoughts.\n\"Spring nor summer will do me good,\" said the girl quietly.\nMargaret looked up at the man, almost expecting some contradiction from him, or at least some remark that would modify his daughter's utter hopelessness. But instead, he added--\n\"I'm afeared hoo speaks the truth. I'm afeared hoo's too far gone in a waste.\"\n\"I shall have a spring where I am boun' to, and flowers, and amaranths, and shining robes besides.\"\n\"Poor lass, poor lass!\" said her father in a low tone. \"I'm none so sure o' that; but it's a comfort to thee, poor lass, poor lass. Poor father! it'll be soon.\"\nMargaret was shocked by his words--shocked but not repelled; rather attracted and interested.\n\"Where do you live? I think we must be neighbours, we meet so often on this road.\"\n\"We put up at nine Frances Street, second turn to th' left at after yo've past th' Goulden Dragon.\"\n\"And your name? I must not forget that.\"\n\"I'm none ashamed o' my name. It's Nicholas Higgins. Hoo's called Bessy Higgins. Whatten yo' asking for?\"\nMargaret was surprised at this last question, for at Helstone it would have been an understood thing, after the enquiries she had made, that she intended to come and call upon any poor neighbour whose name and habitation she had asked for.\n\"I thought--I meant to come and see you.\" She suddenly felt rather shy of offering the visit, without having any reason to give for her wish to make it, beyond a kindly interest in a stranger. It seemed all at once to take the shape of an impertinence on her part; she read this meaning too in the man's eyes.\n\"I'm none so fond of having strange folk in my house.\" But then relenting, as he saw her heightened colour, he added \"Yo're a foreigner, as one may say, and maybe don't know many folk here, and yo've given my wench here flowers out of yo'r own hand;--yo may come if yo like.\"\nMargaret was half amused, half-nettled at this answer. She was not sure if she would go where permission was given so like a favour conferred. But when they came to the turn into Frances Street, the girl stopped a minute, and said,\n\"Yo'll not forget yo're to come and see us.\"\n\"Aye, aye,\" said the father, impatiently, \"hoo'll come. Hoo's a bit set up now, because hoo thinks I might ha' spoken more civilly; but hoo'll think better on it, and come. I can read her proud bonny face like a book. Come along, Bess; there's the mill bell ringing.\"\nMargaret went home, wondering at her new friends, and smiling at the man's insight into what had been passing in her mind. From that day Milton became a brighter place to her. It was not the long, bleak sunny days of spring, nor yet was it that time was reconciling her to the town of her habitation. It was that in it she had found a human interest.",
        "paragraph_chars": [
            [
                0,
                49
            ],
            [
                49,
                352
            ],
            [
                352,
                617
            ],
            [
                617,
                687
            ],
            [
                687,
                870
            ],
            [
                870,
                998
            ],
            [
                998,
                1138
            ],
            [
                1138,
                1327
            ],
            [
                1327,
                1409
            ],
            [
                1409,
                1635
            ],
            [
                1635,
                2068
            ],
            [
                2068,
                3169
            ],
            [
                3169,
                4456
            ],
            [
                4456,
                7278
            ],
            [
                7278,
                8846
            ],
            [
                8846,
                9579
            ],
            [
                9579,
                10515
            ],
            [
                10515,
                12567
            ],
            [
                12567,
                14061
            ],
            [
                14061,
                16049
            ],
            [
                16049,
                17201
            ],
            [
                17201,
                17785
            ],
            [
                17785,
                17936
            ],
            [
                17936,
                18135
            ],
            [
                18135,
                18324
            ],
            [
                18324,
                18612
            ],
            [
                18612,
                18650
            ],
            [
                18650,
                18692
            ],
            [
                18692,
                18772
            ],
            [
                18772,
                18832
            ],
            [
                18832,
                19010
            ],
            [
                19010,
                19089
            ],
            [
                19089,
                19189
            ],
            [
                19189,
                19350
            ],
            [
                19350,
                19444
            ],
            [
                19444,
                19527
            ],
            [
                19527,
                19627
            ],
            [
                19627,
                19668
            ],
            [
                19668,
                19774
            ],
            [
                19774,
                20014
            ],
            [
                20014,
                20324
            ],
            [
                20324,
                20600
            ],
            [
                20600,
                20832
            ],
            [
                20832,
                20877
            ],
            [
                20877,
                21145
            ],
            [
                21145,
                21495
            ]
        ],
        "segment_chars": [
            [
                0,
                49
            ],
            [
                49,
                127
            ],
            [
                127,
                171
            ],
            [
                171,
                352
            ],
            [
                352,
                617
            ],
            [
                617,
                632
            ],
            [
                632,
                654
            ],
            [
                654,
                687
            ],
            [
                687,
                770
            ],
            [
                770,
                870
            ],
            [
                870,
                936
            ],
            [
                936,
                948
            ],
            [
                948,
                965
            ],
            [
                965,
                998
            ],
            [
                998,
                1088
            ],
            [
                1088,
                1138
            ],
            [
                1138,
                1195
            ],
            [
                1195,
                1327
            ],
            [
                1327,
                1409
            ],
            [
                1409,
                1461
            ],
            [
                1461,
                1524
            ],
            [
                1524,
                1635
            ],
            [
                1635,
                1669
            ],
            [
                1669,
                1827
            ],
            [
                1827,
                2021
            ],
            [
                2021,
                2025
            ],
            [
                2025,
                2068
            ],
            [
                2068,
                2160
            ],
            [
                2160,
                2272
            ],
            [
                2272,
                2396
            ],
            [
                2396,
                2452
            ],
            [
                2452,
                2497
            ],
            [
                2497,
                2572
            ],
            [
                2572,
                2706
            ],
            [
                2706,
                2925
            ],
            [
                2925,
                3169
            ],
            [
                3169,
                3220
            ],
            [
                3220,
                3396
            ],
            [
                3396,
                3526
            ],
            [
                3526,
                3755
            ],
            [
                3755,
                3998
            ],
            [
                3998,
                4136
            ],
            [
                4136,
                4456
            ],
            [
                4456,
                4461
            ],
            [
                4461,
                4490
            ],
            [
                4490,
                4530
            ],
            [
                4530,
                4576
            ],
            [
                4576,
                4821
            ],
            [
                4821,
                4917
            ],
            [
                4917,
                5105
            ],
            [
                5105,
                5186
            ],
            [
                5186,
                5272
            ],
            [
                5272,
                5370
            ],
            [
                5370,
                5425
            ],
            [
                5425,
                5649
            ],
            [
                5649,
                5884
            ],
            [
                5884,
                6021
            ],
            [
                6021,
                6097
            ],
            [
                6097,
                6151
            ],
            [
                6151,
                6254
            ],
            [
                6254,
                6409
            ],
            [
                6409,
                6483
            ],
            [
                6483,
                6589
            ],
            [
                6589,
                6665
            ],
            [
                6665,
                6842
            ],
            [
                6842,
                7060
            ],
            [
                7060,
                7119
            ],
            [
                7119,
                7278
            ],
            [
                7278,
                7396
            ],
            [
                7396,
                7672
            ],
            [
                7672,
                7873
            ],
            [
                7873,
                8154
            ],
            [
                8154,
                8284
            ],
            [
                8284,
                8469
            ],
            [
                8469,
                8527
            ],
            [
                8527,
                8559
            ],
            [
                8559,
                8846
            ],
            [
                8846,
                9066
            ],
            [
                9066,
                9416
            ],
            [
                9416,
                9579
            ],
            [
                9579,
                9942
            ],
            [
                9942,
                10194
            ],
            [
                10194,
                10308
            ],
            [
                10308,
                10515
            ],
            [
                10515,
                10696
            ],
            [
                10696,
                11000
            ],
            [
                11000,
                11234
            ],
            [
                11234,
                11475
            ],
            [
                11475,
                11737
            ],
            [
                11737,
                11841
            ],
            [
                11841,
                11980
            ],
            [
                11980,
                12304
            ],
            [
                12304,
                12567
            ],
            [
                12567,
                12876
            ],
            [
                12876,
                12966
            ],
            [
                12966,
                13185
            ],
            [
                13185,
                13432
            ],
            [
                13432,
                13778
            ],
            [
                13778,
                13929
            ],
            [
                13929,
                14061
            ],
            [
                14061,
                14158
            ],
            [
                14158,
                14284
            ],
            [
                14284,
                14410
            ],
            [
                14410,
                14571
            ],
            [
                14571,
                14715
            ],
            [
                14715,
                14963
            ],
            [
                14963,
                15184
            ],
            [
                15184,
                15279
            ],
            [
                15279,
                15426
            ],
            [
                15426,
                15598
            ],
            [
                15598,
                15773
            ],
            [
                15773,
                15917
            ],
            [
                15917,
                16049
            ],
            [
                16049,
                16288
            ],
            [
                16288,
                16510
            ],
            [
                16510,
                16704
            ],
            [
                16704,
                16880
            ],
            [
                16880,
                17057
            ],
            [
                17057,
                17201
            ],
            [
                17201,
                17489
            ],
            [
                17489,
                17600
            ],
            [
                17600,
                17705
            ],
            [
                17705,
                17785
            ],
            [
                17785,
                17802
            ],
            [
                17802,
                17898
            ],
            [
                17898,
                17936
            ],
            [
                17936,
                17942
            ],
            [
                17942,
                17971
            ],
            [
                17971,
                18135
            ],
            [
                18135,
                18168
            ],
            [
                18168,
                18227
            ],
            [
                18227,
                18324
            ],
            [
                18324,
                18465
            ],
            [
                18465,
                18612
            ],
            [
                18612,
                18650
            ],
            [
                18650,
                18692
            ],
            [
                18692,
                18772
            ],
            [
                18772,
                18832
            ],
            [
                18832,
                18986
            ],
            [
                18986,
                19010
            ],
            [
                19010,
                19045
            ],
            [
                19045,
                19089
            ],
            [
                19089,
                19189
            ],
            [
                19189,
                19213
            ],
            [
                19213,
                19244
            ],
            [
                19244,
                19321
            ],
            [
                19321,
                19334
            ],
            [
                19334,
                19350
            ],
            [
                19350,
                19444
            ],
            [
                19444,
                19464
            ],
            [
                19464,
                19527
            ],
            [
                19527,
                19627
            ],
            [
                19627,
                19643
            ],
            [
                19643,
                19668
            ],
            [
                19668,
                19698
            ],
            [
                19698,
                19721
            ],
            [
                19721,
                19749
            ],
            [
                19749,
                19774
            ],
            [
                19774,
                20014
            ],
            [
                20014,
                20056
            ],
            [
                20056,
                20207
            ],
            [
                20207,
                20324
            ],
            [
                20324,
                20379
            ],
            [
                20379,
                20600
            ],
            [
                20600,
                20655
            ],
            [
                20655,
                20743
            ],
            [
                20743,
                20832
            ],
            [
                20832,
                20877
            ],
            [
                20877,
                20933
            ],
            [
                20933,
                21050
            ],
            [
                21050,
                21095
            ],
            [
                21095,
                21145
            ],
            [
                21145,
                21268
            ],
            [
                21268,
                21321
            ],
            [
                21321,
                21446
            ],
            [
                21446,
                21495
            ]
        ],
        "overlap_chars": [
            [
                49,
                58
            ],
            [
                59,
                69
            ],
            [
                76,
                127
            ],
            [
                171,
                234
            ],
            [
                289,
                298
            ],
            [
                303,
                352
            ],
            [
                352,
                387
            ],
            [
                388,
                437
            ],
            [
                455,
                479
            ],
            [
                485,
                492
            ],
            [
                501,
                520
            ],
            [
                526,
                582
            ],
            [
                600,
                604
            ],
            [
                607,
                610
            ],
            [
                583,
                596
            ],
            [
                615,
                617
            ],
            [
                618,
                632
            ],
            [
                632,
                651
            ],
            [
                654,
                686
            ],
            [
                687,
                695
            ],
            [
                715,
                718
            ],
            [
                698,
                703
            ],
            [
                821,
                867
            ],
            [
                871,
                874
            ],
            [
                894,
                900
            ],
            [
                880,
                893
            ],
            [
                913,
                936
            ],
            [
                936,
                940
            ],
            [
                948,
                965
            ],
            [
                965,
                995
            ],
            [
                999,
                1056
            ],
            [
                1086,
                1088
            ],
            [
                1088,
                1135
            ],
            [
                1139,
                1167
            ],
            [
                1170,
                1195
            ],
            [
                1200,
                1249
            ],
            [
                1256,
                1291
            ],
            [
                1299,
                1324
            ],
            [
                1327,
                1380
            ],
            [
                1386,
                1409
            ],
            [
                1414,
                1461
            ],
            [
                1524,
                1541
            ],
            [
                1620,
                1622
            ],
            [
                1569,
                1599
            ],
            [
                1602,
                1609
            ],
            [
                1633,
                1635
            ],
            [
                1635,
                1669
            ],
            [
                1669,
                1728
            ],
            [
                1741,
                1827
            ],
            [
                1827,
                1991
            ],
            [
                2008,
                2021
            ],
            [
                2021,
                2025
            ],
            [
                2025,
                2068
            ],
            [
                2068,
                2076
            ],
            [
                2104,
                2105
            ],
            [
                2082,
                2090
            ],
            [
                2110,
                2160
            ],
            [
                2160,
                2218
            ],
            [
                2223,
                2272
            ],
            [
                2272,
                2282
            ],
            [
                2318,
                2324
            ],
            [
                2328,
                2367
            ],
            [
                2378,
                2396
            ],
            [
                2396,
                2451
            ],
            [
                2452,
                2497
            ],
            [
                2497,
                2572
            ],
            [
                2572,
                2598
            ],
            [
                2624,
                2629
            ],
            [
                2651,
                2655
            ],
            [
                2664,
                2675
            ],
            [
                2696,
                2706
            ],
            [
                2706,
                2757
            ],
            [
                2822,
                2908
            ],
            [
                2923,
                2924
            ],
            [
                2925,
                2927
            ],
            [
                2940,
                3003
            ],
            [
                3045,
                3048
            ],
            [
                3011,
                3016
            ],
            [
                3018,
                3044
            ],
            [
                3075,
                3078
            ],
            [
                3049,
                3061
            ],
            [
                3078,
                3168
            ],
            [
                3169,
                3198
            ],
            [
                3218,
                3220
            ],
            [
                3396,
                3486
            ],
            [
                3524,
                3526
            ],
            [
                3526,
                3536
            ],
            [
                3566,
                3589
            ],
            [
                3642,
                3645
            ],
            [
                3598,
                3605
            ],
            [
                3536,
                3537
            ],
            [
                3729,
                3738
            ],
            [
                3748,
                3755
            ],
            [
                3821,
                3823
            ],
            [
                3759,
                3795
            ],
            [
                3836,
                3847
            ],
            [
                3874,
                3877
            ],
            [
                3797,
                3800
            ],
            [
                3897,
                3904
            ],
            [
                3868,
                3873
            ],
            [
                3912,
                3952
            ],
            [
                3960,
                3970
            ],
            [
                3982,
                3998
            ],
            [
                3998,
                4037
            ],
            [
                4086,
                4136
            ],
            [
                4136,
                4145
            ],
            [
                4155,
                4157
            ],
            [
                4146,
                4154
            ],
            [
                4162,
                4180
            ],
            [
                4226,
                4235
            ],
            [
                4249,
                4274
            ],
            [
                4208,
                4213
            ],
            [
                4279,
                4353
            ],
            [
                4391,
                4456
            ],
            [
                4456,
                4461
            ],
            [
                4461,
                4490
            ],
            [
                4576,
                4599
            ],
            [
                4610,
                4616
            ],
            [
                4690,
                4733
            ],
            [
                4636,
                4637
            ],
            [
                4755,
                4814
            ],
            [
                4819,
                4821
            ],
            [
                4821,
                4897
            ],
            [
                4903,
                4906
            ],
            [
                4911,
                4917
            ],
            [
                4917,
                4920
            ],
            [
                4930,
                4942
            ],
            [
                4948,
                4961
            ],
            [
                4970,
                4980
            ],
            [
                4991,
                5105
            ],
            [
                5105,
                5123
            ],
            [
                5128,
                5186
            ],
            [
                5186,
                5192
            ],
            [
                5204,
                5271
            ],
            [
                5370,
                5425
            ],
            [
                5425,
                5431
            ],
            [
                5466,
                5528
            ],
            [
                5540,
                5568
            ],
            [
                5594,
                5649
            ],
            [
                5704,
                5718
            ],
            [
                5731,
                5854
            ],
            [
                5873,
                5884
            ],
            [
                5884,
                5887
            ],
            [
                5974,
                6020
            ],
            [
                6021,
                6067
            ],
            [
                6074,
                6097
            ],
            [
                6097,
                6151
            ],
            [
                6151,
                6254
            ],
            [
                6254,
                6309
            ],
            [
                6407,
                6409
            ],
            [
                6409,
                6424
            ],
            [
                6426,
                6482
            ],
            [
                6483,
                6582
            ],
            [
                6587,
                6589
            ],
            [
                6589,
                6600
            ],
            [
                6605,
                6613
            ],
            [
                6632,
                6652
            ],
            [
                6656,
                6665
            ],
            [
                6665,
                6707
            ],
            [
                6716,
                6719
            ],
            [
                6730,
                6748
            ],
            [
                6764,
                6767
            ],
            [
                6749,
                6757
            ],
            [
                6799,
                6801
            ],
            [
                6829,
                6842
            ],
            [
                6842,
                6852
            ],
            [
                6861,
                6863
            ],
            [
                6864,
                6918
            ],
            [
                6919,
                6928
            ],
            [
                6968,
                6973
            ],
            [
                6858,
                6860
            ],
            [
                6935,
                6946
            ],
            [
                7058,
                7060
            ],
            [
                7060,
                7118
            ],
            [
                7278,
                7342
            ],
            [
                7344,
                7346
            ],
            [
                7382,
                7396
            ],
            [
                7396,
                7463
            ],
            [
                7465,
                7468
            ],
            [
                7470,
                7496
            ],
            [
                7527,
                7617
            ],
            [
                7622,
                7672
            ],
            [
                7672,
                7747
            ],
            [
                7769,
                7873
            ],
            [
                7873,
                7922
            ],
            [
                7934,
                7936
            ],
            [
                7942,
                7961
            ],
            [
                7974,
                8049
            ],
            [
                8055,
                8105
            ],
            [
                8119,
                8153
            ],
            [
                8154,
                8199
            ],
            [
                8200,
                8203
            ],
            [
                8233,
                8260
            ],
            [
                8268,
                8284
            ],
            [
                8289,
                8299
            ],
            [
                8328,
                8469
            ],
            [
                8469,
                8527
            ],
            [
                8527,
                8559
            ],
            [
                8559,
                8624
            ],
            [
                8648,
                8695
            ],
            [
                8701,
                8705
            ],
            [
                8750,
                8755
            ],
            [
                8756,
                8758
            ],
            [
                8765,
                8767
            ],
            [
                8777,
                8846
            ],
            [
                8846,
                8854
            ],
            [
                8862,
                8877
            ],
            [
                8885,
                8999
            ],
            [
                9052,
                9059
            ],
            [
                9030,
                9032
            ],
            [
                9064,
                9066
            ],
            [
                9077,
                9146
            ],
            [
                9162,
                9273
            ],
            [
                9311,
                9352
            ],
            [
                9414,
                9415
            ],
            [
                9579,
                9584
            ],
            [
                9587,
                9620
            ],
            [
                9647,
                9648
            ],
            [
                9681,
                9689
            ],
            [
                9655,
                9658
            ],
            [
                9693,
                9764
            ],
            [
                9782,
                9788
            ],
            [
                9769,
                9778
            ],
            [
                9788,
                9789
            ],
            [
                9790,
                9802
            ],
            [
                9928,
                9931
            ],
            [
                9807,
                9810
            ],
            [
                9820,
                9860
            ],
            [
                9940,
                9942
            ],
            [
                9942,
                9971
            ],
            [
                9973,
                10073
            ],
            [
                10074,
                10102
            ],
            [
                10148,
                10194
            ],
            [
                10194,
                10308
            ],
            [
                10308,
                10333
            ],
            [
                10342,
                10437
            ],
            [
                10446,
                10515
            ],
            [
                10526,
                10534
            ],
            [
                10551,
                10558
            ],
            [
                10563,
                10579
            ],
            [
                10587,
                10629
            ],
            [
                10694,
                10696
            ],
            [
                10696,
                10810
            ],
            [
                10889,
                10896
            ],
            [
                10908,
                10912
            ],
            [
                10921,
                10933
            ],
            [
                10954,
                10960
            ],
            [
                10998,
                11000
            ],
            [
                11000,
                11005
            ],
            [
                11287,
                11292
            ],
            [
                11010,
                11013
            ],
            [
                11307,
                11348
            ],
            [
                11353,
                11369
            ],
            [
                11371,
                11374
            ],
            [
                11392,
                11415
            ],
            [
                11428,
                11441
            ],
            [
                11473,
                11475
            ],
            [
                11475,
                11484
            ],
            [
                11516,
                11545
            ],
            [
                11556,
                11568
            ],
            [
                11576,
                11621
            ],
            [
                11625,
                11685
            ],
            [
                11720,
                11735
            ],
            [
                11735,
                11736
            ],
            [
                11841,
                11859
            ],
            [
                11874,
                11876
            ],
            [
                11896,
                11901
            ],
            [
                11881,
                11889
            ],
            [
                11935,
                11980
            ],
            [
                12254,
                12255
            ],
            [
                12002,
                12064
            ],
            [
                12078,
                12145
            ],
            [
                12155,
                12201
            ],
            [
                12221,
                12254
            ],
            [
                12273,
                12289
            ],
            [
                12302,
                12304
            ],
            [
                12304,
                12307
            ],
            [
                12416,
                12418
            ],
            [
                12317,
                12325
            ],
            [
                12423,
                12427
            ],
            [
                12382,
                12384
            ],
            [
                12433,
                12443
            ],
            [
                12461,
                12513
            ],
            [
                12522,
                12541
            ],
            [
                12558,
                12567
            ],
            [
                12567,
                12575
            ],
            [
                12588,
                12592
            ],
            [
                12605,
                12643
            ],
            [
                12659,
                12668
            ],
            [
                12678,
                12687
            ],
            [
                12705,
                12716
            ],
            [
                12756,
                12760
            ],
            [
                12730,
                12747
            ],
            [
                12793,
                12876
            ],
            [
                12876,
                12966
            ],
            [
                12966,
                12975
            ],
            [
                13040,
                13050
            ],
            [
                13067,
                13098
            ],
            [
                13001,
                13004
            ],
            [
                13117,
                13121
            ],
            [
                13127,
                13152
            ],
            [
                13038,
                13039
            ],
            [
                13105,
                13117
            ],
            [
                13229,
                13232
            ],
            [
                13280,
                13297
            ],
            [
                13317,
                13318
            ],
            [
                13323,
                13354
            ],
            [
                13365,
                13391
            ],
            [
                13392,
                13409
            ],
            [
                13430,
                13432
            ],
            [
                13447,
                13452
            ],
            [
                13547,
                13548
            ],
            [
                13432,
                13435
            ],
            [
                13453,
                13465
            ],
            [
                13470,
                13484
            ],
            [
                13549,
                13552
            ],
            [
                13490,
                13524
            ],
            [
                13626,
                13628
            ],
            [
                13597,
                13598
            ],
            [
                13612,
                13624
            ],
            [
                13629,
                13637
            ],
            [
                13645,
                13713
            ],
            [
                13720,
                13724
            ],
            [
                13732,
                13778
            ],
            [
                13778,
                13810
            ],
            [
                13877,
                13883
            ],
            [
                13893,
                13919
            ],
            [
                13920,
                13928
            ],
            [
                13929,
                13932
            ],
            [
                14031,
                14060
            ],
            [
                14158,
                14164
            ],
            [
                14170,
                14184
            ],
            [
                14190,
                14284
            ],
            [
                14410,
                14488
            ],
            [
                14502,
                14520
            ],
            [
                14540,
                14558
            ],
            [
                14569,
                14571
            ],
            [
                14584,
                14656
            ],
            [
                14664,
                14715
            ],
            [
                14715,
                14799
            ],
            [
                14800,
                14831
            ],
            [
                14842,
                14861
            ],
            [
                14867,
                14880
            ],
            [
                14889,
                14894
            ],
            [
                14917,
                14940
            ],
            [
                14954,
                14963
            ],
            [
                14963,
                15044
            ],
            [
                15067,
                15153
            ],
            [
                15161,
                15165
            ],
            [
                15182,
                15183
            ],
            [
                15184,
                15279
            ],
            [
                15279,
                15286
            ],
            [
                15299,
                15407
            ],
            [
                15409,
                15426
            ],
            [
                15426,
                15429
            ],
            [
                15435,
                15438
            ],
            [
                15448,
                15457
            ],
            [
                15480,
                15533
            ],
            [
                15535,
                15598
            ],
            [
                15606,
                15610
            ],
            [
                15620,
                15624
            ],
            [
                15632,
                15676
            ],
            [
                15685,
                15746
            ],
            [
                15771,
                15773
            ],
            [
                15773,
                15917
            ],
            [
                15917,
                15963
            ],
            [
                16001,
                16017
            ],
            [
                16047,
                16049
            ],
            [
                16049,
                16070
            ],
            [
                16078,
                16081
            ],
            [
                16086,
                16092
            ],
            [
                16110,
                16117
            ],
            [
                16105,
                16108
            ],
            [
                16130,
                16201
            ],
            [
                16203,
                16209
            ],
            [
                16224,
                16230
            ],
            [
                16232,
                16285
            ],
            [
                16288,
                16345
            ],
            [
                16354,
                16427
            ],
            [
                16430,
                16507
            ],
            [
                16510,
                16704
            ],
            [
                16704,
                16816
            ],
            [
                16873,
                16878
            ],
            [
                16878,
                16880
            ],
            [
                16880,
                16884
            ],
            [
                16889,
                16911
            ],
            [
                16939,
                17032
            ],
            [
                17041,
                17057
            ],
            [
                17057,
                17201
            ],
            [
                17201,
                17287
            ],
            [
                17289,
                17295
            ],
            [
                17296,
                17348
            ],
            [
                17359,
                17380
            ],
            [
                17388,
                17489
            ],
            [
                17489,
                17499
            ],
            [
                17504,
                17535
            ],
            [
                17541,
                17600
            ],
            [
                17600,
                17705
            ],
            [
                17705,
                17775
            ],
            [
                17783,
                17785
            ],
            [
                17792,
                17802
            ],
            [
                17802,
                17883
            ],
            [
                17888,
                17898
            ],
            [
                17898,
                17933
            ],
            [
                17937,
                17939
            ],
            [
                17942,
                17971
            ],
            [
                17972,
                17993
            ],
            [
                17995,
                18009
            ],
            [
                18012,
                18045
            ],
            [
                18099,
                18135
            ],
            [
                18140,
                18168
            ],
            [
                18168,
                18191
            ],
            [
                18191,
                18196
            ],
            [
                18201,
                18206
            ],
            [
                18213,
                18227
            ],
            [
                18227,
                18321
            ],
            [
                18324,
                18358
            ],
            [
                18361,
                18375
            ],
            [
                18379,
                18386
            ],
            [
                18403,
                18421
            ],
            [
                18432,
                18452
            ],
            [
                18391,
                18403
            ],
            [
                18463,
                18465
            ],
            [
                18465,
                18491
            ],
            [
                18506,
                18507
            ],
            [
                18517,
                18528
            ],
            [
                18568,
                18590
            ],
            [
                18604,
                18610
            ],
            [
                18591,
                18596
            ],
            [
                18610,
                18612
            ],
            [
                18613,
                18647
            ],
            [
                18651,
                18653
            ],
            [
                18656,
                18670
            ],
            [
                18672,
                18689
            ],
            [
                18700,
                18709
            ],
            [
                18712,
                18743
            ],
            [
                18754,
                18772
            ],
            [
                18780,
                18806
            ],
            [
                18809,
                18832
            ],
            [
                18832,
                18862
            ],
            [
                18870,
                18907
            ],
            [
                18984,
                18986
            ],
            [
                18986,
                18989
            ],
            [
                18999,
                19001
            ],
            [
                18997,
                18998
            ],
            [
                19011,
                19033
            ],
            [
                19038,
                19045
            ],
            [
                19045,
                19075
            ],
            [
                19127,
                19128
            ],
            [
                19090,
                19119
            ],
            [
                19129,
                19186
            ],
            [
                19190,
                19210
            ],
            [
                19213,
                19244
            ],
            [
                19245,
                19308
            ],
            [
                19334,
                19347
            ],
            [
                19350,
                19370
            ],
            [
                19393,
                19417
            ],
            [
                19432,
                19444
            ],
            [
                19445,
                19464
            ],
            [
                19464,
                19511
            ],
            [
                19528,
                19530
            ],
            [
                19538,
                19568
            ],
            [
                19574,
                19585
            ],
            [
                19589,
                19624
            ],
            [
                19628,
                19641
            ],
            [
                19698,
                19721
            ],
            [
                19721,
                19749
            ],
            [
                19749,
                19771
            ],
            [
                19774,
                19874
            ],
            [
                19910,
                19930
            ],
            [
                19940,
                19983
            ],
            [
                19995,
                20014
            ],
            [
                20015,
                20024
            ],
            [
                20026,
                20053
            ],
            [
                20056,
                20133
            ],
            [
                20142,
                20145
            ],
            [
                20163,
                20165
            ],
            [
                20167,
                20173
            ],
            [
                20176,
                20191
            ],
            [
                20205,
                20207
            ],
            [
                20207,
                20216
            ],
            [
                20229,
                20231
            ],
            [
                20250,
                20265
            ],
            [
                20277,
                20292
            ],
            [
                20301,
                20324
            ],
            [
                20325,
                20376
            ],
            [
                20379,
                20387
            ],
            [
                20397,
                20440
            ],
            [
                20459,
                20460
            ],
            [
                20561,
                20562
            ],
            [
                20442,
                20459
            ],
            [
                20475,
                20551
            ],
            [
                20572,
                20573
            ],
            [
                20575,
                20597
            ],
            [
                20600,
                20617
            ],
            [
                20624,
                20655
            ],
            [
                20655,
                20687
            ],
            [
                20741,
                20743
            ],
            [
                20743,
                20764
            ],
            [
                20779,
                20811
            ],
            [
                20820,
                20832
            ],
            [
                20833,
                20874
            ],
            [
                20878,
                20886
            ],
            [
                20889,
                20918
            ],
            [
                20920,
                20933
            ],
            [
                20933,
                21050
            ],
            [
                21050,
                21095
            ],
            [
                21095,
                21142
            ],
            [
                21145,
                21268
            ],
            [
                21268,
                21321
            ],
            [
                21321,
                21368
            ],
            [
                21385,
                21389
            ],
            [
                21399,
                21407
            ],
            [
                21411,
                21426
            ],
            [
                21444,
                21446
            ],
            [
                21446,
                21495
            ]
        ],
        "row_chars": [
            [
                0,
                49
            ],
            [
                49,
                127
            ],
            [
                127,
                171
            ],
            [
                171,
                352
            ],
            [
                352,
                617
            ],
            [
                617,
                632
            ],
            [
                632,
                654
            ],
            [
                654,
                687
            ],
            [
                687,
                770
            ],
            [
                770,
                870
            ],
            [
                870,
                936
            ],
            [
                936,
                965
            ],
            [
                965,
                998
            ],
            [
                998,
                1088
            ],
            [
                1088,
                1138
            ],
            [
                1138,
                1195
            ],
            [
                1195,
                1327
            ],
            [
                1327,
                1409
            ],
            [
                1409,
                1461
            ],
            [
                1461,
                1524
            ],
            [
                1524,
                1635
            ],
            [
                1635,
                1669
            ],
            [
                1669,
                1827
            ],
            [
                1827,
                2021
            ],
            [
                2021,
                2025
            ],
            [
                2025,
                2068
            ],
            [
                2068,
                2160
            ],
            [
                2160,
                2272
            ],
            [
                2272,
                2396
            ],
            [
                2396,
                2452
            ],
            [
                2452,
                2497
            ],
            [
                2497,
                2572
            ],
            [
                2572,
                2706
            ],
            [
                2706,
                2925
            ],
            [
                2925,
                3169
            ],
            [
                3169,
                3220
            ],
            [
                3220,
                3396
            ],
            [
                3396,
                3526
            ],
            [
                3526,
                3755
            ],
            [
                3755,
                3998
            ],
            [
                3998,
                4136
            ],
            [
                4136,
                4456
            ],
            [
                4456,
                4461
            ],
            [
                4461,
                4490
            ],
            [
                4490,
                4530
            ],
            [
                4530,
                4576
            ],
            [
                4576,
                4821
            ],
            [
                4821,
                4917
            ],
            [
                4917,
                5105
            ],
            [
                5105,
                5186
            ],
            [
                5186,
                5272
            ],
            [
                5272,
                5370
            ],
            [
                5370,
                5425
            ],
            [
                5425,
                5649
            ],
            [
                5649,
                5884
            ],
            [
                5884,
                6021
            ],
            [
                6021,
                6097
            ],
            [
                6097,
                6151
            ],
            [
                6151,
                6254
            ],
            [
                6254,
                6409
            ],
            [
                6409,
                6483
            ],
            [
                6483,
                6589
            ],
            [
                6589,
                6665
            ],
            [
                6665,
                6842
            ],
            [
                6842,
                7060
            ],
            [
                7060,
                7119
            ],
            [
                7119,
                7278
            ],
            [
                7278,
                7396
            ],
            [
                7396,
                7672
            ],
            [
                7672,
                7873
            ],
            [
                7873,
                8154
            ],
            [
                8154,
                8284
            ],
            [
                8284,
                8469
            ],
            [
                8469,
                8527
            ],
            [
                8527,
                8559
            ],
            [
                8559,
                8846
            ],
            [
                8846,
                9066
            ],
            [
                9066,
                9416
            ],
            [
                9416,
                9579
            ],
            [
                9579,
                9942
            ],
            [
                9942,
                10194
            ],
            [
                10194,
                10308
            ],
            [
                10308,
                10515
            ],
            [
                10515,
                10696
            ],
            [
                10696,
                11000
            ],
            [
                11000,
                11475
            ],
            [
                11475,
                11737
            ],
            [
                11737,
                11841
            ],
            [
                11841,
                11980
            ],
            [
                11980,
                12304
            ],
            [
                12304,
                12567
            ],
            [
                12567,
                12876
            ],
            [
                12876,
                12966
            ],
            [
                12966,
                13432
            ],
            [
                13432,
                13778
            ],
            [
                13778,
                13929
            ],
            [
                13929,
                14061
            ],
            [
                14061,
                14158
            ],
            [
                14158,
                14284
            ],
            [
                14284,
                14410
            ],
            [
                14410,
                14571
            ],
            [
                14571,
                14715
            ],
            [
                14715,
                14963
            ],
            [
                14963,
                15184
            ],
            [
                15184,
                15279
            ],
            [
                15279,
                15426
            ],
            [
                15426,
                15598
            ],
            [
                15598,
                15773
            ],
            [
                15773,
                15917
            ],
            [
                15917,
                16049
            ],
            [
                16049,
                16288
            ],
            [
                16288,
                16510
            ],
            [
                16510,
                16704
            ],
            [
                16704,
                16880
            ],
            [
                16880,
                17057
            ],
            [
                17057,
                17201
            ],
            [
                17201,
                17489
            ],
            [
                17489,
                17600
            ],
            [
                17600,
                17705
            ],
            [
                17705,
                17785
            ],
            [
                17785,
                17802
            ],
            [
                17802,
                17898
            ],
            [
                17898,
                17936
            ],
            [
                17936,
                17942
            ],
            [
                17942,
                17971
            ],
            [
                17971,
                18135
            ],
            [
                18135,
                18168
            ],
            [
                18168,
                18227
            ],
            [
                18227,
                18324
            ],
            [
                18324,
                18465
            ],
            [
                18465,
                18612
            ],
            [
                18612,
                18650
            ],
            [
                18650,
                18692
            ],
            [
                18692,
                18772
            ],
            [
                18772,
                18832
            ],
            [
                18832,
                18986
            ],
            [
                18986,
                19045
            ],
            [
                19045,
                19089
            ],
            [
                19089,
                19189
            ],
            [
                19189,
                19213
            ],
            [
                19213,
                19244
            ],
            [
                19244,
                19350
            ],
            [
                19350,
                19444
            ],
            [
                19444,
                19464
            ],
            [
                19464,
                19527
            ],
            [
                19527,
                19627
            ],
            [
                19627,
                19643
            ],
            [
                19643,
                19668
            ],
            [
                19668,
                19698
            ],
            [
                19698,
                19721
            ],
            [
                19721,
                19749
            ],
            [
                19749,
                19774
            ],
            [
                19774,
                20014
            ],
            [
                20014,
                20056
            ],
            [
                20056,
                20207
            ],
            [
                20207,
                20324
            ],
            [
                20324,
                20379
            ],
            [
                20379,
                20600
            ],
            [
                20600,
                20655
            ],
            [
                20655,
                20743
            ],
            [
                20743,
                20832
            ],
            [
                20832,
                20877
            ],
            [
                20877,
                20933
            ],
            [
                20933,
                21050
            ],
            [
                21050,
                21095
            ],
            [
                21095,
                21145
            ],
            [
                21145,
                21268
            ],
            [
                21268,
                21321
            ],
            [
                21321,
                21446
            ],
            [
                21446,
                21495
            ]
        ]
    },
    "abridged": {
        "text": "It needed more than the pretty papering of the rooms to reconcile them to Milton. The thick yellow November fogs had come on; and the view of the river was shut out when Mrs. Hale arrived at her new home.\nMargaret and Dixon had been at work for two days, unpacking and arranging, but everything still looked in disorder. Outside, fog crept up to the windows, and was driven in to every open door in choking, unwholesome white wreaths.\n'Oh, Margaret! are we to live here?' asked Mrs. Hale in blank dismay. Margaret, dreary at heart, made herself say,\n'Oh, the fogs in London are sometimes far worse!'\n'But in London you knew that friends lay behind it. Here, we are desolate. Oh Dixon, what a place this is!'\n'Indeed, ma'am, I'm sure it will be your death before long! Miss Hale, that's far too heavy for you to lift.'\n'Not at all, thank you, Dixon,' replied Margaret coldly. 'The best thing we can do for mamma is to get her room ready for her to go to bed, while I bring her a cup of coffee.'\nMr. Hale was equally out of spirits, and equally came to Margaret for sympathy.\n'Margaret, I do believe this is an unhealthy place. I wish I had gone to Wales; this is really terrible,' said he.\nThere was no comfort to be given. They were settled in Milton, and must endure smoke and fogs; indeed, all other life seemed shut out from them by as thick a fog of circumstance. Only the day before, Mr. Hale had been reckoning up with dismay how much their removal and fortnight at Heston had cost, and he found it had absorbed nearly all his ready money. No! here they were, and here they must remain.\nAt night, Margaret felt inclined to sit down in a stupor of despair. The heavy smoky air hung about her bedroom, which occupied a long narrow projection at the back of the house. The window looked onto the blank wall of a similar projection, only ten feet distant. It loomed through the fog like a great barrier to hope.\nInside the room everything was in confusion. All their efforts had been directed to make her mother's room comfortable. Margaret sat down on a box which had been labelled at Helstone - beautiful Helstone! She lost herself in dismal thought: but at last she remembered that she had a letter from Edith which she had only half read in the bustle.\nIt told of their arrival at Corfu; their voyage along the Mediterranean - the music and dancing on board ship; her gay new life; her house with its trellised balcony, and its views over white cliffs and deep blue sea. Edith wrote fluently and well. Captain Lennox and another lately married officer shared a villa, high up on the beautiful cliffs. Their days seemed spent in boating and picnics, utterly free from any cloud. Edith's husband had to attend drill, and she had to copy out the newest English tunes for the benefit of the bandmaster; those were their most arduous duties. She expressed an affectionate hope that Margaret might come out and pay her a long visit. She asked if Margaret remembered the day a year ago when it rained in Harley Street; and how Edith would not put on her new gown to go to a stupid dinner, and get it all wet; and how at that very dinner they had first met Captain Lennox.\nYes! Margaret remembered it well. The recollection of the handsome luxury of the house, the peaceful, untroubled ease there, came vividly before her, in strange contrast to the present. The smooth sea of that old life closed up, without a mark left to tell where it had been. The dinners, the shopping, the dancing, were all going on for ever, though her Aunt Shaw and Edith were no longer there; and she, of course, was even less missed. She doubted if any of that old set ever thought of her, except Henry Lennox. He too would strive to forget her, because of the pain she had caused him.\nThen she penetrated farther into what might have been. If she had accepted him, and this change in her father's opinions and station had taken place, she knew it would have been impatiently received by Mr. Lennox. She could bear the change, because she knew her father's purity of purpose, and that strengthened her to endure his errors, grave and serious though she thought they were. But it would have oppressed and irritated Mr. Lennox.\nAs she realised what might have been, she grew thankful for what was. They were at the lowest now; they could not be worse. Edith's astonishment and her aunt Shaw's dismay would have to be met bravely, when their letters came. So Margaret rose up and began slowly to undress herself. She fell asleep hoping for some brightness, either internal or external.\nBut if she had known how long it would be before the brightness came, her heart would have sunk low. The time of year was harmful to health as well as spirits. Her mother caught a severe cold, and Dixon was not well, although she would not allow Margaret to try and take care of her. They could find no servant girl to assist her; all were at work in the factories; or at least, Dixon did not approve of any who applied. So they had to keep a charwoman in almost constant employ.\nMr. Hale met with several pupils, recommended to him by Mr. Bell or Mr. Thornton. They were mostly of the age when many boys would be still at school; but according to the prevalent notions of Milton, to make a lad into a good tradesman he must be caught young, and acclimatised to the life of the mill, or office, or warehouse. If he were sent to even the Scotch Universities, he came back unsettled for commerce; how much more so if he went to Oxford or Cambridge, where he could not be entered till he was eighteen? So most of the manufacturers placed their sons in work at fourteen or fifteen, unsparingly cutting away all off-shoots in the direction of literature or mental cultivation, in hopes of throwing the whole vigour of the plant into commerce.\nStill there were some wiser parents; and some young men who saw their own deficiencies, and tried to remedy them. There were even some men in the prime of life, who had the stern wisdom to acknowledge their own ignorance, and to learn late what they should have learnt early. Mr. Thornton was perhaps the oldest of Mr. Hale's pupils. He was certainly the favourite. Mr. Hale got into the habit of quoting his opinions so frequently that it became a little domestic joke to wonder how much time in his lessons could have been be devoted to learning, so much of it appeared to have been spent in conversation.\nMargaret encouraged this merry way of viewing her father's acquaintance with Mr. Thornton, because she felt that her mother was inclined to be jealous of it. When his time had been solely occupied with his books and his parishioners, she had appeared to care little whether she saw much of him or not; but now that he looked eagerly forward to meeting Mr. Thornton, she seemed hurt and annoyed.\nAfter his quiet life in a country parsonage, Mr. Hale was somewhat dazzled by the energy which conquered immense difficulties with ease; the power of Milton's machinery, and the power of its men, impressed him with a sense of grandeur. But Margaret went less abroad among machinery and men; saw less of power in its public effect, and, as it happened, she was thrown together with one or two of those who must be acute sufferers for the good of many. The question always is, has everything been done to make the sufferings of these exceptions as small as possible? Or, in the triumph of the procession, have the helpless been trampled on, instead of being gently lifted aside out of the way of the conqueror, whom they have no power to accompany on his march?\nMargaret had to look for a servant to help Dixon, who had at first undertaken to find one herself. But Dixon's ideas of helpful girls were founded on the recollection of tidy elder scholars at Helstone school, who treated her with respect, and even fright. Dixon could not endure the rough independent way in which the Milton girls who applied for the servant's place answered her inquiries. They even questioned her back again; having doubts of their own about the solvency of a family who lived in a house at thirty pounds a-year, and yet gave themselves airs, and kept such a high and mighty ladies' maid.\nMargaret was weary of Dixon's accounts of the behaviour of these would-be servants. True, she herself was repelled by the rough uncourteous manners of these people; she shrunk with fastidious pride from their hail-fellow accost, and resented their unconcealed curiosity as to the income of any family who lived in Milton without being engaged in trade. But if Margaret took it on herself to find a servant, she could spare her mother the recital of Dixon's disappointments and insults.\nSo Margaret went to butchers and grocers, seeking for a suitable girl; and lowered her hopes every week, with the difficulty of finding anyone who did not prefer the better wages and greater independence of working in a mill. It was something of a trial to Margaret to go out by herself in this busy bustling place. Mrs. Shaw had always insisted that a footman should accompany her, if she went beyond Harley Street, and Margaret had silently rebelled: she had doubly enjoyed the free rambles of her forest life, from the contrast. There, she walked with a bounding fearless step, and occasionally broke out into a run, or halted, listening to and watching the wild creatures who sang in the leafy courts, or glanced out with keen eyes from the low brushwood or tangled furze. It was a trial to come down from this to the decorous pace necessary in the streets.\nBut there was a more serious annoyance. In the streets around Crampton there were many mills, out of which poured streams of men and women two or three times a day. They came rushing along, with bold, fearless faces, and loud laughs and jests, aimed at all those above them in rank. Their unrestrained voices, and their carelessness of all common rules of politeness, frightened Margaret a little at first. The girls, with their rough, but not unfriendly freedom, would comment on her dress, and even touch her shawl or gown to check the exact material; once or twice they asked her about some article which they admired. There was such a simple reliance on her womanly sympathy with their love of dress, that she gladly replied to these inquiries, as soon as she understood them; and half-smiled back.\nShe did not mind meeting any number of girls, loud spoken and boisterous though they might be. But she dreaded and fired up against the workmen, who commented not on her dress, but on her looks, in the same open fearless manner. She had always felt that any remark on her personal appearance was an impertinence; now she had to endure undisguised admiration from these outspoken men. Their very out-spokenness showed their innocence of any intention to hurt her, as she would have perceived if she had been less frightened. Out of her fright came a flash of indignation which made her face scarlet, and her dark eyes gather flame, as she heard some of their speeches. Yet there were other sayings of theirs, which, once back home, amused her.\nFor instance, one day she passed several men who paid her the not unusual compliment of wishing she was their sweetheart. One of them added, 'Your bonny face, my lass, makes the day look brighter.' And another day, as she was unconsciously smiling at some thought, she was addressed by a poorly-dressed, middle-aged workman, with: 'You may well smile, my lass; many a one would smile to have such a bonny face.'\nThis man looked so careworn that Margaret could not help giving him an answering smile, glad to think that her looks, such as they were, should have had the power to call up a pleasant thought. He seemed to understand her acknowledging glance, and a silent recognition was established between them whenever their paths crossed. They never exchanged a word beyond that first compliment; yet somehow Margaret looked upon this man with more interest than upon anyone else in Milton. Once or twice, on Sundays, she saw him walking with a girl, evidently his daughter, and, if possible, still more unhealthy than he was himself.\nOne day Margaret and her father had been as far as the fields that lay around the town. It was now early spring, and she had gathered some of the hedge flowers, dog-violets, celandines, and the like, with an unspoken lament in her heart for the sweet profusion of the South. Her father left her to go into Milton upon business; and on the road home she met her humble friends. The girl looked wistfully at the flowers, and, acting on a sudden impulse, Margaret offered them to her. Her pale blue eyes lightened up as she took them, and her father spoke.\n'Thank yo, Miss. Bessy'll think a deal o' them flowers; that hoo will; and I shall think a deal o' your kindness. Yo're not of this country, I reckon?'\n'No!' said Margaret, half sighing. 'I come from the South - from Hampshire,' she continued, a little afraid of using a name which he did not understand.\n'That's beyond London, I reckon? And I come fro' Burnley-ways, forty mile to th' North. And yet, yo see, North and South has both met and made kind o' friends in this big smoky place.'\nMargaret had slackened her pace to walk alongside the man, whose steps were slowed by the feebleness of his daughter. She now spoke to the girl, with a tender pity that went right to the father's heart.\n'I'm afraid you are not very strong.'\n'No,' said the girl, 'nor never will be.'\n'Spring is coming,' said Margaret, as if to suggest hopeful thoughts.\n'Spring nor summer will do me good,' said the girl quietly.\nMargaret looked up at the man, expecting some contradiction from him. But he said, 'I'm afeared hoo speaks truth. I'm afeared hoo's too far gone.'\n'I shall have a spring where I'm bound to, and flowers, and amaranths, and shining robes besides,' said his daughter.\n'Poor lass, poor lass!' said her father in a low tone. 'I'm none so sure o' that; but it's a comfort to thee, poor lass - it'll be soon.'\nMargaret was shocked, but not repelled; rather, interested.\n'Where do you live? I think we must be neighbours, we meet so often.'\n'We're at nine Frances Street, second to th' left after yo've past th' Goulden Dragon.'\n'And your name?'\n'It's Nicholas Higgins. Hoo's called Bessy Higgins. Whatten yo' asking for?'\nMargaret was surprised at this last question, for at Helstone it would have been an understood thing that she intended to call upon any poor neighbour whose name and address she had asked for.\n'I thought - I meant to come and see you.' She suddenly felt rather shy of offering the visit, without having any reason for it beyond kindly interest. It seemed to be an impertinence; she read this too in the man's eyes.\n'I'm none so fond of having strange folk in my house.' But then, as he saw her heightened colour, he added, 'Yo're a foreigner, and maybe don't know many folk here, and yo've given my wench here flowers; - yo may come if yo like.'\nMargaret was half-amused, half-nettled at this answer. She was not sure if she would go after all. But when they came to Frances Street, the girl stopped, and said,\n'Yo'll not forget yo're to come and see us.'\n'Aye, aye,' said the father, impatiently, 'hoo'll come. Hoo's a bit set up now, because hoo thinks I might ha' spoken more civilly; but hoo'll think better on it, and come. I can read her proud bonny face like a book. Come along, Bess; there's the mill bell ringing.'\nMargaret went home, wondering at her new friends, and smiling at the man's insight into what had been passing in her mind. From that day Milton became a brighter place to her. It was not the long, bleak sunny days of spring that reconciled her to the town. It was that in it she had found a human interest.",
        "paragraph_chars": [
            [
                0,
                205
            ],
            [
                205,
                435
            ],
            [
                435,
                550
            ],
            [
                550,
                600
            ],
            [
                600,
                708
            ],
            [
                708,
                818
            ],
            [
                818,
                994
            ],
            [
                994,
                1074
            ],
            [
                1074,
                1189
            ],
            [
                1189,
                1593
            ],
            [
                1593,
                1914
            ],
            [
                1914,
                2259
            ],
            [
                2259,
                3171
            ],
            [
                3171,
                3762
            ],
            [
                3762,
                4202
            ],
            [
                4202,
                4559
            ],
            [
                4559,
                5039
            ],
            [
                5039,
                5797
            ],
            [
                5797,
                6405
            ],
            [
                6405,
                6800
            ],
            [
                6800,
                7560
            ],
            [
                7560,
                8169
            ],
            [
                8169,
                8655
            ],
            [
                8655,
                9517
            ],
            [
                9517,
                10320
            ],
            [
                10320,
                11063
            ],
            [
                11063,
                11475
            ],
            [
                11475,
                12099
            ],
            [
                12099,
                12653
            ],
            [
                12653,
                12805
            ],
            [
                12805,
                12958
            ],
            [
                12958,
                13143
            ],
            [
                13143,
                13346
            ],
            [
                13346,
                13384
            ],
            [
                13384,
                13426
            ],
            [
                13426,
                13496
            ],
            [
                13496,
                13556
            ],
            [
                13556,
                13703
            ],
            [
                13703,
                13821
            ],
            [
                13821,
                13959
            ],
            [
                13959,
                14019
            ],
            [
                14019,
                14089
            ],
            [
                14089,
                14177
            ],
            [
                14177,
                14194
            ],
            [
                14194,
                14271
            ],
            [
                14271,
                14464
            ],
            [
                14464,
                14686
            ],
            [
                14686,
                14917
            ],
            [
                14917,
                15082
            ],
            [
                15082,
                15127
            ],
            [
                15127,
                15395
            ],
            [
                15395,
                15701
            ]
        ],
        "segment_chars": [
            [
                0,
                82
            ],
            [
                82,
                205
            ],
            [
                205,
                321
            ],
            [
                321,
                435
            ],
            [
                435,
                450
            ],
            [
                450,
                472
            ],
            [
                472,
                505
            ],
            [
                505,
                550
            ],
            [
                550,
                600
            ],
            [
                600,
                652
            ],
            [
                652,
                675
            ],
            [
                675,
                708
            ],
            [
                708,
                768
            ],
            [
                768,
                818
            ],
            [
                818,
                875
            ],
            [
                875,
                994
            ],
            [
                994,
                1074
            ],
            [
                1074,
                1126
            ],
            [
                1126,
                1189
            ],
            [
                1189,
                1223
            ],
            [
                1223,
                1368
            ],
            [
                1368,
                1546
            ],
            [
                1546,
                1550
            ],
            [
                1550,
                1593
            ],
            [
                1593,
                1662
            ],
            [
                1662,
                1772
            ],
            [
                1772,
                1858
            ],
            [
                1858,
                1914
            ],
            [
                1914,
                1959
            ],
            [
                1959,
                2034
            ],
            [
                2034,
                2119
            ],
            [
                2119,
                2259
            ],
            [
                2259,
                2477
            ],
            [
                2477,
                2508
            ],
            [
                2508,
                2607
            ],
            [
                2607,
                2684
            ],
            [
                2684,
                2843
            ],
            [
                2843,
                2933
            ],
            [
                2933,
                3171
            ],
            [
                3171,
                3176
            ],
            [
                3176,
                3205
            ],
            [
                3205,
                3357
            ],
            [
                3357,
                3447
            ],
            [
                3447,
                3610
            ],
            [
                3610,
                3687
            ],
            [
                3687,
                3762
            ],
            [
                3762,
                3817
            ],
            [
                3817,
                3976
            ],
            [
                3976,
                4148
            ],
            [
                4148,
                4202
            ],
            [
                4202,
                4272
            ],
            [
                4272,
                4326
            ],
            [
                4326,
                4429
            ],
            [
                4429,
                4486
            ],
            [
                4486,
                4559
            ],
            [
                4559,
                4660
            ],
            [
                4660,
                4719
            ],
            [
                4719,
                4843
            ],
            [
                4843,
                4980
            ],
            [
                4980,
                5039
            ],
            [
                5039,
                5121
            ],
            [
                5121,
                5368
            ],
            [
                5368,
                5558
            ],
            [
                5558,
                5797
            ],
            [
                5797,
                5911
            ],
            [
                5911,
                6073
            ],
            [
                6073,
                6131
            ],
            [
                6131,
                6163
            ],
            [
                6163,
                6405
            ],
            [
                6405,
                6563
            ],
            [
                6563,
                6800
            ],
            [
                6800,
                7036
            ],
            [
                7036,
                7251
            ],
            [
                7251,
                7365
            ],
            [
                7365,
                7560
            ],
            [
                7560,
                7659
            ],
            [
                7659,
                7817
            ],
            [
                7817,
                7952
            ],
            [
                7952,
                8169
            ],
            [
                8169,
                8253
            ],
            [
                8253,
                8522
            ],
            [
                8522,
                8655
            ],
            [
                8655,
                8881
            ],
            [
                8881,
                8971
            ],
            [
                8971,
                9187
            ],
            [
                9187,
                9432
            ],
            [
                9432,
                9517
            ],
            [
                9517,
                9557
            ],
            [
                9557,
                9682
            ],
            [
                9682,
                9800
            ],
            [
                9800,
                9924
            ],
            [
                9924,
                10139
            ],
            [
                10139,
                10320
            ],
            [
                10320,
                10415
            ],
            [
                10415,
                10549
            ],
            [
                10549,
                10704
            ],
            [
                10704,
                10844
            ],
            [
                10844,
                10988
            ],
            [
                10988,
                11063
            ],
            [
                11063,
                11185
            ],
            [
                11185,
                11261
            ],
            [
                11261,
                11475
            ],
            [
                11475,
                11669
            ],
            [
                11669,
                11803
            ],
            [
                11803,
                11955
            ],
            [
                11955,
                12099
            ],
            [
                12099,
                12187
            ],
            [
                12187,
                12374
            ],
            [
                12374,
                12476
            ],
            [
                12476,
                12581
            ],
            [
                12581,
                12653
            ],
            [
                12653,
                12670
            ],
            [
                12670,
                12767
            ],
            [
                12767,
                12805
            ],
            [
                12805,
                12811
            ],
            [
                12811,
                12840
            ],
            [
                12840,
                12958
            ],
            [
                12958,
                12991
            ],
            [
                12991,
                13046
            ],
            [
                13046,
                13143
            ],
            [
                13143,
                13261
            ],
            [
                13261,
                13346
            ],
            [
                13346,
                13384
            ],
            [
                13384,
                13426
            ],
            [
                13426,
                13496
            ],
            [
                13496,
                13556
            ],
            [
                13556,
                13626
            ],
            [
                13626,
                13670
            ],
            [
                13670,
                13703
            ],
            [
                13703,
                13821
            ],
            [
                13821,
                13845
            ],
            [
                13845,
                13876
            ],
            [
                13876,
                13959
            ],
            [
                13959,
                14019
            ],
            [
                14019,
                14039
            ],
            [
                14039,
                14089
            ],
            [
                14089,
                14177
            ],
            [
                14177,
                14194
            ],
            [
                14194,
                14218
            ],
            [
                14218,
                14246
            ],
            [
                14246,
                14271
            ],
            [
                14271,
                14464
            ],
            [
                14464,
                14507
            ],
            [
                14507,
                14616
            ],
            [
                14616,
                14686
            ],
            [
                14686,
                14741
            ],
            [
                14741,
                14917
            ],
            [
                14917,
                14972
            ],
            [
                14972,
                15016
            ],
            [
                15016,
                15082
            ],
            [
                15082,
                15127
            ],
            [
                15127,
                15183
            ],
            [
                15183,
                15300
            ],
            [
                15300,
                15345
            ],
            [
                15345,
                15395
            ],
            [
                15395,
                15518
            ],
            [
                15518,
                15571
            ],
            [
                15571,
                15652
            ],
            [
                15652,
                15701
            ]
        ],
        "overlap_chars": [
            [
                0,
                9
            ],
            [
                20,
                30
            ],
            [
                31,
                82
            ],
            [
                82,
                145
            ],
            [
                146,
                155
            ],
            [
                156,
                205
            ],
            [
                205,
                240
            ],
            [
                245,
                294
            ],
            [
                295,
                319
            ],
            [
                321,
                328
            ],
            [
                330,
                349
            ],
            [
                350,
                406
            ],
            [
                408,
                412
            ],
            [
                416,
                419
            ],
            [
                420,
                433
            ],
            [
                433,
                435
            ],
            [
                436,
                450
            ],
            [
                450,
                469
            ],
            [
                472,
                504
            ],
            [
                505,
                513
            ],
            [
                515,
                518
            ],
            [
                525,
                530
            ],
            [
                551,
                597
            ],
            [
                601,
                604
            ],
            [
                608,
                614
            ],
            [
                615,
                628
            ],
            [
                629,
                652
            ],
            [
                652,
                656
            ],
            [
                658,
                675
            ],
            [
                675,
                705
            ],
            [
                709,
                766
            ],
            [
                766,
                768
            ],
            [
                768,
                815
            ],
            [
                819,
                847
            ],
            [
                850,
                875
            ],
            [
                880,
                929
            ],
            [
                930,
                965
            ],
            [
                966,
                991
            ],
            [
                994,
                1047
            ],
            [
                1051,
                1074
            ],
            [
                1079,
                1126
            ],
            [
                1126,
                1143
            ],
            [
                1144,
                1146
            ],
            [
                1147,
                1177
            ],
            [
                1180,
                1187
            ],
            [
                1187,
                1189
            ],
            [
                1189,
                1223
            ],
            [
                1223,
                1282
            ],
            [
                1282,
                1368
            ],
            [
                1368,
                1532
            ],
            [
                1533,
                1546
            ],
            [
                1546,
                1550
            ],
            [
                1550,
                1593
            ],
            [
                1593,
                1601
            ],
            [
                1601,
                1602
            ],
            [
                1603,
                1611
            ],
            [
                1612,
                1662
            ],
            [
                1662,
                1720
            ],
            [
                1723,
                1772
            ],
            [
                1772,
                1782
            ],
            [
                1783,
                1789
            ],
            [
                1795,
                1834
            ],
            [
                1840,
                1858
            ],
            [
                1858,
                1913
            ],
            [
                1914,
                1959
            ],
            [
                1959,
                2034
            ],
            [
                2034,
                2060
            ],
            [
                2061,
                2066
            ],
            [
                2071,
                2075
            ],
            [
                2085,
                2096
            ],
            [
                2109,
                2119
            ],
            [
                2119,
                2170
            ],
            [
                2171,
                2257
            ],
            [
                2257,
                2258
            ],
            [
                2259,
                2261
            ],
            [
                2267,
                2330
            ],
            [
                2333,
                2336
            ],
            [
                2337,
                2342
            ],
            [
                2343,
                2369
            ],
            [
                2370,
                2373
            ],
            [
                2374,
                2386
            ],
            [
                2386,
                2476
            ],
            [
                2477,
                2506
            ],
            [
                2506,
                2508
            ],
            [
                2508,
                2598
            ],
            [
                2605,
                2607
            ],
            [
                2607,
                2617
            ],
            [
                2618,
                2641
            ],
            [
                2642,
                2645
            ],
            [
                2646,
                2653
            ],
            [
                2653,
                2654
            ],
            [
                2663,
                2672
            ],
            [
                2677,
                2684
            ],
            [
                2689,
                2691
            ],
            [
                2692,
                2728
            ],
            [
                2729,
                2740
            ],
            [
                2741,
                2744
            ],
            [
                2745,
                2748
            ],
            [
                2756,
                2763
            ],
            [
                2764,
                2769
            ],
            [
                2770,
                2810
            ],
            [
                2816,
                2826
            ],
            [
                2827,
                2843
            ],
            [
                2843,
                2882
            ],
            [
                2883,
                2933
            ],
            [
                2933,
                2942
            ],
            [
                2943,
                2945
            ],
            [
                2946,
                2954
            ],
            [
                2955,
                2973
            ],
            [
                2990,
                2999
            ],
            [
                3000,
                3025
            ],
            [
                3026,
                3031
            ],
            [
                3032,
                3106
            ],
            [
                3106,
                3171
            ],
            [
                3171,
                3176
            ],
            [
                3176,
                3205
            ],
            [
                3205,
                3228
            ],
            [
                3238,
                3244
            ],
            [
                3245,
                3288
            ],
            [
                3294,
                3295
            ],
            [
                3296,
                3355
            ],
            [
                3355,
                3357
            ],
            [
                3357,
                3433
            ],
            [
                3437,
                3440
            ],
            [
                3441,
                3447
            ],
            [
                3447,
                3450
            ],
            [
                3451,
                3463
            ],
            [
                3472,
                3485
            ],
            [
                3485,
                3495
            ],
            [
                3496,
                3610
            ],
            [
                3610,
                3628
            ],
            [
                3629,
                3687
            ],
            [
                3687,
                3693
            ],
            [
                3694,
                3761
            ],
            [
                3762,
                3817
            ],
            [
                3817,
                3823
            ],
            [
                3824,
                3886
            ],
            [
                3887,
                3915
            ],
            [
                3921,
                3976
            ],
            [
                3976,
                3990
            ],
            [
                4001,
                4124
            ],
            [
                4137,
                4148
            ],
            [
                4148,
                4151
            ],
            [
                4155,
                4201
            ],
            [
                4202,
                4248
            ],
            [
                4249,
                4272
            ],
            [
                4272,
                4326
            ],
            [
                4326,
                4429
            ],
            [
                4429,
                4484
            ],
            [
                4484,
                4486
            ],
            [
                4486,
                4501
            ],
            [
                4502,
                4558
            ],
            [
                4559,
                4658
            ],
            [
                4658,
                4660
            ],
            [
                4660,
                4671
            ],
            [
                4672,
                4680
            ],
            [
                4689,
                4709
            ],
            [
                4710,
                4719
            ],
            [
                4719,
                4761
            ],
            [
                4762,
                4765
            ],
            [
                4766,
                4784
            ],
            [
                4795,
                4798
            ],
            [
                4805,
                4813
            ],
            [
                4814,
                4816
            ],
            [
                4830,
                4843
            ],
            [
                4843,
                4853
            ],
            [
                4859,
                4861
            ],
            [
                4870,
                4924
            ],
            [
                4928,
                4937
            ],
            [
                4938,
                4943
            ],
            [
                4960,
                4962
            ],
            [
                4967,
                4978
            ],
            [
                4978,
                4980
            ],
            [
                4980,
                5038
            ],
            [
                5039,
                5103
            ],
            [
                5104,
                5106
            ],
            [
                5107,
                5121
            ],
            [
                5121,
                5188
            ],
            [
                5190,
                5193
            ],
            [
                5194,
                5220
            ],
            [
                5221,
                5311
            ],
            [
                5318,
                5368
            ],
            [
                5368,
                5443
            ],
            [
                5454,
                5558
            ],
            [
                5558,
                5607
            ],
            [
                5613,
                5615
            ],
            [
                5616,
                5635
            ],
            [
                5635,
                5710
            ],
            [
                5711,
                5761
            ],
            [
                5762,
                5796
            ],
            [
                5797,
                5842
            ],
            [
                5853,
                5856
            ],
            [
                5861,
                5888
            ],
            [
                5895,
                5911
            ],
            [
                5911,
                5921
            ],
            [
                5932,
                6073
            ],
            [
                6073,
                6131
            ],
            [
                6131,
                6163
            ],
            [
                6163,
                6228
            ],
            [
                6229,
                6276
            ],
            [
                6286,
                6290
            ],
            [
                6306,
                6311
            ],
            [
                6322,
                6324
            ],
            [
                6333,
                6335
            ],
            [
                6336,
                6405
            ],
            [
                6405,
                6413
            ],
            [
                6414,
                6429
            ],
            [
                6430,
                6544
            ],
            [
                6548,
                6555
            ],
            [
                6556,
                6558
            ],
            [
                6561,
                6563
            ],
            [
                6568,
                6637
            ],
            [
                6637,
                6748
            ],
            [
                6757,
                6798
            ],
            [
                6798,
                6799
            ],
            [
                6800,
                6805
            ],
            [
                6810,
                6843
            ],
            [
                6843,
                6844
            ],
            [
                6845,
                6853
            ],
            [
                6854,
                6857
            ],
            [
                6878,
                6949
            ],
            [
                6950,
                6956
            ],
            [
                6959,
                6968
            ],
            [
                6968,
                6969
            ],
            [
                6974,
                6986
            ],
            [
                6987,
                6990
            ],
            [
                6991,
                6994
            ],
            [
                6994,
                7034
            ],
            [
                7034,
                7036
            ],
            [
                7036,
                7065
            ],
            [
                7066,
                7166
            ],
            [
                7176,
                7204
            ],
            [
                7205,
                7251
            ],
            [
                7251,
                7365
            ],
            [
                7365,
                7390
            ],
            [
                7391,
                7486
            ],
            [
                7491,
                7560
            ],
            [
                7560,
                7568
            ],
            [
                7573,
                7580
            ],
            [
                7581,
                7597
            ],
            [
                7603,
                7645
            ],
            [
                7657,
                7659
            ],
            [
                7659,
                7773
            ],
            [
                7774,
                7781
            ],
            [
                7786,
                7790
            ],
            [
                7791,
                7803
            ],
            [
                7809,
                7815
            ],
            [
                7815,
                7817
            ],
            [
                7817,
                7822
            ],
            [
                7823,
                7828
            ],
            [
                7829,
                7832
            ],
            [
                7833,
                7874
            ],
            [
                7875,
                7891
            ],
            [
                7892,
                7895
            ],
            [
                7904,
                7927
            ],
            [
                7937,
                7950
            ],
            [
                7950,
                7952
            ],
            [
                7952,
                7961
            ],
            [
                7973,
                8002
            ],
            [
                8003,
                8015
            ],
            [
                8022,
                8067
            ],
            [
                8071,
                8131
            ],
            [
                8139,
                8154
            ],
            [
                8167,
                8168
            ],
            [
                8169,
                8187
            ],
            [
                8188,
                8190
            ],
            [
                8191,
                8196
            ],
            [
                8199,
                8207
            ],
            [
                8208,
                8253
            ],
            [
                8257,
                8258
            ],
            [
                8271,
                8333
            ],
            [
                8334,
                8401
            ],
            [
                8402,
                8448
            ],
            [
                8456,
                8489
            ],
            [
                8504,
                8520
            ],
            [
                8520,
                8522
            ],
            [
                8522,
                8525
            ],
            [
                8526,
                8528
            ],
            [
                8529,
                8537
            ],
            [
                8538,
                8542
            ],
            [
                8546,
                8548
            ],
            [
                8549,
                8559
            ],
            [
                8565,
                8617
            ],
            [
                8626,
                8645
            ],
            [
                8646,
                8655
            ],
            [
                8658,
                8666
            ],
            [
                8667,
                8671
            ],
            [
                8672,
                8710
            ],
            [
                8720,
                8729
            ],
            [
                8738,
                8747
            ],
            [
                8748,
                8759
            ],
            [
                8760,
                8764
            ],
            [
                8765,
                8782
            ],
            [
                8798,
                8881
            ],
            [
                8881,
                8971
            ],
            [
                8971,
                8980
            ],
            [
                8981,
                8991
            ],
            [
                9001,
                9032
            ],
            [
                9033,
                9036
            ],
            [
                9036,
                9040
            ],
            [
                9045,
                9070
            ],
            [
                9070,
                9071
            ],
            [
                9072,
                9084
            ],
            [
                9085,
                9088
            ],
            [
                9089,
                9106
            ],
            [
                9106,
                9107
            ],
            [
                9108,
                9139
            ],
            [
                9140,
                9166
            ],
            [
                9168,
                9185
            ],
            [
                9185,
                9187
            ],
            [
                9187,
                9192
            ],
            [
                9192,
                9193
            ],
            [
                9194,
                9197
            ],
            [
                9205,
                9217
            ],
            [
                9221,
                9235
            ],
            [
                9236,
                9239
            ],
            [
                9240,
                9274
            ],
            [
                9275,
                9277
            ],
            [
                9284,
                9285
            ],
            [
                9286,
                9298
            ],
            [
                9303,
                9311
            ],
            [
                9312,
                9380
            ],
            [
                9381,
                9385
            ],
            [
                9386,
                9432
            ],
            [
                9432,
                9464
            ],
            [
                9470,
                9476
            ],
            [
                9477,
                9503
            ],
            [
                9508,
                9516
            ],
            [
                9517,
                9520
            ],
            [
                9527,
                9556
            ],
            [
                9557,
                9563
            ],
            [
                9564,
                9578
            ],
            [
                9588,
                9682
            ],
            [
                9682,
                9760
            ],
            [
                9761,
                9779
            ],
            [
                9780,
                9798
            ],
            [
                9798,
                9800
            ],
            [
                9800,
                9872
            ],
            [
                9873,
                9924
            ],
            [
                9924,
                10008
            ],
            [
                10013,
                10044
            ],
            [
                10051,
                10070
            ],
            [
                10071,
                10084
            ],
            [
                10090,
                10095
            ],
            [
                10106,
                10129
            ],
            [
                10130,
                10139
            ],
            [
                10139,
                10220
            ],
            [
                10220,
                10306
            ],
            [
                10314,
                10318
            ],
            [
                10318,
                10319
            ],
            [
                10320,
                10415
            ],
            [
                10415,
                10422
            ],
            [
                10423,
                10531
            ],
            [
                10532,
                10549
            ],
            [
                10549,
                10552
            ],
            [
                10553,
                10556
            ],
            [
                10564,
                10573
            ],
            [
                10578,
                10631
            ],
            [
                10641,
                10704
            ],
            [
                10710,
                10714
            ],
            [
                10725,
                10729
            ],
            [
                10737,
                10781
            ],
            [
                10781,
                10842
            ],
            [
                10842,
                10844
            ],
            [
                10844,
                10988
            ],
            [
                10988,
                11034
            ],
            [
                11045,
                11061
            ],
            [
                11061,
                11063
            ],
            [
                11063,
                11084
            ],
            [
                11085,
                11088
            ],
            [
                11089,
                11095
            ],
            [
                11096,
                11103
            ],
            [
                11104,
                11107
            ],
            [
                11112,
                11183
            ],
            [
                11185,
                11191
            ],
            [
                11197,
                11203
            ],
            [
                11205,
                11258
            ],
            [
                11261,
                11318
            ],
            [
                11319,
                11392
            ],
            [
                11395,
                11472
            ],
            [
                11475,
                11669
            ],
            [
                11669,
                11781
            ],
            [
                11788,
                11793
            ],
            [
                11801,
                11803
            ],
            [
                11803,
                11807
            ],
            [
                11808,
                11830
            ],
            [
                11838,
                11931
            ],
            [
                11939,
                11955
            ],
            [
                11955,
                12099
            ],
            [
                12099,
                12185
            ],
            [
                12187,
                12193
            ],
            [
                12198,
                12250
            ],
            [
                12251,
                12272
            ],
            [
                12273,
                12374
            ],
            [
                12374,
                12384
            ],
            [
                12385,
                12416
            ],
            [
                12417,
                12476
            ],
            [
                12476,
                12581
            ],
            [
                12581,
                12651
            ],
            [
                12651,
                12653
            ],
            [
                12660,
                12670
            ],
            [
                12670,
                12751
            ],
            [
                12757,
                12767
            ],
            [
                12767,
                12802
            ],
            [
                12806,
                12808
            ],
            [
                12811,
                12840
            ],
            [
                12841,
                12862
            ],
            [
                12865,
                12879
            ],
            [
                12882,
                12915
            ],
            [
                12922,
                12958
            ],
            [
                12963,
                12991
            ],
            [
                12991,
                13014
            ],
            [
                13015,
                13020
            ],
            [
                13021,
                13026
            ],
            [
                13032,
                13046
            ],
            [
                13046,
                13140
            ],
            [
                13143,
                13177
            ],
            [
                13178,
                13192
            ],
            [
                13193,
                13200
            ],
            [
                13200,
                13218
            ],
            [
                13226,
                13246
            ],
            [
                13247,
                13259
            ],
            [
                13259,
                13261
            ],
            [
                13261,
                13287
            ],
            [
                13293,
                13294
            ],
            [
                13295,
                13306
            ],
            [
                13307,
                13329
            ],
            [
                13330,
                13336
            ],
            [
                13339,
                13344
            ],
            [
                13344,
                13346
            ],
            [
                13347,
                13381
            ],
            [
                13385,
                13387
            ],
            [
                13390,
                13404
            ],
            [
                13406,
                13423
            ],
            [
                13434,
                13443
            ],
            [
                13446,
                13477
            ],
            [
                13478,
                13496
            ],
            [
                13504,
                13530
            ],
            [
                13533,
                13556
            ],
            [
                13556,
                13586
            ],
            [
                13587,
                13624
            ],
            [
                13624,
                13626
            ],
            [
                13626,
                13629
            ],
            [
                13630,
                13632
            ],
            [
                13637,
                13638
            ],
            [
                13640,
                13662
            ],
            [
                13663,
                13670
            ],
            [
                13670,
                13700
            ],
            [
                13703,
                13704
            ],
            [
                13704,
                13733
            ],
            [
                13742,
                13799
            ],
            [
                13822,
                13842
            ],
            [
                13845,
                13876
            ],
            [
                13877,
                13940
            ],
            [
                13943,
                13956
            ],
            [
                13959,
                13979
            ],
            [
                13981,
                14005
            ],
            [
                14007,
                14019
            ],
            [
                14020,
                14039
            ],
            [
                14039,
                14086
            ],
            [
                14090,
                14092
            ],
            [
                14096,
                14126
            ],
            [
                14127,
                14138
            ],
            [
                14139,
                14174
            ],
            [
                14178,
                14191
            ],
            [
                14195,
                14218
            ],
            [
                14218,
                14246
            ],
            [
                14246,
                14268
            ],
            [
                14271,
                14371
            ],
            [
                14372,
                14392
            ],
            [
                14393,
                14436
            ],
            [
                14445,
                14464
            ],
            [
                14465,
                14474
            ],
            [
                14477,
                14504
            ],
            [
                14507,
                14584
            ],
            [
                14585,
                14588
            ],
            [
                14589,
                14591
            ],
            [
                14592,
                14598
            ],
            [
                14599,
                14614
            ],
            [
                14614,
                14616
            ],
            [
                14616,
                14625
            ],
            [
                14626,
                14628
            ],
            [
                14632,
                14647
            ],
            [
                14647,
                14662
            ],
            [
                14663,
                14686
            ],
            [
                14687,
                14738
            ],
            [
                14741,
                14749
            ],
            [
                14749,
                14792
            ],
            [
                14792,
                14793
            ],
            [
                14794,
                14795
            ],
            [
                14795,
                14812
            ],
            [
                14812,
                14888
            ],
            [
                14888,
                14889
            ],
            [
                14892,
                14914
            ],
            [
                14917,
                14934
            ],
            [
                14941,
                14972
            ],
            [
                14972,
                15004
            ],
            [
                15014,
                15016
            ],
            [
                15016,
                15037
            ],
            [
                15038,
                15070
            ],
            [
                15070,
                15082
            ],
            [
                15083,
                15124
            ],
            [
                15128,
                15136
            ],
            [
                15139,
                15168
            ],
            [
                15170,
                15183
            ],
            [
                15183,
                15300
            ],
            [
                15300,
                15345
            ],
            [
                15345,
                15392
            ],
            [
                15395,
                15518
            ],
            [
                15518,
                15571
            ],
            [
                15571,
                15618
            ],
            [
                15619,
                15623
            ],
            [
                15624,
                15632
            ],
            [
                15635,
                15650
            ],
            [
                15650,
                15652
            ],
            [
                15652,
                15701
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                82
            ],
            [
                82,
                82
            ],
            [
                82,
                205
            ],
            [
                205,
                435
            ],
            [
                435,
                450
            ],
            [
                450,
                472
            ],
            [
                472,
                505
            ],
            [
                505,
                550
            ],
            [
                550,
                600
            ],
            [
                600,
                652
            ],
            [
                652,
                675
            ],
            [
                675,
                708
            ],
            [
                708,
                768
            ],
            [
                768,
                818
            ],
            [
                818,
                875
            ],
            [
                875,
                994
            ],
            [
                994,
                1074
            ],
            [
                1074,
                1126
            ],
            [
                1126,
                1126
            ],
            [
                1126,
                1189
            ],
            [
                1189,
                1223
            ],
            [
                1223,
                1368
            ],
            [
                1368,
                1546
            ],
            [
                1546,
                1550
            ],
            [
                1550,
                1593
            ],
            [
                1593,
                1662
            ],
            [
                1662,
                1772
            ],
            [
                1772,
                1858
            ],
            [
                1858,
                1914
            ],
            [
                1914,
                1959
            ],
            [
                1959,
                2034
            ],
            [
                2034,
                2119
            ],
            [
                2119,
                2259
            ],
            [
                2259,
                2477
            ],
            [
                2477,
                2508
            ],
            [
                2508,
                2508
            ],
            [
                2508,
                2607
            ],
            [
                2607,
                2684
            ],
            [
                2684,
                2843
            ],
            [
                2843,
                2933
            ],
            [
                2933,
                3171
            ],
            [
                3171,
                3176
            ],
            [
                3176,
                3205
            ],
            [
                3205,
                3205
            ],
            [
                3205,
                3205
            ],
            [
                3205,
                3357
            ],
            [
                3357,
                3447
            ],
            [
                3447,
                3610
            ],
            [
                3610,
                3687
            ],
            [
                3687,
                3762
            ],
            [
                3762,
                3762
            ],
            [
                3762,
                3817
            ],
            [
                3817,
                3976
            ],
            [
                3976,
                4148
            ],
            [
                4148,
                4202
            ],
            [
                4202,
                4272
            ],
            [
                4272,
                4326
            ],
            [
                4326,
                4429
            ],
            [
                4429,
                4486
            ],
            [
                4486,
                4559
            ],
            [
                4559,
                4660
            ],
            [
                4660,
                4719
            ],
            [
                4719,
                4843
            ],
            [
                4843,
                4980
            ],
            [
                4980,
                5039
            ],
            [
                5039,
                5039
            ],
            [
                5039,
                5121
            ],
            [
                5121,
                5368
            ],
            [
                5368,
                5558
            ],
            [
                5558,
                5797
            ],
            [
                5797,
                5911
            ],
            [
                5911,
                6073
            ],
            [
                6073,
                6131
            ],
            [
                6131,
                6163
            ],
            [
                6163,
                6405
            ],
            [
                6405,
                6563
            ],
            [
                6563,
                6800
            ],
            [
                6800,
                6800
            ],
            [
                6800,
                7036
            ],
            [
                7036,
                7251
            ],
            [
                7251,
                7365
            ],
            [
                7365,
                7560
            ],
            [
                7560,
                7659
            ],
            [
                7659,
                7817
            ],
            [
                7817,
                7952
            ],
            [
                7952,
                8169
            ],
            [
                8169,
                8169
            ],
            [
                8169,
                8253
            ],
            [
                8253,
                8522
            ],
            [
                8522,
                8655
            ],
            [
                8655,
                8881
            ],
            [
                8881,
                8971
            ],
            [
                8971,
                9187
            ],
            [
                9187,
                9432
            ],
            [
                9432,
                9517
            ],
            [
                9517,
                9557
            ],
            [
                9557,
                9557
            ],
            [
                9557,
                9682
            ],
            [
                9682,
                9682
            ],
            [
                9682,
                9800
            ],
            [
                9800,
                9924
            ],
            [
                9924,
                10139
            ],
            [
                10139,
                10320
            ],
            [
                10320,
                10415
            ],
            [
                10415,
                10549
            ],
            [
                10549,
                10704
            ],
            [
                10704,
                10844
            ],
            [
                10844,
                10988
            ],
            [
                10988,
                11063
            ],
            [
                11063,
                11261
            ],
            [
                11261,
                11475
            ],
            [
                11475,
                11669
            ],
            [
                11669,
                11803
            ],
            [
                11803,
                11955
            ],
            [
                11955,
                12099
            ],
            [
                12099,
                12374
            ],
            [
                12374,
                12476
            ],
            [
                12476,
                12581
            ],
            [
                12581,
                12653
            ],
            [
                12653,
                12670
            ],
            [
                12670,
                12767
            ],
            [
                12767,
                12805
            ],
            [
                12805,
                12811
            ],
            [
                12811,
                12840
            ],
            [
                12840,
                12958
            ],
            [
                12958,
                12991
            ],
            [
                12991,
                13046
            ],
            [
                13046,
                13143
            ],
            [
                13143,
                13261
            ],
            [
                13261,
                13346
            ],
            [
                13346,
                13384
            ],
            [
                13384,
                13426
            ],
            [
                13426,
                13496
            ],
            [
                13496,
                13556
            ],
            [
                13556,
                13626
            ],
            [
                13626,
                13670
            ],
            [
                13670,
                13703
            ],
            [
                13703,
                13821
            ],
            [
                13821,
                13845
            ],
            [
                13845,
                13876
            ],
            [
                13876,
                13959
            ],
            [
                13959,
                14019
            ],
            [
                14019,
                14039
            ],
            [
                14039,
                14089
            ],
            [
                14089,
                14177
            ],
            [
                14177,
                14194
            ],
            [
                14194,
                14194
            ],
            [
                14194,
                14194
            ],
            [
                14194,
                14218
            ],
            [
                14218,
                14246
            ],
            [
                14246,
                14271
            ],
            [
                14271,
                14464
            ],
            [
                14464,
                14507
            ],
            [
                14507,
                14616
            ],
            [
                14616,
                14686
            ],
            [
                14686,
                14741
            ],
            [
                14741,
                14917
            ],
            [
                14917,
                14972
            ],
            [
                14972,
                15016
            ],
            [
                15016,
                15082
            ],
            [
                15082,
                15127
            ],
            [
                15127,
                15183
            ],
            [
                15183,
                15300
            ],
            [
                15300,
                15345
            ],
            [
                15345,
                15395
            ],
            [
                15395,
                15518
            ],
            [
                15518,
                15571
            ],
            [
                15571,
                15652
            ],
            [
                15652,
                15701
            ]
        ]
    }
}