{
    "original": {
        "text": "\"Let China's earth, enriched with coloured stains, Pencil'd with gold, and streaked with azure veins, The grateful flavour of the Indian leaf, Or Mocha's sunburnt berry glad receive.\" MRS. BARBOULD.\nThe day after this meeting with Higgins and his daughter Mr. Hale came upstairs into the little drawing-room at an unusual hour. He went up to different objects in the room, as if examining them, but Margaret saw that it was merely a nervous trick--a way of putting off something he wished, yet feared to say. Out it came at last--\n\"My dear! I've asked Mr. Thornton to come to tea to-night.\"\nMrs. Hale was leaning back in her easy chair, with her eyes shut, and an expression of pain on her face which had become habitual to her of late. But she roused up into querulousness at this speech of her husband's.\n\"Mr. Thornton!--and to-night! What in the world does the man want to come here for? And Dixon is washing my muslins and laces, and there is no soft water with these horrid east winds, which I suppose we shall have all the year round in Milton.\n\"The wind is veering round, my dear,\" said Mr. Hale, looking out at the smoke, which drifted right from the east, only he did not yet understand the points of the compass, and rather arranged them ad libitum according to circumstances.\n\"Don't tell me!\" said Mrs. Hale, shuddering up, and wrapping her shawl about her still more closely. \"But, east or west wind, I suppose this man comes.\"\n\"Oh mamma, that shows you never saw Mr. Thornton. He looks like a person who would enjoy battling with every adverse thing he could meet with--enemies, winds, or circumstances. The more it rains and blows, the more certain we are to have him. But I'll go and help Dixon. I'm getting to be a famous clear-starcher. And he won't want any amusement beyond talking to Papa. Papa, I am really longing to see the Pythias to your Damon. You know I never saw him but once, and then we were so puzzled to know what to say to each other that we did not get on particularly well.\"\n\"I don't know that you would ever like him, or think him agreeable, Margaret. He is not a lady's man.\"\nMargaret wreathed her throat in a scornful curve.\n\"I don't particularly admire ladies' men, papa. But Mr. Thornton comes here as your friend--as one who has appreciated you\"--\n\"The only person in Milton,\" said Mrs. Hale.\n\"So we will give him a welcome, and some cocoa-nut cakes. Dixon will be flattered if we ask her to make some; and I will undertake to iron your caps, mamma.\"\nMany a time that morning did Margaret wish Mr. Thornton far enough away. She had planned other employments for herself: a letter to Edith, a good piece of Dante, a visit to the Higginses. But, instead, she ironed away, listening to Dixon's complaints, and only hoping that by an excess of sympathy she might prevent her from carrying the recital of her sorrows to Mrs. Hale. Every now and then, Margaret had to remind herself of her father's regard for Mr. Thornton, to subdue the irritation of weariness that was stealing over her, and bringing on one of the bad headaches to which she had lately become liable. She could hardly speak when she sat down at last, and told her mother that she was no longer Peggy the laundry-maid, but Margaret Hale the lady. She meant this speech for a little joke, and was vexed enough with her busy tongue when she found her mother taking it seriously.\n\"Yes! if any one had told me, when I was Miss Beresford, and one of the belles of the country, that a child of mine would have to stand half a day, in a little poky kitchen, working away like any servant, that we might prepare properly for the reception of a tradesman, and that this tradesman should be the only\"--\n\"Oh, mamma!\" said Margaret, lifting herself up, \"don't punish me for so careless a speech. I don't mind ironing, or any kind of work for you and papa. I am myself a born and bred lady through it all, even though it comes to scouring a floor, or washing dishes. I am tired now, just for a little while; but in half an hour I shall be ready to do the same over again. And as to Mr. Thornton's being in trade, why he can't help that now, poor fellow. I don't suppose his education would fit him for much else,\" Margaret lifted herself slowly up, and went to her own room; for just now she could not bear much more.\nIn Mr. Thornton's house, at this very same time, a similar, yet different scene was going on. A large-boned lady, long past middle age, sat at work in a grim handsomely-furnished dining-room. Her features, like her frame, were strong and massive, rather than heavy. Her face moved slowly from one decided expression to another equally decided. There was no great variety in her countenance; but those who looked at it once, generally looked at it again; even the passers by in the street, half-turned their heads to gaze an instant longer at the firm, severe, dignified woman, who never gave way in street-courtesy, or paused in her straight-onward course to the clearly defined end which she proposed to herself.\nShe was handsomely dressed in stout black silk, of which not a thread was worn or discoloured. She was mending a large, long table-cloth of the finest texture, holding it up against the light occasionally to discover thin places, which required her delicate care. There was not a book about in the room, with the exception of Matthew Henry's Bible commentaries, six volumes of which lay in the centre of the massive side-board, flanked by a tea-urn on one side, and a lamp on the other. In some remote apartment, there was exercise upon the piano going on. Someone was practising up a morceau de salon, playing it very rapidly, every third note, on an average, being either indistinct, or wholly missed out, and the loud chords at the end being half of them false, but not the less satisfactory to the performer. Mrs. Thornton heard a step, like her own in its decisive character, pass the dining-room door.\n\"John! Is that you?\"\nHer son opened the door, and showed himself.\n\"What has brought you home so early? I thought you were going to tea with that friend of Mr. Bell's; that Mr. Hale?\"\n\"So I am, mother. I am come home to dress!\"\n\"Dress! humph! When I was a girl, young men were satisfied with dressing once in a day. Why should you dress to go and take a cup of tea with an old parson?\"\n\"Mr. Hale is a gentleman, and his wife and daughter are ladies.\"\n\"Wife and daughter! Do they teach too? What do they do? You have never mentioned them.\"\n\"No! mother, because I have never seen Mrs. Hale; I have only seen Miss Hale for half an hour.\"\n\"Take care you don't get caught by a penniless girl, John.\"\n\"I am not easily caught, mother, as I think you know. But I must not have Miss Hale spoken of in that way, which, you know, is offensive to me. I never was aware of any young lady trying to catch me yet, nor do I believe that any one has ever given themselves that useless trouble.\"\nMrs. Thornton did not choose to yield the point to her son; or else she had, in general, pride enough for her sex.\n\"Well! I only say, take care. Perhaps our Milton girls have too much spirit and good feeling to go angling after husbands; but this Miss Hale comes out of the aristocratic counties, where, if all tales be true, rich husbands are reckoned prizes.\"\nMr. Thornton's brow contracted, and he came a step forward into the room.\n\"Mother\" (with a short scornful laugh), \"you will make me confess. The only time I saw Miss Hale, she treated me with a haughty civility which had a strong flavour of contempt in it. She held herself aloof from me as if she had been a queen, and I her humble, unwashed vassal. Be easy, mother.\"\n\"No! I am not easy nor content either. What business had she, a renegade clergyman's daughter, to turn up her nose at you! I would dress for none of them--a saucy set! if I were you.\" As he was leaving the room he said:--\n\"Mr. Hale is good, and gentle, and learned. He is not saucy. As for Mrs. Hale, I will tell you what she is like to-night, if you care to hear.\" He shut the door, and was gone.\n\"Despise my son! treat him as her vassal, indeed! Humph! I should like to know where she could find such another! Boy and man, he's the noblest, stoutest heart I ever knew. I don't care if I am his mother; I can see what's what, and not be blind. I know what Fanny is; and I know what John is. Despise him! I hate her!\"",
        "paragraph_chars": [
            [
                0,
                199
            ],
            [
                199,
                531
            ],
            [
                531,
                591
            ],
            [
                591,
                807
            ],
            [
                807,
                1051
            ],
            [
                1051,
                1287
            ],
            [
                1287,
                1440
            ],
            [
                1440,
                2010
            ],
            [
                2010,
                2113
            ],
            [
                2113,
                2163
            ],
            [
                2163,
                2289
            ],
            [
                2289,
                2334
            ],
            [
                2334,
                2492
            ],
            [
                2492,
                3380
            ],
            [
                3380,
                3696
            ],
            [
                3696,
                4308
            ],
            [
                4308,
                5022
            ],
            [
                5022,
                5930
            ],
            [
                5930,
                5951
            ],
            [
                5951,
                5996
            ],
            [
                5996,
                6113
            ],
            [
                6113,
                6157
            ],
            [
                6157,
                6315
            ],
            [
                6315,
                6380
            ],
            [
                6380,
                6468
            ],
            [
                6468,
                6564
            ],
            [
                6564,
                6624
            ],
            [
                6624,
                6907
            ],
            [
                6907,
                7022
            ],
            [
                7022,
                7269
            ],
            [
                7269,
                7343
            ],
            [
                7343,
                7638
            ],
            [
                7638,
                7860
            ],
            [
                7860,
                8036
            ],
            [
                8036,
                8355
            ]
        ],
        "segment_chars": [
            [
                0,
                184
            ],
            [
                184,
                199
            ],
            [
                199,
                328
            ],
            [
                328,
                509
            ],
            [
                509,
                531
            ],
            [
                531,
                541
            ],
            [
                541,
                591
            ],
            [
                591,
                737
            ],
            [
                737,
                807
            ],
            [
                807,
                812
            ],
            [
                812,
                837
            ],
            [
                837,
                891
            ],
            [
                891,
                1051
            ],
            [
                1051,
                1287
            ],
            [
                1287,
                1304
            ],
            [
                1304,
                1388
            ],
            [
                1388,
                1440
            ],
            [
                1440,
                1490
            ],
            [
                1490,
                1617
            ],
            [
                1617,
                1683
            ],
            [
                1683,
                1711
            ],
            [
                1711,
                1754
            ],
            [
                1754,
                1810
            ],
            [
                1810,
                1870
            ],
            [
                1870,
                2010
            ],
            [
                2010,
                2088
            ],
            [
                2088,
                2113
            ],
            [
                2113,
                2163
            ],
            [
                2163,
                2211
            ],
            [
                2211,
                2289
            ],
            [
                2289,
                2334
            ],
            [
                2334,
                2392
            ],
            [
                2392,
                2492
            ],
            [
                2492,
                2565
            ],
            [
                2565,
                2680
            ],
            [
                2680,
                2867
            ],
            [
                2867,
                3105
            ],
            [
                3105,
                3250
            ],
            [
                3250,
                3380
            ],
            [
                3380,
                3386
            ],
            [
                3386,
                3696
            ],
            [
                3696,
                3709
            ],
            [
                3709,
                3787
            ],
            [
                3787,
                3847
            ],
            [
                3847,
                3957
            ],
            [
                3957,
                4062
            ],
            [
                4062,
                4144
            ],
            [
                4144,
                4308
            ],
            [
                4308,
                4402
            ],
            [
                4402,
                4500
            ],
            [
                4500,
                4574
            ],
            [
                4574,
                4652
            ],
            [
                4652,
                5022
            ],
            [
                5022,
                5117
            ],
            [
                5117,
                5286
            ],
            [
                5286,
                5509
            ],
            [
                5509,
                5579
            ],
            [
                5579,
                5835
            ],
            [
                5835,
                5930
            ],
            [
                5930,
                5937
            ],
            [
                5937,
                5951
            ],
            [
                5951,
                5996
            ],
            [
                5996,
                6033
            ],
            [
                6033,
                6113
            ],
            [
                6113,
                6131
            ],
            [
                6131,
                6157
            ],
            [
                6157,
                6165
            ],
            [
                6165,
                6172
            ],
            [
                6172,
                6245
            ],
            [
                6245,
                6315
            ],
            [
                6315,
                6380
            ],
            [
                6380,
                6400
            ],
            [
                6400,
                6419
            ],
            [
                6419,
                6436
            ],
            [
                6436,
                6468
            ],
            [
                6468,
                6473
            ],
            [
                6473,
                6564
            ],
            [
                6564,
                6624
            ],
            [
                6624,
                6678
            ],
            [
                6678,
                6768
            ],
            [
                6768,
                6907
            ],
            [
                6907,
                7022
            ],
            [
                7022,
                7029
            ],
            [
                7029,
                7052
            ],
            [
                7052,
                7269
            ],
            [
                7269,
                7343
            ],
            [
                7343,
                7410
            ],
            [
                7410,
                7526
            ],
            [
                7526,
                7620
            ],
            [
                7620,
                7638
            ],
            [
                7638,
                7643
            ],
            [
                7643,
                7677
            ],
            [
                7677,
                7761
            ],
            [
                7761,
                7806
            ],
            [
                7806,
                7822
            ],
            [
                7822,
                7860
            ],
            [
                7860,
                7904
            ],
            [
                7904,
                7921
            ],
            [
                7921,
                8004
            ],
            [
                8004,
                8036
            ],
            [
                8036,
                8053
            ],
            [
                8053,
                8086
            ],
            [
                8086,
                8093
            ],
            [
                8093,
                8150
            ],
            [
                8150,
                8209
            ],
            [
                8209,
                8283
            ],
            [
                8283,
                8330
            ],
            [
                8330,
                8343
            ],
            [
                8343,
                8355
            ]
        ],
        "overlap_chars": [
            [
                199,
                255
            ],
            [
                256,
                307
            ],
            [
                326,
                328
            ],
            [
                328,
                330
            ],
            [
                339,
                341
            ],
            [
                342,
                359
            ],
            [
                393,
                440
            ],
            [
                450,
                509
            ],
            [
                509,
                528
            ],
            [
                535,
                541
            ],
            [
                541,
                579
            ],
            [
                591,
                737
            ],
            [
                737,
                740
            ],
            [
                741,
                754
            ],
            [
                760,
                764
            ],
            [
                805,
                807
            ],
            [
                810,
                812
            ],
            [
                812,
                820
            ],
            [
                835,
                837
            ],
            [
                837,
                891
            ],
            [
                891,
                1024
            ],
            [
                1029,
                1033
            ],
            [
                1040,
                1049
            ],
            [
                1170,
                1172
            ],
            [
                1056,
                1086
            ],
            [
                1089,
                1128
            ],
            [
                1227,
                1233
            ],
            [
                1285,
                1287
            ],
            [
                1291,
                1301
            ],
            [
                1304,
                1330
            ],
            [
                1333,
                1357
            ],
            [
                1358,
                1367
            ],
            [
                1386,
                1388
            ],
            [
                1389,
                1437
            ],
            [
                1441,
                1443
            ],
            [
                1590,
                1591
            ],
            [
                1444,
                1450
            ],
            [
                1476,
                1488
            ],
            [
                1493,
                1542
            ],
            [
                1592,
                1597
            ],
            [
                1615,
                1617
            ],
            [
                1617,
                1683
            ],
            [
                1687,
                1711
            ],
            [
                1754,
                1810
            ],
            [
                1870,
                1878
            ],
            [
                1814,
                1817
            ],
            [
                1891,
                1894
            ],
            [
                1899,
                2007
            ],
            [
                2088,
                2110
            ],
            [
                2113,
                2121
            ],
            [
                2147,
                2155
            ],
            [
                2161,
                2162
            ],
            [
                2164,
                2211
            ],
            [
                2211,
                2253
            ],
            [
                2335,
                2392
            ],
            [
                2392,
                2454
            ],
            [
                2468,
                2489
            ],
            [
                2521,
                2529
            ],
            [
                2569,
                2630
            ],
            [
                2647,
                2680
            ],
            [
                2680,
                2747
            ],
            [
                2753,
                2764
            ],
            [
                2808,
                2811
            ],
            [
                2781,
                2789
            ],
            [
                2794,
                2807
            ],
            [
                2812,
                2867
            ],
            [
                2887,
                2972
            ],
            [
                2987,
                3105
            ],
            [
                3105,
                3250
            ],
            [
                3250,
                3304
            ],
            [
                3312,
                3316
            ],
            [
                3333,
                3380
            ],
            [
                3381,
                3386
            ],
            [
                3386,
                3388
            ],
            [
                3397,
                3436
            ],
            [
                3475,
                3515
            ],
            [
                3528,
                3584
            ],
            [
                3585,
                3606
            ],
            [
                3637,
                3648
            ],
            [
                3697,
                3706
            ],
            [
                3709,
                3723
            ],
            [
                3787,
                3828
            ],
            [
                3742,
                3743
            ],
            [
                3829,
                3847
            ],
            [
                3847,
                3851
            ],
            [
                3859,
                3894
            ],
            [
                3955,
                3957
            ],
            [
                3957,
                3961
            ],
            [
                3973,
                3977
            ],
            [
                3962,
                3971
            ],
            [
                3996,
                4062
            ],
            [
                4062,
                4106
            ],
            [
                4107,
                4125
            ],
            [
                4129,
                4144
            ],
            [
                4144,
                4201
            ],
            [
                4228,
                4234
            ],
            [
                4239,
                4308
            ],
            [
                4308,
                4366
            ],
            [
                4382,
                4402
            ],
            [
                4402,
                4500
            ],
            [
                4500,
                4512
            ],
            [
                4530,
                4554
            ],
            [
                4605,
                4623
            ],
            [
                4650,
                4652
            ],
            [
                5022,
                5029
            ],
            [
                5083,
                5084
            ],
            [
                4854,
                4884
            ],
            [
                5030,
                5051
            ],
            [
                5058,
                5068
            ],
            [
                5115,
                5117
            ],
            [
                5117,
                5140
            ],
            [
                5147,
                5158
            ],
            [
                5180,
                5226
            ],
            [
                5284,
                5286
            ],
            [
                5286,
                5306
            ],
            [
                5313,
                5325
            ],
            [
                5384,
                5398
            ],
            [
                5364,
                5383
            ],
            [
                5399,
                5408
            ],
            [
                5495,
                5501
            ],
            [
                5438,
                5442
            ],
            [
                5443,
                5470
            ],
            [
                5484,
                5494
            ],
            [
                5507,
                5509
            ],
            [
                5509,
                5523
            ],
            [
                5533,
                5534
            ],
            [
                5579,
                5601
            ],
            [
                5559,
                5568
            ],
            [
                5636,
                5648
            ],
            [
                5730,
                5733
            ],
            [
                5833,
                5835
            ],
            [
                5835,
                5856
            ],
            [
                5883,
                5891
            ],
            [
                5857,
                5861
            ],
            [
                5903,
                5930
            ],
            [
                5931,
                5937
            ],
            [
                5937,
                5948
            ],
            [
                5951,
                5974
            ],
            [
                5994,
                5996
            ],
            [
                5997,
                6033
            ],
            [
                6033,
                6074
            ],
            [
                6102,
                6110
            ],
            [
                6117,
                6129
            ],
            [
                6131,
                6154
            ],
            [
                6163,
                6165
            ],
            [
                6165,
                6172
            ],
            [
                6245,
                6312
            ],
            [
                6318,
                6319
            ],
            [
                6320,
                6377
            ],
            [
                6381,
                6400
            ],
            [
                6400,
                6419
            ],
            [
                6419,
                6436
            ],
            [
                6436,
                6465
            ],
            [
                6469,
                6473
            ],
            [
                6481,
                6561
            ],
            [
                6570,
                6621
            ],
            [
                6625,
                6678
            ],
            [
                6678,
                6768
            ],
            [
                6768,
                6853
            ],
            [
                6858,
                6861
            ],
            [
                6867,
                6904
            ],
            [
                7023,
                7029
            ],
            [
                7029,
                7052
            ],
            [
                7052,
                7266
            ],
            [
                7269,
                7299
            ],
            [
                7341,
                7342
            ],
            [
                7352,
                7382
            ],
            [
                7401,
                7408
            ],
            [
                7410,
                7518
            ],
            [
                7524,
                7526
            ],
            [
                7526,
                7529
            ],
            [
                7557,
                7559
            ],
            [
                7543,
                7548
            ],
            [
                7576,
                7583
            ],
            [
                7618,
                7620
            ],
            [
                7620,
                7635
            ],
            [
                7639,
                7643
            ],
            [
                7643,
                7656
            ],
            [
                7675,
                7677
            ],
            [
                7677,
                7761
            ],
            [
                7761,
                7774
            ],
            [
                7775,
                7791
            ],
            [
                7806,
                7819
            ],
            [
                7863,
                7864
            ],
            [
                7865,
                7904
            ],
            [
                7921,
                7971
            ],
            [
                7980,
                8001
            ],
            [
                8004,
                8020
            ],
            [
                8022,
                8036
            ],
            [
                8041,
                8053
            ],
            [
                8086,
                8093
            ],
            [
                8093,
                8150
            ],
            [
                8163,
                8209
            ],
            [
                8209,
                8263
            ],
            [
                8281,
                8283
            ],
            [
                8283,
                8330
            ],
            [
                8330,
                8343
            ],
            [
                8343,
                8353
            ]
        ],
        "row_chars": [
            [
                0,
                184
            ],
            [
                184,
                199
            ],
            [
                199,
                328
            ],
            [
                328,
                509
            ],
            [
                509,
                531
            ],
            [
                531,
                541
            ],
            [
                541,
                591
            ],
            [
                591,
                737
            ],
            [
                737,
                807
            ],
            [
                807,
                812
            ],
            [
                812,
                837
            ],
            [
                837,
                891
            ],
            [
                891,
                1051
            ],
            [
                1051,
                1287
            ],
            [
                1287,
                1304
            ],
            [
                1304,
                1388
            ],
            [
                1388,
                1440
            ],
            [
                1440,
                1617
            ],
            [
                1617,
                1683
            ],
            [
                1683,
                1711
            ],
            [
                1711,
                1754
            ],
            [
                1754,
                1810
            ],
            [
                1810,
                2010
            ],
            [
                2010,
                2088
            ],
            [
                2088,
                2113
            ],
            [
                2113,
                2163
            ],
            [
                2163,
                2211
            ],
            [
                2211,
                2392
            ],
            [
                2392,
                2492
            ],
            [
                2492,
                2680
            ],
            [
                2680,
                2867
            ],
            [
                2867,
                3105
            ],
            [
                3105,
                3250
            ],
            [
                3250,
                3380
            ],
            [
                3380,
                3386
            ],
            [
                3386,
                3696
            ],
            [
                3696,
                3709
            ],
            [
                3709,
                3847
            ],
            [
                3847,
                3957
            ],
            [
                3957,
                4062
            ],
            [
                4062,
                4144
            ],
            [
                4144,
                4308
            ],
            [
                4308,
                4402
            ],
            [
                4402,
                4500
            ],
            [
                4500,
                4652
            ],
            [
                4652,
                5117
            ],
            [
                5117,
                5286
            ],
            [
                5286,
                5509
            ],
            [
                5509,
                5835
            ],
            [
                5835,
                5930
            ],
            [
                5930,
                5937
            ],
            [
                5937,
                5951
            ],
            [
                5951,
                5996
            ],
            [
                5996,
                6033
            ],
            [
                6033,
                6113
            ],
            [
                6113,
                6157
            ],
            [
                6157,
                6165
            ],
            [
                6165,
                6172
            ],
            [
                6172,
                6245
            ],
            [
                6245,
                6315
            ],
            [
                6315,
                6380
            ],
            [
                6380,
                6400
            ],
            [
                6400,
                6419
            ],
            [
                6419,
                6436
            ],
            [
                6436,
                6468
            ],
            [
                6468,
                6473
            ],
            [
                6473,
                6564
            ],
            [
                6564,
                6624
            ],
            [
                6624,
                6678
            ],
            [
                6678,
                6768
            ],
            [
                6768,
                6907
            ],
            [
                6907,
                7022
            ],
            [
                7022,
                7029
            ],
            [
                7029,
                7052
            ],
            [
                7052,
                7269
            ],
            [
                7269,
                7343
            ],
            [
                7343,
                7526
            ],
            [
                7526,
                7620
            ],
            [
                7620,
                7638
            ],
            [
                7638,
                7643
            ],
            [
                7643,
                7677
            ],
            [
                7677,
                7761
            ],
            [
                7761,
                7822
            ],
            [
                7822,
                7860
            ],
            [
                7860,
                7904
            ],
            [
                7904,
                7921
            ],
            [
                7921,
                8004
            ],
            [
                8004,
                8036
            ],
            [
                8036,
                8053
            ],
            [
                8053,
                8086
            ],
            [
                8086,
                8093
            ],
            [
                8093,
                8150
            ],
            [
                8150,
                8209
            ],
            [
                8209,
                8283
            ],
            [
                8283,
                8330
            ],
            [
                8330,
                8343
            ],
            [
                8343,
                8355
            ]
        ]
    },
    "abridged": {
        "text": "The day after this meeting with Higgins and his daughter, Mr. Hale came upstairs into the little drawing-room. He began to examine different objects there, but Margaret saw that it was merely a nervous way of putting off something he wished, yet feared to say. Out it came at last-\n'My dear! I've asked Mr. Thornton to come to tea tonight.'\nMrs. Hale was leaning back in her easy chair, with her eyes shut, and an expression of pain on her face which had become habitual to her of late. But now she roused up querulously.\n'Mr. Thornton! tonight! What in the world does the man want to come here for? And Dixon is washing my muslins and laces, and there is no soft water with these horrid east winds, which I suppose we shall have all year in Milton.'\n'The wind is veering round, my dear,' said Mr. Hale, looking out at the smoke rather vaguely.\n'Don't tell me!' said Mrs. Hale, shuddering, and wrapping her shawl tightly about her. 'But, east or west wind, I suppose this man comes.'\n'Oh, mamma, Mr. Thornton looks like a person who would enjoy battling with everything - winds included. The more it rains and blows, the more certain we are to have him. I'll go and help Dixon. And he won't want any amusement beyond talking to papa. You know, Papa, I have only seen him once, and then we were so puzzled to know what to say to each other that we did not get on particularly well.'\n'He is not a lady's man.'\nMargaret looked scornful. 'I don't particularly admire ladies' men, papa. But Mr. Thornton comes here as your friend, so we will give him a welcome, and some cocoa-nut cakes. Dixon will be flattered if we ask her to make some; and I will iron your caps, mamma.'\nMargaret had planned other employments for herself: a letter to Edith, some Dante, a visit to the Higginses. But, instead, she ironed away, listening to Dixon's complaints, and hoping that her sympathy might prevent Dixon from carrying the recital of her sorrows to Mrs. Hale. Margaret had to remind herself of her father's regard for Mr. Thornton, to subdue the weariness that was stealing over her, and bringing on one of the bad headaches to which she had lately become liable. She could hardly speak when she sat down at last, and told her mother that she was no longer Peggy the laundry-maid, but Margaret Hale the lady. She meant this speech for a little joke, and was vexed with herself when she found her mother taking it seriously.\n'Yes! if anyone had told me, when I was Miss Beresford, that a child of mine would have to stand in a little poky kitchen, working away like any servant, so that we might prepare to receive a tradesman-'\n'Oh, mamma!' said Margaret, 'I don't mind ironing, or any kind of work, for you and papa. I am a born and bred lady through it all. I am just tired now; but in half an hour I shall be ready to do the same over again. And as to Mr. Thornton's being in trade, why, he can't help that, poor fellow. I don't suppose his education would fit him for much else.' She rose slowly and went to her own room; for just now she could not bear much more.\nIn Mr. Thornton's house, at this very same time, a similar scene was going on. A large-boned lady, long past middle age, sat at work in a grim handsomely-furnished dining-room. Her features were strong and massive, and held a decided expression. She was a firm, severe, dignified woman, handsomely dressed in black silk. She was mending a large table-cloth, holding it up against the light occasionally. There was not a book in the room, except six volumes of Bible Commentaries, which lay on the sideboard, flanked by a tea-urn and a lamp. In some remote room, someone was practising the piano very rapidly and rather carelessly. Mrs. Thornton heard a decisive step pass the dining-room door.\n'John! Is that you?'\nHer son opened the door.\n'What has brought you home so early? I thought you were going to tea with that Mr. Hale.'\n'So I am, mother; I am come home to dress!'\n'Dress! humph! Why should you dress to go and take a cup of tea with an old parson?'\n'Mr. Hale is a gentleman, and his wife and daughter are ladies.'\n'Wife and daughter! Do they teach too? What do they do? You have never mentioned them.'\n'No! because I have never seen Mrs. Hale; I have only seen Miss Hale for half an hour.'\n'Take care you don't get caught by a penniless girl, John.'\n'I am not easily caught, mother, as I think you know. But I must not have Miss Hale spoken of in that way, which, you know, is offensive to me. I never was aware of any young lady trying to catch me yet, nor do I believe that any has given themselves that useless trouble.'\n'Well! I only say, take care. Perhaps our Milton girls have too much spirit and good feeling to go angling after husbands; but this Miss Hale comes out of the aristocratic counties, where, if all tales be true, rich husbands are reckoned prizes.'\nMr. Thornton's brow contracted. 'Mother,' (with a short scornful laugh), 'I confess that the only time I saw Miss Hale, she treated me with a haughty civility which had a strong flavour of contempt. She was as aloof as a queen. Be easy, mother.'\n'No! I am not easy. What business had she, a renegade clergyman's daughter, to turn up her nose at you! I would dress up for none of them, if I were you.'\n'Mr. Hale is good, and gentle, and learned. As for Mrs. Hale, I will tell you what she is like tonight, if you care to hear.' He shut the door and was gone.\n'Despise my son! Humph! I should like to know where she could find such another! He's the noblest, stoutest heart I ever knew. I don't care if I am his mother; I can see what's what. I know what Fanny is; and I know what John is. Despise him! I hate her!'",
        "paragraph_chars": [
            [
                0,
                282
            ],
            [
                282,
                341
            ],
            [
                341,
                522
            ],
            [
                522,
                751
            ],
            [
                751,
                845
            ],
            [
                845,
                984
            ],
            [
                984,
                1382
            ],
            [
                1382,
                1408
            ],
            [
                1408,
                1670
            ],
            [
                1670,
                2411
            ],
            [
                2411,
                2615
            ],
            [
                2615,
                3056
            ],
            [
                3056,
                3750
            ],
            [
                3750,
                3771
            ],
            [
                3771,
                3796
            ],
            [
                3796,
                3886
            ],
            [
                3886,
                3930
            ],
            [
                3930,
                4015
            ],
            [
                4015,
                4080
            ],
            [
                4080,
                4168
            ],
            [
                4168,
                4256
            ],
            [
                4256,
                4316
            ],
            [
                4316,
                4590
            ],
            [
                4590,
                4837
            ],
            [
                4837,
                5083
            ],
            [
                5083,
                5238
            ],
            [
                5238,
                5395
            ],
            [
                5395,
                5650
            ]
        ],
        "segment_chars": [
            [
                0,
                111
            ],
            [
                111,
                261
            ],
            [
                261,
                282
            ],
            [
                282,
                292
            ],
            [
                292,
                341
            ],
            [
                341,
                487
            ],
            [
                487,
                522
            ],
            [
                522,
                527
            ],
            [
                527,
                537
            ],
            [
                537,
                546
            ],
            [
                546,
                600
            ],
            [
                600,
                751
            ],
            [
                751,
                845
            ],
            [
                845,
                862
            ],
            [
                862,
                932
            ],
            [
                932,
                984
            ],
            [
                984,
                1088
            ],
            [
                1088,
                1154
            ],
            [
                1154,
                1178
            ],
            [
                1178,
                1234
            ],
            [
                1234,
                1382
            ],
            [
                1382,
                1408
            ],
            [
                1408,
                1434
            ],
            [
                1434,
                1482
            ],
            [
                1482,
                1583
            ],
            [
                1583,
                1670
            ],
            [
                1670,
                1779
            ],
            [
                1779,
                1947
            ],
            [
                1947,
                2151
            ],
            [
                2151,
                2296
            ],
            [
                2296,
                2411
            ],
            [
                2411,
                2417
            ],
            [
                2417,
                2615
            ],
            [
                2615,
                2628
            ],
            [
                2628,
                2705
            ],
            [
                2705,
                2747
            ],
            [
                2747,
                2832
            ],
            [
                2832,
                2911
            ],
            [
                2911,
                2971
            ],
            [
                2971,
                3056
            ],
            [
                3056,
                3135
            ],
            [
                3135,
                3233
            ],
            [
                3233,
                3302
            ],
            [
                3302,
                3377
            ],
            [
                3377,
                3460
            ],
            [
                3460,
                3597
            ],
            [
                3597,
                3687
            ],
            [
                3687,
                3750
            ],
            [
                3750,
                3757
            ],
            [
                3757,
                3771
            ],
            [
                3771,
                3796
            ],
            [
                3796,
                3833
            ],
            [
                3833,
                3886
            ],
            [
                3886,
                3930
            ],
            [
                3930,
                3938
            ],
            [
                3938,
                3945
            ],
            [
                3945,
                4015
            ],
            [
                4015,
                4020
            ],
            [
                4020,
                4080
            ],
            [
                4080,
                4100
            ],
            [
                4100,
                4119
            ],
            [
                4119,
                4136
            ],
            [
                4136,
                4168
            ],
            [
                4168,
                4173
            ],
            [
                4173,
                4256
            ],
            [
                4256,
                4316
            ],
            [
                4316,
                4370
            ],
            [
                4370,
                4460
            ],
            [
                4460,
                4590
            ],
            [
                4590,
                4597
            ],
            [
                4597,
                4620
            ],
            [
                4620,
                4837
            ],
            [
                4837,
                4869
            ],
            [
                4869,
                5036
            ],
            [
                5036,
                5065
            ],
            [
                5065,
                5083
            ],
            [
                5083,
                5088
            ],
            [
                5088,
                5103
            ],
            [
                5103,
                5187
            ],
            [
                5187,
                5238
            ],
            [
                5238,
                5243
            ],
            [
                5243,
                5282
            ],
            [
                5282,
                5364
            ],
            [
                5364,
                5395
            ],
            [
                5395,
                5412
            ],
            [
                5412,
                5419
            ],
            [
                5419,
                5476
            ],
            [
                5476,
                5522
            ],
            [
                5522,
                5578
            ],
            [
                5578,
                5625
            ],
            [
                5625,
                5638
            ],
            [
                5638,
                5650
            ]
        ],
        "overlap_chars": [
            [
                0,
                56
            ],
            [
                58,
                109
            ],
            [
                109,
                111
            ],
            [
                111,
                113
            ],
            [
                120,
                122
            ],
            [
                131,
                148
            ],
            [
                154,
                201
            ],
            [
                202,
                261
            ],
            [
                261,
                280
            ],
            [
                286,
                292
            ],
            [
                292,
                330
            ],
            [
                341,
                487
            ],
            [
                487,
                490
            ],
            [
                495,
                508
            ],
            [
                509,
                513
            ],
            [
                520,
                522
            ],
            [
                525,
                527
            ],
            [
                527,
                535
            ],
            [
                544,
                546
            ],
            [
                546,
                600
            ],
            [
                600,
                733
            ],
            [
                734,
                738
            ],
            [
                739,
                748
            ],
            [
                753,
                755
            ],
            [
                756,
                786
            ],
            [
                789,
                828
            ],
            [
                829,
                835
            ],
            [
                843,
                845
            ],
            [
                849,
                859
            ],
            [
                862,
                888
            ],
            [
                888,
                912
            ],
            [
                921,
                930
            ],
            [
                930,
                932
            ],
            [
                933,
                981
            ],
            [
                985,
                987
            ],
            [
                987,
                988
            ],
            [
                989,
                995
            ],
            [
                996,
                1008
            ],
            [
                1009,
                1058
            ],
            [
                1072,
                1077
            ],
            [
                1086,
                1088
            ],
            [
                1088,
                1154
            ],
            [
                1154,
                1178
            ],
            [
                1178,
                1234
            ],
            [
                1234,
                1242
            ],
            [
                1248,
                1251
            ],
            [
                1267,
                1270
            ],
            [
                1271,
                1379
            ],
            [
                1383,
                1405
            ],
            [
                1408,
                1416
            ],
            [
                1424,
                1432
            ],
            [
                1432,
                1433
            ],
            [
                1435,
                1482
            ],
            [
                1482,
                1524
            ],
            [
                1526,
                1583
            ],
            [
                1583,
                1645
            ],
            [
                1646,
                1667
            ],
            [
                1670,
                1678
            ],
            [
                1679,
                1740
            ],
            [
                1746,
                1779
            ],
            [
                1779,
                1846
            ],
            [
                1847,
                1858
            ],
            [
                1859,
                1862
            ],
            [
                1863,
                1871
            ],
            [
                1872,
                1885
            ],
            [
                1892,
                1947
            ],
            [
                1947,
                2032
            ],
            [
                2033,
                2151
            ],
            [
                2151,
                2296
            ],
            [
                2296,
                2350
            ],
            [
                2351,
                2355
            ],
            [
                2364,
                2411
            ],
            [
                2412,
                2417
            ],
            [
                2417,
                2419
            ],
            [
                2427,
                2466
            ],
            [
                2467,
                2507
            ],
            [
                2508,
                2564
            ],
            [
                2568,
                2589
            ],
            [
                2601,
                2612
            ],
            [
                2616,
                2625
            ],
            [
                2628,
                2642
            ],
            [
                2644,
                2685
            ],
            [
                2685,
                2686
            ],
            [
                2687,
                2705
            ],
            [
                2705,
                2709
            ],
            [
                2710,
                2745
            ],
            [
                2745,
                2747
            ],
            [
                2747,
                2751
            ],
            [
                2752,
                2756
            ],
            [
                2757,
                2766
            ],
            [
                2766,
                2832
            ],
            [
                2832,
                2876
            ],
            [
                2878,
                2896
            ],
            [
                2896,
                2911
            ],
            [
                2911,
                2968
            ],
            [
                2980,
                2986
            ],
            [
                2987,
                3056
            ],
            [
                3056,
                3114
            ],
            [
                3115,
                3135
            ],
            [
                3135,
                3233
            ],
            [
                3233,
                3245
            ],
            [
                3246,
                3270
            ],
            [
                3282,
                3300
            ],
            [
                3300,
                3302
            ],
            [
                3302,
                3309
            ],
            [
                3310,
                3311
            ],
            [
                3312,
                3342
            ],
            [
                3343,
                3364
            ],
            [
                3365,
                3375
            ],
            [
                3375,
                3377
            ],
            [
                3377,
                3400
            ],
            [
                3401,
                3412
            ],
            [
                3412,
                3458
            ],
            [
                3458,
                3460
            ],
            [
                3460,
                3480
            ],
            [
                3481,
                3493
            ],
            [
                3501,
                3515
            ],
            [
                3516,
                3535
            ],
            [
                3536,
                3545
            ],
            [
                3546,
                3552
            ],
            [
                3553,
                3557
            ],
            [
                3557,
                3584
            ],
            [
                3585,
                3595
            ],
            [
                3595,
                3597
            ],
            [
                3597,
                3611
            ],
            [
                3616,
                3617
            ],
            [
                3618,
                3640
            ],
            [
                3641,
                3650
            ],
            [
                3651,
                3663
            ],
            [
                3664,
                3667
            ],
            [
                3685,
                3687
            ],
            [
                3687,
                3708
            ],
            [
                3709,
                3717
            ],
            [
                3718,
                3722
            ],
            [
                3723,
                3750
            ],
            [
                3751,
                3757
            ],
            [
                3757,
                3768
            ],
            [
                3771,
                3794
            ],
            [
                3794,
                3796
            ],
            [
                3797,
                3833
            ],
            [
                3833,
                3874
            ],
            [
                3875,
                3883
            ],
            [
                3890,
                3902
            ],
            [
                3904,
                3927
            ],
            [
                3936,
                3938
            ],
            [
                3938,
                3945
            ],
            [
                3945,
                4012
            ],
            [
                4018,
                4019
            ],
            [
                4020,
                4077
            ],
            [
                4081,
                4100
            ],
            [
                4100,
                4119
            ],
            [
                4119,
                4136
            ],
            [
                4136,
                4165
            ],
            [
                4169,
                4173
            ],
            [
                4173,
                4253
            ],
            [
                4262,
                4313
            ],
            [
                4317,
                4370
            ],
            [
                4370,
                4460
            ],
            [
                4460,
                4545
            ],
            [
                4546,
                4549
            ],
            [
                4550,
                4587
            ],
            [
                4591,
                4597
            ],
            [
                4597,
                4620
            ],
            [
                4620,
                4834
            ],
            [
                4837,
                4867
            ],
            [
                4867,
                4868
            ],
            [
                4879,
                4909
            ],
            [
                4913,
                4920
            ],
            [
                4926,
                5034
            ],
            [
                5034,
                5036
            ],
            [
                5036,
                5039
            ],
            [
                5044,
                5046
            ],
            [
                5047,
                5052
            ],
            [
                5056,
                5063
            ],
            [
                5063,
                5065
            ],
            [
                5065,
                5080
            ],
            [
                5084,
                5088
            ],
            [
                5088,
                5101
            ],
            [
                5101,
                5103
            ],
            [
                5103,
                5187
            ],
            [
                5187,
                5200
            ],
            [
                5204,
                5220
            ],
            [
                5222,
                5235
            ],
            [
                5241,
                5242
            ],
            [
                5243,
                5282
            ],
            [
                5282,
                5332
            ],
            [
                5340,
                5361
            ],
            [
                5364,
                5380
            ],
            [
                5381,
                5395
            ],
            [
                5400,
                5412
            ],
            [
                5412,
                5419
            ],
            [
                5419,
                5476
            ],
            [
                5476,
                5522
            ],
            [
                5522,
                5576
            ],
            [
                5576,
                5578
            ],
            [
                5578,
                5625
            ],
            [
                5625,
                5638
            ],
            [
                5638,
                5648
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                111
            ],
            [
                111,
                261
            ],
            [
                261,
                282
            ],
            [
                282,
                292
            ],
            [
                292,
                341
            ],
            [
                341,
                487
            ],
            [
                487,
                522
            ],
            [
                522,
                527
            ],
            [
                527,
                546
            ],
            [
                546,
                600
            ],
            [
                600,
                751
            ],
            [
                751,
                845
            ],
            [
                845,
                862
            ],
            [
                862,
                932
            ],
            [
                932,
                984
            ],
            [
                984,
                1088
            ],
            [
                1088,
                1154
            ],
            [
                1154,
                1178
            ],
            [
                1178,
                1178
            ],
            [
                1178,
                1234
            ],
            [
                1234,
                1382
            ],
            [
                1382,
                1382
            ],
            [
                1382,
                1408
            ],
            [
                1408,
                1434
            ],
            [
                1434,
                1482
            ],
            [
                1482,
                1583
            ],
            [
                1583,
                1670
            ],
            [
                1670,
                1779
            ],
            [
                1779,
                1947
            ],
            [
                1947,
                2151
            ],
            [
                2151,
                2296
            ],
            [
                2296,
                2411
            ],
            [
                2411,
                2417
            ],
            [
                2417,
                2615
            ],
            [
                2615,
                2628
            ],
            [
                2628,
                2705
            ],
            [
                2705,
                2747
            ],
            [
                2747,
                2832
            ],
            [
                2832,
                2911
            ],
            [
                2911,
                3056
            ],
            [
                3056,
                3135
            ],
            [
                3135,
                3233
            ],
            [
                3233,
                3302
            ],
            [
                3302,
                3377
            ],
            [
                3377,
                3460
            ],
            [
                3460,
                3597
            ],
            [
                3597,
                3687
            ],
            [
                3687,
                3750
            ],
            [
                3750,
                3757
            ],
            [
                3757,
                3771
            ],
            [
                3771,
                3796
            ],
            [
                3796,
                3833
            ],
            [
                3833,
                3886
            ],
            [
                3886,
                3930
            ],
            [
                3930,
                3938
            ],
            [
                3938,
                3945
            ],
            [
                3945,
                3945
            ],
            [
                3945,
                4015
            ],
            [
                4015,
                4080
            ],
            [
                4080,
                4100
            ],
            [
                4100,
                4119
            ],
            [
                4119,
                4136
            ],
            [
                4136,
                4168
            ],
            [
                4168,
                4173
            ],
            [
                4173,
                4256
            ],
            [
                4256,
                4316
            ],
            [
                4316,
                4370
            ],
            [
                4370,
                4460
            ],
            [
                4460,
                4590
            ],
            [
                4590,
                4590
            ],
            [
                4590,
                4597
            ],
            [
                4597,
                4620
            ],
            [
                4620,
                4837
            ],
            [
                4837,
                4869
            ],
            [
                4869,
                5036
            ],
            [
                5036,
                5065
            ],
            [
                5065,
                5083
            ],
            [
                5083,
                5088
            ],
            [
                5088,
                5103
            ],
            [
                5103,
                5187
            ],
            [
                5187,
                5238
            ],
            [
                5238,
                5238
            ],
            [
                5238,
                5282
            ],
            [
                5282,
                5282
            ],
            [
                5282,
                5364
            ],
            [
                5364,
                5395
            ],
            [
                5395,
                5412
            ],
            [
                5412,
                5412
            ],
            [
                5412,
                5419
            ],
            [
                5419,
                5476
            ],
            [
                5476,
                5522
            ],
            [
                5522,
                5578
            ],
            [
                5578,
                5625
            ],
            [
                5625,
                5638
            ],
            [
                5638,
                5650
            ]
        ]
    }
}