{
    "original": {
        "text": "\"We are the trees whom shaking fastens more.\" GEORGE HERBERT.\nMr. Thornton left the house without coming into the dining-room again. He was rather late, and walked rapidly out to Crampton. He was anxious not to slight his new friend by any disrespectful unpunctuality. The church-clock struck half-past seven as he stood at the door awaiting Dixon's slow movements; always doubly tardy when she had to degrade herself by answering the door-bell. He was ushered into the little drawing-room, and kindly greeted by Mr. Hale, who led him up to his wife, whose pale face, and shawl-draped figure made a silent excuse for the cold languor of her greeting. Margaret was lighting the lamp when he entered, for the darkness was coming on. The lamp threw a pretty light into the centre of the dusky room, from which, with country habits, they did not exclude the night-skies, and the outer darkness of air. Somehow, that room contrasted itself with the one he had lately left; handsome, ponderous, with no sign of female habitation, except in the one spot where his mother sate, and no convenience for any other employment than eating and drinking. To be sure, it was a dining-room; his mother preferred to sit in it; and her will was a household law. But the drawing-room was not like this. It was twice--twenty times as fine; not one quarter as comfortable. Here were no mirrors, not even a scrap of glass to reflect the light, and answer the same purpose as water in a landscape; no gilding; a warm, sober breadth of colouring, well relieved by the dear old Helstone chintz-curtains and chair covers. An open davenport stood in the window opposite the door; in the other there was a stand, with a tall white china vase, from which drooped wreaths of English ivy, pale green birch, and copper-coloured beech-leaves. Pretty baskets of work stood about in different places: and books, not cared for on account of their binding solely, lay on one table, as if recently put down. Behind the door was another table decked out for tea, with a white table-cloth, on which flourished the cocoa-nut cakes, and a basket piled with oranges and ruddy American apples, heaped on leaves.\nIt appeared to Mr. Thornton that all these graceful cares were habitual to the family; and especially of a piece with Margaret. She stood by the tea-table in a light-coloured muslin gown, which had a good deal of pink about it. She looked as if she was not attending to the conversation, but solely busy with the tea-cups, among which her round ivory hands moved with pretty, noiseless, daintiness. She had a bracelet on one taper arm, which would fall down over her round wrist. Mr. Thornton watched the replacing of this troublesome ornament with far more attention than he listened to her father. It seemed as if it fascinated him to see her push it up impatiently until it tightened her soft flesh; and then to mark the loosening--the fall. He could almost have exclaimed--\"There it goes again!\" There was so little left to be done after he arrived at the preparation for tea, that he was almost sorry the obligation of eating and drinking came so soon to prevent him watching Margaret. She handed him his cup of tea with the proud air of an unwilling slave; but her eye caught the moment when he was ready for another cup; and he almost longed to ask her to do for him what he saw her compelled to do for her father, who took her little finger and thumb in his masculine hand, and made them serve as sugar-tongues. Mr. Thornton saw her beautiful eyes lifted to her father, full of light, half-laughter, and half-love, as this bit of pantomime went on between the two, unobserved as they fancied, by any. Margaret's head still ached, as the paleness of her complexion, and her silence might have testified; but she was resolved to throw herself into the breach, if there was any long untoward pause, rather than that her father's friend, pupil, and guest should have cause to think himself in any way neglected. But the conversation went on; and Margaret drew into a corner, near her mother, with her work, after the tea-things were taken away; and felt that she might let her thoughts roam, without fear of being suddenly wanted to fill up a gap.\nMr. Thornton and Mr. Hale were both absorbed in the continuation of some object which had been started at their last meeting. Margaret was recalled to a sense of the present by some trivial, low-spoken remark of her mother's; and on suddenly looking up from her work, her eye was caught by the difference of outward appearance between her father and Mr. Thornton, as betokening such distinctly opposite natures. Her father was of slight figure, which made him appear taller than he really was, when not contrasted, as at this time, with the tall, massive frame of another. The lines in her father's face were soft and waving, with a frequent undulating kind of trembling movement passing over them, showing every fluctuating emotion; the eyelids were large and arched, giving to the eyes a peculiar languid beauty which was almost feminine. The brows were finely arched, but were by the very size of the dreamy lids, raised to a considerable distance from the eyes. Now, in Mr. Thornton's face the straight brows fell low over the clear, deep-set, earnest eyes, which without being unpleasantly sharp, seemed intent enough to penetrate into the very heart and core of what he was looking at. The lines in the face were few but firm, as if they were carved in marble, and lay principally about the lips, which were slightly compressed, over a set of teeth so faultless and beautiful as to give the effect of sudden sunlight when the rare bright smile, coming in an instant and shining out of the eyes, changed the whole look from the severe and resolved expression of a man ready to do and dare everything, to the keen, honest, enjoyment of the moment, which is seldom shown so fearlessly and instantaneously except by children. Margaret liked this smile; it was the first thing she had admired in this new friend of her father's; and the opposition of character, shown in all these details of appearance she had just been noticing, seemed to explain the attraction they evidently felt towards each other.\nShe rearranged her mother's worsted-work, and fell back into her own thoughts--as completely forgotten by Mr. Thornton as if she had not been in the room, so thoroughly was he occupied in explaining to Mr. Hale the magnificent power, yet delicate adjustment of the might of the steam-hammer, which was recalling to Mr. Hale some of the wonderful stories of subservient genii in the Arabian Nights--one moment stretching from earth to sky and filling all the width of the horizon, at the next obediently compressed into a vase small enough to be borne in the hand of a child.\n\"And this imagination of power, this practical realisation of a gigantic thought, came out of one man's brain in our good town. That very man has it within him to mount, step by step, on each wonder he achieves to higher marvels still. And I'll be bound to say, we have many among us who, if he were gone, could spring into the breach and carry on the war which compels, and shall compel, all material power to yield to science.\"\n\"Your boast reminds me of the old lines--\n'I've a hundred captains in England,' he said, 'As good as ever was he.'\"\nAt her father's quotation Margaret looked suddenly up, with inquiring wonder in her eyes. How in the world had they got from the cog-wheels to Chevy Chace?\n\"It is no boast of mine,\" replied Mr. Thornton; \"it is plain matter-of-fact. I won't deny that I am proud of belonging to a town--or perhaps I should rather say a district--the necessities of which give birth to such grandeur of conception. I would rather be a man toiling, suffering--nay, failing and successless--here, than lead a dull prosperous life in the old worn grooves of what you call more aristocratic society down in the South, with their slow days of careless ease. One may be clogged with honey and unable to rise and fly.\"\n\"You are mistaken,\" said Margaret, roused by the aspersion on her beloved South to a fond vehemence of defence, that brought the colour into her cheeks and the angry tears into her eyes. \"You do not know anything about the South. If there is less adventure or less progress--I suppose I must not say less excitement--from the gambling spirit of trade, which seems requisite to force out these wonderful inventions, there is less suffering also. I see men here going about in the streets who look ground down by some pinching sorrow or care--who are not only sufferers but haters. Now, in the South we have our poor, but there is not that terrible expression in their countenances of a sullen sense of injustice which I see here. You do not know the South, Mr. Thornton,\" she concluded, collapsing into a determined silence, and angry with herself for having said so much.\n\"And may I say you do not know the North?\" asked he, with an inexpressible gentleness in his tone, as he saw that he had really hurt her. She continued resolutely silent; yearning after the lovely haunts she had left far away in Hampshire, with a passionate longing that made her feel her voice would be unsteady and trembling if she spoke.\n\"At any rate, Mr. Thornton,\" said Mrs. Hale, \"you will allow that Milton is a much more smoky, dirty town than you will ever meet with in the South.\"\n\"I'm afraid I must give up its cleanliness,\" said Mr. Thornton, with the quick gleaming smile. \"But we are bidden by parliament to burn our own smoke; so I suppose, like good little children, we shall do as we are bid--some time.\"\n\"But I think you told me you had altered your chimneys so as to consume the smoke, did you not?\" asked Mr. Hale.\n\"Mine were altered by my own will, before parliament meddled with the affair. It was an immediate outlay, but it repays me in the saving of coal. I'm not sure whether I should have done it, if I had waited until the act was passed. At any rate, I should have waited to be informed against and fined, and given all the trouble in yielding that I legally could. But all laws which depend for their enforcement upon informers and fines, become inert from the odiousness of the machinery. I doubt if there has been a chimney in Milton informed against for five years past, although some are constantly sending out one-third of their coal in what is called here unparliamentary smoke.\"\n\"I only know it is impossible to keep the muslin blinds clean here above a week together; and at Helstone we have had them up for a month or more, and they have not looked dirty at the end of that time. And as for hands--Margaret, how many times did you say you had washed your hands this morning before twelve o'clock? Three times, was it not?\"\n\"Yes, mamma.\"\n\"You seem to have a strong objection to acts of parliament and all legislation affecting your mode of management down here at Milton,\" said Mr. Hale.\n\"Yes, I have; and many others have as well. And with justice, I think. The whole machinery--I don't mean the wood and iron machinery now--of the cotton trade is so new that it is no wonder if it does not work well in every part all at once. Seventy years ago what was it? And now what it is not? Raw, crude materials came together; men of the same level, as regarded education and station, took suddenly the different position of masters and men, owing to the motherwit, as regarded opportunities and probabilities, which distinguished some, and made them far-seeing as to what great future lay concealed in that rude model of Sir Richard Arkwright's. The rapid development of what might be called a new trade, gave those early masters enormous power of wealth and command. I don't mean merely over the workmen; I mean over purchasers--over the whole world's market. Why, I may give you, as an instance, an advertisement, inserted not fifty years ago in a Milton paper, that so-and-so (one of the half-dozen calico-printers of the time) would close his warehouse at noon each day; therefore, that all purchasers must come before that hour. Fancy a man dictating in this manner the time when he would sell and when he would not sell. Now, I believe, if a good customer chose to come at midnight, I should get up, and stand hat in hand to receive his orders.\"\nMargaret's lip curled, but somehow she was compelled to listen; she could no longer abstract herself in her own thoughts.\n\"I only name such things to show what almost unlimited power the manufacturers had about the beginning of this century. The men were rendered dizzy by it. Because a man was successful in his ventures, there was no reason that in all other things his mind should be well-balanced. On the contrary, his sense of justice, and his simplicity, were often utterly smothered under the glut of wealth that came down upon him; and they tell strange tales of the wild extravagance of living indulged in on gala-days by those early cotton-lords. There can be no doubt, too, of the tyranny they exercised over their work-people. You know the proverb, Mr. Hale, 'Set a beggar on horseback, and he'll ride to the devil,'--well, some of these early manufacturers did ride to the devil in a magnificent style--crushing human bone and flesh under their horses' hoofs without remorse. But by-and-by came a reaction; there were more factories, more masters; more men were wanted. The power of masters and men became more evenly balanced; and now the battle is pretty fairly waged between us. We will hardly submit to the decision of an umpire, much less to the interference of a meddler with only a smattering of the knowledge of the real facts of the case, even though that meddler be called the High Court of Parliament.\"\n\"Is there necessity for calling it a battle between the two classes?\" asked Mr. Hale. \"I know, from your using the term, it is one which gives a true idea of the real state of things to your mind.\"\n\"It is true; and I believe it to be as much a necessity as that prudent wisdom and good conduct are always opposed to, and doing battle with ignorance and improvidence. It is one of the great beauties of our system, that a working-man may raise himself into the power and position of a master by his own exertions and behaviour; that, in fact, every one who rules himself to decency and sobriety of conduct, and attention to his duties, comes over to our ranks; it may not be always as a master, but as an overlooker, a cashier, a book-keeper, a clerk, one on the side of authority and order.\"\n\"You consider all who are unsuccessful in raising themselves in the world, from whatever cause, as your enemies, then, if I understand you rightly,\" said Margaret, in a clear, cold voice.\n\"As their own enemies, certainly,\" said he, quickly, not a little piqued by the haughty disapproval her form of expression and tone of speaking implied. But, in a moment, his straightforward honesty made him feel that his words were but a poor and quibbling answer to what she had said, and, be she as scornful as she liked, it was a duty he owed to himself to explain, as truly as he could, what he did mean. Yet it was very difficult to separate her interpretation, and keep it distinct from his meaning. He could best have illustrated what he wanted to say by telling them something of his own life; but was it not too personal a subject to speak about to strangers? Still, it was the simple straightforward way of explaining his meaning; so, putting aside the touch of shyness that brought a momentary flush of colour into his dark cheek, he said:\n\"I am not speaking without book. Sixteen years ago, my father died under very miserable circumstances. I was taken from school, and had to become a man (as well as I could) in a few days. I had such a mother as few are blest with; a woman of strong power, and firm resolve. We went into a small country town, where living was cheaper than in Milton, and where I got employment in a draper's shop (a capital place, by the way, for obtaining a knowledge of goods). Week by week, our income came to fifteen shillings, out of which three people had to be kept. My mother managed so that I put by three out of these fifteen shillings regularly. This made the beginning; this taught me self-denial. Now that I am able to afford my mother such comforts as her age, rather than her own wish, requires, I thank her silently on each occasion for the early training she gave me. Now when I feel that in my own case it is no good luck, nor merit, nor talent,--but simply the habits of life which taught me to despise indulgences not thoroughly earned,--indeed, never to think twice about them,--I believe that this suffering, which Miss Hale says is impressed on the countenances of the people of Milton, is but the natural punishment of dishonestly-enjoyed pleasure, at some former period of their lives. I do not look on self-indulgent, sensual people as worthy of my hatred; I simply look upon them with contempt for their poorness of character.\"\n\"But you have the rudiments of a good education,\" remarked Mr. Hale. \"The quick zest with which you are now reading Homer, shows me that you do not come to it as an unknown book: you have read it before, and are only recalling your old knowledge.\"\n\"That is true,--I had blundered along it at school; I dare say, I was even considered a pretty fair classic in those days, though my Latin and Greek have slipt away from me since. But I ask you, what preparation were they for such a life as I had to lead? None at all. Utterly none at all. On the point of education, any man who can read and write starts fair with me in the amount of really useful knowledge that I had at that time.\"\n\"Well! I don't agree with you. But there I am perhaps somewhat of a pedant. Did not the recollection of the heroic simplicity of the Homeric life nerve you up?\"\n\"Not one bit!\" exclaimed Mr. Thornton, laughing. \"I was too busy to think about any dead people, with the living pressing alongside of me, neck to neck, in the struggle for bread. Now that I have my mother safe in the quiet peace that becomes her age, and duly rewards her former exertions, I can turn to all that old narration and thoroughly enjoy it.\"\n\"I dare say, my remark came from the professional feeling of there being nothing like leather,\" replied Mr. Hale.\nWhen Mr. Thornton rose up to go away, after shaking hands with Mr. and Mrs. Hale, he made an advance to Margaret to wish her good-bye in a similar manner. It was the frank familiar custom of the place; but Margaret was not prepared for it. She simply bowed her farewell; although the instant she saw the hand, half put out, quickly drawn back, she was sorry she had not been aware of the intention. Mr. Thornton, however, knew nothing of her sorrow, and, drawing himself up to his full height, walked off, muttering as he left the house--\n\"A more proud, disagreeable girl I never saw. Even her great beauty is blotted out of one's memory by her scornful ways.\"",
        "paragraph_chars": [
            [
                0,
                62
            ],
            [
                62,
                2167
            ],
            [
                2167,
                4219
            ],
            [
                4219,
                6224
            ],
            [
                6224,
                6799
            ],
            [
                6799,
                7229
            ],
            [
                7229,
                7271
            ],
            [
                7271,
                7345
            ],
            [
                7345,
                7501
            ],
            [
                7501,
                8039
            ],
            [
                8039,
                8911
            ],
            [
                8911,
                9252
            ],
            [
                9252,
                9402
            ],
            [
                9402,
                9633
            ],
            [
                9633,
                9746
            ],
            [
                9746,
                10427
            ],
            [
                10427,
                10773
            ],
            [
                10773,
                10787
            ],
            [
                10787,
                10937
            ],
            [
                10937,
                12295
            ],
            [
                12295,
                12417
            ],
            [
                12417,
                13722
            ],
            [
                13722,
                13920
            ],
            [
                13920,
                14514
            ],
            [
                14514,
                14702
            ],
            [
                14702,
                15554
            ],
            [
                15554,
                16992
            ],
            [
                16992,
                17240
            ],
            [
                17240,
                17675
            ],
            [
                17675,
                17836
            ],
            [
                17836,
                18190
            ],
            [
                18190,
                18304
            ],
            [
                18304,
                18843
            ],
            [
                18843,
                18964
            ]
        ],
        "segment_chars": [
            [
                0,
                46
            ],
            [
                46,
                62
            ],
            [
                62,
                133
            ],
            [
                133,
                189
            ],
            [
                189,
                269
            ],
            [
                269,
                446
            ],
            [
                446,
                651
            ],
            [
                651,
                731
            ],
            [
                731,
                898
            ],
            [
                898,
                1140
            ],
            [
                1140,
                1243
            ],
            [
                1243,
                1283
            ],
            [
                1283,
                1351
            ],
            [
                1351,
                1595
            ],
            [
                1595,
                1809
            ],
            [
                1809,
                1969
            ],
            [
                1969,
                2167
            ],
            [
                2167,
                2295
            ],
            [
                2295,
                2395
            ],
            [
                2395,
                2566
            ],
            [
                2566,
                2647
            ],
            [
                2647,
                2767
            ],
            [
                2767,
                2912
            ],
            [
                2912,
                2967
            ],
            [
                2967,
                3158
            ],
            [
                3158,
                3487
            ],
            [
                3487,
                3676
            ],
            [
                3676,
                3983
            ],
            [
                3983,
                4219
            ],
            [
                4219,
                4345
            ],
            [
                4345,
                4631
            ],
            [
                4631,
                4792
            ],
            [
                4792,
                5060
            ],
            [
                5060,
                5185
            ],
            [
                5185,
                5411
            ],
            [
                5411,
                5947
            ],
            [
                5947,
                6224
            ],
            [
                6224,
                6799
            ],
            [
                6799,
                6927
            ],
            [
                6927,
                7035
            ],
            [
                7035,
                7229
            ],
            [
                7229,
                7271
            ],
            [
                7271,
                7345
            ],
            [
                7345,
                7435
            ],
            [
                7435,
                7501
            ],
            [
                7501,
                7578
            ],
            [
                7578,
                7742
            ],
            [
                7742,
                7980
            ],
            [
                7980,
                8039
            ],
            [
                8039,
                8226
            ],
            [
                8226,
                8269
            ],
            [
                8269,
                8484
            ],
            [
                8484,
                8619
            ],
            [
                8619,
                8768
            ],
            [
                8768,
                8911
            ],
            [
                8911,
                8954
            ],
            [
                8954,
                9049
            ],
            [
                9049,
                9252
            ],
            [
                9252,
                9402
            ],
            [
                9402,
                9497
            ],
            [
                9497,
                9633
            ],
            [
                9633,
                9730
            ],
            [
                9730,
                9746
            ],
            [
                9746,
                9824
            ],
            [
                9824,
                9892
            ],
            [
                9892,
                9978
            ],
            [
                9978,
                10106
            ],
            [
                10106,
                10231
            ],
            [
                10231,
                10427
            ],
            [
                10427,
                10630
            ],
            [
                10630,
                10747
            ],
            [
                10747,
                10773
            ],
            [
                10773,
                10787
            ],
            [
                10787,
                10937
            ],
            [
                10937,
                10981
            ],
            [
                10981,
                11008
            ],
            [
                11008,
                11178
            ],
            [
                11178,
                11209
            ],
            [
                11209,
                11233
            ],
            [
                11233,
                11589
            ],
            [
                11589,
                11711
            ],
            [
                11711,
                11804
            ],
            [
                11804,
                12077
            ],
            [
                12077,
                12170
            ],
            [
                12170,
                12295
            ],
            [
                12295,
                12417
            ],
            [
                12417,
                12537
            ],
            [
                12537,
                12572
            ],
            [
                12572,
                12697
            ],
            [
                12697,
                12952
            ],
            [
                12952,
                13034
            ],
            [
                13034,
                13284
            ],
            [
                13284,
                13378
            ],
            [
                13378,
                13490
            ],
            [
                13490,
                13722
            ],
            [
                13722,
                13792
            ],
            [
                13792,
                13808
            ],
            [
                13808,
                13920
            ],
            [
                13920,
                14089
            ],
            [
                14089,
                14514
            ],
            [
                14514,
                14702
            ],
            [
                14702,
                14855
            ],
            [
                14855,
                15112
            ],
            [
                15112,
                15209
            ],
            [
                15209,
                15372
            ],
            [
                15372,
                15554
            ],
            [
                15554,
                15587
            ],
            [
                15587,
                15657
            ],
            [
                15657,
                15742
            ],
            [
                15742,
                15828
            ],
            [
                15828,
                16017
            ],
            [
                16017,
                16111
            ],
            [
                16111,
                16194
            ],
            [
                16194,
                16247
            ],
            [
                16247,
                16422
            ],
            [
                16422,
                16848
            ],
            [
                16848,
                16992
            ],
            [
                16992,
                17061
            ],
            [
                17061,
                17240
            ],
            [
                17240,
                17420
            ],
            [
                17420,
                17496
            ],
            [
                17496,
                17509
            ],
            [
                17509,
                17530
            ],
            [
                17530,
                17675
            ],
            [
                17675,
                17682
            ],
            [
                17682,
                17706
            ],
            [
                17706,
                17751
            ],
            [
                17751,
                17836
            ],
            [
                17836,
                17851
            ],
            [
                17851,
                17885
            ],
            [
                17885,
                18016
            ],
            [
                18016,
                18190
            ],
            [
                18190,
                18304
            ],
            [
                18304,
                18459
            ],
            [
                18459,
                18544
            ],
            [
                18544,
                18703
            ],
            [
                18703,
                18843
            ],
            [
                18843,
                18889
            ],
            [
                18889,
                18964
            ]
        ],
        "overlap_chars": [
            [
                62,
                89
            ],
            [
                151,
                171
            ],
            [
                176,
                189
            ],
            [
                189,
                235
            ],
            [
                267,
                269
            ],
            [
                269,
                279
            ],
            [
                280,
                297
            ],
            [
                298,
                314
            ],
            [
                431,
                444
            ],
            [
                489,
                494
            ],
            [
                449,
                489
            ],
            [
                444,
                445
            ],
            [
                446,
                448
            ],
            [
                495,
                534
            ],
            [
                538,
                549
            ],
            [
                557,
                566
            ],
            [
                592,
                651
            ],
            [
                651,
                697
            ],
            [
                740,
                794
            ],
            [
                729,
                730
            ],
            [
                898,
                976
            ],
            [
                1070,
                1073
            ],
            [
                978,
                1004
            ],
            [
                1012,
                1063
            ],
            [
                1138,
                1140
            ],
            [
                1140,
                1151
            ],
            [
                1155,
                1173
            ],
            [
                1243,
                1246
            ],
            [
                1174,
                1184
            ],
            [
                1251,
                1281
            ],
            [
                1281,
                1283
            ],
            [
                1283,
                1289
            ],
            [
                1304,
                1351
            ],
            [
                1351,
                1372
            ],
            [
                1474,
                1484
            ],
            [
                1539,
                1595
            ],
            [
                1619,
                1621
            ],
            [
                1626,
                1632
            ],
            [
                1671,
                1674
            ],
            [
                1689,
                1701
            ],
            [
                1708,
                1761
            ],
            [
                1762,
                1809
            ],
            [
                1809,
                1843
            ],
            [
                1863,
                1874
            ],
            [
                1926,
                1969
            ],
            [
                1969,
                1988
            ],
            [
                2028,
                2029
            ],
            [
                1997,
                2002
            ],
            [
                2014,
                2027
            ],
            [
                2073,
                2167
            ],
            [
                2167,
                2224
            ],
            [
                2258,
                2268
            ],
            [
                2285,
                2295
            ],
            [
                2295,
                2354
            ],
            [
                2420,
                2458
            ],
            [
                2466,
                2505
            ],
            [
                2512,
                2552
            ],
            [
                2554,
                2566
            ],
            [
                2566,
                2591
            ],
            [
                2598,
                2647
            ],
            [
                2647,
                2767
            ],
            [
                2783,
                2834
            ],
            [
                2835,
                2900
            ],
            [
                2902,
                2912
            ],
            [
                2912,
                2942
            ],
            [
                2945,
                2958
            ],
            [
                2959,
                2964
            ],
            [
                3162,
                3479
            ],
            [
                3485,
                3487
            ],
            [
                3487,
                3573
            ],
            [
                3575,
                3638
            ],
            [
                3674,
                3675
            ],
            [
                3676,
                3703
            ],
            [
                3776,
                3854
            ],
            [
                3864,
                3882
            ],
            [
                3888,
                3900
            ],
            [
                3920,
                3925
            ],
            [
                3964,
                3967
            ],
            [
                3938,
                3960
            ],
            [
                3972,
                3983
            ],
            [
                3983,
                4016
            ],
            [
                4078,
                4083
            ],
            [
                4088,
                4091
            ],
            [
                4017,
                4044
            ],
            [
                4063,
                4076
            ],
            [
                4120,
                4219
            ],
            [
                4219,
                4266
            ],
            [
                4287,
                4291
            ],
            [
                4305,
                4308
            ],
            [
                4314,
                4321
            ],
            [
                4322,
                4345
            ],
            [
                4449,
                4451
            ],
            [
                4461,
                4486
            ],
            [
                4345,
                4353
            ],
            [
                4441,
                4443
            ],
            [
                4491,
                4523
            ],
            [
                4535,
                4553
            ],
            [
                4381,
                4384
            ],
            [
                4629,
                4631
            ],
            [
                4631,
                4663
            ],
            [
                4713,
                4717
            ],
            [
                4722,
                4732
            ],
            [
                4751,
                4782
            ],
            [
                4790,
                4792
            ],
            [
                4792,
                4860
            ],
            [
                4880,
                5008
            ],
            [
                5018,
                5059
            ],
            [
                5190,
                5245
            ],
            [
                5250,
                5286
            ],
            [
                5321,
                5368
            ],
            [
                5379,
                5411
            ],
            [
                5411,
                5484
            ],
            [
                5516,
                5520
            ],
            [
                5528,
                5552
            ],
            [
                5554,
                5558
            ],
            [
                5568,
                5586
            ],
            [
                5601,
                5646
            ],
            [
                5559,
                5560
            ],
            [
                5651,
                5668
            ],
            [
                5703,
                5718
            ],
            [
                5720,
                5727
            ],
            [
                5732,
                5747
            ],
            [
                5786,
                5787
            ],
            [
                5752,
                5782
            ],
            [
                5825,
                5836
            ],
            [
                5838,
                5844
            ],
            [
                5846,
                5906
            ],
            [
                5927,
                5947
            ],
            [
                5947,
                6080
            ],
            [
                6151,
                6183
            ],
            [
                6189,
                6224
            ],
            [
                6224,
                6251
            ],
            [
                6259,
                6301
            ],
            [
                6377,
                6378
            ],
            [
                6330,
                6342
            ],
            [
                6409,
                6481
            ],
            [
                6495,
                6580
            ],
            [
                6593,
                6620
            ],
            [
                6622,
                6661
            ],
            [
                6702,
                6768
            ],
            [
                6366,
                6368
            ],
            [
                6790,
                6797
            ],
            [
                6782,
                6786
            ],
            [
                6797,
                6799
            ],
            [
                6800,
                6803
            ],
            [
                6831,
                6879
            ],
            [
                6881,
                6927
            ],
            [
                6927,
                6931
            ],
            [
                6937,
                6982
            ],
            [
                7010,
                7035
            ],
            [
                7035,
                7086
            ],
            [
                7105,
                7110
            ],
            [
                7138,
                7160
            ],
            [
                7174,
                7186
            ],
            [
                7188,
                7226
            ],
            [
                7578,
                7629
            ],
            [
                7634,
                7672
            ],
            [
                7693,
                7698
            ],
            [
                7704,
                7742
            ],
            [
                7742,
                7784
            ],
            [
                7791,
                7798
            ],
            [
                7816,
                7820
            ],
            [
                7822,
                7895
            ],
            [
                7901,
                7980
            ],
            [
                7980,
                8036
            ],
            [
                8040,
                8056
            ],
            [
                8059,
                8123
            ],
            [
                8129,
                8138
            ],
            [
                8151,
                8194
            ],
            [
                8199,
                8226
            ],
            [
                8227,
                8269
            ],
            [
                8269,
                8312
            ],
            [
                8356,
                8402
            ],
            [
                8413,
                8484
            ],
            [
                8484,
                8549
            ],
            [
                8564,
                8578
            ],
            [
                8580,
                8619
            ],
            [
                8619,
                8658
            ],
            [
                8668,
                8696
            ],
            [
                8719,
                8768
            ],
            [
                8768,
                8807
            ],
            [
                8810,
                8824
            ],
            [
                8867,
                8911
            ],
            [
                8912,
                8951
            ],
            [
                8954,
                8996
            ],
            [
                9008,
                9049
            ],
            [
                9049,
                9052
            ],
            [
                9063,
                9081
            ],
            [
                9158,
                9176
            ],
            [
                9097,
                9127
            ],
            [
                9182,
                9195
            ],
            [
                9177,
                9181
            ],
            [
                9196,
                9211
            ],
            [
                9238,
                9252
            ],
            [
                9253,
                9278
            ],
            [
                9281,
                9296
            ],
            [
                9298,
                9306
            ],
            [
                9313,
                9376
            ],
            [
                9387,
                9399
            ],
            [
                9403,
                9413
            ],
            [
                9447,
                9497
            ],
            [
                9519,
                9529
            ],
            [
                9530,
                9532
            ],
            [
                9538,
                9551
            ],
            [
                9638,
                9727
            ],
            [
                9730,
                9746
            ],
            [
                9752,
                9764
            ],
            [
                9781,
                9798
            ],
            [
                9812,
                9815
            ],
            [
                9856,
                9892
            ],
            [
                9892,
                9978
            ],
            [
                9978,
                10049
            ],
            [
                10050,
                10071
            ],
            [
                10084,
                10106
            ],
            [
                10231,
                10355
            ],
            [
                10403,
                10424
            ],
            [
                10428,
                10488
            ],
            [
                10500,
                10515
            ],
            [
                10628,
                10629
            ],
            [
                10515,
                10516
            ],
            [
                10517,
                10564
            ],
            [
                10599,
                10604
            ],
            [
                10788,
                10826
            ],
            [
                10850,
                10853
            ],
            [
                10866,
                10880
            ],
            [
                10889,
                10899
            ],
            [
                10905,
                10919
            ],
            [
                10922,
                10937
            ],
            [
                10938,
                10981
            ],
            [
                10981,
                10984
            ],
            [
                10997,
                11008
            ],
            [
                11008,
                11027
            ],
            [
                11029,
                11045
            ],
            [
                11055,
                11073
            ],
            [
                11075,
                11178
            ],
            [
                11178,
                11195
            ],
            [
                11196,
                11209
            ],
            [
                11233,
                11236
            ],
            [
                11244,
                11290
            ],
            [
                11304,
                11325
            ],
            [
                11327,
                11354
            ],
            [
                11364,
                11403
            ],
            [
                11496,
                11497
            ],
            [
                11403,
                11406
            ],
            [
                11473,
                11478
            ],
            [
                11453,
                11458
            ],
            [
                11483,
                11492
            ],
            [
                11515,
                11527
            ],
            [
                11528,
                11589
            ],
            [
                11589,
                11613
            ],
            [
                11635,
                11646
            ],
            [
                11648,
                11681
            ],
            [
                11691,
                11701
            ],
            [
                11682,
                11687
            ],
            [
                11724,
                11747
            ],
            [
                11646,
                11647
            ],
            [
                11756,
                11760
            ],
            [
                11788,
                11804
            ],
            [
                11804,
                11808
            ],
            [
                11831,
                11857
            ],
            [
                11859,
                11911
            ],
            [
                11923,
                11933
            ],
            [
                11945,
                11960
            ],
            [
                11974,
                12017
            ],
            [
                11915,
                11918
            ],
            [
                12029,
                12033
            ],
            [
                12018,
                12027
            ],
            [
                12034,
                12077
            ],
            [
                12077,
                12106
            ],
            [
                12114,
                12141
            ],
            [
                12170,
                12173
            ],
            [
                12184,
                12247
            ],
            [
                12271,
                12292
            ],
            [
                12295,
                12321
            ],
            [
                12330,
                12357
            ],
            [
                12415,
                12417
            ],
            [
                12418,
                12499
            ],
            [
                12506,
                12537
            ],
            [
                12545,
                12549
            ],
            [
                12559,
                12572
            ],
            [
                12580,
                12585
            ],
            [
                12718,
                12734
            ],
            [
                12586,
                12589
            ],
            [
                12761,
                12766
            ],
            [
                12775,
                12890
            ],
            [
                12926,
                12952
            ],
            [
                12952,
                12973
            ],
            [
                12995,
                12999
            ],
            [
                13010,
                13032
            ],
            [
                13241,
                13246
            ],
            [
                13267,
                13284
            ],
            [
                13284,
                13313
            ],
            [
                13315,
                13340
            ],
            [
                13354,
                13378
            ],
            [
                13378,
                13490
            ],
            [
                13490,
                13610
            ],
            [
                13615,
                13624
            ],
            [
                13628,
                13719
            ],
            [
                13754,
                13789
            ],
            [
                13792,
                13807
            ],
            [
                13937,
                13949
            ],
            [
                13833,
                13836
            ],
            [
                13867,
                13871
            ],
            [
                13889,
                13904
            ],
            [
                13931,
                13936
            ],
            [
                13984,
                13998
            ],
            [
                13846,
                13848
            ],
            [
                14020,
                14026
            ],
            [
                14043,
                14089
            ],
            [
                14089,
                14181
            ],
            [
                14192,
                14263
            ],
            [
                14274,
                14277
            ],
            [
                14188,
                14191
            ],
            [
                14342,
                14425
            ],
            [
                14434,
                14463
            ],
            [
                14464,
                14471
            ],
            [
                14515,
                14660
            ],
            [
                14663,
                14676
            ],
            [
                14678,
                14702
            ],
            [
                14703,
                14734
            ],
            [
                14737,
                14744
            ],
            [
                14746,
                14754
            ],
            [
                14768,
                14777
            ],
            [
                14802,
                14805
            ],
            [
                14782,
                14801
            ],
            [
                14853,
                14855
            ],
            [
                14855,
                14858
            ],
            [
                14873,
                14934
            ],
            [
                14939,
                14945
            ],
            [
                14960,
                14966
            ],
            [
                14987,
                14992
            ],
            [
                15041,
                15043
            ],
            [
                15060,
                15070
            ],
            [
                15110,
                15112
            ],
            [
                15209,
                15222
            ],
            [
                15240,
                15372
            ],
            [
                15372,
                15389
            ],
            [
                15397,
                15513
            ],
            [
                15529,
                15532
            ],
            [
                15538,
                15554
            ],
            [
                15590,
                15657
            ],
            [
                15657,
                15742
            ],
            [
                15742,
                15786
            ],
            [
                15796,
                15802
            ],
            [
                15787,
                15795
            ],
            [
                15814,
                15828
            ],
            [
                15828,
                15835
            ],
            [
                15841,
                15919
            ],
            [
                15931,
                15949
            ],
            [
                16031,
                16034
            ],
            [
                16035,
                16041
            ],
            [
                16050,
                16111
            ],
            [
                16111,
                16138
            ],
            [
                16146,
                16151
            ],
            [
                16156,
                16158
            ],
            [
                16173,
                16194
            ],
            [
                16219,
                16247
            ],
            [
                16247,
                16310
            ],
            [
                16338,
                16368
            ],
            [
                16386,
                16422
            ],
            [
                16431,
                16463
            ],
            [
                16571,
                16574
            ],
            [
                16467,
                16499
            ],
            [
                16502,
                16564
            ],
            [
                16637,
                16691
            ],
            [
                16702,
                16708
            ],
            [
                16722,
                16808
            ],
            [
                16810,
                16848
            ],
            [
                16848,
                16879
            ],
            [
                16889,
                16989
            ],
            [
                16993,
                17005
            ],
            [
                17006,
                17039
            ],
            [
                17042,
                17061
            ],
            [
                17066,
                17132
            ],
            [
                17175,
                17203
            ],
            [
                17209,
                17237
            ],
            [
                17246,
                17253
            ],
            [
                17290,
                17291
            ],
            [
                17281,
                17290
            ],
            [
                17253,
                17254
            ],
            [
                17292,
                17302
            ],
            [
                17304,
                17309
            ],
            [
                17315,
                17339
            ],
            [
                17361,
                17393
            ],
            [
                17400,
                17404
            ],
            [
                17413,
                17420
            ],
            [
                17420,
                17496
            ],
            [
                17496,
                17509
            ],
            [
                17530,
                17607
            ],
            [
                17676,
                17682
            ],
            [
                17682,
                17706
            ],
            [
                17751,
                17833
            ],
            [
                17837,
                17848
            ],
            [
                17851,
                17885
            ],
            [
                17886,
                17900
            ],
            [
                18005,
                18014
            ],
            [
                17901,
                17915
            ],
            [
                18014,
                18016
            ],
            [
                18016,
                18053
            ],
            [
                18060,
                18070
            ],
            [
                18097,
                18140
            ],
            [
                18145,
                18187
            ],
            [
                18304,
                18326
            ],
            [
                18330,
                18335
            ],
            [
                18340,
                18384
            ],
            [
                18386,
                18388
            ],
            [
                18405,
                18459
            ],
            [
                18459,
                18469
            ],
            [
                18485,
                18544
            ],
            [
                18544,
                18612
            ],
            [
                18628,
                18687
            ],
            [
                18692,
                18702
            ],
            [
                18703,
                18724
            ],
            [
                18757,
                18840
            ],
            [
                18844,
                18889
            ],
            [
                18889,
                18962
            ]
        ],
        "row_chars": [
            [
                0,
                46
            ],
            [
                46,
                62
            ],
            [
                62,
                189
            ],
            [
                189,
                269
            ],
            [
                269,
                651
            ],
            [
                651,
                898
            ],
            [
                898,
                1140
            ],
            [
                1140,
                1283
            ],
            [
                1283,
                1351
            ],
            [
                1351,
                1595
            ],
            [
                1595,
                1809
            ],
            [
                1809,
                1969
            ],
            [
                1969,
                2167
            ],
            [
                2167,
                2295
            ],
            [
                2295,
                2566
            ],
            [
                2566,
                2647
            ],
            [
                2647,
                2767
            ],
            [
                2767,
                2912
            ],
            [
                2912,
                2967
            ],
            [
                2967,
                3158
            ],
            [
                3158,
                3487
            ],
            [
                3487,
                3676
            ],
            [
                3676,
                3983
            ],
            [
                3983,
                4219
            ],
            [
                4219,
                4345
            ],
            [
                4345,
                4631
            ],
            [
                4631,
                4792
            ],
            [
                4792,
                5060
            ],
            [
                5060,
                5185
            ],
            [
                5185,
                5411
            ],
            [
                5411,
                5947
            ],
            [
                5947,
                6224
            ],
            [
                6224,
                6799
            ],
            [
                6799,
                6927
            ],
            [
                6927,
                7035
            ],
            [
                7035,
                7229
            ],
            [
                7229,
                7271
            ],
            [
                7271,
                7345
            ],
            [
                7345,
                7435
            ],
            [
                7435,
                7501
            ],
            [
                7501,
                7578
            ],
            [
                7578,
                7742
            ],
            [
                7742,
                7980
            ],
            [
                7980,
                8039
            ],
            [
                8039,
                8226
            ],
            [
                8226,
                8269
            ],
            [
                8269,
                8484
            ],
            [
                8484,
                8619
            ],
            [
                8619,
                8768
            ],
            [
                8768,
                8911
            ],
            [
                8911,
                8954
            ],
            [
                8954,
                9049
            ],
            [
                9049,
                9252
            ],
            [
                9252,
                9402
            ],
            [
                9402,
                9497
            ],
            [
                9497,
                9633
            ],
            [
                9633,
                9730
            ],
            [
                9730,
                9746
            ],
            [
                9746,
                9892
            ],
            [
                9892,
                9978
            ],
            [
                9978,
                10106
            ],
            [
                10106,
                10231
            ],
            [
                10231,
                10427
            ],
            [
                10427,
                10630
            ],
            [
                10630,
                10747
            ],
            [
                10747,
                10773
            ],
            [
                10773,
                10787
            ],
            [
                10787,
                10937
            ],
            [
                10937,
                10981
            ],
            [
                10981,
                11008
            ],
            [
                11008,
                11178
            ],
            [
                11178,
                11209
            ],
            [
                11209,
                11233
            ],
            [
                11233,
                11589
            ],
            [
                11589,
                11804
            ],
            [
                11804,
                12077
            ],
            [
                12077,
                12170
            ],
            [
                12170,
                12295
            ],
            [
                12295,
                12417
            ],
            [
                12417,
                12537
            ],
            [
                12537,
                12572
            ],
            [
                12572,
                12952
            ],
            [
                12952,
                13284
            ],
            [
                13284,
                13378
            ],
            [
                13378,
                13490
            ],
            [
                13490,
                13722
            ],
            [
                13722,
                13792
            ],
            [
                13792,
                13808
            ],
            [
                13808,
                14089
            ],
            [
                14089,
                14514
            ],
            [
                14514,
                14702
            ],
            [
                14702,
                14855
            ],
            [
                14855,
                15112
            ],
            [
                15112,
                15209
            ],
            [
                15209,
                15372
            ],
            [
                15372,
                15554
            ],
            [
                15554,
                15587
            ],
            [
                15587,
                15657
            ],
            [
                15657,
                15742
            ],
            [
                15742,
                15828
            ],
            [
                15828,
                16017
            ],
            [
                16017,
                16111
            ],
            [
                16111,
                16194
            ],
            [
                16194,
                16247
            ],
            [
                16247,
                16422
            ],
            [
                16422,
                16848
            ],
            [
                16848,
                16992
            ],
            [
                16992,
                17061
            ],
            [
                17061,
                17240
            ],
            [
                17240,
                17420
            ],
            [
                17420,
                17496
            ],
            [
                17496,
                17509
            ],
            [
                17509,
                17530
            ],
            [
                17530,
                17675
            ],
            [
                17675,
                17682
            ],
            [
                17682,
                17706
            ],
            [
                17706,
                17751
            ],
            [
                17751,
                17836
            ],
            [
                17836,
                17851
            ],
            [
                17851,
                17885
            ],
            [
                17885,
                18016
            ],
            [
                18016,
                18190
            ],
            [
                18190,
                18304
            ],
            [
                18304,
                18459
            ],
            [
                18459,
                18544
            ],
            [
                18544,
                18703
            ],
            [
                18703,
                18843
            ],
            [
                18843,
                18889
            ],
            [
                18889,
                18964
            ]
        ]
    },
    "abridged": {
        "text": "Mr. Thornton left the house, and walked rapidly to Crampton. He was anxious not to slight his new friend by arriving late. The church clock struck half past seven as he rang the door-bell, and was ushered into the little drawing-room.\nHe was kindly greeted by Mr. Hale, who led him to his wife. Her pale face made a silent excuse for the cold languor of her greeting. Margaret was lighting the lamp when he entered; it threw a pretty light into the centre of the dusky room.\nSomehow, that room contrasted itself with the one he had lately left; handsome and ponderous, with no sign of feminine habitation, except in the one spot where his mother sat. To be sure, that was a dining-room; but his mother's drawing-room was not like this either. It was twenty times as fine; not one quarter as comfortable. Here were no mirrors, no gilding - just the dear old Helstone chintz-curtains and chair covers. In one window was a tall white vase, from which drooped wreaths of English ivy, pale-green birch, and copper-coloured beech-leaves. Pretty baskets of work stood about: and books lay on one table, as if recently put down. Behind the door was a table set for tea, with cocoa-nut cakes, and a basket piled with oranges and ruddy American apples, heaped on leaves.\nIt appeared to Mr. Thornton that all these graceful cares especially fitted Margaret. She stood by the tea-table in a light-coloured muslin gown, not attending to the conversation, but busy with the tea-cups, among which her ivory hands moved with pretty, noiseless daintiness. She had a bracelet on one arm, which would fall down over her round wrist. Mr. Thornton watched the replacing of this troublesome ornament with far more attention than he listened to her father. It fascinated him to see her push it up impatiently, until it tightened her soft flesh; and then to mark the loosening - the fall. He could almost have exclaimed, 'There it goes, again!'\nMargaret handed him his cup of tea with the proud air of an unwilling slave; but her eye caught the moment when he was ready for another cup; and he almost longed to ask her to do for him what he saw her compelled to do for her father, who took her little finger and thumb in his masculine hand, and made them serve as sugar-tongs. Mr. Thornton saw her beautiful eyes lifted to her father, full of light, half-laughter and half-love, as this bit of pantomime went on between the two.\nMargaret's head still ached; but she was resolved to throw herself into the breach, if there was any long pause, rather than give her father's guest any cause to think himself neglected. But the conversation went on; and after tea Margaret drew into a corner with her work. She felt that she might let her thoughts roam, without fear of being suddenly wanted to fill up a gap.\nMr. Thornton and Mr. Hale were both absorbed in some subject they had started discussing at their last meeting. On looking up from her work, Margaret's eye was caught by the difference in appearance between the two men. Her father was of slight figure, when contrasted with the tall, massive frame of the other. The lines in her father's face were soft and waving, with a frequent trembling movement passing over them, showing every fluctuating emotion; the eyelids were large and arched, giving to the eyes a languid beauty which was almost feminine.\nIn Mr. Thornton's face the straight brows fell low over clear, deep-set, earnest eyes, which seemed intent enough to penetrate into the very core of what he was looking at. The lines in the face were few but firm, as if they were carved in marble; his lips were slightly compressed over teeth so faultless as to give the effect of sudden sunlight when a rare bright smile shone out of the eyes. It changed his whole look from a severe and resolved expression to the keen honest enjoyment of the moment, which is seldom shown so fearlessly except by children. Margaret liked this smile; it was the first thing she had admired in this new friend of her father's; and the opposition of character seemed to explain the attraction the two men evidently felt towards each other.\nShe rearranged her mother's wool-work, and fell back into her own thoughts, while Mr. Thornton forgot her presence in explaining to Mr. Hale the magnificent power, yet delicate adjustment of the steam-hammer, which was recalling to Mr. Hale some of the wonderful stories of genii in the Arabian Nights - one moment stretching from earth to sky, at the next obediently compressed into a vase small enough to be held in a child's hand.\n'And this practical realisation of a gigantic thought came out of one man's brain in our good town. That man has it within him to mount, step by step, to higher marvels still. And I'll be bound to say, we have many among us who could carry on the war which shall compel all material power to yield to science. I won't deny that I am proud of belonging to a town - perhaps I should rather say a district - which has given birth to such grandeur of conception. I would rather be a man toiling, suffering - even failing - here. than lead a dull prosperous life in the old worn grooves of what you call aristocratic society down in the South, with their slow days of careless ease. One may be clogged with honey and unable to rise and fly.'\n'You are mistaken,' said Margaret, roused by the aspersion on her beloved South to a vehemence that brought the colour into her cheeks and angry tears into her eyes. 'You do not know anything about the South. If there is less adventure or less progress there from the gambling spirit of trade, which seems necessary to force out these wonderful inventions, there is less suffering also. I see men here going about in the streets who look ground down by sorrow or care - who are not only sufferers but haters. Now, in the South we have our poor, but they have not that terrible expression of a sullen sense of injustice which I see here. You do not know the South, Mr. Thornton,' she concluded, angry with herself for having said so much.\n'And may I say you do not know the North?' asked he, with an inexpressible gentleness, as he saw that he had really hurt her. She remained resolutely silent; her passionate longing for the lovely haunts she had left made her feel that her voice would tremble if she spoke.\n'At any rate, Mr. Thornton,' said Mrs. Hale, 'you will admit that Milton is a much more smoky, dirty town than you will ever see in the South.'\n'I'm afraid so,' said Mr. Thornton, with the quick gleaming smile. 'Though now Parliament wishes us to swallow our own smoke.'\n'I think you told me you had altered your chimneys so as to consume the smoke, did you not?' asked Mr. Hale.\n'Mine were altered before Parliament passed the Smoke Nuisance Act; it repays me in the saving of coal. I'm not sure whether I should have done it, if I had waited until the Act was passed. At any rate, I should have waited to be informed against and fined, and would have given all the trouble that I legally could. But I doubt if there has been a chimney in Milton informed against for five years past, although some are constantly sending out unparliamentary smoke.'\n'I only know it is impossible to keep the muslin blinds clean for a week together,' said Mrs. Hale; 'and at Helstone we have had them up for a month without getting dirty.'\n'You seem to have a strong objection to all laws affecting your management here at Milton,' said Mr. Hale.\n'Yes, I have; and many others have as well. And justly, I think. The whole machinery - I don't mean the iron machinery now - of the cotton trade is so new that it is no wonder if it does not work well in every part all at once. Seventy years ago, what was it? Raw materials came together; men of the same level of education and station took suddenly the different positions of masters and men, owing to the mother-wit of some, which made them foresee the great future that lay concealed in that rude model of Sir Richard Arkwright's. The rapid development of a new trade gave those early masters enormous wealth and power - not merely over the workmen, but over world's market. Why, for instance, an advertisement was inserted not fifty years ago in a Milton paper, that one of the calico-printers would close his warehouse at noon each day; and that therefore all purchasers must come before that hour. Fancy a man dictating in this way the time when he would sell! Now, if a good customer chose to come at midnight, I should get up to receive his orders.'\nMargaret's lip curled, but she was compelled to listen.\n'I only name such things to show what almost unlimited power the manufacturers had at the beginning of this century. They were made dizzy by it. Such a man's sense of justice was often smothered under the glut of wealth that came down upon him; and they tell strange tales of the wild extravagance of those early cotton-lords. There can be no doubt that they tyrannised over their work-people - crushing them underfoot without remorse. But by-and-by came a reaction. There were more factories; more men were wanted. The power of masters and men became more evenly balanced; and now the battle is pretty fairly waged between us. We will hardly submit to the decision of an umpire, much less to the interference of a meddler with only a smattering of knowledge about the real facts of the case, even though that meddler be called the High Court of Parliament.'\n'Need you call it a battle between the two classes?' asked Mr. Hale.\n'I believe it indicates the true state of things; and prudent wisdom is always doing battle with ignorance and improvidence. It is one of the great beauties of our system, that a working-man may raise himself into the position of a master by his own exertions and behaviour; that, in fact, everyone who acts decently and attends to his duties, comes over to our ranks; it may not be always as a master, but as an over-looker, a cashier, a book-keeper, or a clerk.'\n'You consider all who are unsuccessful in raising themselves in the world, from whatever cause, as your enemies, then, if I understand you rightly,' said Margaret in a clear, cold voice.\n'As their own enemies, certainly,' said he quickly, somewhat piqued by her haughty disapproval. But his straightforward honesty made him feel that his words were a poor answer, and that he needed to explain. He could best illustrate what he wanted to say by telling them something of his own life; but was it not too personal a subject to speak about to strangers? Still, it was the most straightforward way of explaining his meaning; so, putting aside the touch of shyness that brought a momentary flush to his cheek, he said:\n'Sixteen years ago, my father died under very miserable circumstances. I was taken from school, and had to become a man (as well as I could) in a few days. I had such a mother as few are blest with; a strong woman of firm resolve. We went to a small country town, where living was cheaper than in Milton, and where I got work in a draper's shop. Our weekly income was fifteen shillings, out of which three people had to be kept. My mother managed so that I saved three of those shillings regularly. This taught me self-denial. Now that I am able to afford my mother such comforts as her age requires, I thank her silently for the early training she gave me. I feel that in my own case it is not good luck, nor merit, nor talent - but simply the habits of life which taught me to despise indulgence. And I believe that this suffering, which Miss Hale says is shown on the faces of the people of Milton, is but the natural punishment of dishonestly-enjoyed pleasure at some former period of their lives. I do not look on self-indulgent people as worthy of my hatred; I simply look upon them with contempt for their poorness of character.'\n'But you have had the rudiments of a good education,' remarked Mr. Hale. 'The quick zest with which you are now reading Homer, shows me that you have read it before, and are recalling your old knowledge.'\n'That is true; at school, I dare say I was considered a pretty fair classical scholar, though my Latin and Greek have slipped away since. But I ask you, what preparation were they for such a life as I had to lead? None at all. On the point of education, any man who can read and write starts fair with me.'\n'Well! I don't agree with you. Did not the recollection of the heroic simplicity of the Homeric life nerve you up?'\n'Not one bit!' exclaimed Mr. Thornton, laughing. 'I was too busy struggling for bread to think about it. Now that I have my mother safe in the peace that rewards her former exertions, I can turn to that old narration and thoroughly enjoy it.'\nWhen Mr. Thornton rose to go, after shaking hands with Mr. and Mrs. Hale he advanced to Margaret to wish her good-bye in a similar manner. It was the custom of the place; but Margaret was not prepared for it. She simply bowed her farewell; although the instant she saw the hand quickly drawn back, she was sorry she had not been aware of his intention.\nMr. Thornton, however, drawing himself up to his full height, walked off, muttering as he left the house-\n'A more proud, disagreeable girl I never saw. Even her great beauty is blotted out of one's memory by her scornful ways.'",
        "paragraph_chars": [
            [
                0,
                235
            ],
            [
                235,
                475
            ],
            [
                475,
                1261
            ],
            [
                1261,
                1921
            ],
            [
                1921,
                2405
            ],
            [
                2405,
                2782
            ],
            [
                2782,
                3334
            ],
            [
                3334,
                4107
            ],
            [
                4107,
                4541
            ],
            [
                4541,
                5278
            ],
            [
                5278,
                6016
            ],
            [
                6016,
                6289
            ],
            [
                6289,
                6433
            ],
            [
                6433,
                6560
            ],
            [
                6560,
                6669
            ],
            [
                6669,
                7139
            ],
            [
                7139,
                7312
            ],
            [
                7312,
                7419
            ],
            [
                7419,
                8477
            ],
            [
                8477,
                8533
            ],
            [
                8533,
                9392
            ],
            [
                9392,
                9461
            ],
            [
                9461,
                9926
            ],
            [
                9926,
                10113
            ],
            [
                10113,
                10641
            ],
            [
                10641,
                11778
            ],
            [
                11778,
                11983
            ],
            [
                11983,
                12290
            ],
            [
                12290,
                12406
            ],
            [
                12406,
                12649
            ],
            [
                12649,
                13002
            ],
            [
                13002,
                13108
            ],
            [
                13108,
                13229
            ]
        ],
        "segment_chars": [
            [
                0,
                61
            ],
            [
                61,
                123
            ],
            [
                123,
                235
            ],
            [
                235,
                295
            ],
            [
                295,
                368
            ],
            [
                368,
                475
            ],
            [
                475,
                651
            ],
            [
                651,
                743
            ],
            [
                743,
                804
            ],
            [
                804,
                900
            ],
            [
                900,
                1032
            ],
            [
                1032,
                1121
            ],
            [
                1121,
                1261
            ],
            [
                1261,
                1347
            ],
            [
                1347,
                1539
            ],
            [
                1539,
                1614
            ],
            [
                1614,
                1734
            ],
            [
                1734,
                1865
            ],
            [
                1865,
                1921
            ],
            [
                1921,
                2253
            ],
            [
                2253,
                2405
            ],
            [
                2405,
                2592
            ],
            [
                2592,
                2679
            ],
            [
                2679,
                2782
            ],
            [
                2782,
                2894
            ],
            [
                2894,
                3002
            ],
            [
                3002,
                3094
            ],
            [
                3094,
                3334
            ],
            [
                3334,
                3507
            ],
            [
                3507,
                3729
            ],
            [
                3729,
                3893
            ],
            [
                3893,
                4107
            ],
            [
                4107,
                4541
            ],
            [
                4541,
                4641
            ],
            [
                4641,
                4717
            ],
            [
                4717,
                4851
            ],
            [
                4851,
                5000
            ],
            [
                5000,
                5066
            ],
            [
                5066,
                5219
            ],
            [
                5219,
                5278
            ],
            [
                5278,
                5444
            ],
            [
                5444,
                5487
            ],
            [
                5487,
                5665
            ],
            [
                5665,
                5787
            ],
            [
                5787,
                5915
            ],
            [
                5915,
                6016
            ],
            [
                6016,
                6059
            ],
            [
                6059,
                6142
            ],
            [
                6142,
                6289
            ],
            [
                6289,
                6433
            ],
            [
                6433,
                6500
            ],
            [
                6500,
                6560
            ],
            [
                6560,
                6653
            ],
            [
                6653,
                6669
            ],
            [
                6669,
                6773
            ],
            [
                6773,
                6859
            ],
            [
                6859,
                6986
            ],
            [
                6986,
                7139
            ],
            [
                7139,
                7312
            ],
            [
                7312,
                7419
            ],
            [
                7419,
                7463
            ],
            [
                7463,
                7484
            ],
            [
                7484,
                7647
            ],
            [
                7647,
                7679
            ],
            [
                7679,
                7953
            ],
            [
                7953,
                8097
            ],
            [
                8097,
                8323
            ],
            [
                8323,
                8386
            ],
            [
                8386,
                8477
            ],
            [
                8477,
                8533
            ],
            [
                8533,
                8650
            ],
            [
                8650,
                8678
            ],
            [
                8678,
                8860
            ],
            [
                8860,
                8969
            ],
            [
                8969,
                9000
            ],
            [
                9000,
                9049
            ],
            [
                9049,
                9161
            ],
            [
                9161,
                9392
            ],
            [
                9392,
                9445
            ],
            [
                9445,
                9461
            ],
            [
                9461,
                9586
            ],
            [
                9586,
                9926
            ],
            [
                9926,
                10113
            ],
            [
                10113,
                10209
            ],
            [
                10209,
                10321
            ],
            [
                10321,
                10478
            ],
            [
                10478,
                10641
            ],
            [
                10641,
                10712
            ],
            [
                10712,
                10797
            ],
            [
                10797,
                10872
            ],
            [
                10872,
                10987
            ],
            [
                10987,
                11070
            ],
            [
                11070,
                11140
            ],
            [
                11140,
                11168
            ],
            [
                11168,
                11299
            ],
            [
                11299,
                11440
            ],
            [
                11440,
                11643
            ],
            [
                11643,
                11778
            ],
            [
                11778,
                11851
            ],
            [
                11851,
                11983
            ],
            [
                11983,
                12121
            ],
            [
                12121,
                12197
            ],
            [
                12197,
                12210
            ],
            [
                12210,
                12290
            ],
            [
                12290,
                12297
            ],
            [
                12297,
                12321
            ],
            [
                12321,
                12406
            ],
            [
                12406,
                12421
            ],
            [
                12421,
                12455
            ],
            [
                12455,
                12511
            ],
            [
                12511,
                12649
            ],
            [
                12649,
                12788
            ],
            [
                12788,
                12858
            ],
            [
                12858,
                13002
            ],
            [
                13002,
                13108
            ],
            [
                13108,
                13154
            ],
            [
                13154,
                13229
            ]
        ],
        "overlap_chars": [
            [
                0,
                27
            ],
            [
                27,
                47
            ],
            [
                48,
                61
            ],
            [
                61,
                107
            ],
            [
                121,
                123
            ],
            [
                123,
                133
            ],
            [
                134,
                151
            ],
            [
                152,
                168
            ],
            [
                174,
                187
            ],
            [
                187,
                192
            ],
            [
                193,
                233
            ],
            [
                233,
                234
            ],
            [
                235,
                237
            ],
            [
                242,
                281
            ],
            [
                282,
                293
            ],
            [
                299,
                308
            ],
            [
                309,
                368
            ],
            [
                368,
                414
            ],
            [
                419,
                473
            ],
            [
                473,
                474
            ],
            [
                475,
                553
            ],
            [
                554,
                557
            ],
            [
                558,
                584
            ],
            [
                594,
                645
            ],
            [
                649,
                651
            ],
            [
                651,
                662
            ],
            [
                668,
                686
            ],
            [
                687,
                690
            ],
            [
                691,
                701
            ],
            [
                704,
                734
            ],
            [
                741,
                743
            ],
            [
                743,
                749
            ],
            [
                757,
                804
            ],
            [
                804,
                825
            ],
            [
                826,
                836
            ],
            [
                844,
                900
            ],
            [
                900,
                902
            ],
            [
                907,
                913
            ],
            [
                914,
                917
            ],
            [
                918,
                930
            ],
            [
                931,
                984
            ],
            [
                985,
                1032
            ],
            [
                1032,
                1066
            ],
            [
                1066,
                1077
            ],
            [
                1078,
                1121
            ],
            [
                1121,
                1140
            ],
            [
                1141,
                1142
            ],
            [
                1143,
                1148
            ],
            [
                1153,
                1166
            ],
            [
                1167,
                1261
            ],
            [
                1261,
                1318
            ],
            [
                1319,
                1329
            ],
            [
                1337,
                1347
            ],
            [
                1347,
                1406
            ],
            [
                1407,
                1445
            ],
            [
                1446,
                1485
            ],
            [
                1486,
                1526
            ],
            [
                1527,
                1539
            ],
            [
                1539,
                1564
            ],
            [
                1565,
                1614
            ],
            [
                1614,
                1734
            ],
            [
                1734,
                1785
            ],
            [
                1787,
                1852
            ],
            [
                1855,
                1865
            ],
            [
                1865,
                1895
            ],
            [
                1898,
                1911
            ],
            [
                1913,
                1918
            ],
            [
                1930,
                2247
            ],
            [
                2251,
                2253
            ],
            [
                2253,
                2339
            ],
            [
                2340,
                2403
            ],
            [
                2403,
                2404
            ],
            [
                2405,
                2432
            ],
            [
                2432,
                2510
            ],
            [
                2511,
                2529
            ],
            [
                2535,
                2547
            ],
            [
                2548,
                2553
            ],
            [
                2554,
                2557
            ],
            [
                2558,
                2580
            ],
            [
                2581,
                2592
            ],
            [
                2592,
                2625
            ],
            [
                2626,
                2631
            ],
            [
                2632,
                2635
            ],
            [
                2636,
                2663
            ],
            [
                2664,
                2677
            ],
            [
                2683,
                2782
            ],
            [
                2782,
                2829
            ],
            [
                2830,
                2834
            ],
            [
                2848,
                2851
            ],
            [
                2852,
                2859
            ],
            [
                2871,
                2894
            ],
            [
                2894,
                2896
            ],
            [
                2897,
                2922
            ],
            [
                2923,
                2931
            ],
            [
                2931,
                2933
            ],
            [
                2934,
                2966
            ],
            [
                2970,
                2988
            ],
            [
                2989,
                2992
            ],
            [
                3000,
                3002
            ],
            [
                3002,
                3034
            ],
            [
                3035,
                3039
            ],
            [
                3040,
                3050
            ],
            [
                3051,
                3082
            ],
            [
                3092,
                3094
            ],
            [
                3094,
                3162
            ],
            [
                3163,
                3291
            ],
            [
                3292,
                3333
            ],
            [
                3334,
                3389
            ],
            [
                3390,
                3426
            ],
            [
                3427,
                3474
            ],
            [
                3475,
                3507
            ],
            [
                3507,
                3580
            ],
            [
                3586,
                3590
            ],
            [
                3591,
                3615
            ],
            [
                3616,
                3620
            ],
            [
                3621,
                3639
            ],
            [
                3640,
                3685
            ],
            [
                3686,
                3687
            ],
            [
                3688,
                3705
            ],
            [
                3712,
                3727
            ],
            [
                3732,
                3739
            ],
            [
                3744,
                3759
            ],
            [
                3760,
                3761
            ],
            [
                3762,
                3792
            ],
            [
                3793,
                3804
            ],
            [
                3805,
                3811
            ],
            [
                3812,
                3872
            ],
            [
                3873,
                3893
            ],
            [
                3893,
                4026
            ],
            [
                4027,
                4059
            ],
            [
                4072,
                4107
            ],
            [
                4107,
                4134
            ],
            [
                4139,
                4181
            ],
            [
                4181,
                4182
            ],
            [
                4189,
                4201
            ],
            [
                4222,
                4294
            ],
            [
                4295,
                4380
            ],
            [
                4381,
                4408
            ],
            [
                4411,
                4450
            ],
            [
                4450,
                4516
            ],
            [
                4522,
                4524
            ],
            [
                4525,
                4532
            ],
            [
                4535,
                4539
            ],
            [
                4539,
                4541
            ],
            [
                4542,
                4545
            ],
            [
                4546,
                4594
            ],
            [
                4595,
                4641
            ],
            [
                4641,
                4645
            ],
            [
                4646,
                4691
            ],
            [
                4692,
                4717
            ],
            [
                4717,
                4768
            ],
            [
                4769,
                4774
            ],
            [
                4775,
                4797
            ],
            [
                4798,
                4810
            ],
            [
                4811,
                4849
            ],
            [
                4851,
                4902
            ],
            [
                4905,
                4943
            ],
            [
                4946,
                4951
            ],
            [
                4962,
                5000
            ],
            [
                5000,
                5042
            ],
            [
                5050,
                5057
            ],
            [
                5060,
                5064
            ],
            [
                5066,
                5139
            ],
            [
                5140,
                5219
            ],
            [
                5219,
                5275
            ],
            [
                5279,
                5295
            ],
            [
                5298,
                5362
            ],
            [
                5363,
                5372
            ],
            [
                5373,
                5416
            ],
            [
                5417,
                5444
            ],
            [
                5445,
                5487
            ],
            [
                5487,
                5530
            ],
            [
                5537,
                5583
            ],
            [
                5594,
                5665
            ],
            [
                5665,
                5730
            ],
            [
                5731,
                5745
            ],
            [
                5748,
                5787
            ],
            [
                5787,
                5826
            ],
            [
                5837,
                5865
            ],
            [
                5866,
                5915
            ],
            [
                5915,
                5954
            ],
            [
                5957,
                5971
            ],
            [
                5972,
                6016
            ],
            [
                6017,
                6056
            ],
            [
                6059,
                6101
            ],
            [
                6101,
                6142
            ],
            [
                6142,
                6145
            ],
            [
                6155,
                6173
            ],
            [
                6178,
                6196
            ],
            [
                6201,
                6231
            ],
            [
                6232,
                6245
            ],
            [
                6246,
                6250
            ],
            [
                6251,
                6266
            ],
            [
                6275,
                6289
            ],
            [
                6290,
                6315
            ],
            [
                6318,
                6333
            ],
            [
                6335,
                6343
            ],
            [
                6350,
                6413
            ],
            [
                6418,
                6430
            ],
            [
                6434,
                6444
            ],
            [
                6450,
                6500
            ],
            [
                6512,
                6522
            ],
            [
                6533,
                6535
            ],
            [
                6544,
                6557
            ],
            [
                6561,
                6650
            ],
            [
                6653,
                6669
            ],
            [
                6675,
                6687
            ],
            [
                6688,
                6705
            ],
            [
                6713,
                6716
            ],
            [
                6737,
                6773
            ],
            [
                6773,
                6859
            ],
            [
                6859,
                6930
            ],
            [
                6942,
                6963
            ],
            [
                6964,
                6986
            ],
            [
                6990,
                7114
            ],
            [
                7115,
                7136
            ],
            [
                7140,
                7200
            ],
            [
                7205,
                7220
            ],
            [
                7231,
                7232
            ],
            [
                7237,
                7238
            ],
            [
                7240,
                7287
            ],
            [
                7304,
                7309
            ],
            [
                7313,
                7351
            ],
            [
                7352,
                7355
            ],
            [
                7361,
                7375
            ],
            [
                7376,
                7386
            ],
            [
                7387,
                7401
            ],
            [
                7404,
                7419
            ],
            [
                7420,
                7463
            ],
            [
                7463,
                7466
            ],
            [
                7473,
                7484
            ],
            [
                7484,
                7503
            ],
            [
                7506,
                7522
            ],
            [
                7523,
                7541
            ],
            [
                7544,
                7647
            ],
            [
                7647,
                7664
            ],
            [
                7666,
                7679
            ],
            [
                7679,
                7682
            ],
            [
                7683,
                7729
            ],
            [
                7733,
                7754
            ],
            [
                7755,
                7782
            ],
            [
                7793,
                7832
            ],
            [
                7832,
                7833
            ],
            [
                7833,
                7836
            ],
            [
                7840,
                7845
            ],
            [
                7846,
                7851
            ],
            [
                7852,
                7861
            ],
            [
                7874,
                7886
            ],
            [
                7892,
                7953
            ],
            [
                7953,
                7977
            ],
            [
                7978,
                7989
            ],
            [
                7990,
                8023
            ],
            [
                8024,
                8034
            ],
            [
                8035,
                8040
            ],
            [
                8047,
                8070
            ],
            [
                8070,
                8071
            ],
            [
                8076,
                8080
            ],
            [
                8081,
                8097
            ],
            [
                8097,
                8101
            ],
            [
                8106,
                8132
            ],
            [
                8137,
                8189
            ],
            [
                8190,
                8200
            ],
            [
                8201,
                8216
            ],
            [
                8217,
                8260
            ],
            [
                8261,
                8264
            ],
            [
                8265,
                8269
            ],
            [
                8270,
                8279
            ],
            [
                8280,
                8323
            ],
            [
                8323,
                8352
            ],
            [
                8357,
                8384
            ],
            [
                8386,
                8389
            ],
            [
                8389,
                8452
            ],
            [
                8453,
                8474
            ],
            [
                8477,
                8503
            ],
            [
                8504,
                8531
            ],
            [
                8531,
                8533
            ],
            [
                8534,
                8615
            ],
            [
                8619,
                8650
            ],
            [
                8655,
                8659
            ],
            [
                8665,
                8678
            ],
            [
                8683,
                8688
            ],
            [
                8691,
                8707
            ],
            [
                8708,
                8711
            ],
            [
                8712,
                8717
            ],
            [
                8718,
                8833
            ],
            [
                8834,
                8860
            ],
            [
                8860,
                8881
            ],
            [
                8887,
                8891
            ],
            [
                8903,
                8925
            ],
            [
                8942,
                8947
            ],
            [
                8952,
                8969
            ],
            [
                8969,
                8998
            ],
            [
                9000,
                9025
            ],
            [
                9025,
                9049
            ],
            [
                9049,
                9161
            ],
            [
                9161,
                9281
            ],
            [
                9282,
                9291
            ],
            [
                9298,
                9389
            ],
            [
                9407,
                9442
            ],
            [
                9445,
                9460
            ],
            [
                9462,
                9474
            ],
            [
                9485,
                9488
            ],
            [
                9489,
                9493
            ],
            [
                9494,
                9509
            ],
            [
                9509,
                9514
            ],
            [
                9515,
                9529
            ],
            [
                9530,
                9532
            ],
            [
                9533,
                9539
            ],
            [
                9540,
                9586
            ],
            [
                9586,
                9678
            ],
            [
                9679,
                9750
            ],
            [
                9760,
                9763
            ],
            [
                9778,
                9781
            ],
            [
                9790,
                9873
            ],
            [
                9883,
                9912
            ],
            [
                9916,
                9923
            ],
            [
                9927,
                10072
            ],
            [
                10075,
                10088
            ],
            [
                10089,
                10113
            ],
            [
                10114,
                10145
            ],
            [
                10148,
                10155
            ],
            [
                10156,
                10164
            ],
            [
                10174,
                10183
            ],
            [
                10184,
                10187
            ],
            [
                10188,
                10207
            ],
            [
                10207,
                10209
            ],
            [
                10209,
                10212
            ],
            [
                10213,
                10274
            ],
            [
                10275,
                10281
            ],
            [
                10282,
                10288
            ],
            [
                10288,
                10293
            ],
            [
                10299,
                10301
            ],
            [
                10309,
                10319
            ],
            [
                10319,
                10321
            ],
            [
                10321,
                10334
            ],
            [
                10346,
                10478
            ],
            [
                10478,
                10495
            ],
            [
                10501,
                10617
            ],
            [
                10621,
                10624
            ],
            [
                10625,
                10641
            ],
            [
                10645,
                10712
            ],
            [
                10712,
                10797
            ],
            [
                10797,
                10841
            ],
            [
                10842,
                10848
            ],
            [
                10849,
                10857
            ],
            [
                10858,
                10872
            ],
            [
                10872,
                10879
            ],
            [
                10883,
                10961
            ],
            [
                10967,
                10985
            ],
            [
                10987,
                10990
            ],
            [
                10998,
                11004
            ],
            [
                11009,
                11070
            ],
            [
                11070,
                11097
            ],
            [
                11104,
                11109
            ],
            [
                11110,
                11112
            ],
            [
                11119,
                11140
            ],
            [
                11140,
                11168
            ],
            [
                11168,
                11231
            ],
            [
                11232,
                11262
            ],
            [
                11263,
                11299
            ],
            [
                11299,
                11331
            ],
            [
                11332,
                11335
            ],
            [
                11336,
                11368
            ],
            [
                11371,
                11433
            ],
            [
                11444,
                11498
            ],
            [
                11505,
                11511
            ],
            [
                11518,
                11604
            ],
            [
                11605,
                11643
            ],
            [
                11643,
                11674
            ],
            [
                11675,
                11775
            ],
            [
                11779,
                11791
            ],
            [
                11796,
                11829
            ],
            [
                11832,
                11851
            ],
            [
                11856,
                11922
            ],
            [
                11923,
                11951
            ],
            [
                11952,
                11980
            ],
            [
                11989,
                11996
            ],
            [
                11996,
                11997
            ],
            [
                11998,
                12007
            ],
            [
                12007,
                12008
            ],
            [
                12009,
                12019
            ],
            [
                12020,
                12025
            ],
            [
                12026,
                12050
            ],
            [
                12068,
                12100
            ],
            [
                12109,
                12113
            ],
            [
                12114,
                12121
            ],
            [
                12121,
                12197
            ],
            [
                12197,
                12210
            ],
            [
                12210,
                12287
            ],
            [
                12291,
                12297
            ],
            [
                12297,
                12321
            ],
            [
                12321,
                12403
            ],
            [
                12407,
                12418
            ],
            [
                12421,
                12455
            ],
            [
                12456,
                12470
            ],
            [
                12482,
                12491
            ],
            [
                12492,
                12506
            ],
            [
                12509,
                12511
            ],
            [
                12511,
                12548
            ],
            [
                12549,
                12559
            ],
            [
                12560,
                12603
            ],
            [
                12604,
                12646
            ],
            [
                12649,
                12671
            ],
            [
                12672,
                12677
            ],
            [
                12677,
                12721
            ],
            [
                12722,
                12724
            ],
            [
                12734,
                12788
            ],
            [
                12788,
                12798
            ],
            [
                12799,
                12858
            ],
            [
                12858,
                12926
            ],
            [
                12927,
                12986
            ],
            [
                12991,
                13001
            ],
            [
                13002,
                13023
            ],
            [
                13023,
                13106
            ],
            [
                13109,
                13154
            ],
            [
                13154,
                13227
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                61
            ],
            [
                61,
                123
            ],
            [
                123,
                368
            ],
            [
                368,
                475
            ],
            [
                475,
                651
            ],
            [
                651,
                743
            ],
            [
                743,
                804
            ],
            [
                804,
                900
            ],
            [
                900,
                1032
            ],
            [
                1032,
                1121
            ],
            [
                1121,
                1261
            ],
            [
                1261,
                1347
            ],
            [
                1347,
                1539
            ],
            [
                1539,
                1614
            ],
            [
                1614,
                1734
            ],
            [
                1734,
                1865
            ],
            [
                1865,
                1921
            ],
            [
                1921,
                1921
            ],
            [
                1921,
                2253
            ],
            [
                2253,
                2405
            ],
            [
                2405,
                2592
            ],
            [
                2592,
                2782
            ],
            [
                2782,
                2894
            ],
            [
                2894,
                3002
            ],
            [
                3002,
                3094
            ],
            [
                3094,
                3334
            ],
            [
                3334,
                3334
            ],
            [
                3334,
                3507
            ],
            [
                3507,
                3893
            ],
            [
                3893,
                4107
            ],
            [
                4107,
                4541
            ],
            [
                4541,
                4641
            ],
            [
                4641,
                4717
            ],
            [
                4717,
                4851
            ],
            [
                4851,
                4851
            ],
            [
                4851,
                4851
            ],
            [
                4851,
                4851
            ],
            [
                4851,
                4851
            ],
            [
                4851,
                4851
            ],
            [
                4851,
                5000
            ],
            [
                5000,
                5219
            ],
            [
                5219,
                5278
            ],
            [
                5278,
                5444
            ],
            [
                5444,
                5487
            ],
            [
                5487,
                5665
            ],
            [
                5665,
                5787
            ],
            [
                5787,
                5915
            ],
            [
                5915,
                6016
            ],
            [
                6016,
                6059
            ],
            [
                6059,
                6142
            ],
            [
                6142,
                6289
            ],
            [
                6289,
                6433
            ],
            [
                6433,
                6500
            ],
            [
                6500,
                6560
            ],
            [
                6560,
                6653
            ],
            [
                6653,
                6669
            ],
            [
                6669,
                6773
            ],
            [
                6773,
                6859
            ],
            [
                6859,
                6986
            ],
            [
                6986,
                6986
            ],
            [
                6986,
                7139
            ],
            [
                7139,
                7312
            ],
            [
                7312,
                7312
            ],
            [
                7312,
                7312
            ],
            [
                7312,
                7312
            ],
            [
                7312,
                7419
            ],
            [
                7419,
                7463
            ],
            [
                7463,
                7484
            ],
            [
                7484,
                7647
            ],
            [
                7647,
                7679
            ],
            [
                7679,
                7679
            ],
            [
                7679,
                7953
            ],
            [
                7953,
                8097
            ],
            [
                8097,
                8323
            ],
            [
                8323,
                8386
            ],
            [
                8386,
                8477
            ],
            [
                8477,
                8533
            ],
            [
                8533,
                8650
            ],
            [
                8650,
                8678
            ],
            [
                8678,
                8860
            ],
            [
                8860,
                8969
            ],
            [
                8969,
                9049
            ],
            [
                9049,
                9161
            ],
            [
                9161,
                9392
            ],
            [
                9392,
                9445
            ],
            [
                9445,
                9461
            ],
            [
                9461,
                9586
            ],
            [
                9586,
                9926
            ],
            [
                9926,
                10113
            ],
            [
                10113,
                10209
            ],
            [
                10209,
                10321
            ],
            [
                10321,
                10321
            ],
            [
                10321,
                10478
            ],
            [
                10478,
                10641
            ],
            [
                10641,
                10641
            ],
            [
                10641,
                10712
            ],
            [
                10712,
                10797
            ],
            [
                10797,
                10872
            ],
            [
                10872,
                10987
            ],
            [
                10987,
                11070
            ],
            [
                11070,
                11140
            ],
            [
                11140,
                11168
            ],
            [
                11168,
                11299
            ],
            [
                11299,
                11643
            ],
            [
                11643,
                11778
            ],
            [
                11778,
                11851
            ],
            [
                11851,
                11983
            ],
            [
                11983,
                12121
            ],
            [
                12121,
                12197
            ],
            [
                12197,
                12210
            ],
            [
                12210,
                12210
            ],
            [
                12210,
                12290
            ],
            [
                12290,
                12297
            ],
            [
                12297,
                12321
            ],
            [
                12321,
                12321
            ],
            [
                12321,
                12406
            ],
            [
                12406,
                12421
            ],
            [
                12421,
                12455
            ],
            [
                12455,
                12511
            ],
            [
                12511,
                12649
            ],
            [
                12649,
                12649
            ],
            [
                12649,
                12788
            ],
            [
                12788,
                12858
            ],
            [
                12858,
                13002
            ],
            [
                13002,
                13108
            ],
            [
                13108,
                13154
            ],
            [
                13154,
                13229
            ]
        ]
    }
}